
Функция УстановитьЗапрещенныеПрайсЛистыПодазделений(ПрайсЛист, МассивЗапрещенныхПодразделений)Экспорт 
	Результат = Истина;
	НачатьТранзакцию();
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения");
	ЭлементБлокировки.УстановитьЗначение("ПрайсЛист", ПрайсЛист);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовЗапрещенныеПодразделения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрайсЛист.Установить(ПрайсЛист);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого ЭлементМассива ИЗ МассивЗапрещенныхПодразделений Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПрайсЛист = ПрайсЛист;
		НоваяЗапись.ПодразделениеКомпании = ЭлементМассива;
	КонецЦикла;	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		ОтменитьТранзакцию();
		Возврат Результат;
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	Возврат Результат;
КонецФункции //УстановитьЗапрещенныеПрайсЛистыПодазделений()	