
/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЕЙСТВИЙ

// Процедура выполняет доступное действие
//
// Параметры:
//	Номер			- Число		- Номер действия (соответветствует значению параметра EvenType,
//									которое возвращает панель управления при выборе действия
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпВыполнитьДоступноеДействие(Номер, СтруктураЗвонка) Экспорт
	
	МассивДоступныхДействий	= сфпСофтФонПроСерверПереопределяемый.сфпПолучитьМассивДоступныхДействий();
	ЭлементМассива = МассивДоступныхДействий[Номер];
	
	Попытка
		Выполнить("" + ЭлементМассива.Действие + "(СтруктураЗвонка)");
	Исключение КонецПопытки;

КонецПроцедуры // сфпВыполнитьДоступноеДействие()

// Процедура выполняет автоматическое действие
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//  ОткрыватьЗвонок	- Булево	- Нужно ли открывать форму звонка, если настройка на действие не задана
//
Процедура сфпВыполнитьАвтоматическоеДействие(СтруктураЗвонка, ОткрыватьЗвонок = Ложь) Экспорт
	Если СтруктураЗвонка.ВходящийЗвонок Тогда
		НаименованиеДействия	= сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпДействиеПриВходящемЗвонке");	
	Иначе	
		НаименованиеДействия	= сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпДействиеПриИсходящемЗвонке");	
	КонецЕсли;
	МассивАвтоматическихДействий = сфпСофтФонПроСерверПереопределяемый.сфпПолучитьМассивДоступныхДействий();
	Для Каждого ЭлементМассива Из МассивАвтоматическихДействий Цикл
		Если ЭлементМассива.Наименование = НаименованиеДействия Тогда
			Если НЕ ПустаяСтрока(ЭлементМассива.Действие) Тогда
				Попытка
					Выполнить("" + ЭлементМассива.Действие + "(СтруктураЗвонка)");
				Исключение
				КонецПопытки;	
			Иначе
				// в настройках стоит "нет действий", проверим, что это команда панели и откроем звонок
				Если ОткрыватьЗвонок Тогда
					Попытка
						сфпОткрытьТелефонныйЗвонок(СтруктураЗвонка);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры // сфпВыполнитьАвтоматическоеДействие()

// Процедура выполняет открытие формы общих настроек СофтФон
//
// Параметры:
//	Нет.
//
Процедура сфпОбщиеНастройкиСофтФон() Экспорт
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("ОбщаяФорма.сфпОбщиеНастройки", ПараметрыФормы);

КонецПроцедуры

// Процедура выполняет открытие формы персональных настроек СофтФон
//
// Параметры:
//	Нет.
//
Процедура сфпПерсональныеНастройкиСофтФон() Экспорт
	
	//+АА
	//ПараметрыФормы = Новый Структура("Пользователь", сфпСофтФонПроСервер.сфпТекущийПользователь());
	//ОткрытьФорму("ОбщаяФорма.сфпПерсональныеНастройки", ПараметрыФормы);
	//-АА

КонецПроцедуры

// Процедура выполняет открытие формы списка документов "Телефонный звонок"
//
// Параметры:
//	Нет.
//
Процедура сфпТелефонныеЗвонки() Экспорт
	
	ИмяФормыСпискаДокументовТелефонныйЗвонок = сфпСофтФонПроСервер.сфпИмяФормыСпискаДокументовТелефонныйЗвонок();
	Если ЗначениеЗаполнено(ИмяФормыСпискаДокументовТелефонныйЗвонок) Тогда
		ПараметрыФормы = Новый Структура();
		ОткрытьФорму(ИмяФормыСпискаДокументовТелефонныйЗвонок, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает ссылку на объект формы, в зависимости от режима запуска
//
// Параметры:
//	ФормаОбъекта	- Форма	- Форма объекта
//
// Возвращаемое значение:
//	Объект	- Ссылка на объект формы
//
Функция сфпПолучитьОбъектФормы(ФормаОбъекта) Экспорт
	
	Попытка    ОбъектФормы = ФормаОбъекта.Объект;
	Исключение ОбъектФормы = ФормаОбъекта.ЭтотОбъект;
	КонецПопытки;
	
	Возврат ОбъектФормы;

КонецФункции	


/////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ИНИЦИАЛИЗАЦИИ ФОРМ ОБЪЕКТОВ

// +АА

// Функция создает и заполняет форму документа "Событие"
//
// Параметры:
//	СтруктураЗвонка		- Структура	- Структура данных звонка
//	ДанныеЗаполнения	- Структура	- Структура данных для заполнения документа
//
Функция АА_сфпИнициализироватьФормуСобытия(СтруктураЗвонка, ДанныеЗаполнения)
	
	ИмяФормы = "Документ.Событие.ФормаОбъекта";		
	ФормаСобытия = ПолучитьФорму(ИмяФормы,,,СтруктураЗвонка.hCall);
	ФормаСобытия.ЭтотОбъект["сфпИдентификаторЗвонка"]	= СтруктураЗвонка.hCall;
	ФормаСобытия.ЭтотОбъект["Дата"]						= сфпСофтФонПроСервер.сфпТекущаяДата();
	ФормаСобытия.ЭтотОбъект["ДатаНачала"]				= ФормаСобытия.ЭтотОбъект["Дата"];
	ФормаСобытия.ЭтотОбъект["ДатаОкончания"]			= ФормаСобытия.ЭтотОбъект["Дата"];
	ФормаСобытия.ЭтотОбъект["Автор"]					= сфпСофтФонПроСервер.сфпТекущийПользователь();
	ФормаСобытия.ЭтотОбъект["Менеджер"]					= ФормаСобытия.ЭтотОбъект["Автор"].Сотрудник;
	ФормаСобытия.ЭтотОбъект["Тема"]						= НСтр("ru='#Создан автоматически средствами СофтФон'");
	ФормаСобытия.ЭтотОбъект["ОригинальныйТелефонныйНомер"]	= СтруктураЗвонка.НомерТелефона;
	ФормаСобытия.ЭтотОбъект["НомерТелефона"]				= СтруктураЗвонка.НомерТелефона;
	ФормаСобытия.ЭтотОбъект["ПредставлениеТелефона"]		= СтруктураЗвонка.НомерТелефона;	
	
	Если ЗначениеЗаполнено(СтруктураЗвонка.НовыйЗвонок) Тогда
		ФормаСобытия.ЭтотОбъект["ДокументОснование"]	= СтруктураЗвонка.НовыйЗвонок;
	КонецЕсли;
		
	Если СтруктураЗвонка.ВходящийЗвонок Тогда
		ИмяПредопределенногоЗначения =  Нстр("ru ='Перечисление.ТипыСообщений.Входящее'");
		ФормаСобытия.ЭтотОбъект["ТипСообщения"] = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
	Иначе	
		ИмяПредопределенногоЗначения =  Нстр("ru ='Перечисление.ТипыСообщений.Исходящее'");		
		ФормаСобытия.ЭтотОбъект["ТипСообщения"] = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);
	КонецЕсли;	
	
	ИмяПредопределенногоЗначения =  Нстр("ru ='Перечисление.СостоянияСобытий.Запланировано'");		
	ФормаСобытия.ЭтотОбъект["Состояние"] = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);	
	ИмяПредопределенногоЗначения =  Нстр("ru ='Перечисление.ВидыСобытий.ТелефонныйЗвонок'");		
	ФормаСобытия.ЭтотОбъект["ВидСобытия"] = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);		
	ИмяПредопределенногоЗначения =  Нстр("ru ='Перечисление.Важность.Средняя'");		
	ФормаСобытия.ЭтотОбъект["Приоритет"] = ПредопределенноеЗначение(ИмяПредопределенногоЗначения);			
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если НЕ (СтруктураЗвонка.МассивЗвонящих = Неопределено) Тогда
			Если СтруктураЗвонка.МассивЗвонящих.Количество() = 1 Тогда
				СтруктураЗвонка.Контакт	= СтруктураЗвонка.МассивЗвонящих[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		НовыйУчастник	= ФормаСобытия.ЭтотОбъект["СторонниеЛица"].Добавить();		
		
		Контакт = Неопределено;
		Если ТипЗнч(СтруктураЗвонка.Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			Контакт = СтруктураЗвонка.Контакт;
		КонецЕсли;
		
		Если НЕ ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты")
			И ЗначениеЗаполнено(СтруктураЗвонка.НовыйЗвонок) Тогда
			
			Попытка
				Контакт = СтруктураЗвонка.НовыйЗвонок.АбонентКонтакт;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			Ведущий = РаботаСКонтактнымиЛицами.ПолучитьВедущегоКонтрагента(Контакт);			
			Если ЗначениеЗаполнено(Ведущий) Тогда
				ФормаСобытия.ЭтотОбъект["Контрагент"] 		= Ведущий;
				ФормаСобытия.ЭтотОбъект["КонтактноеЛицо"]	= Контакт;
				НовыйУчастник["Контрагент"]					= Ведущий;
				НовыйУчастник["КонтактноеЛицо"]             = Контакт;
			Иначе
				ФормаСобытия.ЭтотОбъект["Контрагент"]		= Контакт;
				ФормаСобытия.ЭтотОбъект["КонтактноеЛицо"]	= Справочники.Контрагенты.ПустаяСсылка();
				НовыйУчастник["Контрагент"]					= Контакт;
			КонецЕсли;
		КонецЕсли;
		Если Найти(Строка(СтруктураЗвонка.Контакт), НСтр("ru = '<Объект не найден>'")) > 0 Тогда
			ФормаСобытия.ЭтотОбъект["Содержание"]	= ФормаСобытия.ЭтотОбъект["Содержание"] + Символы.ПС + Символы.ПС + Строка(ТипЗнч(СтруктураЗвонка.Контакт)) + ": "
					+ сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(СтруктураЗвонка.Контакт) + НСтр("ru = ', номер: '") 
					+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона)
					+ Символы.ПС + НСтр("ru='К данному абоненту в доступе отказано.'")
					+ НСтр("ru=' Для разрешения работы с абонентом обратитесь к руководителю или администратору.'");
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);	
	Возврат ФормаСобытия;	
	
КонецФункции	//	АА_сфпИнициализироватьФормуСобытия()
// -АА

// Функция создает и заполняет форму документа "Событие"
//
// Параметры:
//	СтруктураЗвонка		- Структура	- Структура данных звонка
//	ДанныеЗаполнения	- Структура	- Структура данных для заполнения документа
//
Функция сфпИнициализироватьФормуСобытия(СтруктураЗвонка, ДанныеЗаполнения)
	
	// +АА
	Возврат АА_сфпИнициализироватьФормуСобытия(СтруктураЗвонка, ДанныеЗаполнения);
	// -АА
	
	ИмяФормы = "Документ.Событие.ФормаОбъекта";		
	ФормаСобытия = ПолучитьФорму(ИмяФормы,,,СтруктураЗвонка.hCall);
	
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаСобытия);
	ОбъектФормы["Дата"] = сфпСофтФонПроСервер.сфпТекущаяДата();
	ОбъектФормы["Ответственный"] = ТекПользователь;
	ОбъектФормы["НачалоСобытия"] = ОбъектФормы["Дата"];
	ОбъектФормы["ОкончаниеСобытия"]	= ОбъектФормы["Дата"];
		
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Автор") Тогда
		ОбъектФормы["Автор"] = ТекПользователь;
	КонецЕсли;
	
	ИмяПеречисления = "СостоянияСобытий";
	Состояние = ПредопределенноеЗначение("Перечисление." + ИмяПеречисления + ".Завершено");
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Состояние") Тогда
		ОбъектФормы["Состояние"] = Состояние;

	ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Состояние") Тогда
		ОбъектФормы["СостояниеСобытия"] = Состояние;	
	КонецЕсли;	

	ИмяПеречисления = "ВходящееИсходящееСобытие";
	Если СтруктураЗвонка.ВходящийЗвонок Тогда
		  ВходящееИсходящееСобытие = ПредопределенноеЗначение("Перечисление." + ИмяПеречисления + ".Входящее");
	Иначе ВходящееИсходящееСобытие = ПредопределенноеЗначение("Перечисление." + ИмяПеречисления + ".Исходящее");
	КонецЕсли;
	
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "ВидСобытия") Тогда
		ИмяПеречисления = "ВидыСобытий";
		ОбъектФормы["ВидСобытия"] = ПредопределенноеЗначение("Перечисление." + ИмяПеречисления + ".ТелефонныйЗвонок");
		ОбъектФормы["ТипСобытия"] = ВходящееИсходящееСобытие;
		
	Иначе
		ИмяСправочника = "ТипыСобытий";
		ОбъектФормы["ТипСобытия"] = ПредопределенноеЗначение("Справочник." + ИмяСправочника + ".ТелефонныйЗвонок");
		ОбъектФормы["ВходящееИсходящееСобытие"] = ВходящееИсходящееСобытие;
	КонецЕсли;
	
	Тема = НСтр("ru='#Создан автоматически средствами СофтФон'");
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Тема") Тогда
		ОбъектФормы["Тема"] = Тема;

	ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "ОписаниеСобытия") Тогда
		ОбъектФормы["ОписаниеСобытия"] = Тема;	
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СтруктураЗвонка.НовыйЗвонок) Тогда
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "ДокументОснование") Тогда
			ОбъектФормы["ДокументОснование"] = СтруктураЗвонка.НовыйЗвонок;
			
		ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Основание") Тогда
			ОбъектФормы["Основание"] = СтруктураЗвонка.НовыйЗвонок;			
		КонецЕсли;	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если НЕ (СтруктураЗвонка.МассивЗвонящих = Неопределено) Тогда
			Если СтруктураЗвонка.МассивЗвонящих.Количество() = 1 Тогда
				СтруктураЗвонка.Контакт	= СтруктураЗвонка.МассивЗвонящих[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Содержание = "";
	
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
		НовыйУчастник = ОбъектФормы["Участники"].Добавить();
		
		УчастникКонтакт = НСтр("ru='!!!Не определен!!!'");
		
		Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
			ИмяМетаданныхКонтакта = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
			
			Если ИмяМетаданныхКонтакта = "Контрагенты" ИЛИ ИмяМетаданныхКонтакта = "КонтактныеЛица" Тогда
				УчастникКонтакт = СтруктураЗвонка.Контакт;

			ИначеЕсли Найти(Строка(СтруктураЗвонка.Контакт), НСтр("ru = '<Объект не найден>'")) > 0 Тогда
				Содержание = Содержание + Символы.ПС + Строка(ТипЗнч(СтруктураЗвонка.Контакт)) + ": "
					+ сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(СтруктураЗвонка.Контакт) + НСтр("ru = ', номер: '") 
					+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона)
					+ Символы.ПС + НСтр("ru='К данному абоненту в доступе отказано.'")
					+ НСтр("ru=' Для разрешения работы с абонентом обратитесь к руководителю или администратору.'");
			Иначе			
				УчастникКонтакт = "" + СтруктураЗвонка.Контакт;
			КонецЕсли;

		ИначеЕсли СтруктураЗвонка.ВнешнийЗвонок Тогда
			Если СтруктураЗвонка.МассивЗвонящих <> Неопределено И СтруктураЗвонка.МассивЗвонящих.Количество() > 0 Тогда
				Содержание = Содержание + Символы.ПС + НСтр("ru='Несколько совпадений номера: '") + СтруктураЗвонка.НомерТелефона;
				Для Каждого ЭлементМассива Из СтруктураЗвонка.МассивЗвонящих Цикл
					Содержание = Содержание + Символы.ПС + Строка(ТипЗнч(ЭлементМассива)) + ": " + сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ЭлементМассива);
					ВладелецКонтакта = сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(ЭлементМассива);
					Если НЕ (ВладелецКонтакта = Неопределено) Тогда
						Содержание = Содержание + " (" + сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ВладелецКонтакта) + ")";
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;

		ИначеЕсли НЕ ПустаяСтрока(СтруктураЗвонка.CalledInfoName) Тогда
			УчастникКонтакт = СтруктураЗвонка.CalledInfoName;
		КонецЕсли;

		НовыйУчастник["Контакт"] = УчастникКонтакт;
		НовыйУчастник["КакСвязаться"] = СтруктураЗвонка.НомерТелефона;

	Иначе
		ПредставлениеКонтакта = НСтр("ru='!!!Не определен!!!'");
		Контрагент = "";
		КонтактноеЛицо = "";

		Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
			ИмяМетаданныхКонтакта = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
			
			ПредставлениеКонтакта = "" + СтруктураЗвонка.Контакт;
			
			Если ИмяМетаданныхКонтакта = "Контрагенты" Тогда
				Контрагент = СтруктураЗвонка.Контакт;
							
			ИначеЕсли ИмяМетаданныхКонтакта = "КонтактныеЛица" Тогда
				КонтактноеЛицо = СтруктураЗвонка.Контакт;
				Контрагент = сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(СтруктураЗвонка.Контакт);
			КонецЕсли;
			
			Если Найти(Строка(СтруктураЗвонка.Контакт), НСтр("ru = '<Объект не найден>'")) > 0 Тогда
				Содержание = Строка(ТипЗнч(СтруктураЗвонка.Контакт)) + ": "
					+ сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(СтруктураЗвонка.Контакт) + НСтр("ru = ', номер: '") 
					+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона)
					+ Символы.ПС + НСтр("ru='К данному абоненту в доступе отказано.'")
					+ НСтр("ru=' Для разрешения работы с абонентом обратитесь к руководителю или администратору.'");
			КонецЕсли;
				
		ИначеЕсли СтруктураЗвонка.ВнешнийЗвонок Тогда
			Если СтруктураЗвонка.МассивЗвонящих = Неопределено ИЛИ СтруктураЗвонка.МассивЗвонящих.Количество() = 0 Тогда
				Если НЕ ПустаяСтрока(СтруктураЗвонка.CallerInfoName) И Найти(СтруктураЗвонка.CallerInfoName, СтруктураЗвонка.НомерТелефона) = 0 Тогда
					ПредставлениеКонтакта = СтруктураЗвонка.CallerInfoName;
				КонецЕсли;

			Иначе
				ПредставлениеКонтакта = НСтр("ru='Несколько совпадений номера: '") + СтруктураЗвонка.НомерТелефона;
				Содержание = ПредставлениеКонтакта;
				Для Каждого ЭлементМассива Из СтруктураЗвонка.МассивЗвонящих Цикл
					ПредставлениеКонтакта = ПредставлениеКонтакта + Символы.ПС + Строка(ТипЗнч(ЭлементМассива)) + ": " + сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ЭлементМассива);
					ВладелецКонтакта = сфпСофтФонПроСервер.сфпПолучитьВладельцаКонтакта(ЭлементМассива);
					Если ВладелецКонтакта <> Неопределено Тогда
						ПредставлениеКонтакта = ПредставлениеКонтакта + " (" + сфпСофтФонПроСервер.сфпПолучитьНаименованиеКонтакта(ВладелецКонтакта) + ")";
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;

		ИначеЕсли НЕ ПустаяСтрока(СтруктураЗвонка.CalledInfoName) Тогда
			ПредставлениеКонтакта = СтруктураЗвонка.CalledInfoName;
		КонецЕсли;
		
		ОбъектФормы["Контрагент"] = Контрагент;
		ОбъектФормы["КонтактноеЛицо"] = КонтактноеЛицо;

		Если сфпСофтФонПроСервер.сфпТабличнаяЧастьСуществует(ОбъектФормы.Ссылка, "Участники") Тогда
			ОбъектФормы["СписокУчастников"]	= ПредставлениеКонтакта;
			
			НовыйУчастник = ОбъектФормы["Участники"].Добавить();
			НовыйУчастник["ПредставлениеКонтакта"] = ПредставлениеКонтакта;
			НовыйУчастник["КакСвязаться"] = СтруктураЗвонка.НомерТелефона;
			НовыйУчастник["КонтактноеЛицо"] = КонтактноеЛицо;
		КонецЕсли;
	КонецЕсли;	
		
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Содержание") Тогда
		ОбъектФормы["Содержание"] = Содержание;
		
	ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "СодержаниеСобытия") Тогда
		ОбъектФормы["СодержаниеСобытия"] = Содержание;	
	КонецЕсли;	
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);	
	
	Возврат ФормаСобытия;	
	
КонецФункции	

// Функция создает и заполняет форму документа "Заказ покупателя"
//
// Параметры:
//	СтруктураЗвонка		- Структура	- Структура данных звонка
//	ДанныеЗаполнения	- Структура	- Структура данных для заполнения документа
//
Функция сфпИнициализироватьФормуЗаказаПокупателя(СтруктураЗвонка, ДанныеЗаполнения)

	ИмяФормы = "Документ.ЗаказПокупателя.ФормаОбъекта";		
	ФормаЗаказа = ПолучитьФорму(ИмяФормы,,,СтруктураЗвонка.hCall);	
	
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаЗаказа);
	ОбъектФормы["Дата"] = сфпСофтФонПроСервер.сфпТекущаяДата();	
	
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Ответственный") Тогда
		ОбъектФормы["Ответственный"] = ТекПользователь;
	КонецЕсли;
	
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Автор") Тогда
		ОбъектФормы["Автор"] = ТекПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ТипЗнч(СтруктураЗвонка.Контакт) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбъектФормы["Контрагент"] = СтруктураЗвонка.Контакт;
			
		Иначе
			ОбъектФормы["Комментарий"] = ОбъектФормы["Комментарий"] + ", " + Строка(ТипЗнч(СтруктураЗвонка.Контакт)) 
			+ ": " + Строка(СтруктураЗвонка.Контакт) + НСтр("ru=', номер: '") 
			+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона);			
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);	
	
	Возврат ФормаЗаказа;	
	
КонецФункции	

// Функция создает и заполняет форму документа "Заказ клиента"
//
// Параметры:
//	СтруктураЗвонка		- Структура	- Структура данных звонка
//	ДанныеЗаполнения	- Структура	- Структура данных для заполнения документа
//
Функция сфпИнициализироватьФормуЗаказаКлиента(СтруктураЗвонка, ДанныеЗаполнения)
	
	ИмяФормы = "Документ.ЗаказКлиента.ФормаОбъекта";		
	ФормаЗаказа = ПолучитьФорму(ИмяФормы,,, СтруктураЗвонка.hCall);		
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаЗаказа);
	ОбъектФормы["Дата"] = сфпСофтФонПроСервер.сфпТекущаяДата();
	ОбъектФормы["Автор"] = сфпСофтФонПроСервер.сфпТекущийПользователь();
	ОбъектФормы["Менеджер"] = ОбъектФормы["Автор"];
	ОбъектФормы["Комментарий"] = НСтр("ru='#Создан автоматически средствами СофтФон'");
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		КонтактИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
		Если КонтактИмяМетаданных = "Контрагенты" Тогда
			ОбъектФормы["Контрагент"] = СтруктураЗвонка.Контакт;
			
		ИначеЕсли КонтактИмяМетаданных = "Партнеры" Тогда
			ПараметрыЗаполнения = Новый Структура("Партнер", СтруктураЗвонка.Контакт);
			
		Иначе
			ОбъектФормы["Комментарий"] = ОбъектФормы["Комментарий"] + ", " + Строка(ТипЗнч(СтруктураЗвонка.Контакт)) 
			+ ": " + Строка(СтруктураЗвонка.Контакт) + НСтр("ru=', номер: '") 
			+ сфпСофтФонПроСервер.сфпПолучитьПредставлениеНомераТелефона(СтруктураЗвонка.Контакт, СтруктураЗвонка.НомерТелефона);			
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);

	Возврат ФормаЗаказа;

КонецФункции

// Функция создает и заполняет форму документа "Заказ поставщика"
//
// Параметры:
//	СтруктураЗвонка		- Структура	- Структура данных звонка
//	ДанныеЗаполнения	- Структура	- Структура данных для заполнения документа
//
Функция сфпИнициализироватьФормуЗаказаПоставщика(СтруктураЗвонка, ДанныеЗаполнения)
	
	ИмяФормы = "Документ.ЗаказПоставщику.ФормаОбъекта";		
	ФормаЗаказа = ПолучитьФорму(ИмяФормы,,,СтруктураЗвонка.hCall);		
	
	ТекПользователь = сфпСофтФонПроСервер.сфпТекущийПользователь();
	 
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаЗаказа);
	ОбъектФормы["Дата"] = сфпСофтФонПроСервер.сфпТекущаяДата();
	ОбъектФормы["Комментарий"] = НСтр("ru='#Создан автоматически средствами СофтФон'");
	
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Автор") Тогда
		ОбъектФормы["Автор"] = ТекПользователь;
	КонецЕсли;
	Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Менеджер") Тогда
		ОбъектФормы["Менеджер"] = ТекПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		КонтактИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
		Если КонтактИмяМетаданных = "Партнеры" Тогда
			ОбъектФормы["Партнер"] = СтруктураЗвонка.Контакт;
					
		ИначеЕсли КонтактИмяМетаданных = "Контрагенты" Тогда
			ПараметрыЗаполнения = Новый Структура("Контрагент", СтруктураЗвонка.Контакт);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);	
	
	Возврат ФормаЗаказа;		
	
КонецФункции	


/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫПОЛНЕНИЯ ДЕЙСТВИЙ

// Процедура открывает документ "Телефонный звонок"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьТелефонныйЗвонок(СтруктураЗвонка)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ", СтруктураЗвонка.НовыйЗвонок);
	Если ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
		ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьТелефонныйЗвонокЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("ПараметрыФормы", ПараметрыФормы));
		СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"]);
		Если СписокКонтактов.Количество() = 1 Тогда
			сфпОткрытьТелефонныйЗвонокЗавершение(СписокКонтактов[0].Значение, Новый Структура("ПараметрыФормы", ПараметрыФормы));
			
		Иначе				
			ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка,НомерТелефона", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"]);
			ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
			ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия,, Новый УникальныйИдентификатор(),,, ОписаниеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;				
		
	Иначе
		ИмяФормыДокументаТелефонныйЗвонок = сфпСофтФонПроСервер.сфпИмяФормыДокументаТелефонныйЗвонок();
		Если ЗначениеЗаполнено(ИмяФормыДокументаТелефонныйЗвонок) Тогда
			ОткрытьФорму(ИмяФормыДокументаТелефонныйЗвонок, ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // сфпОткрытьТелефонныйЗвонок() 

// Процедура заканчивает команду открытия звонка после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "КонтактАбонент"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьТелефонныйЗвонокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяФормыДокументаТелефонныйЗвонок = сфпСофтФонПроСервер.сфпИмяФормыДокументаТелефонныйЗвонок();
			
	ПараметрыФормы = ДополнительныеПараметры.ПараметрыФормы;
	Если Результат <> Неопределено Тогда
		Если ЗначениеЗаполнено(ИмяФормыДокументаТелефонныйЗвонок) Тогда
			ИмяРеквизитаАбонентКонтакт = сфпСофтФонПроСервер.сфпИмяРеквизитаАбонентКонтакт();
			
			ФормаЗвонка = ПолучитьФорму(ИмяФормыДокументаТелефонныйЗвонок, ПараметрыФормы);
			
			ОбъектФормы = сфпПолучитьОбъектФормы(ФормаЗвонка);
			ОбъектФормы.АбонентПредставление = Строка(Результат.Контакт);
			
			Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "сфпКлиент") Тогда
				ОбъектФормы.сфпКлиент = Результат.Владелец;
			
				Если Результат.Контакт <> Результат.Владелец Тогда
					ОбъектФормы[ИмяРеквизитаАбонентКонтакт] = Результат.Контакт;
				КонецЕсли;
				
			Иначе
				ОбъектФормы[ИмяРеквизитаАбонентКонтакт] = Результат.Контакт;
			КонецЕсли;

			Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
				ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(Результат.Контакт);
				Если ИмяМетаданных = "Контрагенты" Тогда
					ОбъектФормы.Контрагент = Результат.Контакт;
					
				ИначеЕсли ИмяМетаданных = "КонтактныеЛица" Тогда
					ОбъектФормы.Контрагент = Результат.Владелец;
				КонецЕсли;
			КонецЕсли;
			
			ФормаЗвонка.Открыть();
		КонецЕсли;
		
		Возврат;
	КонецЕсли;		
	
	Если ЗначениеЗаполнено(ИмяФормыДокументаТелефонныйЗвонок) Тогда
		ОткрытьФорму(ИмяФормыДокументаТелефонныйЗвонок, ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры	

// Процедура открывает карточку контакта
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьКарточкуКонтакта(СтруктураЗвонка)
	
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);	
	
		Если ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
			ПоказатьЗначение(, СтруктураЗвонка.Контакт);
			Если СтруктураЗвонка.Свойство("hCall") Тогда
				НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
				сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
		ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьКарточкуКонтактаЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("СтруктураЗвонка", СтруктураЗвонка));
		СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"], Истина);
		Если СписокКонтактов.Количество() = 1 Тогда
			сфпОткрытьКарточкуКонтактаЗавершение(СписокКонтактов[0].Значение,Новый Структура());
		Иначе				
			ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка, НомерТелефона, ТолькоКлиентыИКЛ", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"], Ложь);
			ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
			ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеВыбора);
		КонецЕсли;				
	ИначеЕсли СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 								
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьКарточкуКонтакта() 	

// Процедура заканчивает команду открытия события после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "Партнер" или "Контактное лицо"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьКарточкуКонтактаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтруктураЗвонка = ДополнительныеПараметры.СтруктураЗвонка;
	Если Результат <> Неопределено Тогда
		СтруктураЗвонка.Вставить("Контакт", Результат.Контакт);
		ПоказатьЗначение(, Результат.Контакт);
	КонецЕсли;
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
	КонецЕсли;

КонецПроцедуры // сфпОткрытьКарточкуКонтактаЗавершение()

// Функция создает и открывает документ "Событие"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьСобытие(СтруктураЗвонка)
	
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;		
	
	ФормаСобытия = сфпИнициализироватьФормуСобытия(СтруктураЗвонка, сфпДанныеЗаполнения);
	Если ФормаСобытия <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
			ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьСобытиеЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаСобытия, СтруктураЗвонка));
			СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"], Истина);
			Если СписокКонтактов.Количество() = 1 Тогда
				сфпОткрытьСобытиеЗавершение(СписокКонтактов[0].Значение, Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаСобытия, СтруктураЗвонка));

			Иначе				
				ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка, НомерТелефона, ТолькоКлиентыИКЛ", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"], Истина);
				ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
				ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеВыбора);
			КонецЕсли;

		Иначе			
			ФормаСобытия.Модифицированность = Истина;
			ФормаСобытия.Открыть();
			
			Если СтруктураЗвонка.Свойство("hCall") Тогда
				
				// +АА
				// Если заполнено документ-основание, то не буем его перезаполнять
				ОбъектФормы = сфпПолучитьОбъектФормы(ФормаСобытия);
				ИмяОснования = "";
				Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Основание") Тогда
					ИмяОснования = "Основание";
					
				ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "ДокументОснование") Тогда
					ИмяОснования = "ДокументОснование";
				КонецЕсли;
				
				Если ИмяОснования <> "" И НЕ ЗначениеЗаполнено(ОбъектФормы[ИмяОснования]) Тогда
					НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
					сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
					ОбъектФормы[ИмяОснования] = НовыйЗвонок;
					ПараметрОповещения = Новый Структура("Звонок", НовыйЗвонок);
					Оповестить("сфпПерезаполнитьИсториюЗвонков", ПараметрОповещения);
				КонецЕсли;
				
				// -АА
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры // сфпОткрытьСобытие() 	

// Процедура заканчивает команду открытия события после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "Партнер" или "Контактное лицо"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьСобытиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаДокумента = ДополнительныеПараметры.ФормаДокумента;
	СтруктураЗвонка = ДополнительныеПараметры.СтруктураЗвонка;
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаДокумента);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтруктураЗвонка.Вставить("Контакт", Результат.Контакт);
		
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
			ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(Результат.Контакт);
			Если ИмяМетаданных = "Контрагенты" Тогда
				ОбъектФормы["Контрагент"] = Результат.Контакт;

			ИначеЕсли ИмяМетаданных = "КонтактныеЛица" Тогда
				ОбъектФормы["Контрагент"] = Результат.Владелец;
				ОбъектФормы["КонтактноеЛицо"] = Результат.Контакт;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ФормаДокумента.Модифицированность = Истина;
	ФормаДокумента.Открыть();
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
		
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Основание") Тогда
			ОбъектФормы["Основание"] = НовыйЗвонок;
			
		ИначеЕсли сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "ДокументОснование") Тогда
			ОбъектФормы["ДокументОснование"] = НовыйЗвонок;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры	

// Функция создает и открывает документ "ЗаказПокупателя"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьЗаказПокупателя(СтруктураЗвонка)
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;		
	ФормаЗаказа = сфпИнициализироватьФормуЗаказаПокупателя(СтруктураЗвонка, сфпДанныеЗаполнения);
	Если НЕ (ФормаЗаказа = Неопределено) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
			ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьЗаказПокупателяЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"], Истина);
			Если СписокКонтактов.Количество() = 1 Тогда
				сфпОткрытьЗаказПокупателяЗавершение(СписокКонтактов[0].Значение,Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			Иначе				
				ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка, НомерТелефона, ТолькоКлиентыИКЛ", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"], Истина);
				ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
				ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеВыбора);
			КонецЕсли;				
		Иначе			
			ФормаЗаказа.Модифицированность = Истина;
			ФормаЗаказа.Открыть();
			
			Если СтруктураЗвонка.Свойство("hCall") Тогда
				НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
				сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьЗаказПокупателя() 	

// Процедура заканчивает команду открытия заказа покупателя после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "Партнер" или "Контактное лицо"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьЗаказПокупателяЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаДокумента = ДополнительныеПараметры.ФормаДокумента;
	СтруктураЗвонка = ДополнительныеПараметры.СтруктураЗвонка;
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаДокумента);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтруктураЗвонка.Вставить("Контакт", Результат.Контакт);
		
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
			ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(Результат.Контакт);
			Если ИмяМетаданных = "Контрагенты" Тогда
				ОбъектФормы["Контрагент"] = Результат.Контакт;

			ИначеЕсли ИмяМетаданных = "КонтактныеЛица" Тогда
				ОбъектФормы["Контрагент"] = Результат.Владелец;
				ОбъектФормы["КонтактноеЛицо"] = Результат.Контакт;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ФормаДокумента.Модифицированность = Истина;
	ФормаДокумента.Открыть();
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 	
	КонецЕсли;

КонецПроцедуры	

// Функция создает и открывает документ "ЗаказКлиента"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьЗаказКлиента(СтруктураЗвонка)
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;		
	ФормаЗаказа = сфпИнициализироватьФормуЗаказаКлиента(СтруктураЗвонка, сфпДанныеЗаполнения);
	Если НЕ (ФормаЗаказа = Неопределено) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
			ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьЗаказКлиентаЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"], Истина);
			Если СписокКонтактов.Количество() = 1 Тогда
				сфпОткрытьЗаказКлиентаЗавершение(СписокКонтактов[0].Значение,Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			Иначе				
				ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка, НомерТелефона, ТолькоКлиентыИКЛ", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"], Истина);
				ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
				ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеВыбора);
			КонецЕсли;				
		Иначе			
			ФормаЗаказа.Модифицированность = Истина;
			ФормаЗаказа.Открыть();
			
			Если СтруктураЗвонка.Свойство("hCall") Тогда
				НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
				сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьЗаказКлиента() 	

// Процедура заканчивает команду открытия заказа клиента после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "Партнер" или "Контактное лицо"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьЗаказКлиентаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаДокумента = ДополнительныеПараметры.ФормаДокумента;
	СтруктураЗвонка = ДополнительныеПараметры.СтруктураЗвонка;
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаДокумента);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтруктураЗвонка.Вставить("Контакт", Результат.Контакт);
		
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
			ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(Результат.Контакт);
			Если ИмяМетаданных = "Контрагенты" Тогда
				ОбъектФормы["Контрагент"] = Результат.Контакт;

			ИначеЕсли ИмяМетаданных = "КонтактныеЛица" Тогда
				ОбъектФормы["Контрагент"] = Результат.Владелец;
				ОбъектФормы["КонтактноеЛицо"] = Результат.Контакт;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ФормаДокумента.Модифицированность = Истина;
	ФормаДокумента.Открыть();
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 	
	КонецЕсли;

КонецПроцедуры	

// Функция создает и открывает документ "ЗаказПоставщику"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьЗаказПоставщику(СтруктураЗвонка)
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;		
	ФормаЗаказа = сфпИнициализироватьФормуЗаказаПоставщика(СтруктураЗвонка, сфпДанныеЗаполнения);
	Если НЕ (ФормаЗаказа = Неопределено) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка["МассивЗвонящих"]) И СтруктураЗвонка["МассивЗвонящих"].Количество() > 1 Тогда
			ОписаниеВыбора = Новый ОписаниеОповещения("сфпОткрытьЗаказПоставщикуЗавершение", сфпСофтФонПроКлиентПереопределяемый, Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			СписокКонтактов = сфпСофтФонПроСервер.сфпСформироватьСписокОбъектовДляВыбораПоМассивуЗвонящих(СтруктураЗвонка["МассивЗвонящих"], Истина);
			Если СписокКонтактов.Количество() = 1 Тогда
				сфпОткрытьЗаказПоставщикуЗавершение(СписокКонтактов[0].Значение,Новый Структура("ФормаДокумента, СтруктураЗвонка", ФормаЗаказа, СтруктураЗвонка));
			Иначе				
				ПараметрыОткрытия = Новый Структура("ИдентификаторЗвонка, НомерТелефона, ТолькоКлиентыИКЛ", СтруктураЗвонка.hCall, СтруктураЗвонка["НомерТелефона"], Истина);
				ПараметрыОткрытия.Вставить("СписокОбъектов", сфпСофтФонПроСервер.сфпПреобразоватьМассивЗвонящихВСписокЗначений(СтруктураЗвонка["МассивЗвонящих"]));
				ОткрытьФорму("ОбщаяФорма.сфпФормаВыбораАбонента", ПараметрыОткрытия, , Новый УникальныйИдентификатор(),ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеВыбора);
			КонецЕсли;				
		Иначе			
			ФормаЗаказа.Модифицированность = Истина;
			ФормаЗаказа.Открыть();
			
			Если СтруктураЗвонка.Свойство("hCall") Тогда
				НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
				сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры // сфпОткрытьЗаказПоставщику() 

// Процедура заканчивает команду открытия заказа клиента после выбора пользователем контакта
//
// Параметры:
//	Результат				- СправочникОбъект	- Выбранный пользователем объект для подстановки в поле "Партнер" или "Контактное лицо"
//	ДополнительныеПараметры	- Структура			- Структура дополнительных переданных параметров	
//
Процедура сфпОткрытьЗаказПоставщикуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаДокумента = ДополнительныеПараметры.ФормаДокумента;
	СтруктураЗвонка = ДополнительныеПараметры.СтруктураЗвонка;
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаДокумента);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		СтруктураЗвонка.Вставить("Контакт", Результат.Контакт);								
		
		Если сфпСофтФонПроСервер.сфпРеквизитСуществует(ОбъектФормы.Ссылка, "Контрагент") Тогда
			ИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(Результат.Контакт);
			Если ИмяМетаданных = "Контрагенты" Тогда
				ОбъектФормы["Контрагент"] = Результат.Контакт;

			ИначеЕсли ИмяМетаданных = "КонтактныеЛица" Тогда
				ОбъектФормы["Контрагент"] = Результат.Владелец;
				ОбъектФормы["КонтактноеЛицо"] = Результат.Контакт;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ФормаДокумента.Модифицированность = Истина;
	ФормаДокумента.Открыть();
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 	
	КонецЕсли;

КонецПроцедуры	

// Процедура открывает обработку "Помощник продаж"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьПомощникПродаж(СтруктураЗвонка)
	
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);					
	
	ПараметрыФормы = Новый Структура;
	ИмяФормы = "Обработка.ПомощникПродаж.Форма";
	ФормаОбработки = ПолучитьФорму(ИмяФормы, ПараметрыФормы);
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	
	ОбъектФормы = сфпПолучитьОбъектФормы(ФормаОбработки);
	ОбъектФормы.Партнер = СтруктураЗвонка.Контакт;
	
	ФормаОбработки.Открыть();
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 																
	КонецЕсли;

КонецПроцедуры // сфпОткрытьПомощникПродаж() 	

// Процедура открывает отчет "Дебиторская задолженность по срокам долга"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьДебиторскаяЗадолженность(СтруктураЗвонка)
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);					
	ИмяФормы = "Отчет.CRM_ДебиторскаяЗадолженностьПоСрокамДолга.Форма";
	Если НЕ ЗначениеЗаполнено(СтруктураЗвонка.Контакт) Тогда
		Если ЗначениеЗаполнено(СтруктураЗвонка.ContactID) Тогда
			СтруктураЗвонка.Контакт	= сфпСофтФонПроСервер.сфпНайтиКонтактПоGUID(СтруктураЗвонка.ContactID);
		КонецЕсли;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", Новый Структура("Партнер", СтруктураЗвонка.Контакт), "Основной", Истина);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 																	
	КонецЕсли;
	
КонецПроцедуры // сфпОткрытьДебиторскаяЗадолженность() 	

// Процедура открывает отчет "Взаиморасчеты"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьВзаиморасчеты(СтруктураЗвонка)
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);					
	ТекДата			= сфпСофтФонПроСервер.сфпТекущаяДата();
	Отчет = Отчеты.Взаиморасчеты.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ОстаткиИОбороты;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    НачалоМесяца(ТекДата));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(ТекДата));
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	ОтборОтчета     = НастройкиВарианта.Отбор;
	ОтборОтчета.Элементы.Очистить();
	
	ТекОтбор = ОтборОтчета.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ТекОтбор.ПравоеЗначение = СтруктураЗвонка.Контакт;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);

	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 																		
	КонецЕсли;

КонецПроцедуры // сфпОткрытьВзаиморасчеты() 	

// Процедура открывает отчет "Расчеты с партнерами"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьРасчетыСПартнерами(СтруктураЗвонка)
	
	Если СтруктураЗвонка.Свойство("ФормаПолучена") и СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);						
	
	ПараметрыФормы = Новый Структура("Отбор, ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов");
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
	ПараметрыФормы.ВидимостьКомандВариантовОтчетов = Ложь;
	
	КонтактИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
	Если КонтактИмяМетаданных = "Контрагенты" Тогда
		ПараметрыФормы.Отбор = Новый Структура("Контрагент", СтруктураЗвонка.Контакт);
		ПараметрыФормы.КлючНазначенияИспользования = "Контрагент";
		ПараметрыФормы.КлючВарианта = "ПоКонтрагентамКонтекст";
		
	ИначеЕсли КонтактИмяМетаданных = "Партнеры" Тогда
		ПараметрыФормы.Отбор = Новый Структура("Партнер", СтруктураЗвонка.Контакт);
		ПараметрыФормы.КлючНазначенияИспользования = "Партнер";
		ПараметрыФормы.КлючВарианта = "ПоПартнерамКонтекст";
	КонецЕсли;
	
	ИмяФормы = "Отчет.РасчетыСПартнерами.Форма";
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 																			
	КонецЕсли;
	
КонецПроцедуры // сфпОткрытьРасчетыСПартнерами() 	

// Процедура открывает отчет "Карточка расчетов с клиентами"
//
// Параметры:
//	СтруктураЗвонка	- Структура	- Структура данных звонка
//
Процедура сфпОткрытьКарточкаРасчетовСКлиентами(СтруктураЗвонка)
	
	Если СтруктураЗвонка.Свойство("ФормаПолучена") И СтруктураЗвонка.ФормаПолучена Тогда
		Возврат;
	КонецЕсли;	
	
	СтруктураЗвонка.Вставить("ФормаПолучена", Истина);							
	
	ПараметрыФормы = Новый Структура("Отбор, ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии, ВидимостьКомандВариантовОтчетов");
	ПараметрыФормы.СформироватьПриОткрытии = Истина;
	ПараметрыФормы.ВидимостьКомандВариантовОтчетов = Ложь;
	
	КонтактИмяМетаданных = сфпСофтФонПроСервер.сфпПолучитьИмяМетаданных(СтруктураЗвонка.Контакт);
	Если КонтактИмяМетаданных = "Партнеры" Тогда
		ПараметрыФормы.Отбор = Новый Структура("Партнер", СтруктураЗвонка.Контакт);
		ПараметрыФормы.КлючНазначенияИспользования = СтруктураЗвонка.Контакт;
		ПараметрыФормы.КлючВарианта = "КарточкаРасчетовСКлиентамиКонтекст";
	КонецЕсли;
	
	ИмяФормы = "Отчет.КарточкаРасчетовСКлиентами.Форма";
	ОткрытьФорму(ИмяФормы, ПараметрыФормы);
	
	Если СтруктураЗвонка.Свойство("hCall") Тогда
		НовыйЗвонок = сфпСофтФонПроСервер.сфпСоздатьТелефонныйЗвонок(СтруктураЗвонка, сфпДанныеЗаполнения);
		сфпСофтФонПроКлиент.сфпВыполнитьДействияПослеЗаписиТелефонногоЗвонка(НовыйЗвонок, СтруктураЗвонка); 																				
	КонецЕсли;

КонецПроцедуры // сфпОткрытьКарточкаРасчетовСКлиентами() 	


/////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫПОЛНЕНИЯ ЗВОНКА

// Процедура - обработчик выполнения общей команды "ИсторияРазговора"
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура сфпОбработкаКомандыИсторияРазговора(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокументаТелефонныйЗвонок = сфпСофтФонПроСервер.сфпИмяДокументаТелефонныйЗвонок(Истина);
	Если ЗначениеЗаполнено(ИмяДокументаТелефонныйЗвонок) Тогда
		Если ТипЗнч(ПараметрКоманды) = Тип(ИмяДокументаТелефонныйЗвонок) Тогда
			сфпСофтФонПроКлиент.сфпОткрытьИсториюРазговора(ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // сфпОбработкаКомандыИсторияРазговора()

// Процедура - обработчик выполнения общей команды "ИсторияТелефонныхЗвонков"
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура сфпОбработкаКомандыИсторияТелефонныхЗвонков(ПараметрКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда
		Возврат;
	КонецЕсли;
	
	сфпСофтФонПроКлиент.сфпОткрытьИсториюТелефонныхЗвонков(ПараметрКоманды);

КонецПроцедуры // сфпОбработкаКомандыИсторияТелефонныхЗвонков()
	
// Процедура - обработчик выполнения общей команды "сфпКарточкаCoMagic"
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура сфпОбработкаКомандыКарточкаCoMagic(ПараметрКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда Возврат; КонецЕсли;
	CoMagicID	= сфпСофтФонПроСерверПереопределяемый.сфпПолучитьCoMagicID(ПараметрКоманды);
	Если ПустаяСтрока(CoMagicID) Тогда Возврат; КонецЕсли;
	КлючСессии	= сфпСофтФонПроСервер.сфпПолучитьКлючСессииCoMagic();
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда Возврат; КонецЕсли;
	Адрес	= "http://app.comagic.ru/analytics/auditory/cmvisitor/?session_key=" + КлючСессии + "&visitor_id=" + CoMagicID;
	ПерейтиПоНавигационнойСсылке(Адрес);
КонецПроцедуры // сфпОбработкаКомандыКарточкаCoMagic()

// Процедура - обработчик выполнения общей команды "ПереводЗвонков"
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура сфпОбработкаКомандыПереводЗвонков(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда
		Возврат;

	ИначеЕсли НЕ сфпСофтФонПроСервер.сфпРолиДоступны("ПолныеПрава, сфпУправлениеМаршрутизацией") Тогда
		сфпОбщегоНазначенияКлиентСервер.сфпСообщитьПользователю(НСтр("ru='Недостаточно прав для настройки перевода звонков!'"));
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Контакт", ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.сфпПользователиДляПереключения", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);

КонецПроцедуры // сфпОбработкаКомандыПереводЗвонков()

// Процедура - обработчик выполнения общей команды "сфпПозвонить"
//
// Параметры:
//	ПараметрКоманды				- Произвольный	- Параметр команды
//	ПараметрыВыполненияКоманды	- Структура		- Параметры выполнения команды
//
Процедура сфпОбработкаКомандыПозвонить(ПараметрКоманды, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	Если НЕ сфпСофтФонПроКлиент.сфпПроверитьДоступностьСофтФон(Истина) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		сфпОбщегоНазначенияКлиентСервер.сфпСообщитьПользователю(НСтр("ru = 'Необходимо записать элемент!'"));
		Возврат;
	КонецЕсли;	
	
	ДанныеЗаполнения = Новый Структура("Основание", ПараметрКоманды);
	
	ИмяДокументаТелефонныйЗвонок = сфпСофтФонПроСервер.сфпИмяДокументаТелефонныйЗвонок(Истина);
	Если ЗначениеЗаполнено(ИмяДокументаТелефонныйЗвонок) И ТипЗнч(ПараметрКоманды) = Тип(ИмяДокументаТелефонныйЗвонок) Тогда
		АбонентКонтакт = сфпСофтФонПроСервер.сфпПолучитьЗначениеРеквизита(ПараметрКоманды, "АбонентКонтакт"); 
		АбонентКакСвязаться	= сфпСофтФонПроСервер.сфпПолучитьЗначениеРеквизита(ПараметрКоманды, "АбонентКакСвязаться"); 
		Если ЗначениеЗаполнено(АбонентКонтакт) Тогда
			Если ЗначениеЗаполнено(АбонентКакСвязаться) Тогда
				сфпСофтФонПроКлиент.сфпПозвонить(АбонентКакСвязаться, АбонентКонтакт, ДанныеЗаполнения);
				
		    Иначе
				СписокОбъектов = Новый СписокЗначений;
				СписокОбъектов.Добавить(АбонентКонтакт);
				сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов, ДанныеЗаполнения);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(АбонентКакСвязаться) Тогда
			сфпСофтФонПроКлиент.сфпПозвонить(АбонентКакСвязаться, , ДанныеЗаполнения);
			
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбран номер телефона!'"), 5);
		КонецЕсли;
		
	ИначеЕсли Найти("" + ТипЗнч(ПараметрКоманды), "Событие") > 0 Тогда
		Контрагент = сфпСофтФонПроСервер.сфпПолучитьЗначениеРеквизита(ПараметрКоманды, "Контрагент"); 
		Если ЗначениеЗаполнено(Контрагент) Тогда
			СписокОбъектов = Новый СписокЗначений();
			СписокОбъектов.Добавить(Контрагент);
			сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов, ДанныеЗаполнения);
		КонецЕсли;	
		
	Иначе
		СписокОбъектов = Новый СписокЗначений();
		СписокОбъектов.Добавить(ПараметрКоманды);
		сфпСофтФонПроКлиент.сфпПозвонитьВыбравТелефон(СписокОбъектов);
	КонецЕсли;

КонецПроцедуры // сфпОбработкаКомандыПозвонить()
