Функция Печать(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("Макет");
	Брэнд = ВернутьБрэнд();	
	СписокВидовРемонта = Новый Массив;
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("00000001")); //Доп оборуд
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033")); //Доп оборуд П
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("00000002")); //Комплектация
	//СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020")); //Комплектация П
	СписокВидовРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017")); //Комплектация К
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Брэнд=Брэнд;
	ТабДокумент.Вывести(ОбластьМакета);
	
	
	Для каждого Стр из Механики Цикл
				
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");

		ОбластьМакета.Параметры.Сотрудник = Стр.Сотрудник;
		ОбластьМакета.Параметры.Оклад = Стр.Оклад;
		ОбластьМакета.Параметры.ПланПродажиКоличество = Стр.ПланПродажиКоличество;
		ОбластьМакета.Параметры.ФактПродажиКоличество = Стр.ФактПродажиКоличество;
		ОбластьМакета.Параметры.ПланПродажиМИКСКоличество = Стр.ПланПродажиМИКСКоличество;
		ОбластьМакета.Параметры.ФактПродажиМИКСКоличество = Стр.ФактПродажиМИКСКоличество;
		ОбластьМакета.Параметры.ПланПродажиТюнинга = Стр.ПланПродажиТюнинга;
		ОбластьМакета.Параметры.ФактПродажиТюнинга = Стр.ФактПродажиТюнинга;	
		ОбластьМакета.Параметры.ПланФинПродукт = Стр.ПланФинПродукт;
		ОбластьМакета.Параметры.ФактФинПродукт = Стр.ФактФинПродукт;
		ОбластьМакета.Параметры.СуммаДобрКАСКО = Стр.СуммаДобрКАСКО;
		ОбластьМакета.Параметры.ИтогоСумма = Стр.ИтогоСумма;
		ОбластьМакета.Параметры.ИтогоСКоэф = Стр.ИтогоСКоэф;		
			
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок1");
		ТабДокумент.Вывести(ОбластьМакета);
		
		//Продажи Авто
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Автомобиль,
		|	РеализацияАвтомобилейАвтомобили.Ссылка
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Менеджер = &Менеджер
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен = ИСТИНА
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.ХозОперация = &ХозОперация
		|	И РеализацияАвтомобилейАвтомобили.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)";
		
		Запрос.УстановитьПараметр("Менеджер", Стр.Сотрудник);
		Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.РеализацияАвтомобилей);
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачало));
		Запрос.УстановитьПараметр("Брэнд", Брэнд);

		ВыборкаАвто = Запрос.Выполнить().Выбрать();
		Пока ВыборкаАвто.Следующий() Цикл		
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка1");
			ОбластьМакета.Параметры.Документ = ВыборкаАвто.Ссылка;		
			ОбластьМакета.Параметры.Автомобиль = ВыборкаАвто.Автомобиль;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок2");
		ТабДокумент.Вывести(ОбластьМакета);

		//Тюнинг
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаряд.СуммаДокумента КАК Сумма,
		|	ЗаказНаряд.Автомобиль.Модель,
		|	ЗаказНаряд.Ссылка
		|ПОМЕСТИТЬ Суммы
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.ДатаЗакрытия МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ЗаказНаряд.ВидРемонта В(&ВидРемонта)
		|	И ЗаказНаряд.Менеджер = &Менеджер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваров.СуммаДокумента,
		|	Модель.Значение,
		|	РеализацияТоваров.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Модель
		|		ПО РеализацияТоваров.Ссылка = Модель.Объект
		|			И (Модель.Свойство.Код = ""02001"")
		|ГДЕ
		|	РеализацияТоваров.СкладКомпании = &складкомпании
		|	И РеализацияТоваров.Менеджер = &менеджер
		|	И РеализацияТоваров.Проведен = ИСТИНА
		|	И РеализацияТоваров.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Суммы.Сумма КАК Сумма,
		|	Суммы.Ссылка
		|ИЗ
		|	Суммы КАК Суммы
		|ГДЕ
		|	Суммы.АвтомобильМодель В ИЕРАРХИИ(&Брэнд)";		
		Запрос.УстановитьПараметр("ВидРемонта", СписокВидовРемонта);
		Запрос.УстановитьПараметр("СкладКомпании", Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000012"));
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачало));
		Запрос.УстановитьПараметр("Менеджер", Стр.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
				
		ВыборкаРеализ = Запрос.Выполнить().Выбрать();
		Пока ВыборкаРеализ.Следующий() Цикл		
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка2");
			ОбластьМакета.Параметры.Документ = ВыборкаРеализ.Ссылка;
			ОбластьМакета.Параметры.СуммаРеализ = ВыборкаРеализ.Сумма;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок3");
		ТабДокумент.Вывести(ОбластьМакета);
		
		//ФИН ПРОДУКТ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РеализацияТоваров.СуммаДокумента КАК Сумма
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров КАК РеализацияТоваров
		|		ПО (РеализацияТоваров.ДокументОснование = РабочийЛистКредитногоОтдела.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство.Код = ""02001"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &ПериодНачало И &периодКонец
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|	И ЗначенияСвойствОбъектов.Значение В ИЕРАРХИИ(&Брэнд)";
		
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачало));
		Запрос.УстановитьПараметр("Менеджер", Стр.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		ВыборкаКредит = Запрос.Выполнить().Выбрать();
		Пока ВыборкаКредит.Следующий() Цикл		
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка3");
			ОбластьМакета.Параметры.Документ = ВыборкаКредит.Ссылка;
			ОбластьМакета.Параметры.СуммаКредит = ВыборкаКредит.Сумма;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок4");
		ТабДокумент.Вывести(ОбластьМакета);
			
		//КАСКО
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	""данные"" КАК Дата,
		|	СУММА(ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК БУЛЕВО)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ДобровольноеКАСКО,
		|	СУММА(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии * 5 / 100) КАК Сумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка
		|ПОМЕСТИТЬ Врем
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов.Объект
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &ДобровольноеКАСКО
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		|	И СтраховойПолис.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Врем.ДобровольноеКАСКО КАК ДобровольноеКАСКО,
		|	Врем.Сумма КАК Сумма,
		|	Врем.Ссылка
		|ИЗ
		|	Врем КАК Врем
		|ГДЕ
		|	Врем.ДобровольноеКАСКО = 1";
		
		Запрос.УстановитьПараметр("ДобровольноеКАСКО", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035"));
		Запрос.УстановитьПараметр("ПериодКонец", КонецМесяца(ПериодКонец));
		Запрос.УстановитьПараметр("ПериодНачало", НачалоМесяца(ПериодНачало));
		Запрос.УстановитьПараметр("Менеджер", Стр.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Результат = Запрос.Выполнить().Выбрать();
		
		ВыборкаКаско = Запрос.Выполнить().Выбрать();
		Пока ВыборкаКаско.Следующий() Цикл		
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка4");
			ОбластьМакета.Параметры.Документ = ВыборкаКаско.Ссылка;
			ОбластьМакета.Параметры.СуммаКаско = ВыборкаКаско.Сумма;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции

Функция ВернутьБрэнд() Экспорт

КонецФункции

Процедура 	РасчитатьДиспетчера() Экспорт
	
	//Диспетчера.Очистить();
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
		|ВЫБРАТЬ
		|ПродажиОбороты.ДокументПродажи,
		|ПродажиОбороты.ДокументПродажи.ДокументОснование.Автор КАК Диспетчер
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|ГДЕ
		|ПродажиОбороты.ПодразделениеКомпании = &ПодразделениеКомпании
		|И ПродажиОбороты.ХозОперация = &ХозОперация
		|И ПродажиОбороты.ДокументПродажи.ДокументОснование.Автор.Сотрудник = &Сотрудник
		|И ПродажиОбороты.ДокументПродажи.ДокументОснование.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ДокументПродажи.ДокументОснование IS NOT NULL	
		|СГРУППИРОВАТЬ ПО
		|ПродажиОбороты.ДокументПродажи.ДокументОснование.Автор,
		|ПродажиОбороты.ДокументПродажи
		|
		|УПОРЯДОЧИТЬ ПО
		|Диспетчер";
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	
	Для каждого Стр Из Диспетчера Цикл
		Запрос.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
		
		Рез=Запрос.Выполнить().Выбрать();
		Стр.КоличествоЗаездовФакт=Рез.Количество();
		К1=1; К2=1;
		Стр.Ставка=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СтавкаЗаЗакрытыйЗН,Стр.Сотрудник);

		//ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.Диспетчер,Стр.Должность);
		Стр.КоличествоЗаездовПлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПланПоЗаездам,Стр.Сотрудник);
		Если Стр.КоличествоЗаездовПлан=0 Тогда
			Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по заездам, расчет прерван. Установите план и запустите расчет заново.");
			Прервать;
		КонецЕсли;	
		Стр.ПланФакт=(Стр.КоличествоЗаездовФакт/Стр.КоличествоЗаездовПлан)*100;
		К1= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.ПланПоЗаездам,Стр.Должность,Стр.ПланФакт);
		Стр.Сумма=Стр.КоличествоЗаездовФакт*Стр.Ставка;
		Стр.Итого=Стр.КоличествоЗаездовФакт*Стр.Ставка*К1;
		
		Если ЗначениеЗаполнено(Стр.QVN) Тогда
			К2= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.QVN,Стр.Должность,Стр.QVN);
			Стр.Итого=Стр.КоличествоЗаездовФакт*Стр.Ставка*К1*К2;
		КонецЕсли;
		Стр.Итого=Стр.Итого+Стр.ДопПремия-Стр.Штрафы;

	КонецЦикла;
	
КонецПроцедуры	

Процедура РасчитатьМеханика() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|ВыработкаСотрудниковОбороты.Работа КАК Работа,
	|СУММА(ВыработкаСотрудниковОбороты.КоличествоНормочасовФактОборот) КАК КоличествоНормочасовОборот
	|ИЗ
	|РегистрНакопления.ВыработкаСотрудников.Обороты( &ДатаНачала, &ДатаОкончания) КАК ВыработкаСотрудниковОбороты
	|ГДЕ
	//|ВыработкаСотрудниковОбороты.ДокументПродажи.ПодразделениеКомпании = &Подразделение
	|ВыработкаСотрудниковОбороты.Сотрудник = &Сотрудник
	|СГРУППИРОВАТЬ ПО
	|ВыработкаСотрудниковОбороты.Работа
	//|ИТОГИ ПО 
	//|Работа
	|";
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	ЗапросС=Новый Запрос;
	ЗапросС.Текст="
	|ВЫБРАТЬ
	|ЗначенияСвойствОбъектов.Объект,
	|ЗначенияСвойствОбъектов.Свойство,
	|ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|ЗначенияСвойствОбъектов.Объект = &Объект
	|И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	СвойствоАвторабота=Планывидовхарактеристик.СвойстваОбъектов.НайтиПоКоду("12178");
	ЗапросС.УстановитьПараметр("Свойство",СвойствоАвторабота);
		
	Для каждого Стр из Механики Цикл	
		
		Стр.ОбщаяВыработка=0;
		Стр.АгрегатныйВыработка=0;
		Стр.АгрегатныйСтавка=0;
		Стр.АгрегатныйСумма=0;
		Стр.ТОВыработка=0;
		Стр.ТОСтавка=0;
		Стр.ТОСумма=0;
		Стр.ПСОВыработка=0;
		Стр.ПСОСтавка=0;
		Стр.ПСОСумма=0;
		Стр.ДОПВыработка=0;
		Стр.ДОПСтавка=0;
		Стр.ДОПСумма=0;
		Стр.СлесарныйВыработка=0;
		Стр.СлесарныйСтавка=0;
		Стр.СлесарныйСумма=0;
		Стр.ПремияИтого=0;
		
		Запрос.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
		
		Рез=Запрос.Выполнить().Выбрать();
		
		
		Пока  Рез.Следующий() Цикл
			
			Стр.ОбщаяВыработка=Стр.ОбщаяВыработка+Рез.КоличествоНормочасовОборот;
			
			ЗапросС.УстановитьПараметр("Объект",Рез.Работа);
			РезС=ЗапросС.Выполнить();
			ВыборкаС = РезС.Выбрать();
			Если ВыборкаС.Следующий() Тогда
				ТипРаботы=ВыборкаС.Значение;
				Если ТипРаботы.Наименование="Агрегатная" Тогда
					Стр.АгрегатныйВыработка=Рез.КоличествоНормочасовОборот+Стр.АгрегатныйВыработка;
					Стр.АгрегатныйСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный,Стр.Должность);
					Стр.АгрегатныйСумма= Стр.АгрегатныйВыработка*Стр.АгрегатныйСтавка;
				ИначеЕсли ТипРаботы.Наименование="ТО" Тогда 
					Стр.ТОВыработка=Рез.КоличествоНормочасовОборот+Стр.ТОВыработка;
					Стр.ТОСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.ТО,Стр.Должность);
					Стр.ТОСумма= Стр.ТОВыработка*Стр.ТОСтавка;
				ИначеЕсли ТипРаботы.Наименование="ПСО" Тогда 
					Стр.ПСОВыработка=Рез.КоличествоНормочасовОборот+Стр.ПСОВыработка;
					Стр.ПСОСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО,Стр.Должность);
					Стр.ПСОСумма= Стр.ПСОВыработка*Стр.ПСОСтавка;
				ИначеЕсли ТипРаботы.Наименование="ДОП" Тогда 
					Стр.ДОПВыработка=Рез.КоличествоНормочасовОборот+Стр.ДОПВыработка;
					Стр.ДОПСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП,Стр.Должность);
					Стр.ДОПСумма= Стр.ДОПВыработка*Стр.ДОПСтавка;
					
				Иначе
					Стр.СлесарныйВыработка=Рез.КоличествоНормочасовОборот+Стр.СлесарныйВыработка;
					Стр.СлесарныйСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный,Стр.Должность);
					Стр.СлесарныйСумма= Стр.СлесарныйВыработка*Стр.СлесарныйСтавка;
				КонецЕсли;	
			Иначе  // нет свойства - это слесарная
					Стр.СлесарныйВыработка=Рез.КоличествоНормочасовОборот+Стр.СлесарныйВыработка;
					Стр.СлесарныйСтавка=ПолучитьСтавку(Подразделение,Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный,Стр.Должность);
					Стр.СлесарныйСумма= Стр.СлесарныйВыработка*Стр.СлесарныйСтавка;
			КонецЕсли;	
			
		КонецЦикла;	
		Стр.ПремияИтого=Стр.АгрегатныйСумма+Стр.ДОПСумма+Стр.ПСОСумма+Стр.СлесарныйСумма+Стр.ТОСумма+Стр.ДопПремия-Стр.Штрафы;
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьСтавку(Подразделение,ВидРемонта,Должность)
		
	ЗапросСотр=Новый Запрос;
	ЗапросСотр.Текст="
	|ВЫБРАТЬ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Ставка
	|ИЗ
	|РегистрСведений.ТТ_СтавкиПоВидамРемонта.СрезПоследних(&Период, ) КАК ТТ_СтавкиПоВидамРемонтаСрезПоследних
	|ГДЕ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Подразделение = &Подразделение
	|И ТТ_СтавкиПоВидамРемонтаСрезПоследних.Должность = &Должность
	|И ТТ_СтавкиПоВидамРемонтаСрезПоследних.ВидРемонта = &ВидРемонта";

			ЗапросСотр.УстановитьПараметр("Подразделение",Подразделение);
			ЗапросСотр.УстановитьПараметр("Период",КонецДня(ПериодКонец));
			ЗапросСотр.УстановитьПараметр("ВидРемонта",ВидРемонта);
			ЗапросСотр.УстановитьПараметр("Должность",Должность);
			ВыборкаСотр=ЗапросСотр.Выполнить().Выбрать();
			Если ВыборкаСотр.Следующий() Тогда
				Ставка=ВыборкаСотр.Ставка;
			Иначе
				Ставка=0;
			КонецЕсли;	
	Возврат Ставка;		
КонецФункции

Процедура ЗаполнитьМехаников() Экспорт
	 
	 ФормаСотр=Справочники.Сотрудники.ПолучитьФормуВыбораГруппы("ФормаСписка");
	 ГруппаСотр=ФормаСотр.ОткрытьМодально();
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В ИЕРАРХИИ(&ГруппаСотр)
		|	И Сотрудники.ЭтоГруппа = ЛОЖЬ
		|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
		|	И Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Ссылка";

	Запрос.УстановитьПараметр("ГруппаСотр", ГруппаСотр);

	Результат = Запрос.Выполнить().Выгрузить();

	Для Каждого Стр Из Результат цикл
		СтрТ = Механики.Добавить();
		СтрТ.Сотрудник = стр.Сотрудник;
		СтрТ.Должность = стр.Сотрудник.Должность;
		
		//СтрТ.Оклад = ОкладПоУмолчанию;
	КонецЦикла;

	 
КонецПроцедуры

Процедура РасчитатьМастера() Экспорт
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023"));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|СУММА(ВыработкаСотрудниковОбороты.КоличествоНормочасовФактОборот) КАК КоличествоНормочасов
	|ИЗ
	|РегистрНакопления.ВыработкаСотрудников.Обороты( &ДатаНачала, &ДатаОкончания) КАК ВыработкаСотрудниковОбороты
	|ГДЕ
//	|ВыработкаСотрудниковОбороты.ДокументПродажи.ПодразделениеКомпании = &Подразделение
	|ВыработкаСотрудниковОбороты.ДокументПродажи.Мастер = &Мастер	
//	|И ВыработкаСотрудниковОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
	
	|";
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(ПериодКонец));
	//Запрос.УстановитьПараметр("Подразделение",Подразделение);
	//Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
		Для каждого Стр Из МастераЦеха Цикл
			Запрос.УстановитьПараметр("Мастер",Стр.Сотрудник);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				Стр.Выработка = Рез.КоличествоНормочасов;
				Стр.Ставка=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СтавкаЗаНормочас,Неопределено);
				Стр.Сумма=Стр.Выработка*Стр.Ставка;
				К1=1; К2=1;
				Если ЗначениеЗаполнено(Стр.QVNПлан) Тогда
					К1= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.QVN,Стр.Должность,Стр.QVNПлан);
				КонецЕсли;	
				Если ЗначениеЗаполнено(Стр.QVNФакт) Тогда
					К2= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.ПланПоЗаездам,Стр.Должность,Стр.QVNФакт);
				КонецЕсли;
				Стр.Итого=Стр.Сумма*К1*К2;
			КонецЕсли;
			
			Стр.Итого=Стр.Итого+Стр.ДопПремия-Стр.Штрафы;
	
		КонецЦикла;

КонецПроцедуры	

Процедура РасчитатьПриемщика() Экспорт
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	
	
	ВидыРемонтаСК=Новый СписокЗначений;
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
		|ВЫБРАТЬ
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот),0) КАК Сумма,
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СебестоимостьОборот),0) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|	ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд

		|ГДЕ
		|ПродажиОбороты.ПодразделениеКомпании = &ПодразделениеКомпании
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ДокументПродажи.Диспетчер = &Диспетчер	
		|И ПродажиОбороты.ХозОперация = &ХозОперация ";
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	
	Запрос1=Новый Запрос;
	Запрос1.Текст="
		|ВЫБРАТЬ
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот),0) КАК Сумма,
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СебестоимостьОборот),0) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|	ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд
		|ГДЕ
		|ПродажиОбороты.ПодразделениеКомпании = &ПодразделениеКомпании
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ДокументПродажи.Диспетчер = &Диспетчер	
		|И ПродажиОбороты.ХозОперация = &ХозОперация ";
	
	Запрос1.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос1.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос1.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос1.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос1.УстановитьПараметр("ВидыРемонта",ВидыРемонтаСК);

	
	
	Для каждого Стр Из Приемщики Цикл
		Запрос.УстановитьПараметр("Диспетчер",Стр.Сотрудник);
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			// Отдельно посчитаем сервисно-клиентские
			Запрос1.УстановитьПараметр("Диспетчер",Стр.Сотрудник);
			Рез1=Запрос1.Выполнить().Выбрать();
			Если Рез1.Следующий() Тогда
				МаржаФактСК=Рез1.Сумма-Рез1.Себестоимость-Рез1.Субподряд;
			КонецЕсли;	
			К1=1; К2=1;
			Стр.МаржаФакт=Рез.Сумма-Рез.Себестоимость-Рез.Субподряд;
			Стр.Процент=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСМаржи,Стр.Сотрудник);
			Стр.МаржаПлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Сотрудник);
			Если Стр.МаржаПлан=0 Тогда
				Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по марже, расчет прерван. Установите план и запустите расчет заново.");
				Прервать;
			КонецЕсли;	
    		Стр.Сумма=(Стр.МаржаФакт/100)*Стр.Процент;
			Стр.МаржаПланФакт=(МаржаФактСК/Стр.МаржаПлан)*100;
			К1= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Должность,Стр.МаржаПланФакт);

			Стр.Итого=Стр.Сумма*К1;
			Если ЗначениеЗаполнено(Стр.QVN) Тогда
				К2= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.QVN,Стр.Должность,Стр.QVN);
				Стр.Итого=Стр.Сумма*К1*К2;
			КонецЕсли;	
		КонецЕсли;	
		Стр.Итого=Стр.Итого+Стр.ДопПремия-Стр.Штрафы;

	КонецЦикла;
	
КонецПроцедуры	

Процедура ПересчетИтогоМеханики() Экспорт
	Для каждого Стр из Механики Цикл
			Стр.ПремияИтого=Стр.АгрегатныйСумма+Стр.ДОПСумма+Стр.ПСОСумма+Стр.СлесарныйСумма+Стр.ТОСумма+Стр.ДопПремия-Стр.Штрафы;
	КонецЦикла;		

КонецПроцедуры

Процедура 	РасчитатьРукПриемки() Экспорт
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
		|ВЫБРАТЬ
		|СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|СУММА(ПродажиОбороты.СебестоимостьОборот) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд
		|ГДЕ
		|ПродажиОбороты.ПодразделениеКомпании = &ПодразделениеКомпании
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ХозОперация = &ХозОперация ";
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	ВидыРемонтаСК=Новый СписокЗначений;
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонтаСК.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));
	
	
	Запрос1=Новый Запрос;
	Запрос1.Текст="
		|ВЫБРАТЬ
		|СУММА(ПродажиОбороты.СуммаОборот) КАК Сумма,
		|СУММА(ПродажиОбороты.СебестоимостьОборот) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд
		|ГДЕ
		|ПродажиОбороты.ПодразделениеКомпании = &ПодразделениеКомпании
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ХозОперация = &ХозОперация ";
	
	Запрос1.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос1.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос1.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос1.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос1.УстановитьПараметр("ВидыРемонта",ВидыРемонтаСК);
	
	ВидыРемонтаДОП=Новый СписокЗначений;
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014"));
	//<<Павличенко 01.09.2020
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	//>>Павличенко 01.09.2020
	
	Запрос2=Новый Запрос;
	Запрос2.Текст="
		|ВЫБРАТЬ
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот),0) КАК Сумма,
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СебестоимостьОборот),0) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд
		|ГДЕ
		//<<Павличенко 01.09.2020
		//	|ПродажиОбороты.ДокументПродажи.Менеджер.Подразделение = &ПодразделениеКомпании
		|ПродажиОбороты.ДокументПродажи.ПодразделениеКомпании = &ПодразделениеКомпании
		//>>Павличенко 01.09.2020
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В(&ВидыРемонта)
		|И ПродажиОбороты.ХозОперация = &ХозОперация";
	
	Запрос2.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос2.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос2.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос2.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос2.УстановитьПараметр("ВидыРемонта",ВидыРемонтаДОП);

	
	Для каждого Стр Из РукПриемки Цикл
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			МаржаДОП=0;
			// Считаем  вторичный ДОП
			Рез2=Запрос2.Выполнить().Выбрать();
			Если Рез2.Следующий() Тогда
				МаржаДОП=Рез2.Сумма-Рез2.Себестоимость-Рез2.Субподряд;
			КонецЕсли;
			
			МаржаДОП=МаржаДОП+МаржаК_Подразделение();
			Стр.ПроцентСДОП=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСДОП,Стр.Сотрудник);
			Стр.СуммаПланДОП=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Сотрудник);
			Если Стр.СуммаПланДОП=0 Тогда
				Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по сумме ДОПа, расчет прерван. Установите план и запустите расчет заново.");
				Прервать;
			КонецЕсли;	

			КЗ=1;
			Стр.СуммаФактДОП=МаржаДОП;
    		Стр.СуммаДОП=(Стр.СуммаФактДОП/100)*Стр.ПроцентСДОП;
			Стр.СуммаПланФактДОП=(МаржаДОП/Стр.СуммаПланДОП)*100;
			К3= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Должность,Стр.МаржаПланФактСК);
			
			МаржаФактСК=0;
			// Отдельно посчитаем сервисно-клиентские
			Рез1=Запрос1.Выполнить().Выбрать();
			Если Рез1.Следующий() Тогда
				МаржаФактСК=Рез1.Сумма-Рез1.Себестоимость-Рез1.Субподряд;
			КонецЕсли;	

			
			К1=1; К2=1;
			Стр.МаржаФактСК=Рез.Сумма-Рез.Себестоимость-Рез.Субподряд;
			Стр.ПроцентСК=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСМаржи,Стр.Сотрудник);
			Стр.МаржаПланСК=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Сотрудник);
			Если Стр.МаржаПланСК=0 Тогда
				Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по марже СК, расчет прерван. Установите план и запустите расчет заново.");
				Прервать;
			КонецЕсли;	
    		Стр.СуммаСК=(Стр.МаржаФактСК/100)*Стр.ПроцентСК;
			Стр.МаржаПланФактСК=(МаржаФактСК/Стр.МаржаПланСК)*100;
			К1= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Должность,Стр.МаржаПланФактСК);

			Стр.Итого=(Стр.СуммаСК+Стр.СуммаДОП)*К1*К3;
			Если ЗначениеЗаполнено(Стр.QVN) Тогда
				К2= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.QVN,Стр.Должность,Стр.QVN);
				Стр.Итого=(Стр.СуммаСК+Стр.СуммаДОП)*К1*К2*К3;
			КонецЕсли;	
		КонецЕсли;	
		Стр.Итого=Стр.Итого+Стр.ДопПремия-Стр.Штрафы;
	КонецЦикла;
	
	
КонецПроцедуры

Процедура РасчитатьПримемщикиСДОП() Экспорт
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000042"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000036"));	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
		|ВЫБРАТЬ
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот),0) КАК Сумма,
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СебестоимостьОборот),0) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|	ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд

		|ГДЕ
		|ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
		|И ПродажиОбороты.ДокументПродажи.Диспетчер = &Сотрудник	
		|И ПродажиОбороты.ХозОперация = &ХозОперация ";
	
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	

	ВидыРемонтаДОП=Новый СписокЗначений;
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014"));
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));  //Комплектация для ОПА
	ВидыРемонтаДОП.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	
	
	Запрос2=Новый Запрос;
	Запрос2.Текст="
		|ВЫБРАТЬ
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СуммаОборот),0) КАК Сумма,
		|ЕСТЬNULL(СУММА(ПродажиОбороты.СебестоимостьОборот),0) КАК Себестоимость,
		|ЕСТЬNULL(СУММА(СубподрядОбороты.СебестоимостьОборот),0) КАК Субподряд
		|ИЗ
		|РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, , ) КАК ПродажиОбороты
		|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты КАК СубподрядОбороты
		|ПО ПродажиОбороты.ДокументПродажи = СубподрядОбороты.ЗаказНаряд
		|ГДЕ
		|ПродажиОбороты.ДокументПродажи.Диспетчер = &Сотрудник	
		|И ПродажиОбороты.ДокументПродажи.ВидРемонта В(&ВидыРемонта)
		|И ПродажиОбороты.ХозОперация = &ХозОперация";
	
	Запрос2.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.ЗаказНаряд);
	Запрос2.УстановитьПараметр("НачПериода",НачалоДня(ПериодНачало));
	Запрос2.УстановитьПараметр("КонПериода",КонецДня(ПериодКонец));
	Запрос2.УстановитьПараметр("ВидыРемонта",ВидыРемонтаДОП);

	
	Для каждого Стр Из ПриемщикиДОП Цикл
			Стр.К2=1;
			Запрос2.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
			МаржаДОП=0;
			// Считаем  вторичный ДОП
			Рез2=Запрос2.Выполнить().Выбрать();
			Если Рез2.Следующий() Тогда
				МаржаДОП=Рез2.Сумма-Рез2.Себестоимость-Рез2.Субподряд;
			КонецЕсли;
			Стр.ДопФакт=МаржаДОП;
			Стр.ДопФакт=Стр.ДопФакт+МаржаК_Мастер(Стр.Сотрудник);
			Стр.ДОППроцент=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСДОП,Стр.Сотрудник);			
			Стр.ДОППлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Сотрудник);			
			Если Стр.ДОППлан=0 Тогда
				Стр.ДОППлан=1;
				Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по ДОПу. Установите план и запустите расчет заново.");
				//Продолжить;
			КонецЕсли;	

			Стр.ДОППланФакт=(Стр.ДОПФакт/Стр.ДОППлан)*100;
			Стр.К2= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Должность,Стр.ДОППланФакт);
    		Стр.ДОПСумма=(Стр.ДОПФакт/100)*Стр.ДОППроцент*Стр.К2;

			
		Запрос.УстановитьПараметр("Сотрудник",Стр.Сотрудник);
		Рез=Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			Стр.К1=1; 
			Стр.МаржаФакт=Рез.Сумма-Рез.Себестоимость-Рез.Субподряд;
			Стр.Процент=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСМаржи,Стр.Сотрудник);
			Стр.МаржаПлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Сотрудник);
			Если Стр.МаржаПлан=0 Тогда
				Стр.МаржаПлан=1;
				Сообщить("По сотруднику "+Стр.Сотрудник+ " не установлен план по марже сервисно-клиентских з-н. Установите план и запустите расчет заново.");
				//Продолжить;
			КонецЕсли;	
  			Стр.МаржаПланФакт=(Стр.МаржаФакт/Стр.МаржаПлан)*100;
			Стр.К1= ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Должность,Стр.МаржаПланФакт);

  		Стр.Сумма=(Стр.МаржаФакт/100)*Стр.Процент*Стр.К1;

			
		КонецЕсли;
		Если Стр.К4=0 Тогда Стр.К4=1 КонецЕсли;
		Если Стр.К3=0 Тогда Стр.К3=1 КонецЕсли;
		
		Стр.Всего=(Стр.ДОПСумма+Стр.Сумма)*Стр.К3*Стр.К4-Стр.Оклад;

	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьПлан(Подразделение,Должность,Параметр,Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_ПланыЗП_Сервис.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ТТ_ПланыЗП_Сервис.СрезПоследних(&Период, ) КАК ТТ_ПланыЗП_Сервис
		|ГДЕ
		|	ТТ_ПланыЗП_Сервис.Должность = &Должность
		|	И ТТ_ПланыЗП_Сервис.Подразделение = &Подразделение
		|	И ТТ_ПланыЗП_Сервис.Параметр = &Параметр";
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Запрос.Текст=Запрос.Текст+"  И ТТ_ПланыЗП_Сервис.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;	
	КонецЕСли;
	
Конецфункции


Функция ПолучитьК(Параметр,Должность,Процент) Экспорт


	Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ТТ_ПараметрыЗПСрезПоследних.Предел КАК Предел,
		|(ВЫБОР КОГДА 
		|ТТ_ПараметрыЗПСрезПоследних.Значение ЕСТЬ NULL
		|ТОГДА 0
		|ИНАЧЕ
		|ТТ_ПараметрыЗПСрезПоследних.Значение
		|КОНЕЦ ) КАК ЗначениеК
		|ИЗ
		|РегистрСведений.ТТ_ПараметрыЗП_Сервис.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗПСрезПоследних
		|ГДЕ
		|ТТ_ПараметрыЗПСрезПоследних.Подразделение = &Подразделение
		|И ТТ_ПараметрыЗПСрезПоследних.Должность = &Должность
		|И ТТ_ПараметрыЗПСрезПоследних.Параметр = &Параметр
		|
		|УПОРЯДОЧИТЬ ПО
		|Предел";
	Запрос.УстановитьПараметр("Период",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	
	К=0;
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		Если  Процент<Рез.Предел Тогда
			К=Рез.ЗначениеК;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
			Возврат(К);
	
КонецФункции	

Процедура ПересчетОператоров() Экспорт
	РасчитатьДиспетчера();

КонецПроцедуры


Процедура ПересчетМастера() Экспорт
	РасчитатьМастера();
КонецПроцедуры

Процедура ПересчетПриемщики() Экспорт
	РасчитатьПриемщика();
КонецПроцедуры

Процедура ПересчетРукПриемки() Экспорт
	РасчитатьРукПриемки();
КонецПроцедуры


Процедура ПересчетприемщикиСДОП() Экспорт
	РасчитатьПримемщикиСДОП();
КонецПроцедуры

Процедура 	РасчитатьРОЗЧ() Экспорт
	Для каждого Стр ИЗ РОЗЧ Цикл
		Стр.МаржаПлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Сотрудник);
		Если Стр.МаржаПлан=0 Тогда
			Сообщить("Не заполнен план по марже по з-н для сотрудника "+Стр.Сотрудник);
			Стр.МаржаПлан=1;
		КонецЕсли;	
		
		Стр.МаржаПланДоп=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Сотрудник);
		Если Стр.МаржаПланДоп=0 Тогда
			Сообщить("Не заполнен план по выручке  з/ч проданные через магазин + ДОП для сотрудника "+Стр.Сотрудник);
			Стр.МаржаПланДоп=1;
		КонецЕсли;	
		
		Стр.МКУПлан=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаМКУ,Стр.Сотрудник);	
		Если Стр.МКУПлан=0 Тогда
			Сообщить("Не заполнен план по МКУ "+Стр.Сотрудник);
			Стр.МКУПлан=1;
		КонецЕсли;	
		
		Стр.МаржаФакт=МаржаРОЗЧ();
		Стр.Процент=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСМаржи,Стр.Сотрудник);
		Стр.К1=ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.Маржа,Стр.Должность,(Стр.МаржаФакт/Стр.МаржаПлан)*100);
		Стр.Сумма=(Стр.МаржаФакт/100)*Стр.Процент*Стр.К1;
		
		МаржаРеализация=МаржаРОЗЧОпт(Стр.Сотрудник);
		Стр.МаржаФактДоп=МаржаРОЗЧДОП()+МаржаРеализация+МаржаК_РОЗЧ();
		Стр.ПроцентДоп=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСДОП,Стр.Сотрудник);
		Стр.К2=ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаДОП,Стр.Должность,(Стр.МаржаФактДоп/Стр.МаржаПланДоп)*100);
		Стр.СуммаДоп=(Стр.МаржаФактДоп/100)*Стр.ПроцентДоп*Стр.К2;
		
		Стр.МКУФакт=МКУРОЗЧ();
		Стр.ПроцентМКУ=ПолучитьПлан(Подразделение,Стр.Должность,Перечисления.ТТ_Параметры_ЗП_Сервис.ПроцентСМКУ,Стр.Сотрудник);
		Стр.К3=ПолучитьК(Перечисления.ТТ_Параметры_ЗП_Сервис.СуммаМКУ,Стр.Должность,(Стр.МКУФакт/Стр.МКУПлан)*100);
		Стр.СуммаМКУ=(Стр.МКУФакт/100)*Стр.ПроцентМКУ*Стр.К3;
		
		Если Стр.К4=0 Тогда Стр.К4=1 КонецЕсли;
		Если Стр.К5=0 Тогда Стр.К5=1 КонецЕсли;
		Если Стр.К6=0 Тогда Стр.К6=1 КонецЕсли;
	
		

		Стр.Итого=((Стр.Сумма+Стр.СуммаДоп+Стр.СуммаМКУ)*Стр.К4*Стр.К5)*Стр.К6-Стр.Оклад;
	КонецЦикла;	
	
	
	
КонецПроцедуры	


Функция МаржаК_РОЗЧ() Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));  //Комплектация
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000018"));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|ЕСТЬNULL(СУММА(ТоварыВПроизводствеОбороты.ЗаказНаряд.СуммаНоменклатурыДокумента - ЗаказНарядТовары.СуммаНДС) - СУММА(ТоварыВПроизводствеОбороты.СуммаРасход - ТоварыВПроизводствеОбороты.СуммаНДСРасход),0) КАК СуммаДоп
	|ИЗ
	|РегистрНакопления.ТоварыВПроизводстве.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, ДЕНЬ), КОНЕЦПЕРИОДА(&ПериодКонец, ДЕНЬ), Регистратор, ) КАК ТоварыВПроизводствеОбороты
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|ТОВАРЫ.Ссылка КАК Ссылка,
	|СУММА(ТОВАРЫ.СуммаВсего) КАК СуммаВсего,
	|СУММА(ТОВАРЫ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Товары КАК ТОВАРЫ
	|
	|СГРУППИРОВАТЬ ПО
	|ТОВАРЫ.Ссылка) КАК ЗаказНарядТовары
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|Работы.Ссылка КАК Ссылка,
	|СУММА(Работы.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Работы КАК Работы
	|
	|СГРУППИРОВАТЬ ПО
	|Работы.Ссылка) КАК ЗаказНарядРаботы
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	|ГДЕ
	|ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта В(&ТекРемонты)
	|И ТоварыВПроизводствеОбороты.Регистратор.ХозОперация.Код = ""000142""
	|И ТоварыВПроизводствеОбороты.ЗаказНаряд.ПодразделениеКомпании = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ТекРемонты",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаДоп;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции


Функция МаржаК_Мастер(Сотрудник) Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));  //Комплектация
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000018"));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|ЕСТЬNULL(СУММА(ТоварыВПроизводствеОбороты.ЗаказНаряд.СуммаДокумента - ЗаказНарядТовары.СуммаНДС - ЗаказНарядРаботы.СуммаНДС) - СУММА(ТоварыВПроизводствеОбороты.СуммаРасход - ТоварыВПроизводствеОбороты.СуммаНДСРасход),0) КАК СуммаДоп
	|ИЗ
	|РегистрНакопления.ТоварыВПроизводстве.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, ДЕНЬ), КОНЕЦПЕРИОДА(&ПериодКонец, ДЕНЬ), Регистратор, ) КАК ТоварыВПроизводствеОбороты
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|ТОВАРЫ.Ссылка КАК Ссылка,
	|СУММА(ТОВАРЫ.СуммаВсего) КАК СуммаВсего,
	|СУММА(ТОВАРЫ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Товары КАК ТОВАРЫ
	|
	|СГРУППИРОВАТЬ ПО
	|ТОВАРЫ.Ссылка) КАК ЗаказНарядТовары
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|Работы.Ссылка КАК Ссылка,
	|СУММА(Работы.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Работы КАК Работы
	|
	|СГРУППИРОВАТЬ ПО
	|Работы.Ссылка) КАК ЗаказНарядРаботы
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	|ГДЕ
	|ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта В(&ТекРемонты)
	|И ТоварыВПроизводствеОбороты.Регистратор.ХозОперация.Код = ""000142""
	|И ТоварыВПроизводствеОбороты.ЗаказНаряд.Диспетчер = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ТекРемонты",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаДоп;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции


Функция МаржаК_Подразделение() Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));  //Комплектация
	//ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000018"));
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|ЕСТЬNULL(СУММА(ТоварыВПроизводствеОбороты.ЗаказНаряд.СуммаДокумента - ЗаказНарядТовары.СуммаНДС - ЗаказНарядРаботы.СуммаНДС) - СУММА(ТоварыВПроизводствеОбороты.СуммаРасход - ТоварыВПроизводствеОбороты.СуммаНДСРасход),0) КАК СуммаДоп
	|ИЗ
	|РегистрНакопления.ТоварыВПроизводстве.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, ДЕНЬ), КОНЕЦПЕРИОДА(&ПериодКонец, ДЕНЬ), Регистратор, ) КАК ТоварыВПроизводствеОбороты
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|ТОВАРЫ.Ссылка КАК Ссылка,
	|СУММА(ТОВАРЫ.СуммаВсего) КАК СуммаВсего,
	|СУММА(ТОВАРЫ.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Товары КАК ТОВАРЫ
	|
	|СГРУППИРОВАТЬ ПО
	|ТОВАРЫ.Ссылка) КАК ЗаказНарядТовары
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядТовары.Ссылка
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|Работы.Ссылка КАК Ссылка,
	|СУММА(Работы.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|Документ.ЗаказНаряд.Работы КАК Работы
	|
	|СГРУППИРОВАТЬ ПО
	|Работы.Ссылка) КАК ЗаказНарядРаботы
	|ПО ТоварыВПроизводствеОбороты.ЗаказНаряд = ЗаказНарядРаботы.Ссылка
	|ГДЕ
	|ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта В(&ТекРемонты)
	|И ТоварыВПроизводствеОбороты.Регистратор.ХозОперация.Код = ""000142""
	|И ТоварыВПроизводствеОбороты.ЗаказНаряд.ПодразделениеКомпании = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ТекРемонты",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаДоп;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции




Функция МаржаРОЗЧОпт(Менеджер) Экспорт
	
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СуммаОборот-ПродажиОбороты.СебестоимостьОборот) КАК СуммаЗЧ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, МЕСЯЦ), КОНЕЦПЕРИОДА(&ПериодКонец, Месяц), , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.ХозОперация.Код <> ""000142""
	|	И НЕ ПродажиОбороты.Номенклатура.Наименование=""Авторабота""
	|	И НЕ ПродажиОбороты.Номенклатура.ВидНоменклатуры=&Услуга
	|	И ПродажиОбороты.ДокументПродажи.Менеджер = &Менеджер	
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ПодразделениеКомпании";
	
	//Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Услуга",Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("Менеджер",Менеджер);
	
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаЗЧ;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции	

Функция МаржаРОЗЧДОП() Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("00000001"));  //ДОП
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));  //Комплектация для ОПА
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	

	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СуммаОборот-ПродажиОбороты.СебестоимостьОборот) КАК СуммаЗЧ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, МЕСЯЦ), КОНЕЦПЕРИОДА(&ПериодКонец, Месяц), , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.ХозОперация.Код = ""000142""
	|	И ПродажиОбороты.ПодразделениеКомпании = &Подразделение
	|	И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
	|	И НЕ ПродажиОбороты.Номенклатура.Наименование=""Авторабота""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаЗЧ;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции	

Функция МКУРОЗЧ() Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035"));  //МКУ
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000036"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000042"));  
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СуммаОборот-ПродажиОбороты.СебестоимостьОборот) КАК СуммаЗЧ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, МЕСЯЦ), КОНЕЦПЕРИОДА(&ПериодКонец, Месяц), , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.ХозОперация.Код = ""000142""
	|	И ПродажиОбороты.ПодразделениеКомпании.Организация = &Подразделение
	|	И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
	|	И НЕ ПродажиОбороты.Номенклатура.Наименование=""Авторабота""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение.Организация);
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаЗЧ;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции

Функция МаржаРОЗЧ() Экспорт
	
	ВидыРемонта=Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033"));  //СК
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010"));  //Гарантия
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000038"));	//ТО

	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СуммаОборот-ПродажиОбороты.СебестоимостьОборот) КАК СуммаЗЧ
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(НАЧАЛОПЕРИОДА(&ПериодНачало, МЕСЯЦ), КОНЕЦПЕРИОДА(&ПериодКонец, Месяц), , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.ХозОперация.Код = ""000142""
	|	И ПродажиОбороты.ПодразделениеКомпании = &Подразделение
	|	И ПродажиОбороты.ДокументПродажи.ВидРемонта В (&ВидыРемонта)
	|	И НЕ ПродажиОбороты.Номенклатура.Наименование=""Авторабота""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ПодразделениеКомпании";
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("ВидыРемонта",ВидыРемонта);
	
	Запрос.УстановитьПараметр("ПериодНачало",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ПериодКонец",КонецДня(ПериодКонец));
	
	Сумма=0;
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Сумма=Рез.СуммаЗЧ;
	КонецЕсли;	
	
	Возврат(Сумма);
	
КонецФункции	


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//KamikadZe begin add 01.08.2020 12:51:49
	// регистр ТТ_УПР_ЗП Приход
	Движения.ТТ_УПР_ЗП.Записывать = Истина;
	Движения.ТТ_УПР_ЗП.Очистить();
	ДатаДвижения = КонецДня(ПериодКонец);
	Для Каждого ТекСтрокаДанныеЗУП Из Механики Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.ПремияИтого;
		Движение.ДопЗП = ТекСтрокаДанныеЗУП.ДОПСумма;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из Диспетчера Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.Итого;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из МастераЦеха Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.Итого;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из Приемщики Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.ДопЗП = ТекСтрокаДанныеЗУП.Итого;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из РукПриемки Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.Итого;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из ПриемщикиДОП Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.Всего;
		Движение.ДопЗП = ТекСтрокаДанныеЗУП.ДОПСумма;
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из РОЗЧ Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Подразделение = Подразделение;
		Движение.Организация = Подразделение.Организация;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.Итого;
		Движение.ДопЗП = ТекСтрокаДанныеЗУП.СуммаДоп;
	КонецЦикла;
	//KamikadZe end add
КонецПроцедуры

