Функция НеУчитыватьСтавку(Должность, Подразделение = Неопределено) Экспорт
	
	ПолучитьПоСтарому = Подразделение = Неопределено;
	Если не ПолучитьПоСтарому Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.неУчитыватьСтавку КАК неУчитыватьСтавку
		|ИЗ
		|	Документ.СоставKPI.Должности КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И НЕ СоставKPI.Ссылка.ПометкаУдаления
		|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании");
		Запрос.УстановитьПараметр("Должность",Должность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
		Выб=Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.неУчитыватьСтавку;
		Иначе
			ПолучитьПоСтарому = Истина;
		КонецЕсли;		
	КонецЕсли;
	
	Если ПолучитьПоСтарому Тогда	
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.неУчитыватьСтавку
		|ИЗ
		|	Документ.СоставKPI.Должности КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И НЕ СоставKPI.Ссылка.ПометкаУдаления");
		Запрос.УстановитьПараметр("Должность",Должность);
		Выб=Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.неУчитыватьСтавку;
		Иначе
			Возврат ложь;
		КонецЕсли;
	КонецЕсли;

КонецФункции

