
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ПустаяСтрока(ЭтотОбъект.ПодразделениеКомпании) Тогда
		Отказ=истина;
		Сообщить("Не заполнено подразделение компании");
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтр из ЭтотОбъект.ПремиальныйФонд Цикл
		Если обЗначениеНеЗаполнено(ТекСтр.БазоваяЧасть) Тогда
			Отказ=истина;
			Сообщить("Не заполнен показатель премиальной части в строке "+текСтр.НомерСтроки+" по должности "+текСтр.Должность);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	 // регистр ПремиальныеФонды
	Движения.ЦелевыеПоказатели.Записывать = Истина;
	Движения.ЦелевыеПоказатели.Очистить();
	Для Каждого ТекСтрокаПремиальныйФонд Из ПремиальныйФонд Цикл
		Движение = Движения.ЦелевыеПоказатели.Добавить();
		Движение.Период = Дата;
		Движение.Должность = ТекСтрокаПремиальныйФонд.Должность;
		Движение.Категория = ТекСтрокаПремиальныйФонд.Категория;
		Движение.Периодичность = Периодичность;
		Движение.БазоваяЧасть = ТекСтрокаПремиальныйФонд.БазоваяЧасть;
		Движение.СрокДействия=СрокДействия;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация=Организация;
	КонецЦикла;

	// регистр НаборыKPI
	Движения.СоставKPI.Записывать = Истина;
	Движения.СоставKPI.Очистить();
	Для Каждого ТекСтрокаНаборKPI Из НаборKPI Цикл
		Движение = Движения.СоставKPI.Добавить();
		Движение.Период = Дата;
		Движение.Должность = ТекСтрокаНаборKPI.Должность;
		Движение.Категория = ТекСтрокаНаборKPI.Категория;
		Движение.KPI = ТекСтрокаНаборKPI.KPI;
		Движение.Периодичность = Периодичность;
		Движение.Вес = ТекСтрокаНаборKPI.Вес;
		Движение.СрокДействия=СрокДействия;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация=Организация;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Создается = ЭтоНовый();
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		Период = Дата;
		
		Если Периодичность = Перечисления.Периодичность.Месяц Тогда
			НачПериода=НачалоМесяца(Период);
			КонПериода=КонецМесяца(Период);
		ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
			НачПериода=НачалоКвартала(Период);
			КонПериода=КонецКвартала(Период);
		ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
			НачПериода=НачалоГода(Период);
			КонПериода=КонецГода(Период);
		Иначе
			Сообщить("Неверная периодичность",10);
			Отказ=истина;
			Возврат;
		КонецЕсли;
		
		Запрос=Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СоставKPIДолжности.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СоставKPI.Должности КАК СоставKPIДолжности
		|ГДЕ
		|	СоставKPIДолжности.Ссылка <> &Ссылка
		|	И СоставKPIДолжности.Ссылка.Периодичность = &Периодичность
		|	И СоставKPIДолжности.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И СоставKPIДолжности.Ссылка.Дата МЕЖДУ &НП И &КП
		|	И СоставKPIДолжности.Должность В(&Должности)
		|	И НЕ СоставKPIДолжности.Ссылка.ПометкаУдаления";

		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Периодичность",ЭтотОбъект.Периодичность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ЭтотОбъект.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("НП",НачПериода);
		Запрос.УстановитьПараметр("КП",КонПериода);
		Запрос.УстановитьПараметр("Должности", Должности.ВыгрузитьКолонку("Должность"));
		
		Выб=Запрос.Выполнить().Выбрать();
		Если Выб.Следующий() Тогда
			Сообщить("В этот период уже есть аналогичный документ "+Выб.Ссылка);
			Отказ=истина;
		КонецЕсли;
		
		Изм=Документы.ПлановыеЗначенияKPI.ПроверитьИзменения(ЭтотОбъект);
		
	КонецЕсли;
	
	Если НЕ Отказ и РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		#Если Клиент Тогда
			ЭтотОбъект.АвторПоследнегоИзменения=ПараметрыСеанса.Пользователь;
			ЭтотОбъект.ДатаПоследнегоИзменения=ТекущаяДата();
		#Иначе
			//ЭтотОбъект.АвторПоследнегоИзменения = Справочники.Пользователи.НайтиПоНаименованию("А");
			//ЭтотОбъект.ДатаПоследнегоИзменения=ТекущаяДатаЧасовойПояс();
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

