
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОтборПараметровKPI();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Запишем регистр тарифов доставки
	Если ТаблицаПараметровДляKPI.Количество() Тогда
		
		ПараметрыKPI = РеквизитФормыВЗначение("ТаблицаПараметровДляKPI");
		ПараметрыKPI.Отбор.ПараметрыДляKPI.Установить(Объект.Ссылка);
		ПараметрыKPI.Записать();
		ЗначениеВРеквизитФормы(ПараметрыKPI,"ТаблицаПараметровДляKPI");
		
	КонецЕсли;

КонецПроцедуры

#Область ПараметровДляKPI

&НаКлиенте
Процедура ТаблицаПараметровДляKPIПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ Объект.Ссылка.Пустая() ТОгда  // элемент записан
		Если НоваяСтрока Тогда  // устанавливаем только у новой строки, у существующей уже установлен
			СтрокаСДанными = Элемент.ТекущиеДанные; 
			СтрокаСДанными.Период = НачалоМесяца(ТекущаяДата());
			
			Если ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда 
				
				СтрокаСДанными.Организация = ПолучитьОрганизациюПодразделения(Объект.ПодразделениеКомпании);
				
			КонецЕсли;
		
			СтрокаСДанными.ПараметрыДляKPI = Объект.Ссылка;
			
		КонецЕсли;	
	Иначе // элемент не записан, предлагаем зааписать
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередВводомПараметровKPI", ЭтотОбъект),
		"Перед добавлением параметров, необходимо записать элемент."
		+Символы.ПС+ "Записать?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОрганизациюПодразделения(ПодразделениеКомпании)
	
	Возврат ПодразделениеКомпании.Организация;
	
КонецФункции

&НаКлиенте
Процедура ПередВводомПараметровKPI(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Результат = Записать();  // определяем записан ли элемент
	КонецЕсли;
	
	// Элемент не записан, очищаем ТЧ
	Если Результат = Неопределено или НЕ Результат Тогда
		ТаблицаПараметровДляKPI.Очистить();
	Иначе  // установим вид номенклатуры и отбор
		Элементы.ТаблицаПараметровДляKPI.ТекущиеДанные.ПараметрыДляKPI = Объект.Ссылка;
		УстановитьОтборПараметровKPI();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПараметровKPI()
	
	// Установим отбор по виду номенклатуры
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		ПараметрыKPI = РеквизитФормыВЗначение("ТаблицаПараметровДляKPI");
		
		НастройкаОтбора = ПараметрыKPI.Отбор.ПараметрыДляKPI;
		НастройкаОтбора.ВидСравнения    = ВидСравнения.Равно;
		НастройкаОтбора.Использование   = Истина;
		НастройкаОтбора.Значение        = Объект.Ссылка;
		ПараметрыKPI.Прочитать();
		
		ЗначениеВРеквизитФормы(ПараметрыKPI,"ТаблицаПараметровДляKPI");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерейтиПараметрыНастройкиKPI(Команда)
	
	ПараметрыПереходаПоГиперссылке = ПараметрыПереходаПоГиперссылке(ИмяГиперссылкиПоИмениКоманды(Команда.Имя));
	ГиперссылкаПерейтиСформироватьПараметрыИВопрос(ПараметрыПереходаПоГиперссылке);

КонецПроцедуры

&НаКлиенте
Функция ИмяГиперссылкиПоИмениКоманды(ИмяКоманды)
	
	ИмяГиперссылки = ИмяКоманды;
	ИмяГиперссылки = СтрЗаменить(ИмяГиперссылки, "Команда", "Гиперссылка");
	
	Возврат ИмяГиперссылки;
	
КонецФункции

&НаКлиенте
Функция ПараметрыПереходаПоГиперссылке(ИмяЭлемента)
	
	Если ИмяЭлемента = "КомандаПерейтиПараметрыНастройкиKPI" Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ПараметрыДляKPI", Объект.Ссылка);
		
		ПараметрыПереходаПоГиперссылке = Новый Структура;
		ПараметрыПереходаПоГиперссылке.Вставить("ИмяФормы", "РегистрСведений.ПараметрыНастройкиKPI.Форма.ФормаСписка");
		ПараметрыПереходаПоГиперссылке.Вставить("ПараметрыФормы", ПараметрыФормы);
		
	КонецЕсли;
	
	Если Не ПараметрыПереходаПоГиперссылке.Свойство("РежимОткрытияОкнаФормы") Тогда
		ПараметрыПереходаПоГиперссылке.Вставить("РежимОткрытияОкнаФормы", РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	ПараметрыПереходаПоГиперссылке.Вставить("ИмяЭлемента", ИмяЭлемента);
	
	Возврат ПараметрыПереходаПоГиперссылке;
	
КонецФункции

&НаКлиенте
Процедура ГиперссылкаПерейтиСформироватьПараметрыИВопрос(ПараметрыПереходаПоГиперссылке)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
		|Переход к дополнительной информции возможен только после записи элемента.
		|Записать элемент?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ГиперссылкаПерейтиВопросЗавершение", ЭтотОбъект, ПараметрыПереходаПоГиперссылке), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ГиперссылкаПерейти(ПараметрыПереходаПоГиперссылке);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПерейтиВопросЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭлементЗаписан = Записать();
	Исключение
		Возврат;
	КонецПопытки;
	
	Если Не ЭлементЗаписан Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПереходаПоГиперссылке = ПараметрыПереходаПоГиперссылке(ДополнительныеПараметры.ИмяЭлемента);
	ГиперссылкаПерейти(ПараметрыПереходаПоГиперссылке);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПерейти(ПараметрыПереходаПоГиперссылке)
	
	ОткрытьФорму(ПараметрыПереходаПоГиперссылке.ИмяФормы,
		ПараметрыПереходаПоГиперссылке.ПараметрыФормы, , ЭтаФорма.УникальныйИдентификатор, , , ,
		ПараметрыПереходаПоГиперссылке.РежимОткрытияОкнаФормы);
	
КонецПроцедуры


#КонецОбласти
