

Функция ПоследнееСобытие(ВидСобытия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОписаниеПоследовательностейСобытий.ВидСобытия
	               |ИЗ
	               |	Справочник.ОписаниеПоследовательностейСобытий КАК ОписаниеПоследовательностейСобытий
	               |ГДЕ
	               |	ОписаниеПоследовательностейСобытий.Последнее = ИСТИНА
	               |	И ОписаниеПоследовательностейСобытий.ВидСобытия = &ВидСобытия";
	
	Запрос.УстановитьПараметр("ВидСобытия",ВидСобытия);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
	
КонецФункции
