
// Функция получения числителя и знаменателя дробного количества маркируемого товара для пробития чека
//
// Параметры:
//  СтрокаТоваров	 - Структура		 - Товарная строка со следующими параметрами:
//   * Номенклатура	 - СправочникСсылка.Номенклатура - Товар, для которого выполняется действие.
//   * ЕдиницаИзмерения	 - СправочникСсылка.ЕдиницыИзмерения - Единица измерения, в которой товар указан в чеке.
//   * Коэффициент	 - Число - Коэффициент единицы измерения.
//   * Количество	 - Число - Количество маркируемого товара в единицах измерения строки.
//
// Возвращаемое значение:
//  Структура - Описывает количество маркированного товара и в учете. 
//   * Числитель - количество маркируемого товара в единице измерения, который указан в чеке.
//   * Знаменатель - общее количество товара в единице измерения строки по основной единице измерения.
//
Функция ДробноеКоличествоМаркированногоТовара(СтрокаТоваров) Экспорт
	
	// Найдем коэффициент
	Коэффициент = 0;
	
	// Получим из строки товаров
	Если СтрокаТоваров.Свойство("Коэффициент") Тогда
		
		Коэффициент = СтрокаТоваров.Коэффициент;
		
	КонецЕсли;
	
	// Получим из единицы измерения
	Если Коэффициент = 0 И СтрокаТоваров.Свойство("ЕдиницаИзмерения") Тогда
		
		Коэффициент = СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		
	КонецЕсли;
	
	// Найдем коэффициент основной единицы измерения номенклатуры
	КоэффициентОсновнойЕдиницы = СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
	
	Результат = Новый Структура();
	Результат.Вставить("Числитель", Цел(СтрокаТоваров.Количество));
	Результат.Вставить("Знаменатель", Цел(КоэффициентОсновнойЕдиницы / Коэффициент));
	
	Возврат Результат;
	
КонецФункции