/////////////////////////////////////////////////////////////////////////////////////////////////////
// ЗАЩИЩЕННЫЕ ФУНКЦИИ КЛИЕНТСКОГО КОНТЕКСТА
/////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

/////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ФУНКЦИИ ЗАЩИТЫ

// Получение формы защищенный модуля.
//
// Параметры:
//  Имя - Строка - Имя защищенного модуля.
// 
// Возвращаемое значение:
//  ФормаКлиентскогоПриложения - Форма защищенного модуля.
//
Функция ПолучитьЗащищенныйМодуль(Имя = "ЗащитаТОР") Экспорт
	
	ИмяМенеджера = "ВнешняяОбработка";
	
	Возврат ПолучитьФорму(СтрШаблон("%1.%2.Форма", ИмяМенеджера, Имя));
	
КонецФункции // ПолучитьЗащищенныйМодуль()

#КонецОбласти