
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Периодичность = Перечисления.Периодичность.Месяц;
		Объект.ПериодПланирования = НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Объект.Автор = ПараметрыСеанса.Пользователь;

	КонецЕсли;	

	СписокЗначения=Новый Массив;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗначения);
	
	//Если РольДоступна("Администратор") Или РольДоступна("АдминистраторСистемыKPI") Тогда
	//	ЭлементыФормы.флВсе.Видимость = Истина;
	//Иначе
	//	ЭлементыФормы.флВсе.Видимость = Ложь;
	//КонецЕсли;

	//ПравоKPI=обПраво("ДоступКKPI");
	//Если ПравоKPI=Перечисления.ПризнакОтветственности.Запрет Тогда
	//	ЭтаФорма.ТолькоПросмотр=Истина;
	//	ЭтаФорма.ЭлементыФормы.КоманднаяПанель1.Доступность=ложь;
	//	ЭтаФорма.ЭлементыФормы.Период.Доступность=ложь;
	//	ЭтаФорма.ЭлементыФормы.ПериодГод.Доступность=Ложь;
	//	ЭтаФорма.ЭлементыФормы.ПериодКвартал.Доступность=Ложь;
	//КонецЕсли;

	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма, Объект.ПериодПланирования, Объект.Организация, Объект.ПодразделениеКомпании);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодичностьПриИзменении(Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
	    Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.ПериодПланирования);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Объект.ПериодПланирования = ДобавитьМесяц(Объект.ПериодПланирования, Направление);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,3);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-3);
		КонецЕсли;
		
		ДатаПланирования = Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,12);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-12);
		КонецЕсли;
		
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.ПериодПланирования = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
			
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецГода(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли ПустаяСтрока(Объект.Периодичность) Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность!");
		Объект.Периодичность="";
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФОТПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ФОТ.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.ФОТ.ТекущиеДанные;
		
		КлючОтбора = Новый ФиксированнаяСтруктура("Сотрудник",  ТекущаяСтрока.Сотрудник);
		
		Элементы.Детализация.ОтборСтрок = КлючОтбора;
		Элементы.РезультатыРасчета.ОтборСтрок = КлючОтбора;
		Элементы.ДетализацияВыработки.ОтборСтрок = КлючОтбора;
		Элементы.КорректировкаОкладов.ОтборСтрок = КлючОтбора;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФОТПередУдалением(Элемент, Отказ)
	
	Если Элементы.ФОТ.ТекущиеДанные<>Неопределено Тогда
		
		ТекущийСотрудник=Элементы.ФОТ.ТекущиеДанные.Сотрудник;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФОТПослеУдаления(Элемент)
	
	МС=Объект.Детализация.НайтиСтроки(Новый Структура("Сотрудник",ТекущийСотрудник));
	Для Каждого ТекСтр из МС Цикл
		Объект.Детализация.Удалить(ТекСтр);
	КонецЦикла;
	
	МС=Объект.РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник",ТекущийСотрудник));
	Для Каждого ТекСтр из МС Цикл
		Объект.РезультатыРасчета.Удалить(ТекСтр);
	КонецЦикла;
	
    МС=Объект.ДетализацияВыработки.НайтиСтроки(Новый Структура("Сотрудник",ТекущийСотрудник));
	Для Каждого ТекСтр из МС Цикл
		Объект.ДетализацияВыработки.Удалить(ТекСтр);
	КонецЦикла;
	
    МС=Объект.КорректировкаОкладов.НайтиСтроки(Новый Структура("Сотрудник",ТекущийСотрудник));
	Для Каждого ТекСтр из МС Цикл
		Объект.КорректировкаОкладов.Удалить(ТекСтр);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Детализация.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено 
		И ТекущаяСтрока.KPI.Обратный Тогда
		
		УсловноеОформлениеСинеСерый();
		
	Иначе
		
		УсловноеОформлениеЧерный();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеСинеСерый()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДетализацияKPI);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Детализация.KPI");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СинеСерый);	

КонецПроцедуры	

&НаСервере
Процедура УсловноеОформлениеЧерный()
	
	ЭлементУФ = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДетализацияKPI);
	
	ОтборЭлемента = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Детализация.KPI");
	
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;   
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Черный);

КонецПроцедуры	

&НаКлиенте
Процедура РезультатыРасчетаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.РезультатыРасчета.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда 
		
		Попытка
			
			ТекущаяСтрока.Код =  ТекущаяСтрока.ЦелевыеПоказатели.Код;
			
			Если ТекущаяСтрока.ЦелевыеПоказатели.Обратный Тогда
				
				УсловноеОформлениеСинеСерый();
				
			Иначе
				
				УсловноеОформлениеЧерный();
				
			КонецЕсли;
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьЗавершение", ЭтотОбъект), "Таблица будет перезаполнена! Продолжить?",РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		КомандаЗаполнитьЗавершениеСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьЗавершениеСервер()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.ЗаполнитьДокумент(ЭтаФорма);
	ЗначениеВРеквизитФормы(ОбъектФормы,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитать(Команда)
	
	КомандаРассчитатьСервер();

КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьСервер()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.АвторасчетФОТ(ЭтаФорма);
	ЗначениеВРеквизитФормы(ОбъектФормы,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьПоСотруднику(Команда)
	
	ТекущаяСтрока = Элементы.ФОТ.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда 
		
		ТекСотрудник = ТекущаяСтрока.Сотрудник;
		
	    КомандаРассчитатьПоСотрудникуСервер(ТекСотрудник);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КомандаРассчитатьПоСотрудникуСервер(ТекСотрудник)
	
		ОбъектФормы = РеквизитФормыВЗначение("Объект");
		
		ОбъектФормы.ЗаполнитьKPI(ТекСотрудник);
		ОбъектФормы.ЗаполнитьФонды(ТекСотрудник);
		ОбъектФормы.АвторасчетФОТСотрудник(Этаформа,ТекСотрудник);
		ЗначениеВРеквизитФормы(ОбъектФормы,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьВедомость(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	КомандаПечатьВедомостьНаСервере(ТабличныйДокумент);   
	ТабличныйДокумент.Показать("Ведомость корректировки расчета");
	
КонецПроцедуры

&НаСервере
Процедура КомандаПечатьВедомостьНаСервере(ТабличныйДокумент)
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
    ТабличныйДокумент = ОбъектФормы.ПечатьВедомости();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДетализацияРасчета(Команда)
	
	ТекущаяСтрока = Элементы.ФОТ.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда 
		
		ОтборДляОтчета = Новый Структура;
		ОтборДляОтчета.Вставить("Сотрудник", ТекущаяСтрока.Сотрудник);
		
		ПараметрыДляОтчета = Новый Структура;
		ПараметрыДляОтчета.Вставить("ПериодРегистрации", Объект.ПериодПланирования);
		ПараметрыДляОтчета.Вставить("Сотрудник", ТекущаяСтрока.Сотрудник);
	    // ПараметрыДляОтчета.Вставить("Отбор", ОтборДляОтчета);
	
		Если НЕ ТекущаяСтрока.ФондПоСдельнымНарядам = 0 Тогда 
			ПараметрыДляОтчета.Вставить("Выработка", Истина);
		Иначе
			ПараметрыДляОтчета.Вставить("Выработка", Ложь);
		КонецЕсли;	
		
		ОткрытьФорму("Отчет.ИндивидуальныйЛистРасчета.ФормаОбъекта",ПараметрыДляОтчета,ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

