
Процедура АСРМ_DSFСервис_ПриЗаписиЗаказНарядаОтправкаИзмененийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	РодительМодели = ТТ_Общий.ПолучитьБрэнд(Источник.Автомобиль.Модель);
	Если Найти(РодительМодели, "FORD")>0 тогда
		Если обПраво("АвтодилерВыгрузкаВCRM_FORD") Тогда
			УспешноОтправлен=АСРМ_DSFСервис_ПротоколПодключения.ПередатьЗаказНаряд(Источник.Ссылка, Перечисления.ACPM_Портал.FORD);
			Если НЕ УспешноОтправлен Тогда
				Сообщить("Произошла ошибка при отправке заказ наряда в DSF. Попробуйте отправить его позже " + Строка(ТекущаяДата()));
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли   Найти(РодительМодели, "UAZ")>0 или Найти(РодительМодели, "УАЗ")  тогда
		Если обПраво("АвтодилерВыгрузкаВCRM_УАЗ") Тогда
			УспешноОтправлен=АСРМ_DSFСервис_ПротоколПодключения.ПередатьЗаказНаряд(Источник.Ссылка, Перечисления.ACPM_Портал.УАЗ);
			Если НЕ УспешноОтправлен Тогда
				Сообщить("Произошла ошибка при отправке заказ наряда в DSF. Попробуйте отправить его позже " + Строка(ТекущаяДата()));
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры
