
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Организация");
	СтруктураСвойств.Вставить("Подразделение");
	СтруктураСвойств.Вставить("СкладКомпании");
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("ЗаявкаНаХранениеШин");
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("Автомобиль");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ИнтервалыХранения = Новый ТаблицаЗначений;
	ИнтервалыХранения.Колонки.Добавить("ЧислоДней");
	ИнтервалыХранения.Колонки.Добавить("Представление");
	
	НовыйПериод = ИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 0;
	НовыйПериод.Представление	= "Сегодня";
	НовыйПериод = ИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 7;
	НовыйПериод.Представление	= "Хранения меньше недели";
	НовыйПериод = ИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 30;
	НовыйПериод.Представление	= "Хранения меньше месяца";
	НовыйПериод = ИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 5000;
	НовыйПериод.Представление	= "Хранения больше месяца";
	
	ПросроченныеИнтервалыХранения = Новый ТаблицаЗначений;
	ПросроченныеИнтервалыХранения.Колонки.Добавить("ЧислоДней");
	ПросроченныеИнтервалыХранения.Колонки.Добавить("Представление");
	
	НовыйПериод = ПросроченныеИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 7;
	НовыйПериод.Представление	= "Срок просрочки до недели";
	НовыйПериод = ПросроченныеИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 30;
	НовыйПериод.Представление	= "Срок просрочки до месяца";
	НовыйПериод = ПросроченныеИнтервалыХранения.Добавить();
	НовыйПериод.ЧислоДней		= 5000;
	НовыйПериод.Представление	= "Срок просрочки больше месяца";
	
	//ТаблицаИнтервалов = Новый ТаблицаЗначений;
	//ТаблицаИнтервалов.Колонки.Добавить("МинПредел",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	//ТаблицаИнтервалов.Колонки.Добавить("МаксПредел",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	//ТаблицаИнтервалов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	//ТаблицаИнтервалов.Колонки.Добавить("Порядок",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	ПревЧислоДней = -1;
	Порядок       = 0;
	
	ИнтервалыХранения.Сортировать("ЧислоДней ВОЗР");
	ТекстИнтервалыХранения = "";
	Для Каждого ТекИнтервал Из ИнтервалыХранения Цикл
		//НоваяСтрока = ТаблицаИнтервалов.Добавить();
		//НоваяСтрока.МинПредел     = ПревЧислоДней;
		//НоваяСтрока.МаксПредел    = ТекИнтервал.ЧислоДней;
		//НоваяСтрока.Представление = ТекИнтервал.Представление;
		//НоваяСтрока.Порядок       = Порядок;
		ТекстИнтервалыХранения = ТекстИнтервалыХранения + "ОБЪЕДИНИТЬ ВСЕ 
			|
			|ВЫБРАТЬ
			|	"+Формат(ПревЧислоДней, "ЧРД=.; ЧН=0; ЧГ=")+",
			|	"+Формат(ТекИнтервал.ЧислоДней, "ЧРД=.; ЧН=0; ЧГ=")+",
			|	"""+ТекИнтервал.Представление+""",
			|	"+Формат(Порядок, "ЧН=0; ЧГ=")+"
			|";
		
		ПревЧислоДней = ТекИнтервал.ЧислоДней;
		Порядок       = Порядок+1;
	КонецЦикла;
	
	//ТаблицаПросроченныхИнтервалов = Новый ТаблицаЗначений;
	//ТаблицаПросроченныхИнтервалов.Колонки.Добавить("МинПредел",     Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	//ТаблицаПросроченныхИнтервалов.Колонки.Добавить("МаксПредел",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	//ТаблицаПросроченныхИнтервалов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	//ТаблицаПросроченныхИнтервалов.Колонки.Добавить("Порядок",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	ПревЧислоДней = 0;
	
	ПросроченныеИнтервалыХранения.Сортировать("ЧислоДней ВОЗР");
	ТекстПросроченныеИнтервалыХранения = "";
	Для Каждого ТекИнтервал Из ПросроченныеИнтервалыХранения Цикл
		//НоваяСтрока = ТаблицаПросроченныхИнтервалов.Добавить();
		//НоваяСтрока.МинПредел     = ПревЧислоДней;
		//НоваяСтрока.МаксПредел    = ТекИнтервал.ЧислоДней;
		//НоваяСтрока.Представление = ТекИнтервал.Представление;
		//НоваяСтрока.Порядок       = Порядок;
		
		ТекстПросроченныеИнтервалыХранения = ТекстПросроченныеИнтервалыХранения + "ОБЪЕДИНИТЬ ВСЕ 
			|
			|ВЫБРАТЬ
			|	"+Формат(ПревЧислоДней, "ЧРД=.; ЧН=0; ЧГ=")+",
			|	"+Формат(ТекИнтервал.ЧислоДней, "ЧРД=.; ЧН=0; ЧГ=")+",
			|	"""+ТекИнтервал.Представление+""",
			|	"+Формат(Порядок, "ЧН=0; ЧГ=")+"
			|";
		
		ПревЧислоДней = ТекИнтервал.ЧислоДней;
		Порядок       = Порядок+1;
	КонецЦикла;
	
	//ВнешниеНаборыДанных = Новый Структура;
	//ВнешниеНаборыДанных.Вставить("ИнтервалыХранения",             ТаблицаИнтервалов);
	//ВнешниеНаборыДанных.Вставить("ПросроченныеИнтервалыХранения", ТаблицаПросроченныхИнтервалов);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СхемаКомпоновкиДанных, "dataCompositionScheme", "http://v8.1c.ru/8.1/data-composition-system/scheme");
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПродолжениеИнтервалыХранения//", ТекстИнтервалыХранения);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ПродолжениеПросроченныеИнтервалыХранения//", ТекстПросроченныеИнтервалыХранения);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстЗапроса);
	КопияСхемы = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, КопияСхемы, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

