
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ сфпСофтФонПроСервер.сфпИспользоватьЗаписьПереговоров() Тогда
		Отказ = Истина;
		Возврат;
	ИначеЕсли НЕ Параметры.Свойство("Владелец") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ЭтаФорма.ТолькоПросмотр	= НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("сфпУправлениеМаршрутизацией"));
	ЭтаФорма.Владелец	= Параметры.Владелец;
	Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Пользователь");
	Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение	= ЭтаФорма.Владелец;
	Отбор.Использование		= Истина;
	Отбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭтаФорма.ИспользоватьГруппыПользователей	= Истина;	
	//Если ЭтаФорма.ИспользоватьГруппыПользователей Тогда
	//	ЭтаФорма.Элементы.КонтролируемыйПользователь.Заголовок = "Контролируемый пользователь / группа пользователей";
	//Иначе	
		ЭтаФорма.Элементы.КонтролируемыйПользователь.Заголовок = "Контролируемый пользователь";
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЭтоГруппа");
		Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		Отбор.ПравоеЗначение	= Ложь;
		Отбор.Использование		= Истина;
		Отбор.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	Если Копирование Тогда
		ТД = Элемент.ТекущиеДанные;
		Если ТД = Неопределено Тогда Возврат; КонецЕсли;
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
		//Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		//	ЭтоГруппа = Истина;
		//	ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы);
		//Иначе
			ЭтоГруппа = Ложь;
			ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы);
		//КонецЕсли;	
	//ИначеЕсли ЭтаФорма.ИспользоватьГруппыПользователей Тогда
	//	СписокВыбораТипа = Новый СписокЗначений;
	//	СписокВыбораТипа.Добавить(Истина,	"Группа пользователей");
	//	СписокВыбораТипа.Добавить(Ложь,		"Пользователь");
	//	ВыбранныйТип = СписокВыбораТипа.ВыбратьЭлемент("Выберите тип");
	//	Если ВыбранныйТип = Неопределено Тогда Возврат; КонецЕсли;
	//	Если ВыбранныйТип.Значение Тогда
	//		ЭтоГруппа = Истина;
	//		ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы);
	//	Иначе
	//		ЭтоГруппа = Ложь;
	//		ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы);
	//	КонецЕсли;	
	Иначе	
		ЭтоГруппа = Ложь;
		ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы);
	КонецЕсли;
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	ЗаписьДобавлена = ДобавитьКонтролируемогоПользователя(ЭтаФорма.Владелец, ВыбранныйЭлемент, ЭтоГруппа);
	Если ЗаписьДобавлена Тогда
		Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьКонтролируемогоПользователя(Пользователь, КонтролируемыйПользователь, ЭтоГруппа)
	НоваяЗапись = РегистрыСведений.сфпДоступныеДляПрослушиванияПользователи.СоздатьМенеджерЗаписи();
	НоваяЗапись.Пользователь 				= Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= КонтролируемыйПользователь;
	НоваяЗапись.ЭтоГруппа					= ЭтоГруппа;
	Попытка
		НоваяЗапись.Записать(Истина);
		ЗаписьДобавлена = Истина;
	Исключение
		ЗаписьДобавлена = Ложь;
	КонецПопытки;
	Возврат ЗаписьДобавлена;
КонецФункции	

&НаСервереБезКонтекста
Функция ИзменитьКонтролируемогоПользователя(ЗаписьРегистра, КонтролируемыйПользователь)
	НоваяЗапись = РегистрыСведений.сфпДоступныеДляПрослушиванияПользователи.СоздатьМенеджерЗаписи();
	НоваяЗапись.Пользователь 				= ЗаписьРегистра.Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= КонтролируемыйПользователь;
	НоваяЗапись.Прочитать();
	Если НоваяЗапись.Выбран() Тогда Возврат Ложь; КонецЕсли;
	НоваяЗапись.Пользователь 				= ЗаписьРегистра.Пользователь;
	НоваяЗапись.КонтролируемыйПользователь	= ЗаписьРегистра.КонтролируемыйПользователь;
	НоваяЗапись.Прочитать();
	Если НЕ НоваяЗапись.Выбран() Тогда Возврат Ложь; КонецЕсли;
	НоваяЗапись.КонтролируемыйПользователь = КонтролируемыйПользователь;
	Попытка
		НоваяЗапись.Записать(Истина);
		ЗаписьИзменена = Истина;
	Исключение
		ЗаписьИзменена = Ложь;
	КонецПопытки;
	Возврат ЗаписьИзменена;
КонецФункции	

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если НЕ (Поле.Имя = "КонтролируемыйПользователь") Тогда Возврат; КонецЕсли;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
	//Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
	//	ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы);
	//Иначе
		ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы);
	//КонецЕсли;	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	ЗаписьИзменена = ИзменитьКонтролируемогоПользователя(Элемент.ТекущаяСтрока, ВыбранныйЭлемент);
	Если ЗаписьИзменена Тогда
		ТД.КонтролируемыйПользователь = ВыбранныйЭлемент;
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда Возврат; КонецЕсли;
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТД.КонтролируемыйПользователь);
	//Если ТипЗнч(ТД.КонтролируемыйПользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
	//	ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.ГруппыПользователей.ФормаВыбора", ПараметрыФормы);
	//Иначе
		ВыбранныйЭлемент = ОткрытьФормуМодально("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы);
	//КонецЕсли;	
	Если ВыбранныйЭлемент = Неопределено Тогда Возврат; КонецЕсли;
	ЗаписьИзменена = ИзменитьКонтролируемогоПользователя(Элемент.ТекущаяСтрока, ВыбранныйЭлемент);
	Если ЗаписьИзменена Тогда
		ТД.КонтролируемыйПользователь = ВыбранныйЭлемент;
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;	
КонецПроцедуры
