
//возвращает по значению перечисления картинку из библиотеки                
Функция ПолучитьИмяКартинки(ВыбЗначение) Экспорт
	
	Если ТипЗнч(ВыбЗначение) <> ТипЗнч(Перечисления.СостоянияСобытий.ПустаяСсылка()) Тогда
		Возврат "СобытияСостояниеВРаботе";
	КонецЕсли;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.СостоянияСобытий.Выполняется, 	"СобытияСостояниеВРаботе");
	СоответствиеКартинки.Вставить(Перечисления.СостоянияСобытий.Завершено, 		"СобытияСостояниеЗавершено");
	СоответствиеКартинки.Вставить(Перечисления.СостоянияСобытий.Запланировано, 	"СобытияСостояниеЗапланировано");
	СоответствиеКартинки.Вставить(Перечисления.СостоянияСобытий.Отменено, 		"СобытияСостояниеОтменено");
	СоответствиеКартинки.Вставить(Перечисления.СостоянияСобытий.Утверждено, 	"СобытияСостояниеУтверждено");
	
 	ИмяКартинки = СоответствиеКартинки.Получить(ВыбЗначение);
	Если ИмяКартинки = Неопределено Тогда
		Возврат "СобытияСостояниеВРаботе";
	КонецЕсли;
	
	Возврат ИмяКартинки;
КонецФункции

//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	Список = Новый СписокЗначений;
	Для Каждого ТекПеречисление Из Метаданные.Перечисления.СостоянияСобытий.ЗначенияПеречисления Цикл
		ЗнПеречисление = Перечисления.СостоянияСобытий[ТекПеречисление.Имя];
		ИмяКартинки = ПолучитьИмяКартинки(ЗнПеречисление);
		Список.Добавить(ЗнПеречисление,ТекПеречисление.Синоним,,БиблиотекаКартинок[ИмяКартинки]);	
	КонецЦикла;
	Возврат Список;
КонецФункции
#КонецЕсли

