
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	НастройкиВарианта = "";
//	Если Параметры.Свойство("СформироватьПриОткрытии") и Параметры.Свойство("Вариант",НастройкиВарианта) Тогда
//		Если не НастройкиВарианта = Неопределено Тогда
//			
//			ОтчетОбъект = Отчеты.БТ_ДебиторскаяЗадолженность.Создать();
//			
//		    Схема = ОтчетОбъект.СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Расшифровка.Схема.ВариантыНастроек.Основной;    
//		    Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));    
//			
//			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
//			
//			СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
//			Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ложь;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура Отборы(Команда)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = не Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость;
КонецПроцедуры
 