

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеСтрокТЧ")
	//		И НЕ ПолученныеДанныеСтруктура.ДоступнаРольАдминистратор Тогда
	//	ОткрытьЗначение(ПолученныеДанныеСтруктура.БПОснование);
	//	//ОткрытьЗначение(ПолучитьОснованиеБП(Объект.БизнесПроцесс));
	//	Отказ = Истина;
	//ИначеЕсли НЕ ПолученныеДанныеСтруктура.ДоступнаРольАдминистратор Тогда
	//	
	//	//2017-09-19 Губа 000104694 Нач
	//	Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.КонтрольИсполненияОбязательствДоговора") Тогда
	//		ОткрытьФорму("БизнесПроцесс.КонтрольИсполненияОбязательствДоговора.ФормаОбъекта",Новый Структура("Ключ,ТекущаяЗадача",Объект.БизнесПроцесс,Объект.Ссылка),
	//		ВладелецФормы);
	//	// 000132324 ПетренкоДА 08.05.2020 Начало
	//	ИначеЕсли ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗаявкиФинансовогоДепартамента") Тогда
	//		ОткрытьФорму("БизнесПроцесс.ЗаявкиФинансовогоДепартамента.Форма.ФормаБизнесПроцесса",Новый Структура("Ключ,ТекущаяЗадача",Объект.БизнесПроцесс,Объект.Ссылка),
	//		ВладелецФормы);
	//	// 000132324 ПетренкоДА 08.05.2020 Конец
	//	Иначе
	//		ПоказатьЗначение(,Объект.БизнесПроцесс);			
	//	КонецЕсли; 
	//	//ОткрытьЗначение(Объект.БизнесПроцесс);
	//	//2017-09-19 Губа 000104694 Кон 
	//	
	//	Отказ = Истина;
	//КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОснованиеБП(БП)
	Возврат БП.Основание;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Не РольДоступна("Администратор") Тогда
	//	Отказ = Истина;
	//	Сообщить("Недостаточно прав доступа!");
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ПолученныеДанныеСтруктура = Новый Структура;
	//ПолученныеДанныеСтруктура.Вставить("ДоступнаРольАдминистратор", РольДоступна("Администратор"));
	//Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеСтрокТЧ") Тогда
	//	ПолученныеДанныеСтруктура.Вставить("БПОснование", Объект.БизнесПроцесс.Основание);
	//КонецЕсли;
КонецПроцедуры
