//Функция получения заявки на хранение шин по подчиненности документов
Функция ПолучитьРабочийЛист(ДокументОснование) Экспорт
	РабочийЛист=ДокументОснование;
	Пока ТипЗнч(РабочийЛист)<>Тип("ДокументСсылка.РабочийЛист") Цикл
		Если обЗначениеНеЗаполнено(РабочийЛист) Тогда
			Прервать;
		КонецЕсли;
		Попытка
			РабочийЛист=РабочийЛист.ДокументОснование;
		Исключение
			РабочийЛист=Неопределено;
			Прервать;
		КонецПопытки; 
	КонецЦикла;
	Если обЗначениеНеЗаполнено(РабочийЛист) Тогда
		РабочийЛист=Неопределено;
	КонецЕсли;
	Возврат РабочийЛист;
КонецФункции // ПолучитьЗаявкуНаХранениеШин()

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("РабочийЛист"             , "Рабочий лист");
	СтруктураМакетов.Вставить("РабочийЛистЗвонка"       , "Рабочий лист звонка");
	СтруктураМакетов.Вставить("РабочийЛистВстречи"      , "Рабочий лист встречи");
	СтруктураМакетов.Вставить("КоммерческоеПредложение" , "Коммерческое предложение");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти