Функция ПодключитьSQL(ПрофильSQL)  Экспорт
	
	ADOСоединение  = Новый COMОбъект("ADODB.Connection");
	
	Строка = "Provider=SQLOLEDB;
	//|Persist Security Info=True;
	|User ID="+ПрофильSQL.Пользователь+";
	|PWD="+ ПрофильSQL.Пароль+";
	|Initial Catalog="+ ПрофильSQL.База+";
	|Data Source="+ ПрофильSQL.Сервер;
	
	Попытка
		
		ADOСоединение.Open(строка);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		Возврат Неопределено;
		
	КонецПопытки;	
	
	Возврат ADOСоединение;
КонецФункции

Функция ПредставлениеДатыSQL(дат) Экспорт
	Возврат "'"+формат(дат,"ДФ='yyyyMMdd HH:mm:ss'")+"'";
КонецФункции

Функция ПредставлениеЧислаSQL(чис) Экспорт
	Возврат стрЗаменить(стрЗаменить(Строка(чис),символ(160),""),",",".");
КонецФункции

Функция ПредставлениеСтрокиSQL(стр)  Экспорт
	Возврат "'"+СокрЛП(СтрЗаменить(стрзаменить(стр,"'",""),"\",""))+"'";
КонецФункции
