#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА
 
// Устанавливает интервал
//
// Параметры
//	Изменение - число
//	ДатаНачалаПериодаФорыОтчета - Дата
//	ДатаКонцаФормыПериодаОтчета - Дата
//
Процедура УстановитьИнтервал(Изменение=0, ДатаНачалаПериодаФорыОтчета="", ДатаКонцаФормыПериодаОтчета="") Экспорт
	
	Если ДатаНачалаПериодаФорыОтчета<>"" Тогда
		ДатаНачала = ДатаНачалаПериодаФорыОтчета;
	КонецЕсли;
	
	Если ДатаНачалаПериодаФорыОтчета<>"" Тогда
		ДатаКонца = ДатаКонцаФормыПериодаОтчета;
	КонецЕсли; 	
	
	Если СценарийПланирования.Периодичность=Перечисления.ПериодичностьПланирования.Месяц Тогда
		ДатаНачала = НачалоМесяца(ДобавитьМесяц(ДатаНачала, Изменение));
		ДатаКонца  = КонецМесяца(ДобавитьМесяц(ДатаКонца,Изменение));
		Если ДатаКонца<ДатаНачала Тогда
			ДатаКонца = КонецМесяца(ДатаНачала);
		КонецЕсли;
		
	ИначеЕсли СценарийПланирования.Периодичность=Перечисления.ПериодичностьПланирования.Квартал Тогда
		ДатаНачала = НачалоКвартала(ДобавитьМесяц(ДатаНачала, Изменение*3));
		ДатаКонца  = КонецКвартала(ДобавитьМесяц(ДатаКонца,Изменение*3));
        Если ДатаКонца<ДатаНачала Тогда
			ДатаКонца = КонецКвартала(ДатаНачала);
		КонецЕсли;
		
	ИначеЕсли СценарийПланирования.Периодичность=Перечисления.ПериодичностьПланирования.Год Тогда
		ДатаНачала = НачалоГода(ДобавитьМесяц(ДатаНачала, Изменение*12));
		ДатаКонца  = КонецГода(ДобавитьМесяц(ДатаКонца,Изменение*12));
		Если ДатаКонца<ДатаНачала Тогда
			ДатаКонца = КонецГода(ДатаНачала);
		КонецЕсли;
		
	КонецЕсли;
	
	ДатаНачалаПериодаФорыОтчета = ДатаНачала;
	ДатаКонцаФормыПериодаОтчета = ДатаКонца;
КонецПроцедуры // отПолучитьМакетПостроителя_Переопределение()

// Специальная настройка измерений
//
//Без параметров
//
Процедура СпециальнаяНастройкаИзмерений() Экспорт
	
	НайденнаяСтрока = ДеревоДоступныхПолей.Строки.Найти("Период", "Имя");
	Если НайденнаяСтрока<>Неопределено Тогда
		ДеревоДоступныхПолей.Строки.Удалить(НайденнаяСтрока);
	КонецЕсли;

КонецПроцедуры // СпециальнаяНастройкаИзмерений()
    
// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	ИмяМакетаПараметров = ?(ИмяМакета = "ТекстЗапросаОборотыПоНоменклатуре","ПараметрыНоменклатуры","ПараметрыКатегорий");
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	// Ограничим тип поля номенклатура и тип номенклатуры
	ПолеНоменклатура = ПостроительОтчета.ДоступныеПоля.Найти("Номенклатура");
	Если ПолеНоменклатура<>Неопределено Тогда
		ПолеНоменклатура.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Номенклатура"); 		
	КонецЕсли;
	
	ПолеТипНоменклатуры = ПостроительОтчета.ДоступныеПоля.Найти("ТипНоменклатуры");
	Если ПолеТипНоменклатуры<>Неопределено Тогда
		ПолеТипНоменклатуры.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ТипыНоменклатуры");
	КонецЕсли;
	
	// Установим отбор по сценарию планирования
	ПостроительОтчета.Параметры.Вставить("СценарийПланирования", СценарийПланирования);

	СпециальнаяНастройкаИзмерений();
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	Если обЗначениеНеЗаполнено(СценарийПланирования) Тогда
		Предупреждение("Необходимо выбрать сценарий планирования!");
		Возврат ДокументРезультат;
	КонецЕсли;
	
	ВременныйТекстЗапроса = ТекстЗапроса;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Месяц", СокрЛП(СценарийПланирования.Периодичность));
	
	ИзмеренияКолонки.Очистить();
	Если РазворачиватьПоПериодам Тогда
		СтрокаПоиска = ИзмеренияКолонки.Добавить();
		СтрокаПоиска.Использование = Истина;
		СтрокаПоиска.ПутьКДанным   = "Период";
		СтрокаПоиска.Представление = СокрЛП(СценарийПланирования.Периодичность);
		СтрокаПоиска.ТипИзмерения  = "Элементы";
	КонецЕсли;
	
	// Установим отбор по сценарию планирования
	ПостроительОтчета.Параметры.Вставить("СценарийПланирования", СценарийПланирования);
	
	// Исправим текст запроса
	Если НЕ ВыводитьНезапланированныеДанные И РазворачиватьПоПериодам Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОЛНОЕ СОЕДИНЕНИЕ", "ЛЕВОЕ СОЕДИНЕНИЕ");		
	КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	ТекстЗапроса = ВременныйТекстЗапроса;
	
	Возврат Результат;

КонецФункции // СформироватьТабличныйДокумент()

// корректировка таблицы заголовка
Процедура ОбработкаТаблицыЗаголовка(ТаблицаЗаголовка) Экспорт
	
	НоваяСтрока = ТаблицаЗаголовка.Вставить(1);
	НоваяСтрока.Текст = "Сценарий планирования: " + Строка(СценарийПланирования);
	НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
	НоваяСтрока.Шрифт = Новый Шрифт(ТаблицаЗаголовка[0].Шрифт,, 10, Истина);
	
КонецПроцедуры // ОбработкаТаблицыЗаголовка()

//// проверка заполнения
//Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
//	
//	ПродолжитьФормирование = Истина;
//	Если обЗначениеНеЗаполнено(СценарийПланирования) Тогда
//		Предупреждение("Необходимо выбрать сценарий планирования!");
//		ПродолжитьФормирование = Ложь;
//	КонецЕсли;
//	
//	Возврат Ложь;
//	
//КонецФункции // КорректностьЗаполнения()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяРегистра = "БюджетЗакупок";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();

#КонецЕсли