
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Автомобиль");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
	ИмяУпрВалюты  = Константы.ВалютаУправленческогоУчетаКомпании.Получить().Наименование;
	
	СтруктураВалютПоказателей = Новый Структура();
	СтруктураВалютПоказателей.Вставить("СуммаЗН", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("БалансоваяСтоимость", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("ОстаточнаяСумма", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СуммаАмортизации", ИмяУпрВалюты);
	СтруктураВалютПоказателей.Вставить("СуммаОбслуживания", ИмяУпрВалюты);
	
	Для Каждого ТекРесурс Из СхемаКомпоновкиДанных.ПоляИтога Цикл
		Для Каждого ТекНабор Из СхемаКомпоновкиДанных.НаборыДанных Цикл
			Для Каждого ТекПоле Из ТекНабор.Поля Цикл
				
				Если НЕ ТипЗнч(ТекПоле) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = СокрЛП(ТекПоле.Поле);
				Если ТекРесурс.ПутьКДанным = ИмяПоля И СтруктураВалютПоказателей.Свойство(ИмяПоля) Тогда
					ТекПоле.Заголовок = ТекПоле.Заголовок + " (" + СтруктураВалютПоказателей[ИмяПоля]+")";
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ДатаПробега = КонецДня(ТекущаяДата());
	ДатаКонца   = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончания", КомпоновщикНастроек.Настройки);
	ДатаПробега = Мин(ДатаКонца, ДатаКонца);
		
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаПробега", ДатаПробега);
		
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,,Истина);
	
КонецПроцедуры
