Функция ЗаполнитьСправочникGoodsType() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыGoodsType("Телефоны", ПолучитьGoodsType_Телефоны());
		НайтиИДобавитьЭлементыGoodsType("Телефоны/Аксессуары", ПолучитьGoodsType_ТелефоныАксессуары());
		НайтиИДобавитьЭлементыGoodsType("Аудио и видео", ПолучитьGoodsType_АудиоИВидео());
		НайтиИДобавитьЭлементыGoodsType("Товары для компьютера", ПолучитьGoodsType_ТоварыДляКомпьютера());
		НайтиИДобавитьЭлементыGoodsType("Товары для компьютера/Комплектующие", ПолучитьGoodsType_ТоварыДляКомпьютераКомплектующие());
		НайтиИДобавитьЭлементыGoodsType("Фототехника", ПолучитьGoodsType_Фототехника());
		НайтиИДобавитьЭлементыGoodsType("Игры, приставки и программы", ПолучитьGoodsType_ИгрыПриставкиИПрограммы());
		НайтиИДобавитьЭлементыGoodsType("Оргтехника и расходники", ПолучитьGoodsType_ОргтехникаИРасходники());
		НайтиИДобавитьЭлементыGoodsType("Оргтехника и расходники/Расходные материалы", ПолучитьGoodsType_ОргтехникаИРасходникиРасходныеМатериалы());
		НайтиИДобавитьЭлементыGoodsType("Планшеты и электронные книги", ПолучитьGoodsType_ПланшетыИЭлектронныеКниги());
		НайтиИДобавитьЭлементыGoodsType("Планшеты и электронные книги/Аксессуары", ПолучитьGoodsType_ПланшетыИЭлектронныеКнигиАксессуары());
		НайтиИДобавитьЭлементыGoodsType("Ноутбуки", ПолучитьGoodsType_Ноутбуки());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Процедура НайтиИДобавитьЭлементыGoodsType(ИмяВладелеца, СписокGoodsType)
	Категория = Справочники.ns_Category.НайтиПоНаименованию(ИмяВладелеца);
    Если Категория.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокGoodsType Цикл
		НайтиИДобавитьЭлементGoodsType(Элемент, Категория);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементGoodsType(Наименование, Владелец)
	Элемент = Справочники.ns_GoodsType_БытоваяЭлектроника.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_GoodsType_БытоваяЭлектроника.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьGoodsType_Телефоны()
	Список = Новый Массив;
	Список.Добавить("Acer");
	Список.Добавить("Alcatel");
	Список.Добавить("ASUS");
	Список.Добавить("BlackBerry");
	Список.Добавить("BQ");
	Список.Добавить("DEXP");
	Список.Добавить("Explay");
	Список.Добавить("Fly");
	Список.Добавить("Highscreen");
	Список.Добавить("HTC");
	Список.Добавить("Huawei");
	Список.Добавить("iPhone");
	Список.Добавить("Lenovo");
	Список.Добавить("LG");
	Список.Добавить("Meizu");
	Список.Добавить("Micromax");
	Список.Добавить("Microsoft");
	Список.Добавить("Motorola");
	Список.Добавить("MTS");
	Список.Добавить("Nokia");
	Список.Добавить("Panasonic");
	Список.Добавить("Philips");
	Список.Добавить("Prestigio");
	Список.Добавить("Samsung");
	Список.Добавить("Siemens");
	Список.Добавить("SkyLink");
	Список.Добавить("Sony");
	Список.Добавить("teXet");
	Список.Добавить("Vertu");
	Список.Добавить("Xiaomi");
	Список.Добавить("ZTE");
	Список.Добавить("Другие марки");
	Список.Добавить("Рации");
	Список.Добавить("Стационарные телефоны");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ТелефоныАксессуары()
	Список = Новый Массив;
	Список.Добавить("Аккумуляторы");
	Список.Добавить("Гарнитуры и наушники");
	Список.Добавить("Зарядные устройства");
	Список.Добавить("Кабели и адаптеры");
	Список.Добавить("Модемы и роутеры");
	Список.Добавить("Чехлы и плёнки");
	Список.Добавить("Запчасти");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_АудиоИВидео()
	Список = Новый Массив;
	Список.Добавить("MP3-плееры");
	Список.Добавить("Акустика, колонки, сабвуферы");
	Список.Добавить("Видео, DVD и Blu-ray плееры");
	Список.Добавить("Видеокамеры");
	Список.Добавить("Кабели и адаптеры");
	Список.Добавить("Микрофоны");
	Список.Добавить("Музыка и фильмы");
	Список.Добавить("Музыкальные центры, магнитолы");
	Список.Добавить("Наушники");
	Список.Добавить("Телевизоры и проекторы");
	Список.Добавить("Усилители и ресиверы");
	Список.Добавить("Аксессуары");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ТоварыДляКомпьютера()
	Список = Новый Массив;
	Список.Добавить("Акустика");
	Список.Добавить("Веб-камеры");
	Список.Добавить("Джойстики и рули");
	Список.Добавить("Клавиатуры и мыши");
	Список.Добавить("Мониторы");
	Список.Добавить("Переносные жёсткие диски");
	Список.Добавить("Сетевое оборудование");
	Список.Добавить("ТВ-тюнеры");
	Список.Добавить("Флэшки и карты памяти");
	Список.Добавить("Аксессуары");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ТоварыДляКомпьютераКомплектующие()
	Список = Новый Массив;
	Список.Добавить("CD, DVD и Blu-ray приводы");
	Список.Добавить("Блоки питания");
	Список.Добавить("Видеокарты");
	Список.Добавить("Жёсткие диски");
	Список.Добавить("Звуковые карты");
	Список.Добавить("Контроллеры");
	Список.Добавить("Корпусы");
	Список.Добавить("Материнские платы");
	Список.Добавить("Оперативная память");
	Список.Добавить("Процессоры");
	Список.Добавить("Системы охлаждения");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_Фототехника()
	Список = Новый Массив;
	Список.Добавить("Компактные фотоаппараты");
	Список.Добавить("Зеркальные фотоаппараты");
	Список.Добавить("Плёночные фотоаппараты");
	Список.Добавить("Бинокли и телескопы");
	Список.Добавить("Объективы");
	Список.Добавить("Оборудование и аксессуары");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ИгрыПриставкиИПрограммы()
	Список = Новый Массив;
	Список.Добавить("Игровые приставки");
	Список.Добавить("Игры для приставок");
	Список.Добавить("Компьютерные игры");
	Список.Добавить("Программы");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ОргтехникаИРасходники()
	Список = Новый Массив;
	Список.Добавить("МФУ, копиры и сканеры");
	Список.Добавить("Принтеры");
	Список.Добавить("Телефония");
	Список.Добавить("ИБП, сетевые фильтры");
	Список.Добавить("Уничтожители бумаг");
	Список.Добавить("Канцелярия");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ОргтехникаИРасходникиРасходныеМатериалы()
	Список = Новый Массив;
	Список.Добавить("Блоки питания и батареи");
	Список.Добавить("Болванки");
	Список.Добавить("Бумага");
	Список.Добавить("Кабели и адаптеры");
	Список.Добавить("Картриджи");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ПланшетыИЭлектронныеКниги()
	Список = Новый Массив;
	Список.Добавить("Планшеты");
	Список.Добавить("Электронные книги");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ПланшетыИЭлектронныеКнигиАксессуары()
	Список = Новый Массив;
	Список.Добавить("Аккумуляторы");
	Список.Добавить("Гарнитуры и наушники");
	Список.Добавить("Док-станции");
	Список.Добавить("Зарядные устройства");
	Список.Добавить("Кабели и адаптеры");
	Список.Добавить("Модемы и роутеры");
	Список.Добавить("Стилусы");
	Список.Добавить("Чехлы и плёнки");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_Ноутбуки()
	Список = Новый Массив;
	Список.Добавить("Acer");
	Список.Добавить("Apple");
	Список.Добавить("ASUS");
	Список.Добавить("Compaq");
	Список.Добавить("Dell");
	Список.Добавить("Fujitsu");
	Список.Добавить("HP");
	Список.Добавить("Huawei");
	Список.Добавить("Lenovo");
	Список.Добавить("MSI");
	Список.Добавить("Packard Bell");
	Список.Добавить("Microsoft");
	Список.Добавить("Samsung");
	Список.Добавить("Sony");
	Список.Добавить("Toshiba");
	Список.Добавить("Xiaomi");
	Список.Добавить("Другой");
	
	Возврат Список;
КонецФункции

Функция СправочникБытоваяЭлектроникаСопоставлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_БытоваяЭлектроника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_БытоваяЭлектроника КАК ns_БытоваяЭлектроника";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

// Область Выгрузка

Функция ПолучитьДанныеНоменклатуры(МагазинСтрока) Экспорт 
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьIDКатегории() Тогда
		Префикс = "tech-" + Строка(МагазинСтрока.Магазин.Префикс) + "-";
	Иначе
		Префикс = Строка(МагазинСтрока.Магазин.Префикс);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_БытоваяЭлектроника.Номенклатура КАК Номенклатура,
	|	ns_БытоваяЭлектроника.Title КАК Title,
	|	ns_БытоваяЭлектроника.AdStatus КАК AdStatus,
	|	ns_БытоваяЭлектроника.AllowEmail КАК AllowEmail,
	|	ns_БытоваяЭлектроника.AvitoId КАК AvitoId,
	|	ns_БытоваяЭлектроника.Category КАК Category,
	|	ns_БытоваяЭлектроника.GoodsType КАК GoodsType,
	|	ns_БытоваяЭлектроника.DateBegin КАК DateBegin,
	|	ns_БытоваяЭлектроника.DateEnd КАК DateEnd,
	|	&Префикс + ns_БытоваяЭлектроника.Id КАК Id,
	|	ns_БытоваяЭлектроника.ListingFee КАК ListingFee,
	|	ns_БытоваяЭлектроника.nsDescription КАК nsDescription,
	|	ns_БытоваяЭлектроника.VideoURL КАК VideoURL,
	|	ns_БытоваяЭлектроника.Шаблон КАК Шаблон,
	|	0 КАК Price,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(17)) КАК ContactPhone,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК ManagerName,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Address,
	|	ns_БытоваяЭлектроника.Артикул КАК Артикул,
	|	ns_БытоваяЭлектроника.Наименование КАК Наименование,
	|	ns_БытоваяЭлектроника.Характеристика КАК Характеристика,
	|	ns_БытоваяЭлектроника.Ссылка КАК Ссылка,
	|	ns_БытоваяЭлектроника.Condition КАК Condition,
	|	ns_БытоваяЭлектроника.ProductsType КАК ProductsType
	|ИЗ
	|	Справочник.ns_БытоваяЭлектроника КАК ns_БытоваяЭлектроника
	|ГДЕ
	|	ns_БытоваяЭлектроника.ЭтоГруппа = ЛОЖЬ
	|	И ns_БытоваяЭлектроника.Выгружать = ИСТИНА";
	Запрос.УстановитьПараметр("Префикс", Префикс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

// Область Выгрузка

//Область Сопоставление

Процедура Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления) Экспорт
	Изменен = Истина;
	
	СсылкаНаЭлемент = ns_Сопоставление.НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		ОбъектЭлемент = Справочники.ns_БытоваяЭлектроника.СоздатьЭлемент();
		ОбъектЭлемент.Номенклатура = Ссылка;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ОбъектЭлемент.Характеристика = Характеристика;
			Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		Иначе
			Id = Строка(Ссылка.УникальныйИдентификатор());
		КонецЕсли; 
		ОбъектЭлемент.Id = Id;
		ОбъектЭлемент.Выгружать = ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьВВыгрузку();
		ОбъектЭлемент.Condition = ns_ОбщегоНазначенияПовтИсп.ПолучитьConditionБытоваяЭлектроника();
		
		Изменен = Истина;
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли; 
	
	ns_Сопоставление.ЗаполнитьTitle(ОбъектЭлемент);
	ns_Сопоставление.ЗаполнитьDescription(Ссылка, ОбъектЭлемент);
	
	ОбъектЭлемент.ПометкаУдаления = Ссылка.ПометкаУдаления;
	ОбъектЭлемент.Наименование = Ссылка.Наименование;
	ОбъектЭлемент.Артикул = Ссылка.Артикул;
	ОбъектЭлемент.Родитель = Справочники.ns_БытоваяЭлектроника.ПолучитьСсылку(Родитель.УникальныйИдентификатор());
	
	Если Изменен Тогда
		ОбъектЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьЭлементНоменклатуры(Ссылка) Экспорт
	ns_Сопоставление.СопоставитьЭлементНоменклатуры(Ссылка, "ns_БытоваяЭлектроника");			
КонецПроцедуры
 
//КонецОбласти 












