
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем Имя Экспорт; // Строка. Имя АРМ. Определяется при вызове из "функциональной панели"
Перем ИмяКнопкиФункциональнойПанели Экспорт; // Строка. Имя нажатой кнопки на функциональной панели
Перем СтруктураПараметров Экспорт; // Структура. Передаются начальные параметры заполнения АРМ.
Перем ИмяТочкиВызова Экспорт; // Строка. Идентификатор АРМ или другого источника, откуда открыт АРМ.

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ


#КонецЕсли