// Процедура запуска обработки или отчета
// Параметры:
//	СсылкаНаОбъект - ссылка на справочник внешние печатные формы
//	ЭтоОтчет - признак того, что обработка отчет
//
Процедура ОбработатьВыборОбработкиОтчета(СсылкаНаОбъект,ЭтоОтчет=Истина) Экспорт
	#Если Клиент Тогда
		ПутьКФайлу="";
		Если СсылкаНаОбъект.ХранитьВоВнешнемФайле Тогда
			ПутьКФайлу=СсылкаНаОбъект.ПутьКВнешнемуФайлу;
		Иначе
			Обработка=СсылкаНаОбъект.Хранилище.Получить();
			Если обЗначениеНеЗаполнено(Обработка) Тогда
				Предупреждение(?(ЭтоОтчет,"Отчет","Обработка")+" не загружена в базу!",10);
				Возврат;
			КонецЕсли;
			
			ПутьКФайлу=ПолучитьИмяВременногоФайла();
			Обработка.Записать(ПутьКФайлу);
		КонецЕсли;
		Если НЕ обЗначениеНеЗаполнено(ПутьКФайлу) Тогда
			Попытка
				Если ЭтоОтчет Тогда
					ВнешниеОтчеты.Создать(ПутьКФайлу).ПолучитьФорму().Открыть();
				Иначе
					ВнешниеОбработки.Создать(ПутьКФайлу).ПолучитьФорму().Открыть();
				КонецЕсли;
			Исключение
				Ошибка=ОписаниеОшибки();
				Сообщить(Ошибка);
			КонецПопытки;
		Иначе
			Предупреждение("Не удалось получить путь к файлу "+?(ЭтоОтчет,"внешнего отчета","внешней обработки"),10);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры