Процедура ОчиститьЖурнал() Экспорт
	НаборЗаписей = РегистрыСведений.ns_ЖурналРезультатов.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецПроцедуры

Функция ЗаписатьОшибкиВЖурнал(ТаблицаОшибок) Экспорт
	Если ТаблицаОшибок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЖурналРезультатов.НомерВыгрузки КАК НомерВыгрузки
	|ИЗ
	|	РегистрСведений.ns_ЖурналРезультатов КАК ns_ЖурналРезультатов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерВыгрузки УБЫВ";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НомерВыгрузки = 1;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НомерВыгрузки = Выборка.НомерВыгрузки + 1;
	КонецЕсли; 
	
		
	МенеджерЗаписи = РегистрыСведений.ns_ЖурналРезультатов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.НомерВыгрузки = НомерВыгрузки;
	МенеджерЗаписи.ТипСообщения = Перечисления.ns_ТипыСообщенийЖурналаРегистрации.Ошибка;
	МенеджерЗаписи.Данные = Новый ХранилищеЗначения(ТаблицаОшибок, Новый СжатиеДанных(9));
	МенеджерЗаписи.Записать();
	
	Возврат НомерВыгрузки;
КонецФункции
 

