#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти

Функция ОбновлениеПоказателей(ДокументСсылка) Экспорт
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Ложь;
	Иначе
		ОбъектДокумент = ДокументСсылка.ПолучитьОбъект();
		Для Каждого ТекСтрока Из ОбъектДокумент.Показатели Цикл
			Если НЕ ТекСтрока.Показатель.АвтоматическийРасчет Тогда
				Продолжить;
			КонецЕсли;
			ОбъектДокумент.ОбработкаРеквизита("Показатели.Показатель", ТекСтрока);
		КонецЦикла;

		Если ОбъектДокумент.Модифицированность() Тогда
			Попытка 
				ОбъектДокумент.Дата = ДокументСсылка.ДокументОснование.Дата+1; 
				ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Возврат Ложь;
			КонецПопытки;		
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции