// Заполняет пустые предопределенные элементы   
//
// Без параметров
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	// выставим флаг "БазовоеКоличество" там где он нужен
	Если НЕ ПланыВидовХарактеристик.ТипыПартий.ВозвратОтПокупателя.БазовоеКоличество Тогда
		Об=ПланыВидовХарактеристик.ТипыПартий.ВозвратОтПокупателя.ПолучитьОбъект();
		Об.БазовоеКоличество=Истина;
		Попытка Об.Записать(); Исключение КонецПопытки;
	КонецЕсли;
	Если НЕ ПланыВидовХарактеристик.ТипыПартий.ПоступлениеТоваров.БазовоеКоличество Тогда
		Об=ПланыВидовХарактеристик.ТипыПартий.ПоступлениеТоваров.ПолучитьОбъект();
		Об.БазовоеКоличество=Истина;
		Попытка Об.Записать(); Исключение КонецПопытки;
	КонецЕсли;
	Если НЕ ПланыВидовХарактеристик.ТипыПартий.ПеремещениеТоваров.БазовоеКоличество Тогда
		Об=ПланыВидовХарактеристик.ТипыПартий.ПеремещениеТоваров.ПолучитьОбъект();
		Об.БазовоеКоличество=Истина;
		Попытка Об.Записать(); Исключение КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
