// Заполняет предопределенные элементы(если они не существуют - создает новые(не предопределенные!))
// при обновлении релиза
// Флаг ЗаполнятьВсе=Истина - перезаполняет уже существующие элементы(строгое заполнение)
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	//предопределенный - "Штучный"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Штучный", //Имя заполняемого типа номенклатуры
					 "00001", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Товар, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Весовой"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Весовой", //Имя заполняемого типа номенклатуры
					 "00002", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Товар, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Истина, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Размерный"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Размерный", //Имя заполняемого типа номенклатуры
					 "00003", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Товар, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 1, //Код использования характеристик заполняемого типа номенклатуры
					 3, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Серийный"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Серийный", //Имя заполняемого типа номенклатуры
					 "00004", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Товар, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Услуга"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Услуга", //Имя заполняемого типа номенклатуры
					 "00005", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Услуга, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Тара"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Тара", //Имя заполняемого типа номенклатуры
					 "00006", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Тара, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Набор"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Набор", //Имя заполняемого типа номенклатуры
					 "00007", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Набор, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Комплект"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Комплект", //Имя заполняемого типа номенклатуры
					 "00008", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Комплект, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Основное средство"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Основное средство", //Имя заполняемого типа номенклатуры
					 "00009", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ПрочиеАктивы, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Нематериальный актив"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Нематериальный актив", //Имя заполняемого типа номенклатуры
					 "00010", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ПрочиеАктивы, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Материалы и спецоснастка"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Материалы и спецоснастка", //Имя заполняемого типа номенклатуры
					 "00011", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ПрочиеАктивы, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Спецодежда"				 
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Спецодежда", //Имя заполняемого типа номенклатуры
					 "00012", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ПрочиеАктивы, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//Заполнение для Альфы
	//предопределенный - "Шины"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Шины", //Имя заполняемого типа номенклатуры
					 "00021", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Шины, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Диски"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Диски", //Имя заполняемого типа номенклатуры
					 "00024", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Диски, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 1, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Номерные агрегаты"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Номерные агрегаты", //Имя заполняемого типа номенклатуры
					 "00022", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.НомерныеАгрегаты, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 3, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Авторабота"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Авторабота", //Имя заполняемого типа номенклатуры
					 "00023", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Услуга, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Инструменты"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Инструменты", //Имя заполняемого типа номенклатуры
					 "00025", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ПрочиеАктивы, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 2, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "ЛКМ", //Имя заполняемого типа номенклатуры
					 "00026", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.ЛКМ, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Истина, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Опции"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Опции", //Имя заполняемого типа номенклатуры
					 "00031", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Опции, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 2, //Код использования единиц измерения заполняемого типа номенклатуры
					 3, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
	//предопределенный - "Автомобили"
	ЗаполнитьЭлемент(ЗаполнятьВсе,
					 "Автомобили", //Имя заполняемого типа номенклатуры
					 "00032", //Код заполняемого типа номенклатуры
					 Перечисления.ВидыНоменклатуры.Автомобили, //Вид заполняемого типа номенклатуры
					 Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт", Истина).Ссылка, //Основная единица измерения заполняемого типа номенклатуры
					 Ложь, //Признак весового заполняемого типа номенклатуры
					 1, //Код использования единиц измерения заполняемого типа номенклатуры
					 1, //Код использования характеристик заполняемого типа номенклатуры
					 0, //Код использования штрихкодов заполняемого типа номенклатуры
					 0, //Вес единицы измерения
					 0); //Точность единицы измерения
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

// процедура заполнения элемента справочника
//
// Параметры:
// ЗаполнятьВсе 					- Булево - Признак заполнения всех реквизитов элемента справочника
// НаименованиеТипаНоменклатуры 	- Строка - Имя заполняемого типа номенклатуры
// КодТипаНоменклатуры 				- Строка - Код заполняемого типа номенклатуры
// ВидТипаНоменклатуры 				- ПеречислениеСсылка	- Вид заполняемого типа номенклатуры
// ОсновнаяЕИТипаНоменклатуры 		- СправочникСсылка 	- Основная единица измерения заполняемого типа номенклатуры
// ВесовойТипаНоменклатуры 			- Булево - Признак весового заполняемого типа номенклатуры
// ИспользованиеЕИТипаНоменклатуры 	- Число  - Код использования единиц измерения заполняемого типа номенклатуры
// ИспользованиеХарактеристикТипаНоменклатуры	- Число - Код использования характеристик заполняемого типа номенклатуры
// ИспользованиеШКТипаНоменклатуры 	- Число - Код использования штрихкодов заполняемого типа номенклатуры
// ВесЕИ 							- Число 	- Вес единицы измерения
// ТочностьЕИ 						- Число 	- Точность единицы измерения
//
Процедура ЗаполнитьЭлемент(ЗаполнятьВсе, НаименованиеТипаНоменклатуры, КодТипаНоменклатуры,
						   ВидТипаНоменклатуры, ОсновнаяЕИТипаНоменклатуры, 
						   ВесовойТипаНоменклатуры, ИспользованиеЕИТипаНоменклатуры,
						   ИспользованиеХарактеристикТипаНоменклатуры,
						   ИспользованиеШКТипаНоменклатуры, ВесЕИ, ТочностьЕИ)
	ТипНоменклатуры = Справочники.ТипыНоменклатуры.НайтиПоНаименованию(НаименованиеТипаНоменклатуры,Истина);
	Если ТипНоменклатуры.Пустая() Тогда
		ТипНоменклатуры = Справочники.ТипыНоменклатуры.СоздатьЭлемент();
	Иначе
		ТипНоменклатуры = ТипНоменклатуры.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		ТипНоменклатуры.Код = КодТипаНоменклатуры;
		ТипНоменклатуры.Наименование = НаименованиеТипаНоменклатуры;
		ТипНоменклатуры.ВидНоменклатуры = ВидТипаНоменклатуры;
		ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения = ОсновнаяЕИТипаНоменклатуры;
		ТипНоменклатуры.Весовой = ВесовойТипаНоменклатуры;
		ТипНоменклатуры.ИспользованиеЕдиницИзмерения = ИспользованиеЕИТипаНоменклатуры;
		ТипНоменклатуры.ИспользованиеХарактеристик = ИспользованиеХарактеристикТипаНоменклатуры;
		ТипНоменклатуры.ИспользованиеШтрихКодов = ИспользованиеШКТипаНоменклатуры;
	Иначе
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.Код) Тогда
			ТипНоменклатуры.Код = КодТипаНоменклатуры;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.Наименование) Тогда
			ТипНоменклатуры.Наименование = НаименованиеТипаНоменклатуры;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.ВидНоменклатуры) Тогда
			ТипНоменклатуры.ВидНоменклатуры = ВидТипаНоменклатуры;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения) Тогда
			ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения = ОсновнаяЕИТипаНоменклатуры;
		КонецЕсли;
		Если ТипНоменклатуры.Весовой <> ВесовойТипаНоменклатуры Тогда
			ТипНоменклатуры.Весовой = ВесовойТипаНоменклатуры;
		КонецЕсли; 
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.ИспользованиеЕдиницИзмерения) Тогда
			ТипНоменклатуры.ИспользованиеЕдиницИзмерения = ИспользованиеЕИТипаНоменклатуры;
		КонецЕсли;
		
		// ++ Alexku 29.08.2015
		
		//ИспользованиеШтрихКодов может быть не заполнено, когда штрихкодирование не ведется для типа номенклатуры
		//поэтому заполняем только для новых элементов!! Новый элемент определяем по заполненности другого реквизита
		
		//Если обЗначениеНеЗаполнено(ТипНоменклатуры.ИспользованиеШтрихКодов) Тогда
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.ИспользованиеХарактеристик) И ТипНоменклатуры.ИспользованиеШтрихКодов <> ИспользованиеШКТипаНоменклатуры Тогда
			ТипНоменклатуры.ИспользованиеШтрихКодов = ИспользованиеШКТипаНоменклатуры;
		КонецЕсли; 
		// -- Alexku 
		
		Если обЗначениеНеЗаполнено(ТипНоменклатуры.ИспользованиеХарактеристик) Тогда
			ТипНоменклатуры.ИспользованиеХарактеристик = ИспользованиеХарактеристикТипаНоменклатуры;
		КонецЕсли;
	КонецЕсли;
	//сохранение элемента
	НовыйЭлемент = ТипНоменклатуры.ЭтоНовый();
	Если ТипНоменклатуры.Модифицированность() Тогда
		Попытка
			ТипНоменклатуры.Записать();
			Сообщить("Справочник ""Типы номенклатуры"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ТипНоменклатуры.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 И (НЕ обЗначениеНеЗаполнено(ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения)) Тогда
		ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения.Наименование,Истина,,ТипНоменклатуры.Ссылка);
		Если обЗначениеНеЗаполнено(ЕдиницаИзмерения) Тогда
			ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
			ЕдиницаИзмерения.Владелец = ТипНоменклатуры.Ссылка;
			ЕдиницаИзмерения.УстановитьНовыйКод("");
			ЕдиницаИзмерения.Наименование = ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения.Наименование;
			ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
			ЕдиницаИзмерения.Коэффициент = 1;
			ЕдиницаИзмерения.Вес = ВесЕИ;
			ЕдиницаИзмерения.Точность = ТочностьЕИ;
			Попытка
				ЕдиницаИзмерения.Записать();
				Сообщить("Справочник ""Типы номенклатуры"" элемент """+СокрЛП(ТипНоменклатуры.Наименование)+""" добавлена единица измерения """+ЕдиницаИзмерения.Наименование+"""");
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры // ЗаполнитьЭлемент()

// Заполняет предопределенные элементы дат вступления в силу маркировки
//
Процедура ЗаполнитьПредопределенныеМаркируемыеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Типы номенлатуры"".");
	#КонецЕсли

	Если Справочники.ТипыНоменклатуры.Спецодежда.ВедетсяМаркировка
		 И НЕ ЗначениеЗаполнено(Справочники.ТипыНоменклатуры.Спецодежда.ДатаВведенияМаркировки) Тогда 
    	 ОбъектСпецодежда = Справочники.ТипыНоменклатуры.Спецодежда.ПолучитьОбъект();
		 ОбъектСпецодежда.ДатаВведенияМаркировки = Дата("20210101000000"); 
		 ОбъектСпецодежда.ОбменДанными.Загрузка = Истина;
		 Попытка
			ОбъектСпецодежда.Записать();
			Сообщить("Обновлен тип номенлатуры """ + ОбъектСпецодежда.Наименование + """");
		 Исключение
			Сообщить("Ошибка обновления типа номенклатуры """ + ОбъектСпецодежда.Наименование + """: " + ОписаниеОшибки());
		 КонецПопытки;
	КонецЕсли;

	Если Справочники.ТипыНоменклатуры.Шины.ВедетсяМаркировка
		 И НЕ ЗначениеЗаполнено(Справочники.ТипыНоменклатуры.Шины.ДатаВведенияМаркировки) Тогда 
    	 ОбъектШины = Справочники.ТипыНоменклатуры.Шины.ПолучитьОбъект();
		 ОбъектШины.ДатаВведенияМаркировки = Дата("20201215000000"); 
		 ОбъектШины.ОбменДанными.Загрузка = Истина;
		 Попытка
			ОбъектШины.Записать();
			Сообщить("Обновлен тип номенлатуры """ + ОбъектШины.Наименование + """");
		 Исключение
			Сообщить("Ошибка обновления типа номенклатуры """ + ОбъектШины.Наименование + """: " + ОписаниеОшибки());
		 КонецПопытки;
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Типы номенклатуры"" завершено.");
	#КонецЕсли
КонецПроцедуры // ЗаполнитьПредопределенныеМаркируемыеЭлементы()
