#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает код типа документа.
//
// Параметры:
//  ТипДокумента	- Перечисления.ТипыДокументов - Тип документа, для которого необходимо получить код.
//
// Возвращаемое значение:
//  Строка
//
Функция КодВидаДокумента(ТипДокумента) Экспорт
	
	Если ТипДокумента = Перечисления.ТипыДокументов.СчетФактура Тогда
		Возврат "1";
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументов.КорректировочныйСчетФактура Тогда
		Возврат "2";
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументов.УПД Тогда
		Возврат "3";
	ИначеЕсли ТипДокумента = Перечисления.ТипыДокументов.УКД Тогда
		Возврат "4";
	КонецЕсли;
	
	Возврат "5";
	
КонецФункции

#КонецОбласти

#КонецЕсли
