&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("АдресВХранилище", Отчет.АдресВХранилище);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляОткрытияФормы(Ссылка)
	Если Ссылка.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ДанныеВозврата = Новый Соответствие;
	ДанныеВозврата.Вставить("Ключ", Ссылка);
	
	Возврат	ДанныеВозврата;
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровкиЗавершение(Результат, Параметр, ДополнительныеПараметры) Экспорт
	
	ДанныеОткрытияФормы = ПолучитьДанныеДляОткрытияФормы(Параметр);
	
	Если НЕ ДанныеОткрытияФормы = Неопределено Тогда
	КонецЕсли;
	
КонецПроцедуры