
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТТ_Бюджетирование.Записывать = Истина;
	Движения.ТТ_Бюджетирование.Очистить();
	Для Каждого ТекСтрокаТаблицаПоказателей Из ТаблицаПоказателей Цикл
		
		Для НомМес = 1 По 12 Цикл
			
			План = ТекСтрокаТаблицаПоказателей["Месяц"+Строка(НомМес)];
			
			Движение = Движения.ТТ_Бюджетирование.Добавить();
			Движение.Организация = Организация;
			Движение.Период = Дата(ГодПланирования,НомМес,1);
			Движение.Показатель = ТекСтрокаТаблицаПоказателей.Показатель;
			Движение.План = План;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
