Функция РезультатОбработкиЗапроса(РезультатОбработкиКод) Экспорт
	
	РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ПустаяСсылка();
	
	Если РезультатОбработкиКод = 0 Тогда
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ЗапросИмеетКорректныйФормат;
	ИначеЕсли РезультатОбработкиКод = 1 Тогда 
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.ЗапросИмеетНекорректныйФормат;
	ИначеЕсли РезультатОбработкиКод = 2 Тогда 
		РезультатОбработки = Перечисления.КодыОбработкиЗапроса.КМИмеетНекорректныйФормат;
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции
