// Модуль справочника Модели

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("НаименованиеПолное",1);
		ОбязательныеРеквизиты.Вставить("Наименование",3);
		ОбязательныеРеквизиты.Вставить("ВалютаУчета",1);
		ОбязательныеОпции=Новый Структура();
		ОбязательныеОпции.Вставить("Опция",3);
		ОбязательныеРеквизиты.Вставить("Опции",ОбязательныеОпции);
		ОбязательныеРеквизиты.Вставить("ПризнакПредметаРасчета",1);
	КонецЕсли;
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	
	Рез = спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Если НЕ обЗначениеНеЗаполнено(Артикул) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Модели.Ссылка
		|ИЗ
		|	Справочник.Модели КАК Модели
		|ГДЕ
		|	Модели.Артикул = &Артикул
		|	И Модели.Ссылка <> &ЭтаСсылка";
		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("ЭтаСсылка", Ссылка);
		Результат = Запрос.Выполнить().Пустой();
		дкДобавитьОшибку(Ошибки,"Артикул " +Артикул+ " не уникален");
		Рез = Рез И Результат;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	Возврат Истина;
КонецФункции

// Сформировать полное наименование
Процедура СформироватьПолноеНаименование() Экспорт
	НовоеНаименованиеПолное=Наименование;
	Если НаименованиеПолное<>НовоеНаименованиеПолное Тогда
		НаименованиеПолное=НовоеНаименованиеПолное;
	КонецЕсли; 
КонецПроцедуры

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			- Строка			- Имя реквизита справочника с полным путем.
//  ЭтаФорма	- Форма				- Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя="Контрагент" Тогда
		Рез=Истина;
		НовыйДоговорВзаиморасчетов=Неопределено;
		Если обЗначениеНеЗаполнено(Контрагент) Тогда
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			КонецЕсли; 
		Иначе
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				Если ДоговорВзаиморасчетов.Владелец<>Контрагент Тогда
					НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НовыйДоговорВзаиморасчетов<>Неопределено И НовыйДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			ДоговорВзаиморасчетов=НовыйДоговорВзаиморасчетов;
			Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=Истина;
		НовыйДоговорВзаиморасчетов=Неопределено;
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			Если ДоговорВзаиморасчетов.Владелец<>Контрагент Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ИначеЕсли ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Покупка И
				ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.СКомитентом И
				ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Если НовыйДоговорВзаиморасчетов<>Неопределено И НовыйДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			ДоговорВзаиморасчетов=НовыйДоговорВзаиморасчетов;
			Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Возврат Рез;
		
	Иначе
		Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

Функция ПолучитьНаборПараметровТестДрайва(Дата=Неопределено) Экспорт
	Возврат Справочники.Модели.ПолучитьНаборПараметровТестДрайва(Ссылка, Дата);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	Если ЭтоНовый() Тогда
		Если Родитель<>Неопределено Тогда
			Автоработы = Родитель.Автоработы;
		КонецЕсли; 
		Если НЕ ЭтоГруппа Тогда
			Если обЗначениеНеЗаполнено(ВалютаУчета) Тогда
				ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ПризнакПредметаРасчета) Тогда
				ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	Модифицированность = Ложь;
КонецПроцедуры

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли