Функция ПолучитьСоответсвиеТиповРемонта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетностьПоВизитам_ПредставлениеТипПозиции""";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Индексы.Добавить("Значение");

	Возврат РезультатЗапроса;

	
КонецФункции

Процедура ВыгрузитьCSV(Знач Таблица, ИмяФайлаCSV, КолВоСтрокПропуска) Экспорт
	
	Если не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Таблица, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Таблица = ПолучитьТаблицуЗначенийИзТабДок(ТабДок);
		
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент; 
	Для инд = 1 по КолВоСтрокПропуска Цикл 
		
		ТекстовыйФайл.ДобавитьСтроку(";;");
		
	КонецЦикла;
	
	СоответсвиеТиповРемонта = ПолучитьСоответсвиеТиповРемонта();
	//Если Ложь Тогда
	//	
	//	СоответсвиеТиповРемонта = Новый ТаблицаЗначений;
	//	
	//КонецЕсли	
	Для каждого ТекСтр из Таблица Цикл
		
		Строка = "";
		
		Для каждого ТекКолонка из Таблица.Колонки Цикл
			
			Значение 		= ТекСтр[ТекКолонка.Имя];  
			ЗначениеПоля 	= Строка(Значение);
			
			Если ТекКолонка.Имя = "Типремонта" Тогда
				
				НСтр = СоответсвиеТиповРемонта.Найти(Значение, "Наименование");
				
				Если НСтр = Неопределено Тогда
					
					ЗначениеПоля = "4";
					
				Иначе
					
					ЗначениеПоля = НСтр.Значение;
					
				КонецЕсли;
				
			КонецЕсли;   
			
			
			
			//Если ТипЗнч(Значение) = Тип("Булево") Тогда
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"БЛ=0; БИ=1"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ДЛФ=D"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ЧГ=0"));
			//	
			//КонецЕсли;                    
			
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, Символы.ПС, "");
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ";", ",");
			
			Строка = Строка + ?(ПустаяСтрока(Строка), "", ";") + ?(ПустаяСтрока(ЗначениеПоля), "Отсутствует", ЗначениеПоля);
			
		КонецЦикла; 
		
		Если КолВоСтрокПропуска = 2 и Ложь Тогда
			
			Строка = Строка + ";Отсутствует;Отсутствует;Отсутствует";
			
		КонецЕсли;
			
		
		ТекстовыйФайл.ДобавитьСтроку(Строка);
		
	КонецЦикла;  
	
	ТекстовыйФайл.Записать(ИмяФайлаCSV, "windows-1251");
	
КонецПроцедуры     

Функция ПолучитьТаблицуЗначенийИзТабДок(ТабДок)
	
	СоответсвиеКолонок = новый Соответствие;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ЕстьОшибка = ложь;
	Для _У = 1 по 100 цикл
		
		Колонка 			= СокрЛП(Строка(ТабДок.Область(2,_У).Текст));
		
		Если ПустаяСтрока(Колонка) Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = СтрЗаменить(Колонка, " ", "");
		КолоНка = СтрЗаменить(Колонка, ".", "");
		КолоНка = СтрЗаменить(Колонка, "(", "");
		КолоНка = СтрЗаменить(Колонка, ")", "");
		КолоНка = СтрЗаменить(Колонка, ",", "");
		КолоНка = СтрЗаменить(Колонка, "-", "");
		ТаблицаДанных.Колонки.Добавить(КолоНка);
		 СоответсвиеКолонок.Вставить(Колонка,_У);
		
	КонецЦикла;     
	
	КолВоПропусков = 5;
	Для _У = 3 по 65535 цикл
		
		Если КолВоПропусков = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПробноеЗначение = СокрЛП(Строка(ТабДок.Область(_У,1).Текст));
		
		Если ПустаяСтрока(ПробноеЗначение) ТОгда
			КолВоПропусков = КолВоПропусков - 1;
			Продолжить;
		КонецЕсли;
		
		НовСтр = ТаблицаДанных.Добавить();
		
		Для каждого ТекСтр из СоответсвиеКолонок Цикл
			
			Значение = СокрЛП(Строка(ТабДок.Область(_У,ТекСтр.Значение).Текст));
			НовСтр[ТекСтр.Ключ] = Значение;
				
		КонецЦикла;

	КонецЦикла;
	
	Возврат ТаблицаДанных
	
КонецФункции    
