
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//Если НЕ РольДоступна("ПоказыватьАРМПоМотивации") 
	//	И НЕ РольДоступна("АдминистраторМотивации") Тогда    05.10.2021 ИНС
	ТекПользователь = ПараметрыСеанса.Пользователь;
	глПрава = обПолучитьПраваИНастройкиПользователя(ТекПользователь);

	//Если НЕ обПраво("Открывать_При_Входе_АРМ_Мотивация",глПрава,,ЭтотОбъект)
	//	И НЕ РольДоступна("АдминистраторМотивации")  Тогда
	//	
	//	Сообщить("Нарушение прав доступа",СтатусСообщения.Важное);
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	
	Если Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда
		
		Объект.Сотрудник=ПараметрыСеанса.Пользователь.Сотрудник;
		Объект.Период=НачалоМесяца(ТекущаяДата());
		
		Элементы.НадписьСотрудник.Заголовок = Объект.Сотрудник;
		
		Если НЕ Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда 
			Элементы.НадписьДолжность.Заголовок = Объект.Сотрудник.Должность;
		КонецЕсли;
	
	КонецЕсли;
	
	Элементы.ВыбранныйПериод.Заголовок = Формат(Объект.Период, "ДФ=""ММММ гггг 'г.'""");
	
	ОтобразитьОбщийСписокKPI();
	ОтобразитьРейтинг();
	
	ОтобразитьПланФакт();
	
	Если РольДоступна("АдминистраторМотивации") Тогда
		
		Элементы.КомандаВыборСотрудника.Доступность = Истина;
		Элементы.КомандаВыборСотрудника.Видимость = Истина;
		
	Иначе
		
		Элементы.КомандаВыборСотрудника.Доступность = Ложь;
		Элементы.КомандаВыборСотрудника.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьКартинку();
	
	ПараметрыЭкрана = ПолучитьИнформациюЭкрановКлиента();
	ЭтаФорма.Ширина = ПараметрыЭкрана[0].Ширина;
	ЭтаФорма.Высота = ПараметрыЭкрана[0].Высота;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинку()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.ИмяФайла,
	|	КартинкиИФайлы.Данные,
	|	КартинкиИФайлы.ДанныеВоВнешнемФайле
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &ОбъектИнформации
	|	И КартинкиИФайлы.Картинка = ИСТИНА
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Попытка
		Запрос.УстановитьПараметр("ОбъектИнформации",Объект.Сотрудник);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если РезультатЗапроса.Количество()>0 Тогда	
			
			СтрокаКартинка = РезультатЗапроса[0];
			
			Если СтрокаКартинка.ДанныеВоВнешнемФайле Тогда
				ФотоСотрудника =ПоместитьВоВременноеХранилище(Новый Картинка(РезультатЗапроса.ИмяФайла,Ложь), 
				Новый УникальныйИдентификатор); 			
			Иначе
				ФотоСотрудника = ПоместитьВоВременноеХранилище(СтрокаКартинка.Данные.Получить(), 
				Новый УникальныйИдентификатор);
			КонецЕсли;	
			
		Иначе
			
			ФотоСотрудника = ПоместитьВоВременноеХранилище(Новый Картинка, 
			Новый УникальныйИдентификатор);
			
		КонецЕсли;	
		
	Исключение
	КонецПопытки;

	                      
КонецПроцедуры // ОбновитьКартинку()

&НаСервере
Процедура ОтобразитьОбщийСписокKPI()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ТабДокумент = ОбъектФормы.ОбщийСписокKPI();
	Результат.Очистить();
	Результат.Вывести(ТабДокумент);
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаОбщийСписок(Команда)
	ОтобразитьОбщийСписокKPI()
КонецПроцедуры

&НаКлиенте
Процедура КомандаПремиальнаяБаза(Команда)
	ОтобразитьПремиальнаяБаза();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПремиальнаяБаза()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ТабДокумент = ОбъектФормы.ПремиальнаяБазаKPI();
	Результат.Очистить();
	Результат.Вывести(ТабДокумент);

КонецПроцедуры

&НаКлиенте
Процедура КомандаKPI(Команда)
	КомандаKPIНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаKPIНаСервере()
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ТабДокумент = ОбъектФормы.СписокKPI();
	Результат.Очистить();
	Результат.Вывести(ТабДокумент);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыборПериода(Команда)
	
	ОткрытьДиалогСтандартногоПериода(Объект);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогСтандартногоПериода(Контейнер, ИмяРеквизита = "ПериодСтандартный", УстановитьЗнПрКомпоновщика = Ложь) Экспорт
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала 	= Контейнер[ИмяРеквизита].ДатаНачала;
	Диалог.Период.ДатаОкончания = Контейнер[ИмяРеквизита].ДатаОкончания;
	Диалог.Период.Вариант		= Контейнер[ИмяРеквизита].Вариант;
		
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Контейнер"	, Контейнер);
	ДопПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	ДопПараметры.Вставить("УстановитьЗнПрКомпоновщика", УстановитьЗнПрКомпоновщика);
	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект, ДопПараметры);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры // ОткрытьДиалогСтандартногоПериода()

&НаКлиенте
Процедура ВыборПериодаЗавершение(ПериодРезультат, ДопПараметры) Экспорт
	
	Если ПериодРезультат <> Неопределено Тогда
		
		ИмяРеквизита = ДопПараметры.ИмяРеквизита;
		
		ДопПараметры.Контейнер[ИмяРеквизита].ДатаНачала    = ПериодРезультат.ДатаНачала;
		ДопПараметры.Контейнер[ИмяРеквизита].ДатаОкончания = ПериодРезультат.ДатаОкончания;
		ДопПараметры.Контейнер[ИмяРеквизита].Вариант 	   = ПериодРезультат.Вариант;
		
		УстановитьПериодВОбработке(НачалоМесяца(ПериодРезультат.ДатаОкончания));
		
		Элементы.ВыбранныйПериод.Заголовок = Формат(Объект.Период, "ДФ=""ММММ гггг 'г.'""");
		
		ОтобразитьОбщийСписокKPI();
		
		ОтобразитьРейтинг();
		
		ОтобразитьПланФакт();

	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериодВОбработке(ДатаОкончания)
	
	Объект.Период = ДатаОкончания;
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаВыборСотрудника(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение)
		И ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Объект.Сотрудник = ВыбранноеЗначение;
		
		Элементы.НадписьСотрудник.Заголовок = Объект.Сотрудник;
		
		Если НЕ Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() Тогда 
			Элементы.НадписьДолжность.Заголовок = Объект.Сотрудник.Должность;
		КонецЕсли;

		ОбновитьКартинку();
		
		ОтобразитьОбщийСписокKPI();
		
		ОтобразитьРейтинг();
		
		ОтобразитьПланФакт();

	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРейтинг();
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	
	РеквизитДиаграмма.Очистить();
	
	Выработка = Ложь;
	ТабДокументРейтинг = ОбъектФормы.Рейтинг(Выработка);
	
	Если Выработка Тогда
		
	    Серия = РеквизитДиаграмма.УстановитьСерию("Н/Ч");
	
	Иначе
		
		Серия = РеквизитДиаграмма.УстановитьСерию("KPI");
		
	КонецЕсли;	
		
	Для Каждого Строка ИЗ ТабДокументРейтинг Цикл
		
		Точка = РеквизитДиаграмма.УстановитьТочку(Строка.Точка);
		РеквизитДиаграмма.УстановитьЗначение(Точка, Серия, Строка.Ресурс);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПланФакт();
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	
	ДиаграммаПланФакт.Очистить();
	
	Выработка = Ложь;
	ТаблицаПланФакт = ОбъектФормы.ПолучитьПланФакт();
	
	СерияПлан = ДиаграммаПланФакт.УстановитьСерию("План");
	
	СерияФакт = ДиаграммаПланФакт.УстановитьСерию("Факт");
		
	Для Каждого Строка ИЗ ТаблицаПланФакт Цикл
		
		Если Строка.СерияПлан = "План" Тогда
			ТочкаПлан = ДиаграммаПланФакт.УстановитьТочку(Строка.ТочкаПлан);
			ДиаграммаПланФакт.УстановитьЗначение(ТочкаПлан, СерияПлан, Строка.РесурсПлан);
		КонецЕсли;
		
		Если Строка.СерияФакт = "Факт" Тогда
			ТочкаФакт = ДиаграммаПланФакт.УстановитьТочку(Строка.ТочкаФакт);
			ДиаграммаПланФакт.УстановитьЗначение(ТочкаФакт, СерияФакт, Строка.РесурсФакт);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

