// Модуль менеджера обработки АРМЗаписьНаРемонт

// Получает общие настройки АРМ и значения для них по умолчанию
//
Функция ПолучитьСписокНастроекАРМ() Экспорт
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("БазовыйГрафик", 					ПараметрыСеанса.Пользователь.Подразделение.ГрафикРаботы);
	СтруктураНастроек.Вставить("ДатаОтчета", 						ТекущаяДата());
	СтруктураНастроек.Вставить("ЗапретРедактированияУРВ",			Истина);
	СтруктураНастроек.Вставить("ИнтервалАвтоматическогоОбновления", 60);
	СтруктураНастроек.Вставить("ИнтервалКалендаря", 				30);
	СтруктураНастроек.Вставить("ИспользованиеГрафиковРабот", 		2);
	СтруктураНастроек.Вставить("КритерийРасчетаЗагруженности", 		1);
	СтруктураНастроек.Вставить("ОтображатьДанныеУРВ", 				0);
	СтруктураНастроек.Вставить("ОтображатьЛегенду", 				0);
	СтруктураНастроек.Вставить("ОтображатьТолькоРаботающих", 		Ложь);
	СтруктураНастроек.Вставить("ПоворотКалендаря", 					2);
	СтруктураНастроек.Вставить("Продолжительность", 				1);
	СтруктураНастроек.Вставить("РежимДобавленияРаботы", 			1);
	СтруктураНастроек.Вставить("РежимКалендаря", 					1);
	СтруктураНастроек.Вставить("РежимКалендаряПоУмолчанию", 		1);
	СтруктураНастроек.Вставить("РежимПланирования", 				1);
	СтруктураНастроек.Вставить("ФорматПредставленияЗаявкиНаРемонт", "&Н от &Д
																	|заказчик: &З, &Т 
																	|автомобиль: &А, &Г
																	|мастер: &М
																	|диспетчер: &И
																	|вид ремонта: &Р
																	|начало работ: &Ч
																	|окончание работ: &О
																	|причина обращения: &П");
	СтруктураНастроек.Вставить("ШиринаКолонкиВертикально", 			18);
	СтруктураНастроек.Вставить("ШиринаКолонкиГоризонтально", 		4);
	СтруктураНастроек.Вставить("ТаблицаПорядкаРабочихМест",			Новый Массив);
	СтруктураНастроек.Вставить("АвтоработаПриемки",					Справочники.Автоработы.ПустаяСсылка());
	СтруктураНастроек.Вставить("АвтоработаВыдачи",					Справочники.Автоработы.ПустаяСсылка());
	СтруктураНастроек.Вставить("ВремяДляПриемки",					15);
	СтруктураНастроек.Вставить("ВремяДляВыдачи",					15);
	
	Возврат СтруктураНастроек;
	
КонецФункции

