Функция ПолучитьСписокКатегорий() Экспорт
	СписокКатегорий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_Category.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_Category КАК ns_Category
	|ГДЕ
	|	ns_Category.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", ПолучитьРодителя());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокКатегорий;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКатегорий.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокКатегорий;
КонецФункции

Функция ПолучитьСписокПодкатегорий(Категория) Экспорт
	СписокПодкатегорий = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Категория) Тогда
		Возврат СписокПодкатегорий;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GoodsType.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_GoodsType_ДляБизнеса КАК GoodsType
	|ГДЕ
	|	GoodsType.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Категория);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокПодкатегорий;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПодкатегорий.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат СписокПодкатегорий;
КонецФункции

Функция ПолучитьОборудованиеДляБизнеса() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Оборудование для бизнеса");
КонецФункции

Функция ПолучитьРодителя() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Для бизнеса");
КонецФункции
