
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	Если ПустаяСтрока(Справочники.Действия.ГосНомер.Действие) Тогда
		
		Объект = Справочники.Действия.ГосНомер.ПолучитьОбъект();
		Объект.Наименование		= "ГосНомер";
		Объект.ПредставлениеДействия	= "%Гос номер";
		Объект.Автотекст = Истина;
		Объект.Действие = "Автотекст = Объект.ГосНомер;";
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
		
	КонецЕсли;
	
	Если ПустаяСтрока(Справочники.Действия.ДатаЗаявкиНаРемонтБезВремени.Действие) Тогда
		
		Объект = Справочники.Действия.ДатаЗаявкиНаРемонтБезВремени.ПолучитьОбъект();
		Объект.Наименование		= "ДатаЗаявкиНаРемонтБезВремени";
		Объект.ПредставлениеДействия	= "%Дата заявки на ремонт без времени";
		Объект.Автотекст = Истина;
		Объект.Действие = "Автотекст = Формат(Объект.ДатаНачала, ""ДЛФ=ДД"");";
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
		
	КонецЕсли;   
	
	Если ПустаяСтрока(Справочники.Действия.ДатаЗаявкиНаРемонтТолькоВремя.Действие) Тогда
		
		Объект = Справочники.Действия.ДатаЗаявкиНаРемонтТолькоВремя.ПолучитьОбъект();
		Объект.Наименование		= "ДатаЗаявкиНаРемонтТолькоВремя";
		Объект.ПредставлениеДействия	= "%Дата заявки на ремонт только время";
		Объект.Автотекст = Истина;
		Объект.Действие = "Автотекст = Формат(Объект.ДатаНачала, ""ДЛФ=В"");";
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
		
	КонецЕсли;
	
	Если ПустаяСтрока(Справочники.Действия.ТелефонКонсультанта.Действие) Тогда
		Объект = Справочники.Действия.ТелефонКонсультанта.ПолучитьОбъект();
		Объект.Наименование		= "ТелефонКонсультанта";
		Объект.ПредставлениеДействия	= "%Телефон консультанта";
		ТекстВыражения = "";
		ТекстВыражения = ТекстВыражения+"Если ЗначениеЗаполнено(Объект.Мастер) Тогда"+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"	Автотекст = киПолучитьПредставлениеКИ(Объект.Мастер,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный,Ложь); "+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"Иначе"+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"	Автотекст = киПолучитьПредставлениеКИ(Объект.Диспетчер,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный,Ложь); "+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"КонецЕсли;"+Символы.ПС;
	    Объект.Действие = ТекстВыражения;
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	КонецЕсли;
	
	Если ПустаяСтрока(Справочники.Действия.Консультант.Действие) Тогда
		Объект = Справочники.Действия.Консультант.ПолучитьОбъект();
		Объект.Наименование		= "Консультант";
		Объект.ПредставлениеДействия	= "%Консультант";
		ТекстВыражения = "";
		ТекстВыражения = ТекстВыражения+"Если ЗначениеЗаполнено(Объект.Мастер) Тогда"+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"	Автотекст = Объект.Мастер; "+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"Иначе"+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"	Автотекст = Объект.Диспетчер; "+Символы.ПС;
		ТекстВыражения = ТекстВыражения+"КонецЕсли;"+Символы.ПС;
	    Объект.Действие = ТекстВыражения;
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	КонецЕсли;
	
	Если ПустаяСтрока(Справочники.Действия.ГосНомерАвтоВЗаказНаряде.Действие) Тогда
		Объект = Справочники.Действия.ГосНомерАвтоВЗаказНаряде.ПолучитьОбъект();
		Объект.Наименование		= "ГосНомерАвтоВЗаказНаряде";
		Объект.ПредставлениеДействия	= "%Гос номер авто в заказ наряде";
		ТекстВыражения = "Автотекст = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Объект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Объект.Дата); "+Символы.ПС;
	    Объект.Действие = ТекстВыражения;
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.Записать();
	КонецЕсли;
КонецПроцедуры