////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучениеОграниченийНастроек() Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Группировки");
	СтруктураПолей.Вставить("Показатели");
	СтруктураПолей.Вставить("Порядок");
	СтруктураПолей.Вставить("Параметры");
	
	Возврат СтруктураПолей;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт

	//ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	СтандартнаяОбработка = Ложь;

	СписокТабДок = ВывестиСКДВТабличныйДокумент(СхемаКомпоновкиДанных, КомпоновщикНастроек);
	
	ОбъеденитьТабДок(ДокументРезультат, СписокТабДок);
	
КонецПроцедуры    

Процедура ОбъеденитьТабДок(ДокументРезультат, СписокТабДок)
	
	Для Каждого ТекТабДок из СписокТабДок Цикл
		
		ДокументРезультат.Вывести(ТекТабДок.Значение);
		
	КонецЦикла;                            
	
КонецПроцедуры



//Процедура ОбъединитьЯчейкиВТабличномДокументе(ТабличныйДокумент, МаркерОбъединения) Экспорт
//	
//	ОбъединяемыеЯчейки = НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, МаркерОбъединения);
//	ОбъединяемыеЯчейки.Колонки.Добавить("Диапазон");
//	ОбъединяемыеЯчейки.Сортировать("Верх,Лево");
//	
//	Для Каждого Строка из ОбъединяемыеЯчейки Цикл
//		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх-1, Строка.Лево);
//		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
//		Если НайденныеСтроки.Количество() Тогда
//			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
//			Строка.Диапазон.Низ = Макс(Строка.Диапазон.Низ, Строка.Верх);
//			Продолжить;
//		КонецЕсли;
//		
//		Отбор = Новый Структура("Текст,Верх,Лево", Строка.Текст, Строка.Верх, Строка.Лево-1);
//		НайденныеСтроки = ОбъединяемыеЯчейки.НайтиСтроки(Отбор);
//		Если НайденныеСтроки.Количество() Тогда
//			Строка.Диапазон = НайденныеСтроки[0].Диапазон;
//			Строка.Диапазон.Право = Макс(Строка.Диапазон.Право, Строка.Лево);
//			Продолжить;
//		КонецЕсли;
//		
//		Строка.Диапазон = Новый Структура("Текст,Верх,Лево,Низ,Право", Строка.Текст, Строка.Верх, Строка.Лево, Строка.Верх, Строка.Лево);
//	КонецЦикла;
//	
//	ОбъединяемыеЯчейки.Свернуть("Диапазон");
//	Для Каждого Строка Из ОбъединяемыеЯчейки Цикл
//		Диапазон = Строка.Диапазон;
//		Область = ТабличныйДокумент.Область(Диапазон.Верх, Диапазон.Лево, Диапазон.Низ, Диапазон.Право);
//		Область.Объединить();
//		ЦветТекстаГруппировки = Новый Цвет(100, 81, 45);
//		ЦветРамки = Новый Цвет(200, 192, 173);
//		Область.ЦветТекста = ЦветТекстаГруппировки;
//		Область.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
//		
//	КонецЦикла;
//	
//КонецПроцедуры


//Функция НайтиОбластиТабличногоДокументаПоВхождениюПодстроки(ТабличныйДокумент, ПодстрокаПоиска) Экспорт
//	
//	НайденныеОбласти = Новый ТаблицаЗначений;
//	НайденныеОбласти.Колонки.Добавить("Область");
//	НайденныеОбласти.Колонки.Добавить("Текст");
//	НайденныеОбласти.Колонки.Добавить("Верх");
//	НайденныеОбласти.Колонки.Добавить("Лево");
//	
//	НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска);
//	
//	Пока НЕ НайденнаяОбласть = Неопределено Цикл
//		
//		НоваяСтрока = НайденныеОбласти.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяОбласть);
//		НоваяСтрока.Область = НайденнаяОбласть;
//		
//		НайденнаяОбласть = ТабличныйДокумент.НайтиТекст(ПодстрокаПоиска, НайденнаяОбласть);
//		
//	КонецЦикла;
//	
//	Возврат НайденныеОбласти;
//	
//КонецФункции

Функция СформироватьТабДок(МакетСКД, Знач КомпоновщикНастроек, Подразделение = Неопределено)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();   
	
	СписокПодразделенийПараметр = Настройки.ПараметрыДанных.Элементы.Найти("ПодразделениеКомпании");       
	
	Если Не Подразделение = Неопределено Тогда   
		
		СписокПодразделенийПараметр.Значение.очистить();
		СписокПодразделенийПараметр.Значение.Добавить(Подразделение);
		
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетСКД, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	 
	Возврат ТабличныйДокумент;

	
КонецФункции


Функция ВывестиСКДВТабличныйДокумент(МакетСКД, КомпоновщикНастроек) 
	
	СписокВозврата = Новый СписокЗначений;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();   
	
	СписокПодразделенийПараметр = Настройки.ПараметрыДанных.Элементы.Найти("ПодразделениеКомпании");
	СписокПодразделений = СписокПодразделенийПараметр.Значение;
	
	Если СписокПодразделенийПараметр.Использование
		и ТипЗнч(СписокПодразделений) = тип("СписокЗначений") Тогда
		
		Для каждого ТекПодразделение из СписокПодразделений Цикл
			
			ТабДок = СформироватьТабДок(МакетСКД, КомпоновщикНастроек, ТекПодразделение.Значение) ;
			СписокВозврата.Добавить(ТабДок);
			
		КонецЦикла;       
		
		ТабДок = СформироватьТабДок(МакетСКД, КомпоновщикНастроек) ;
		СписокВозврата.Добавить(ТабДок);

			
	Иначе
		
		ТабДок = СформироватьТабДок(МакетСКД, КомпоновщикНастроек) ;
		СписокВозврата.Добавить(ТабДок);
		
	КонецЕсли;
	
	Возврат СписокВозврата;
	
КонецФункции