//методы написаны для конфигурации Альфа-Авто: Автосалон+Автосервис+Автозапчасти. Редакция 4.1
&НаСервере
Функция GetCustomers()
	// получим типы из XDTO
	ТипXDTOРезультатОперации = ФабрикаXDTO.Тип("http://mighttrust.me/", "ContragentInfo");
	ТипXDTOСвойства = ФабрикаXDTO.Тип("http://mighttrust.me/", "ContragentsInfo");
	// создадим значение XDTO для свойства
	XDTOСвойства 	= ФабрикаXDTO.Создать(ТипXDTOСвойства);
	ПланОбмена 		= Константы.SAM_ПланОбменаSAM.Получить();
	ДатаНачала 		= НачалоДня(ТекущаяДата());
	ДатаОкончания   = КонецДня(ТекущаяДата()+86400*3);
	
	Запрос 			= Новый Запрос;   
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 50) КАК Телефон,
	             	  |	КонтактнаяИнформация.Объект
	             	  |ПОМЕСТИТЬ ТЗКИ
	             	  |ИЗ
	             	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	             	  |ГДЕ
	             	  |	КонтактнаяИнформация.Тип = &Тип
	             	  |	И КонтактнаяИнформация.Вид = &Вид
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 150) КАК Адрес,
	             	  |	КонтактнаяИнформация.Объект
	             	  |ПОМЕСТИТЬ ТЗКИАдрес
	             	  |ИЗ
	             	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	             	  |ГДЕ
	             	  |	КонтактнаяИнформация.Тип = &ТипАдрес
	             	  |	И КонтактнаяИнформация.Вид = &ВидАдрес
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ПОДСТРОКА(КонтактнаяИнформация.Представление, 0, 50) КАК Email,
	             	  |	КонтактнаяИнформация.Объект
	             	  |ПОМЕСТИТЬ ТЗКИEmail
	             	  |ИЗ
	             	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	             	  |ГДЕ
	             	  |	КонтактнаяИнформация.Тип = &ТипEmail
	             	  |	И КонтактнаяИнформация.Вид = &ВидEmail
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	АвтомобилиСрезПоследних.Значение КАК Хозяин
	             	  |ПОМЕСТИТЬ ТЗХозяин
	             	  |ИЗ
	             	  |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	             	  |		ПО ЗаявкаНаРемонт.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	             	  |ГДЕ
	             	  |	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
	             	  |	И ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |	И АвтомобилиСрезПоследних.Значение ССЫЛКА Справочник.Контрагенты
	             	  |	И НЕ АвтомобилиСрезПоследних.Значение = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ЗаявкаНаРемонт.Заказчик
	             	  |ПОМЕСТИТЬ ТЗЗаказчик
	             	  |ИЗ
	             	  |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |ГДЕ
	             	  |	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |	И ЗаявкаНаРемонт.Заказчик ССЫЛКА Справочник.Контрагенты
	             	  |	И НЕ ЗаявкаНаРемонт.Заказчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ЗаявкаНаРемонт.Контрагент
	             	  |ПОМЕСТИТЬ ТЗКонтрагент
	             	  |ИЗ
	             	  |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |ГДЕ
	             	  |	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |	И ЗаявкаНаРемонт.Контрагент ССЫЛКА Справочник.Контрагенты
	             	  |	И НЕ ЗаявкаНаРемонт.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	Контрагенты.Код,
	             	  |	Контрагенты.ФормаСобственности,
	             	  |	Контрагенты.ИНН,
	             	  |	Контрагенты.КПП,
	             	  |	Контрагенты.Наименование,
	             	  |	Контрагенты.НаименованиеПолное,
	             	  |	ЕСТЬNULL(ТЗКИ.Телефон, """") КАК Телефон,
	             	  |	Контрагенты.Ссылка,
	             	  |	ЕСТЬNULL(ТЗКИEmail.Email, """") КАК Email,
	             	  |	ЕСТЬNULL(ТЗКИАдрес.Адрес, """") КАК Адрес
	             	  |ПОМЕСТИТЬ ТЗОбщая
	             	  |ИЗ
	             	  |	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИ КАК ТЗКИ
	             	  |			ПО Контрагенты.Ссылка = ТЗКИ.Объект
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИEmail КАК ТЗКИEmail
	             	  |			ПО Контрагенты.Ссылка = ТЗКИEmail.Объект
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИАдрес КАК ТЗКИАдрес
	             	  |			ПО Контрагенты.Ссылка = ТЗКИАдрес.Объект
	             	  |		ПО (ЗаявкаНаРемонт.Контрагент = Контрагенты.Ссылка
	             	  |				ИЛИ ЗаявкаНаРемонт.Заказчик.Ссылка = Контрагенты.Ссылка)
	             	  |ГДЕ
	             	  |	НЕ Контрагенты.ПометкаУдаления
	             	  |	И НЕ Контрагенты.ЭтоГруппа
	             	  |	И ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ТЗХозяин.Хозяин.Код,
	             	  |	ТЗХозяин.Хозяин.ФормаСобственности,
	             	  |	ТЗХозяин.Хозяин.ИНН,
	             	  |	ТЗХозяин.Хозяин.КПП,
	             	  |	ТЗХозяин.Хозяин.Наименование,
	             	  |	ТЗХозяин.Хозяин.НаименованиеПолное,
	             	  |	ЕСТЬNULL(ТЗКИ.Телефон, """"),
	             	  |	ТЗХозяин.Хозяин.Ссылка,
	             	  |	ЕСТЬNULL(ТЗКИEmail.Email, """"),
	             	  |	ЕСТЬNULL(ТЗКИАдрес.Адрес, """")
	             	  |ИЗ
	             	  |	ТЗХозяин КАК ТЗХозяин
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИ КАК ТЗКИ
	             	  |		ПО ТЗХозяин.Хозяин = ТЗКИ.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИEmail КАК ТЗКИEmail
	             	  |		ПО ТЗХозяин.Хозяин = ТЗКИEmail.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИАдрес КАК ТЗКИАдрес
	             	  |		ПО ТЗХозяин.Хозяин = ТЗКИАдрес.Объект
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	Контрагенты.Код,
	             	  |	Контрагенты.ФормаСобственности,
	             	  |	Контрагенты.ИНН,
	             	  |	Контрагенты.КПП,
	             	  |	Контрагенты.Наименование,
	             	  |	Контрагенты.НаименованиеПолное,
	             	  |	ЕСТЬNULL(ТЗКИ.Телефон, """"),
	             	  |	КонтрагентыИзменения.Ссылка,
	             	  |	ЕСТЬNULL(ТЗКИEmail.Email, """"),
	             	  |	ЕСТЬNULL(ТЗКИАдрес.Адрес, """")
	             	  |ИЗ
	             	  |	Справочник.Контрагенты КАК Контрагенты
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИ КАК ТЗКИ
	             	  |		ПО Контрагенты.Ссылка = ТЗКИ.Объект
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
	             	  |		ПО Контрагенты.Ссылка = КонтрагентыИзменения.Ссылка
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИEmail КАК ТЗКИEmail
	             	  |		ПО Контрагенты.Ссылка = ТЗКИEmail.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИАдрес КАК ТЗКИАдрес
	             	  |		ПО Контрагенты.Ссылка = ТЗКИАдрес.Объект
	             	  |ГДЕ
	             	  |	НЕ Контрагенты.ПометкаУдаления
	             	  |	И НЕ Контрагенты.ЭтоГруппа
	             	  |	И КонтрагентыИзменения.Узел = &Узел
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ТЗЗаказчик.Заказчик.Код,
	             	  |	ТЗЗаказчик.Заказчик.ФормаСобственности,
	             	  |	ТЗЗаказчик.Заказчик.ИНН,
	             	  |	ТЗЗаказчик.Заказчик.КПП,
	             	  |	ТЗЗаказчик.Заказчик.Наименование,
	             	  |	ТЗЗаказчик.Заказчик.НаименованиеПолное,
	             	  |	ЕСТЬNULL(ТЗКИ.Телефон, """"),
	             	  |	ТЗЗаказчик.Заказчик.Ссылка,
	             	  |	ЕСТЬNULL(ТЗКИEmail.Email, """"),
	             	  |	ЕСТЬNULL(ТЗКИАдрес.Адрес, """")
	             	  |ИЗ
	             	  |	ТЗЗаказчик КАК ТЗЗаказчик
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИ КАК ТЗКИ
	             	  |		ПО ТЗЗаказчик.Заказчик.Ссылка = ТЗКИ.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИEmail КАК ТЗКИEmail
	             	  |		ПО ТЗЗаказчик.Заказчик.Ссылка = ТЗКИEmail.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИАдрес КАК ТЗКИАдрес
	             	  |		ПО ТЗЗаказчик.Заказчик.Ссылка = ТЗКИАдрес.Объект
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	ТЗКонтрагент.Контрагент.Код,
	             	  |	ТЗКонтрагент.Контрагент.ФормаСобственности,
	             	  |	ТЗКонтрагент.Контрагент.ИНН,
	             	  |	ТЗКонтрагент.Контрагент.КПП,
	             	  |	ТЗКонтрагент.Контрагент.Наименование,
	             	  |	ТЗКонтрагент.Контрагент.НаименованиеПолное,
	             	  |	ЕСТЬNULL(ТЗКИ.Телефон, """"),
	             	  |	ТЗКонтрагент.Контрагент.Ссылка,
	             	  |	ЕСТЬNULL(ТЗКИEmail.Email, """"),
	             	  |	ЕСТЬNULL(ТЗКИАдрес.Адрес, """")
	             	  |ИЗ
	             	  |	ТЗКонтрагент КАК ТЗКонтрагент
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИ КАК ТЗКИ
	             	  |		ПО ТЗКонтрагент.Контрагент.Ссылка = ТЗКИ.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИEmail КАК ТЗКИEmail
	             	  |		ПО ТЗКонтрагент.Контрагент.Ссылка = ТЗКИEmail.Объект
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗКИАдрес КАК ТЗКИАдрес
	             	  |		ПО ТЗКонтрагент.Контрагент.Ссылка = ТЗКИАдрес.Объект
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТЗОбщая.Код,
	             	  |	ТЗОбщая.ФормаСобственности,
	             	  |	ТЗОбщая.ИНН,
	             	  |	ТЗОбщая.КПП,
	             	  |	ТЗОбщая.Наименование,
	             	  |	ПОДСТРОКА(ТЗОбщая.НаименованиеПолное, 0, 150) КАК НаименованиеПолное,
	             	  |	ТЗОбщая.Телефон,
	             	  |	ТЗОбщая.Ссылка,
	             	  |	ТЗОбщая.Email,
	             	  |	ТЗОбщая.Адрес
	             	  |ИЗ
	             	  |	ТЗОбщая КАК ТЗОбщая
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	ТЗОбщая.Код,
	             	  |	ТЗОбщая.ИНН,
	             	  |	ТЗОбщая.КПП,
	             	  |	ТЗОбщая.Наименование,
	             	  |	ТЗОбщая.ФормаСобственности,
	             	  |	ТЗОбщая.Email,
	             	  |	ТЗОбщая.Телефон,
	             	  |	ТЗОбщая.Ссылка,
	             	  |	ПОДСТРОКА(ТЗОбщая.НаименованиеПолное, 0, 150),
	             	  |	ТЗОбщая.Адрес";
	Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Узел",ПланОбмена);
	Запрос.УстановитьПараметр("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Запрос.УстановитьПараметр("ВидАдрес",Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Запрос.УстановитьПараметр("ТипАдрес",Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ВидEmail",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	Запрос.УстановитьПараметр("ТипEmail",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		
		// создадим значение XDTO для результата
		XDTOПозиции 		= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);
		
		// заполним результат
		XDTOПозиции.DMS_ID   				= СокрЛП(Выборка.Код);                                                      						// Уникальный ID (GUID) карточки клиента
		XDTOПозиции.RegistrationReasonCode  = ?(Выборка.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, "", Выборка.КПП); 	// КПП
		XDTOПозиции.IndividualTaxNumber     = ?(Выборка.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, "", Выборка.ИНН); 	// ИНН
		XDTOПозиции.LegalEntityDescription  = СокрЛП(Выборка.Наименование); 																	// наименование
		XDTOПозиции.Gender                  = 0;                                                                       						// пол клиента физического лица
		XDTOПозиции.MainEmail               = Выборка.Email;                                                                       						// основной email клиента
		XDTOПозиции.MainTelephone           = Выборка.Телефон;																					// телефон
		XDTOПозиции.PersonTypeID            = ?(Выборка.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, 1, 0); 				// юрфизлицо
		XDTOПозиции.Address					= Выборка.Адрес;

		// добавим результат 
		XDTOСвойства.ContragentInfo.Добавить(XDTOПозиции);
		
		//МенеджерЗаписи 					= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Активность 		= Истина;
		//МенеджерЗаписи.Загружен			= Ложь;
		//МенеджерЗаписи.ЗначениеДанных	= Выборка.Ссылка;
		//МенеджерЗаписи.Записать();
	КонецЦикла;
	 
	Возврат XDTOСвойства;
КонецФункции
&НаСервере
Функция GetVehicles()
	// получим типы из XDTO
	ТипXDTOРезультатОперации = ФабрикаXDTO.Тип("http://mighttrust.me/", "VehicleInfo");
	ТипXDTOСвойства = ФабрикаXDTO.Тип("http://mighttrust.me/", "VehiclesInfo");
	// создадим значение XDTO для свойства
	XDTOСвойства 	= ФабрикаXDTO.Создать(ТипXDTOСвойства);
	ПланОбмена 		= Константы.SAM_ПланОбменаSAM.Получить();
	ДатаНачала 		= НачалоДня(ТекущаяДата());
	ДатаОкончания   = КонецДня(ТекущаяДата()+86400*3);
	Запрос 			= Новый Запрос;   
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	АвтомобилиСрезПоследних.Значение КАК ГосНомер,
	             	  |	АвтомобилиСрезПоследних.Автомобиль
	             	  |ПОМЕСТИТЬ ТЗГосНомер
	             	  |ИЗ
	             	  |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	             	  |ГДЕ
	             	  |	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	АвтомобилиСрезПоследних.Значение КАК Хозяин,
	             	  |	АвтомобилиСрезПоследних.Автомобиль
	             	  |ПОМЕСТИТЬ ТЗХозяин
	             	  |ИЗ
	             	  |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	             	  |ГДЕ
	             	  |	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	Автомобили.Код,
	             	  |	Автомобили.ТипКузова,
	             	  |	Автомобили.Модель.Родитель.Наименование КАК Марка,
	             	  |	Автомобили.Цвет,
	             	  |	Автомобили.НомерДвигателя,
	             	  |	ЕСТЬNULL(ТЗГосНомер.ГосНомер, """") КАК ГосНомер,
	             	  |	Автомобили.Модель КАК Модель,
	             	  |	ЕСТЬNULL(ТЗХозяин.Хозяин, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Хозяин,
	             	  |	Автомобили.VIN,
	             	  |	Автомобили.Ссылка,
	             	  |	Автомобили.ДатаНачалаГарантии
	             	  |ИЗ
	             	  |	Справочник.Автомобили КАК Автомобили
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗГосНомер КАК ТЗГосНомер
	             	  |		ПО Автомобили.Ссылка = ТЗГосНомер.Автомобиль
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗХозяин КАК ТЗХозяин
	             	  |		ПО Автомобили.Ссылка = ТЗХозяин.Автомобиль
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |		ПО Автомобили.Ссылка = ЗаявкаНаРемонт.Автомобиль
	             	  |ГДЕ
	             	  |	НЕ Автомобили.ЭтоГруппа
	             	  |	И НЕ Автомобили.ПометкаУдаления
	             	  |	И ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |
	             	  |ОБЪЕДИНИТЬ ВСЕ
	             	  |
	             	  |ВЫБРАТЬ
	             	  |	Автомобили.Код,
	             	  |	Автомобили.ТипКузова,
	             	  |	Автомобили.Модель.Родитель.Наименование,
	             	  |	Автомобили.Цвет,
	             	  |	Автомобили.НомерДвигателя,
	             	  |	ЕСТЬNULL(ТЗГосНомер.ГосНомер, """"),
	             	  |	Автомобили.Модель,
	             	  |	ЕСТЬNULL(ТЗХозяин.Хозяин, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	             	  |	Автомобили.VIN,
	             	  |	АвтомобилиИзменения.Ссылка,
	             	  |	Автомобили.ДатаНачалаГарантии
	             	  |ИЗ
	             	  |	Справочник.Автомобили.Изменения КАК АвтомобилиИзменения
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Автомобили КАК Автомобили
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗГосНомер КАК ТЗГосНомер
	             	  |			ПО Автомобили.Ссылка = ТЗГосНомер.Автомобиль
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗХозяин КАК ТЗХозяин
	             	  |			ПО Автомобили.Ссылка = ТЗХозяин.Автомобиль
	             	  |		ПО АвтомобилиИзменения.Ссылка = Автомобили.Ссылка
	             	  |ГДЕ
	             	  |	АвтомобилиИзменения.Узел = &Узел
	             	  |	И НЕ Автомобили.ЭтоГруппа
	             	  |	И НЕ Автомобили.ПометкаУдаления";
	//СсылкаА	= Новый СписокЗначений();
	//СсылкаА.Добавить("0TCYTCBYET");
	//СсылкаА.Добавить("0TCYTCTBYET");
	//СсылкаА.Добавить("-");
	//Запрос.УстановитьПараметр("ВИН", СсылкаА);
	Запрос.УстановитьПараметр("Узел", ПланОбмена);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		//Если СтрДлина(СокрЛП(Выборка.VIN)) < 17 Тогда
		//	Продолжить;
		//КонецЕсли;	
		
		// создадим значение XDTO для результата
		XDTOПозиции 		= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);
		
		// заполним результат
		XDTOПозиции.DMS_ID   				= СокрЛП(Выборка.Код);
		XDTOПозиции.BodyType   				= СокрЛП(Выборка.ТипКузова);  			// наименование типа кузова
		XDTOПозиции.Brand 		    		= СокрЛП(Выборка.Марка);   				// наименование марки автомобиля
		XDTOПозиции.Colour   				= СокрЛП(Выборка.Цвет); 				// наименование цвета автомобиля
		XDTOПозиции.Engine      			= СокрЛП(Выборка.НомерДвигателя); 		// номер двигателя
		XDTOПозиции.FirstRegistrationDate   = Дата(1,1,1); 							// дата первой постановки на учет
		XDTOПозиции.LicensePlate            = СокрЛП(Выборка.ГосНомер);   			// гос. номер 
		XDTOПозиции.Model                	= СокрЛП(Выборка.Модель);   			// наименование модели 
		XDTOПозиции.Owner_DMS_ID            = СокрЛП(Выборка.Хозяин.Код);			// Уникальный ID (GUID) карточки клиента
		XDTOПозиции.VIN             		= СокрЛП(Выборка.VIN); 					// VIN 
		XDTOПозиции.SaleDate				= Дата(1,1,1); 							// дата продажи (возможно дата начала гарантии), может быть NULL

		// добавим результат 
		XDTOСвойства.VehicleInfo.Добавить(XDTOПозиции);

		//МенеджерЗаписи 						= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Активность 			= Истина;
		//МенеджерЗаписи.Загружен				= Ложь;
		//МенеджерЗаписи.ЗначениеДанных		= Выборка.Ссылка;
		//МенеджерЗаписи.Записать();
	КонецЦикла;
	 
	Возврат XDTOСвойства;
КонецФункции
&НаСервере
Функция ConfirmCustomer(DMS_ID)
	Для Каждого Элемента из DMS_ID.DMS_ID Цикл 
		Контрагент					= Справочники.Контрагенты.НайтиПоКоду(СокрЛП(Элемента));
		Если не Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			
			ПланОбмена	= Константы.SAM_ПланОбменаSAM.Получить();
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена,Контрагент);
			
			//МенеджерЗаписи 					= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Активность 		= Истина;
			//МенеджерЗаписи.Загружен			= Истина;
			//МенеджерЗаписи.ЗначениеДанных	= Контрагент;
			//МенеджерЗаписи.Записать();
			
			//Запись 							= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
			//Запись.Активность 				= Истина;
			//Запись.ДатаВремя				= ТекущаяДата();
			//Запись.Метод					= "ConfirmCustomer";
			//Запись.Ошибка 					= "Успешно выполнен";
			//Попытка
			//	Запись.Записать();
			//Исключение КонецПопытки;
		Иначе
			Запись 							= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
			Запись.Активность 				= Истина;
			Запись.ДатаВремя				= ТекущаяДата();
			Запись.Метод					= "ConfirmCustomer";
			Запись.Ошибка 					= "Ошибка";
			Попытка
				Запись.Записать();
			Исключение  КонецПопытки;
			
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;	
	Возврат Истина;	
КонецФункции
&НаСервере
Функция ConfirmVehicle(DMS_ID)
	Для Каждого Элемента из DMS_ID.DMS_ID Цикл
		Запрос 						= Новый Запрос;
		Запрос.Текст				= "ВЫБРАТЬ
		            				  |	Автомобили.Ссылка
		            				  |ИЗ
		            				  |	Справочник.Автомобили КАК Автомобили
		            				  |ГДЕ
		            				  |	Автомобили.Код = &Код
		            				  |	И НЕ Автомобили.ПометкаУдаления";
		Запрос.УстановитьПараметр("Код",СокрЛП(Элемента));								  
		Рез 						= Запрос.Выполнить().Выбрать();
		Если Рез.Следующий() Тогда
			
			ПланОбмена	= Константы.SAM_ПланОбменаSAM.Получить();
			ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена,Рез.Ссылка);
			
			//МенеджерЗаписи 					= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.Активность 		= Истина;
			//МенеджерЗаписи.Загружен			= Истина;
			//МенеджерЗаписи.ЗначениеДанных	= Рез.Ссылка;
			//МенеджерЗаписи.Записать();
			
			//Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
			//Запись.Активность 	= Истина;
			//Запись.ДатаВремя	= ТекущаяДата();
			//Запись.Метод		= "ConfirmVehicle";
			//Запись.Ошибка 		= "Успешно выполнен";
			//Попытка
			//	Запись.Записать();
			//Исключение  КонецПопытки;
		Иначе
			Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
			Запись.Активность 	= Истина;
			Запись.ДатаВремя	= ТекущаяДата();
			Запись.Метод		= "ConfirmVehicle";
			Запись.Ошибка 		= "Ошибка";
			Попытка
				Запись.Записать();
			Исключение  КонецПопытки;

			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция GetActDrafts()
	// получим типы из XDTO
	ТипXDTOРезультатОперации= ФабрикаXDTO.Тип("http://mighttrust.me/", "ActDraft");
	ТипXDTOПричиныОбращения = ФабрикаXDTO.Тип("http://mighttrust.me/", "Complaint");
	ТипXDTOСвойства 		= ФабрикаXDTO.Тип("http://mighttrust.me/", "ActDrafts");
	ТипXDTOРабота 			= ФабрикаXDTO.Тип("http://mighttrust.me/", "Job");
	ТипXDTOЗЧ 				= ФабрикаXDTO.Тип("http://mighttrust.me/", "Part");
	ТипXDTOСервиснаяКомпания= ФабрикаXDTO.Тип("http://mighttrust.me/", "ServiceCampaign");

	// создадим значение XDTO для свойства
	XDTOСвойства = ФабрикаXDTO.Создать(ТипXDTOСвойства);
	
	ТЗДанных = ПолучитьТЗДанных(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()+86400*3));
	Для Каждого СтрокаТЗ из ТЗДанных Цикл
		XDTOПозиции 						= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);
		XDTOПозиции.Act_DMS_Code 			= СокрЛП(СтрокаТЗ.Номер); 							//порядковый номер документа 
		XDTOПозиции.Act_DMS_ID   			= СокрЛП(СтрокаТЗ.Ссылка.УникальныйИдентификатор());// уникальный ID (GUID) карточки документа
		XDTOПозиции.Date        			= СтрокаТЗ.Дата;    								// дата создания документа
		XDTOПозиции.EmployeeLogin 			= СокрЛП(СтрокаТЗ.Мастер); 							// логин(фамилия) пользователя(сервисного консультанта) Ответственный
		XDTOПозиции.Mileage      			= СтрокаТЗ.Пробег;    								// пробег автомобиля
		Если ЗначениеЗаполнено(СтрокаТЗ.ВладелецКод) Тогда
			XDTOПозиции.Owner_DMS_ID 		= СокрЛП(СтрокаТЗ.ВладелецКод);    					// Уникальный ID (GUID) карточки клиента собственник
		Иначе
		    XDTOПозиции.Owner_DMS_ID 		= СокрЛП(СтрокаТЗ.КонтрагентКод);
		КонецЕсли;
		XDTOПозиции.Representator_DMS_ID  	= СокрЛП(СтрокаТЗ.КонтрагентКод); 					// Уникальный ID (GUID) карточки клиента Клиент
		XDTOПозиции.VIN          			= СокрЛП(СтрокаТЗ.ВИН);         					// VIN 
		XDTOПозиции.Vehicle_DMS_ID			= СокрЛП(СтрокаТЗ.АвтомобильКод);         			// Код карточки автомобиля 
		XDTOПозиции.ContactDate    			= СтрокаТЗ.Дата;		         					// дата обращения клиента, может быть null
		XDTOПозиции.EmployeeName			= СокрЛП(СтрокаТЗ.Мастер);		         			// ФИО пользователя (сервисного консультанта) на которого записан документ
		
		////////////////////////////////////////////////////////////////////////////////////////// Добавим причины обращения, если они есть
		XDTOПрична 							= ФабрикаXDTO.Создать(ТипXDTOПричиныОбращения);
		XDTOПрична.GUID						= СокрЛП(СтрокаТЗ.ПричинаОбращенияКод);             // уникальный идентификатор жалобы/причины обращения
		XDTOПрична.Content					= СокрЛП(СтрокаТЗ.ПричинаОбращения);                // содержание жалобы/причины обращения
		XDTOПрична.Confirmed				= Ложь;                                             // false = не подтверждено, true = подтверждено
		XDTOПрична.Img						= "";                                               // путь к изображению, или изображение в формате base64string
		XDTOПозиции.Complaints.Добавить(XDTOПрична);
		
		////////////////////////////////////////////////////////////////////////////////////////// Добавим сервисную компанию, если она есть
		СервисныеКомпании					= ПолучитьСервисныеКомпании(СокрЛП(СтрокаТЗ.ВИН));
		Для Каждого СтрокаСК из СервисныеКомпании Цикл
			XDTOСК 								= ФабрикаXDTO.Создать(ТипXDTOСервиснаяКомпания);
			XDTOСК.DMS_Code						= СокрЛП(СтрокаСК.СервиснаяКампанияКод);            // Код сервисной кампании
			XDTOСК.Name							= СокрЛП(СтрокаСК.СервиснаяКампанияНаименование);   // Наименование сервисной кампании
			XDTOСК.Description					= СокрЛП(СтрокаСК.СервиснаяКампанияКомментарий);    // Полное описание сервисной кампании
			XDTOПозиции.ServiceCampaigns.Добавить(XDTOСК);
		КонецЦикла;
		
		////////////////////////////////////////////////////////////////////////////////////////// Добавим товары, если они есть
		Для каждого СтрокаТовара из  СтрокаТЗ.Товары Цикл 
			// создадим значение XDTO для результата
			XDTOЗЧ 					= ФабрикаXDTO.Создать(ТипXDTOЗЧ);
			// заполним результат
			XDTOЗЧ.GUID   			= СокрЛП(СтрокаТовара.Номенклатура.Код);					// уникальный идентификатор З/Ч, не может быть NULL
			XDTOЗЧ.Code    			= СокрЛП(СтрокаТовара.Номенклатура.Артикул);				// код З/Ч в номенклатуре, тот который используют работники сервиса. Может быть NULL
			XDTOЗЧ.Name  			= СокрЛП(СтрокаТовара.Номенклатура.Наименование);			// сокращенное наименование З/Ч, не может быть NULL
			XDTOЗЧ.Description     	= СокрЛП(СтрокаТовара.Номенклатура.НаименованиеПолное);		// полное описание З/Ч, может быть NULL
			XDTOЗЧ.Quantity  		= СтрокаТовара.Количество;			 						// количество, не может быть NULL
			XDTOЗЧ.QuantityMeasure 	= СокрЛП(СтрокаТовара.ЕдиницаИзмерения);					// единица измерения количества
			XDTOЗЧ.Price           	= СтрокаТовара.Цена; //ПолучитьЦену(СтрокаТовара.Номенклатура);					// цена З/Ч за единицу количества не может быть NULL.
			XDTOЗЧ.PriceMeasure    	= СокрЛП(СтрокаТЗ.ВалютаДокумента);							// валюта цены
			XDTOЗЧ.GroupID          = "";			 											// уникальный идентификатор группы ЗЧ. Может быть NULL

			//Status может принимать следующие значения: 
			//confirmed - идет в РемЗаказ
			//recommended - идет в рекомендации,
			//пустая строка, NULL или любое другое значение не указанное выше - не попадает ни в рекомендации ни в РемЗаказ, даже если окажется
			
			// добавим результат 
			XDTOПозиции.Parts.Добавить(XDTOЗЧ);
		КонецЦикла;
		
		////////////////////////////////////////////////////////////////////////////////////////// Добавим работы, если они есть
		Для каждого СтрокаРаботы из  СтрокаТЗ.Работы Цикл 
			// создадим значение XDTO для результата
			XDTOРаботы 					= ФабрикаXDTO.Создать(ТипXDTOРабота);
			
			// заполним результат
			XDTOРаботы.GUID   			= СокрЛП(СтрокаРаботы.Работа.Код); 					// уникальный идентификатор работы, не может быть NULL
			XDTOРаботы.Code    			= "";                   							// код работы в номенклатуре, тот который используют работники сервиса. Может быть NULL
			XDTOРаботы.Name  			= СокрЛП(СтрокаРаботы.Работа.Наименование);			// сокращенное наименование работы, не может быть NULL
			XDTOРаботы.Description     	= СокрЛП(СтрокаРаботы.Работа.НаименованиеПолное);	// полное описание работы, может быть NULL
			XDTOРаботы.TimeTerm  		= СтрокаРаботы.Количество*СтрокаРаботы.Коэффициент;	// срок/длительность выполнения работы, то не может быть NULL
			XDTOРаботы.TimeMeasure     	= "н/ч";                   							// единица измерения длительности
			XDTOРаботы.Price           	= СтрокаРаботы.Цена; 	//ПолучитьЦенуРаботы(СтрокаРаботы.Работа);          // цена работы за единицу длительности, то не может быть NULL.
			XDTOРаботы.PriceMeasure    	= СокрЛП(СтрокаТЗ.ВалютаДокумента);					// валюта цены
			XDTOРаботы.GroupID         	= ""; 												// уникальный идентификатор группы работ. Может быть NULL

			//Status может принимать следующие значения: 
			//confirmed - идет в РемЗаказ
			//recommended - идет в рекомендации,
			//пустая строка, NULL или любое другое значение не указанное выше - не попадает ни в рекомендации ни в РемЗаказ, даже если окажется
			
			// добавим результат 
			XDTOПозиции.Jobs.Добавить(XDTOРаботы);	
		КонецЦикла;
		
		XDTOСвойства.ActDraft.Добавить(XDTOПозиции);
		
		
		МенеджерЗаписи 				= РегистрыСведений.SAM_ВыгруженныеДокументы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Активность 	= Истина;
		МенеджерЗаписи.Загружен		= Ложь;
		МенеджерЗаписи.Документы	= СтрокаТЗ.Ссылка;
		МенеджерЗаписи.ID			= СтрокаТЗ.Ссылка.УникальныйИдентификатор();
		МенеджерЗаписи.Записать();
	КонецЦикла;
	//Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
	//Запись.Активность 	= Истина;
	//Запись.ДатаВремя	= ТекущаяДата();
	//Запись.Метод		= "GetActDrafts";
	//Запись.Ошибка 		= "Успешно выполнен";
	//Попытка
	//	Запись.Записать();
	//Исключение  КонецПопытки;

	 
	Возврат XDTOСвойства;
КонецФункции
&НаСервере
Функция PostAct(Act)
	НоваяЗапись 				= РегистрыСведений.SAM_ПолученныеДанныеИзSAM.СоздатьМенеджерЗаписи();
	//НаборЗаписей.Отбор.IDДокумента.Установить(СокрЛП(Act.Act_DMS_ID));
	//НаборЗаписей.Записать();
	//НаборЗаписей.Прочитать();
	//НоваяЗапись 				= НаборЗаписей.Добавить();
	НоваяЗапись.НомерДок 		= СокрЛП(Act.Act_DMS_Code); // порядковый номер документа (ремзаказа/акта
	НоваяЗапись.IDДокумента		= СокрЛП(Act.Act_DMS_ID); // уникальный ID (GUID) карточки документа
	НоваяЗапись.ДатаПодписания 	= СокрЛП(Act.Date);       // дата подписания документа клиентом
	//Act.EmployeeLastName; 
	НоваяЗапись.ПробегАвто		= СокрЛП(Act.Mileage); // пробег автомобиля по результатам его осмотра
	НоваяЗапись.НомерКарточкиСобственника 	= СокрЛП(Act.Owner_DMS_ID);  // Уникальный ID (GUID) карточки клиента, который является собственником автомобиля
	НоваяЗапись.НомерКарточкиКлиента		= СокрЛП(Act.Representator_DMS_ID); // – Уникальный ID (GUID) карточки клиента, который является представителем (доверенным лицом) собственника автомобиля
	НоваяЗапись.VIN				= СокрЛП(Act.VIN); // VIN
	НоваяЗапись.Мастер          = СокрЛП(Act.EmployeeLogin); // логин(фамилия) пользователя (сервисного консультанта)
	//на которого записан документ
	Если не ДобавитьЗаписьВрегистр(НоваяЗапись, "PostAct") Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	ТЗOptionLists				= Новый ТаблицаЗначений();
	ТЗOptionLists.Колонки.Добавить("OptionListID");
	ТЗOptionLists.Колонки.Добавить("OptionListName");
	ТЗOptionLists.Колонки.Добавить("OptionListTypeID");
	ТЗOptionLists.Колонки.Добавить("OptionListSortOrder");
	Для каждого Элемента из Act.OptionLists Цикл
		ЗаполнитьЗначенияСвойств(ТЗOptionLists.Добавить(), Элемента);	
	КонецЦикла;
	
	Для каждого Элемента из Act.Damage Цикл
		НоваяЗапись 				= РегистрыСведений.SAM_ПолученныеДанныеИзSAM.СоздатьМенеджерЗаписи();
		НоваяЗапись.НомерДок 		= СокрЛП(Act.Act_DMS_Code); // порядковый номер документа (ремзаказа/акта
		НоваяЗапись.IDДокумента		= СокрЛП(Act.Act_DMS_ID); // уникальный ID (GUID) карточки документа
		НоваяЗапись.ДатаПодписания 	= СокрЛП(Act.Date);       // дата подписания документа клиентом
		//Act.EmployeeLastName; 
		НоваяЗапись.ПробегАвто		= СокрЛП(Act.Mileage); // пробег автомобиля по результатам его осмотра
		НоваяЗапись.НомерКарточкиСобственника 	= СокрЛП(Act.Owner_DMS_ID);  // Уникальный ID (GUID) карточки клиента, который является собственником автомобиля
		НоваяЗапись.НомерКарточкиКлиента		= СокрЛП(Act.Representator_DMS_ID); // – Уникальный ID (GUID) карточки клиента, который является представителем (доверенным лицом) собственника автомобиля
		НоваяЗапись.VIN				= СокрЛП(Act.VIN); // VIN
		НоваяЗапись.НомерМетки		= СокрЛП(Элемента.MarkNumber); 	// порядковый номер метки на проекции автомобиля
		НоваяЗапись.НомерПроекции	= СокрЛП(Элемента.ViewID); 		// номер проекции автомобиля
		НоваяЗапись.ТипМетки		= СокрЛП(Элемента.MarkTypeID); // тип метки на проекции, (1 – повреждение, 2 – причина обращения)
		НоваяЗапись.ОписаниеМетки	= СокрЛП(Элемента.DamageDescription); // описание метки (описание повреждения или текст причины обращения) в случае если тип метки 2 – текст из этого поля должен быть добавлен к причинам обращения в ремзаказ (заказ-наряд) как дополнительная причина обращения
		НоваяЗапись.ТипПовреждения	= СокрЛП(Элемента.DamageTypeName); // тип повреждения, может быть NULL
		НоваяЗапись.ПутьКФайлуФото	= СокрЛП(Элемента.ImageFile); // путь к файлу фотографии, приложенному к метке
		НоваяЗапись.ОсьX			= СокрЛП(Элемента.Xcoord); // координата метки по оси X
		НоваяЗапись.ОсьY			= СокрЛП(Элемента.Ycoord); // координата метки по оси Y
		Если не ДобавитьЗаписьВрегистр(НоваяЗапись, "PostAct") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемента из Act.Option Цикл
		НоваяЗапись 				= РегистрыСведений.SAM_ПолученныеДанныеИзSAM.СоздатьМенеджерЗаписи();
		НоваяЗапись.НомерДок 		= СокрЛП(Act.Act_DMS_Code); // порядковый номер документа (ремзаказа/акта
		НоваяЗапись.IDДокумента		= СокрЛП(Act.Act_DMS_ID); // уникальный ID (GUID) карточки документа
		НоваяЗапись.ДатаПодписания 	= СокрЛП(Act.Date);       // дата подписания документа клиентом
		//Act.EmployeeLastName; 
		НоваяЗапись.ПробегАвто		= СокрЛП(Act.Mileage); // пробег автомобиля по результатам его осмотра
		НоваяЗапись.НомерКарточкиСобственника 	= СокрЛП(Act.Owner_DMS_ID);  // Уникальный ID (GUID) карточки клиента, который является собственником автомобиля
		НоваяЗапись.НомерКарточкиКлиента		= СокрЛП(Act.Representator_DMS_ID); // – Уникальный ID (GUID) карточки клиента, который является представителем (доверенным лицом) собственника автомобиля
		НоваяЗапись.VIN				= СокрЛП(Act.VIN); // VIN

		НоваяЗапись.НомерЭлементаЧекЛиста 		= СокрЛП(Элемента.OptionID); // уникальный номер элемента чек-листа или списка комплектации
		НоваяЗапись.НаименованиеПунктаЧекЛиста	= СокрЛП(Элемента.OptionName); // наименование пункта чек-листа или элемента списка комплектации
		НоваяЗапись.ВариантОтвета	= СокрЛП(Элемента.OptionAnswer); // выбранный или введенный вариант ответа на пункт чек-листа, или отметка о наличии элемента комплектации
		НоваяЗапись.КомментарийКЧекЛисту 		= СокрЛП(Элемента.Comment);
		
		НайденнаяСтрока = ТЗOptionLists.Найти(СокрЛП(Элемента.OptionListID), "OptionListID");
		если не НайденнаяСтрока = Неопределено Тогда
			НоваяЗапись.ТипЭлементаОпции= СокрЛП(НайденнаяСтрока.OptionListTypeID); //уникальный идентификатор списка, к которому относится пункт чек-листа.
		КонецЕсли;
		НоваяЗапись.НомерСортировки	= СокрЛП(Элемента.OptionSortOrder); // порядковый номер сортировки элемента внутри своего списка. 
		Если не ДобавитьЗаписьВрегистр(НоваяЗапись, "PostAct") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемента из Act.View Цикл
		НоваяЗапись 				= РегистрыСведений.SAM_ПолученныеДанныеИзSAM.СоздатьМенеджерЗаписи();
		НоваяЗапись.НомерДок 		= СокрЛП(Act.Act_DMS_Code); // порядковый номер документа (ремзаказа/акта
		НоваяЗапись.IDДокумента		= СокрЛП(Act.Act_DMS_ID); // уникальный ID (GUID) карточки документа
		НоваяЗапись.ДатаПодписания 	= СокрЛП(Act.Date);       // дата подписания документа клиентом
		//Act.EmployeeLastName; 
		НоваяЗапись.ПробегАвто		= СокрЛП(Act.Mileage); // пробег автомобиля по результатам его осмотра
		НоваяЗапись.НомерКарточкиСобственника 	= СокрЛП(Act.Owner_DMS_ID);  // Уникальный ID (GUID) карточки клиента, который является собственником автомобиля
		НоваяЗапись.НомерКарточкиКлиента		= СокрЛП(Act.Representator_DMS_ID); // – Уникальный ID (GUID) карточки клиента, который является представителем (доверенным лицом) собственника автомобиля
		НоваяЗапись.VIN				= СокрЛП(Act.VIN); // VIN

		НоваяЗапись.ПорядковыйНомерПроекции = СокрЛП(Элемента.ViewSortOrder); // порядковый номер проекции
		НоваяЗапись.Проекция				= СокрЛП(Элемента.ViewContent); // строка в формате Base64, содержащая саму проекцию с проставленными (если таковые есть) отметками о повреждениях
		НоваяЗапись.ТипПроекции				= СокрЛП(Элемента.ViewTypeID);  //тип проекции (0 – спереди, 1 – слева, 2- сзади, 3 – справа, 4 -
		//сверху, 5 – салон).
		НоваяЗапись.ViewID					= СокрЛП(Элемента.ViewID); // уникальный идентификатор проекции
		Если не ДобавитьЗаписьВрегистр(НоваяЗапись, "PostAct") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	//Найдем заявку на ремонт
	СсылкаНаЗаявку = Документы.ЗаявкаНаРемонт.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(Act.Act_DMS_ID)));
	Если ЗначениеЗаполнено(СсылкаНаЗаявку) Тогда
		//Добавим работы в заявку на ремонт
		ДокОбъект 				= СсылкаНаЗаявку.ПолучитьОбъект();
		Если ЗначениеЗаполнено(Act.Mileage) Тогда
			ДокОбъект.Пробег 	= Act.Mileage;
			ДобавитьХарактеристикуАвтомобиля(ДокОбъект.Автомобиль, 
												Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,
												Act.Mileage, 
												ТекущаяДата());
			
		КонецЕсли;
		ДокОбъект.Товары.Очистить();
		ДокОбъект.Работы.Очистить();
		ДокОбъект.Исполнители.Очистить();
		ЕстьЧтоЗаписать			= Ложь;
		Для каждого Элемента из Act.SelectedJobs Цикл
			//Найдем работу
			мРабота = Справочники.Автоработы.НайтиПоКоду(СокрЛП(Элемента.GUID)); // Код работы
			Если не ЗначениеЗаполнено(мРабота) Тогда
				мРабота = Справочники.Автоработы.НайтиПоНаименованию(СокрЛП(Элемента.Name)); // Наименование работы	
			КонецЕсли;
			Если не ЗначениеЗаполнено(мРабота) Тогда //Не удалось найти работу								
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока 			= ДокОбъект.Работы.Добавить();
			НоваяСтрока.Работа  	= мРабота;
			ДокОбъект.ОбработкаРеквизита("Работы.Работа",НоваяСтрока);
			НоваяСтрока.Коэффициент  = Элемента.TimeTerm;
			НоваяСтрока.Количество = 1;
			Если НоваяСтрока.Коэффициент=0 Тогда НоваяСтрока.Коэффициент=1; КонецЕсли;
			НоваяСтрока.Цена        = Элемента.Price;
			ДокОбъект.ОбработкаРеквизита("Работы.Цена",НоваяСтрока);
			НоваяСтрока.ИдентификаторРаботы=Новый УникальныйИдентификатор;
			ЕстьЧтоЗаписать			= Истина;
		КонецЦикла;
		Для каждого Элемента из Act.SelectedParts Цикл
			//Найдем Товар
			мТовар = Справочники.Номенклатура.НайтиПоКоду(СокрЛП(Элемента.GUID)); // Код Товара
			Если не ЗначениеЗаполнено(мТовар) Тогда
				мТовар = Справочники.Номенклатура.НайтиПоНаименованию(СокрЛП(Элемента.Name)); // Наименование Товара	
			КонецЕсли;	
			Если не ЗначениеЗаполнено(мТовар) Тогда //Не удалось найти работу								
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока 				= ДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура  	= мТовар;
			ДокОбъект.ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
			НоваяСтрока.Количество  	= Элемента.Quantity;
			Если НоваяСтрока.Количество=0 Тогда НоваяСтрока.Количество=1; КонецЕсли;
			НоваяСтрока.Цена        	= Элемента.Price;
			ДокОбъект.ОбработкаРеквизита("Товары.Цена",НоваяСтрока);
			ЕстьЧтоЗаписать			= Истина;
		КонецЦикла;
		ДокОбъект.ПричинаОбращения = "";
		Для каждого Элемента из Act.Complaints Цикл
			ДокОбъект.ПричинаОбращения = ДокОбъект.ПричинаОбращения + СокрЛП(Элемента.Content) + "; ";
			ЕстьЧтоЗаписать			= Истина;
		КонецЦикла;
		Попытка
			Если ЕстьЧтоЗаписать Тогда
				ДокОбъект.Записать();
			КонецЕсли;	
		Исключение
			ДобавитьЗаписьВрегистр(,"PostAct");
		КонецПопытки;
	КонецЕсли;	
	
	//Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
	//Запись.Активность 	= Истина;
	//Запись.ДатаВремя	= ТекущаяДата();
	//Запись.Метод		= "PostAct";
	//Запись.Ошибка 		= "Успешно выполнен";
	//Попытка
	//	Запись.Записать();
	//Исключение  КонецПопытки;

	Возврат Истина;
		
	
КонецФункции

Процедура ДобавитьХарактеристикуАвтомобиля(мАвтомобиль, мВидЗначения, мЗначение, мПериод)
	МЗ				= РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
	МЗ.Активность   = Истина;
	МЗ.Автомобиль	= мАвтомобиль;
	МЗ.ВидЗначения	= мВидЗначения;
	МЗ.Значение		= мЗначение;
	МЗ.Период		= мПериод;
	МЗ.Записать(Истина);
КонецПроцедуры
&НаСервере
Функция ДобавитьЗаписьВрегистр(НоваяЗапись, Метод)
			
	Попытка

		НоваяЗапись.Записать();

		Возврат Истина;
	Исключение
		Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
		Запись.Активность 	= Истина;
		Запись.ДатаВремя	= ТекущаяДата();
		Запись.Метод		= Метод;
		Запись.Ошибка 		= ОписаниеОшибки();
		Попытка
		Запись.Записать();
		Исключение  КонецПопытки;
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции	
&НаСервере
Функция ПолучитьТЗДанных(ДатаНачала, ДатаОкончания)
	Запрос 			= Новый Запрос;          
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	АвтомобилиСрезПоследних.Значение КАК Пробег,
	             	  |	АвтомобилиСрезПоследних.Автомобиль
	             	  |ПОМЕСТИТЬ ТЗПробег
	             	  |ИЗ
	             	  |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	             	  |ГДЕ
	             	  |	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	АвтомобилиСрезПоследних.Значение КАК Хозяин,
	             	  |	АвтомобилиСрезПоследних.Автомобиль
	             	  |ПОМЕСТИТЬ ТЗХозяин
	             	  |ИЗ
	             	  |	РегистрСведений.Автомобили.СрезПоследних КАК АвтомобилиСрезПоследних
	             	  |ГДЕ
	             	  |	АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ЗаявкаНаРемонт.Номер,
	             	  |	ВЫБОР
	             	  |		КОГДА ЗаявкаНаРемонт.ДатаНачала = &ПустаяДата
	             	  |			ТОГДА ЗаявкаНаРемонт.Дата
	             	  |		ИНАЧЕ ЗаявкаНаРемонт.ДатаНачала
	             	  |	КОНЕЦ КАК Дата,
	             	  |	ЗаявкаНаРемонт.Автор,
	             	  |	ЗаявкаНаРемонт.Автомобиль,
	             	  |	ЗаявкаНаРемонт.Автомобиль.VIN КАК ВИН,
	             	  |	ЗаявкаНаРемонт.Контрагент,
	             	  |	ЗаявкаНаРемонт.Контрагент.Код,
	             	  |	ЗаявкаНаРемонт.ДатаНачала,
	             	  |	ЗаявкаНаРемонт.Мастер,
	             	  |	ЗаявкаНаРемонтИзменения.Ссылка,
	             	  |	ЕСТЬNULL(ТЗПробег.Пробег, 0) КАК Пробег,
	             	  |	ТЗХозяин.Хозяин КАК Владелец,
	             	  |	ТЗХозяин.Хозяин.Код КАК ВладелецКод,
	             	  |	ЗаявкаНаРемонт.Автомобиль.Код,
	             	  |	ЗаявкаНаРемонт.Товары.(
	             	  |		Ссылка,
	             	  |		НомерСтроки,
	             	  |		Номенклатура,
	             	  |		Количество,
	             	  |		ЕдиницаИзмерения,
	             	  |		Коэффициент,
	             	  |		Цена,
	             	  |		Сумма,
	             	  |		СтавкаНДС,
	             	  |		СуммаНДС,
	             	  |		ПроцентСкидки,
	             	  |		СуммаСкидки,
	             	  |		ХарактеристикаНоменклатуры,
	             	  |		СуммаВсего,
	             	  |		СкидкаНаТовар,
	             	  |		ПроцентСкидкиСтроки,
	             	  |		СуммаСкидкиСтроки
	             	  |	),
	             	  |	ЗаявкаНаРемонт.Работы.(
	             	  |		Ссылка,
	             	  |		НомерСтроки,
	             	  |		Работа,
	             	  |		ИдентификаторРаботы,
	             	  |		Количество,
	             	  |		Нормочас,
	             	  |		Коэффициент,
	             	  |		Цена,
	             	  |		Сумма,
	             	  |		СтавкаНДС,
	             	  |		СуммаНДС,
	             	  |		ПроцентСкидки,
	             	  |		СуммаСкидки,
	             	  |		СуммаВсего,
	             	  |		СкидкаНаТовар,
	             	  |		ПроцентСкидкиСтроки,
	             	  |		СуммаСкидкиСтроки
	             	  |	),
	             	  |	ЗаявкаНаРемонт.ВалютаДокумента,
	             	  |	ЗаявкаНаРемонт.СервиснаяКампания,
	             	  |	ЗаявкаНаРемонт.СервиснаяКампания.Код,
	             	  |	ЗаявкаНаРемонт.СервиснаяКампания.Наименование,
	             	  |	ЗаявкаНаРемонт.СервиснаяКампания.Комментарий,
	             	  |	ЗаявкаНаРемонт.ПричинаОбращения,
	             	  |	"""" КАК ПричинаОбращенияКод
	             	  |ИЗ
	             	  |	Документ.ЗаявкаНаРемонт.Изменения КАК ЗаявкаНаРемонтИзменения
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗПробег КАК ТЗПробег
	             	  |			ПО ЗаявкаНаРемонт.Автомобиль = ТЗПробег.Автомобиль
	             	  |			ЛЕВОЕ СОЕДИНЕНИЕ ТЗХозяин КАК ТЗХозяин
	             	  |			ПО ЗаявкаНаРемонт.Автомобиль = ТЗХозяин.Автомобиль
	             	  |		ПО ЗаявкаНаРемонтИзменения.Ссылка = ЗаявкаНаРемонт.Ссылка
	             	  |ГДЕ
	             	  |	НЕ ЗаявкаНаРемонт.ПометкаУдаления
	             	  |	И ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	             	  |	И ЗаявкаНаРемонт.Автомобиль ССЫЛКА Справочник.Автомобили
	             	  |	И НЕ ЗаявкаНаРемонт.Автомобиль = &АвтомобильПустаяСсылка
	             	  |	И НЕ ЗаявкаНаРемонт.Контрагент = &КонтрагентПустаяСсылка
	             	  |	И ЗаявкаНаРемонтИзменения.Узел = &Узел";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);				  
	Запрос.УстановитьПараметр("Узел", Константы.SAM_ПланОбменаSAM.Получить());
	//мЦех	= Справочники.Склады.НайтиПоКоду("000000063");
	//Запрос.УстановитьПараметр("Цех", мЦех);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("АвтомобильПустаяСсылка", Справочники.Автомобили.ПустаяСсылка());
	Запрос.УстановитьПараметр("КонтрагентПустаяСсылка", Справочники.Контрагенты.ПустаяСсылка());
	ТЗДанных = Запрос.Выполнить().Выгрузить();
	Возврат ТЗДанных;
КонецФункции	
&НаСервере
Функция ConfirmAct(DMS_ID)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	НА_ВыгруженныеДокументы.Документы,
	             	  |	НА_ВыгруженныеДокументы.ID
	             	  |ИЗ
	             	  |	РегистрСведений.SAM_ВыгруженныеДокументы КАК НА_ВыгруженныеДокументы
	             	  |ГДЕ
	             	  |	НА_ВыгруженныеДокументы.ID = &ID";
	Запрос.УстановитьПараметр("ID",СокрЛП(DMS_ID));
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		
		ПланОбмена	= Константы.SAM_ПланОбменаSAM.Получить();
		ПланыОбмена.УдалитьРегистрациюИзменений(ПланОбмена,Рез.Документы.Ссылка);

		
		МенеджерЗаписи 				= РегистрыСведений.SAM_ВыгруженныеДокументы.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Активность 	= Истина;
		МенеджерЗаписи.Загружен		= Истина;
		МенеджерЗаписи.Документы	= Рез.Документы.Ссылка;
		МенеджерЗаписи.ID			= Рез.ID;
		МенеджерЗаписи.Записать();
		
		//Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
		//Запись.Активность 	= Истина;
		//Запись.ДатаВремя	= ТекущаяДата();
		//Запись.Метод		= "ConfirmAct";
		//Запись.Ошибка 		= "Успешно выполнен";
		//Попытка
		//	Запись.Записать();
		//Исключение  КонецПопытки;
		
		Возврат Истина;
		
	Иначе
		
		Запись 				= РегистрыСведений.SAM_ЛогОбмена1С_SAM.СоздатьМенеджерЗаписи();
		Запись.Активность 	= Истина;
		Запись.ДатаВремя	= ТекущаяДата();
		Запись.Метод		= "ConfirmAct";
		Запись.Ошибка 		= "Ошибка";
		Попытка
			Запись.Записать();
		Исключение  КонецПопытки;
		
		Возврат Ложь;
	КонецЕсли;
КонецФункции
&НаСервере
Функция PrintAct(Act_DMS_ID)
	Возврат Ложь;	
КонецФункции
&НаСервере
Функция CreateAct(Owner_DMS_ID, Representator_DMS_ID, Vehicle_DMS_ID, EmployeeLogin)
	ТипXDTOРезультатОперации 	= ФабрикаXDTO.Тип("http://mighttrust.me/", "CreateActInfo");
	//ТипXDTOФлагВыполнения 		= ФабрикаXDTO.Тип("http://mighttrust.me/", "ResultStatus");
	//ТипXDTOОписаниеОшибки 		= ФабрикаXDTO.Тип("http://mighttrust.me/", "ErrorMessage");
	//ТипXDTOНомерДокумента 		= ФабрикаXDTO.Тип("http://mighttrust.me/", "Act_DMS_Code");
	//ТипXDTOIDДокумента 			= ФабрикаXDTO.Тип("http://mighttrust.me/", "Act_DMS_ID");

	мКонтрагент = Неопределено;
	мАвтомобиль	= Неопределено;
	мМастер		= Неопределено;
	//поищим контрагента по представителю
	Если ЗначениеЗаполнено(Representator_DMS_ID) Тогда
		мКонтрагент = Справочники.Контрагенты.НайтиПоКоду(Representator_DMS_ID);
	КонецЕсли;
	//Контрагент не найден, ищем по владельцу
	Если Не ЗначениеЗаполнено(мКонтрагент) Тогда
		Если ЗначениеЗаполнено(Owner_DMS_ID) Тогда
			мКонтрагент = Справочники.Контрагенты.НайтиПоКоду(Owner_DMS_ID);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(мКонтрагент) Тогда //Контрагент не найден, вернем ошибку
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);	
		XDTOПозиции.ResultStatus    = Ложь;
		XDTOПозиции.ErrorMessage    = "Не найден контрагент";
		XDTOПозиции.Act_DMS_Code    = "-";
		XDTOПозиции.Act_DMS_ID    	= "-";
		Возврат XDTOПозиции;
	КонецЕсли;	
	//поищим автомобиль	
	Если ЗначениеЗаполнено(Vehicle_DMS_ID) Тогда
		мАвтомобиль = Справочники.Автомобили.НайтиПоКоду(Vehicle_DMS_ID);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(мАвтомобиль) Тогда //Автомобиль не найден, вернем ошибку
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);	
		XDTOПозиции.ResultStatus    = Ложь;
		XDTOПозиции.ErrorMessage    = "Не найден автомобиль";
		XDTOПозиции.Act_DMS_Code    = "-";
		XDTOПозиции.Act_DMS_ID    	= "-";
		Возврат XDTOПозиции;
	КонецЕсли;
	//поищим Мастера	
	Если ЗначениеЗаполнено(EmployeeLogin) Тогда
		мМастер = Справочники.Сотрудники.НайтиПоНаименованию(EmployeeLogin);
	КонецЕсли;
	//получим значение реквизитов по умолчанию для заявки на ремонт
	ПараметрыПоУмолчанию 			=  ПолучитьПараметры();
	Если не ПараметрыПоУмолчанию.Следующий() Тогда
    	XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);	
		XDTOПозиции.ResultStatus    = Ложь;
		XDTOПозиции.ErrorMessage    = "Не удалось определить значение реквизитов по умолчанию для заявки на ремонт!";
		XDTOПозиции.Act_DMS_Code    = "-";
		XDTOПозиции.Act_DMS_ID    	= "-";
		Возврат XDTOПозиции;
	КонецЕсли;	
	ЗаявкаНаРемонт 					= Документы.ЗаявкаНаРемонт.СоздатьДокумент();
	ЗаявкаНаРемонт.ДатаНачала		= ТекущаяДата();	
	ЗаявкаНаРемонт.Организация		= ПараметрыПоУмолчанию.ОрганизацияЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.Автор			= ПараметрыПоУмолчанию.АвторЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.ВалютаДокумента	= ПараметрыПоУмолчанию.ВалютаДокументаЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.КурсДокумента	= 1;
	ЗаявкаНаРемонт.Цех				= ПараметрыПоУмолчанию.ЦехЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.ПодразделениеКомпании=ПараметрыПоУмолчанию.ПодразделениеКомпанииЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.ТипЦен			= ПараметрыПоУмолчанию.ТипЦенЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.ВидРемонта		= ПараметрыПоУмолчанию.ВидРемонтаЗаявокНаРемонтПоУмолчанию;
	ЗаявкаНаРемонт.Заказчик			= мКонтрагент;
	ЗаявкаНаРемонт.ХозОперация		= Справочники.ХозОперации.ЗаявкаНаРемонт;
	ЗаявкаНаРемонт.ПричинаОбращения = "-";
	ЗаявкаНаРемонт.Дата				= ТекущаяДата();
	ЗаявкаНаРемонт.Контрагент		= мКонтрагент;
	ЗаявкаНаРемонт.Автомобиль		= мАвтомобиль;
	ЗаявкаНаРемонт.Мастер			= мМастер;
	Попытка
		ЗаявкаНаРемонт.Записать();
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);	
		XDTOПозиции.ResultStatus    = Истина;
		XDTOПозиции.ErrorMessage    = "";
		XDTOПозиции.Act_DMS_Code    = ЗаявкаНаРемонт.Номер;
		XDTOПозиции.Act_DMS_ID    	= Строка(ЗаявкаНаРемонт.Ссылка.УникальныйИдентификатор());
		Возврат XDTOПозиции;
	Исключение
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);	
		XDTOПозиции.ResultStatus    = Ложь;
		XDTOПозиции.ErrorMessage    = "Не удалось создать заявку на ремонт. " + ОписаниеОшибки();
		XDTOПозиции.Act_DMS_Code    = "-";
		XDTOПозиции.Act_DMS_ID    	= "-";
		Возврат XDTOПозиции;
	КонецПопытки;

КонецФункции
&НаСервере
Функция GetCatalogues()
	// получим типы из XDTO
	ТипXDTOРабота 			= ФабрикаXDTO.Тип("http://mighttrust.me/", "Job");
	ТипXDTOМассивРаботЗЧ 	= ФабрикаXDTO.Тип("http://mighttrust.me/", "JobsPartsList");
	ТипXDTOЗЧ 				= ФабрикаXDTO.Тип("http://mighttrust.me/", "Part");
	ТипXDTOГруппы 			= ФабрикаXDTO.Тип("http://mighttrust.me/", "GroupForSync");
	
	ПланОбмена = Константы.SAM_ПланОбменаSAM.Получить();
	
	Запрос 			= Новый Запрос;   
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	Автоработы.Ссылка,
	             	  |	Автоработы.Код,
	             	  |	Автоработы.Наименование,
	             	  |	ПОДСТРОКА(Автоработы.НаименованиеПолное, 0, 150) КАК НаименованиеПолное,
	             	  |	СУММА(Автоработы.ВремяВыполнения) КАК ВремяВыполнения
	             	  |ПОМЕСТИТЬ ТЗРаботы
	             	  |ИЗ
	             	  |	Справочник.Автоработы КАК Автоработы
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             	  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SAM_Параметры КАК Параметры_SAM
	             	  |			ПО (Параметры_SAM.СвойствоРаботы = ЗначенияСвойствОбъектов.Свойство)
	             	  |		ПО Автоработы.Ссылка = ЗначенияСвойствОбъектов.Объект
	             	  |ГДЕ
	             	  |	ЗначенияСвойствОбъектов.Значение = ИСТИНА
	             	  |	И НЕ Автоработы.ЭтоГруппа
	             	  |	И НЕ Автоработы.ПометкаУдаления
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	Автоработы.Ссылка,
	             	  |	Автоработы.Код,
	             	  |	Автоработы.Наименование,
	             	  |	ПОДСТРОКА(Автоработы.НаименованиеПолное, 0, 150)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ЦеныАвтоработСрезПоследних.Цена,
	             	  |	ЦеныАвтоработСрезПоследних.Авторабота,
	             	  |	ЦеныАвтоработСрезПоследних.Валюта
	             	  |ПОМЕСТИТЬ ТЗЦен
	             	  |ИЗ
	             	  |	РегистрСведений.ЦеныАвторабот.СрезПоследних КАК ЦеныАвтоработСрезПоследних
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SAM_Параметры КАК SAM_Параметры
	             	  |		ПО ЦеныАвтоработСрезПоследних.ТипЦен = SAM_Параметры.ТипЦеныЗЧ
	             	  |ГДЕ
	             	  |	ЦеныАвтоработСрезПоследних.Авторабота В
	             	  |			(ВЫБРАТЬ
	             	  |				ТЗРаботы.Ссылка
	             	  |			ИЗ
	             	  |				ТЗРаботы КАК ТЗРаботы)
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТЗРаботы.Ссылка,
	             	  |	ТЗРаботы.Код,
	             	  |	ТЗРаботы.Наименование,
	             	  |	ТЗРаботы.НаименованиеПолное,
	             	  |	ТЗРаботы.ВремяВыполнения,
	             	  |	ЕСТЬNULL(ТЗЦен.Валюта, ""Руб."") КАК Валюта,
	             	  |	ВЫБОР
	             	  |		КОГДА НЕ ЕСТЬNULL(ТЗЦен.Цена, 0) = 0
	             	  |			ТОГДА ТЗЦен.Цена
	             	  |		ИНАЧЕ ЕСТЬNULL(SAM_Параметры.Нормочас.Цена, 0)
	             	  |	КОНЕЦ КАК Цена
	             	  |ИЗ
	             	  |	ТЗРаботы КАК ТЗРаботы
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗЦен КАК ТЗЦен
	             	  |		ПО ТЗРаботы.Ссылка = ТЗЦен.Авторабота,
	             	  |	РегистрСведений.SAM_Параметры КАК SAM_Параметры
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	ТЗРаботы.Наименование,
	             	  |	ТЗРаботы.НаименованиеПолное,
	             	  |	ТЗРаботы.Код,
	             	  |	ЕСТЬNULL(ТЗЦен.Валюта, ""Руб.""),
	             	  |	ТЗРаботы.Ссылка,
	             	  |	ТЗРаботы.ВремяВыполнения,
	             	  |	ВЫБОР
	             	  |		КОГДА НЕ ЕСТЬNULL(ТЗЦен.Цена, 0) = 0
	             	  |			ТОГДА ТЗЦен.Цена
	             	  |		ИНАЧЕ ЕСТЬNULL(SAM_Параметры.Нормочас.Цена, 0)
	             	  |	КОНЕЦ";					  
	ВыборкаРабот 	= Запрос.Выполнить().Выбрать();
	
	Запрос 			= Новый Запрос;   
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ЦеныСрезПоследних.Цена,
	             	  |	ЦеныСрезПоследних.Номенклатура
	             	  |ПОМЕСТИТЬ ТЗЦены
	             	  |ИЗ
	             	  |	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SAM_Параметры КАК Параметры_SAM
	             	  |		ПО ЦеныСрезПоследних.ТипЦен = Параметры_SAM.ТипЦеныЗЧ
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	Номенклатура.Ссылка,
	             	  |	Номенклатура.Код,
	             	  |	Номенклатура.Наименование,
	             	  |	Номенклатура.НаименованиеПолное,
	             	  |	Номенклатура.Артикул,
	             	  |	Номенклатура.БазоваяЕдиницаИзмерения,
	             	  |	Номенклатура.ВалютаУчета
	             	  |ПОМЕСТИТЬ ТЗВрем
	             	  |ИЗ
	             	  |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SAM_Параметры КАК Параметры_SAM
	             	  |		ПО (Параметры_SAM.СвойствоРаботы = ЗначенияСвойствОбъектов.Свойство)
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	             	  |		ПО ЗначенияСвойствОбъектов.Объект = Номенклатура.Ссылка
	             	  |ГДЕ
	             	  |	ЗначенияСвойствОбъектов.Значение = ИСТИНА
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ТЗВрем.Ссылка,
	             	  |	ТЗВрем.Код,
	             	  |	ТЗВрем.Наименование,
	             	  |	ПОДСТРОКА(ТЗВрем.НаименованиеПолное, 0, 150) КАК НаименованиеПолное,
	             	  |	ТЗВрем.Артикул,
	             	  |	ТЗВрем.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	             	  |	ТЗВрем.ВалютаУчета КАК Валюта,
	             	  |	ЕСТЬNULL(ТЗЦены.Цена, 0) КАК Цена
	             	  |ИЗ
	             	  |	ТЗВрем КАК ТЗВрем
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ ТЗЦены КАК ТЗЦены
	             	  |		ПО ТЗВрем.Ссылка = ТЗЦены.Номенклатура
	             	  |
	             	  |СГРУППИРОВАТЬ ПО
	             	  |	ТЗВрем.Ссылка,
	             	  |	ТЗВрем.Код,
	             	  |	ТЗВрем.Наименование,
	             	  |	ПОДСТРОКА(ТЗВрем.НаименованиеПолное, 0, 150),
	             	  |	ТЗВрем.Артикул,
	             	  |	ТЗВрем.БазоваяЕдиницаИзмерения,
	             	  |	ТЗВрем.ВалютаУчета,
	             	  |	ЕСТЬNULL(ТЗЦены.Цена, 0)";					  
	ВыборкаЗЧ 		= Запрос.Выполнить().Выбрать();
	
	// создадим значение XDTO для Работ и зч
	XDTOСвойства = ФабрикаXDTO.Создать(ТипXDTOМассивРаботЗЧ);
	
	ТаблицаГрупп = Новый ТаблицаЗначений();
	ТаблицаГрупп.Колонки.Добавить("DmsID");
	ТаблицаГрупп.Колонки.Добавить("Name");
	ТаблицаГрупп.Колонки.Добавить("ParentGroupDmsId");
		
	
	Пока ВыборкаРабот.Следующий() Цикл
		
		// создадим значение XDTO для результата
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOРабота);
		
		// заполним результат
		XDTOПозиции.GUID   			= СокрЛП(ВыборкаРабот.Код); 		// уникальный идентификатор работы, не может быть NULL
		XDTOПозиции.Code    		= "";                   			// код работы в номенклатуре, тот который используют работники сервиса. Может быть NULL
		XDTOПозиции.Name  			= СокрЛП(ВыборкаРабот.Наименование);// сокращенное наименование работы, не может быть NULL
		XDTOПозиции.Description     = СокрЛП(ВыборкаРабот.НаименованиеПолное);// полное описание работы, может быть NULL
		XDTOПозиции.TimeTerm  		= ВыборкаРабот.ВремяВыполнения;		// срок/длительность выполнения работы, то не может быть NULL
		XDTOПозиции.TimeMeasure     = "н/ч";                   			// единица измерения длительности
		XDTOПозиции.Price           = ВыборкаРабот.Цена;                // цена работы за единицу длительности, то не может быть NULL.
		XDTOПозиции.PriceMeasure    = СокрЛП(ВыборкаРабот.Валюта);		// валюта цены
		XDTOПозиции.GroupID         = СокрЛП(ВыборкаРабот.Ссылка.Родитель.Код); // уникальный идентификатор группы работ. Может быть NULL
		
		НоваяСтрока 				= ТаблицаГрупп.Добавить();
		НоваяСтрока.DmsID			= СокрЛП(ВыборкаРабот.Ссылка.Родитель.Код);			//уникальный идентификатор группы
		НоваяСтрока.Name			= СокрЛП(ВыборкаРабот.Ссылка.Родитель.Наименование);//наименование группы
		мParentGroupDms				= ПолучитьГлавногоРодителя(ВыборкаРабот.Ссылка);
		НоваяСтрока.ParentGroupDmsId= СокрЛП(мParentGroupDms.Код);						//уникальный идентификатор первого родителя группы
		
		ДобавитьПромежуточныеГруппы(ВыборкаРабот.Ссылка.Родитель, мParentGroupDms, ТаблицаГрупп);
		//Status может принимать следующие значения: 
		//confirmed - идет в РемЗаказ
		//recommended - идет в рекомендации,
		//пустая строка, NULL или любое другое значение не указанное выше - не попадает ни в рекомендации ни в РемЗаказ, даже если окажется
		
		// добавим результат 
		XDTOСвойства.JobsForSync.Добавить(XDTOПозиции);
		
		//МенеджерЗаписи 					= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Активность 		= Истина;
		//МенеджерЗаписи.Загружен			= Ложь;
		//МенеджерЗаписи.ЗначениеДанных	= ВыборкаРабот.Ссылка;
		//МенеджерЗаписи.Записать();
	КонецЦикла;
	ТаблицаГрупп.Свернуть("DmsID, Name, ParentGroupDmsId");
	Для Каждого СтрокаТЗ из ТаблицаГрупп Цикл
		// создадим значение XDTO для результата
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOГруппы);
		// заполним результат
		ЗаполнитьЗначенияСвойств(XDTOПозиции,СтрокаТЗ);
		// добавим результат 
		XDTOСвойства.JobGroupsForSync.Добавить(XDTOПозиции);	
	КонецЦикла;	
	
	ТаблицаГрупп.Очистить();
	
	Пока ВыборкаЗЧ.Следующий() Цикл
		
		// создадим значение XDTO для результата
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOЗЧ);
		
		// заполним результат
		XDTOПозиции.GUID   			= СокрЛП(ВыборкаЗЧ.Код);				// уникальный идентификатор З/Ч, не может быть NULL
		XDTOПозиции.Code    		= СокрЛП(ВыборкаЗЧ.Артикул);			// код З/Ч в номенклатуре, тот который используют работники сервиса. Может быть NULL
		XDTOПозиции.Name  			= СокрЛП(ВыборкаЗЧ.Наименование);		// сокращенное наименование З/Ч, не может быть NULL
		XDTOПозиции.Description     = СокрЛП(ВыборкаЗЧ.НаименованиеПолное);	// полное описание З/Ч, может быть NULL
		XDTOПозиции.Quantity  		= 1;			 						// количество, не может быть NULL
		XDTOПозиции.QuantityMeasure = СокрЛП(ВыборкаЗЧ.ЕдиницаИзмерения);	// единица измерения количества
		XDTOПозиции.Price           = ВыборкаЗЧ.Цена;						// цена З/Ч за единицу количества не может быть NULL.
		XDTOПозиции.PriceMeasure    = СокрЛП(ВыборкаЗЧ.Валюта);				// валюта цены
		XDTOПозиции.GroupID         = СокрЛП(ВыборкаЗЧ.Ссылка.Родитель.Код);// уникальный идентификатор группы ЗЧ. Может быть NULL
		
		НоваяСтрока 				= ТаблицаГрупп.Добавить();
		НоваяСтрока.DmsID			= СокрЛП(ВыборкаЗЧ.Ссылка.Родитель.Код);			//уникальный идентификатор группы
		НоваяСтрока.Name			= СокрЛП(ВыборкаЗЧ.Ссылка.Родитель.Наименование);//наименование группы
		мParentGroupDms				= ПолучитьГлавногоРодителя(ВыборкаЗЧ.Ссылка);
		НоваяСтрока.ParentGroupDmsId= СокрЛП(мParentGroupDms.Код);						//уникальный идентификатор первого родителя группы
		
		ДобавитьПромежуточныеГруппы(ВыборкаЗЧ.Ссылка.Родитель, мParentGroupDms, ТаблицаГрупп);
		//Status может принимать следующие значения: 
		//confirmed - идет в РемЗаказ
		//recommended - идет в рекомендации,
		//пустая строка, NULL или любое другое значение не указанное выше - не попадает ни в рекомендации ни в РемЗаказ, даже если окажется
		
		// добавим результат 
		XDTOСвойства.PartsForSync.Добавить(XDTOПозиции);
		
		//МенеджерЗаписи 					= РегистрыСведений.SAM_ВыгруженныеДанные.СоздатьМенеджерЗаписи();
		//МенеджерЗаписи.Активность 		= Истина;
		//МенеджерЗаписи.Загружен			= Ложь;
		//МенеджерЗаписи.ЗначениеДанных	= ВыборкаЗЧ.Ссылка;
		//МенеджерЗаписи.Записать();
	КонецЦикла;
	
	ТаблицаГрупп.Свернуть("DmsID, Name, ParentGroupDmsId");
	Для Каждого СтрокаТЗ из ТаблицаГрупп Цикл
		// создадим значение XDTO для результата
		XDTOПозиции 				= ФабрикаXDTO.Создать(ТипXDTOГруппы);
		// заполним результат
		ЗаполнитьЗначенияСвойств(XDTOПозиции,СтрокаТЗ);
		// добавим результат 
		XDTOСвойства.PartGroupsForSync.Добавить(XDTOПозиции);	
	КонецЦикла;
	
	Возврат XDTOСвойства;	
КонецФункции

Функция ПолучитьСервисныеКомпании(мVIN)
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	ВыполнениеСервисныхКампаний.СервиснаяКампания.Код,
	             	  |	ВыполнениеСервисныхКампаний.СервиснаяКампания.Наименование,
	             	  |	ВыполнениеСервисныхКампаний.СервиснаяКампания.Представление КАК СервиснаяКампанияКомментарий
	             	  |ИЗ
	             	  |	РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
	             	  |ГДЕ
	             	  |	ВыполнениеСервисныхКампаний.VIN = &VIN
	             	  |	И ВыполнениеСервисныхКампаний.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1)";
	Запрос.УстановитьПараметр("VIN", мVIN);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьГлавногоРодителя(мСсылкаНаОбъект)
	Родитель	= мСсылкаНаОбъект.Родитель;
	Пока Истина Цикл
		Если ЗначениеЗаполнено(Родитель.Родитель) Тогда
			Родитель = Родитель.Родитель.Ссылка;
		Иначе
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	Возврат Родитель.Ссылка; 
КонецФункции	

Процедура ДобавитьПромежуточныеГруппы(мРодитель, мГлавныйРодитель, ТаблицаГрупп)
	Родитель	= мРодитель.Родитель;
	Пока ЗначениеЗаполнено(Родитель) Цикл
		НоваяСтрока 				= ТаблицаГрупп.Добавить();
		НоваяСтрока.DmsID			= СокрЛП(Родитель.Код);			//уникальный идентификатор группы
		НоваяСтрока.Name			= СокрЛП(Родитель.Наименование);//наименование группы
		НоваяСтрока.ParentGroupDmsId= СокрЛП(мГлавныйРодитель.Код);
        Родитель = Родитель.Родитель.Ссылка;	
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьПараметры()
	Запрос 			= Новый Запрос;
	Запрос.Текст    = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	Параметры_SAM.СвойствоРаботы,
	                  |	Параметры_SAM.ТипЦеныЗЧ,
	                  |	Параметры_SAM.АвторЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ОрганизацияЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ПодразделениеКомпанииЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ТипЦенЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ВалютаДокументаЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ЦехЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.ВидРемонтаЗаявокНаРемонтПоУмолчанию,
	                  |	Параметры_SAM.КаталогВременногоФайлаSAM
	                  |ИЗ
	                  |	РегистрСведений.SAM_Параметры КАК Параметры_SAM";
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции	

Функция ПолучитьЦену(мНоменклатура)
	Запрос 			= Новый Запрос;
	Запрос.Текст    = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ЦеныСрезПоследних.Цена
	                  |ИЗ
	                  |	РегистрСведений.SAM_Параметры КАК Параметры_SAM
	                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	                  |		ПО Параметры_SAM.ТипЦеныЗЧ = ЦеныСрезПоследних.ТипЦен
	                  |ГДЕ
	                  |	ЦеныСрезПоследних.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("Номенклатура", мНоменклатура);
	Рез 			= Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция ПолучитьЦенуРаботы(мАвторабота)
	Запрос 			= Новый Запрос;
	Запрос.Текст    = "ВЫБРАТЬ
	                  |	ЦеныАвтоработСрезПоследних.Цена
	                  |ИЗ
	                  |	РегистрСведений.ЦеныАвторабот.СрезПоследних КАК ЦеныАвтоработСрезПоследних
	                  |ГДЕ
	                  |	ЦеныАвтоработСрезПоследних.Авторабота = &Авторабота";
	Запрос.УстановитьПараметр("Авторабота", мАвторабота);
	Рез 			= Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции	

Функция GetJobInfo(JobGUID, Act_DMS_ID, Customer_DMS_ID, Vehicle_DMS_ID)
	
	// получим типы из XDTO
	ТипXDTOРабота 			= ФабрикаXDTO.Тип("http://mighttrust.me/", "JobInfoPrice");
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	НА_ВыгруженныеДокументы.Документы КАК ДокументЗаявка,
	             	  |	НА_ВыгруженныеДокументы.ID,
	             	  |	ЗаказНарядРаботы.Цена,
	             	  |	ЗаказНарядРаботы.Количество,
	             	  |	ЗаказНарядРаботы.Ссылка КАК ДокументЗаказНаряд
	             	  |ИЗ
	             	  |	РегистрСведений.SAM_ВыгруженныеДокументы КАК НА_ВыгруженныеДокументы
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
	             	  |		ПО НА_ВыгруженныеДокументы.Документы = ЗаказНарядРаботы.Ссылка.ДокументОснование
	             	  |ГДЕ
	             	  |	НА_ВыгруженныеДокументы.ID = &ID
	             	  |	И ЗаказНарядРаботы.Работа.Код = &Код";
	Запрос.УстановитьПараметр("ID",СокрЛП(Act_DMS_ID));
	Запрос.УстановитьПараметр("Код",СокрЛП(JobGUID));
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		
		
		// создадим значение XDTO для результата
		XDTOРабота 				= ФабрикаXDTO.Создать(ТипXDTOРабота);
		XDTOРабота.JobGUID		= JobGUID; 			// уникальный идентификатор работы, обязательный параметр.
		XDTOРабота.Price		= Рез.Цена;			// стоимость нормочаса для этой работы.
		XDTOРабота.TimeTerm		= Рез.Количество;	// количество нормочасов для этой работы.
	КонецЕсли;
	
	Возврат XDTOРабота;
КонецФункции

Функция GetPartInfo(PartGUID, Act_DMS_ID, Customer_DMS_ID, Vehicle_DMS_ID)
	// получим типы из XDTO
	ТипXDTOЗЧ 				= ФабрикаXDTO.Тип("http://mighttrust.me/", "PartInfoPrice");
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	НА_ВыгруженныеДокументы.Документы КАК ДокументЗаявка,
	             	  |	НА_ВыгруженныеДокументы.ID,
	             	  |	ЗаказНарядТовары.Цена,
	             	  |	ЗаказНарядТовары.Количество,
	             	  |	ЗаказНарядТовары.Ссылка КАК ДокументЗаказНаряд
	             	  |ИЗ
	             	  |	РегистрСведений.SAM_ВыгруженныеДокументы КАК НА_ВыгруженныеДокументы
	             	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	             	  |		ПО НА_ВыгруженныеДокументы.Документы = ЗаказНарядТовары.Ссылка.ДокументОснование
	             	  |ГДЕ
	             	  |	НА_ВыгруженныеДокументы.ID = &ID
	             	  |	И ЗаказНарядТовары.Номенклатура.Код = &Код";
	Запрос.УстановитьПараметр("ID",СокрЛП(Act_DMS_ID));
	Запрос.УстановитьПараметр("Код",СокрЛП(PartGUID));
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		
		// создадим значение XDTO для результата
		XDTOЗЧ 				= ФабрикаXDTO.Создать(ТипXDTOЗЧ);
		XDTOЗЧ.PartGUID		= PartGUID; 		// уникальный идентификатор запчасти, обязательный параметр.
		XDTOЗЧ.Price		= Рез.Цена;			// стоимость запчасти за 1 шт.
		XDTOЗЧ.Quantity		= Рез.Количество;	// количество штук указанной запчасти.
		
	КонецЕсли;
		
	Возврат XDTOЗЧ;
КонецФункции
