
&НаСервере
Процедура УдалитьЭлементыГруппы(ПодчиненныеЭлементы) Экспорт
	
	КоличествоПодчиненных = ПодчиненныеЭлементы.Количество()-1;
	Пока КоличествоПодчиненных >= 0 Цикл
		Элементы.Удалить(ПодчиненныеЭлементы[КоличествоПодчиненных]);
		КоличествоПодчиненных = КоличествоПодчиненных - 1;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ СЕРВЕР

&НаСервере
Процедура ОбновитьСписокВариантовОтчета()
	
	ТаблицаВариантов.Очистить();
	
	УдалитьЭлементыГруппы(Элементы.ГруппаВариантыНастроек.ПодчиненныеЭлементы);
	
	Счетчик = 1;
	СписокВариантов = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьСписок(КлючОтчета);
	Для Каждого ТекЭлемент Из СписокВариантов Цикл
		
		ИмяВарианта = "ВариантОтчета_" + Счетчик;
		
		ВариантНастроек = ТаблицаВариантов.Добавить();
		ВариантНастроек.Имя           = ИмяВарианта;
		ВариантНастроек.Идентификатор = ТекЭлемент.Значение;
		ВариантНастроек.Представление = ТекЭлемент.Представление;
		
		ИмяКоманды = "КомандаИзменитьВариант"+ИмяВарианта;
		НоваяКоманда = Команды.Найти(ИмяКоманды);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Действие = "КомандаИзменитьВариант";
		КонецЕсли;
		
		НовыйВариант = Элементы.Найти(ИмяВарианта);
		Если НовыйВариант = Неопределено Тогда
			НовыйВариант = Элементы.Добавить(ИмяВарианта, Тип("КнопкаФормы"), Элементы.ГруппаВариантыНастроек);
			НовыйВариант.ИмяКоманды = НоваяКоманда.Имя;
			НовыйВариант.Заголовок  = ТекЭлемент.Представление;
		КонецЕсли;
		
		Если ТекЭлемент.Значение = ЭтаФорма.КлючТекущегоВарианта Тогда
			НовыйВариант.Пометка = Истина;
			Элементы.ГруппаВариантыНастроек.Заголовок = "Вариант настроек: <" + НовыйВариант.Заголовок + ">";
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

//Функция ПолучитьСтруктуруОтчета(СтрокиСтруктуры, РежимЭксперт, Уровень)
//	
//	СчетчикСтруктур  = 0;
//	ТекущаяСтруктура = Неопределено;
//	Для Каждого СтрокаСтруктуры Из СтрокиСтруктуры Цикл
//		
//		Если НЕ СтрокаСтруктуры.Использование Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		// Проверка на вложенные таблицы
//		ТипСтруктурыОтчета = ТипЗнч(СтрокаСтруктуры);
//		Если Уровень>0 И (ТипСтруктурыОтчета = Тип("ТаблицаКомпоновкиДанных") ИЛИ 
//			ТипСтруктурыОтчета = Тип("ДиаграммаКомпоновкиДанных") ИЛИ 
//			ТипСтруктурыОтчета = Тип("ВстроеннаяТаблица")) Тогда
//			РежимЭксперт = Истина;
//			Прервать;
//		КонецЕсли;
//		
//		ТекущаяСтруктура = СтрокаСтруктуры;
//		СчетчикСтруктур  = СчетчикСтруктур + 1;
//		
//	КонецЦикла;
//	
//	// Больше одной вертикальной группировки
//	Если СчетчикСтруктур > 1 Тогда
//		РежимЭксперт = Истина;
//		ТекущаяСтруктура = Неопределено;
//	//Иначе
//	//	ГруппировкиЗапрещены = Ложь;
//	КонецЕсли;
//	
//	Возврат ТекущаяСтруктура;
//	
//КонецФункции

&НаСервере
Функция ЗаполнитьГруппировки(Настройки, Группировка)
	
	ЗаголовокГруппировки = "";
	ЭлементыГруппировки  = Группировка.ПоляГруппировки.Элементы;
	
	Если ЭлементыГруппировки.Количество() = 0 Тогда
		
		ЗаголовокГруппировки = "Детальные записи";
		
	Иначе
		
		Для Каждого ТекГруппировка Из ЭлементыГруппировки Цикл
			
			ДоступныеДанные = Настройки.ДоступныеПоляГруппировок.НайтиПоле(ТекГруппировка.Поле);
			Если ДоступныеДанные = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаголовокГруппировки = ЗаголовокГруппировки + ?(ЗаголовокГруппировки = "", "", ", ") + ДоступныеДанные.Заголовок;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Группировка.Структура.Количество()>0 Тогда
		СтруктураОтчета = Группировка.Структура[0];
		Если ТипЗнч(СтруктураОтчета) = Тип("ГруппировкаКомпоновкиДанных") ИЛИ 
			ТипЗнч(СтруктураОтчета) = Тип("ГруппировкаТаблицыКомпоновкиДанных") ИЛИ 
			ТипЗнч(СтруктураОтчета) = Тип("ГруппировкиДиаграммыМакетаКомпоновкиДанных") Тогда
			ЗаголовокГруппировки = ЗаголовокГруппировки + ?(ЗаголовокГруппировки = "", "", ", ") + ЗаполнитьГруппировки(Настройки, СтруктураОтчета);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗаголовокГруппировки;
	
КонецФункции

//&НаСервере
//Процедура ЗагрузитьНастройкиИзСКД(Настройки, ТекстСтрок, ТекстКолонок)
//	
//	СтруктураОтчета = Настройки.Структура[0];
//	
//	ИдентификаторСтруктуры = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета);
//	
//	//ИзмеренияСтроки.Очистить();
//	//ИзмеренияКолонки.Очистить();
//	
//	ТипСтруктурыТаблицы   = Тип("ТаблицаКомпоновкиДанных");
//	ТипСтруктурыДиаграммы = Тип("ДиаграммаКомпоновкиДанных");
//	
//	ТипСтруктуры = ТипЗнч(СтруктураОтчета);
//	Если ТипСтруктуры = ТипСтруктурыТаблицы Тогда
//		
//		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Строки);
//		ИдентификаторКолонок = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Колонки);
//		
//		Для Каждого Строка Из СтруктураОтчета.Строки Цикл
//			ТекстСтрок = ТекстСтрок + ?(ТекстСтрок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Строка);
//		КонецЦикла;
//		
//		Для Каждого Колонка Из СтруктураОтчета.Колонки Цикл
//			ТекстКолонок = ТекстКолонок + ?(ТекстКолонок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Колонка);
//		КонецЦикла;
//		
//	ИначеЕсли ТипСтруктуры = ТипСтруктурыДиаграммы Тогда
//		
//		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Серии);
//		ИдентификаторКолонок = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Точки);
//		
//		Для Каждого Серия Из СтруктураОтчета.Серии Цикл
//			ТекстСтрок = ТекстСтрок + ?(ТекстСтрок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Серия);
//		КонецЦикла;
//		
//		Для Каждого Точка Из СтруктураОтчета.Точки Цикл
//			ТекстКолонок = ТекстКолонок + ?(ТекстКолонок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Точка);
//		КонецЦикла;
//		
//	Иначе
//		
//		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета);
//		ИдентификаторКолонок = Неопределено;
//		
//		ТекстСтрок = ЗаполнитьГруппировки(Настройки, СтруктураОтчета);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтруктуруОтчета()
	
	Результат = Истина;
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Каким-то чудом не передался контекст отчета
	Если Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы.Количество() = 0 Тогда
		ИнициализироватьСКД();
	КонецЕсли;
	
	//ОтчетыСервер.ЗагрузитьНастройкиИзСКД(Отчет.КомпоновщикНастроек.Настройки, ИзмеренияСтроки, ИзмеренияКолонки);
	ТекстСтрок = "";
	ТекстКолонок = "";
	//ЗагрузитьНастройкиИзСКД(Отчет.КомпоновщикНастроек.Настройки, ТекстСтрок, ТекстКолонок);
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	СтруктураОтчета = Настройки.Структура[0];
	
	ИдентификаторСтруктуры = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета);
	
	//ИзмеренияСтроки.Очистить();
	//ИзмеренияКолонки.Очистить();
	
	ТипСтруктурыТаблицы   = Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы = Тип("ДиаграммаКомпоновкиДанных");
	
	ТипСтруктуры = ТипЗнч(СтруктураОтчета);
	Если ТипСтруктуры = ТипСтруктурыТаблицы Тогда
		
		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Строки);
		ИдентификаторКолонок = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Колонки);
		
		Для Каждого Строка Из СтруктураОтчета.Строки Цикл
			ТекстСтрок = ТекстСтрок + ?(ТекстСтрок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Строка);
		КонецЦикла;
		
		Для Каждого Колонка Из СтруктураОтчета.Колонки Цикл
			ТекстКолонок = ТекстКолонок + ?(ТекстКолонок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Колонка);
		КонецЦикла;
		
	ИначеЕсли ТипСтруктуры = ТипСтруктурыДиаграммы Тогда
		
		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Серии);
		ИдентификаторКолонок = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета.Точки);
		
		Для Каждого Серия Из СтруктураОтчета.Серии Цикл
			ТекстСтрок = ТекстСтрок + ?(ТекстСтрок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Серия);
		КонецЦикла;
		
		Для Каждого Точка Из СтруктураОтчета.Точки Цикл
			ТекстКолонок = ТекстКолонок + ?(ТекстКолонок = "", "", ", ") + ЗаполнитьГруппировки(Настройки, Точка);
		КонецЦикла;
		
	Иначе
		
		ИдентификаторСтрок   = Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтруктураОтчета);
		ИдентификаторКолонок = Неопределено;
		
		ТекстСтрок = ЗаполнитьГруппировки(Настройки, СтруктураОтчета);
		
	КонецЕсли;
	
	ПредставлениеСтрок = ТекстСтрок;
	ПредставлениеКолонок = ТекстКолонок;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОпределитьРежимВыводаОтчета()
	
	РежимВыводаОтчета = 1;
	Если Отчет.КомпоновщикНастроек.Настройки.Структура.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтчета = Отчет.КомпоновщикНастроек.Настройки.Структура[0];
	
	ТипСтруктурыТаблицы   = Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы = Тип("ДиаграммаКомпоновкиДанных");
	
	ТипСтруктуры = ТипЗнч(СтруктураОтчета);
	Если ТипСтруктуры = ТипСтруктурыТаблицы Тогда
		РежимВыводаОтчета = 2;
	ИначеЕсли ТипСтруктуры = ТипСтруктурыДиаграммы Тогда
		РежимВыводаОтчета = 3;
	Иначе
		РежимВыводаОтчета = 1;
	КонецЕсли;
	
	Счетчик = 1;
	Для Каждого ТекВид Из Элементы.ГруппаРежимВыводаОтчета.ПодчиненныеЭлементы Цикл
		Если Счетчик = РежимВыводаОтчета Тогда
			ТекВид.Пометка = Истина;
			Элементы.ГруппаРежимВыводаОтчета.Заголовок = ТекВид.Заголовок;
			Элементы.ГруппаРежимВыводаОтчета.Картинка  = ТекВид.Картинка;
		Иначе
			ТекВид.Пометка = Ложь;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеСтруктуры()
	
	Если РежимВыводаОтчета = 1 ИЛИ ОтключеныКолонки Тогда
		ЭтаФорма.Элементы.СтруктураСтрокиНаименование.Заголовок = "Группировки";
		ЭтаФорма.Элементы.ГруппаСтруктураКолонки.Видимость = Ложь;
		Элементы.ГруппаОформлениеТаблицы.Видимость = Истина;
		Элементы.ГруппаОформлениеДиаграммы.Видимость = Ложь;
	ИначеЕсли РежимВыводаОтчета = 2 Тогда
		ЭтаФорма.Элементы.СтруктураСтрокиНаименование.Заголовок = "Строки";
		ЭтаФорма.Элементы.СтруктураКолонкиНаименование.Заголовок = "Колонки";
		ЭтаФорма.Элементы.ГруппаСтруктураКолонки.Видимость = Истина;
		Элементы.ГруппаОформлениеТаблицы.Видимость = Истина;
		Элементы.ГруппаОформлениеДиаграммы.Видимость = Ложь;
	ИначеЕсли РежимВыводаОтчета = 3 Тогда
		ЭтаФорма.Элементы.СтруктураСтрокиНаименование.Заголовок = "Серии";
		ЭтаФорма.Элементы.СтруктураКолонкиНаименование.Заголовок = "Точки";
		ЭтаФорма.Элементы.ГруппаСтруктураКолонки.Видимость = Истина;
		Элементы.ГруппаОформлениеТаблицы.Видимость = Ложь;
		Элементы.ГруппаОформлениеДиаграммы.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеГруппировок()
	
	Если Элементы.ГруппаСтруктураОтчета.Видимость Тогда
		ЗаполнитьОписаниеСтруктуры();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеДиалогом(ВзвестиМодифицированностьОтчета = Ложь, ТекстСообщения = "Настройки отчета были изменены. Необходимо переформировать отчет.")
	
	Если ВзвестиМодифицированностьОтчета Тогда
		Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Текст     = ТекстСообщения;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Истина;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Картинка  = БиблиотекаКартинок.СтатусыСобытийЖурнала_Предупреждение;
	Иначе
		Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
		Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.КомандаСохранитьКакHTML.Доступность   = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаСохранитьКакPDF.Доступность    = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОткрытьВExcel.Доступность      = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОткрытьВOpenOffice.Доступность = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОтправитьКакMXL.Доступность    = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОтправитьКакHTML.Доступность   = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОтправитьКакXLS.Доступность    = (НЕ Элементы.ТабличныйДокумент.Защита);
	Элементы.КомандаОтправитьКакPDF.Доступность    = (НЕ Элементы.ТабличныйДокумент.Защита);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПринтер(Счетчик, ИмяВремПринтера, Пометка = Ложь);
	
	ИмяКоманды   = "КомандаСписокПринтеров"+Формат(Счетчик, "ЧН=0; ЧГ=0");
	НоваяКоманда = Команды.Найти(ИмяКоманды);
	Если НоваяКоманда = Неопределено Тогда
		НоваяКоманда = Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "КомандаСписокПринтеров";
	КонецЕсли;
	
	ИдентификаторПринтера = "Принтер"+Формат(Счетчик, "ЧН=0; ЧГ=0");
	// Добавим Вид сравнения
	НовыйПринтер = Элементы.Добавить(ИдентификаторПринтера, Тип("КнопкаФормы"), Элементы.ГруппаСписокПринтеров);
	НовыйПринтер.ИмяКоманды = ИмяКоманды;
	НовыйПринтер.Заголовок  = ИмяВремПринтера;
	НовыйПринтер.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйПринтер.Пометка    = Пометка;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура сохраняет настройки формы.
//
Процедура СохранитьНастройкиФормы(СтруктураНастроек, СтруктураПараметровПечати, КлючОтчета, КлючВарианта)
	
	ХранилищеНастроекДанныхФорм.Сохранить("ФормаОтчетТонкийКлиент", "СтруктураНастроек", СтруктураНастроек);
	ХранилищеНастроекДанныхФорм.Сохранить("ФормаОтчета" + КлючОтчета, "КлючВарианта", КлючВарианта);
	ХранилищеНастроекДанныхФорм.Сохранить("ФормаОтчета" + КлючОтчета, "СтруктураПараметровПечати", СтруктураПараметровПечати);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьНастройку(Элемент, СтруктураНастроек, ИмяПоля, ЗначениеПоУмолчанию = Неопределено)
	
	Если СтруктураНастроек.Свойство(ИмяПоля) Тогда
		Элемент = СтруктураНастроек[ИмяПоля];
	ИначеЕсли НЕ ЗначениеПоУмолчанию = Неопределено Тогда
		Элемент = ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

// Процедура загружает настройки формы.
//
&НаСервере
Процедура ЗагрузитьНастройкиФормы()
	
	ПараметрыПечати =  ХранилищеНастроекДанныхФорм.Загрузить("ФормаОтчета" + КлючОтчета, "СтруктураПараметровПечати");
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		ЗаполнитьНастройку(ТабличныйДокумент.ИмяПринтера, ПараметрыПечати, "ИмяТекущегоПринтера", Неопределено);
	КонецЕсли;
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("ФормаОтчетТонкийКлиент", "СтруктураНастроек");
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		ЗаполнитьНастройку(Элементы.ФормаКнопкаПанель.Пометка, СтруктураНастроек, "ОтображатьПанель", Ложь);
	Иначе
		Элементы.ФормаКнопкаПанель.Пометка = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаКнопкаПанель.Пометка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОформление(ИмяОформления)
	
	Рез = Неопределено;
	ТекПараметр = БиблиотекаМакетовОформленияКомпоновкиДанных.Найти(ИмяОформления);
	Если НЕ ТекПараметр = Неопределено Тогда
		Рез = Новый Структура("Имя, Представление", ТекПараметр.Имя, ТекПараметр.Представление);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПользователя()
	
	Возврат ПараметрыСеанса.Пользователь.ПолноеНаименование();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПраво(ИмяПрава)
	
	Возврат обПраво(ИмяПрава);
	
КонецФункции

&НаСервере
Процедура ДобавитьПараметр(ТекПараметр)
	
	ИмяПараметра = Строка(ТекПараметр.Параметр);
	ИмяЭлемента  = "Параметр"+ИмяПараметра;
	Если Не Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоФлаг       = Ложь;
	ЭтоРадиобатон = Ложь;
	МассивТипов = ТекПараметр.ТипЗначения.Типы();
	Если МассивТипов.Количество()>0 Тогда
		ТипПараметра = МассивТипов[0];
		ЭтоФлаг = (ТипПараметра = Тип("Булево"));
		Если ТипПараметра = Тип("Число") И (НЕ ТекПараметр.ДоступныеЗначения = Неопределено) И ТекПараметр.ДоступныеЗначения.Количество()>1 Тогда
			ЭтоРадиобатон = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоФлаг Тогда
		НовыйПараметр = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаПараметры);
		НовыйПараметр.Заголовок     = ТекПараметр.Заголовок;
		НовыйПараметр.Вид           = ВидПоляФормы.ПолеФлажка;
		НовыйПараметр.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
		НовыйПараметр.Подсказка     = ТекПараметр.Заголовок;
		НовыйПараметр.ПутьКДанным   = ИмяЭлемента;
		НовыйПараметр.УстановитьДействие("ПриИзменении", "КомандаПараметрПриИзменении");
		
		ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ТекПараметр.Параметр);
		ЭтаФорма[НовыйПараметр.ПутьКДанным] = ЗначениеПараметра.Значение;
	ИначеЕсли ЭтоРадиобатон Тогда
		НовыйПараметр = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Элементы.ГруппаПараметры);
		НовыйПараметр.Заголовок     = ТекПараметр.Заголовок;
		НовыйПараметр.Вид           = ВидПоляФормы.ПолеПереключателя;
		НовыйПараметр.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
		Для Каждого ТекЭлемент Из ТекПараметр.ДоступныеЗначения Цикл
			НовыйПараметр.СписокВыбора.Добавить(ТекЭлемент.Значение, ТекЭлемент.Представление);
		КонецЦикла;
		НовыйПараметр.Подсказка     = ТекПараметр.Заголовок;
		НовыйПараметр.ПутьКДанным   = ИмяЭлемента;
		НовыйПараметр.УстановитьДействие("ПриИзменении", "КомандаПараметрПриИзменении");
		
		ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ТекПараметр.Параметр);
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СписокЗначений") И ЗначениеПараметра.Значение.Количество() = 1 Тогда
			ЭтаФорма[НовыйПараметр.ПутьКДанным] = ЗначениеПараметра.Значение[0].Значение;
		Иначе
			ЭтаФорма[НовыйПараметр.ПутьКДанным] = ЗначениеПараметра.Значение;
		КонецЕсли;
	Иначе
		НоваяГруппа = Элементы.Добавить("ГруппаПараметр"+ИмяПараметра, Тип("ГруппаФормы"), Элементы.ГруппаПараметры);
		НоваяГруппа.Вид                 = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка         = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Отображение         = ОтображениеОбычнойГруппы.Нет;
		
		НовыйПараметр = Элементы.Добавить("ПараметрНаименование"+ИмяПараметра, Тип("ДекорацияФормы"), НоваяГруппа);
		//НовыйОтбор.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйПараметр.Подсказка = ТекПараметр.Заголовок;
		НовыйПараметр.Заголовок = ТекПараметр.Заголовок;
		НовыйПараметр.Высота    = 1;
		НовыйПараметр.Ширина    = 10;
		
		НовыйПараметр = Элементы.Добавить("Параметр"+ИмяПараметра, Тип("ПолеФормы"), НоваяГруппа);
		//НовыйПараметр.Заголовок     = ТекПараметр.Заголовок;
		НовыйПараметр.Заголовок     = "";
		НовыйПараметр.Вид           = ВидПоляФормы.ПолеВвода;
		НовыйПараметр.ДоступныеТипы = Новый ОписаниеТипов(ТекПараметр.ТипЗначения);
		НовыйПараметр.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйПараметр.КнопкаВыбора  = Истина;
		НовыйПараметр.КнопкаОчистки = Истина;
		НовыйПараметр.Подсказка     = ТекПараметр.Заголовок;
		НовыйПараметр.Маска         = ТекПараметр.Маска;
		НовыйПараметр.ПутьКДанным   = "Параметр"+ИмяПараметра;
		НовыйПараметр.УстановитьДействие("ПриИзменении", "КомандаПараметрПриИзменении");
		НовыйПараметр.Формат               = ТекПараметр.ФорматРедактирования;
		НовыйПараметр.ФорматРедактирования = ТекПараметр.ФорматРедактирования;
		//НовыйПараметр.Ширина = 15;
		
		ЗначениеПараметра = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ТекПараметр.Параметр);
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартныйПериод") Тогда
			ТекРеквизит = ЭтаФорма[НовыйПараметр.ПутьКДанным];
			Если ЗначениеПараметра.Значение.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
				ТекРеквизит.ДатаНачала    = ЗначениеПараметра.Значение.ДатаНачала;
				ТекРеквизит.ДатаОкончания = ЗначениеПараметра.Значение.ДатаОкончания;
			Иначе
				ТекРеквизит.Вариант       = ЗначениеПараметра.Значение.Вариант;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
			ЭтаФорма[НовыйПараметр.ПутьКДанным] = ЗначениеПараметра.Значение.Дата;
		Иначе
			ЭтаФорма[НовыйПараметр.ПутьКДанным] = ЗначениеПараметра.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиОтчета(ИзменениеВарианта = Истина)
	
	ЕстьНачалоПериода = Ложь;
	ЕстьКонецПериода  = Ложь;
	
	Счетчик = 0;
	Для Каждого ТекущийПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		ИмяПараметра = СокрЛП(ТекущийПараметр.Параметр);
		Если ИмяПараметра = "ДатаНачала" ИЛИ ИмяПараметра = "НачалоПериода" Тогда
			ЕстьНачалоПериода = ТекущийПараметр.Использование ИЛИ ЕстьНачалоПериода;
			Продолжить;
		КонецЕсли;
		
		Если ИмяПараметра = "ДатаОкончания" ИЛИ ИмяПараметра = "ДатаОкончанияГраница" ИЛИ ИмяПараметра = "Период" ИЛИ ИмяПараметра = "КонецПериода" Тогда
			// Начальная дата не бывает без конечной
			ЕстьКонецПериода = (ТекущийПараметр.Использование ИЛИ ЕстьКонецПериода ИЛИ ЕстьНачалоПериода);
			Продолжить;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Элементы.ГруппаПараметры.Видимость = (Счетчик>0);
	
	Если ИзменениеВарианта Тогда
		
		ВидПериода = "Произвольный";
		
		ВариантЗагрузкиПериода = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантПериода(КлючОтчета, КлючТекущегоВарианта);
		
		Если ВариантЗагрузкиПериода = "" Тогда
			Попытка
				МенеджерОтчета = Отчеты[СтрЗаменить(КлючОтчета, "Отчет.", "")];
				Результат = МенеджерОтчета.ПолучитьВариантПериода();
				Если ТипЗнч(Результат) = Тип("ВариантСтандартногоПериода") Тогда
					Если Результат = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
						Результат = "ВариантСтандартногоПериода.ЭтотМесяц";
					Иначе
						Результат = ПолучитьПолноеИмяПредопределенногоЗначения(Результат);
					КонецЕсли;
				КонецЕсли;
				ВариантЗагрузкиПериода = Результат;
			Исключение
				ВариантЗагрузкиПериода = "ВариантСтандартногоПериода.ЭтотМесяц";
			КонецПопытки;
		КонецЕсли;
		
		Если НЕ ВариантЗагрузкиПериода = "ВариантСтандартногоПериода.ПроизвольныйПериод" Тогда
			СтандартныйПериодОтчета = Новый СтандартныйПериод(ПредопределенноеЗначение(ВариантЗагрузкиПериода));
			НачалоПериода = СтандартныйПериодОтчета.ДатаНачала;
			КонецПериода  = СтандартныйПериодОтчета.ДатаОкончания;
		КонецЕсли;
		
		Если Элементы.ГруппаПараметры.Видимость Тогда
			ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
			Попытка
				ОтчетОбъект.ПриИзмененииВарианта(ЭтаФорма);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;

	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, "Период"+ВидПериода);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьВариантОтчета()
	
	Настройки = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьНастройки(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючТекущегоВарианта);
	Если НЕ Настройки = Неопределено Тогда
		
		//ВариантЗагрузкиПериода = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантПериода(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючТекущегоВарианта);
		
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		//Для Каждого ТекПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		//	ИмяПараметра = "Параметр" + СокрЛП(ТекПараметр.Параметр);
		//	ЭлементПараметра = Элементы.Найти(ИмяПараметра);
		//	Если ЭлементПараметра = Неопределено Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	ЭтаФорма[ЭлементПараметра.ПутьКДанным] = ТекПараметр.Значение;
		//КонецЦикла;
		
		//ЗаполнитьСтруктуруОтчета();
		//ОпределитьРежимВыводаОтчета();
		ОбновитьНастройкиОтчета();
		//ОбновитьДанныеФормы(Истина);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ КЛИЕНТ


&НаКлиенте
Функция ПолучитьНаименованиеОтчета()
	
	НаименованиеОтчета = Заголовок;
	
	Если ЕстьНачалоПериода И ЕстьКонецПериода Тогда
		ПериодСтрокой = ПредставлениеПериода(НачалоПериода, КонецДня(КонецПериода), "ФП=Истина");
		НаименованиеОтчета = "Отчет - " + НаименованиеОтчета + " (" + ПериодСтрокой + ")";
	ИначеЕсли ЕстьКонецПериода Тогда
		ПериодСтрокой = Формат(КонецПериода, "ДЛФ=DD");
		НаименованиеОтчета = "Отчет - " + НаименованиеОтчета + " (" + ПериодСтрокой + ")";
	Иначе
		НаименованиеОтчета = "Отчет - " + НаименованиеОтчета;
	КонецЕсли;
	
	Возврат НаименованиеОтчета;
	
КонецФункции

&НаКлиенте
Функция НайтиОтборПоИмени(ИмяОтбора)
	
	Отборы = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	РезультатПоиска = Неопределено;
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяОтбора);
	Для Каждого ТекОтбор Из Отборы Цикл
		Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И ТекОтбор.ЛевоеЗначение = ПолеКомпоновки Тогда
			РезультатПоиска = ТекОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПоиска;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ПАНЕЛЕЙ ФОРМЫ

&НаСервере
Процедура ПоказатьОшибкиФормирования(СообщениеОбОшибке)
	
	Если ТипЗнч(СообщениеОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
		ОписаниеОшибки = ОтчетыКлиентСервер.КраткоеПредставлениеОшибкиФормированияОтчета(СообщениеОбОшибке);
		ПодробноеПредставлениеОшибки = НСтр("ru = 'Ошибка при формировании:'") + Символы.ПС + ПодробноеПредставлениеОшибки(СообщениеОбОшибке);
		Если ПустаяСтрока(ОписаниеОшибки) Тогда
			ОписаниеОшибки = ПодробноеПредставлениеОшибки;
		КонецЕсли;
	Иначе
		ОписаниеОшибки = СообщениеОбОшибке;
	КонецЕсли;
	
	ОтображениеСостояния = Элементы.ТабличныйДокумент.ОтображениеСостояния;
	ОтображениеСостояния.Видимость                      = Истина;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Картинка                       = Новый Картинка;
	ОтображениеСостояния.Текст                          = ОписаниеОшибки;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	//bizteh++
	НеНазначатьПериод = НЕ ((КлючОтчета = "Отчет.ТТ_ДоходыИРасходы") или (КлючОтчета = "Отчет.ТТ_АнализПродажАвтомобилей") или (КлючОтчета = "Отчет.ТТ_АнализПродаж") или (КлючОтчета = "Отчет.ТТ_СводнаяВедомость") или (КлючОтчета = "Отчет.БТ_ОтчетКумулятивнаяМаржаНов"));
	
	Если НЕ НеНазначатьПериод Тогда
		
		НачалоПериода =  Настройки.ПараметрыДанных.Элементы[0].Значение;
		КонецПериода =  Настройки.ПараметрыДанных.Элементы[1].Значение;
		
	КонецЕсли;
	//bizteh--
	
	Если ЕстьНачалоПериода и НеНазначатьПериод Тогда
		
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", НачалоПериода);
		КонецЕсли;
		
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьКонецПериода и НеНазначатьПериод Тогда
		
		// Конец периода
		ЗначениеПериода = ?(КонецПериода = Дата(1, 1, 1), КонецДня(ТекущаяДата()), КонецДня(КонецПериода));
		
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ЗначениеПериода);
		КонецЕсли;
		
		// Конец периода с границей
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ДатаОкончанияГраница"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончанияГраница", Новый Граница(ЗначениеПериода, ВидГраницы.Включая));
		КонецЕсли;
		
		// Период
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("Период"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЗначениеПериода);
		КонецЕсли;
		
		ДоступныйПараметр = Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("КонецПериода"));
		Если НЕ ДоступныйПараметр = Неопределено Тогда
			Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", ЗначениеПериода);
		КонецЕсли;
		
	КонецЕсли;
	
	СообщениеОбОшибке = Неопределено;
	
	Попытка
		ОтчетыСервер.СформироватьОтчет(ОтчетОбъект, ТабличныйДокумент, СхемаКомпоновки, Отчет.КомпоновщикНастроек, Заголовок, ДанныеРасшифровки, УникальныйИдентификатор);
	Исключение
		СообщениеОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
	
	Если НЕ СообщениеОбОшибке = Неопределено Тогда
		ПоказатьОшибкиФормирования(СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Элементы.ТабличныйДокумент.Защита              = ПолучитьПраво("ЗащитаПечатныхФорм");
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = "Отчет сформирован [&Дата]-[&Время], "+ПолучитьПользователя();
	ТабличныйДокумент.ВерхнийКолонтитул.Шрифт      = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить   = ПолучитьПраво("ПодписьПриПечатиОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева  = ЭтаФорма.Заголовок;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
	ТабличныйДокумент.НижнийКолонтитул.Выводить    = ПолучитьПраво("НумерацияСтраницОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.Шрифт       = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	
	УдалитьЭлементыГруппы(Элементы.ГруппаУровниГруппировок.ПодчиненныеЭлементы);
	
	Для Счетчик = 1 По ТабличныйДокумент.КоличествоУровнейГруппировокСтрок() Цикл
		Уровень = Строка(Счетчик);
		
		НоваяКоманда = Команды.Найти("КомандаУровень"+Уровень);
		Если НоваяКоманда = Неопределено Тогда
			НоваяКоманда = Команды.Добавить("КомандаУровень"+Уровень);
			НоваяКоманда.Действие  = "КомандаУровень";
			НоваяКоманда.Подсказка = "Открытие группировок до уровня " + Уровень;
		КонецЕсли;
		
		НовыйУровень = Элементы.Добавить("Уровень"+Уровень, Тип("КнопкаФормы"), Элементы.ГруппаУровниГруппировок);
		НовыйУровень.ИмяКоманды = НоваяКоманда.Имя;
		НовыйУровень.Заголовок  = "Уровень "+Уровень;
		НовыйУровень.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КонецЦикла;
	
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНастройки(Команда)
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("КлючОтчета",            КлючОтчета);
	СтруктураПараметров.Вставить("ЗаголовокОтчета",       Заголовок);
	СтруктураПараметров.Вставить("КлючВарианта",          СокрЛП(ЭтаФорма.КлючТекущегоВарианта));
	СтруктураПараметров.Вставить("ПредставлениеВарианта", СокрЛП(ЭтаФорма.ПредставлениеТекущегоВарианта));
	СтруктураПараметров.Вставить("Вариант",               ОтчетыСервер.КомпоновщикПолучитьНастройки(Отчет.КомпоновщикНастроек));
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",     Ложь);
	СтруктураПараметров.Вставить("СхемаКомпоновки",       СхемаКомпоновки);
	СтруктураПараметров.Вставить("НачалоПериода",         НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",          КонецДня(КонецПериода));
	СтруктураПараметров.Вставить("ВидПериода",            ВидПериода);
	
	ЭтаФорма.ВариантМодифицирован = Ложь;
	
	ОписаниеОповещенияИзмененияНастроек = Новый ОписаниеОповещения("ОповещениеИзмененияНастроек", ЭтаФорма);
	
	//Если НастройкиОтчета.Параметры.ЭкспертнаяНастройка Тогда
	//	ОткрытьФорму(ИмяФормы+"Варианта", СтруктураПараметров, ЭтотОбъект,,,, ОписаниеОповещенияИзмененияНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Иначе
	ОткрытьФорму(ИмяФормыОтчета+"Настроек", СтруктураПараметров, ЭтаФорма, КлючУникальности,,, ОписаниеОповещенияИзмененияНастроек, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеИзмененияНастроек(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		РезультатЗакрытия.Свойство("НачалоПериода", НачалоПериода);
		РезультатЗакрытия.Свойство("КонецПериода",  КонецПериода);
		РезультатЗакрытия.Свойство("ВидПериода",    ВидПериода);
		
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(РезультатЗакрытия.Вариант);
		//ОбновитьБыстрыеНастройки();
		//ЗаполнитьСтруктуруОтчета();
		//ОпределитьРежимВыводаОтчета();
		//ОбновитьДанныеФормы(Истина);
		
		ОбновитьНастройкиОтчета(Ложь);
		
		ЭтаФорма.КлючТекущегоВарианта          = РезультатЗакрытия.КлючВарианта;
		ЭтаФорма.ПредставлениеТекущегоВарианта = РезультатЗакрытия.ПредставлениеВарианта;
		
		ОбновитьСписокВариантовОтчета();
		
		СформироватьОтчет();
		
	Иначе
		
		ОбновитьСписокВариантовОтчета();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПанельНастроек(Команда)
	
	Элементы.ФормаКнопкаПанель.Пометка = (НЕ Элементы.ФормаКнопкаПанель.Пометка);
	Элементы.ГруппаНастройки.Видимость = Элементы.ФормаКнопкаПанель.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьВариант(Кнопка)
	
	Для Каждого ТекВариант Из Элементы.ГруппаВариантыНастроек.ПодчиненныеЭлементы Цикл
		ТекВариант.Пометка = (ТекВариант.ИмяКоманды = Кнопка.Имя);
	КонецЦикла;
	
	ИмяВарианта = СтрЗаменить(Кнопка.Имя, Кнопка.Действие, "");
	
	//КлючТекущегоВарианта = СтрЗаменить(Кнопка.Имя, Кнопка.Действие, "");
	ЗаголовокВарианта = Элементы[ИмяВарианта].Заголовок;
	Если ПустаяСтрока(ЗаголовокВарианта) = "" Тогда
		Элементы.ГруппаВариантыНастроек.Заголовок = "Вариант настроек";
	Иначе
		Элементы.ГруппаВариантыНастроек.Заголовок = "Вариант настроек: <" + ЗаголовокВарианта + ">";
	КонецЕсли;
	
	//УстановитьЗаголовокОтчета(ЗаголовокВарианта);
	
	ВариантНастроек = ТаблицаВариантов.НайтиСтроки(Новый Структура("Имя", ИмяВарианта));
	
	// Если это вариант из хранилища, то преобразуем
	//КлючТекущегоВарианта = ИмяВарианта;
	//ВариантВХранилище = СписокВариантовВХранилище.НайтиПоЗначению(ИмяВарианта);
	//Если ВариантВХранилище = Неопределено Тогда
	//	КлючТекущегоВарианта = ИмяВарианта;
	//Иначе
	//	КлючТекущегоВарианта = ВариантВХранилище.Представление;
	//КонецЕсли;
	Если ВариантНастроек.Количество()>0 Тогда
		ЭтаФорма.КлючТекущегоВарианта          = ВариантНастроек[0].Идентификатор;
		ЭтаФорма.ПредставлениеТекущегоВарианта = ВариантНастроек[0].Представление;
	КонецЕсли;
	
	ИзменитьВариантОтчета();
	
	//ВзвестиМодифицированностьОтчета();
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия кнопки "Печать"
Процедура КомандаПечать(Команда)
	
	ТабличныйДокумент.ИмяПринтера = ИмяПринтера;
	СразуНаПечать = (НЕ ПустаяСтрока(ИмяПринтера));
	
	ЭкземпляровНаСтранице = ПолучитьПраво("КоличествоСтраницНаЛисте");
	
	Если ЭкземпляровНаСтранице<>0 И ЭкземпляровНаСтранице<>1 И ЭкземпляровНаСтранице<>2 Тогда
		ЭкземпляровНаСтранице=0;
	КонецЕсли;
	
	ТабличныйДокумент.ВерхнийКолонтитул.ТекстСлева = "Отчет сформирован [&Дата]-[&Время], "+ПолучитьПользователя();
	ТабличныйДокумент.ВерхнийКолонтитул.Шрифт      = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить   = ПолучитьПраво("ПодписьПриПечатиОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.ТекстСлева  = ЭтаФорма.Заголовок;
	ТабличныйДокумент.НижнийКолонтитул.ТекстСправа = "[&НомерСтраницы]";
	ТабличныйДокумент.НижнийКолонтитул.Выводить    = ПолучитьПраво("НумерацияСтраницОтчетов");
	ТабличныйДокумент.НижнийКолонтитул.Шрифт       = Новый Шрифт(ТабличныйДокумент.ВерхнийКолонтитул.Шрифт,,6);
	
	// печать табличного документа
	ТабличныйДокумент.ЭкземпляровНаСтранице      = ЭкземпляровНаСтранице;
	ТабличныйДокумент.Напечатать(СразуНаПечать);
	
КонецПроцедуры

&НаКлиенте
// Получает список принтеров установленных в системе и предлагает пользователю выбрать принтер для печати
Процедура КомандаСписокПринтеров(Команда)
	
	Индекс = СтрЗаменить(Команда.Имя, Команда.Действие, "");
	КоличествоПринтеров = Принтеры.Количество();
	Если КоличествоПринтеров>Число(Индекс) Тогда
		Для Каждого ТекПринтер Из Элементы.ГруппаСписокПринтеров.ПодчиненныеЭлементы Цикл
			ТекПринтер.Пометка = (ТекПринтер.Имя = "Принтер"+Индекс);
		КонецЦикла;
		ТекПринтер = Принтеры[Число(Индекс)];
		ИмяТекПринтера           = ТекПринтер.Значение;
		ПредставлениеТекПринтера = ТекПринтер.Представление;
		
		ИмяПринтера = ?(ИмяТекПринтера = "ДиалогВыбораПринтера","", ИмяТекПринтера);
		Элементы.ГруппаСписокПринтеров.Заголовок = ?(ПустаяСтрока(ИмяТекПринтера), "Список принтеров","Принтер: <"+ПредставлениеТекПринтера+">");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОформление(Команда)
	
	//ИмяВремОформления = СтрЗаменить(Команда.Имя, Команда.Действие, "");
	//ТекОформление = ПолучитьОформление(ИмяВремОформления);
	//Если Не ТекОформление = Неопределено Тогда
	//	ТекПараметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	//	Если НЕ ТекПараметр = Неопределено Тогда
	//		ИмяОформления = ИмяВремОформления;
	//		ТекПараметр.Значение = ИмяОформления;
	//		ТекПараметр.Использование = Истина;
	//		ИмяЭлемента = "Оформление"+ИмяОформления;
	//		
	//		Для Каждого ТекЭлемент Из Элементы.ГруппаОформлениеТаблицы.ПодчиненныеЭлементы Цикл
	//			ТекЭлемент.Пометка = (ТекЭлемент.Имя = ИмяЭлемента);
	//		КонецЦикла;
	//		
	//		Элементы.ГруппаОформлениеТаблицы.Заголовок = "Оформление: <" + ТекОформление.Представление + ">";
	//		
	//	КонецЕсли;
	//КонецЕсли;
	//
	//УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТипДиаграммы(Команда)
	
	//Позиция = Найти(Команда.Имя, Команда.Действие);
	//ИмяВремОформления = Сред(Команда.Имя, Позиция+СтрДлина(Команда.Действие));
	////ИмяТаблицы = Лев(Команда.Имя, Найти(Команда.Имя, Команда.Действие)-1);
	//ГруппаОформление = Элементы.ГруппаОформлениеДиаграммы;
	//
	//ЗначениеОформления = ПредопределенноеЗначение("ТипДиаграммы."+ИмяВремОформления);
	//ТекПараметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("ТипДиаграммы");
	//Если НЕ ТекПараметр = Неопределено Тогда
	//	ИмяОформления = ИмяВремОформления;
	//	ТекПараметр.Значение = ЗначениеОформления;
	//	ТекПараметр.Использование = Истина;
	//	ИмяЭлемента = "Оформление"+ИмяОформления;
	//	
	//	Картинка = Неопределено;
	//	Для Каждого ТекЭлемент Из ГруппаОформление.ПодчиненныеЭлементы Цикл
	//		Если ТекЭлемент.Имя = ИмяЭлемента Тогда
	//			ТекЭлемент.Пометка = Истина;
	//			Картинка = ТекЭлемент.Картинка;
	//		Иначе
	//			ТекЭлемент.Пометка = Ложь;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	ГруппаОформление.Заголовок   = СокрЛП(ЗначениеОформления);
	//	ГруппаОформление.Картинка    = Картинка;
	//	ГруппаОформление.Отображение = ОтображениеКнопки.КартинкаИТекст;
	//КонецЕсли;
	//
	//УправлениеДиалогом(Истина);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ПОДМЕНЮ "ДЕЙСТВИЯ" ОСНОВНОЙ ПАНЕЛИ ФОРМЫ

&НаКлиенте
// Процедура сохраняет табличный документ в формате HTML под введенным пользователем именем файла
Процедура КомандаСохранитьКакHTML(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок      = "Сохранение веб-страницы";
	Диалог.Фильтр         = "Веб-страница (*.html)|*.html";
	Диалог.ПолноеИмяФайла = ПолучитьНаименованиеОтчета();
	
	Если Диалог.Выбрать() Тогда
		Если НЕ ПустаяСтрока(Диалог.ПолноеИмяФайла) Тогда
			ТабличныйДокумент.Записать(Диалог.ПолноеИмяФайла, ТипФайлаТабличногоДокумента.HTML);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакPDF(ИмяФайла)
	
	ТабличныйДокумент.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
	
КонецПроцедуры

&НаКлиенте
// Процедура сохраняет табличный документ в формате PDF под введенным пользователем именем файла
Процедура КомандаСохранитьКакPDF(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок		= "Сохранение PDF-файла";
	Диалог.Расширение		= "pdf";
	Диалог.Фильтр			= "PDF файлы (*.pdf)|*.pdf";
	
	Диалог.ПолноеИмяФайла = ПолучитьНаименованиеОтчета();
	
	Если Диалог.Выбрать() Тогда
		
		СохранитьКакPDF(Диалог.ПолноеИмяФайла);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКаталогВременныхФайлов()
	
	#Если ВебКлиент Тогда
		Возврат "";
	#Иначе
		Возврат КаталогВременныхФайлов();
	#КонецЕсли
	
КонецФункции

&НаКлиенте
// Процедура открывает в Microsoft Excel табличный документ или сводную таблицу
Процедура КомандаОткрытьВExcel(Команда)
	
	Если ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
		Результат = Вопрос("Для продолжения нужно сформировать отчет. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		СформироватьОтчет();
	КонецЕсли;
	
	пчВывестиМакетMSExcel(ТабличныйДокумент);
	
КонецПроцедуры

&НаКлиенте
// Процедура открывает в Open Office Calc табличный документ или сводную таблицу
Процедура КомандаОткрытьВOpenOffice(Команда)
	
	пчВывестиМакетOpenOffice(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХранилищеЗначений(Файл)
	
	Возврат Новый ХранилищеЗначения(Файл, Новый СжатиеДанных());
	
КонецФункции

&НаСервереБезКонтекста
// Выделяет из имени файла его расширение (набор символов после последней точки).
//
// Параметры
//  ИмяФайла – Строка, содержащая имя файла, неважно с именем каталога или без.
//
// Возвращаемое значение:
//   Строка – расширение файла.
//
Функция ПолучитьРасширениеФайла(ИмяФайла) Экспорт
	
	ПозицияПоследнейТочки = 0;
	РасширениеФайла = ИмяФайла;
	
	Пока 1 = 1 Цикл
		ПозицияПоследнейТочки = Найти(РасширениеФайла, ".");
		Если ПозицияПоследнейТочки = 0 Тогда
			Прервать;
		Иначе
			РасширениеФайла = Сред(РасширениеФайла, ПозицияПоследнейТочки + 1)
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(РасширениеФайла = ИмяФайла, "", РасширениеФайла);
	
КонецФункции // ПолучитьРасширениеФайла()

&НаСервереБезКонтекста
// Функция корректно обрезает имя файла если оно  больше 100 символов, 
// чтобы осталось расширение. (рфОбрезатьИмяФайла("ОченьДлинноеИмяФайла.txt",20) -> ОченьДлинноеИмяФ.txt)
//
// Параметры
//  ИмяФайла 		   – Строка, содержащая имя файла, неважно с именем каталога или без.
//  КоличествоСимволов – Число, кол-во символов, до которого необходимо урезать имя файла.
//  ВыводитьСообщение  – Булево, признак необходимости вывести сообщение что имя файла обрезано.
//
// Возвращаемое значение:
//  Строка   – обрезанное имя файла.
//
Функция ОбрезатьИмяФайла(Знач ИмяФайла, КоличествоСимволов, ВыводитьСообщение=Ложь) Экспорт
	
	Если СтрДлина(ИмяФайла) > КоличествоСимволов Тогда
		Если ВыводитьСообщение Тогда
			Сообщить("Имя файла """+ИмяФайла+""" обрезано, так как его длина больше "+КоличествоСимволов+" символов", СтатусСообщения.Информация);
		КонецЕсли; 
		РасширениеФайла = рфПолучитьРасширениеФайла(ИмяФайла);
		СамоИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла)-СтрДлина(РасширениеФайла)-1);
		СамоИмяФайла = Лев(СамоИмяФайла, КоличествоСимволов-СтрДлина(РасширениеФайла)-1);
		ИмяФайла = СамоИмяФайла + "." + РасширениеФайла;
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции // ОбрезатьИмяФайла()

&НаКлиенте
Процедура ДобавитьВложенияВПисьмо(ПрикрепленныеФайлы, МассивВложений)
	
	Для Каждого ПолученноеИмяФайла Из МассивВложений Цикл
		
		ИмяФайла = ПолученноеИмяФайла;
		
		Файл = Новый Файл(ИмяФайла);
		
		Пока Найти(ИмяФайла,"\")>0 Цикл
			ИмяФайла = Прав(ИмяФайла,СтрДлина(ИмяФайла) - Найти(ИмяФайла,"\"));
		КонецЦикла;	
		
		Если Файл.Размер() > 26214400 Тогда
			
			Ответ = Вопрос("Размер добавляемого файла """ + ИмяФайла + """
			|больше 25 Mb. Добавить ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет,"Внимание!");
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Продолжить;
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		
		НоваяСтрока = ПрикрепленныеФайлы.Добавить();
		НоваяСтрока.Имя = ОбрезатьИмяФайла(ИмяФайла, 100, Истина);
		
		//#Если Клиент Тогда 
		Состояние("Добавляется файл: " + НоваяСтрока.Имя);
		//#КонецЕсли
		ДвоичныйФайл = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		НоваяСтрока.Файл = ПолучитьХранилищеЗначений(ДвоичныйФайл);
		//НоваяСтрока.Файл = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый СжатиеДанных());
		НоваяСтрока.Размер = Файл.Размер();
		
		Попытка
			УдалитьФайлы(ПолученноеИмяФайла);
		Исключение
			Сообщить("Не удалось удалить файл: " +	ПолученноеИмяФайла);
		КонецПопытки
	
	КонецЦикла;

КонецПроцедуры // ДобавитьВложенияВПисьмо()

&НаКлиенте
// Процедура отправляет отчет по электронной почте в виде табличного документа в 3-х форматах
Процедура КомандаОтправитьПоEmail(Команда)
	
	РасширениеФайла = "";
	ТипПересылаемогоФайла = Неопределено;
	Если Команда.Имя = "КомандаОтправитьКакMXL" Тогда
		ТипПересылаемогоФайла = ТипФайлаТабличногоДокумента.MXL;
		РасширениеФайла = ".mxl";
	ИначеЕсли Команда.Имя = "КомандаОтправитьКакHTML" Тогда
		ТипПересылаемогоФайла = ТипФайлаТабличногоДокумента.HTML;
		РасширениеФайла = ".html";
	ИначеЕсли Команда.Имя = "КомандаОтправитьКакXLS" Тогда
		ТипПересылаемогоФайла = ТипФайлаТабличногоДокумента.XLS;
		РасширениеФайла = ".xls";
	ИначеЕсли Команда.Имя = "КомандаОтправитьКакPDF" Тогда
		ТипПересылаемогоФайла = ТипФайлаТабличногоДокумента.PDF;
		РасширениеФайла = ".pdf";
	Иначе
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли
	
	НаименованиеОтчета = ПолучитьНаименованиеОтчета();
	НаименованиеОтчета = СтрЗаменить(НаименованиеОтчета, ":", "");
	
	ИмяФайлаСообщения = ПолучитьКаталогВременныхФайлов() + НаименованиеОтчета + РасширениеФайла;
	Если ТипЗнч(ТипПересылаемогоФайла) = Тип("ТипФайлаТабличногоДокумента") Тогда
		ТабличныйДокумент.Записать(ИмяФайлаСообщения, ТипПересылаемогоФайла);
	Иначе
		Возврат;
	КонецЕсли;
	
	НовоеПисьмо = ПолучитьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта");
	НовоеПисьмо.ДокументОбъект.Тема = НаименованиеОтчета;
	
	// добавим вложения
	МассивВложений = Новый Массив;
	МассивВложений.Добавить(ИмяФайлаСообщения);
	
	ДобавитьВложенияВПисьмо(НовоеПисьмо.ПрикрепленныеФайлы, МассивВложений);
	
	Если НЕ ПолучитьПраво("ИспользоватьВстроенныйКлиент") Тогда
		НовоеПисьмо.ДокументОбъект.ДополнительныеСвойства.Вставить("ОтправитьВнешнимКлиентом", Истина);
	КонецЕсли;
	
	НовоеПисьмо.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВИзбранное(СтруктураЗначений, Менеджер, ВревИмяОтчета)
	
	Избранное = Обработки.Избранное.Создать();
	Избранное.ДобавитьВИзбранное(СтруктураЗначений, Менеджер, ВревИмяОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФормуВИзбранное(НаименованиеОтчета)
	
	
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//СтруктураЗначений = Новый Структура;
	//СтруктураЗначений.Вставить("НастройкиОтчета", НастройкиОтчета);
	//СтруктураЗначений.Вставить("Менеджер",        ИмяФормыОтчета);
	//СтруктураЗначений.Вставить("Наименование",    НаименованиеОтчета);
	//СтруктураЗначений.Вставить("ЭтоКомпоновщик",  Истина);
	//Если Элементы.Найти("ПараметрДатаНачала")<>Неопределено И Элементы.Найти("ПараметрДатаКонца")<>Неопределено Тогда
	//	СтруктураЗначений.Вставить("ДатаНачала",       ЭтаФорма["ПараметрДатаНачала"]);
	//	СтруктураЗначений.Вставить("ДатаКонца",        ЭтаФорма["ПараметрДатаКонца"]);
	//КонецЕсли;
	////СтруктураЗначений.Вставить("ИмяФормыНастроек", ИмяФормыОтчета);
	//
	////ДобавитьВИзбранное(СтруктураЗначений, ИмяФормыОтчета, ИмяФормыОтчета);
	//Избранное = Обработки.Избранное.Создать();
	//Избранное.ДобавитьВИзбранное(СтруктураЗначений, ИмяФормыОтчета, Заголовок);
	
КонецПроцедуры

&НаКлиенте
// Процедура добавляет вызов формы отчета в Избранное
Процедура КомандаИзбранноеДобавитьФорму(Команда)
	
	////Менеджер = "Отчеты." + ОтчетОбъект.Метаданные().Имя;
	//Менеджер = ИмяФормыОтчета;
	//
	//НаименованиеОтчета = ПолучитьНаименованиеОтчета();
	//
	//СтруктураЗначений = Новый Структура;
	////отСтруктураСохраняемыхЗначений(ОтчетОбъект, СтруктураЗначений);
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//
	//СтруктураЗначений.Вставить("НастройкиОтчета",  НастройкиОтчета);
	//СтруктураЗначений.Вставить("Менеджер",         Менеджер);
	//СтруктураЗначений.Вставить("Наименование",     НаименованиеОтчета);
	//Если Элементы.Найти("ПараметрДатаНачала")<>Неопределено И Элементы.Найти("ПараметрДатаКонца")<>Неопределено Тогда
	//	СтруктураЗначений.Вставить("ДатаНачала",       ЭтаФорма["ПараметрДатаНачала"]);
	//	СтруктураЗначений.Вставить("ДатаКонца",        ЭтаФорма["ПараметрДатаКонца"]);
	//КонецЕсли;
	//СтруктураЗначений.Вставить("ИмяФормыНастроек", ИмяФормыОтчета);
	//
	//ДобавитьВИзбранное(СтруктураЗначений, Менеджер, ИмяФормыОтчета);
	//
	НаименованиеОтчета = ПолучитьНаименованиеОтчета();
	ДобавитьФормуВИзбранное(НаименованиеОтчета);
	
КонецПроцедуры

&НаКлиенте
// Процедура добавляет табличный документ отчета в Избранное
Процедура КомандаИзбранноеДобавитьРезультат(Команда)
	
	//Избранное = Обработки.Избранное.Создать();
	//Менеджер = "Отчеты." + ОтчетОбъект.Метаданные().Имя;
	//СтрЗаменить(ИмяФормыОтчета
	//Менеджер = ИмяФормыОтчета;
	//
	//НаименованиеОтчета = ПолучитьНаименованиеОтчета();
	//
	//Элементы.ТабличныйДокумент.Записать(КаталогВременныхФайлов() + "tmpmxl.mxl");
	//
	//Таблица = Новый ТабличныйДокумент();
	//Таблица.Прочитать(КаталогВременныхФайлов() + "tmpmxl.mxl");
	//Таблица.Область(1, 1, Таблица.ВысотаТаблицы, Таблица.ШиринаТаблицы).Расшифровка = Неопределено;
	//УдалитьФайлы(КаталогВременныхФайлов() + "tmpmxl.mxl");
	//
	//Свойства = Новый Структура();
	//Свойства.Вставить("Защита",                    Элементы.ТабличныйДокумент.Защита);
	//Свойства.Вставить("ОриентацияСтраницы",        Элементы.ТабличныйДокумент.ОриентацияСтраницы);
	//Свойства.Вставить("ОтображатьЗаголовки",       Элементы.ТабличныйДокумент.ОтображатьЗаголовки);
	//Свойства.Вставить("ОтображатьСетку",           Элементы.ТабличныйДокумент.ОтображатьСетку);
	//Свойства.Вставить("ПовторятьПриПечатиСтроки",  Элементы.ТабличныйДокумент.ПовторятьПриПечатиСтроки);
	//Свойства.Вставить("ПовторятьПриПечатиКолонки", Элементы.ТабличныйДокумент.ПовторятьПриПечатиКолонки);
	//Свойства.Вставить("ТолькоПросмотр",            Элементы.ТабличныйДокумент.ТолькоПросмотр);
	//Свойства.Вставить("ФиксацияСверху",            Элементы.ТабличныйДокумент.ФиксацияСверху);
	//Свойства.Вставить("ФиксацияСлева",             Элементы.ТабличныйДокумент.ФиксацияСлева);
	//
	//НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	//СтруктураЗначений = Новый Структура;
	////отСтруктураСохраняемыхЗначений(ОтчетОбъект, СтруктураЗначений);
	//СтруктураЗначений.Вставить("НастройкиОтчета",   НастройкиОтчета);
	//СтруктураЗначений.Вставить("Менеджер",          Менеджер);
	//СтруктураЗначений.Вставить("Наименование",      НаименованиеОтчета);
	//СтруктураЗначений.Вставить("ТабличныйДокумент", Новый Структура("Таблица, Свойства", ЗначениеВСтрокуВнутр(Таблица), Свойства));
	//
	////Избранное.ДобавитьВИзбранное(СтруктураЗначений, Менеджер, ОтчетОбъект.ИмяФормыНастроек);
	//ДобавитьВИзбранное(СтруктураЗначений, Менеджер, ИмяФормыОтчета);
	
КонецПроцедуры

&НаКлиенте
// Процедура управляет отображением уровня группировки табличного документа
Процедура КомандаУровень(Команда)
	
	НомерГруппировки = Число(СтрЗаменить(Команда.Имя, "КомандаУровень", ""));
	ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(НомерГруппировки - 1);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ ОТЧЕТА

&НаКлиенте
Процедура КомандаПараметрПриИзменении(Команда)
	
	Если ТипЗнч(Команда) = Тип("Строка") Тогда
		ИмяКоманды = Команда;
	Иначе
		ИмяКоманды = Команда.Имя;
	КонецЕсли;
	
	ЗначениеПараметра = ЭтаФорма[ИмяКоманды];
	ИмяПараметра = СтрЗаменить(ИмяКоманды, "Параметр", "");
	//Если ИмяПараметра = "ДатаОкончания" Тогда
	//	
	//	ПараметрОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
	//	Если НЕ ПараметрОформления = Неопределено Тогда
	//		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ЗначениеПараметра);
	//	КонецЕсли;
	//	
	//	ПараметрОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ДатаОкончанияГраница"));
	//	Если НЕ ПараметрОформления = Неопределено Тогда
	//		//ЗначениеГраницы = Новый Граница(КонецДня(ЗначениеПараметра), ВидГраницы.Включая);
	//		ЗначениеГраницы = ОтчетыСервер.ПолучитьГраницуПериода(ЗначениеПараметра);
	//		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончанияГраница", ЗначениеГраницы);
	//	КонецЕсли;
	//	
	//Иначе
		Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	//КонецЕсли;
	
	//ВзвестиМодифицированностьОтчета();
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьВидСравнения(Команда)
	
	ИмяОтбора    = СтрЗаменить(Команда.Имя, Команда.Действие, "");
	КнопкаФормы  = Элементы["ОтборВидСравнения"+ИмяОтбора];
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = ОтчетыСервер.КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, Отчет.КомпоновщикНастроек.Настройки.Отбор);
	
	ОписаниеОтбора    = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеПоиска.ЛевоеЗначение);
	ТекПозиция        = ОписаниеОтбора.ДоступныеВидыСравнения.НайтиПоЗначению(ПолеПоиска.ВидСравнения);
	НовыйВидСравнения = ВыбратьИзСписка(ОписаниеОтбора.ДоступныеВидыСравнения, Команда, ТекПозиция);
	
	Если НЕ НовыйВидСравнения = Неопределено Тогда
		ПолеПоиска.ВидСравнения = НовыйВидСравнения.Значение;
		КнопкаФормы.Заголовок   = Строка(НовыйВидСравнения.Значение);
		
		Если ОтчетыСервер.ОтборПоСписку(ПолеПоиска.ВидСравнения) Тогда
			
			СписокВыбора = Неопределено;
			Если ТипЗнч(ПолеПоиска.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				СписокВыбора = ПолеПоиска.ПравоеЗначение;
			Иначе
				СписокВыбора = Новый СписокЗначений;
				Если ЗначениеЗаполнено(ПолеПоиска.ПравоеЗначение) Тогда
					СписокВыбора.Добавить(ПолеПоиска.ПравоеЗначение);
				КонецЕсли;
			КонецЕсли;
			Элементы["ОтборЗначение" + ИмяОтбора].ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
			ПолеПоиска.ПравоеЗначение                             = СписокВыбора;
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = СписокВыбора;
		ИначеЕсли ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено ИЛИ 
				ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = Неопределено;
		Иначе
			ЗначениеПоля = Неопределено;
			Если ТипЗнч(ПолеПоиска.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				Если ПолеПоиска.ПравоеЗначение.Количество()>0 Тогда
					ЗначениеПоля = ПолеПоиска.ПравоеЗначение[0].Значение;
				КонецЕсли;
			Иначе
				ЗначениеПоля = ПолеПоиска.ПравоеЗначение;
			КонецЕсли;
			
			Элементы["ОтборЗначение" + ИмяОтбора].ОграничениеТипа = ОписаниеОтбора.ТипЗначения;
			ПолеПоиска.ПравоеЗначение                             = ЗначениеПоля;
			ЭтаФорма["ОтборЗначение" + ИмяОтбора]                 = ЗначениеПоля;
		КонецЕсли;
	КонецЕсли;
	
	//ВзвестиМодифицированностьОтчета();
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборПриИзмененииИспользования(Команда)
	
	ДоступностьОтбора = ЭтаФорма[Команда.Имя];
	
	ИмяОтбора    = СтрЗаменить(Команда.Имя, "ОтборИспользование", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = ОтчетыСервер.КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, Отчет.КомпоновщикНастроек.Настройки.Отбор);
	ПолеПоиска.Использование = ДоступностьОтбора;
	
	//ВзвестиМодифицированностьОтчета();
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяОтбора    = СтрЗаменить(Элемент.Имя, "ОтборЗначение", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = ОтчетыСервер.КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, Отчет.КомпоновщикНастроек.Настройки.Отбор);
	
	Если ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено ИЛИ 
		ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
	Если ОтчетыСервер.ОтборПоСписку(ПолеПоиска.ВидСравнения) Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОтбора       = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеПоиска.ЛевоеЗначение);
		
		Если ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
			 ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			ТолькоГруппы = Истина;
		Иначе
			ТолькоГруппы = Ложь;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы", ПолеПоиска.ПравоеЗначение, ОписаниеОтбора.ТипЗначения, ОписаниеОтбора.ДоступныеЗначения, ТолькоГруппы);
		
		ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент);
		Рез = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ Рез = Неопределено Тогда
			ПолеПоиска.ПравоеЗначение = Рез;
			ЭтаФорма[Элемент.Имя]     = Рез;
			//ВзвестиМодифицированностьОтчета();
			УправлениеДиалогом(Истина);
		КонецЕсли;
	ИначеЕсли ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии ИЛИ 
				ПолеПоиска.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		Элемент.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборЗначениеПриИзменении(Команда)
	
	ЗначениеОтбора = ЭтаФорма[Команда.Имя];
	ИмяОтбора    = СтрЗаменить(Команда.Имя, "ОтборЗначение", "");
	СтрокаОтбора = СтруктураОтборов[ИмяОтбора];
	ПолеПоиска   = ОтчетыСервер.КомпоновщикНайтиОтбор(СтрокаОтбора.ЛевоеЗначение, Отчет.КомпоновщикНастроек.Настройки.Отбор);
	ПолеПоиска.ПравоеЗначение = ЗначениеОтбора;
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		ЭтаФорма["ОтборИспользование"+ИмяОтбора] = Истина;
		ПолеПоиска.Использование = Истина;
	КонецЕсли;
	
	//ВзвестиМодифицированностьОтчета();
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокПолей(Поля)
	
	СписокПолей = Новый Массив;
	Для Каждого ТекПоле Из Поля Цикл
		
		НоваяСтрока = Новый Структура("Использование, Поле, Заголовок, ТипГруппировки");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекПоле);
		СписокПолей.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

&НаКлиенте
Процедура НастройкиКомпоновщикаНажатие(Элемент, СтандартнаяОбработка)
	
	//ИмяПоля = СтрЗаменить(Элемент.Имя, "Наименование", "");
	//
	//СтандартнаяОбработка = Ложь;
	//
	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	//СтруктураПараметров.Вставить("НастройкиОтчета", ОтчетыСервер.КомпоновщикПолучитьНастройки(Отчет.КомпоновщикНастроек));
	//СтруктураПараметров.Вставить("ВидПолей",        ИмяПоля);
	//СтруктураПараметров.Вставить("ТекущаяСтрока",   Отчет.КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(Отчет.КомпоновщикНастроек.Настройки));
	//
	//Если ИмяПоля = "Порядок" ИЛИ ИмяПоля = "ДопПоля" Тогда
	//	СтруктураПараметров.Вставить("ТолькоРесурсы", Истина);
	//КонецЕсли;
	//
	//ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетРедактированиеВыбранныхПолей", СтруктураПараметров, Элемент);
	//
	//Рез = ФормаВыбора.ОткрытьМодально();
	//Если Рез = КодВозвратаДиалога.ОК Тогда
	//	
	//	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ФормаВыбора.КомпоновщикНастроек.Настройки);
	//	//ВзвестиМодифицированностьОтчета();
	//	УправлениеДиалогом(Истина);
	//	Если Элемент.Имя = "Отбор" ИЛИ Элемент.Имя = "ОтборНаименование" Тогда
	//		//ОбновитьДанныеФормы();
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзментьГруппировки(Элемент, ИмяТаблицы)
	
	//ИмяПоля = "НастройкаСтруктуры";
	//
	//Если ИмяТаблицы = "Строки" Тогда
	//	ИдентификаторГруппировок = ИдентификаторСтрок;
	//КонецЕсли;
	//
	//Если ИмяТаблицы = "Колонки" Тогда
	//	ИдентификаторГруппировок = ИдентификаторКолонок;
	//КонецЕсли;
	//
	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("СхемаКомпоновки",          СхемаКомпоновки);
	//СтруктураПараметров.Вставить("НастройкиОтчета",          ОтчетыСервер.КомпоновщикПолучитьНастройки(Отчет.КомпоновщикНастроек));
	//СтруктураПараметров.Вставить("ВидПолей",                 ИмяПоля);
	//СтруктураПараметров.Вставить("ИдентификаторГруппировок", ИдентификаторГруппировок);
	//
	//ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетРедактированиеВыбранныхПолей", СтруктураПараметров, Элемент);
	//
	//Рез = ФормаВыбора.ОткрытьМодально();
	//Если Рез = КодВозвратаДиалога.ОК Тогда
	//	
	//	ТекущаяТаблица = Отчет.КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(ИдентификаторГруппировок);
	//	СтруктураГруппировки = ТекущаяТаблица;
	//	
	//	Для Каждого ТекущаяГруппировка Из ФормаВыбора.Группировки Цикл
	//		
	//		НоваяГруппировка = СтруктураГруппировки.Добавить();
	//		Если ТекущаяГруппировка.ПоложениеСтроки>0 Тогда
	//			СтараяГруппировка = ТекущаяТаблица[0];
	//			Для Счетчик = 2 По ТекущаяГруппировка.ПоложениеСтроки Цикл
	//				СтараяГруппировка = СтараяГруппировка.Структура[0];
	//			КонецЦикла;
	//			
	//			ОтчетыКлиентСервер.ЗаполнитьНастройкиСКД(НоваяГруппировка, СтараяГруппировка);
	//			
	//		КонецЕсли;
	//		
	//		НоваяГруппировка.Использование = ТекущаяГруппировка.Использование;
	//		НоваяГруппировка.ПоляГруппировки.Элементы.Очистить();
	//		
	//		Для Каждого ТекущееПоле Из ТекущаяГруппировка.ПоляГруппировки Цикл
	//			НовоеПоле = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//			ЗаполнитьЗначенияСвойств(НовоеПоле, ТекущееПоле);
	//			НовоеПоле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	//		КонецЦикла;
	//		НоваяГруппировка.ПоляГруппировки.Элементы[0].ТипГруппировки = ТекущаяГруппировка.ТипГруппировки;
	//		
	//		СтруктураГруппировки = НоваяГруппировка.Структура;
	//		
	//	КонецЦикла;
	//	
	//	КоличествоСтрок = ТекущаяТаблица.Количество() - 2;
	//	Пока КоличествоСтрок>=0 Цикл
	//		ТекущаяТаблица.Удалить(КоличествоСтрок);
	//		КоличествоСтрок = КоличествоСтрок - 1;
	//	КонецЦикла;
	//	
	//	ЗаполнитьСтруктуруОтчета();
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИзментьГруппировки(Элемент, "Строки");
	
КонецПроцедуры

&НаКлиенте
Процедура КолонкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИзментьГруппировки(Элемент, "Колонки");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиРасшифровки(Расшифровка, ПараметрВыполненногоДействия)
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, 
	Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	
	Возврат ОбработкаРасшифровки.ПрименитьНастройки(Расшифровка, ПараметрВыполненногоДействия);
	
КонецФункции

&НаСервере
Функция РаботаемСРасшифровкойНаСервере(Расшифровка)
 
	РезультатСтруктура = Новый Структура;
	
	//2-ой вариант получения всех полей - более рабочий вариант, так как получает все данные
	//Внимание! Ресурс сумма может быть перезаписан в значение NULL - поэтому его значение лучше получать выше. 
	ЗаполнитьСтруктуруПолейРасшифровки(Расшифровка, РезультатСтруктура);
	
	Возврат РезультатСтруктура;
	
КонецФункции
 
Процедура ВывестиЗначениеГруппировки(п_Данные, ТекРасшифровка, РезультатСтруктура)
	
	МассивРодителей = п_Данные.Элементы[ТекРасшифровка].ПолучитьРодителей();
	
	Для Сч = 1 По МассивРодителей.Количество() Цикл
		
		ПолеРодитель = МассивРодителей[Сч-1];
		Если ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			
			//Выведем значения текущей расшифровки
			Поле = ПолеРодитель.ПолучитьПоля()[0];
			Сообщить("Поле: " + Поле.Поле + ", значение: " + Поле.Значение);
			РезультатСтруктура.Вставить(Поле.Поле, Поле.Значение);
			
			//Рекурсивный вызов процедуры.
			РасшифровкиВыше = ПолеРодитель.ПолучитьРодителей()[0].Идентификатор;
			ВывестиЗначениеГруппировки(п_Данные, РасшифровкиВыше, РезультатСтруктура);
			
		ИначеЕсли ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") тогда
			
			Попытка
				
				Поле = ПолеРодитель.ПолучитьРодителей()[0].ПолучитьПоля()[0] ;
				Сообщить("Поле: " + Поле.Поле + ", значение: " + Поле.Значение);
				РезультатСтруктура.Вставить(Поле.Поле, Поле.Значение);
				//Рекурсивный вызов процедуры.
				РасшифровкиВыше = ПолеРодитель.ПолучитьРодителей()[0].Идентификатор;
				ВывестиЗначениеГруппировки(п_Данные, РасшифровкиВыше, РезультатСтруктура);
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруПолейРасшифровки(Знач Расшифровка, СтруктураПолей, Знач Данные = "")
    
	Если Данные = "" Тогда
		
        Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
        
        Если ТипЗнч(Данные.Элементы[Расшифровка]) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			
			Поля = Данные.Элементы[Расшифровка].ПолучитьПоля();                   
            Для каждого Поле Из Поля Цикл
                СтруктураПолей.Вставить(ПреобразоватьИмяПоляГруппировки(Поле.Поле), Поле.Значение);
            КонецЦикла;
            
            Индекс = Число(Расшифровка);
			
			Попытка
				
				Пока Индекс Цикл
					
					ЭлементРасшифровки = Данные.Элементы[Индекс];
					Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
						Прервать;    
					КонецЕсли;
					
					Индекс = Индекс + 1;
					
				КонецЦикла;
				
			Исключение
				
			КонецПопытки;
			
            Индекс = Индекс - 1;
			Пока Индекс Цикл
				
                ЭлементРасшифровки = Данные.Элементы[Индекс];
                Если ТипЗнч(ЭлементРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
					
					Поля = ЭлементРасшифровки.ПолучитьПоля();                   
                    Для каждого Поле Из Поля Цикл
						
						Если Не ТипЗнч(Поле.Значение) = Тип("Число") Тогда
                            СтруктураПолей.Вставить(ПреобразоватьИмяПоляГруппировки(Поле.Поле), Поле.Значение);
						КонецЕсли;
						
                    КонецЦикла;
                    
                    Индекс = Индекс - 1;
					
				Иначе 
					
                    Прервать;
					
				КонецЕсли;
				
			КонецЦикла; 
			
        КонецЕсли;
        
        ЗаполнитьСтруктуруПолейРасшифровки(Данные.Элементы[Расшифровка], СтруктураПолей, Данные);
		
    Иначе 
        МассивРодителей = Расшифровка.ПолучитьРодителей();
		
		Для каждого ПолеРодитель из МассивРодителей Цикл
			
			Если Число(ПолеРодитель.Идентификатор) > 0 Тогда
				
                Если ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
                    МассивПолей = ПолеРодитель.ПолучитьПоля();
                ИначеЕсли ТипЗнч(ПолеРодитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхГруппировка") Тогда
                    МассивПолей = ПолеРодитель.ПолучитьРодителей()[0].ПолучитьПоля();
                КонецЕсли; 
                
                Для каждого Поле из МассивПолей Цикл
					
					Попытка
						СтруктураПолей.Вставить(ПреобразоватьИмяПоляГруппировки(Поле.Поле), Поле.Значение);
					Исключение
					КонецПопытки;
                    
					//РасшифровкиВыше = ПолеРодитель.ПолучитьРодителей();
					//Для каждого РодительВыше Из РасшифровкиВыше Цикл
					//    ЗаполнитьСтруктуруПолейРасшифровки(РодительВыше, СтруктураПолей, Данные);              
					//КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
    КонецЕсли; 
        
КонецПроцедуры

Функция ПреобразоватьИмяПоляГруппировки(п_Поле)
	
	Возврат СокрЛП(п_Поле);
	
КонецФункции

&НаСервере
Функция УстановитьНастройкиОтчета(ВидОтчета, стрПараметры, стрОтборы)
    
    
    ОтчетОбъект = Отчеты[ВидОтчета].Создать();
    
    КомпоновщикНастроек          = ОтчетОбъект.КомпоновщикНастроек;
    Настройки                               = КомпоновщикНастроек.Настройки;
    ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
    
    Для Каждого ЭлПараметр  Из стрПараметры Цикл
        
        ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ЭлПараметр.Ключ));
        ЭлементНастройки.Значение = ЭлПараметр.Значение;
        Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
            ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
            Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
                ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
                ПользовательскийПараметр.Использование = Истина;
            КонецЕсли;
        КонецЕсли;
        
    КонецЦикла;
    
    Для Каждого ЭлОтбор  Из стрОтборы Цикл
        
        текОтбор = Новый ПолеКомпоновкиДанных(ЭлОтбор.Ключ);
        Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл
            Если ЭлементНастройки.ЛевоеЗначение = текОтбор Тогда 
                ЭлементНастройки.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
                ЭлементНастройки.ПравоеЗначение = ЭлОтбор.Значение;
                ЭлементНастройки.Использование = Истина;
                Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда
                    ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки);
                    Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
                        ПользовательскийПараметр.ВидСравнения   = ЭлементНастройки.ВидСравнения;
                        ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение;
                        ПользовательскийПараметр.Использование  = ЭлементНастройки.Использование;
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        
    КонецЦикла;
    
    Возврат ПользовательскиеНастройки;
КонецФункции

&НаСервере
Функция ТТ_ДоходыИРасходы(Период,Показатель)
	
	//СтатьиДоходовИРасходов++
	спсСтатьяДоходовИРасходов = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатьиДоходовИРасходов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатьиДоходовИРасходов КАК СтатьиДоходовИРасходов
	|ГДЕ
	|	СтатьиДоходовИРасходов.ТТ_СтатьяБюджета В ИЕРАРХИИ(&ТТ_СтатьяБюджета)";
	
	Если Показатель = Справочники.ТТ_Бюджетирование.ЕСН или Показатель = Справочники.ТТ_Бюджетирование.РезервПоОтпускамОсновногоПерсонала Тогда
		Запрос.УстановитьПараметр("ТТ_СтатьяБюджета", Справочники.ТТ_Бюджетирование.ОплатаТрудаФОТ);
	Иначе
		Запрос.УстановитьПараметр("ТТ_СтатьяБюджета", Показатель);
	КонецЕсли;
	
	спсСтатьяДоходовИРасходов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//СтатьиДоходовИРасходов--
	
	//ТрейдИн++
	спсТрейдИн = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.тт_НаправлениеДеятельности = &ТрейдИн";
	Запрос.УстановитьПараметр("ТрейдИн", Справочники.тт_НаправлениеДеятельности.ТрейдИн);
	спсТрейдИн.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//ТрейдИн--
	
	тт_Отчет = Отчеты.ТТ_ДоходыИРасходы.Создать();
	тт_Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = тт_Отчет.Метаданные();
	ВариантОтчета     = тт_Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ттДвиженияДоходовИРасходов;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Период);
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Период));
	КонецЕсли;
	
	тт_ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Отбор.Элементы.Очистить();
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатьяДоходовИРасходов");
	ТекОтбор.ПравоеЗначение = спсСтатьяДоходовИРасходов;
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РеализацияЗЧмагазин Тогда
		
		ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.Использование  = Истина;
		ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
		ТекОтбор.ПравоеЗначение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000132");//Магазин ФКДД
		ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если Показатель.Затраты Тогда
		Показатель1 = "РасходУпрПриходБезНДС";
	ИначеЕсли НЕ Показатель.Затраты Тогда
		Показатель1 = "ДоходУпрПриходБезНДС";
	КонецЕсли;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.ЕСН Тогда
		Показатель1 = "[5_2]";
	КонецЕсли;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РезервПоОтпускамОсновногоПерсонала Тогда
		Показатель1 = "[5_3]";
	КонецЕсли;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				//ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "");
				ТекВложенныйПоказатель.Использование = Строка(ТекВложенныйПоказатель.Поле)=Показатель1;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ПозицияТочки = Найти(ТекПоказатель.Поле, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоказателя = Сред(ТекПоказатель.Поле, ПозицияТочки+1);
			Иначе
				ИмяПоказателя = СокрЛП(ТекПоказатель.Поле);
			КонецЕсли;
			ТекПоказатель.Использование = ИмяПоказателя=Показатель1;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаКонтрагент = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "ПодразделениеКомпании");
	ГруппировкаДоговор    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаКонтрагент.Структура, "ПериодРегистратор");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция ТТ_АнализПродаж(Период,Показатель)
	
	тт_Отчет = Отчеты.ТТ_АнализПродаж.Создать();
	тт_Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = тт_Отчет.Метаданные();
	ВариантОтчета     = тт_Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Основной;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Период);
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Период));
	КонецЕсли;
	
	тт_ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Отбор.Элементы.Очистить();
		
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
	ТекОтбор.ПравоеЗначение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000132");//Магазин ФКДД
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РеализацияЗЧмагазин Тогда
		Показатель1 = "СуммаБезНДС";
	ИначеЕсли  Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьЗЧ Тогда
		Показатель1 = "СебестоимостьБезНДС";
	ИначеЕсли  Показатель = Справочники.ТТ_Бюджетирование.МагазинЗЧ Тогда
		Показатель1 = "СуммаБезНДС";
		Показатель2 = "СебестоимостьБезНДС";
		Показатель3 = "СуммаНаценкиБезНДС";
	КонецЕсли;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "");
				ТекВложенныйПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ПозицияТочки = Найти(ТекПоказатель.Поле, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоказателя = Сред(ТекПоказатель.Поле, ПозицияТочки+1);
			Иначе
				ИмяПоказателя = СокрЛП(ТекПоказатель.Поле);
			КонецЕсли;
			ТекПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаКонтрагент = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "ПодразделениеКомпании");
	ГруппировкаДоговор    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаКонтрагент.Структура, "ПериодРегистратор");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ТТ_СводнаяВедомость(Период,Показатель)
	
	тт_Отчет = Отчеты.ТТ_СводнаяВедомость.Создать();
	тт_Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = тт_Отчет.Метаданные();
	ВариантОтчета     = тт_Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Основной;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Период);
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Период));
	КонецЕсли;
	
	тт_ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Отбор.Элементы.Очистить();
	
	Показатель1 = "п_1_3";
	Показатель2 = "п_2_3";
	Показатель3 = "п_3_3";
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "");
				ТекВложенныйПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ПозицияТочки = Найти(ТекПоказатель.Поле, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоказателя = Сред(ТекПоказатель.Поле, ПозицияТочки+1);
			Иначе
				ИмяПоказателя = СокрЛП(ТекПоказатель.Поле);
			КонецЕсли;
			ТекПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаОрганизация = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Организация");
	ГруппировкаДокументРегистратор    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаОрганизация.Структура, "ДокументРегистратор");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция АнализПродажАвтомобилей(Период,Показатель)
	
	//ТрейдИн++
	спсТрейдИн = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.тт_НаправлениеДеятельности = &ТрейдИн";
	Запрос.УстановитьПараметр("ТрейдИн", Справочники.тт_НаправлениеДеятельности.ТрейдИн);
	спсТрейдИн.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//ТрейдИн--
	
	тт_Отчет = Отчеты.ТТ_АнализПродажАвтомобилей.Создать();
	тт_Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = тт_Отчет.Метаданные();
	ВариантОтчета     = тт_Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ПродажаАвтомобилей;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Период);
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Период));
	КонецЕсли;
	
	тт_ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РеализацияНовыхАвтомобилей 
		или Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейдинавтомобилей  Тогда
		
		Показатель1 = "СуммаБезНДС";
		
	ИначеЕсли  Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьНовыхАвтомобилей 
		или Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьТрейдинАвтомобилей  Тогда
		
		Показатель1 = "СебестоимостьБезНДС";
		
	ИначеЕсли  Показатель = Справочники.ТТ_Бюджетирование.РеализацияНовыхАвтомобилейВаловыйДоход 
		или Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейндинАвтомобилейВаловыйДоход  Тогда
		
		Показатель1 = "СуммаБезНДС";
		Показатель2 = "СебестоимостьБезНДС";
		Показатель3 = "СуммаНаценкиБезНДС";
		
	КонецЕсли;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "");
				ТекВложенныйПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ПозицияТочки = Найти(ТекПоказатель.Поле, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоказателя = Сред(ТекПоказатель.Поле, ПозицияТочки+1);
			Иначе
				ИмяПоказателя = СокрЛП(ТекПоказатель.Поле);
			КонецЕсли;
			ТекПоказатель.Использование = ИмяПоказателя=Показатель1 или ИмяПоказателя=Показатель2 или ИмяПоказателя=Показатель3;
		КонецЕсли;
	КонецЦикла;
	
	Отбор.Элементы.Очистить();
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РеализацияНовыхАвтомобилей или 
		Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьНовыхАвтомобилей или 
		Показатель = Справочники.ТТ_Бюджетирование. РеализацияНовыхАвтомобилейВаловыйДоход  Тогда
		
		ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.Использование  = Истина;
		ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
		ТекОтбор.ПравоеЗначение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000191");//Автосалон VOLVO
		ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	Если Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейдинавтомобилей или 
		Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьТрейдинАвтомобилей или 
		Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейндинАвтомобилейВаловыйДоход Тогда
		
		ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ТекОтбор.Использование  = Истина;
		ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодразделениеКомпании");
		ТекОтбор.ПравоеЗначение = спсТрейдИн;
		ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		
	КонецЕсли;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаКонтрагент = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "ПодразделениеКомпании");
	ГруппировкаДокументПродажи    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаКонтрагент.Структура, "ДокументПродажи");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Перем ВыполненноеДействие;
	Перем ПараметрВыполненногоДействия;
	
	СтандартнаяОбработка = Ложь;
	
	//bizteh--
	Если ИмяФормыОтчета = "Отчет.ТТ_ПланФакт.Форма" Тогда
		
		СтруктураЗначений = РаботаемСРасшифровкойНаСервере(Расшифровка);
		
		Попытка
			
			Если СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.РеализацияНовыхАвтомобилей или 
				СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейдинавтомобилей или 
				
				СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьНовыхАвтомобилей или 
				СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьТрейдинАвтомобилей или 
				
				СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование. РеализацияНовыхАвтомобилейВаловыйДоход или
				СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.РеализацияТрейндинАвтомобилейВаловыйДоход 
				
				Тогда
				
				СтруктураПараметров = АнализПродажАвтомобилей(СтруктураЗначений.Период,СтруктураЗначений.Показатель);
				ОткрытьФорму("Отчет.ТТ_АнализПродажАвтомобилей.Форма", СтруктураПараметров);
				
			ИначеЕсли СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьЗЧ 
				или СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.МагазинЗЧ 	
				или СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.РеализацияЗЧмагазин Тогда
				
				СтруктураПараметров = ТТ_АнализПродаж(СтруктураЗначений.Период,СтруктураЗначений.Показатель);
				ОткрытьФорму("Отчет.ТТ_АнализПродаж.Форма", СтруктураПараметров);
				
			ИначеЕсли СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.ПокупнаяСтоимостьРУ 
				или СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.УслугиРУ 	
				или СтруктураЗначений.Показатель = Справочники.ТТ_Бюджетирование.УслугиРемонтногоУчастка Тогда
				
				СтруктураПараметров = ТТ_СводнаяВедомость(СтруктураЗначений.Период,СтруктураЗначений.Показатель);
				ОткрытьФорму("Отчет.ТТ_СводнаяВедомость.Форма", СтруктураПараметров);
				
			Иначе
				
				СтруктураПараметров = ТТ_ДоходыИРасходы(СтруктураЗначений.Период,СтруктураЗначений.Показатель);
				ОткрытьФорму("Отчет.ТТ_ДоходыИРасходы.Форма", СтруктураПараметров);
				
			КонецЕсли;
			
		Исключение
			Сообщить("По данной категории, расшифровка временно отсутствует.");
		КонецПопытки;
		
		Возврат;
		
	КонецЕсли;
	//bizteh++
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	
	Попытка
		Если ДоступныеДействияРасшифровки = Неопределено Тогда
			ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрВыполненногоДействия);
		Иначе
			ОбработкаРасшифровки.ВыбратьДействие(Расшифровка, ВыполненноеДействие, ПараметрВыполненногоДействия, ДоступныеДействияРасшифровки.ВыгрузитьЗначения());
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		ОткрытьЗначение(ПараметрВыполненногоДействия);
	ИначеЕсли Не ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
		НовыеНастройки = ПолучитьНастройкиРасшифровки(Расшифровка, ПараметрВыполненногоДействия);
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("КлючВарианта",            ЭтаФорма.КлючТекущегоВарианта);
		СтруктураПараметров.Вставить("ПредставлениеВарианта",   ЭтаФорма.ПредставлениеТекущегоВарианта);
		СтруктураПараметров.Вставить("Вариант",                 НовыеНастройки);
		СтруктураПараметров.Вставить("СхемаКомпоновки",         СхемаКомпоновки);
		СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
		СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
		СтруктураПараметров.Вставить("НачалоПериода",           НачалоПериода);
		СтруктураПараметров.Вставить("КонецПериода",            КонецДня(КонецПериода));
		СтруктураПараметров.Вставить("ВидПериода",              ВидПериода);
		СтруктураПараметров.Вставить("Расшифровка",             Истина);
		
		ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров, ЭтаФорма, Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	УправлениеДиалогом(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	УправлениеДиалогом(Истина);
	
КонецПроцедуры


&НаСервере
Процедура ВидимостьПериода()
	
	ОтчетыСервер.ВидимостьПериода(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПроизвольный(Команда)
	
	ВидПериода = "Произвольный";
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДень(Команда)
	
	ВидПериода = "День";
	
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНеделя(Команда)
	
	ВидПериода = "Неделя";
	
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодМесяц(Команда)
	
	ВидПериода = "Месяц";
	
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодКвартал(Команда)
	
	ВидПериода = "Квартал";
	
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодГод(Команда)
	
	ВидПериода = "Год";
	
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
	ОтчетыКлиентСервер.УстановитьПометкуНаПериод(ЭтаФорма, Команда.Имя);
	
	ВидимостьПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНазад(Команда)
	
	Направление = -1;
	ОтчетыКлиентСервер.СместитьПериод(ЭтаФорма, Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодВперед(Команда)
	
	Направление = +1;
	ОтчетыКлиентСервер.СместитьПериод(ЭтаФорма, Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПериодаПриИзменении(Элемент)
	
	КонецПериода = ВариантПериода;
	ОтчетыКлиентСервер.ОбновитьВариантыПериодов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Период = Новый СтандартныйПериод;
	Если ЕстьНачалоПериода Тогда
		Период.ДатаНачала = НачалоПериода;
	КонецЕсли;
	Период.ДатаОкончания = КонецПериода;
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактирования.Период = Период;
	Если ДиалогРедактирования.Редактировать() Тогда
		Если ЕстьНачалоПериода Тогда
			НачалоПериода = ДиалогРедактирования.Период.ДатаНачала;
		КонецЕсли;
		КонецПериода = ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ СЕРВЕР

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Заголовок  = ОтчетОбъект.Метаданные().Синоним;
	КлючОтчета = ОтчетОбъект.Метаданные().ПолноеИмя();
	
	Если ИмяФормы = "ОбщаяФорма.Отчет_Тонкий_Клиент" Тогда
		ИмяФормыОтчета = КлючОтчета + ".Форма";
	Иначе
		ИмяФормыОтчета = ИмяФормы;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("КлючВарианта") ИЛИ Параметры.КлючВарианта = Неопределено Тогда
		
		КлючВарианта = ХранилищеНастроекДанныхФорм.Загрузить("ФормаОтчета" + КлючОтчета, "КлючВарианта");
		Если НЕ КлючВарианта = Неопределено Тогда
			КлючТекущегоВарианта = КлючВарианта;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Параметры.Свойство("СформироватьПриОткрытии") И Параметры.СформироватьПриОткрытии = Истина Тогда
		ВывестиПриОткрытии = Параметры.СформироватьПриОткрытии;
		Параметры.СформироватьПриОткрытии = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("СхемаКомпоновки") Тогда
		ВремСхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(Параметры.СхемаКомпоновки);
		
		Попытка
			ОтчетыСервер.ЗаполнитьНачальныеОстатки(ОтчетОбъект, ВремСхемаКомпоновкиДанных.НаборыДанных);
		Исключение
		КонецПопытки;
		
	Иначе
		
		Попытка
			ОтчетОбъект.ЗаполнитьНачальныеНастройки();
		Исключение
			ОтчетыСервер.ЗаполнитьНачальныеОстатки(ОтчетОбъект);
		КонецПопытки;
		
		ВремСхемаКомпоновкиДанных = ОтчетОбъект.СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
	СхемаКомпоновки = ПоместитьВоВременноеХранилище(ВремСхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	ИнициализироватьСКД();
	
	ЗагрузитьНастройкиФормы();
	
	Попытка
		МассивДействий = ОтчетОбъект.ПолучитьДоступныеДействияРасшифровки();
		ДоступныеДействияРасшифровки = Новый СписокЗначений;
		ДоступныеДействияРасшифровки.ЗагрузитьЗначения(МассивДействий);
	Исключение
		ДоступныеДействияРасшифровки = Неопределено;
	КонецПопытки;
	
	Попытка
		СтруктураОграничений = ОтчетОбъект.ПолучениеОграниченийНастроек();
		
		Если ТипЗнч(СтруктураОграничений) = Тип("Структура") Тогда
			
			//Элементы.ГруппаРежимВыводаОтчета.Видимость = (НЕ СтруктураОграничений.Свойство("РежимВыводаОтчета"));
			//Элементы.ГруппаСтруктураОтчета.Видимость   = (НЕ СтруктураОграничений.Свойство("Группировки"));
			//Элементы.ГруппаДопПоля.Видимость           = (НЕ СтруктураОграничений.Свойство("Показатели"));
			Элементы.ГруппаПорядок.Видимость           = (НЕ СтруктураОграничений.Свойство("Порядок"));
			Элементы.ГруппаОтбор.Видимость             = (НЕ СтруктураОграничений.Свойство("Отборы"));
			Элементы.ГруппаПараметры.Видимость         = (НЕ СтруктураОграничений.Свойство("Параметры"));
			
			//Если СтруктураОграничений.Свойство("Колонки") Тогда
			//	Элементы.ГруппаСтруктураКолонки.Видимость = Ложь;
			//	ОтключеныКолонки                          = Истина;
			//КонецЕсли;
			
			//Если (НЕ Элементы.ДопПоля.Видимость) И 
			//	(НЕ Элементы.Порядок.Видимость) И (НЕ Элементы.Отбор.Видимость) Тогда
			//	Элементы.НастройкиОтчета.Видимость = Ложь;
			//КонецЕсли;
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	// Посмотрим был ли ранее составлен список принтеров, которые установлены в системе, если нет,
	// тогда попытаемся получить его
	
	// Попробуем получить список принтеров, если ранее он был сформирован
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		Если ТипЗнч(глСписокПринтеров) = Тип("СписокЗначений") Тогда
			Принтеры = глСписокПринтеров.Скопировать();
		КонецЕсли;
	#КонецЕсли
	
	Если Принтеры.Количество() = 0 Тогда
		//Состояние("Составляется список принтеров. Подождите.");
		Принтеры.Вставить(0, "ДиалогВыбораПринтера","Диалог выбора принтера");
		ДобавитьПринтер(0, "Диалог выбора принтера");
		
		Попытка
			Locator = Новый COMОбъект("WbemScripting.SWbemLocator");
			Сервисы = Locator.ConnectServer(".");
			Объекты = Сервисы.InstancesOf("Win32_Printer");
			// Теперь переберем все принтеры системы
			Счетчик = 1;
			Для Каждого Принтер Из Объекты Цикл
				
				ИмяВремПринтера = Принтер.Name;
				Пока Найти(ИмяВремПринтера, "\") > 0 Цикл
					ИмяВремПринтера = Сред(ИмяВремПринтера, Найти(ИмяВремПринтера,"\")+1);
				КонецЦикла;
				ИмяВремПринтера = СокрЛП(ИмяВремПринтера);
				Принтеры.Добавить(Принтер.Name, ИмяВремПринтера);
				
				ПометкаПринтера = Ложь;
				Если Принтер.Properties_("Default").Value Тогда
					ИмяПринтера                               = Принтер.Name;
					ПометкаПринтера                           = Истина;
					Принтеры[Принтеры.Количество()-1].Пометка = Истина;
				КонецЕсли;
				
				ДобавитьПринтер(Счетчик, ИмяВремПринтера, ПометкаПринтера);
				
				Счетчик = Счетчик + 1;
			КонецЦикла;
		Исключение
		КонецПопытки;
		глСписокПринтеров = Принтеры.Скопировать();
	Иначе
		Счетчик = 0;
		Для Каждого Принтер Из Принтеры Цикл
			ДобавитьПринтер(Счетчик, Принтер.Представление, Принтер.Пометка);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
	
	// "Вспомним" о том, на каком принтере в последний раз печатали
	ИмяТекПринтера = ТабличныйДокумент.ИмяПринтера;
	Если ЗначениеЗаполнено(ИмяТекПринтера) Тогда
		ТекПринтер = Принтеры.НайтиПоЗначению(ИмяТекПринтера);
		Если ТекПринтер = Неопределено Тогда
			ИмяТекПринтера = "";
		Иначе
			Индекс = Принтеры.Индекс(ТекПринтер);
			
			Для Каждого Принтер Из Элементы.ГруппаСписокПринтеров.ПодчиненныеЭлементы Цикл
				Принтер.Пометка = Ложь;
			КонецЦикла;
			
			Элементы.ГруппаСписокПринтеров.ПодчиненныеЭлементы[Индекс].Пометка = Истина;
			ПредставлениеТекПринтера = ТекПринтер.Представление;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяТекПринтера) Тогда
		Для Каждого ТекПринтер Из Принтеры Цикл
			Если ТекПринтер.Пометка Тогда
				ИмяТекПринтера           = ТекПринтер.Значение;
				ПредставлениеТекПринтера = ТекПринтер.Представление;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(ИмяТекПринтера) Тогда
			ТекПринтер = Принтеры[0];
			ИмяТекПринтера           = ТекПринтер.Значение;
			ПредставлениеТекПринтера = ТекПринтер.Представление;
			Элементы.ГруппаСписокПринтеров.ПодчиненныеЭлементы[0].Пометка = Истина;
		КонецЕсли;
	КонецЕсли;
	ИмяПринтера = ?(ИмяТекПринтера = "ДиалогВыбораПринтера","", ИмяТекПринтера);
	Элементы.ГруппаСписокПринтеров.Заголовок = ?(ПустаяСтрока(ИмяТекПринтера), "Список принтеров","Принтер: <"+ПредставлениеТекПринтера+">");
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСКД()
	
	Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ КЛИЕНТ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//<<Павличенко 16.09.2020
	Если Найти(ПолучитьНаименованиеОтчета(),"Отчет - Выработка исполнителей")>0 тогда
		ПравоВыводаОтчета = обПраво("ВыводОтчетаВыработкаИсполнителей");
		Если НЕ ПравоВыводаОтчета тогда
			Отказ = Истина;
			сообщить("Отсутствует право вывода отчета " + ПолучитьНаименованиеОтчета());
			возврат;
		КонецЕсли;	
	КонецЕсли;
	//>>Павличенко 16.09.2020
	
	Если СокрЛП(ЭтаФорма.КлючУникальности) = "" Тогда
		КлючУникальности = УникальныйИдентификатор;
	КонецЕсли;
	
	Если ВывестиПриОткрытии Тогда
		СформироватьОтчет();
		УправлениеДиалогом();
	Иначе
		Элементы.ТабличныйДокумент.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		УправлениеДиалогом(Истина, "Сформируйте отчет");
	КонецЕсли;
	
	ОграниченияИспользованияПолей = Элементы.КомпоновщикНастроекНастройкиПараметрыДанных.ОграниченияИспользования;
	
	НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
	НовоеОграничение.Параметр    = Новый ПараметрКомпоновкиДанных("ДатаНачала");
	НовоеОграничение.Доступность = Ложь;
	
	НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
	НовоеОграничение.Параметр    = Новый ПараметрКомпоновкиДанных("ДатаОкончания");
	НовоеОграничение.Доступность = Ложь;
	
	НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
	НовоеОграничение.Параметр    = Новый ПараметрКомпоновкиДанных("ДатаОкончанияГраница");
	НовоеОграничение.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ОбновитьСписокВариантовОтчета();
	
	//Если Параметры.Свойство("ВариантЗагрузкиПериода") Тогда
	//	ВариантЗагрузкиПериода = Параметры.ВариантЗагрузкиПериода;
	//Иначе
	//	ВариантЗагрузкиПериода = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантПериода(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючТекущегоВарианта);
	//КонецЕсли;
	
	//ЗаполнитьСтруктуруОтчета();
	//ОпределитьРежимВыводаОтчета();
	
	Расшифровка = Неопределено;
	Параметры.Свойство("Расшифровка", Расшифровка);
	
	Если Расшифровка = Истина Тогда
		Параметры.Свойство("НачалоПериода", НачалоПериода);
		Параметры.Свойство("КонецПериода",  КонецПериода);
		Параметры.Свойство("ВидПериода",    ВидПериода);
		ОбновитьНастройкиОтчета(Ложь);
	Иначе
		ОбновитьНастройкиОтчета();
	КонецЕсли;
	
	//УдалитьЭлементыГруппы(Элементы.ГруппаОформлениеТаблицы.ПодчиненныеЭлементы);
	//УдалитьЭлементыГруппы(Элементы.ГруппаОформлениеДиаграммы.ПодчиненныеЭлементы);
	//УдалитьЭлементыГруппы(Элементы.ГруппаПараметры.ПодчиненныеЭлементы);
	
	//ОбновитьДанныеФормы(Истина);
	
	//Если ОбновитьВсе Тогда
	
	// Отрисовка оформления таблицы
	//ПараметрОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	//Если НЕ ПараметрОформления = Неопределено Тогда
	//	
	//	ЗначениеОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(ПараметрОформления.Параметр);
	//	ТекущееОформление  = БиблиотекаМакетовОформленияКомпоновкиДанных[ЗначениеОформления.Значение];
	//	
	//	Для Каждого ТекМакет Из БиблиотекаМакетовОформленияКомпоновкиДанных Цикл
	//		НоваяКоманда = Команды.Найти("КомандаОформление"+ТекМакет.Имя);
	//		Если НоваяКоманда = Неопределено Тогда
	//			НоваяКоманда = Команды.Добавить("КомандаОформление"+ТекМакет.Имя);
	//			НоваяКоманда.Действие = "КомандаОформление";
	//		КонецЕсли;
	//		
	//		НовоеОформление = Элементы.Добавить("Оформление"+ТекМакет.Имя, Тип("КнопкаФормы"), Элементы.ГруппаОформлениеТаблицы);
	//		НовоеОформление.ИмяКоманды = НоваяКоманда.Имя;
	//		НовоеОформление.Заголовок  = ТекМакет.Представление;
	//		НовоеОформление.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	//		
	//		Если ТекущееОформление = ТекМакет Тогда
	//			НовоеОформление.Пометка = Истина;
	//			Элементы.ГруппаОформлениеТаблицы.Заголовок = "Оформление: <" + ТекМакет.Представление + ">";
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
	// Отрисовка оформления диаграммы
	//ГруппаОформления = Элементы.ГруппаОформлениеДиаграммы;
	//ПараметрОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.ДоступныеПараметры.НайтиПараметр(Новый ПараметрКомпоновкиДанных("ТипДиаграммы"));
	//Если НЕ ПараметрОформления = Неопределено Тогда
	//	ЗначениеОформления = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(ПараметрОформления.Параметр);
	//	
	//	Для Каждого ТекТипДиаграммы Из ТипДиаграммы Цикл
	//		ИмяТипаДиаграммы = СтрЗаменить(ПолучитьПолноеИмяПредопределенногоЗначения(ТекТипДиаграммы), "ТипДиаграммы.", "");
	//		
	//		НоваяКоманда = Команды.Найти("КомандаТипДиаграммы"+ИмяТипаДиаграммы);
	//		Если НоваяКоманда = Неопределено Тогда
	//			НоваяКоманда = Команды.Добавить("КомандаТипДиаграммы"+ИмяТипаДиаграммы);
	//			НоваяКоманда.Действие = "КомандаТипДиаграммы";
	//		КонецЕсли;
	//		
	//		НовоеОформление = Элементы.Добавить("Оформление"+ИмяТипаДиаграммы, Тип("КнопкаФормы"), ГруппаОформления);
	//		НовоеОформление.ИмяКоманды = НоваяКоманда.Имя;
	//		НовоеОформление.Заголовок  = СокрЛП(ТекТипДиаграммы);
	//		НовоеОформление.Вид        = ВидКнопкиФормы.КнопкаКоманднойПанели;
	//		НовоеОформление.Пометка    = Ложь;
	//		Попытка
	//			НовоеОформление.Картинка    = БиблиотекаКартинок[ИмяТипаДиаграммы];
	//			НовоеОформление.Отображение = ОтображениеКнопки.КартинкаИТекст;
	//		Исключение
	//		КонецПопытки;
	//		
	//		Если ЗначениеОформления.Значение = ТекТипДиаграммы Тогда
	//			НовоеОформление.Пометка = Истина;
	//			ГруппаОформления.Заголовок = "Тип диаграммы: <" + СокрЛП(ТекТипДиаграммы) + ">";
	//			ГруппаОформления.Картинка    = НовоеОформление.Картинка;
	//			ГруппаОформления.Отображение = НовоеОформление.Отображение;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ОтображатьПанель", Элементы.ФормаКнопкаПанель.Пометка);
	
	СтруктураПараметровПечати = Новый Структура;
	СтруктураПараметровПечати.Вставить("ИмяТекущегоПринтера", ?(ТабличныйДокумент.ИмяПринтера = "", "ДиалогВыбораПринтера", ТабличныйДокумент.ИмяПринтера));
	
	СохранитьНастройкиФормы(СтруктураНастроек, СтруктураПараметровПечати, КлючОтчета, КлючТекущегоВарианта);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Для Каждого ТекПараметр Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		ИмяПараметра = "Параметр" + СокрЛП(ТекПараметр.Параметр);
		ЭлементПараметра = Элементы.Найти(ИмяПараметра);
		Если ЭлементПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЭтаФорма[ИмяПараметра] = ТекПараметр.Значение;
	КонецЦикла;
	
	ИмяВарианта = "";
	ВариантНастроек = ТаблицаВариантов.НайтиСтроки(Новый Структура("Идентификатор", ЭтаФорма.КлючТекущегоВарианта));
	Если ВариантНастроек.Количество()>0 Тогда
		ИмяВарианта = ВариантНастроек[0].Имя;
	КонецЕсли;
	
	Для Каждого ТекВариант Из Элементы.ГруппаВариантыНастроек.ПодчиненныеЭлементы Цикл
		ТекВариант.Пометка = ТекВариант.Имя = ИмяВарианта;
	КонецЦикла;
	
	Если ИмяВарианта = "" ИЛИ Элементы[ИмяВарианта].Заголовок = "" Тогда
		Элементы.ГруппаВариантыНастроек.Заголовок = "Вариант настроек";
	Иначе
		Элементы.ГруппаВариантыНастроек.Заголовок = "Вариант настроек: <" + Элементы[ИмяВарианта].Заголовок + ">";
	КонецЕсли;
	
	//ЗаполнитьСтруктуруОтчета();
	//ОпределитьРежимВыводаОтчета();
	ОбновитьНастройкиОтчета(Ложь);
	//ОбновитьДанныеФормы();
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСправка(Команда)
	
	//ОткрытьСправку(Отчет.
	//СтрЗаменить(ЭтаФорма.ИмяФормыОтчета, ".Форма", "")
	ОткрытьСправку(СтрЗаменить(ЭтаФорма.ИмяФормыОтчета, ".Форма", ""));
	//ава = 3;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьРежимВыводаОтчета(Команда)
	
	Счетчик = 1;
	ПревВид = РежимВыводаОтчета;
	Для Каждого ТекВид Из Элементы.ГруппаРежимВыводаОтчета.ПодчиненныеЭлементы Цикл
		Если ТекВид.ИмяКоманды = Команда.Имя Тогда
			ТекВид.Пометка = Истина;
			РежимВыводаОтчета = Счетчик;
			Элементы.ГруппаРежимВыводаОтчета.Заголовок = ТекВид.Заголовок;
			Элементы.ГруппаРежимВыводаОтчета.Картинка  = ТекВид.Картинка;
		Иначе
			ТекВид.Пометка = Ложь;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если НЕ ПревВид = РежимВыводаОтчета Тогда
		ОбновитьОписаниеГруппировок();
		УправлениеДиалогом(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ИмяФормыОтчета Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВариантыОтчетов.ИзменениеВарианта" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("КлючОтчета") И Параметр.КлючОтчета = КлючОтчета Тогда
			ОбновитьСписокВариантовОтчета();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Модифицированность   = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Событие = "ПорядокОтчета" Тогда
		
		Если НЕ РезультатЗакрытия.Папка Тогда
			ТекущиеДанные = Отчет.КомпоновщикНастроек.Настройки.Порядок.ПолучитьОбъектПоИдентификатору(ДополнительныеПараметры.ТекущаяСтрока);
			ТекущиеДанные.Поле          = РезультатЗакрытия.Поле;
			ТекущиеДанные.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиПорядокПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.КомпоновщикНастроекНастройкиПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	ПараметрыВыбора.Вставить("Событие",         "Ресурсы");
	ПараметрыВыбора.Вставить("ТекущееПоле",     ТекущиеДанные.Поле);
	ПараметрыВыбора.Вставить("НастройкиОтчета", Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", Элементы.КомпоновщикНастроекНастройкиПорядок.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("Событие",       "ПорядокОтчета");
	
	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаОповещения", ЭтаФорма, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", ПараметрыВыбора, ЭтаФорма,,,,ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки",0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборЛевоеЗначениеПриИзменении(Элемент)
	
	ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияКомпоновщикНастроекНастройкиОтборПриАктивизацииСтроки()
	
	ТекущиеДанные = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЛевоеЗначение = Неопределено ИЛИ СокрЛП(ТекущиеДанные.ЛевоеЗначение) = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторОтбора = Строка(Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОтбора = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	
	ДоступноеПолеОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
	
	Если ДоступноеПолеОтбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДоступноеПолеОтбора.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойств")) Тогда
		
		ЗначениеВладельца = ОтчетыСервер.ПолучитьВладельцаЗначенияСвойств(ТекущиеДанные.ЛевоеЗначение);
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ЗначениеВладельца);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		Элементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	Иначе
		
		ТипЗначенияОтбора = ДоступноеПолеОтбора.ТипЗначения.Типы()[0];
		СписокВладельцев  = ОтчетыСервер.ПолучитьСписокВладельцев(Отчет.КомпоновщикНастроек.ПолучитьНастройки(), ТипЗначенияОтбора);
		
		Если СписокВладельцев.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", СписокВладельцев[0].Значение);
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		Элементы.КомпоновщикНастроекНастройкиОтборПравоеЗначение.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиОтборПравоеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиОтбор.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
	
	Если ОтчетыСервер.ОтборПоСписку(ТекущиеДанные.ВидСравнения) И Элемент.ПараметрыВыбора.Количество()>0 Тогда
		
		ЗначениеВладельца = Неопределено;
		Для Каждого ЭлементМассива Из Элемент.ПараметрыВыбора Цикл
			Если ЭлементМассива.Имя = "Отбор.Владелец" Тогда
				ЗначениеВладельца = ЭлементМассива.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеВладельца = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		Если ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии ИЛИ
			ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			ТолькоГруппы = Истина;
		Иначе
			ТолькоГруппы = Ложь;
		КонецЕсли;
		
		ДоступноеПолеОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекущиеДанные.ЛевоеЗначение);
		
		СтруктураПараметров = Новый Структура("СписокВыбора, ТипЗначения, ДоступныеЗначения, ТолькоГруппы, ПараметрОтборПоВладельцу", ТекущиеДанные.ПравоеЗначение, ДоступноеПолеОтбора.ТипЗначения, ДоступноеПолеОтбора.ДоступныеЗначения, ТолькоГруппы, ЗначениеВладельца);
		
		ФормаВыбора = ПолучитьФорму("ОбщаяФорма.ОтчетВыборЗначенияОтбораИзСписка", СтруктураПараметров, Элемент);
		Рез = ФормаВыбора.ОткрытьМодально();
		
		Если НЕ Рез = Неопределено Тогда
			ТекущиеДанные.ПравоеЗначение = Рез;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ЭтаФорма.ВариантМодифицирован = Ложь;

//Помощь: Расширение управляемой формы для отчета
