Функция ПолучитьСоответсвиеРолейИТочекМаршрута() Экспорт
	
	СоответствиеРолей = новый Соответствие;
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия, 			БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеБухгалтерия);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ,	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорДЦ);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК, 	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорУК);
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Казначей, 				БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеКазначей);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО, 		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеРуководительЦФО);
	СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО, 			БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеСотрудникЦФО);
	//СоответствиеРолей.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор, 		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеФинансовыйДиректор);
	
	Возврат СоответствиеРолей;
			
КонецФункции

Функция ПолучитьСтатусПоРоли(Роль) Экспорт
	
	СтатусПоРоли = Новый Соответствие;
	
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия, 				Перечисления.БТ_СтатусыЗаявок.УтвержденаКонтролером);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаДЦ);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУК);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.Казначей, 				Перечисления.БТ_СтатусыЗаявок.УтвержденаКазначеня);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО, 			Перечисления.БТ_СтатусыЗаявок.УтвержденаЦФО);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО, 			Перечисления.БТ_СтатусыЗаявок.УтвержденаСотрудникЦФО);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор, 		Перечисления.БТ_СтатусыЗаявок.УтвержденаФД);
	СтатусПоРоли.Вставить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД, 	Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУИД); //ЧалапАЮ БизТех 13.11.2023

	Возврат СтатусПоРоли[Роль];
	
КонецФункции

Процедура ОбновитьСведенияПоТекущейЗаявке(Заявка, ТабДокОписаниеЗаявки, ТабДокИсторияСогласования, КартаМаршрутаЗаявки,  АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки) Экспорт
	Если Заявка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТабДокОписаниеЗаявки<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Заявка, ТабДокОписаниеЗаявки, АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки);
	КонецЕсли;
	
	Если ТабДокИсторияСогласования<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_ТабДокИсторияСогласования(Заявка, ТабДокИсторияСогласования);
	КонецЕсли;
	//
	Если КартаМаршрутаЗаявки<>Неопределено Тогда
		ОбновитьСведенияПоТекущейЗаявке_КартаМаршрутаЗаявки(Заявка, КартаМаршрутаЗаявки);
	КонецЕсли;
КонецПроцедуры

Процедура  ДобавитьЗначениеВТЧ(ТЧ, Выборка, ИмяРеквизита)
	
	НовСтр = ТЧ.Добавить();
	НовСтр.НомерСтрокиТЧ 	= Выборка.НомерСтроки; 	
	НовСтр.ЗначениеТЧТекст 	= Строка(Выборка[ИмяРеквизита]);
	НовСтр.СвойствоТЧ 		= ИмяРеквизита;
	НовСтр.ЗначениеТЧ 		= Выборка[ИмяРеквизита];
	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Заявка, ТабДокОписаниеЗаявки, АдресРасшифровки, АдресДанныхРасшифровкиОписаниеЗаявки, ТЗ = Неопределено) Экспорт
	СКД = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПолучитьМакет("ПросмотрЗаявки");
	СКД.Параметры.Заявка.Значение = Заявка;   
	
	Настройки	= СКД.ВариантыНастроек["ПросмотрЗаявки"].Настройки;
	ЗаявкаПараметр = Настройки.ПараметрыДанных.Элементы.Найти("Заявка");
	ЗаявкаПараметр.Значение			= Заявка;
	ЗаявкаПараметр.Использование	= Истина;
	
	ВнешниеНаборыДанных = Новый Структура;

	ТаблицаРеквизитовТЧПомещаемаяВСКД = Новый ТаблицаЗначений;
	КС = Новый КвалификаторыСтроки(0);
	Массив = Новый Массив;                           
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ОписаниеТиповБ = Новый ОписаниеТипов("Булево");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ЗначениеТЧТекст"		, ОписаниеТиповС, "ЗначениеТЧТекст");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("СвойствоТЧ"				, ОписаниеТиповС, "СвойствоРеквизита");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ЗначениеТЧ"				,				, "Значение реквизита");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("НомерСтрокиТЧ"			, ОписаниеТиповС, "НомерСтрокиТЧ");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("Выделить"				, ОписаниеТиповБ, "Выделить");
	ТаблицаРеквизитовТЧПомещаемаяВСКД.Колонки.Добавить("ВыделитьКраснымТЧ"		, ОписаниеТиповБ, "Выделить красным");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходДСПлатежи.Ссылка КАК Ссылка,
		|	ЗаявкаНаРасходДСПлатежи.НомерСтроки КАК НомерСтроки,
		|	ЗаявкаНаРасходДСПлатежи.ДатаПлатежа КАК ДатаПлатежа,
		|	ЗаявкаНаРасходДСПлатежи.СтатьяРасходов КАК СтатьяРасходов,
		|	ЗаявкаНаРасходДСПлатежи.Описание КАК Описание,
		|	ЗаявкаНаРасходДСПлатежи.Сумма КАК Сумма,
		|	ЗаявкаНаРасходДСПлатежи.СтавкаНДС КАК СтавкаНДС,
		|	ЗаявкаНаРасходДСПлатежи.СуммаНДС КАК СуммаНДС,
		|	БТ_СогласованиеЗаявокДДС.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.ЗаявкаНаРасходДС.Платежи КАК ЗаявкаНаРасходДСПлатежи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.БТ_СогласованиеЗаявокДДС КАК БТ_СогласованиеЗаявокДДС
		|		ПО ЗаявкаНаРасходДСПлатежи.Ссылка = БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС
		|ГДЕ
		|	БТ_СогласованиеЗаявокДДС.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка= РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "ДатаПлатежа");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СтатьяРасходов");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "Описание");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "Сумма");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СтавкаНДС");
		ДобавитьЗначениеВТЧ(ТаблицаРеквизитовТЧПомещаемаяВСКД, Выборка, "СуммаНДС"); 
		
	КонецЦикла;
	
	ВнешниеНаборыДанных.Вставить("РеквизитыТЧ", ТаблицаРеквизитовТЧПомещаемаяВСКД);
	
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	ТабДокОписаниеЗаявкиДанныеРасшифровки	= Новый ДанныеРасшифровкиКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СКД, Настройки, ТабДокОписаниеЗаявкиДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ТабДокОписаниеЗаявкиДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДокОписаниеЗаявки.Очистить();
	ПроцессорВывода.УстановитьДокумент(ТабДокОписаниеЗаявки);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ТабДокОписаниеЗаявки.ОтображатьСетку		= Ложь;
	ТабДокОписаниеЗаявки.ОтображатьЗаголовки	= Ложь;
	ТабДокОписаниеЗаявки.ПолеСлева = 20;                          
	
	Если ТЗ = Неопределено Тогда
		
		АдресДанныхРасшифровкиОписаниеЗаявки = ПоместитьВоВременноеХранилище(ТабДокОписаниеЗаявкиДанныеРасшифровки, АдресРасшифровки);
		
	Иначе
	
		КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
	    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	    КомпоновщикНастроекТЗ.ЗагрузитьНастройки(Настройки);
	    НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
		
		МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных; 
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	    Процессор = Новый ПроцессорКомпоновкиДанных;
	    Процессор.Инициализировать(МакетКомпоновкиДанных);
	    ТЗ = Новый ТаблицаЗначений;
	    ТЗ.Очистить();
	    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	    ПроцессорВывода.УстановитьОбъект(ТЗ);
	    ПроцессорВывода.Вывести(Процессор);	                                                                                         
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_ТабДокИсторияСогласования(Заявка, ТабДокИсторияСогласования)
	СКД			= ПолучитьОбщийМакет("БТ_СогласователиЗаявок");
	СКД.Параметры.ЗаявкаПользователя.Значение = Заявка;
	//СКД.Параметры.НеВыводитьТекущихСогласующих.Значение = Ложь;
	Настройки	= СКД.ВариантыНастроек["Основной"].Настройки;
	ЗаявкаПараметр = Настройки.ПараметрыДанных.Элементы.Найти("ЗаявкаПользователя");
	ЗаявкаПараметр.Значение = Заявка;
	ЗаявкаПараметр.Использование = Истина;
	КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки		= КомпоновщикМакета.Выполнить(СКД, Настройки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабДокИсторияСогласования.Очистить();
	ПроцессорВывода.УстановитьДокумент(ТабДокИсторияСогласования);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	ТабДокИсторияСогласования.ОтображатьСетку		= Ложь;
	ТабДокИсторияСогласования.ОтображатьЗаголовки	= Ложь;	
КонецПроцедуры

Процедура ОбновитьСведенияПоТекущейЗаявке_КартаМаршрутаЗаявки(Заявка, КартаМаршрутаЗаявки)
	КартаМаршрутаЗаявки = БТ_БизнесПроцессы.СформироватьКартуМаршрута(Заявка);
	КартаМаршрутаЗаявки.РежимОтрисовкиСетки = РежимОтрисовкиСеткиГрафическойСхемы.НеРисовать;
КонецПроцедуры

Функция УзнатьПолучателей(Ссылка, Роль)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Согласующий,
	|	ОтветственныеПоЗаявкамПользователей.Согласующий.Наименование КАК СогласующийНаименование,
	|	КонтактнаяИнформация.Представление КАК ЭлектронныйАдресс
	|ИЗ
	|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ОтветственныеПоЗаявкамПользователей.Согласующий.Сотрудник = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))";    
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, Ссылка);
	Запрос.УстановитьПараметр("Роль"				, Роль); 
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции 

Процедура СформироватьПисьмо(БПСогласование, Тема, Роль = Неопределено, Комментарий = Неопределено) Экспорт     
	
	Если Роль = Неопределено Тогда
		
		СписокПолучателей = БТ_СлужебныеФункции.УзнатьЭлектроннуюПочту(БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(БПСогласование, "Пользователь.Сотрудник"));
		
	Иначе
		
		СписокПолучателей 	= УзнатьПолучателей(БПСогласование, Роль); 
		
	КонецЕсли;                         
	
	СписокПолучателейРассылки = Новый СписокЗначений;       
	
	Если СписокПолучателей.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Пока СписокПолучателей.Следующий() Цикл                                  
		
		СписокПолучателейРассылки.Добавить(СписокПолучателей.ЭлектронныйАдресс);
		
	КонецЦикла;			
	
	Попытка
		
		ТекстПисьма				= БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьСообщение(БПСогласование);
		
	Исключение                                                                      
		
		ТекстПисьма				= "";
		
	КонецПопытки; 
	
	ТекстПисьма = ТекстПисьма + ?(не Комментарий = Неопределено, "<br><br>" + Комментарий, "");
	
	БТ_СлужебныеФункции.ОтправитьЭлПисьмо(Тема, ТекстПисьма, СписокПолучателейРассылки);
	
КонецПроцедуры

Функция СформироватьСообщение(Ссылка) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;     
	
	БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ОбновитьСведенияПоТекущейЗаявке_ТабДокОписаниеЗаявки(Ссылка, ТабДокумент, Неопределено, Неопределено);
	HTML = ПолучитьИмяВременногоФайла("HTML"); 
	
	ТабДокумент.Записать(HTML, ТипФайлаТабличногоДокумента.HTML);
	
	СтрокаВозврата = "";
	
	Текст = Новый ЧтениеТекста(HTML);

	Строка = Текст.ПрочитатьСтроку();

	Пока Строка <> Неопределено Цикл 

		СтрокаВозврата = "" + СтрокаВозврата + Строка;

		Строка = Текст.ПрочитатьСтроку();

	КонецЦикла;	           
	
	Возврат СтрокаВозврата
КонецФункции

