////////////////////////////////////////////////////////////////////////////////
// ООО "1С-Рарус Альфа-Авто". Департамент разработки. 2011-2016 год.
//------------------------------------------------------------------------------
// Типовое решение "Альфа-Авто: Автосалон+Автосервис+Автозапчасти ПРОФ, редакция 5.1"
//------------------------------------------------------------------------------
// Модуль внешнего соединения

Перем глОбработкаОбмена Экспорт; // обработка обмена в которой ведется лог-файл формирования/получения сообщений обмена

// Функция вызывается из COM-соединения и производит сеанс обмена УРБД
// Параметры:
//   NumberOfMessage - количество предупреждающих сообщений о необходимости закрытия программы
//   MessageInterval - интервал (в секундах) между сообщениями
//   ListOfNodes - список кодов узлов плана обмена, разделенными  (если не задано, то по всем)
//   MessageLog
//   SendMessageFrom1C - Истина/Ложь. Рассылать сообщения пользователям средствами планировщика пользователей
Function RunExchange(NumberOfMessage=5, MessageInterval=30, ListOfNodes="", MessageLog="", SendMessageFrom1C=Истина) Export
 	Return "S_ERROR";
EndFunction	//	RunExchange()

// Функция осуществляет обработку запроса, полученного от DMSBB
// Параметры:
//   par1 - имя сервиса, которому предназначен запрос
//   par2 - содержимое запроса
//
Function DMSBB(par1="url", par2="request" ) Export
	
	Права									= Неопределено;
	ИмяТекущегоСервиса						= СтрЗаменить(par1, "/", "");
	ФункционалDMSBB							= Обработки.ОбменСDMSBB.Создать();
	
	ОтветНаЗапрос							= ФункционалDMSBB.ОбработатьЗапросDMSBB(ИмяТекущегоСервиса, par2);
	
	Возврат ОтветНаЗапрос;
  
EndFunction		// DMSBB