
// Архив с компонентами защиты может распологаться в двух местах
// 1. В общем макете КомпонентыЗащиты
// 2. В файле rarusaddin.zip в каталоге rarus_protect, который должен находиться в папке 1cV8 установленной платформы
// Пример каталог программы C:\Program Files (x86)\1cv8\8.3.5.1383\bin\
// значит rarusaddin.zip должен располагаться в C:\Program Files (x86)\1cv8\rarus_protect 

// Пример для Linux (Ubuntu 64). Каталог программы /opt/1C/v8.3/x86_64/
// значит rarusaddin.zip должен располагаться в /opt/1C/rarus_protect/ 

Функция ОпределитьМестоХраненияКомпоненты() Экспорт;
	
	ПолныйПуть = КаталогПрограммы();
	ДлинаВсего = СтрДлина(ПолныйПуть);
	Если Найти(ПолныйПуть, "\") > 0 Тогда
		// Похоже на Windows
		Разделитель = "\";
	ИначеЕсли Найти(ПолныйПуть, "/") > 0 Тогда
		// Похоже на  Linux
		Разделитель = "/";
	Иначе
		// Неведома ОС
		Возврат "";
	КонецЕсли;
	
	НайденнаяПозиция =  0;
	НайденоРазделителей = 0;
	// Найдем третий разделитель  с конца
	Для Инд = 0 По (ДлинаВсего - 1) Цикл
		Позиция = ДлинаВсего - Инд;
		Символ  = Сред(ПолныйПуть, Позиция, 1);
		Если (Символ = Разделитель) 
			ИЛИ (Инд = 0) // Путь у 1С не всегда заначивается на слеш
			Тогда
			НайденоРазделителей = НайденоРазделителей + 1;
		КонецЕсли;
		
		Если НайденоРазделителей = 3 Тогда
			НайденнаяПозиция = Позиция;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденнаяПозиция > 0 Тогда
		Результат = Лев(ПолныйПуть, НайденнаяПозиция);
	Иначе
		Результат = ПолныйПуть;
	КонецЕсли;
	
	Результат = Результат+ "rarus_protect" + Разделитель + "rarusaddin.zip";
	
	ФайлКомпонент = новый Файл(Результат);
	Если ФайлКомпонент.Существует() Тогда
  		Дата = ПоместитьВоВременноеХранилище(новый ДвоичныеДанные(Результат), новый УникальныйИдентификатор);
		ПараметрыСеанса.МестоХраненияКомпоненты = Дата;
	КонецЕсли;	
	
КонецФункции

//Устанавливает параметры сеанса. Запускается перед началом работы системы до вызова остальных стандартных обработчиков
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ЛицензированиеСервер.УстановитьПараметрыСеанса(ТребуемыеПараметры);
	
	Если ТребуемыеПараметры = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы
		
		Пользователь = обОпределитьТекущегоПользователя();
		
		ПараметрыСеанса.ЗагрузкаКомпонентыОборудования="";
		
		// Пользователь
		ПараметрыСеанса.Пользователь = Пользователь;
		// Организация
		ПараметрыСеанса.Организация = Пользователь.Организация;
		// ПодразделениеКомпании
		ПараметрыСеанса.ПодразделениеКомпании = Пользователь.Подразделение;
		// Компьютер
		ИмяКомпьютера = ИмяКомпьютера();
		ТЗ = "ВЫБРАТЬ
		     |	Компьютеры.ИмяКомпьютера,
		     |	Компьютеры.Пользователь,
		     |	Компьютеры.Ссылка,
		     |	Компьютеры.Наименование,
		     |	ВЫБОР
		     |		КОГДА Компьютеры.Пользователь = &ПустойПользователь
		     |			ТОГДА 1
		     |		ИНАЧЕ 0
		     |	КОНЕЦ КАК Порядок
		     |ИЗ
		     |	Справочник.Компьютеры КАК Компьютеры
		     |ГДЕ
		     |	(Компьютеры.ИмяКомпьютера = &ИмяКомпьютера ИЛИ Компьютеры.Наименование ПОДОБНО &ИмяКомпьютера)
		     |И (Компьютеры.Пользователь = &Пользователь ИЛИ  Компьютеры.Пользователь = &ПустойПользователь)
		     |УПОРЯДОЧИТЬ ПО
		     |	Порядок";
			 
		Запрос = Новый Запрос(ТЗ);
		Запрос.УстановитьПараметр("ИмяКомпьютера",		ИмяКомпьютера);
		Запрос.УстановитьПараметр("ПустойПользователь", Справочники.Пользователи.ПустаяСсылка());
		Запрос.УстановитьПараметр("Пользователь",		Пользователь);
		РезЗапроса = Запрос.Выполнить();
		Если НЕ РезЗапроса.Пустой() Тогда
			Выборка = РезЗапроса.Выбрать();
			Выборка.Следующий();
			Комп = Выборка.Ссылка;
		Иначе
			Комп = Справочники.Компьютеры.СоздатьЭлемент();
			Комп.УстановитьНовыйКод("");
			Комп.ИмяКомпьютера = ИмяКомпьютера;
			Комп.Наименование = Комп.ПолучитьНаименованиеРабочегоМеста();
			Комп.ОбменДанными.Загрузка = Истина;
			Комп.Записать();
		КонецЕсли;
		ПараметрыСеанса.Компьютер = Комп.Ссылка; // Т.к. этот модуль отрабатывает на сервере, то это будет неверным для клиентской сессии, так что в ней переопределим позже
		// РежимРаботыОборудования
		РежимРаботыОборудования = Строка(Комп.НеВключатьОборудованиеПриВходе);
		РежимРаботыОборудования = РежимРаботыОборудования+Строка(Пользователь.РежимИспользованияОборудования);
		ПараметрыСеанса.РежимРаботы = ""; // Режимы работы с оборудованием должен определяться клиентской сессией
		
		ПараметрыСеанса.ПараметрыОбменаДанными = Новый ХранилищеЗначения(Новый Структура);
		ПараметрыСеанса.ИдетОбменНастройкамиОбмена = Ложь; 
		// определим, используется ли РБД на текущий момент
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 2
		|	УдаленныеПодразделения.Ссылка
		|ИЗ
		|	ПланОбмена.УдаленныеПодразделения КАК УдаленныеПодразделения";
		Выборка = Запрос.Выполнить().Выбрать();
	    ПараметрыСеанса.ИспользованиеРБД = (Выборка.Количество() > 1);
		
		ПараметрыСеанса.СчетчикОбъектов 	= 0;
		ПараметрыСеанса.СчетчикСправочников = 0;
		ПараметрыСеанса.СчетчикДокументов 	= 0;
		
		// SMS4B +
		смсРаботаССообщениями.УстановитьПараметры();
		// SMS4B -
		
		// Помощник продаж +
		ПараметрыСеанса.атДоступныеСервисы = Новый ФиксированнаяСтруктура(Новый Структура);
		ПараметрыСеанса.атИдентификаторПодключения = "";
		ПараметрыСеанса.атКодСостояния = 0;
		// Помощник продаж -
		
	Иначе
		// Установка параметров сеанса "по требованию"
	КонецЕсли;
КонецПроцедуры
