// Модуль документа ПеремещениеРезервов

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",               3);
	ОбязательныеТовары.Вставить("Количество",                 1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",           3);
	ОбязательныеТовары.Вставить("Коэффициент",                1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры", 2);
	ОбязательныеТовары.Вставить("МестоРазмещения",            3);
	ОбязательныеТовары.Вставить("ЗаказПокупателя",            3);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",           1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",     1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании", 1);
	ОбязательныеРеквизиты.Вставить("Автор",                 1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",       1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",         1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",           1);
	ОбязательныеРеквизиты.Вставить("Контрагент",            1);
	ОбязательныеРеквизиты.Вставить("Товары",                ОбязательныеТовары);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыСостава = Новый Структура();
			КонтролируемыеРеквизитыСостава.Вставить("МестоРазмещения", КонтрольПоПодразделению);
			Если БалансВедетсяПоОрганизации Тогда
				КонтролируемыеРеквизитыСостава.Вставить("ЗаказПокупателя");
				ТабличныеЧасти = Новый Структура();
				ТабличныеЧасти.Вставить("Товары",КонтролируемыеРеквизитыСостава);
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти);		
			КонецЕсли;
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ПеремещениеРезервов", "Перемещение резервов", Истина);
	Возврат СписокХозОпераций;
	
КонецФункции // ПолучитьСписокХозОпераций()

// Расчет суммы документа
//
// Возвращаемое значение:
//  СуммаДокумента - число - сумма документа.
//
Функция РассчитатьСуммуВсего()Экспорт
	
	Если СуммаДокумента<>0 Тогда
		СуммаДокумента=0;
	КонецЕсли;
	
	Возврат СуммаДокумента;
	
КонецФункции // РассчитатьСуммуВсего()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя = "ДокументОснование" Тогда
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказВнутренний") Тогда
			Контрагент = ?(обЗначениеНеЗаполнено(ДокументОснование), Неопределено, ДокументОснование.ПодразделениеПолучатель);
		ИначеЕсли ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Контрагент = ДокументОснование.Контрагент;
		КонецЕсли;
	//ИначеЕсли Имя="Товары.Номенклатура" Тогда
	//	Если ЗначениеЗаполнено(ДокументОснование) И обЗначениеНеЗаполнено(ТекСтрока.ЗаказПокупателя) Тогда
	//		ТекСтрока.ЗаказПокупателя = ДокументОснование;
	//	КонецЕсли;
	//	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	Иначе
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

// Формирует печатную форму "ПеремещениеРезервов"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьПеремещениеРезервов(ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("ПеремещениеРезервов");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
			
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка          = ТекстЗаголовка;
	ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(Контрагент);
	ОбластьМакета.Параметры.ПредставлениеЗаказ      = СокрЛП(ДокументОснование);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	//перебор строк
	ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		СтруктураСтроки.Вставить("ЗаказПокупателя", дкПолучитьПредставление(СтрокаТабличнойЧасти.ЗаказПокупателя));
		СтруктураСтроки.Вставить("МестоРазмещения", СтрокаТабличнойЧасти.МестоРазмещения);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, , ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакетаИтогоПоСтранице, , , НомерСтраницы,,ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	// Выводим представления и расшифровки подписей
	Исполнитель = дкОтветственноеЛицо(ЭтотОбъект,"ИсполнительОрганизация");
	Исполнитель.ИсполнительОрганизацияПредставление = ?(обЗначениеНеЗаполнено(Исполнитель.ИсполнительОрганизация),"","/ "+ Исполнитель.ИсполнительОрганизацияПредставление);
	ОбластьПодвал.Параметры.Заполнить(Исполнитель);
	Заказчик    = дкОтветственноеЛицо(ЭтотОбъект,"ЗаказчикКонтрагент");
	Заказчик.ЗаказчикКонтрагентПредставление = ?(обЗначениеНеЗаполнено(Заказчик.ЗаказчикКонтрагент),"","/ "+ Заказчик.ЗаказчикКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Заказчик);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьПеремещениеРезервов()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(Основание) Тогда
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Контрагент = Основание.Контрагент;
		ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказВнутренний") Тогда	
			Контрагент = Основание.ПодразделениеПолучатель;
		КонецЕсли;
		//А теперь откорректируем ТЧ на предмет того, что в ней должны остаться только текущие резервы
		Товары.Очистить();
		РазрешениеСнятияРезервов = обПраво("РазрешениеСнятияРезервов", Права,, ЭтотОбъект);
		Если НЕ РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Запрещено Тогда
			ИмяРезерва = ?(РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Разрешено, "РезервОстаток", "РезервСвободныйОстаток");
			Запрос = Новый Запрос;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
			|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗаказыПокупателейОстатки.ЗаказаноОстаток - ЗаказыПокупателейОстатки.РезервОстаток КАК Количество
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Остатки(&НаМомент, Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
			|ГДЕ
			|	(ЗаказыПокупателейОстатки.ЗаказаноОстаток - ЗаказыПокупателейОстатки.РезервОстаток) > 0";
			Запрос.УстановитьПараметр("НаМомент", ТекущаяДата());
			Запрос.УстановитьПараметр("Заказ",    Основание);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
				ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
				Если НЕ НоваяСтрока.Коэффициент = 0 И НЕ НоваяСтрока.Коэффициент = 1 Тогда
					НоваяСтрока.Количество = НоваяСтрока.Количество/НоваяСтрока.Коэффициент;
				КонецЕсли;
			КонецЦикла;
			
			//Запрос.Текст = "ВЫБРАТЬ
			//|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
			//|	ЗаказыПокупателейОстатки.СкладКомпании КАК МестоРазмещения,
			//|	ЗаказыПокупателейОстатки.Заказ КАК ЗаказПокупателя,
			//|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			//|	ЕСТЬNULL(ЗаказыПокупателейОстатки."+ИмяРезерва+", 0) КАК Количество
			//|ИЗ
			//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&НаМомент, НЕ Заказ = &Заказ И Номенклатура В (&Номенклатура)) КАК ЗаказыПокупателейОстатки
			//|";
			//Запрос.УстановитьПараметр("Номенклатура", ТаблицаЗаказов);
			//Товары.Загрузить(Запрос.Выполнить().Выгрузить());
			//Для Каждого СтрокаТоваров Из Товары Цикл
				//ОбработкаРеквизита("Товары.Номенклатура", СтрокаТоваров);
			//КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	//Проверим корректность заполнения табличной части
	//Для Каждого СтрокаТоваров Из Товары Цикл
	//	Если ТипЗнч(Контрагент)=Тип("СправочникСсылка.Контрагенты") Тогда
	//		Если ТипЗнч(СтрокаТоваров.ЗаказПокупателя)<>Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//			Сообщить("Строка "+СокрЛП(СтрокаТоваров.НомерСтроки)+": Вид заказа не соответствует контрагенту.");
	//			Отказ=Истина;
	//		Иначе
	//			Если Контрагент<>СтрокаТоваров.ЗаказПокупателя.Контрагент Тогда
	//				Сообщить("Строка "+СокрЛП(СтрокаТоваров.НомерСтроки)+": Контрагент заказа не соответствует контрагенту документа.");
	//				Отказ=Истина;
	//			КонецЕсли; 
	//		КонецЕсли; 
	//	ИначеЕсли ТипЗнч(Контрагент)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
	//		Если ТипЗнч(СтрокаТоваров.ЗаказПокупателя)<>Тип("ДокументСсылка.ЗаказВнутренний") Тогда
	//			Сообщить("Строка "+СокрЛП(СтрокаТоваров.НомерСтроки)+": Вид заказа не соответствует контрагенту.");
	//			Отказ=Истина;
	//		Иначе
	//			Если Контрагент<>СтрокаТоваров.ЗаказПокупателя.ПодразделениеПолучатель Тогда
	//				Сообщить("Строка "+СокрЛП(СтрокаТоваров.НомерСтроки)+": Контрагент заказа не соответствует контрагенту документа.");
	//				Отказ=Истина;
	//			КонецЕсли; 
	//		КонецЕсли; 
	//	КонецЕсли;
	//КонецЦикла; 
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// Заказы
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Заказ КАК Заказ
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПокупателя
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПоставщика
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка) КАК Заказы";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда
		Возврат;
	КонецЕсли;
	
	//Формирование запроса по табличной части товаров
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.ЗаказПокупателя КАК Заказ,
	|	ДокументТовары.Ссылка.Контрагент КАК Контрагент,
	//" + ?(КорректировкаЗаказа, "
	//|	ДокументТовары.ЗаказПокупателя.СкладКомпании КАК СкладЗаказа,", "") + "
	|	ДокументТовары.МестоРазмещения КАК СкладКомпании,
	|	(ДокументТовары.Количество*ДокументТовары.Коэффициент) КАК Резерв
	|ИЗ
	|	Документ.ПеремещениеРезервов.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка=&Ссылка И 
	|	ДокументТовары.Количество>0
	|");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
	
	// Снимаем резервы по заказам (если таковые были)
	НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	НаборЗаписейЗаказыПокупателей.РежимПроведения           = Режим;
	НаборЗаписейЗаказыПокупателей.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	НаборЗаписейЗаказыПокупателей.Заказ                     = Неопределено;
	НаборЗаписейЗаказыПокупателей.Заказывать                = КорректировкаЗаказа;
	НаборЗаписейЗаказыПокупателей.СкладКомпании             = Неопределено;
	Отказ = НЕ НаборЗаписейЗаказыПокупателей.СнятиеРезервовЗаказовПокупателей() ИЛИ Отказ;
	
	Если КорректировкаЗаказа Тогда
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументТовары.ЗаказПокупателя КАК Заказ,
		|	ДокументТовары.ЗаказПокупателя.СкладКомпании КАК СкладЗаказа,
		|	СУММА(ДокументТовары.Количество*ДокументТовары.Коэффициент) КАК Количество
		|ИЗ
		|	Документ.ПеремещениеРезервов.Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДокументТовары.Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры,
		|	ДокументТовары.ЗаказПокупателя
		|";
		
		// Снимаем резервы по заказам (если таковые были)
		НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
		НаборЗаписейЗаказыПокупателей.РежимПроведения           = Режим;
		НаборЗаписейЗаказыПокупателей.ДокументОбъект            = ЭтотОбъект;
		НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = Запрос.Выполнить();
		НаборЗаписейЗаказыПокупателей.Заказ                     = Неопределено;
		НаборЗаписейЗаказыПокупателей.ВидОперации               = Перечисления.ВидыОперацийЗаказов.КорректировкаЗаказа;
		НаборЗаписейЗаказыПокупателей.СкладКомпании             = Неопределено;
		Отказ = НЕ НаборЗаписейЗаказыПокупателей.КорректировкаСписаниемЗаказаПокупателя() ИЛИ Отказ;
	КонецЕсли;
	
	//РезультатЗапросаПоТоварам.ЗаполнитьЗначения(ДокументОснование, "Заказ");
	
	// Резервирование товаров по заказам покупателей
	НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	НаборЗаписейЗаказыПокупателей.РежимПроведения           = Режим;
	НаборЗаписейЗаказыПокупателей.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	НаборЗаписейЗаказыПокупателей.Контрагент                = Контрагент;
	НаборЗаписейЗаказыПокупателей.Заказ                     = ДокументОснование;
	НаборЗаписейЗаказыПокупателей.СкладКомпании             = Неопределено;
	НаборЗаписейЗаказыПокупателей.Заказывать                = Ложь;
	НаборЗаписейЗаказыПокупателей.Резервировать             = Истина;
	НаборЗаписейЗаказыПокупателей.ПоБазовомуКоличеству      = Истина;
	//НаборЗаписейЗаказыПокупателей.ВидОперации               = Перечисления.ВидыОперацийЗаказов.ПеремещениеРезерва;
	Отказ = НЕ НаборЗаписейЗаказыПокупателей.Приход() ИЛИ Отказ;
	
	//Снимаем распределение заказов покупателя
	//РезультатЗакрытияЗаказов=НаборЗаписейЗаказыПокупателей.Выгрузить();
	Если НЕ Отказ Тогда
		РезультатЗапросаПоТоварам.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "Резерв");
		Запрос=Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц();
		Запрос.Текст="
		|ВЫБРАТЬ
		|	РезультатЗакрытияЗаказов.Номенклатура КАК Номенклатура,
		|	РезультатЗакрытияЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	РезультатЗакрытияЗаказов.Резерв
		|ПОМЕСТИТЬ
		|	РезультатЗакрытияЗаказов
		|ИЗ
		|	&РезультатЗакрытияЗаказов КАК РезультатЗакрытияЗаказов
		|;
		|
		|ВЫБРАТЬ
		|	РезультатЗакрытияЗаказов.Номенклатура КАК Номенклатура,
		|	РезультатЗакрытияЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	((ЕСТЬNULL(ЗаказыПокупателейОстатки.ЗаказаноОстаток,0) -
		|			ЕСТЬNULL(ЗаказыПокупателейОстатки.РезервОстаток,0)) -
		|		РезультатЗакрытияЗаказов.Резерв) -
		|	ЕСТЬNULL(ЗаказыРаспределениеОстатки.КоличествоОстаток,0) КАК Количество
		|ИЗ
		|	РезультатЗакрытияЗаказов КАК РезультатЗакрытияЗаказов
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(&НаМомент,
		|		Заказ = &Заказ И 
		|		Номенклатура В (&Номенклатура) И 
		|		ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
		|	) КАК ЗаказыПокупателейОстатки
		|ПО
		|	РезультатЗакрытияЗаказов.Номенклатура               = ЗаказыПокупателейОстатки.Номенклатура И
		|	РезультатЗакрытияЗаказов.ХарактеристикаНоменклатуры = ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрНакопления.ЗаказыРаспределение.Остатки(&НаМомент,
		|		ЗаказПокупателя = &Заказ И
		|		Номенклатура В (&Номенклатура) И
		|		ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
		|	) КАК ЗаказыРаспределениеОстатки
		|ПО
		|	РезультатЗакрытияЗаказов.Номенклатура               = ЗаказыРаспределениеОстатки.Номенклатура И
		|	РезультатЗакрытияЗаказов.ХарактеристикаНоменклатуры = ЗаказыРаспределениеОстатки.ХарактеристикаНоменклатуры
		|";
		
		Запрос.УстановитьПараметр("НаМомент",                   МоментВремени());
		//Запрос.УстановитьПараметр("Контрагент",                 РезультатЗакрытияЗаказов.ВыгрузитьКолонку("Контрагент"));
		Запрос.УстановитьПараметр("Заказ",                      ДокументОснование);
		Запрос.УстановитьПараметр("Номенклатура",               РезультатЗапросаПоТоварам.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", РезультатЗапросаПоТоварам.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
		Запрос.УстановитьПараметр("РезультатЗакрытияЗаказов",   РезультатЗапросаПоТоварам);
		
		НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
		НаборЗаписейРаспределениеЗаказов.РежимПроведения                  = Режим;
		НаборЗаписейРаспределениеЗаказов.ДокументОбъект                   = ЭтотОбъект;
		НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам        = Запрос.Выполнить().Выгрузить();
		НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя                  = ДокументОснование;
		НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика                  = Неопределено;
		НаборЗаписейРаспределениеЗаказов.Контрагент                       = Контрагент;
		НаборЗаписейРаспределениеЗаказов.ПоБазовомуКоличеству             = Истина;
		НаборЗаписейРаспределениеЗаказов.ПорядокЗакрытияЗаказовПоставщику = "ЗаказыРаспределениеОстатки.ЗаказПокупателя.Дата ВОЗР";
		Отказ=НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределения() ИЛИ Отказ;
		
	КонецЕсли;
	
	//// Корректировка резервирования товаров на складе
	//НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	//НаборЗаписейОстатки.РежимПроведения=Режим;
	//НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	//НаборЗаписейОстатки.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	//НаборЗаписейОстатки.СкладКомпании=Неопределено;
	//НаборЗаписейОстатки.Приходовать=Ложь;
	//НаборЗаписейОстатки.ДвиженияПоРознице=Ложь;
	//НаборЗаписейОстатки.Резервировать=Истина;
	//Отказ=НЕ НаборЗаписейОстатки.Расход() ИЛИ Отказ;
	
	// двигаем границу последовательности заказов
	ДвигаемГраницу = (Режим<>РежимПроведенияДокумента.Оперативный И Движения.ЗаказыПокупателей.Количество()>0);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказБыл) Тогда
		НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаЗаказов = Движения.ЗаказыПокупателей.Выгрузить();
			ТаблицаЗаказов.Свернуть("Заказ","");
			НаборЗаписейГраницыЗаказы.Заказ = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
			НаборЗаписейГраницыЗаказы.МоментВремени = Дата;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыЗаказы.Заказ = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = Неопределено;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли