
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТТ_СкладБланковКСО.Записывать = Истина;
	Движения.ТТ_СкладБланковКСО.Очистить();
	
	Для Каждого Стр Из Бланки Цикл
		
		Если Стр.Количество > Стр.КоличествоУчет Тогда
			Движение = Движения.ТТ_СкладБланковКСО.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Сотрудник = Сотрудник;
			Движение.Бланк = Стр.Бланк;
			Движение.ВидСтрахования = Стр.Бланк.ВидСтрахования;
			Движение.Количество = Стр.КоличествоУчет - Стр.Количество;
			
		ИначеЕсли Стр.Количество < Стр.КоличествоУчет Тогда
					
			Движение = Движения.ТТ_СкладБланковКСО.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = Сотрудник;
			Движение.Бланк = Стр.Бланк;
			Движение.ВидСтрахования = Стр.Бланк.ВидСтрахования;
			Движение.Количество = Стр.КоличествоУчет - Стр.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
