// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	//Заполним предопределенные элементы
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.Заявка.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=1;
		КонецЕсли; 
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=2;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Древесный);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.ВРаботе.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=3;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.БледноМиндальный);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.Выполнен.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=4;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.ГолубойСоСтальнымОттенком);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.Закрыт.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=5;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Розовый);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ТекущийПорядок = 6;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСостоянийЗаказНарядов.Ссылка,
	               |	ВидыСостоянийЗаказНарядов.Порядок
	               |ИЗ
	               |	Справочник.ВидыСостоянийЗаказНарядов КАК ВидыСостоянийЗаказНарядов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидыСостоянийЗаказНарядов.Порядок УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекущийПорядок = Выборка.Порядок+1;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.ОпозданиеКлиента.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=ТекущийПорядок;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Желтый);
		ОбъектСправочника.НедоступноДляВыбора = Истина;
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
			ТекущийПорядок = ТекущийПорядок + 1;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.ОпозданиеНачалаРабот.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=ТекущийПорядок;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Оранжевый);
		ОбъектСправочника.НедоступноДляВыбора = Истина;
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
			ТекущийПорядок = ТекущийПорядок + 1;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыСостоянийЗаказНарядов.ОпозданиеОкончанияРабот.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Порядок=0 Тогда
		Если ОбъектСправочника.Порядок=0 Тогда
			ОбъектСправочника.Порядок=ТекущийПорядок;
		КонецЕсли; 
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Лосось);
		ОбъектСправочника.НедоступноДляВыбора = Истина;
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
			ТекущийПорядок = ТекущийПорядок + 1;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
