
&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Работы.ТекущиеДанные;
	ИзменениеКоличестваЦены(ТекСтрока);
   	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеКоличестваЦены(ТекСтрока)
	
    ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСуммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Работы.ТекущиеДанные;
	ИзменениеСуммы(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ПересчетСуммыДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИзменениеКоличестваЦены(ТекСтрока); 
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыЦенаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Работы.ТекущиеДанные;
	ИзменениеКоличестваЦены(ТекСтрока); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИзменениеКоличестваЦены(ТекСтрока);   
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ИзменениеСуммы(ТекСтрока);  
КонецПроцедуры  

&НаКлиенте
Процедура ИзменениеСуммы(ТекСтрока)
	
    ТекСтрока.Цена = ?(ТекСтрока.Количество = 0, 0, ТекСтрока.Сумма/ТекСтрока.Количество);
	
КонецПроцедуры


&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	ПересчетСуммыДокумента();
КонецПроцедуры 

&НаКлиенте
Процедура ПересчетСуммыДокумента() 
	объект.СуммаДокумента = объект.товары.итог("Сумма") + Объект.работы.Итог("Сумма");
КонецПроцедуры	

&НаСервере
Процедура ВидимостьНомераТО() 
	элементы.НомерТО.Видимость = (Объект.ВидРемонта.код = "ЦБ000037");	
КонецПроцедуры

&НаКлиенте
Процедура ВидРемонтаПриИзменении(Элемент)
	ВидимостьНомераТО();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидимостьНомераТО();  
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автомобиль = ПараметрыСеанса.Пользователь;
		Элементы.ДобавленЛиЗНВрегистр.Видимость = Ложь;
	Иначе
		ЗаполнитьСостояниеВыгрузкиВРегистр(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьНайстрокуПоЗН(Знач ЗН)
	
	СтруктураОтчета = Новый Структура;
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Ссылка", ЗН);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК Ссылка,
		|	ЗаказНаряд.Цех КАК Цех,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ЦехИзНастроек,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Марка,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК КодДилера,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение3 КАК ПутьВыгрузкиЗН,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение4 КАК ПутьОбработки
		|ИЗ
		|	Документ.БТ_ЗаказНарядЛайт КАК ЗаказНаряд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|		ПО ЗаказНаряд.Цех = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение
		|			И ЗаказНаряд.Автомобиль.БТ_МаркаАвто = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ЗН_Настройки""
		|	И ЗаказНаряд.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайлаЗН"));
	  	СтруктураОтчета.Вставить("Марка", 			ВыборкаДетальныеЗаписи.Марка);
		СтруктураОтчета.Вставить("КодДилера", 		ВыборкаДетальныеЗаписи.КодДилера);
		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
		СтруктураОтчета.Вставить("ПутьФайла", 		ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
		СтруктураОтчета.Вставить("ПутьОбработки", 	ВыборкаДетальныеЗаписи.ПутьОбработки);
		
	КонецЦикла; 
	
	ПериодВыгрузки = Новый СтандартныйПериод(); 
	ПериодВыгрузки.ДатаНачала		= НачалоГода(ТекущаяДата());
	ПериодВыгрузки.ДатаОкончания	= КонецГода(ТекущаяДата());
	СтруктураОтчета.Вставить("Ссылка", ЗН);

	СтруктураОтчета.Вставить("ПериодВыгрузки", ПериодВыгрузки); 
	
	Возврат СтруктураОтчета;
	
КонецФункции

&НаСервере
Функция ВыгрузкаВизитаНаСервере()
	
	СтруктураНастроек = ПолучитьНайстрокуПоЗН(Объект.Ссылка);  
	
	СтруктураЛистов = Новый Структура;
	
	БТ_СлужебныеФункции.БТ_ВыгрузкаДанныхОтчетаПоВизитам(Объект.Ссылка, СтруктураЛистов); 
	
	Если СтруктураНастроек.Свойство("ПутьОбработки") Тогда 
		Возврат Новый Структура("ПутьОбработки,СтруктураЛистов", СтруктураНастроек.ПутьОбработки, СтруктураЛистов);
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьТаблицуЗначенийИзТабДок(ТабДок)
	
	СоответсвиеКолонок = новый Соответствие;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ЕстьОшибка = ложь;
	Для _У = 1 по 100 цикл
		
		Колонка 			= СокрЛП(Строка(ТабДок.Область(2,_У).Текст));
		
		Если ПустаяСтрока(Колонка) Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = СтрЗаменить(Колонка, " ", "");
		КолоНка = СтрЗаменить(Колонка, ".", "");
		КолоНка = СтрЗаменить(Колонка, "(", "");
		КолоНка = СтрЗаменить(Колонка, ")", "");
		КолоНка = СтрЗаменить(Колонка, ",", "");
		КолоНка = СтрЗаменить(Колонка, "-", "");
		ТаблицаДанных.Колонки.Добавить(КолоНка);
		 СоответсвиеКолонок.Вставить(Колонка,_У);
		
	КонецЦикла;     
	
	КолВоПропусков = 5;
	Для _У = 3 по 65535 цикл
		
		Если КолВоПропусков = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПробноеЗначение = СокрЛП(Строка(ТабДок.Область(_У,1).Текст));
		
		Если ПустаяСтрока(ПробноеЗначение) ТОгда
			КолВоПропусков = КолВоПропусков - 1;
			Продолжить;
		КонецЕсли;
		
		НовСтр = ТаблицаДанных.Добавить();
		
		Для каждого ТекСтр из СоответсвиеКолонок Цикл
			
			Значение = СокрЛП(Строка(ТабДок.Область(_У,ТекСтр.Значение).Текст));
			НовСтр[ТекСтр.Ключ] = Значение;
				
		КонецЦикла;

	КонецЦикла;
	
	Возврат ТаблицаДанных
	
КонецФункции    

&НаСервере
Функция ПолучитьСоответсвиеТиповРемонта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетностьПоВизитам_ПредставлениеТипПозиции""";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Индексы.Добавить("Значение");

	Возврат РезультатЗапроса;

	
КонецФункции


&НаКлиенте
Процедура ВыгрузитьCSV(Знач Таблица, ИмяФайлаCSV, КолВоСтрокПропуска) 
	         
	МасСтрок = ВыгрузитьCSVНаСервере(Таблица, ИмяФайлаCSV, КолВоСтрокПропуска);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	
	ДЛя Каждого Элем Из МасСтрок Цикл
		ТекстовыйФайл.ДобавитьСтроку(Элем);
	КонецЦикла;	                         
	
	ТекстовыйФайл.Записать(ИмяФайлаCSV, "windows-1251");
КонецПроцедуры

&НаСервере
Функция ТабельныйНомер() 
	Возврат объект.Мастер.ТабельныйНомер;
КонецФункции	

&НаКлиенте
Функция ВыгрузитьCSVНаСервере(Таблица, ИмяФайлаCSV, КолВоСтрокПропуска)
	МасСтрок = Новый Массив;
	
	Если не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Таблица, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Таблица = ПолучитьТаблицуЗначенийИзТабДок(ТабДок);
		
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент; 
	Для инд = 1 по КолВоСтрокПропуска Цикл 
		
		МасСтрок.Добавить(";;");
		
	КонецЦикла;
	
	ТабНомер = ТабельныйНомер(); 
	ЕстьМойка = ЕстьМойка();
	
	СоответсвиеТиповРемонта = ПолучитьСоответсвиеТиповРемонта();
	//Если Ложь Тогда
	//	
	//	СоответсвиеТиповРемонта = Новый ТаблицаЗначений;
	//	
	//КонецЕсли	
	Для каждого ТекСтр из Таблица Цикл
		
		Строка = "";
		
		ЗН = Неопределено;
		
		Для каждого ТекКолонка из Таблица.Колонки Цикл
			
			Значение 		= ТекСтр[ТекКолонка.Имя];  
			ЗначениеПоля 	= Строка(Значение);
			
			Если ТекКолонка.Имя = "Типремонта" Тогда
				
				НСтр = СоответсвиеТиповРемонта.Найти(Значение, "Наименование");
				
				Если НСтр = Неопределено Тогда
					
					ЗначениеПоля = "4";
					
				Иначе
					
					ЗначениеПоля = НСтр.Значение;
					
				КонецЕсли;
				
			КонецЕсли;   
			
			//Если ТекКолонка.Имя = "Номер" Тогда //<<БАА
			//	ЗН = Документы.ЗаказНаряд.НайтиПоНомеру(ЗначениеПоля, ТекущаяДатаСеанса());
			//	
			//КонецЕсли;	
			
			//Если ТипЗнч(Значение) = Тип("Булево") Тогда
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"БЛ=0; БИ=1"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ДЛФ=D"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ЧГ=0"));
			//	
			//КонецЕсли;                    
			
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, Символы.ПС, "");
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ";", ",");
			
			Строка = Строка + ?(ПустаяСтрока(Строка), "", ";") + ?(ПустаяСтрока(ЗначениеПоля), "Отсутствует", ЗначениеПоля);
			
		КонецЦикла; 
		
		Если КолВоСтрокПропуска = 2 и Ложь Тогда
			
			Строка = Строка + ";Отсутствует;Отсутствует;Отсутствует";
			
		КонецЕсли;
		
		//<<БАА
		Если ЗначениеЗаполнено(ЗН) Тогда
			Строка = Строка + ";" + ТабНомер + ";" + ТабНомер + ";" + ТабНомер + ";" + "Заказ-наряд;" + ЕстьМойка + ";0"; ;;
		КонецЕсли;	                            
		
		МасСтрок.Добавить(Строка);
		
	КонецЦикла;  
	
	Возврат МасСтрок;
	
Конецфункции    

&НаСервере
Функция ЕстьМойка()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНарядРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БТ_ЗаказНарядЛайт.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Работа.Наименование ПОДОБНО ""%Мойка%""";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), "0", "1");
	
КонецФункции

&НаСервере
Функция ЗаполнитьСостояниеВыгрузкиВРегистр(ДокСсылка)
	
	Если ДокСсылка.проведен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СопоставлениеДанныхЗаказНарядовЛайт.Период КАК Период
		|ИЗ
		|	РегистрСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт КАК БТ_СопоставлениеДанныхЗаказНарядовЛайт
		|ГДЕ
		|	БТ_СопоставлениеДанныхЗаказНарядовЛайт.Данные1С = &Данные1С
		|	И БТ_СопоставлениеДанныхЗаказНарядовЛайт.Тип = &Тип";
		
		Запрос.УстановитьПараметр("Данные1С", ДокСсылка);
		Запрос.УстановитьПараметр("Тип", "ЗаказНаряд");
		
		РезультатЗапроса = Запрос.Выполнить().Пустой();
		
		Элементы.ДобавленЛиЗНВрегистр.Видимость = Истина;
		
		Если РезультатЗапроса Тогда
			Элементы.ДобавленЛиЗНВрегистр.Заголовок = "Заказ-наряд не выгружен в регистр. Проверьте заполнение Заказ-наряда!";
			Элементы.ДобавленЛиЗНВрегистр.ЦветТекста = Новый Цвет(255,0,0);
		Иначе
			Элементы.ДобавленЛиЗНВрегистр.Заголовок = "Заказ-наряд выгружен в регистр. Можно выгрузить в DNM.";
			Элементы.ДобавленЛиЗНВрегистр.ЦветТекста = Новый Цвет(0,153,0);
		КонецЕсли;
	Иначе
		Элементы.ДобавленЛиЗНВрегистр.Видимость = Ложь;
	КонецЕсли;

КонецФУнкции

&НаКлиенте
Процедура ВыгрузитьЛисты(СтруктураОтбора, СтруктураЛистов);
	Если Не СтруктураОтбора = Неопределено Тогда
			
		Если СтруктураОтбора.Свойство("Ссылка") и СтруктураОтбора.Свойство("ПутьФайлаЗН") и ЗначениеЗаполнено(СтруктураОтбора.ПутьФайлаЗН) Тогда
			
			ИмяФайла = ""+СтруктураОтбора.ПутьФайлаЗН+ "1.XLSX";
			
		Иначе
			
			ИмяФайла = ""+СтруктураОтбора.ПутьФайла+ "1.XLSX";
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПервыйЛист = СтруктураЛистов.ПервыйЛист;
	ВторойЛист = СтруктураЛистов.ВторойЛист;
	ТретийЛист = Неопределено;
	Если СтруктураЛистов.Свойство("ТретийЛист") Тогда
		ТретийЛист = СтруктураЛистов.ТретийЛист;
	КонецЕсли;	                                
	
	Книга = Новый ПакетОтображаемыхДокументов;
	Лист1 = Книга.Состав.Добавить();
	Лист1.Данные 		= ПоместитьВоВременноеХранилище(ПервыйЛист);  
	Лист1.Наименование	= "Заказ-наряды";
	Лист2 = Книга.Состав.Добавить();
	Лист2.Данные 		= ПоместитьВоВременноеХранилище(ВторойЛист.ТабличныйДокумент);
	Лист2.Наименование	= "Детализация Заказ-Нарядов";                        
	
	Если Не ТретийЛист = Неопределено Тогда
		
		Лист3 = Книга.Состав.Добавить();
		Лист3.Данные 		= ПоместитьВоВременноеХранилище(ТретийЛист.ТабличныйДокумент);
		Лист3.Наименование	= "ОстаткиТоваров";
		
	КонецЕсли;
	
	Книга.Записать(ИмяФайла, ?(ВРег(Прав(ИмяФайла, 4)) = "XLSX", ТипФайлаПакетаОтображаемыхДокументов.XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLS));
	XLSX = ВРег(Прав(ИмяФайла, 4)) = "XLSX";  
	ФорматФайла = ?(XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLS);
	Файл = Новый Файл(ИмяФайла);    
	
	ИмяФайла1 = Файл.Путь + Файл.ИмяБезРасширения + "_Заказ-наряды";
	ИмяФайла2 = Файл.Путь + Файл.ИмяБезРасширения + "_Детализация Заказ-Нарядов";      
	Если Не ТретийЛист = Неопределено Тогда            
		
		ИмяФайла3 = Файл.Путь + Файл.ИмяБезРасширения + "_Остатки";
		
	КонецЕсли;
	ПервыйЛист.Записать(ИмяФайла1 + Файл.Расширение, ФорматФайла);
	ВторойЛист.ТабличныйДокумент.Записать(ИмяФайла2 + Файл.Расширение, ФорматФайла);     
	Если Не ТретийЛист = Неопределено Тогда                         
		
		ТретийЛист.ТабличныйДокумент.Записать(ИмяФайла3 + Файл.Расширение, ФорматФайла);  
		
	КонецЕсли;
	
	ВыгрузитьCSV(ИмяФайла1 + Файл.Расширение, Файл.Путь + "File1.txt",2); 
	ВыгрузитьCSV(ВторойЛист.ТЗ, Файл.Путь + "File2.txt",1);    
	Если Не ТретийЛист = Неопределено Тогда                  
		
		ВыгрузитьCSV(ТретийЛист.ТЗ, Файл.Путь + "File3.txt",1);   
		
	КонецЕсли;
	
	Попытка
		УдалитьФайлы(ИмяФайла1 + Файл.Расширение);
		УдалитьФайлы(ИмяФайла2 + Файл.Расширение);
		//УдалитьФайлы(ИмяФайла3 + Файл.Расширение); 
		Если Не СтруктураОтбора = Неопределено Тогда
		//	УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция этоЧери()
	Если Объект.Автомобиль.БТ_МаркаАвто.Код = "000000022" или Объект.Автомобиль.БТ_МаркаАвто.Код = "000000049" или Объект.Автомобиль.БТ_МаркаАвто.Код = "000000079" Тогда  
		обр = Обработки.БТ_ИнфообменЧери.Создать();
		обр.ЗаказНаряды = истина;
		обр.ЗаказНарядЛайт = объект.Ссылка;  
		обр.Сформировать(); 
		
		Возврат Истина;
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Процедура ВыгрузкаВизита(Команда)
	
	Если Объект.ссылка.Пустая() Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать документ перед выгрузкой"); 
		возврат;
	КонецЕсли;	 
	
	Если ЭтоЧери() Тогда 
		ВОзврат;
	КонецЕсли;  
	
	Если Объект.Автомобиль.БТ_МаркаАвто.Код = "000000039" Тогда //Чанган
		Обр = Обработки.БТ_ИнфообменЧанган.Создать();
		Обр.ЗаказНарядыЛайт = Истина;
		Обр.ОдинЗНЛайт = Объект.Ссылка; 
		Обр.Подразделение = Объект.Подразделение;
		Обр.ВыгрузитьДанные();
		Возврат;
	КонецЕсли;	 
	
	Если Объект.Автомобиль.БТ_МаркаАвто.Код = "000000045" Тогда //Хавейл
		Обр = Обработки.БТ_ИнфообменХавал.Создать();
		Обр.ЗаказНарядыЛайт = Истина;
		Обр.ОдинЗНЛайт = Объект.Ссылка; 
		//Обр.Подразделение = Объект.Подразделение;
		Обр.ВыгрузитьДанные();
		Возврат;
	КонецЕсли;	 
	
	Если Объект.Автомобиль.БТ_МаркаАвто.Код = "000000019" Тогда //Джили
		Обр = Обработки.БТ_ИнфообменGeely.Создать();
		Обр.ЗаказНарядыЛайт = Истина;
		Обр.ОдинЗНЛайт = Объект.Ссылка; 
		//Обр.Подразделение = Объект.Подразделение;
		Обр.ВыгрузитьДанные();
		Возврат;
	КонецЕсли;	


	
	Структ = ВыгрузкаВизитаНаСервере();  
	
	Если ТипЗнч(Структ) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;	
	
	ПутьОбработки = структ.ПутьОбработки;
	СтруктураЛИстов = Структ.СтруктураЛистов.Результат; 
	СтруктураОтбора = Структ.СтруктураЛистов.СтруктураОтбора;
	
	ВыгрузитьЛисты(СтруктураОтбора, СтруктураЛистов); 
	
	ЗадержкаСекунд = 10;
	
	КомандаWindows = "Timeout /T " + Формат(ЗадержкаСекунд, "ЧГ=0") + " /NoBreak";
	WshShell = Новый COMОбъект("WScript.Shell"); 
	WshShell.Run(КомандаWindows, 0, -1);
	
	Если Не ПустаяСтрока(ПутьОбработки) Тогда	
		ЗапуститьПриложение(ПутьОбработки); 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьСостояниеВыгрузкиВРегистр(ТекущийОбъект.Ссылка);
КонецПроцедуры


