#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПриходныйКассовыйОрдер", "Приходный кассовый ордер");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

// Возвращает табличную часть документа основания
//
// Параметры:
//  СсылкаПКО - ДокументСсылка.ПриходныйКассовыйОрдер - Ссылка на документ, для Основания которого получается табличная часть.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица номенклатуры документа Основания.
//
Функция ПолучитьТабличнуюЧастьДокументаОснования(СсылкаПКО) Экспорт
	
	ДокументОснование = СсылкаПКО.ДокументОснование;
	МетаданныеДокументаОснования = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОснование));
	
	Если МетаданныеДокументаОснования = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.АвансовыйОтчет
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.АктПриемаПередачиЦенныхБумаг
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВводОстатковВзаиморасчетов
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Взаимозачет
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Выписка
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВыплатаЗарплаты
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ЗаявкаНаРасходДС
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.Инкассация
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.КорректировкаДолга
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.НачислениеЗарплаты
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ОбслуживаниеАктива
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПереоценкаВалютныхСредств
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПланПоступленияДС 
		
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.РабочийЛистОтделаСтрахования
		
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.РасходныйКассовыйОрдер
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ПриходныйКассовыйОрдер Тогда
			Возврат Неопределено;
	КонецЕсли;
	
	// создадим таблицу значений как во фронте кассира
	Результат = Новый ТаблицаЗначений;
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	Результат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов(Массив,,, Новый КвалификаторыЧисла(10,0,ДопустимыйЗнак.Неотрицательный)));
	Колонки = Метаданные.Обработки.ФронтКассира.ТабличныеЧасти.Товары.Реквизиты;
	Для Каждого Колонка Из Колонки Цикл
		Результат.Колонки.Добавить(Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Автомобили"));
	Результат.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов(МассивТипов));
	
	Если Результат.Колонки.Найти("ИдентификаторТовара") = Неопределено Тогда
		Результат.Колонки.Добавить("ИдентификаторТовара", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
	ВалютаДокумента = СсылкаПКО.ВалютаДокумента;
	КурсДокумента   = СсылкаПКО.КурсДокумента;
	
	ЕстьВалютаДокументаОснования = дкДокументЕстьРеквизитШапки("ВалютаДокумента", МетаданныеДокументаОснования.Имя);
	Если ЕстьВалютаДокументаОснования Тогда
		ВалютаДокументаОснования = ДокументОснование.ВалютаДокумента;
		КурсДокументаОснования   = ДокументОснование.КурсДокумента;
	КонецЕсли;
	
	Если МетаданныеДокументаОснования = Метаданные.Документы.СчетНаОплату Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СчетНаОплатуТовары.Номенклатура) = ТИП(Справочник.Автоработы)
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.Авторабота)
			|		ИНАЧЕ СчетНаОплатуТовары.Номенклатура
			|	КОНЕЦ КАК Номенклатура,
			|	СчетНаОплатуТовары.Количество КАК Количество,
			|	СчетНаОплатуТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	СчетНаОплатуТовары.Коэффициент КАК Коэффициент,
			|	СчетНаОплатуТовары.Цена КАК Цена,
			|	СчетНаОплатуТовары.Сумма КАК Сумма,
			|	СчетНаОплатуТовары.СтавкаНДС КАК СтавкаНДС,
			|	СчетНаОплатуТовары.СуммаНДС КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(СчетНаОплатуТовары.Номенклатура) = ТИП(Справочник.Автоработы)
			|			ТОГДА СчетНаОплатуТовары.Номенклатура.Наименование
			|		ИНАЧЕ СчетНаОплатуТовары.ХарактеристикаНоменклатуры
			|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
			|	СчетНаОплатуТовары.СуммаВсего КАК СуммаВсего,
			|	СчетНаОплатуТовары.СуммаСкидки КАК СуммаСкидки,
			|	СчетНаОплатуТовары.ПроцентСкидки КАК ПроцентСкидки,
			|	СчетНаОплатуТовары.СкидкаНаТовар КАК СкидкаНаТовар,
			|	СчетНаОплатуТовары.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
			|	СчетНаОплатуТовары.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки
			|ИЗ
			|	Документ.СчетНаОплату.Товары КАК СчетНаОплатуТовары
			|ГДЕ
			|	СчетНаОплатуТовары.Ссылка = &Ссылка";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказНаряд Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЗаказНарядТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНарядТовары.Количество,
		|	ЗаказНарядТовары.ЕдиницаИзмерения,
		|	ЗаказНарядТовары.Коэффициент,
		|	ЗаказНарядТовары.Цена,
		|	ЗаказНарядТовары.Сумма,
		|	ЗаказНарядТовары.СтавкаНДС,
		|	ЗаказНарядТовары.СуммаНДС,
		|	ЗаказНарядТовары.ПроцентСкидки,
		|	ЗаказНарядТовары.СуммаСкидки,
		|	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
		|	ЗаказНарядТовары.СуммаВсего,
		|	ЗаказНарядТовары.СкидкаНаТовар,
		|	ЗаказНарядТовары.ПроцентСкидкиСтроки,
		|	ЗаказНарядТовары.СуммаСкидкиСтроки,
		|	ЗаказНарядТовары.СуммаСкидкиБонусами
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНарядРаботы.НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Авторабота),
		|	ЗаказНарядРаботы.Количество,
		|	ЗаказНарядРаботы.Работа.Номенклатура.ОсновнаяЕдиницаИзмерения,
		|	ЗаказНарядРаботы.Коэффициент,
		|	ЗаказНарядРаботы.Цена,
		|	ЗаказНарядРаботы.Сумма,
		|	ЗаказНарядРаботы.СтавкаНДС,
		|	ЗаказНарядРаботы.СуммаНДС,
		|	ЗаказНарядРаботы.ПроцентСкидки,
		|	ЗаказНарядРаботы.СуммаСкидки,
		|	ЗаказНарядРаботы.Работа.Наименование,
		|	ЗаказНарядРаботы.СуммаВсего,
		|	ЗаказНарядРаботы.СкидкаНаТовар,
		|	ЗаказНарядРаботы.ПроцентСкидкиСтроки,
		|	ЗаказНарядРаботы.СуммаСкидкиСтроки,
		|	ЗаказНарядРаботы.СуммаСкидкиБонусами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.РеализацияАктивов Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РеализацияАктивовАктивы.НомерСтроки,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура КАК Номенклатура,
		|	РеализацияАктивовАктивы.Сумма,
		|	РеализацияАктивовАктивы.СтавкаНДС,
		|	РеализацияАктивовАктивы.СуммаНДС,
		|	РеализацияАктивовАктивы.Количество,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РеализацияАктивовАктивы.ПрочийАктив.Наименование КАК ХарактеристикаНоменклатуры,
		|	РеализацияАктивовАктивы.Сумма КАК СуммаВсего
		|ИЗ
		|	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
		|ГДЕ
		|	РеализацияАктивовАктивы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияАктивовАктивы.НомерСтроки";
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.БТ_ПредоплаченноеТО Тогда //<<БАА
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РеализацияАктивовАктивы.НомерСтроки,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура КАК Номенклатура,
		|	РеализацияАктивовАктивы.Сумма,
		|	РеализацияАктивовАктивы.СтавкаНДС,
		|	РеализацияАктивовАктивы.СуммаНДС,
		|	РеализацияАктивовАктивы.Количество,
		|	РеализацияАктивовАктивы.ПрочийАктив.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	РеализацияАктивовАктивы.ПрочийАктив.Наименование КАК ХарактеристикаНоменклатуры,
		|	РеализацияАктивовАктивы.Сумма КАК СуммаВсего
		|ИЗ
		|	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
		|ГДЕ
		|	РеализацияАктивовАктивы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	РеализацияАктивовАктивы.НомерСтроки";
	
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ИнвентаризацияАвтомобилей Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИнвентаризацияАвтомобилейАвтомобили.НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.Автомобиль) КАК Номенклатура,
		|	ИнвентаризацияАвтомобилейАвтомобили.Количество,
		|	ИнвентаризацияАвтомобилейАвтомобили.Цена,
		|	ИнвентаризацияАвтомобилейАвтомобили.Сумма
		|ИЗ
		|	Документ.ИнвентаризацияАвтомобилей.Автомобили КАК ИнвентаризацияАвтомобилейАвтомобили
		|ГДЕ
		|	ИнвентаризацияАвтомобилейАвтомобили.Ссылка = &Ссылка
		|	И ИнвентаризацияАвтомобилейАвтомобили.КоличествоУчет - ИнвентаризацияАвтомобилейАвтомобили.Количество < 0";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.Инвентаризация Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИнвентаризацияТовары.НомерСтроки КАК НомерСтроки,
		|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
		|	-ИнвентаризацияТовары.Количество КАК Количество,
		|	ИнвентаризацияТовары.ЕдиницаИзмерения,
		|	ИнвентаризацияТовары.Коэффициент,
		|	ИнвентаризацияТовары.Цена КАК Цена,
		|	-ИнвентаризацияТовары.Сумма КАК Сумма,
		|	ИнвентаризацияТовары.ХарактеристикаНоменклатуры,
		|	ИнвентаризацияТовары.ЦенаОтпускная
		|ИЗ
		|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
		|ГДЕ
		|	ИнвентаризацияТовары.Ссылка = &Ссылка
		|	И ИнвентаризацияТовары.Количество < 0";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказНаАвтомобиль Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	NULL КАК НомерСтроки,
		|	ЗаказНаАвтомобиль.Автомобиль КАК Номенклатура,
		|	1 КАК Количество,
		|	ЗаказНаАвтомобиль.ЦенаАвтомобиля КАК Цена,
		|	ЗаказНаАвтомобиль.ЦенаАвтомобиля КАК Сумма,
		|	ЗаказНаАвтомобиль.СтавкаНДСНаАвтомобиль КАК СтавкаНДС,
		|	ЗаказНаАвтомобиль.СуммаНДСНаАвтомобиль КАК СуммаНДС,
		|	ЗаказНаАвтомобиль.ЗначениеСкидкиНаценки КАК ПроцентСкидки,
		|	ЗаказНаАвтомобиль.СуммаСкидкиНаценки КАК СуммаСкидки,
		|	""VIN "" + ЗаказНаАвтомобиль.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		|	ЗаказНаАвтомобиль.СуммаВсегоНаАвтомобиль КАК СуммаВсего,
		|	ЗаказНаАвтомобиль.СкидкаНаценкаНаАвтомобиль КАК СкидкаНаТовар,
		|	ЗаказНаАвтомобиль.ПроцентСкидкиНаАвтомобиль КАК ПроцентСкидкиСтроки,
		|	ЗаказНаАвтомобиль.СуммаСкидкиНаАвтомобиль КАК СуммаСкидкиСтроки,
		|	ЗаказНаАвтомобиль.СебестоимостьАвтомобиля КАК СебестоимостьАвтомобиля
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаАвтомобильОпции.НомерСтроки,
		|	ЗаказНаАвтомобильОпции.Опция,
		|	ЗаказНаАвтомобильОпции.Количество,
		|	ЗаказНаАвтомобильОпции.Цена,
		|	ЗаказНаАвтомобильОпции.Сумма,
		|	ЗаказНаАвтомобильОпции.СтавкаНДС,
		|	ЗаказНаАвтомобильОпции.СуммаНДС,
		|	ЗаказНаАвтомобильОпции.ПроцентСкидки,
		|	ЗаказНаАвтомобильОпции.СуммаСкидки,
		|	"""",
		|	ЗаказНаАвтомобильОпции.СуммаВсего,
		|	NULL,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль.Опции КАК ЗаказНаАвтомобильОпции
		|ГДЕ
		|	ЗаказНаАвтомобильОпции.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаАвтомобильТовары.НомерСтроки,
		|	ЗаказНаАвтомобильТовары.Номенклатура,
		|	ЗаказНаАвтомобильТовары.Количество,
		|	ЗаказНаАвтомобильТовары.Цена,
		|	ЗаказНаАвтомобильТовары.Сумма,
		|	ЗаказНаАвтомобильТовары.СтавкаНДС,
		|	ЗаказНаАвтомобильТовары.СуммаНДС,
		|	ЗаказНаАвтомобильТовары.ПроцентСкидки,
		|	ЗаказНаАвтомобильТовары.СуммаСкидки,
		|	ЗаказНаАвтомобильТовары.ХарактеристикаНоменклатуры,
		|	ЗаказНаАвтомобильТовары.СуммаВсего,
		|	ЗаказНаАвтомобильТовары.СкидкаНаТовар,
		|	ЗаказНаАвтомобильТовары.ПроцентСкидкиСтроки,
		|	ЗаказНаАвтомобильТовары.СуммаСкидкиСтроки,
		|	0
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль.Товары КАК ЗаказНаАвтомобильТовары
		|ГДЕ
		|	ЗаказНаАвтомобильТовары.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ВыборкаСтрока = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаСтрока.Следующий() Тогда
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
			НоваяСтрока.Автомобиль = ВыборкаСтрока.Номенклатура;
			НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
			НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
			Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
				НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество = 1;
			
			Сумма = 0;
			СуммаНДС = 0;
			СуммаСкидки = 0;
			СуммаСкидкиСтроки = 0;
			СуммаВсего = 0;
			Количество = 0;
			СебестоимостьАвтомобиля = 0;
			
			Пока ВыборкаСтрока.Следующий() Цикл
				Сумма = Сумма + ВыборкаСтрока.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрока.СуммаНДС;
				СуммаСкидки = СуммаСкидки + ВыборкаСтрока.СуммаСкидки;
				СуммаСкидкиСтроки = СуммаСкидкиСтроки + ВыборкаСтрока.СуммаСкидкиСтроки;
				СуммаВсего = СуммаВсего + ВыборкаСтрока.СуммаВсего;
				Количество = Количество + ВыборкаСтрока.Количество;
				СебестоимостьАвтомобиля = СебестоимостьАвтомобиля + ВыборкаСтрока.СебестоимостьАвтомобиля;
			КонецЦикла;
			
			НоваяСтрока.СуммаСкидки = обПересчет(НоваяСтрока.СуммаСкидки + СуммаСкидки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего + СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаСкидкиСтроки = обПересчет(НоваяСтрока.СуммаСкидкиСтроки + СуммаСкидкиСтроки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			Если (НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки + НоваяСтрока.СуммаСкидкиСтроки) <> 0 Тогда
				НоваяСтрока.ПроцентСкидки = (1-(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки)/(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки + НоваяСтрока.СуммаСкидкиСтроки))*100;
				НоваяСтрока.ПроцентСкидкиСтроки = (1-(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки)/(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки + НоваяСтрока.СуммаСкидки))*100;
			КонецЕсли;
			НоваяСтрока.Сумма    = обПересчет(НоваяСтрока.Сумма + Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Цена     = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС + СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СебестоимостьАвтомобиля = обПересчет(НоваяСтрока.СебестоимостьАвтомобиля + СебестоимостьАвтомобиля, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
		ЗаполнениеДаннымиАвтомобиля(ДокументОснование, Результат);
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ОтчетКомитентуЗаАвтомобили Тогда
		
		Результат.Колонки.Добавить("ДокументПоступления");
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.НомерСтроки КАК НомерСтроки,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль КАК Номенклатура,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Количество КАК Количество,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Цена КАК Цена,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Сумма КАК Сумма,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.СтавкаНДС КАК СтавкаНДС,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.СуммаНДС КАК СуммаНДС,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.СуммаВсего КАК СуммаВсего,
		|	""VIN "" + ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.ДокументПоступления КАК ДокументПоступления
		|ИЗ
		|	Документ.ОтчетКомитентуЗаАвтомобили.Автомобили КАК ОтчетКомитентуЗаАвтомобилиАвтомобили
		|ГДЕ
		|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Автомобиль = Выборка.Номенклатура;
			НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(Выборка.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
			НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
			Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
				НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество = 1;
			
			НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Сумма = обПересчет(НоваяСтрока.Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Цена = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
		КонецЦикла;
		
		ЗаполнениеДаннымиАвтомобиля(ДокументОснование, Результат);
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ОтчетКомиссионераЗаАвтомобили
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВозвратПоставщикуАвтомобилей Тогда
		
		Результат.Колонки.Добавить("ДокументПередачи");
		
		РеквизитыТабличнойЧастиДокументаОснования = МетаданныеДокументаОснования.ТабличныеЧасти.Автомобили.Реквизиты;
		ИмяДокументаОснования = МетаданныеДокументаОснования.Имя;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	"+ИмяДокументаОснования+"Автомобили.НомерСтроки КАК НомерСтроки,
		|	"+ИмяДокументаОснования+"Автомобили.Автомобиль КАК Номенклатура,
		|	"+ИмяДокументаОснования+"Автомобили.ИдентификаторАвтомобиля КАК ИдентификаторАвтомобиля,
		|	"+ИмяДокументаОснования+"Автомобили.Количество КАК Количество,
		|	"+ИмяДокументаОснования+"Автомобили.Цена КАК Цена,
		|	"+ИмяДокументаОснования+"Автомобили.Сумма КАК Сумма,
		|	"+ИмяДокументаОснования+"Автомобили.СтавкаНДС КАК СтавкаНДС,
		|	"+ИмяДокументаОснования+"Автомобили.СуммаНДС КАК СуммаНДС,
		|	"+ИмяДокументаОснования+"Автомобили.СуммаВсего КАК СуммаВсего,
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ДокументПередачи") = Неопределено, "", ИмяДокументаОснования+"Автомобили.ДокументПередачи КАК ДокументПередачи,")+"
		|	""VIN "" + "+ИмяДокументаОснования+"Автомобили.Автомобиль.VIN КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ."+ИмяДокументаОснования+".Автомобили КАК "+ИмяДокументаОснования+"Автомобили
		|ГДЕ
		|	"+ИмяДокументаОснования+"Автомобили.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"+ИмяДокументаОснования+"Товары.НомерСтроки,
		|	"+ИмяДокументаОснования+"Товары.Номенклатура,
		|	"+ИмяДокументаОснования+"Товары.ИдентификаторАвтомобиля,
		|	"+ИмяДокументаОснования+"Товары.Количество,
		|	"+ИмяДокументаОснования+"Товары.Цена,
		|	"+ИмяДокументаОснования+"Товары.Сумма,
		|	"+ИмяДокументаОснования+"Товары.СтавкаНДС,
		|	"+ИмяДокументаОснования+"Товары.СуммаНДС,
		|	"+ИмяДокументаОснования+"Товары.СуммаВсего,
		|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ДокументПередачи") = Неопределено, "", "NULL,")+"
		|	"+ИмяДокументаОснования+"Товары.ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ."+ИмяДокументаОснования+".Товары КАК "+ИмяДокументаОснования+"Товары
		|ГДЕ
		|	"+ИмяДокументаОснования+"Товары.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ИдентификаторАвтомобиля";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		Если МетаданныеДокументаОснования = Метаданные.Документы.ОтчетКомиссионераЗаАвтомобили Тогда
			ЗапросГТД = Новый Запрос;
			ЗапросГТД.Текст = "ВЫБРАТЬ
			                  |	АвтомобилиОтданные.Автомобиль,
			                  |	АвтомобилиОтданные.ГТД
			                  |ИЗ
			                  |	РегистрНакопления.АвтомобилиОтданные КАК АвтомобилиОтданные
			                  |ГДЕ
			                  |	АвтомобилиОтданные.Регистратор = &Регистратор";
			ЗапросГТД.УстановитьПараметр("Регистратор", ДокументОснование);
			ТаблицаГТД = ЗапросГТД.Выполнить().Выгрузить();
		Иначе
			ТаблицаГТД = РегистрыНакопления.ОстаткиАвтомобилей.ПолучитьГТДАвтомобилей(ДокументОснование);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаСтрока = Выборка.Выбрать();
			
			Если ВыборкаСтрока.Следующий() Тогда
				
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
				НоваяСтрока.Автомобиль = ВыборкаСтрока.Номенклатура;
				НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
				НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
				Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
					НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
				КонецЕсли;
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
				НоваяСтрока.Количество = 1;
				
				Если НЕ ТаблицаГТД = Неопределено Тогда
					НайденнаяСтрокаГТД = ТаблицаГТД.Найти(ВыборкаСтрока.Номенклатура, "Автомобиль");
					Если НЕ НайденнаяСтрокаГТД = Неопределено Тогда
						НоваяСтрока.ГТД=НайденнаяСтрокаГТД.ГТД;
					КонецЕсли;
				КонецЕсли;
				
				Сумма = 0;
				СуммаНДС = 0;
				СуммаВсего = 0;
				Количество = 0;
				
				Пока ВыборкаСтрока.Следующий() Цикл
					Сумма = Сумма + ВыборкаСтрока.Сумма;
					СуммаНДС = СуммаНДС + ВыборкаСтрока.СуммаНДС;
					СуммаВсего = СуммаВсего + ВыборкаСтрока.СуммаВсего;
					Количество = Количество + ВыборкаСтрока.Количество;
				КонецЦикла;
				
				НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего + СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.Сумма = обПересчет(НоваяСтрока.Сумма + Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.Цена = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС + СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				
				// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
				НоваяСтрока.НомерСтроки = Результат.Количество();
				
				// Заполнение доп. полей
				НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнениеДаннымиАвтомобиля(ДокументОснование, Результат);
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.РеализацияАвтомобилей
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.СчетНаОплатуЗаАвтомобили
		ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВозвратОтПокупателяАвтомобилей Тогда
		
		ИмяДокументаОснования = МетаданныеДокументаОснования.Имя;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	"+ИмяДокументаОснования+"Автомобили.НомерСтроки КАК НомерСтроки,
		|	"+ИмяДокументаОснования+"Автомобили.Автомобиль КАК Номенклатура,
		|	"+ИмяДокументаОснования+"Автомобили.ИдентификаторАвтомобиля КАК ИдентификаторАвтомобиля,
		|	"+ИмяДокументаОснования+"Автомобили.Количество,
		|	"+ИмяДокументаОснования+"Автомобили.Цена,
		|	"+ИмяДокументаОснования+"Автомобили.Сумма,
		|	"+ИмяДокументаОснования+"Автомобили.СтавкаНДС,
		|	"+ИмяДокументаОснования+"Автомобили.СуммаНДС,
		|	"+ИмяДокументаОснования+"Автомобили.ПроцентСкидки,
		|	"+ИмяДокументаОснования+"Автомобили.СуммаСкидки,
		|	"+ИмяДокументаОснования+"Автомобили.СуммаВсего,
		|	"+ИмяДокументаОснования+"Автомобили.СебестоимостьАвтомобиля,
		|	""VIN "" + "+ИмяДокументаОснования+"Автомобили.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		|	0 КАК СуммаСкидкиСтроки
		|ИЗ
		|	Документ."+ИмяДокументаОснования+".Автомобили КАК "+ИмяДокументаОснования+"Автомобили
		|ГДЕ
		|	"+ИмяДокументаОснования+"Автомобили.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	"+ИмяДокументаОснования+"Товары.НомерСтроки,
		|	"+ИмяДокументаОснования+"Товары.Номенклатура,
		|	"+ИмяДокументаОснования+"Товары.ИдентификаторАвтомобиля,
		|	"+ИмяДокументаОснования+"Товары.Количество,
		|	"+ИмяДокументаОснования+"Товары.Цена,
		|	"+ИмяДокументаОснования+"Товары.Сумма,
		|	"+ИмяДокументаОснования+"Товары.СтавкаНДС,
		|	"+ИмяДокументаОснования+"Товары.СуммаНДС,
		|	"+ИмяДокументаОснования+"Товары.ПроцентСкидки,
		|	"+ИмяДокументаОснования+"Товары.СуммаСкидки,
		|	"+ИмяДокументаОснования+"Товары.СуммаВсего,
		|	0,
		|	NULL,
		|	"+ИмяДокументаОснования+"Товары.СуммаСкидкиСтроки
		|ИЗ
		|	Документ."+ИмяДокументаОснования+".Товары КАК "+ИмяДокументаОснования+"Товары
		|ГДЕ
		|	"+ИмяДокументаОснования+"Товары.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	ИдентификаторАвтомобиля";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если МетаданныеДокументаОснования = Метаданные.Документы.СчетНаОплатуЗаАвтомобили Тогда
			Если НЕ обЗначениеНеЗаполнено(ДокументОснование.ДокументОснование) И
				ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
				ТаблицаГТД = РегистрыНакопления.ОстаткиАвтомобилей.ПолучитьГТДАвтомобилей(ДокументОснование.ДокументОснование);
			Иначе
				ТаблицаГТД = Неопределено;
			КонецЕсли;
		Иначе
			ТаблицаГТД = РегистрыНакопления.ОстаткиАвтомобилей.ПолучитьГТДАвтомобилей(ДокументОснование);
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			
			ВыборкаСтрока = Выборка.Выбрать();
			
			Если ВыборкаСтрока.Следующий() Тогда
				
				НоваяСтрока = Результат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
				НоваяСтрока.Автомобиль = ВыборкаСтрока.Номенклатура;
				НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
				НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
				Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
					НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
				КонецЕсли;
				НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
				НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
				НоваяСтрока.Количество = 1;
				
				Если НЕ ТаблицаГТД = Неопределено Тогда
					НайденнаяСтрокаГТД = ТаблицаГТД.Найти(ВыборкаСтрока.Номенклатура, "Автомобиль");
					Если НЕ НайденнаяСтрокаГТД = Неопределено Тогда
						НоваяСтрока.ГТД=НайденнаяСтрокаГТД.ГТД;
					КонецЕсли;
				КонецЕсли;
				
				Сумма = 0;
				СуммаНДС = 0;
				СуммаСкидки = 0;
				СуммаСкидкиСтроки = 0;
				СуммаВсего = 0;
				Количество = 0;
				
				Пока ВыборкаСтрока.Следующий() Цикл
					Сумма = Сумма + ВыборкаСтрока.Сумма;
					СуммаНДС = СуммаНДС + ВыборкаСтрока.СуммаНДС;
					СуммаСкидки = СуммаСкидки + ВыборкаСтрока.СуммаСкидки;
					СуммаСкидкиСтроки = СуммаСкидкиСтроки + ВыборкаСтрока.СуммаСкидкиСтроки;
					СуммаВсего = СуммаВсего + ВыборкаСтрока.СуммаВсего;
					Количество = Количество + ВыборкаСтрока.Количество;
				КонецЦикла;
				
				НоваяСтрока.СуммаСкидки = обПересчет(НоваяСтрока.СуммаСкидки + СуммаСкидки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего + СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаСкидкиСтроки = обПересчет(НоваяСтрока.СуммаСкидкиСтроки + СуммаСкидкиСтроки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				Если (НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки + НоваяСтрока.СуммаСкидкиСтроки) <> 0 Тогда
					НоваяСтрока.ПроцентСкидки = (1-(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки)/(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки + НоваяСтрока.СуммаСкидкиСтроки))*100;
					НоваяСтрока.ПроцентСкидкиСтроки = (1-(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидки)/(НоваяСтрока.СуммаВсего + НоваяСтрока.СуммаСкидкиСтроки + НоваяСтрока.СуммаСкидки))*100;
				КонецЕсли;
				НоваяСтрока.Сумма = обПересчет(НоваяСтрока.Сумма + Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.Цена = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС + СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				
				// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
				НоваяСтрока.НомерСтроки = Результат.Количество();
				
				// Заполнение доп. полей
				НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнениеДаннымиАвтомобиля(ДокументОснование, Результат);
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ПоступлениеАвтомобилей 
			ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.ВводОстатковАвтомобилей
			ИЛИ МетаданныеДокументаОснования = Метаданные.Документы.СчетОтПоставщикаЗаАвтомобили Тогда
		
		ИмяДокументаОснования = МетаданныеДокументаОснования.Имя;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ПоступлениеАвтомобилейАвтомобили.ИдентификаторАвтомобиля,
		               |	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
		               |	ПоступлениеАвтомобилейАвтомобили.Цена,
		               |	ПоступлениеАвтомобилейАвтомобили.Сумма,
		               |	ПоступлениеАвтомобилейАвтомобили.СтавкаНДС,
		               |	ПоступлениеАвтомобилейАвтомобили.СуммаНДС,
		               |	""VIN "" + ПоступлениеАвтомобилейАвтомобили.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		               |	ПоступлениеАвтомобилейАвтомобили.СуммаВсего,
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка
		               |ПОМЕСТИТЬ АвтомобилиПоступления
		               |ИЗ
		               |	Документ."+ИмяДокументаОснования+".Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		               |ГДЕ
		               |	ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	АвтомобилиПоступления.ИдентификаторАвтомобиля,
		               |	АвтомобилиПоступления.Номенклатура,
		               |	АвтомобилиПоступления.Сумма + ЕСТЬNULL(ПоступлениеАвтомобилейОпции.Сумма, 0) КАК Сумма,
		               |	АвтомобилиПоступления.СуммаНДС + ЕСТЬNULL(ПоступлениеАвтомобилейОпции.СуммаНДС, 0) КАК СуммаНДС,
		               |	АвтомобилиПоступления.ХарактеристикаНоменклатуры,
		               |	АвтомобилиПоступления.СуммаВсего + ЕСТЬNULL(ПоступлениеАвтомобилейОпции.СуммаВсего, 0) КАК СуммаВсего
		               |ИЗ
		               |	АвтомобилиПоступления КАК АвтомобилиПоступления
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ."+ИмяДокументаОснования+".Опции КАК ПоступлениеАвтомобилейОпции
		               |		ПО АвтомобилиПоступления.ИдентификаторАвтомобиля = ПоступлениеАвтомобилейОпции.ИдентификаторАвтомобиля
		               |			И АвтомобилиПоступления.Ссылка = ПоступлениеАвтомобилейОпции.Ссылка";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ВыборкаСтрока = Запрос.Выполнить().Выбрать();
		
		Если МетаданныеДокументаОснования = Метаданные.Документы.ПоступлениеАвтомобилей Тогда
			ТаблицаГТД = РегистрыНакопления.ОстаткиАвтомобилей.ПолучитьГТДАвтомобилей(ДокументОснование);
		ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.СчетОтПоставщикаЗаАвтомобили
			И НЕ обЗначениеНеЗаполнено(ДокументОснование.ДокументОснование)
			И ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
			ТаблицаГТД = РегистрыНакопления.ОстаткиАвтомобилей.ПолучитьГТДАвтомобилей(ДокументОснование.ДокументОснование);
		Иначе
			ТаблицаГТД = Неопределено;
		КонецЕсли;
		
		Пока ВыборкаСтрока.Следующий() Цикл
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
			НоваяСтрока.Автомобиль = ВыборкаСтрока.Номенклатура;
			НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
			НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
			Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
				НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество = 1;
			
			НоваяСтрока.СуммаВсего = обПересчет(ВыборкаСтрока.СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаНДС   = обПересчет(ВыборкаСтрока.СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Сумма      = обПересчет(ВыборкаСтрока.Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Цена       = НоваяСтрока.Сумма / НоваяСтрока.Количество;
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
			Если НЕ ТаблицаГТД = Неопределено Тогда
				НайденнаяСтрокаГТД = ТаблицаГТД.Найти(ВыборкаСтрока.Номенклатура, "Автомобиль");
				Если НЕ НайденнаяСтрокаГТД = Неопределено Тогда
					НоваяСтрока.ГТД=НайденнаяСтрокаГТД.ГТД;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаполнениеДаннымиАвтомобиля(ДокументОснование, Результат);
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказПоставщикуНаАвтомобиль Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	NULL КАК НомерСтроки,
		|	ЗаказПоставщикуНаАвтомобиль.Автомобиль КАК Номенклатура,
		|	1 КАК Количество,
		|	ЗаказПоставщикуНаАвтомобиль.ЦенаАвтомобиля КАК Цена,
		|	ЗаказПоставщикуНаАвтомобиль.ЦенаАвтомобиля КАК Сумма,
		|	ЗаказПоставщикуНаАвтомобиль.СтавкаНДСНаАвтомобиль КАК СтавкаНДС,
		|	ЗаказПоставщикуНаАвтомобиль.СуммаНДСНаАвтомобиль КАК СуммаНДС,
		|	""VIN "" + ЗаказПоставщикуНаАвтомобиль.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		|	ЗаказПоставщикуНаАвтомобиль.СуммаВсегоНаАвтомобиль КАК СуммаВсего
		|ИЗ
		|	Документ.ЗаказПоставщикуНаАвтомобиль КАК ЗаказПоставщикуНаАвтомобиль
		|ГДЕ
		|	ЗаказПоставщикуНаАвтомобиль.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказПоставщикуНаАвтомобильОпции.НомерСтроки,
		|	ЗаказПоставщикуНаАвтомобильОпции.Опция,
		|	ЗаказПоставщикуНаАвтомобильОпции.Количество,
		|	ЗаказПоставщикуНаАвтомобильОпции.Цена,
		|	ЗаказПоставщикуНаАвтомобильОпции.Сумма,
		|	ЗаказПоставщикуНаАвтомобильОпции.СтавкаНДС,
		|	ЗаказПоставщикуНаАвтомобильОпции.СуммаНДС,
		|	"""",
		|	ЗаказПоставщикуНаАвтомобильОпции.СуммаВсего
		|ИЗ
		|	Документ.ЗаказПоставщикуНаАвтомобиль.Опции КАК ЗаказПоставщикуНаАвтомобильОпции
		|ГДЕ
		|	ЗаказПоставщикуНаАвтомобильОпции.Ссылка = &Ссылка";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ВыборкаСтрока = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаСтрока.Следующий() Тогда
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
			НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
			НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
			Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
				НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.Количество = 1;
			
			Сумма = 0;
			СуммаНДС = 0;
			СуммаВсего = 0;
			
			Пока ВыборкаСтрока.Следующий() Цикл
				Сумма = Сумма + ВыборкаСтрока.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрока.СуммаНДС;
				СуммаВсего = СуммаВсего + ВыборкаСтрока.СуммаВсего;
			КонецЦикла;
			
			НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего + СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Сумма = обПересчет(НоваяСтрока.Сумма + Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Цена = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС + СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ЗаказНаАвтомобиль Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	NULL КАК НомерСтроки,
		|	ЗаказНаАвтомобиль.Автомобиль КАК Номенклатура,
		|	1 КАК Количество,
		|	ЗаказНаАвтомобиль.ЦенаАвтомобиля КАК Цена,
		|	ЗаказНаАвтомобиль.ЦенаАвтомобиля КАК Сумма,
		|	ЗаказНаАвтомобиль.СтавкаНДСНаАвтомобиль КАК СтавкаНДС,
		|	ЗаказНаАвтомобиль.СуммаНДСНаАвтомобиль КАК СуммаНДС,
		|	""VIN "" + ЗаказНаАвтомобиль.Автомобиль.VIN КАК ХарактеристикаНоменклатуры,
		|	ЗаказНаАвтомобиль.СуммаВсегоНаАвтомобиль КАК СуммаВсего
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаАвтомобильОпции.НомерСтроки,
		|	ЗаказНаАвтомобильОпции.Опция,
		|	ЗаказНаАвтомобильОпции.Количество,
		|	ЗаказНаАвтомобильОпции.Цена,
		|	ЗаказНаАвтомобильОпции.Сумма,
		|	ЗаказНаАвтомобильОпции.СтавкаНДС,
		|	ЗаказНаАвтомобильОпции.СуммаНДС,
		|	"""",
		|	ЗаказНаАвтомобильОпции.СуммаВсего
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль.Опции КАК ЗаказНаАвтомобильОпции
		|ГДЕ
		|	ЗаказНаАвтомобильОпции.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаАвтомобильТовары.НомерСтроки,
		|	ЗаказНаАвтомобильТовары.Номенклатура,
		|	ЗаказНаАвтомобильТовары.Количество * ЗаказНаАвтомобильТовары.Коэффициент,
		|	ЗаказНаАвтомобильТовары.Цена,
		|	ЗаказНаАвтомобильТовары.Сумма,
		|	ЗаказНаАвтомобильТовары.СтавкаНДС,
		|	ЗаказНаАвтомобильТовары.СуммаНДС,
		|	ЗаказНаАвтомобильТовары.ХарактеристикаНоменклатуры,
		|	ЗаказНаАвтомобильТовары.СуммаВсего
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль.Товары КАК ЗаказНаАвтомобильТовары";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ВыборкаСтрока = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаСтрока.Следующий() Тогда
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСтрока);
			Если НЕ ТипЗнч(Выборка.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				НоваяСтрока.Номенклатура = обПолучитьЗначениеСвойства(ВыборкаСтрока.Номенклатура, "Номенклатура", Справочники.Номенклатура.Автомобиль);
				НоваяСтрока.Номенклатура = ?(ЗначениеЗаполнено(НоваяСтрока.Номенклатура), НоваяСтрока.Номенклатура, Справочники.Номенклатура.Автомобиль);
				Если НоваяСтрока.ХарактеристикаНоменклатуры = "VIN " Тогда
					НоваяСтрока.ХарактеристикаНоменклатуры = "VIN <Не задан>";
				КонецЕсли;
				НоваяСтрока.Количество = 1;
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
			НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
			
			Сумма = 0;
			СуммаНДС = 0;
			СуммаВсего = 0;
			
			Пока ВыборкаСтрока.Следующий() Цикл
				Сумма = Сумма + ВыборкаСтрока.Сумма;
				СуммаНДС = СуммаНДС + ВыборкаСтрока.СуммаНДС;
				СуммаВсего = СуммаВсего + ВыборкаСтрока.СуммаВсего;
			КонецЦикла;
			
			НоваяСтрока.СуммаВсего = обПересчет(НоваяСтрока.СуммаВсего + СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Сумма = обПересчет(НоваяСтрока.Сумма + Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.Цена = обПересчет(НоваяСтрока.Сумма / НоваяСтрока.Количество, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			НоваяСтрока.СуммаНДС = обПересчет(НоваяСтрока.СуммаНДС + СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
		Возврат ?(Результат.Количество()=0, Неопределено, Результат);
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.АктРазногласий Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	АктРазногласийТовары.НомерСтроки,
		               |	АктРазногласийТовары.Номенклатура,
		               |	АктРазногласийТовары.ХарактеристикаНоменклатуры,
		               |	АктРазногласийТовары.Количество,
		               |	АктРазногласийТовары.Коэффициент,
		               |	АктРазногласийТовары.ЕдиницаИзмерения,
		               |	АктРазногласийТовары.Цена,
		               |	АктРазногласийТовары.Сумма,
		               |	АктРазногласийТовары.СтавкаНДС,
		               |	АктРазногласийТовары.СуммаНДС,
		               |	АктРазногласийТовары.ПроцентСкидки,
		               |	АктРазногласийТовары.ПроцентСкидкиСтроки,
		               |	АктРазногласийТовары.СуммаСкидки,
		               |	АктРазногласийТовары.СуммаСкидкиСтроки,
		               |	АктРазногласийТовары.СуммаВсего
		               |ИЗ
		               |	Документ.АктРазногласий.Товары КАК АктРазногласийТовары
		               |ГДЕ
		               |	АктРазногласийТовары.Ссылка = &Ссылка
		               |	И АктРазногласийТовары.Подтверждение
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	АктРазногласийРаботы.НомерСтроки,
		               |	ЗНАЧЕНИЕ(Справочник.Номенклатура.Авторабота),
		               |	АктРазногласийРаботы.Работа.Наименование,
		               |	АктРазногласийРаботы.Количество,
		               |	АктРазногласийРаботы.Коэффициент,
		               |	АктРазногласийРаботы.Работа.Номенклатура.ОсновнаяЕдиницаИзмерения,
		               |	АктРазногласийРаботы.Цена,
		               |	АктРазногласийРаботы.Сумма,
		               |	АктРазногласийРаботы.СтавкаНДС,
		               |	АктРазногласийРаботы.СуммаНДС,
		               |	АктРазногласийРаботы.ПроцентСкидки,
		               |	АктРазногласийРаботы.ПроцентСкидкиСтроки,
		               |	АктРазногласийРаботы.СуммаСкидки,
		               |	АктРазногласийРаботы.СуммаСкидкиСтроки,
		               |	АктРазногласийРаботы.СуммаВсего
		               |ИЗ
		               |	Документ.АктРазногласий.Работы КАК АктРазногласийРаботы
		               |ГДЕ
		               |	АктРазногласийРаботы.Ссылка = &Ссылка
		               |	И АктРазногласийРаботы.Подтверждение";
		
	ИначеЕсли МетаданныеДокументаОснования = Метаданные.Документы.ТаможеннаяДекларацияИмпорт Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТаможеннаяДекларацияИмпортТовары.НомерСтроки,
		               |	ТаможеннаяДекларацияИмпортТовары.Номенклатура,
		               |	ТаможеннаяДекларацияИмпортТовары.ХарактеристикаНоменклатуры,
		               |	ТаможеннаяДекларацияИмпортТовары.ЕдиницаИзмерения,
		               |	ТаможеннаяДекларацияИмпортТовары.Коэффициент,
		               |	ТаможеннаяДекларацияИмпортТовары.Количество,
		               |	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины,
		               |	ТаможеннаяДекларацияИмпортТовары.СуммаНДС,
		               |	ТаможеннаяДекларацияИмпортТовары.СуммаПошлины + ТаможеннаяДекларацияИмпортТовары.СуммаНДС КАК СуммаВсего,
		               |	ТаможеннаяДекларацияИмпортРазделы.СтавкаНДС
		               |ИЗ
		               |	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
		               |		ПО ТаможеннаяДекларацияИмпортТовары.Ссылка = ТаможеннаяДекларацияИмпортРазделы.Ссылка
		               |			И ТаможеннаяДекларацияИмпортТовары.НомерРаздела = ТаможеннаяДекларацияИмпортРазделы.НомерРаздела
		               |ГДЕ
		               |	ТаможеннаяДекларацияИмпортТовары.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТаможеннаяДекларацияИмпортАвтомобили.НомерСтроки,
		               |	ТаможеннаяДекларацияИмпортАвтомобили.Автомобиль,
		               |	""VIN"" + ТаможеннаяДекларацияИмпортАвтомобили.Автомобиль.VIN,
		               |	ВЫРАЗИТЬ(ЗНАЧЕНИЕ(Справочник.Номенклатура.Автомобиль) КАК Справочник.Номенклатура).ОсновнаяЕдиницаИзмерения,
		               |	1,
		               |	1,
		               |	ТаможеннаяДекларацияИмпортАвтомобили.СуммаПошлины,
		               |	ТаможеннаяДекларацияИмпортАвтомобили.СуммаНДС,
		               |	ТаможеннаяДекларацияИмпортАвтомобили.СуммаПошлины + ТаможеннаяДекларацияИмпортАвтомобили.СуммаНДС,
		               |	ТаможеннаяДекларацияИмпортРазделы.СтавкаНДС
		               |ИЗ
		               |	Документ.ТаможеннаяДекларацияИмпорт.Автомобили КАК ТаможеннаяДекларацияИмпортАвтомобили
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
		               |		ПО ТаможеннаяДекларацияИмпортАвтомобили.Ссылка = ТаможеннаяДекларацияИмпортРазделы.Ссылка
		               |			И ТаможеннаяДекларацияИмпортАвтомобили.НомерРаздела = ТаможеннаяДекларацияИмпортРазделы.НомерРаздела
		               |ГДЕ
		               |	ТаможеннаяДекларацияИмпортАвтомобили.Ссылка = &Ссылка";
		
	Иначе
		
		//Если не ТипЗнч(ДокументОснование)= Тип("ДокументСсылка.БТ_ПредоплаченноеТО") тогда //ЧалапАЮ БизТех 20.08.2024
			РеквизитыТабличнойЧастиДокументаОснования = МетаданныеДокументаОснования.ТабличныеЧасти.Товары.Реквизиты;
			ИмяДокументаОснования = МетаданныеДокументаОснования.Имя;
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	"+ИмяДокументаОснования+"Товары.НомерСтроки,
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Номенклатура")               = Неопределено, "", ИмяДокументаОснования+"Товары.Номенклатура,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Количество")                 = Неопределено, "", ИмяДокументаОснования+"Товары.Количество,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ЕдиницаИзмерения")           = Неопределено, "", ИмяДокументаОснования+"Товары.ЕдиницаИзмерения,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Коэффициент")                = Неопределено, "", ИмяДокументаОснования+"Товары.Коэффициент,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Цена")                       = Неопределено, "", ИмяДокументаОснования+"Товары.Цена,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Сумма")                      = Неопределено, "", ИмяДокументаОснования+"Товары.Сумма,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ПроцентСкидки")              = Неопределено, "", ИмяДокументаОснования+"Товары.ПроцентСкидки,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаСкидки")                = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаСкидки,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СкидкаНаТовар")              = Неопределено, "", ИмяДокументаОснования+"Товары.СкидкаНаТовар,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ПроцентСкидкиСтроки")        = Неопределено, "", ИмяДокументаОснования+"Товары.ПроцентСкидкиСтроки,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаСкидкиСтроки")          = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаСкидкиСтроки,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СтавкаНДС")                  = Неопределено, "", ИмяДокументаОснования+"Товары.СтавкаНДС,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаНДС")                   = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаНДС,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ХарактеристикаНоменклатуры") = Неопределено, "", ИмяДокументаОснования+"Товары.ХарактеристикаНоменклатуры,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("МестоРазмещения")            = Неопределено, "", ИмяДокументаОснования+"Товары.МестоРазмещения,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Подарок")                    = Неопределено, "", ИмяДокументаОснования+"Товары.Подарок,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Набор")                      = Неопределено, "", ИмяДокументаОснования+"Товары.Набор,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("Платеж")                     = Неопределено, "", ИмяДокументаОснования+"Товары.Платеж,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("НомерПлатежа")               = Неопределено, "", ИмяДокументаОснования+"Товары.НомерПлатежа,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаСкидкиБонусами")        = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаСкидкиБонусами,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("ГТД")      				  = Неопределено, "", ИмяДокументаОснования+"Товары.ГТД,")+"
			|	"+?(РеквизитыТабличнойЧастиДокументаОснования.Найти("СуммаВсего")                 = Неопределено, "", ИмяДокументаОснования+"Товары.СуммаВсего")+"
			|ИЗ
			|	Документ."+ИмяДокументаОснования+".Товары КАК "+ИмяДокументаОснования+"Товары
			|ГДЕ
			|	"+ИмяДокументаОснования+"Товары.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	"+ИмяДокументаОснования+"Товары.НомерСтроки";
		//КОнецЕсли;
	КонецЕсли;
	Если не ТипЗнч(ДокументОснование)= Тип("ДокументСсылка.БТ_ПредоплаченноеТО") тогда //ЧалапАЮ БизТех 20.08.2024

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
		
		ДоговорКомиссионера = Неопределено;
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров")
			И ДокументОснование.ХоЗоперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
			ДоговорКомиссионера = ДокументОснование.ДоговорВзаиморасчетов;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.СчетОтПоставщика")
			И НЕ обЗначениеНеЗаполнено(ДокументОснование.ДокументОснование)
			И ТипЗнч(ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров")
			И ДокументОснование.ДокументОснование.ХоЗоперация = Справочники.ХозОперации.ПоступлениеТоваровКомиссия Тогда
			ДоговорКомиссионера = ДокументОснование.ДокументОснование.ДоговорВзаиморасчетов;
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Коэффициент) Тогда
				НоваяСтрока.Коэффициент = 1;
			КонецЕсли;
			
			Если ЕстьВалютаДокументаОснования Тогда
				НоваяСтрока.Цена                = обПересчет(НоваяСтрока.Цена, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.Сумма               = обПересчет(НоваяСтрока.Сумма, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаНДС            = обПересчет(НоваяСтрока.СуммаНДС, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаСкидки         = обПересчет(НоваяСтрока.СуммаСкидки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаВсего          = обПересчет(НоваяСтрока.СуммаВсего, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаСкидкиСтроки   = обПересчет(НоваяСтрока.СуммаСкидкиСтроки, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
				НоваяСтрока.СуммаСкидкиБонусами = обПересчет(НоваяСтрока.СуммаСкидкиБонусами, ВалютаДокументаОснования, КурсДокументаОснования, ВалютаДокумента, КурсДокумента);
			КонецЕсли;
			
			// так как автоработы номеруются так же, как и товары, то будем заполнять номер строки сквозной нумерацией
			НоваяСтрока.НомерСтроки = Результат.Количество();
			
			// Заполнение доп. полей
			НоваяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			
			Если НЕ ДоговорКомиссионера = Неопределено Тогда
				НоваяСтрока.ДоговорВзаиморасчетов = ДоговорКомиссионера;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	Возврат ?(Результат.Количество()=0, Неопределено, Результат);
	
КонецФункции

// Процедура заполнения дополнительной информацей об автомобиле.
//
Процедура ЗаполнениеДаннымиАвтомобиля(Основание, ТаблицаТоваров)
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(
		Новый Структура("Автомобиль", Справочники.Автомобили.ПустаяСсылка()));
	
	Если НайденныеСтроки.Количество() = ТаблицаТоваров.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили")
		И ТаблицаТоваров.Колонки.Найти("ДокументПередачи") <> Неопределено Тогда
		
		Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
			
			ДоговораКомиссии = дкЗаполнитьДоговорКомисси(
				?(ЗначениеЗаполнено(ТекущаяСтрока.ДокументПередачи), ТекущаяСтрока.ДокументПередачи, Основание),
				ТекущаяСтрока.Автомобиль);
			ДоговорКомиссии = ДоговораКомиссии.Получить(ТекущаяСтрока.Автомобиль);
			Если НЕ ДоговорКомиссии = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДоговорКомиссии);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуЗаАвтомобили")
		И ТаблицаТоваров.Колонки.Найти("ДокументПоступления") <> Неопределено Тогда
		
		Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
			
			ДоговораКомиссии = дкЗаполнитьДоговорКомисси(
				?(ЗначениеЗаполнено(ТекущаяСтрока.ДокументПоступления), ТекущаяСтрока.ДокументПоступления, Основание),
				ТекущаяСтрока.Автомобиль);
			ДоговорКомиссии = ДоговораКомиссии.Получить(ТекущаяСтрока.Автомобиль);
			Если НЕ ДоговорКомиссии = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДоговорКомиссии);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	МассивТиповСчетов = Новый Массив;
	МассивТиповСчетов.Добавить(Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили"));
	МассивТиповСчетов.Добавить(Тип("ДокументСсылка.СчетОтПоставщикаЗаАвтомобили"));
	
	СделкаОснования = Неопределено;
	Если МассивТиповСчетов.Найти(ТипЗнч(Основание)) <> Неопределено Тогда
		СделкаОснования = Основание.ДокументОснование;
	КонецЕсли;
	
	// Заполнение договора комиссионера.
	ДоговораКомиссии = дкЗаполнитьДоговорКомисси(
		?(ЗначениеЗаполнено(СделкаОснования), СделкаОснования, Основание),
		ТаблицаТоваров.ВыгрузитьКолонку("Автомобиль"));
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		ДоговорКомиссии = ДоговораКомиссии.Получить(ТекущаяСтрока.Автомобиль);
		Если НЕ ДоговорКомиссии = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДоговорКомиссии);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнениеДаннымиАвтомобиля()


// Очищает реквизиты документа, которые нельзя заполнять при вводе на основании/копировании
//
Процедура ОчиститьРеквизитыФискальногоРегистратора(Объект = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.Выписка") Тогда
		Объект.КассаККМ   = Справочники.КассыККМ.ПустаяСсылка();
	КонецЕсли;
	
	Объект.ФР              = Справочники.Оборудование.ПустаяСсылка();
	Объект.ДатаФР          = Дата("00010101");
	Объект.НомерСмены      = 0;
	Объект.НомерЧека       = 0;
	Объект.НомерДокумента  = 0;
	
КонецПроцедуры // ОчиститьРеквизитыФискальногоРегистратора()

#КонецОбласти
