// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	//Заполним предопределенные элементы
	
	ОбъектСправочника=Справочники.ВидыОтметокВремени.Работа.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Цвет.Получить()=Неопределено Тогда
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Зеленый);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыОтметокВремени.Простой.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Цвет.Получить()=Неопределено Тогда
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.Желтый);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбъектСправочника=Справочники.ВидыОтметокВремени.ОтклонениеОтПлана.ПолучитьОбъект();
	Если ЗаполнятьВсе ИЛИ ОбъектСправочника.Цвет.Получить()=Неопределено Тогда
		ОбъектСправочника.Цвет=Новый ХранилищеЗначения(WebЦвета.ОранжевоКрасный);
		ОбъектСправочника.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектСправочника.Записать();
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
