// Модуль документа Списание кодов маркировки


////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Процедура ЗаполнитьТабличнуюЧастьТоваровПоОснованию(Основание, ВидОснования, НаименованиеДокумента)
	
	Товары.Очистить();
	
	ВидПервичногоДокумента = ВидОснования;
	НомерПервичногоДокумента = Основание.Номер;
	ДатаПервичногоДокумента = Основание.Дата;
	НаименованиеПервичногоДокумента = НаименованиеДокумента;
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	// Найдем ноенклатуру, у которой не отсканировали код
	Для Каждого ТекущаяСтрока Из Основание.Товары Цикл
		
		Если НЕ ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		
		НайденныеСтроки = Основание.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
			
			НоваяСтрока = Товары.Добавить();
			
			НоваяСтрока.КодМаркировки = ТекущаяМаркировка.КодМаркировки;
			НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
			ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",1);
	ОбязательныеТовары.Вставить("КодМаркировки",3);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("Статус",1);
	ОбязательныеРеквизиты.Вставить("ВидВозврата",1);
	ОбязательныеРеквизиты.Вставить("ДатаПервичногоДокумента",1);
	ОбязательныеРеквизиты.Вставить("НомерПервичногоДокумента",1);
	ОбязательныеРеквизиты.Вставить("ВидПервичногоДокумента",1);
	
	Если ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		ОбязательныеРеквизиты.Вставить("НаименованиеПервичногоДокумента",1);
	КонецЕсли;
	
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	ОбязательныеРеквизиты.Вставить("ТоварнаяГруппа",1);
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее
			И НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПервичногоДокумента) Тогда
			дкДобавитьОшибку(Ошибки, "Товары. Строка "+ ТекущаяСтрока.НомерСтроки + ": Необходимо заполнить наименование первичного документа.");
			Результат = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Результат И дкПроверитьСоответствиеНоменклатурыТоварнойГруппе(ЭтотОбъект,,, Ошибки);
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ВозвратВОборотКодовМаркировки", "Возврат в оборот кодов маркировки", Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события установки нового номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыВозвратаВОборот.Новый;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.Чек") Тогда
		
		Если Основание.Хозоперация <> Справочники.ХозОперации.ЧекНаВозврат Тогда
			#Если Клиент Тогда
				Сообщить("Возврат в оборот доступен только при вводе на основании чека на возврат.", СтатусСообщения.Внимание);
			#КонецЕсли
			Основание=Неопределено;
			ДокументОснование=Неопределено;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
		ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
		
		ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
			Основание,
			Перечисления.ВидыПервичныхДокументов.КассовыйЧек,
			"Чек на возврат");
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		
		ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
		
		ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
			Основание,
			Перечисления.ВидыПервичныхДокументов.Прочее,
			"Возврат от покупателя");
			
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации;
		
		Товары.Очистить();
		
		ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее;
		НомерПервичногоДокумента = Основание.Номер;
		ДатаПервичногоДокумента = Основание.Дата;
		НаименованиеПервичногоДокумента = "Корректировка реализации";
		
		// Заполним ТЧ Товары только теми товарами, которые на уменьшение и не указаны коды
		СтруктураПоиска = Новый Структура("ИдентификаторТовара");
		СтруктураПоиска.Вставить("Возврат", Истина);
		Для Каждого ТекущаяСтрока Из Основание.Товары Цикл
			
			// Проверим, что количество возвратов совпадает с количеством разницы
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
			НайденныеСтроки = Основание.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ТекущаяСтрокаМаркировки Из НайденныеСтроки Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.КодМаркировки = ТекущаяСтрокаМаркировки.КодМаркировки;
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				
				НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
				НоваяСтрока.НомерПервичногоДокумента = НомерПервичногоДокумента;
				НоваяСтрока.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
				НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеПервичногоДокумента;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ТоварнаяГруппа) Тогда
		ТоварнаяГруппа = дкТоварнаяГруппа(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	Статус = Перечисления.СтатусыВозвратаВОборот.Новый;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Для Каждого Строка Из Товары Цикл
		ОбъектШК.РазобратьСтрокуШтрихкодаGS1(Строка.КодМаркировки, Истина);
	КонецЦикла;
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Если НЕ Отказ Тогда
		орЖурналСостояний(Ссылка, Статус);
	КонецЕсли;

КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	// Удалим введенные в оборот коды маркировки
	НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	Если НЕ Отказ И Статус = Перечисления.СтатусыВозвратаВОборот.Выполнен Тогда
		
		ТаблицаМаркировки = Товары.Выгрузить();
		ТаблицаМаркировки.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ТаблицаМаркировки.Колонки.Добавить("СерийныйНомер", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		
		ОбъектШК = Обработки.ШтрихКоды.Создать();
		
		// Разберем маркировку на состовляющие для поиска
		Для Каждого ТекущийКодМаркировки Из ТаблицаМаркировки Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущийКодМаркировки.КодМаркировки) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущийКодМаркировки.КодМаркировки);
			
			Если НЕ СтруктураМаркировки.Разобран Тогда
				Продолжить;
			КонецЕсли;
			
			ТекущийКодМаркировки.GTIN = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
			ТекущийКодМаркировки.СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
			
		КонецЦикла;
		
		ТекущиеСтатусыМаркировки = РегистрыСведений.СостоянияКодовМаркировки.ТекущиеСтатусыКодовМаркировки(ТаблицаМаркировки, МоментВремени());
		
		ВыведенныеТовары = Новый Массив;
		СостоянияВОбороте = Перечисления.СостоянияКодовМаркировки.СостоянияВводаВОборотМаркировки();
		
		Для Каждого ТекущаяСтрока Из ТекущиеСтатусыМаркировки Цикл
			Если СостоянияВОбороте.Найти(ТекущаяСтрока.Состояние) <> Неопределено Тогда
				ВыведенныеТовары.Добавить(ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекущаяСтрока Из ВыведенныеТовары Цикл
			ТекущиеСтатусыМаркировки.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
		// Изменим состояние маркировки, которые ранее не были выведены
		НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейСостоянияКодовМаркировки.Организация = Организация;
		НаборЗаписейСостоянияКодовМаркировки.РезультатЗапросаПоКодамМаркировки = ТекущиеСтатусыМаркировки;
		НаборЗаписейСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.ВведенВОборотПриВозврате;
		НаборЗаписейСостоянияКодовМаркировки.РежимПроведения = Режим;
		Отказ = НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() ИЛИ Отказ;
		
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
