
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  
	
	СуммаДокумента = Товары.Итог("Сумма") + работы.Итог("Сумма");
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхHaval.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхHaval КАК БТ_СопоставлениеДанныхHaval
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхHaval.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхHaval.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Бренд");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000045", Подразделение, Истина) Тогда
		
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение КАК Подразделение
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеПодразделенийChangan КАК БТ_СопоставлениеПодразделенийChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение = &Подразделение
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхChangan.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхChangan КАК БТ_СопоставлениеДанныхChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхChangan.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхChangan.Данные1С = &Данные1С
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта КАК ВидРемонта,
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ДанныеChangan КАК ДанныеChangan,
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ТипОплатыChangan КАК ТипОплатыChangan
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеВидовРемонтаChangan КАК БТ_СопоставлениеВидовРемонтаChangan
	                      |ГДЕ
	                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта = &ВидРемонта");
	Запрос.УстановитьПараметр("Тип", "Бренд");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);

	Пакет = Запрос.ВыполнитьПакет();
	
	//БИЗТЕХ КОВАЛЬ 11.02.2025 - Добавил проверку по виду ремонта
	Если Не Пакет[0].Пустой() и Не пакет[1].Пустой() И НЕ Пакет[2].пустой() и 
		БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000039", Подразделение, Истина) Тогда
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGeely.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGeely КАК БТ_СопоставлениеДанныхGeely
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGeely.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхGeely.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("ZAZ000002", Подразделение, Истина) Тогда 
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGAC.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхGAC.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой() 
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000056", Подразделение) Тогда
		
		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхAvatr.Период КАК Период
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхAvatr КАК БТ_СопоставлениеДанныхAvatr
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхAvatr.Тип = &Тип
	                      |	И БТ_СопоставлениеДанныхAvatr.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Модель");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
	
	Если Не Запрос.Выполнить().Пустой()
		И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("AVATR", Подразделение) Тогда

		НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
		НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Мен = РегистрыСведений.БТ_СопоставлениеДанныхЗаказНарядовЛайт.СоздатьМенеджерЗаписи();
			Мен.Период = ТекущаяДатаСеанса();
			Мен.Тип = "ЗаказНаряд";
			Мен.Данные1С = Ссылка;
			Мен.Записать();
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры
