// Возвращает соответствие имен "функциональных" подсистем и значения Истина.
// У "функциональной" подсистемы снят флажок "Включать в командный интерфейс".
//
Функция ИменаПодсистем() Экспорт
	
	ОтключенныеПодсистемы = Новый Соответствие;
	//ПриОпределенииОтключенныхПодсистем(ОтключенныеПодсистемы);
	
	Имена = Новый Соответствие;
	ВставитьИменаПодчиненныхПодсистем(Имена, Метаданные, ОтключенныеПодсистемы);
	
	Возврат Новый ФиксированноеСоответствие(Имена);
	
КонецФункции

Функция ПолучитьПараметрыПодключения(ВариантПараметровПодключения="CRM", Портал) Экспорт
	
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
		Справочник_ACPM = Справочники.АСРМ_НастройкиПодключения;
	ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда
		Справочник_ACPM = Справочники.АСРМ_НастройкиПодключенияУАЗ;
	КонецЕсли;
	СтруктураПараметров=новый Структура;
	
	Если ТипЗнч(ВариантПараметровПодключения)<>Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		ВариантПараметровПодключенияСсылка=Перечисления.АСРМ_ВариантыПараметровПодключения[ВариантПараметровПодключения];
	Иначе	
		ВариантПараметровПодключенияСсылка=ВариантПараметровПодключения;
	КонецЕсли;
	
	Если ВариантПараметровПодключенияСсылка=Перечисления.АСРМ_ВариантыПараметровПодключения.DSF Тогда
		СтруктураПараметров.Вставить("Адрес",Справочник_ACPM.АдресСайтаDSF.Значение);
		СтруктураПараметров.Вставить("Логин",Справочник_ACPM.ЛогинDSF.Значение);
		СтруктураПараметров.Вставить("Пароль",Справочник_ACPM.ПарольDSF.Значение);
		СтруктураПараметров.Вставить("КлючAPI",Справочник_ACPM.КлючAPI_DSF.Значение);
		СтруктураПараметров.Вставить("ИспользоватьHTTPS",Справочник_ACPM.ИспользоватьHTTPS_DSF.Значение);
	иначе
		СтруктураПараметров.Вставить("Адрес",Справочник_ACPM.АдресСайта.Значение);
		СтруктураПараметров.Вставить("Логин",Справочник_ACPM.Логин.Значение);
		СтруктураПараметров.Вставить("Пароль",Справочник_ACPM.Пароль.Значение);
		СтруктураПараметров.Вставить("КлючAPI",Справочник_ACPM.КлючAPI.Значение);
		СтруктураПараметров.Вставить("ИспользоватьHTTPS",Справочник_ACPM.ИспользоватьHTTPS.Значение);
	КонецЕсли;
	
	Возврат СтруктураПараметров;
КонецФункции

Процедура ВставитьИменаПодчиненныхПодсистем(Имена, РодительскаяПодсистема, ОтключенныеПодсистемы, ИмяРодительскойПодсистемы = "")
	
	Для Каждого ТекущаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		
		Если ТекущаяПодсистема.ВключатьВКомандныйИнтерфейс Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТекущейПодсистемы = ИмяРодительскойПодсистемы + ТекущаяПодсистема.Имя;
		Если ОтключенныеПодсистемы.Получить(ИмяТекущейПодсистемы) = Истина Тогда
			Продолжить;
		Иначе
			Имена.Вставить(ИмяТекущейПодсистемы, Истина);
		КонецЕсли;
		
		Если ТекущаяПодсистема.Подсистемы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ВставитьИменаПодчиненныхПодсистем(Имена, ТекущаяПодсистема, ОтключенныеПодсистемы, ИмяТекущейПодсистемы + ".");
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдентификаторЗначенияПеречисления(ЗначениеПеречисления)
	МетаданныеПеречисления=ЗначениеПеречисления.Метаданные();	
	
	Возврат МетаданныеПеречисления.ЗначенияПеречисления.Найти(ЗначениеПеречисления).Имя;
КонецФункции

Функция ПолучитьОбщийМодульПротоколаПодключения(ВариантНастроекПодключения) Экспорт
	Если ТипЗнч(ВариантНастроекПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		ТекВариант=ПолучитьИдентификаторЗначенияПеречисления(ВариантНастроекПодключения);
	Иначе
		ТекВариант=ВариантНастроекПодключения;
	КонецЕсли;
	
	Если ТекВариант="CRM" Тогда
		Возврат АСРМ_ОбщегоНазначенияСервер.ОбщийМодуль("АСРМ_СервисСРМ_ПротоколПодключения");
	Иначе
		Возврат АСРМ_ОбщегоНазначенияСервер.ОбщийМодуль("АСРМ_DSFОбщий_ПротоколПодключения");
	КонецЕсли;
КонецФункции


Функция ПолучитьОбщийМодульПротоколаПодключенияСервис(ВариантНастроекПодключения) Экспорт
	Если ТипЗнч(ВариантНастроекПодключения)=Тип("ПеречислениеСсылка.АСРМ_ВариантыПараметровПодключения") Тогда
		ТекВариант=ПолучитьИдентификаторЗначенияПеречисления(ВариантНастроекПодключения);
	Иначе
		ТекВариант=ВариантНастроекПодключения;
	КонецЕсли;
	
	Если ВариантНастроекПодключения="CRM" Тогда
		Возврат АСРМ_ОбщегоНазначенияСервер.ОбщийМодуль("АСРМ_СервисСРМ_ПротоколПодключения");
	Иначе
		Возврат АСРМ_ОбщегоНазначенияСервер.ОбщийМодуль("АСРМ_DSFСервис_ПротоколПодключения");
	КонецЕсли;
КонецФункции

