// Формирование причины обращения в виде строки
//
// Параметры
//  СтараяПричинаОбращения  - <Строка> - Старая причина обращения
//                 <продолжение описания параметра>
//  НоваяПричинаОбращения  - <ПричиныОбращений.Ссылка>,<Массив> - Новая причина обращения
//
// Возвращаемое значение:
//   <Строка>   - Новая причина обращения
//
Функция СформироватьПричинуОбращения(СтараяПричинаОбращения="",НоваяПричинаОбращения) Экспорт
	Если ТипЗнч(НоваяПричинаОбращения)=Тип("СправочникСсылка.ПричиныОбращений") Тогда
		МассивПричинОбращения=Новый Массив;
		МассивПричинОбращения.Добавить(НоваяПричинаОбращения);
	ИначеЕсли ТипЗнч(НоваяПричинаОбращения)=Тип("Массив") Тогда
		МассивПричинОбращения=НоваяПричинаОбращения;
	Иначе
		Возврат СтараяПричинаОбращения;
	КонецЕсли;
	Если МассивПричинОбращения.Количество()=0 Тогда
		Возврат СтараяПричинаОбращения;
	КонецЕсли; 
	НоваяПричинаОбращения=СокрЛП(СтараяПричинаОбращения);
	Для Сч=0 По МассивПричинОбращения.Количество()-1 Цикл
		ПричинаОбращения=МассивПричинОбращения[Сч];
		ПричинаОбращенияАртикул=СокрЛП(ПричинаОбращения.Артикул);
		ПричинаОбращенияПричинаОбращения=СокрЛП(ПричинаОбращения.ПричинаОбращения);
		Если НоваяПричинаОбращения <> "" Тогда 
			НоваяПричинаОбращения=НоваяПричинаОбращения+Символы.ВК;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ПричинаОбращенияАртикул) Тогда
			НоваяПричинаОбращения=НоваяПричинаОбращения+"["+ПричинаОбращенияАртикул+"] ";
		КонецЕсли;
		НоваяПричинаОбращения=НоваяПричинаОбращения+ПричинаОбращенияПричинаОбращения;
	КонецЦикла;
	Возврат НоваяПричинаОбращения;
КонецФункции // СформироватьПричинуОбращения()
 