Функция ПолучитьОбязательныеПоля() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("TypeId");
	ОбязательныеПоля.Добавить("Title");
	ОбязательныеПоля.Добавить("Condition");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьОбязательныеПоляШаблона() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Address");
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Description");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьДополнительныеОбязательныеПоля(TypeId) Экспорт
	
	ОбязательныеПоля = Новый Массив;
	Если TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьДиски() Тогда
		ОбязательныеПоля.Добавить("RimDiameter");
		ОбязательныеПоля.Добавить("RimType");
		ОбязательныеПоля.Добавить("RimWidth");
		ОбязательныеПоля.Добавить("RimBolts");
		ОбязательныеПоля.Добавить("RimBoltsDiameter");
		ОбязательныеПоля.Добавить("RimOffset");
	ИначеЕсли TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьКолеса() Тогда
		ОбязательныеПоля.Добавить("RimDiameter");
		ОбязательныеПоля.Добавить("TireType");
		ОбязательныеПоля.Добавить("RimType");
		ОбязательныеПоля.Добавить("TireSectionWidth");
		ОбязательныеПоля.Добавить("TireAspectRatio");
		ОбязательныеПоля.Добавить("RimWidth");
		ОбязательныеПоля.Добавить("RimBolts");
		ОбязательныеПоля.Добавить("RimBoltsDiameter");
		ОбязательныеПоля.Добавить("RimOffset");
	ИначеЕсли TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьКолпаки() Тогда
		ОбязательныеПоля.Добавить("RimDiameter");
	ИначеЕсли TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьМотошины() Тогда
		ОбязательныеПоля.Добавить("RimDiameter");
		ОбязательныеПоля.Добавить("WheelAxle");
		ОбязательныеПоля.Добавить("TireSectionWidth");
		ОбязательныеПоля.Добавить("TireAspectRatio");
	ИначеЕсли TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьШины() Тогда
		ОбязательныеПоля.Добавить("RimDiameter");
		ОбязательныеПоля.Добавить("TireType");
		ОбязательныеПоля.Добавить("TireSectionWidth");
		ОбязательныеПоля.Добавить("TireAspectRatio");
		ОбязательныеПоля.Добавить("Brand");
	КонецЕсли; 
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьНеобязательныеПоляШиныДиски(TypeId) Экспорт
	
	Поля = Новый Массив;
	Если TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьШины() Тогда
		Поля.Добавить("RunFlat");
		Поля.Добавить("Homologation");
		Поля.Добавить("SpeedIndex");
		Поля.Добавить("LoadIndex");
		Поля.Добавить("ResidualTread");
		Поля.Добавить("Quantity");
		Поля.Добавить("TiresModels");
	КонецЕсли; 
	
	Возврат Поля;
КонецФункции

Функция ПолучитьПоляШиныДиски() Экспорт
	ПоляШиныДиски = Новый Массив;
	
	ПоляШиныДиски.Добавить("RimBolts");
	ПоляШиныДиски.Добавить("RimBoltsDiameter");
	ПоляШиныДиски.Добавить("RimDiameter");
	ПоляШиныДиски.Добавить("RimOffset");
	ПоляШиныДиски.Добавить("RimType");
	ПоляШиныДиски.Добавить("RimWidth");
	ПоляШиныДиски.Добавить("TireAspectRatio");
	ПоляШиныДиски.Добавить("TireSectionWidth");
	ПоляШиныДиски.Добавить("TireType");
	ПоляШиныДиски.Добавить("WheelAxle");
	ПоляШиныДиски.Добавить("RunFlat");
	ПоляШиныДиски.Добавить("Homologation");
	ПоляШиныДиски.Добавить("SpeedIndex");
	ПоляШиныДиски.Добавить("LoadIndex");
	ПоляШиныДиски.Добавить("ResidualTread");
	ПоляШиныДиски.Добавить("Quantity");
	
	Возврат ПоляШиныДиски;
КонецФункции

Функция ЭтоПодкатегорияШиныДиски(TypeId) Экспорт
	Если TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьДиски() ИЛИ
		TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьКолеса() ИЛИ
		TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьКолпаки() ИЛИ
		TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьМотошины() ИЛИ
		TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьШины() Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции

Функция СнятьБезОстатковСВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка,
	|	ns_ЗапчастиИАксессуары.Номенклатура КАК Номенклатура,
	|	ns_ЗапчастиИАксессуары.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.Выгружать = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Номенклатура = Выгрузка.ВыгрузитьКолонку("Номенклатура");
	Остатки = ns_Переопределяемый.ПолучитьТаблицуОстатков(Номенклатура);
	
	Для каждого Стр Из Выгрузка Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Стр.Характеристика.УникальныйИдентификатор());
		Иначе
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор());
		КонецЕсли; 
		
		Если Остатки[Идентификатор] = Неопределено Тогда
			ОбъектЗапчасти = Стр.Ссылка.ПолучитьОбъект();
			ОбъектЗапчасти.Выгружать = Ложь;
			ОбъектЗапчасти.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

Функция ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки = Неопределено) Экспорт
	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Данные.TypeId) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле TypeId", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные.Title) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Title", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Данные.AdType) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле AdType", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Данные.Condition) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Condition", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	ДопПоля = ПолучитьДополнительныеОбязательныеПоля(Данные.TypeId);
	Для каждого ТекПоле Из ДопПоля Цикл
		Если НЕ ЗначениеЗаполнено(Данные[ТекПоле]) Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле " + ТекПоле, Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЦикла;        
	
	Возврат ЕстьОшибка;
КонецФункции
