Процедура ЗаполнитьИзМакета() Экспорт
	#Если Клиент Тогда
		Состояние("Заполнение справочника дополнительных кодов...");
	#КонецЕсли
	Макет = ПолучитьМакет("ДополнительныеКодыОбмена");
	
	Сч = 1;
	Пока Сч <= Макет.ВысотаТаблицы Цикл
		НомерКода     = СокрЛП(Макет.Область(Сч,1,Сч,1).Текст);
		ТекстКода     = СокрЛП(Макет.Область(Сч,2,Сч,2).Текст);
		Применение    = СокрЛП(Макет.Область(Сч,3,Сч,3).Текст);
		Распределение = Число(Макет.Область(Сч,4,Сч,4).Текст);
		СкидкаНаценка = Макет.Область(Сч,5,Сч,5).Текст;
		База          = СокрЛП(Макет.Область(Сч,6,Сч,6).Текст);
		Приоритет = Число(Макет.Область(Сч,7,Сч,7).Текст);
		
		ДопКод = Справочники.ДополнительныеКодыAudatex.НайтиПоРеквизиту("КодПоКлассификатору",НомерКода);
		
		Если обЗначениеНеЗаполнено(ДопКод) Тогда
			ДопКод = Справочники.ДополнительныеКодыAudatex.СоздатьЭлемент();
			ДопКод.УстановитьНовыйКод();
		Иначе
			ДопКод = ДопКод.ПолучитьОбъект();
		КонецЕсли;
		
		ДопКод.Наименование        = ТекстКода;
		ДопКод.КодПоКлассификатору = НомерКода;
		
		Если Применение = "Рубли" Тогда
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.Сумма;
		ИначеЕсли Применение = "РП" Тогда
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.РП;
		Иначе
			ДопКод.ТипНачисления = Перечисления.ТипыНачисленийДопКодов.Процент;
		КонецЕсли;
		
		Если Распределение = 1 Тогда
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаТоварыИРаботы;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudatex.ТоварыИРаботы;
		ИначеЕсли Распределение = 2 Тогда
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаТовары;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudatex.Товары;
		Иначе
			ДопКод.ТипРаспределения = Перечисления.ТипыРаспределенияДопКодов.НаРаботы;
			ДопКод.Родитель = Справочники.ДополнительныеКодыAudatex.Работы;
		КонецЕсли;
		
		ДопКод.СкидкаНаценка = (СкидкаНаценка = "+");
		
		Если База = "" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.НеИспользуется;
		ИначеЕсли База = "1" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.Товары;
		ИначеЕсли База = "2" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.Работы;
		ИначеЕсли База = "3" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.РаботыПоОкраске;
		ИначеЕсли База = "4" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.РаботыПоРемонту;
		ИначеЕсли База = "5" Тогда
			ДопКод.БазаДляРасчета = Перечисления.ТипыБазДляРасчетаДопКодов.ТоварыИработы;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДопКод.ПриоритетКода) Тогда
			ДопКод.ПриоритетКода = Приоритет;
		КонецЕсли;
		
		Попытка
			ДопКод.ОбменДанными.Загрузка = Истина;
			ДопКод.Записать();
		Исключение
		КонецПопытки;
		
		Сч = Сч + 1;
	КонецЦикла;
	
	#Если Клиент Тогда
		Состояние("Заполнение справочника дополнительных кодов - окончено.");
	#КонецЕсли
КонецПроцедуры
