
Функция documentsget(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Результат = "Ответ есть!";
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Результат);
	Возврат Ответ;
КонецФункции

Функция documentspost(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция guideget(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Результат = "Ответ есть!";
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Результат);
	Возврат Ответ;
КонецФункции

Функция guidepost(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
