#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем ЕстьВладелец Экспорт;                            // флаг наличия владельца

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// возвращает текст запроса отчета
Функция ПолучитьТекстЗапроса() Экспорт
	
	Результат = ТекстЗапроса;
	
	Если ЕстьВладелец Тогда
		ТекстСоединения = "";
		ТекстВыборки    = "";
		ТекстПсевдоним  = "";
		ТекстИтог       = "";
		Счетчик = 1;
		Для Каждого ТекСтрока Из ВидыКонтактнойИнформации Цикл
			
			Если ТекСтрока.Использование Тогда
				
				ПредставлениеСчетчика = Формат(Счетчик, "ЧН=0; ЧГ=");
				
				ТекстВыборки = ТекстВыборки + ",
				|	КонтактнаяИнформация" + ПредставлениеСчетчика + ".Представление КАК " + ТекСтрока.Имя;
				
				ТекстПсевдоним = ТекстПсевдоним + ",
				|	" + ТекСтрока.Имя + " КАК " + ТекСтрока.Имя;
				
				ТекстИтог = ТекстИтог + ",
				|	ВЫБОР 
				|		КОГДА НЕ Владелец ЕСТЬ NULL И НЕ ВладелецЭтоГруппа ТОГДА
				|			МАКСИМУМ(" + ТекСтрока.Имя + ")
				|		ИНАЧЕ
				|			""""
				|	КОНЕЦ КАК " + ТекСтрока.Имя;
				
				ТекстСоединения = ТекстСоединения + "
				|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация"+ПредставлениеСчетчика+"
				|ПО
				|	КонтактнаяИнформация"+ПредставлениеСчетчика+".Тип = &ПараметрТип"+ПредставлениеСчетчика+" И 
				|	КонтактнаяИнформация"+ПредставлениеСчетчика+".Вид = &ПараметрВид"+ПредставлениеСчетчика+" И 
				|	КонтактнаяИнформация"+ПредставлениеСчетчика+".Объект ССЫЛКА Справочник.Контрагенты И 
				|	ВЫРАЗИТЬ(тАвтомобили.Значение КАК Справочник.Контрагенты) = ВЫРАЗИТЬ(КонтактнаяИнформация"+ПредставлениеСчетчика+".Объект КАК Справочник.Контрагенты)
				|";
				ПостроительОтчета.Параметры.Вставить("ПараметрТип"+ПредставлениеСчетчика, ТекСтрока.Тип);
				ПостроительОтчета.Параметры.Вставить("ПараметрВид"+ПредставлениеСчетчика, ТекСтрока.Вид);
				Счетчик = Счетчик+1;
			КонецЕсли;
			
		КонецЦикла;
		
		Счетчик = 1;
		Для Каждого ТекСтрока Из ВидыПодтверждающихДокументов Цикл
			
			Если ТекСтрока.Использование Тогда
				
				ПредставлениеСчетчика = Формат(Счетчик, "ЧН=0; ЧГ=");
				
				ТекстВыборки = ТекстВыборки + ",
				|	ПодтверждающиеДокументы" + ПредставлениеСчетчика + ".Представление КАК " + ТекСтрока.Имя;
				
				ТекстПсевдоним = ТекстПсевдоним + ",
				|	" + ТекСтрока.Имя + " КАК " + ТекСтрока.Имя;
				
				ТекстИтог = ТекстИтог + ",
				|	ВЫБОР 
				|		КОГДА НЕ Владелец ЕСТЬ NULL И НЕ ВладелецЭтоГруппа ТОГДА
				|			МАКСИМУМ(" + ТекСтрока.Имя + ")
				|		ИНАЧЕ
				|			""""
				|	КОНЕЦ КАК " + ТекСтрока.Имя;
				
				ТекстСоединения = ТекстСоединения + "
				|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы"+ПредставлениеСчетчика+"
				|ПО
				|	ПодтверждающиеДокументы"+ПредставлениеСчетчика+".ВидПодтверждающегоДокумента = &ПараметрВидПД"+ПредставлениеСчетчика+" И 
				|	ПодтверждающиеДокументы"+ПредставлениеСчетчика+".Владелец ССЫЛКА Справочник.Контрагенты И 
				|	ВЫРАЗИТЬ(тАвтомобили.Значение КАК Справочник.Контрагенты) = ВЫРАЗИТЬ(ПодтверждающиеДокументы"+ПредставлениеСчетчика+".Владелец КАК Справочник.Контрагенты)";
				ПостроительОтчета.Параметры.Вставить("ПараметрВидПД"+ПредставлениеСчетчика, ТекСтрока.Вид);
				Счетчик = Счетчик+1;
			КонецЕсли;
			
		КонецЦикла;
		
		//Если Счетчик>1 Тогда
			ТекстВыборки = ТекстВыборки + ",
			|	ВЫРАЗИТЬ(тАвтомобили.Значение КАК Справочник.Контрагенты).ЭтоГруппа КАК ВладелецЭтоГруппа";
			
			ТекстПсевдоним = ТекстПсевдоним + ",
			|	ВладелецЭтоГруппа КАК ВладелецЭтоГруппа";
			
			Результат = СтрЗаменить(Результат, "//ВыборкаКонтактнаяИнформация",    ТекстВыборки);
			Результат = СтрЗаменить(Результат, "//ПсевдонимКонтактнаяИнформация",  ТекстПсевдоним);
			Результат = СтрЗаменить(Результат, "//СоединенияКонтактнаяИнформация", ТекстСоединения);
			Результат = СтрЗаменить(Результат, "//ИтогиКонтактнаяИнформация",      ТекстИтог);
			Результат = СтрЗаменить(Результат, "//ПоследняяГруппировка",           ",
			|	Владелец");
			
		//КонецЕсли;
		
	КонецЕсли;
	
	
	
	//
	//
	//
	
	
	
	
	
	
	
	
	
//Объект. Является обязательным для заполнения. Ссылается на справочники «Контактные лица», «Контрагенты»,
//«Организации», «Сотрудники».Объект-владелец контактной информации. 
//Тип. Является обязательным для заполнения. Ссылается на перечисление «Типы контактной информации».
//Тип контактной информации. 
//Вид. Является обязательным для заполнения. Ссылается на справочник «Виды контактной информации».
//Вид контактной информации. 


//Ресурсы
//Представление
	
	//ПоследняяСтрока = Неопределено;
	//Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
	//	Если НЕ ТекСтрока.Использование Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	ПоследняяСтрока = ТекСтрока;
	//КонецЦикла;
	//
	//Результат = ТекстЗапроса;
	//Если НЕ ПоследняяСтрока = Неопределено Тогда
	//	Если Найти(ПоследняяСтрока.ПутьКДанным, ".")=0 Тогда
	//		ПутьКДанным = ПоследняяСтрока.ПутьКДанным;
	//	Иначе
	//		ПутьКДанным = Лев(ПоследняяСтрока.ПутьКДанным, Найти(ПоследняяСтрока.ПутьКДанным, ".")-1);
	//	КонецЕсли;
	//	Результат = СтрЗаменить(Результат, "//ПоследняяГруппировка", ", 
	//	|	" + ПутьКДанным);
	//	Результат = СтрЗаменить(Результат, "МАКСИМУМ(ДокументВыполнения)", "
	//	|	ВЫБОР
	//	|		КОГДА НЕ "+ ПутьКДанным +" ЕСТЬ NULL ТОГДА МАКСИМУМ(ДокументВыполнения)
	//	|		ИНАЧЕ NULL
	//	|	КОНЕЦ КАК ДокументВыполнения");
	//	Результат = СтрЗаменить(Результат, "МАКСИМУМ(ДатаВыполнения)", "
	//	|	ВЫБОР
	//	|		КОГДА НЕ "+ ПутьКДанным +" ЕСТЬ NULL ТОГДА МАКСИМУМ(ДатаВыполнения)
	//	|		ИНАЧЕ NULL
	//	|	КОНЕЦ КАК ДатаВыполнения");
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// устанавливает использование измерений
Функция УстановитьИспользованиеИзмерений(Построитель) Экспорт
	
	Если ЕстьВладелец Тогда
		Для Каждого ТекСтрока Из ВидыКонтактнойИнформации Цикл
			Если ТекСтрока.Использование И Построитель.ВыбранныеПоля.Найти(ТекСтрока.Имя)=Неопределено Тогда
				Построитель.ВыбранныеПоля.Добавить(ТекСтрока.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ВидыПодтверждающихДокументов Цикл
			Если ТекСтрока.Использование И Построитель.ВыбранныеПоля.Найти(ТекСтрока.Имя)=Неопределено Тогда
				Построитель.ВыбранныеПоля.Добавить(ТекСтрока.Имя);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	Запрос = Новый Запрос;
	
	ТекстЗап = "ВЫБРАТЬ
	|	СправочникВидыКонтактнойИнформации.Ссылка КАК Вид,
	|	СправочникВидыКонтактнойИнформации.Наименование КАК Представление,
	|	СправочникВидыКонтактнойИнформации.Тип КАК Тип,
	|	СправочникВидыКонтактнойИнформации.Тип.Порядок КАК Порядок,
	|	Ложь КАК Использование
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК СправочникВидыКонтактнойИнформации
	|ГДЕ
	|	НЕ СправочникВидыКонтактнойИнформации.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Представление,
	|	Порядок";
	
	ВидыКонтактнойИнформации.Очистить();
	ВидыКонтактнойИнформации.Колонки.Очистить();
	
	Запрос.Текст = ТекстЗап;
	Результат = Запрос.Выполнить();
	Для Каждого ТекКолонка Из Результат.Колонки Цикл
		ВидыКонтактнойИнформации.Колонки.Добавить(ТекКолонка.Имя, ТекКолонка.ТипЗначения);
	КонецЦикла;
	ВидыКонтактнойИнформации.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ВидыКонтактнойИнформации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Имя = "Вид"+СтрЗаменить(Выборка.Вид.УникальныйИдентификатор(),"-","_");
	КонецЦикла;
	
	ТекстЗап = "ВЫБРАТЬ
	|	ВидыДокументов.Ссылка КАК Вид,
	|	ВидыДокументов.Порядок КАК Порядок,
	|	Представление(ВидыДокументов.Ссылка) КАК Представление,
	|	Ложь КАК Использование
	|ИЗ
	|	Перечисление.ВидыДокументов КАК ВидыДокументов";
	
	ВидыПодтверждающихДокументов.Очистить();
	ВидыПодтверждающихДокументов.Колонки.Очистить();
	
	Запрос.Текст = ТекстЗап;
	Результат = Запрос.Выполнить();
	Для Каждого ТекКолонка Из Результат.Колонки Цикл
		ВидыПодтверждающихДокументов.Колонки.Добавить(ТекКолонка.Имя, ТекКолонка.ТипЗначения);
	КонецЦикла;
	ВидыПодтверждающихДокументов.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ВидыПодтверждающихДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Имя = "Вид"+Формат(Выборка.Порядок, "ЧН=0; ЧГ=");
		
	КонецЦикла;
	
	ВидыПодтверждающихДокументов.Сортировать("Представление");
	
	ВыводитьДетальныеЗаписи = Истина;
	
	ПостроительОтчета.ВыводитьОбщиеИтоги = Ложь;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента – передает ссылку на
//						табличный документ или поле табличного документа
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент 
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	Если ИзмеренияСтроки.НайтиСтроки(Новый Структура("Использование, ПутьКДанным", Истина, "Владелец")).Количество()>0 Тогда
		ЕстьВладелец = Истина;
	Иначе
		ЕстьВладелец = Ложь;
	КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы, 2, ДокументРезультат.ВысотаТаблицы, 2).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьНачальныеНастройки()

// Процедура формирует строку измерений макета построителя отчета
//
// Параметры:
//	ОтчетОбъект        - ОтчетОбъект                - Объект отчета
//	ТекПостроительОтчета  - ПостроительОтчета          - Построитель отчета
//	МакетОтчета        - ТабличныйДокумент          - Макет отчета
//	ТекИзмерение       - ИзмерениеПостроителяОтчета - Текущее измерение
//	СчетчикУровня      - Число						- Счетчик уровня
//	ПараметрыИзмерения - Структура					- Параметры измерения
//	КлючСтроки         - Строка						- Ключ строки
//	ГраницаМакета      - Структура					- Границы макета
//
Процедура СформироватьМакетИзмеренияСтроки(ОтчетОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтроки, ГраницаМакета)
	
	РесурсыОтчета              = ПараметрыИзмерения.РесурсыОтчета;
	ДеревоРесурсов             = ПараметрыИзмерения.ДеревоРесурсов;
	КоличествоУровней          = ПараметрыИзмерения.КоличествоУровней;
	ЭтоИерархия                = ПараметрыИзмерения.ЭтоИерархия;
	ОбластьОформлениеИзмерений = ПараметрыИзмерения.ОбластьОформлениеИзмерений;
	НачальноеОформление        = ПараметрыИзмерения.НачальноеОформление;
	СтруктураДополненияПоказателей = ПараметрыИзмерения.СтруктураДополненияПоказателей;
	КоличествоКолонокПоказателей = ПараметрыИзмерения.КоличествоКолонокПоказателей;
	
	Попытка	   ДополнительныеПоляВОтдельнойКолонке = ОтчетОбъект.ВыводитьДополнительныеПоляВОтдельнойКолонке;
	Исключение ДополнительныеПоляВОтдельнойКолонке = Ложь;
	КонецПопытки;
	
	Попытка СтруктураФорматаПолей = ОтчетОбъект.СтруктураФорматированияПолей();
	Исключение СтруктураФорматаПолей = Новый Структура();
	КонецПопытки;	
	
	СтруктураСвязиСвойств = Новый Структура();
	Попытка СтруктураСвязиСвойств = ОтчетОбъект.СтруктураСвязиСвойств;
	Исключение КонецПопытки;	
	Если ТипЗнч(СтруктураСвязиСвойств) <> Тип("Структура") Тогда
		СтруктураСвязиСвойств = Новый Структура();
	КонецЕсли;
	
	ПоследнееИзмерение = ТекПостроительОтчета.ИзмеренияСтроки.Индекс(ТекИзмерение) = ТекПостроительОтчета.ИзмеренияСтроки.Количество() - 1;
	НомерСтроки = МакетОтчета.ВысотаТаблицы + 1;
	НачальныйНомерВыводаКолонок = ?(ОтчетОбъект.ИспользоватьАвтоотступ, 4, КоличествоУровней + 3);
	
	ТекПараметрыИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекИзмерение.ПутьКДанным, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей);
	ИмяТекИзмерения = ТекИзмерение.Имя;
	ПутьОсновногоПредставления = "";
	ТипЗаполненияОбластиИзмерения =	ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	Попытка
		Если ТекПараметрыИзмерения.Свойство("ОсновноеПредставление") Тогда
			ПутьОсновногоПредставления = ТекПараметрыИзмерения.ОсновноеПредставление;
			ИмяТекИзмерения = СтрЗаменить(ПутьОсновногоПредставления,".","");
		ИначеЕсли ТекПараметрыИзмерения.Свойство("СоставноеПредставление") Тогда
			ИмяТекИзмерения = ТекПараметрыИзмерения.СоставноеПредставление.Представление;
			ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
		КонецЕсли;
	Исключение
	КонецПопытки;
	// Установим ключ строки, что бы в дальнейшем удалить "пустышки"
	Если Не ПустаяСтрока(КлючСтроки) Тогда
		МакетОтчета.Область(НомерСтроки, 1).Текст = КлючСтроки;
	КонецЕсли;
	
	ТекДополнительныеПоляОтчета = ОтчетОбъект.ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Ложь));
	
	Если ТекДополнительныеПоляОтчета.Количество() > 0 И Не ДополнительныеПоляВОтдельнойКолонке Тогда
		
		ТекстШаблона = "";
		Для ИндПоля=0 По ТекДополнительныеПоляОтчета.Количество()-1 Цикл
			ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			Если (СтруктураСвязиСвойств.Свойство(ТекПоле.Имя)) И (НЕ ЭтоИерархия) Тогда
				ЗаполнятьПараметр = ТекИзмерение.Имя = СтруктураСвязиСвойств[ТекПоле.Имя].ИмяИзмерения;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			Если ЗаполнятьПараметр Тогда ТекстШаблона = ТекстШаблона + ", [" + ТекПоле.Имя + "]"; КонецЕсли;
		КонецЦикла;
		
		Если Не обЗначениеНеЗаполнено(ТекстШаблона) Тогда
			ТипЗаполненияОбластиИзмерения =	ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
			ИмяТекИзмерения = "[" + ИмяТекИзмерения + "]"+ТекстШаблона;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
		Для к = 1 по СчетчикУровня - 1 Цикл
			ОформлениеУровня = ОбластьОформлениеИзмерений.Область(НачальноеОформление + к, 1);
			
			ОбластьПредУровня = МакетОтчета.Область(НомерСтроки, к + 2);
			ОбластьПредУровня.Шрифт        = ОформлениеУровня.Шрифт;
			ОбластьПредУровня.ЦветТекста   = ОформлениеУровня.ЦветТекста;
			ОбластьПредУровня.ЦветФона     = ОформлениеУровня.ЦветФона;
			ОбластьПредУровня.ГраницаСлева = ГраницаМакета.ИзмерениеСтрока.ГраницаСлева;
			ОбластьПредУровня.ШиринаКолонки = 2;
		КонецЦикла;
		
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		
	Иначе
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, 3, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
	КонецЕсли;	
	
	ОбластьФиктивнаяРасшифровка = МакетОтчета.Область(НомерСтроки, 1, НомерСтроки, 1);
	ОбластьФиктивнаяРасшифровка.ПараметрРасшифровки = "Расшифровка";
	
	РасшифровкаГруппировки = Новый Структура();
	РасшифровкаГруппировки.Вставить("ИмяГруппировки", ТекИзмерение.Имя);
	РасшифровкаГруппировки.Вставить("ПутьКДанным",    ТекИзмерение.ПутьКДанным);
	РасшифровкаГруппировки.Вставить("Колонка",        ОбластьКолонки.Лево);
	Если ТекПостроительОтчета.ВыводитьДетальныеЗаписи И ПоследнееИзмерение И НЕ ЭтоИерархия Тогда
		РасшифровкаГруппировки.Вставить("ДетальнаяЗапись", Истина);
	Иначе
		РасшифровкаГруппировки.Вставить("ДетальнаяЗапись", Ложь);
	КонецЕсли;
	ОбластьИмяФиктивнойРасшифровки = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, 2);
	ОбластьИмяФиктивнойРасшифровки.Расшифровка = РасшифровкаГруппировки;
	
	ОформлениеУровня = ОбластьОформлениеИзмерений.Область(НачальноеОформление + СчетчикУровня, 1);
	
	ОбластьКолонки.Объединить();
	ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьКолонки.Заполнение    = ТипЗаполненияОбластиИзмерения;
	ОбластьКолонки.Параметр      = ИмяТекИзмерения;
	ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьКолонки.Шрифт         = ОформлениеУровня.Шрифт;
	
	Если ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
		Попытка
			Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
				ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
			Иначе
				ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей).Формат;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбластьКолонки.ЦветТекста    = ОформлениеУровня.ЦветТекста;
	ОбластьКолонки.ЦветФона      = ОформлениеУровня.ЦветФона;
	ОбластьКолонки.ГраницаСверху = ГраницаМакета.ИзмерениеСтрока.ГраницаСверху;
	ОбластьКолонки.ГраницаСлева  = ГраницаМакета.ИзмерениеСтрока.ГраницаСлева;
	Если ОтчетОбъект.ИспользоватьАвтоотступ Тогда
		ОбластьКолонки.Автоотступ = 1;
	КонецЕсли;	
	
	//Если НЕ ТекПостроительОтчета.ВыводитьДетальныеЗаписи ИЛИ НЕ ПоследнееИзмерение ИЛИ ЭтоИерархия Тогда
	//	ОбластьКолонки.ПараметрРасшифровки = "Расшифровка";
	//Иначе
	ОбластьКолонки.ПараметрРасшифровки = ТекИзмерение.Имя;
	//КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ОбластьКолонки.Формат) И СтруктураФорматаПолей.Свойство(ТекИзмерение.Имя) Тогда
		ОбластьКолонки.Формат = СтруктураФорматаПолей[ТекИзмерение.Имя];
	КонецЕсли;
	
	Если ТекДополнительныеПоляОтчета.Количество() > 0 И ДополнительныеПоляВОтдельнойКолонке Тогда
		
		// Теперь добавим выбранные дополнительные поля
		Для ИндПоля=0 По ТекДополнительныеПоляОтчета.Количество()-1 Цикл
			
			ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			Если (СтруктураСвязиСвойств.Свойство(ТекПоле.Имя)) И (НЕ ЭтоИерархия) Тогда
				ЗаполнятьПараметр = ТекИзмерение.Имя = СтруктураСвязиСвойств[ТекПоле.Имя].ИмяИзмерения;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			
			Если ЗаполнятьПараметр Тогда
				ОбластьДопПоле.Заполнение          = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьДопПоле.Параметр            = ТекПоле.Имя;
				ОбластьДопПоле.ПараметрРасшифровки = ТекПоле.Имя;
				ОбластьДопПоле.Формат              = ТекПоле.Формат;
			Иначе
				ОбластьДопПоле.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьДопПоле.Текст      = "";
			КонецЕсли;
			ОбластьДопПоле.ГраницаСверху = ГраницаМакета.ДопПоляСтрока.ГраницаСверху;
			ОбластьДопПоле.ГраницаСлева  = ГраницаМакета.ДопПоляСтрока.ГраницаСлева;
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
		
		Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		Иначе ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		КонецЕсли;
		ОбластьДопПоле.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.Шрифт         = ОформлениеУровня.Шрифт;
		ОбластьДопПоле.ЦветТекста    = ОформлениеУровня.ЦветТекста;
		ОбластьДопПоле.ЦветФона      = ОформлениеУровня.ЦветФона;
	КонецЕсли;	
	
	НеСвязанныеДополнительныеПоляОтчета = ОтчетОбъект.ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Истина));
	Если НеСвязанныеДополнительныеПоляОтчета.Количество() > 0 Тогда
		
		Для ИндПоля=0 По НеСвязанныеДополнительныеПоляОтчета.Количество()-1 Цикл
			
			ТекПоле = НеСвязанныеДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			ЗаполнятьПараметр = Ложь;
			
			Если ТекПоле.ВыводитьИтогДляВсехУровней Тогда
				ЗаполнятьПараметр = Истина;
			ИначеЕсли ОтчетОбъект.СтруктураНеСвязанныхПоказателей.Свойство(ТекИзмерение.Имя) Тогда
				Если ЭтоИерархия Тогда
					Если (ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"].Свойство(ТекПоле.Имя)) Тогда
						ЗаполнятьПараметр = ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"][ТекПоле.Имя].ВыводитьИтогПоИерархии;
					КонецЕсли;
				Иначе
					ЗаполнятьПараметр = ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"].Свойство(ТекПоле.Имя);
				КонецЕсли;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			
			Если ЗаполнятьПараметр Тогда
				ОбластьДопПоле.Заполнение          = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьДопПоле.Параметр            = ТекПоле.Имя;
				ОбластьДопПоле.ПараметрРасшифровки = ТекПоле.Имя;
				ОбластьДопПоле.Формат              = ТекПоле.Формат;
			Иначе
				ОбластьДопПоле.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьДопПоле.Текст      = "";
			КонецЕсли;
			ОбластьДопПоле.ГраницаСверху = ГраницаМакета.ДопПоляСтрока.ГраницаСверху;
			ОбластьДопПоле.ГраницаСлева  = ГраницаМакета.ДопПоляСтрока.ГраницаСлева;
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
		
		Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		Иначе ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		КонецЕсли;
		ОбластьДопПоле.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.Шрифт         = ОформлениеУровня.Шрифт;
		ОбластьДопПоле.ЦветТекста    = ОформлениеУровня.ЦветТекста;
		ОбластьДопПоле.ЦветФона      = ОформлениеУровня.ЦветФона;
	КонецЕсли;
	
	НомерКолонки = НачальныйНомерВыводаКолонок;
	ОбластьПостроителя = МакетОтчета.Область("R" + НомерСтроки);
	
	Если НЕ ТекПостроительОтчета.ВыводитьДетальныеЗаписи ИЛИ НЕ ПоследнееИзмерение ИЛИ ЭтоИерархия Тогда
		ОбластьПостроителя.Имя = ТекИзмерение.Имя + ?(ЭтоИерархия, "Иерархия", "");
		
	Иначе
		ОбластьПостроителя.Имя = "Детали";
	КонецЕсли;
	
	ИспользованиеРесурсов = Новый Структура();
	Попытка
		Если ЭтоИерархия Тогда
			СтрПутьКДанным = ТекИзмерение.ПутьКДанным+".Родитель";
		Иначе
			СтрПутьКДанным = ТекИзмерение.ПутьКДанным;
		КонецЕсли;
		ИспользованиеРесурсов=отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(СтрПутьКДанным, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей);
		ИспользованиеРесурсов=ИспользованиеРесурсов["Использование"]["Ресурсы"]
	Исключение КонецПопытки;
	
	НомерПервойКолонки = НомерКолонки;
	Для Каждого ТекРесурс Из РесурсыОтчета Цикл
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Если ПустаяСтрока(ТекРесурс) Тогда
			ОтображатьПоказатель = Ложь;
		Иначе
		Попытка    ОтображатьПоказатель = ИспользованиеРесурсов[ТекРесурс];
		Исключение ОтображатьПоказатель = Истина;
		КонецПопытки;
		КонецЕсли;
		
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		
		Если ОтображатьПоказатель Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекРесурс;
			ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
			ОбластьКолонки.ПараметрРасшифровки     = ТекРесурс;
			//ОбластьКолонки.Расшифровка             = ТекРесурс;
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		КоличествоДополнений = 0;
		Если ЗначениеЗаполнено(ТекРесурс) И СтруктураДополненияПоказателей.Свойство(ТекРесурс) Тогда
			Для Каждого СтруктураДополнения Из СтруктураДополненияПоказателей[ТекРесурс] Цикл
				КоличествоДополнений = КоличествоДополнений+1;
				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки+КоличествоДополнений, НомерСтроки, НомерКолонки+КоличествоДополнений);
				
				ОтображатьПоле = Ложь;
				Если ОтображатьПоказатель И Не ЭтоИерархия Тогда
					СвязаннаяГруппировка = ТекПостроительОтчета.ИзмеренияСтроки.Найти(СтруктураДополнения.ИмяСвязанногоПоля);
					Если Не СвязаннаяГруппировка = Неопределено Тогда
						ОтображатьПоле = (ТекПостроительОтчета.ИзмеренияСтроки.Индекс(СвязаннаяГруппировка)>=ТекПостроительОтчета.ИзмеренияСтроки.Индекс(ТекИзмерение));
					КонецЕсли;
					СвязаннаяГруппировка = ТекПостроительОтчета.ИзмеренияКолонки.Найти(СтруктураДополнения.ИмяСвязанногоПоля);
					Если Не СвязаннаяГруппировка = Неопределено Тогда
						ОтображатьПоле = (ОтображатьПоле ИЛИ (ТекПостроительОтчета.ИзмеренияКолонки.Индекс(СвязаннаяГруппировка)=0));
					КонецЕсли;
					СвязанныйОтбор = ТекПостроительОтчета.Отбор.Найти(СтруктураДополнения.ИмяСвязанногоПоля);
					Если Не СвязанныйОтбор = Неопределено И СвязанныйОтбор.Использование И СвязанныйОтбор.ВидСравнения=ВидСравнения.Равно Тогда
						ОтображатьПоле = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ОтображатьПоле Тогда
					ОбластьКолонки.Заполнение             	= ТипЗаполненияОбластиТабличногоДокумента.Параметр;
					ОбластьКолонки.Параметр               	= СтруктураДополнения.Имя;
					ОбластьКолонки.Формат                 	= СтруктураДополнения.Формат;
					ОбластьКолонки.ПараметрРасшифровки    	= СтруктураДополнения.Имя;
					ОбластьКолонки.ГоризонтальноеПоложение	= СтруктураДополнения.ГоризонтальноеПоложение;
					ОбластьКолонки.ВертикальноеПоложение	= СтруктураДополнения.ВертикальноеПоложение;
				Иначе
					ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
					ОбластьКолонки.Текст                   = "";
					ОбластьКолонки.ПараметрРасшифровки     = "";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		НомерКолонки = НомерКолонки + КоличествоДополнений + 1;
	КонецЦикла;
	
	Если ЕстьВладелец Тогда
		ЕстьОтбор = Ложь;
		Для Каждого ТекОтбор Из ПостроительОтчета.Отбор Цикл
			Если ТекОтбор.Имя = "Владелец" И ТекОтбор.Использование И ТекОтбор.ВидСравнения = ВидСравнения.Равно Тогда
				ЕстьОтбор = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		//НомерПервойКолонки = НомерКолонки;
		Для Каждого ТекСтрока Из ВидыКонтактнойИнформации Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки+1);
			ОбластьКолонки.Объединить();
			ОтображатьПоказатель = ТекИзмерение.Имя = "Владелец" ИЛИ ЕстьОтбор;
			
			ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			Если ОтображатьПоказатель Тогда
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьКолонки.Параметр                = ТекСтрока.Имя;
				//ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
				ОбластьКолонки.ПараметрРасшифровки     = ТекСтрока.Имя;
				//ОбластьКолонки.Расшифровка             = ТекРесурс;
				ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			Иначе
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьКолонки.Текст                   = "";
				ОбластьКолонки.ПараметрРасшифровки     = "";
			КонецЕсли;
			ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			
			НомерКолонки = НомерКолонки + 2;
			
		КонецЦикла;
		
		//НомерПервойКолонки = НомерКолонки;
		Для Каждого ТекСтрока Из ВидыПодтверждающихДокументов Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
			ОбластьКолонки.Объединить();
			ОтображатьПоказатель = ТекИзмерение.Имя = "Владелец" ИЛИ ЕстьОтбор;
			
			ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			
			Если ОтображатьПоказатель Тогда
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьКолонки.Параметр                = ТекСтрока.Имя;
				//ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
				ОбластьКолонки.ПараметрРасшифровки     = ТекСтрока.Имя;
				//ОбластьКолонки.Расшифровка             = ТекРесурс;
				ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			Иначе
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьКолонки.Текст                   = "";
				ОбластьКолонки.ПараметрРасшифровки     = "";
			КонецЕсли;
			ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			
			НомерКолонки = НомерКолонки + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	ТекНомерКолонки = НомерПервойКолонки;
	СчетчикФункций=0;
	КоличествоДополнений=0;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		СчетчикПоказателей = 0;
		КоличествоДополнений=0;
		Если ЗначениеЗаполнено(ТекФункция.ИмяРесурса) И СтруктураДополненияПоказателей.Свойство(ТекФункция.ИмяРесурса) Тогда
			КоличествоДополнений=СтруктураДополненияПоказателей[ТекФункция.ИмяРесурса].Количество();
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки+КоличествоДополнений);
			ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
		КонецЕсли;
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
		ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСлева,ГраницаМакета.ФункцииСтрока.ГраницаСлева);
		ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
		ТекНомерКолонки = ТекНомерКолонки+КоличествоДополнений+1;

		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки-1, НомерСтроки, ТекНомерКолонки-1);
		СчетчикФункций = СчетчикФункций+1;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииСтрока.ГраницаСправа;
	КонецЦикла;
	ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа;
	
	Если ЕстьВладелец Тогда
		//ТекНомерКолонки = НомерПервойКолонки;
		//СчетчикФункций=0;
		Для Каждого ТекСтрока Из ВидыКонтактнойИнформации Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			СчетчикПоказателей = 0;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки+1);
			ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСлева,ГраницаМакета.ФункцииСтрока.ГраницаСлева);
			ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
			ТекНомерКолонки = ТекНомерКолонки+2;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки-2, НомерСтроки, ТекНомерКолонки-2);
			СчетчикФункций = СчетчикФункций+1;
			ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииСтрока.ГраницаСправа;
		КонецЦикла;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа;
		
		//ТекНомерКолонки = НомерПервойКолонки;
		//СчетчикФункций=0;
		
		Для Каждого ТекСтрока Из ВидыПодтверждающихДокументов Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			СчетчикПоказателей = 0;
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
			ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСлева,ГраницаМакета.ФункцииСтрока.ГраницаСлева);
			ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
			ТекНомерКолонки = ТекНомерКолонки+1;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки-1, НомерСтроки, ТекНомерКолонки-1);
			СчетчикФункций = СчетчикФункций+1;
			ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииСтрока.ГраницаСправа;
		КонецЦикла;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа;
	КонецЕсли;
	
	
	ОформлениеСтроки = ОбластьОформлениеИзмерений.Область(НачальноеОформление + СчетчикУровня, 1);
	
	ОбластьСтроки = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, МакетОтчета.ШиринаТаблицы);
	ОбластьСтроки.Шрифт         = ОформлениеСтроки.Шрифт;
	ОбластьСтроки.ЦветТекста    = ОформлениеСтроки.ЦветТекста;
	ОбластьСтроки.ЦветФона      = ОформлениеСтроки.ЦветФона;
	
КонецПроцедуры	//	СформироватьМакетИзмеренияСтроки()

// Функция формирует табличный документ для использования в качестве макета построителя отчета
//
// Параметры:
//	ТекПостроительОтчета - ПостроительОтчета - Построитель отчета
//	МакетОтчета          - ТабличныйДокумент - Макет построителя
//	ПараметрыОформления  - Структура         - Параметры оформления макета
//
// Возвращаемое значение:
//	ТабличныйДокумент - Макет отчета
//
Функция ПолучитьМакетПостроителя(ТекПостроительОтчета, МакетОтчета, ПараметрыОформления) Экспорт
	
	ОбластьОформлениеИзмерений = ПараметрыОформления.ОбластьОформлениеИзмерений;
	ОформлениеШапки            = ПараметрыОформления.ОформлениеШапки;
	ОформлениеИтоги            = ПараметрыОформления.ОформлениеИтоги;
	ГраницаМакета              = ПараметрыОформления.ГраницаМакета;
	
	СтруктураФорматаПолей      = СтруктураФорматированияПолей();
	СтруктураОриентацииТекстаПолей = Новый Структура();
	
	ЗаголовокШапки    = "";
	КоличествоУровней = 0;
	Для Каждого ТекИзмерение Из ТекПостроительОтчета.ИзмеренияСтроки Цикл
		ЗаголовокШапки = ЗаголовокШапки + ?(ЗаголовокШапки = "", "", " / ") + ТекИзмерение.Представление;
		
		Если ТекИзмерение.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
			КоличествоУровней = КоличествоУровней + 1;
		КонецЕсли;	
		
		КоличествоУровней = КоличествоУровней + 1;
	КонецЦикла;
	
	//ПеремГраницаСправа = ?(ВключитьГраницуСправа, ЗначениеГраницОтчета.ГраницаСправа,
	//ГраницаМакета.Функции.ГраницаСлева);
	ПеремГраницаСправа = ГраницаМакета.Функции.ГраницаСлева;
	
	СтруктураДополненияПоказателей = Новый Структура;
	РесурсыОтчета = Новый Массив();
	ДеревоРесурсов = Новый ДеревоЗначений;
	ДеревоРесурсов.Колонки.Добавить("ИмяРесурса");
	ДеревоРесурсов.Колонки.Добавить("Представление");
	ДеревоРесурсов.Колонки.Добавить("ФорматнаяСтрока");
	ДеревоРесурсов.Колонки.Добавить("ШиринаКолонки");
	ДеревоРесурсов.Колонки.Добавить("Одиночный");
	КоличествоКолонокПоказателей = 0;
	
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если НЕ ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ИмяРесурса = ТекПоказатель.Имя;
		РесурсыОтчета.Добавить(ИмяРесурса);
		НоваяГруппа = ДеревоРесурсов.Строки.Добавить();
		НоваяГруппа.ИмяРесурса = ИмяРесурса;
		НоваяГруппа.Представление = ТекПоказатель.Представление;
		НоваяГруппа.ФорматнаяСтрока = ТекПоказатель.ФорматнаяСтрока;
		НоваяГруппа.ШиринаКолонки = ТекПоказатель.ШиринаКолонки;
		НоваяГруппа.Одиночный = Истина;
		КоличествоКолонокПоказателей = КоличествоКолонокПоказателей + 1;
		Если СтруктураДополненияПоказателей.Свойство(ИмяРесурса) Тогда
			КоличествоКолонокПоказателей = КоличествоКолонокПоказателей + СтруктураДополненияПоказателей[ИмяРесурса].Количество();
		КонецЕсли;
	КонецЦикла;
	
	// Приступим к формированию макета
	ТаблицаЗаголовка = отПолучитьТаблицуЗаголовкаОтчета(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета.Область(1, 3).Шрифт);
	
	Для Инд=0 По ТаблицаЗаголовка.Количество()-1 Цикл
		ТекСтрокаЗаголовка = ТаблицаЗаголовка[Инд];
		ОбластьЗаголовок = МакетОтчета.Область(Инд+1, 3);
		Для Каждого ТекКолонка Из ТаблицаЗаголовка.Колонки Цикл
			Если ТекКолонка.Имя="ИмяСтроки" Тогда Продолжить; КонецЕсли;
			ТекПараметрЗаголовка = ТекСтрокаЗаголовка[ТекКолонка.Имя];
			Если обЗначениеНеЗаполнено(ТекПараметрЗаголовка) Тогда Продолжить; КонецЕсли;
			ОбластьЗаголовок[ТекКолонка.Имя] = ТекПараметрЗаголовка;
		КонецЦикла;
	КонецЦикла;
	
	ВысотаЗаголовка = МакетОтчета.ВысотаТаблицы;
	МакетОтчета.Область(1, 1).ШиринаКолонки = 0;
	МакетОтчета.Область(1, 2).ШиринаКолонки = 1;
	МакетОтчета.Область("R1:R" + ВысотаЗаголовка).Имя = "ЗаголовокШаблон";
	
	// Создадим отступы уровней измерений строк
	Если НЕ ИспользоватьАвтоотступ Тогда
		НачальныйНомерВыводаКолонок = 3;
		Для к = 1 по КоличествоУровней Цикл
			МакетОтчета.Область(ВысотаЗаголовка + 1, НачальныйНомерВыводаКолонок).ШиринаКолонки = ?(к = КоличествоУровней, 40, 1.5);
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
	Иначе
		НачальныйНомерВыводаКолонок = 4;
		МакетОтчета.Область(ВысотаЗаголовка + 1, 3).ШиринаКолонки = 40;
	КонецЕсли;
	
	ОбластьЗаголовокСтрок = МакетОтчета.Область(ВысотаЗаголовка + 1, 3, ВысотаЗаголовка + 2, НачальныйНомерВыводаКолонок - 1);
	ОбластьЗаголовокСтрок.Объединить();
	ОбластьЗаголовокСтрок.Текст                   = ЗаголовокШапки;
	ОбластьЗаголовокСтрок.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьЗаголовокСтрок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовокСтрок.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЗаголовокСтрок.ГраницаСлева            = ГраницаМакета.Измерения.ГраницаСлева;
	ОбластьЗаголовокСтрок.ГраницаСверху           = ГраницаМакета.Измерения.ГраницаСверху;
	ОбластьЗаголовокСтрок.ГраницаСнизу            = ГраницаМакета.Измерения.ГраницаСнизу;
	
	ДоступныеПоля = ДеревоДоступныхПолей;
	
	Если ДополнительныеПоляОтчета.Колонки.Найти("НомерСтроки") = Неопределено Тогда
		ДополнительныеПоляОтчета.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	КонецЕсли;
	
	НомерСтроки = 0 ;
	Для Каждого ТекСтрока Из ДополнительныеПоляОтчета Цикл
		ТекСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	ДополнительныеПоляОтчета.Сортировать("НеСвязанные ВОЗР, НомерСтроки ВОЗР");
	
	Для Каждого ТекПоле Из ДополнительныеПоляОтчета Цикл
		
		Если (НЕ ТекПоле.НеСвязанные) И (Не ВыводитьДополнительныеПоляВОтдельнойКолонке) Тогда Продолжить; КонецЕсли;
		
		ОбластьДопПоле = МакетОтчета.Область(ВысотаЗаголовка + 1, НачальныйНомерВыводаКолонок, ВысотаЗаголовка + 2, НачальныйНомерВыводаКолонок);
		ОбластьДопПоле.Объединить();
		ОбластьДопПоле.Текст                   = ТекПоле.ПолноеПредставление;
		ОбластьДопПоле.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.ШиринаКолонки           = ТекПоле.ШиринаКолонки;
		ОбластьДопПоле.Расшифровка             = Новый Структура("ПутьКДанным, ИмяПоля", ТекПоле.ПутьКДанным, ТекПоле.Имя);
		ОбластьДопПоле.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьДопПоле.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ОбластьДопПоле.ГраницаСлева            = ГраницаМакета.ДопПоля.ГраницаСлева;
		ОбластьДопПоле.ГраницаСверху           = ГраницаМакета.ДопПоля.ГраницаСверху;
		ОбластьДопПоле.ГраницаСнизу            = ГраницаМакета.Измерения.ГраницаСнизу;
		
		НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
	КонецЦикла;
	
	ОбластьШапкаСтрок = МакетОтчета.Область("R" + (ВысотаЗаголовка + 1) + ":R" + (ВысотаЗаголовка + 2));
	ОбластьШапкаСтрок.Имя = "ШапкаТаблицы";
	
	НомерКолонки = НачальныйНомерВыводаКолонок;
	НомерСтроки = ВысотаЗаголовка + 1;
	НомерПервойКолонки = НомерКолонки;
	НомерПервойКолонкиИзмерения = 0;
	ОстатокВысоты = ВысотаЗаголовка - НомерСтроки;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		НомерПервойКолонкиФункции = НомерКолонки;
		
		ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки+1, НомерПервойКолонкиФункции);
		ОбластьКолонкиФункция.ШиринаКолонки = ?(ЗначениеЗаполнено(ТекФункция.ШиринаКолонки), ТекФункция.ШиринаКолонки, 14);
		ОбластьКолонкиФункция.Расшифровка   = Новый Структура("Показатель, Функция, ПутьКДанным, ИмяПоля", ТекФункция, "", ТекФункция.ИмяРесурса, ТекФункция.ИмяРесурса);
		
		КоличествоДополнений = 0;
		Если СтруктураДополненияПоказателей.Свойство(ТекФункция.ИмяРесурса) Тогда
			Для Каждого ТекКолонка Из СтруктураДополненияПоказателей[ТекФункция.ИмяРесурса] Цикл
				КоличествоДополнений = КоличествоДополнений+1;
				ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции+КоличествоДополнений, НомерСтроки+1, НомерПервойКолонкиФункции+КоличествоДополнений);
				ОбластьКолонкиФункция.ШиринаКолонки = ТекКолонка.ШиринаКолонки;
			КонецЦикла;
			ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки+1, НомерПервойКолонкиФункции+КоличествоДополнений);
			ОбластьКолонкиФункция.Объединить();
		КонецЕсли;
		НомерКолонки = НомерКолонки + КоличествоДополнений + 1;
		
		ОбластьКолонкиФункция.Объединить();
		ОбластьКолонкиФункция.Текст                   = ТекФункция.Представление;
		ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
		ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьКолонкиФункция.ГраницаСлева            = ?(НомерПервойКолонкиИзмерения = 0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева);
		ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.Функции.ГраницаСверху;
		ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
		ОбластьКолонкиФункция.ОриентацияТекста		  = ?((Не ПустаяСтрока(ТекФункция.ИмяРесурса)) И СтруктураОриентацииТекстаПолей.Свойство(ТекФункция.ИмяРесурса), СтруктураОриентацииТекстаПолей[ТекФункция.ИмяРесурса], 0);
		НомерПервойКолонкиИзмерения = НомерПервойКолонкиИзмерения+1;
	КонецЦикла;
	
	ОбластьКолонкиФункция.ГраницаСправа           = ПеремГраницаСправа;
	
	Если ЕстьВладелец Тогда
		Для Каждого ТекСтрока Из ВидыКонтактнойИнформации Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			
			НомерПервойКолонкиФункции = НомерКолонки;
			
			ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки+1, НомерПервойКолонкиФункции);
			ОбластьКолонкиФункция.ШиринаКолонки = 3;
			ОбластьКолонкиФункция.Расшифровка   = Новый Структура("Показатель, Функция, ПутьКДанным, ИмяПоля", ТекСтрока, "", ТекСтрока.Имя, ТекСтрока.Имя);
			
			НомерКолонки = НомерКолонки + 1;
			
			ОбластьКолонкиФункция.Объединить();
			ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьКолонкиФункция.ГраницаСлева            = ?(НомерПервойКолонкиИзмерения = 0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева);
			ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.Функции.ГраницаСверху;
			//ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
			
			ДобавленнаяКартинка = МакетОтчета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			ДобавленнаяКартинка.Картинка = киПолучитьКартинкуТипаКИ(ТекСтрока.Тип);
			ДобавленнаяКартинка.ГраницаСправа  = Ложь;
			ДобавленнаяКартинка.ЦветФона       = ОформлениеШапки.ЦветФона;
			ДобавленнаяКартинка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
			ДобавленнаяКартинка.Расположить(ОбластьКолонкиФункция);
			ДобавленнаяКартинка.Имя = "Пиктограмма"+ТекСтрока.Имя;
			
			НомерПервойКолонкиИзмерения = НомерПервойКолонкиИзмерения+1;
			
			ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки+1, НомерКолонки);
			ОбластьКолонкиФункция.ШиринаКолонки = 20;
			ОбластьКолонкиФункция.Расшифровка   = Новый Структура("Показатель, Функция, ПутьКДанным, ИмяПоля", ТекСтрока, "", ТекСтрока.Имя, ТекСтрока.Имя);
			
			НомерКолонки = НомерКолонки + 1;
			
			ОбластьКолонкиФункция.Объединить();
			ОбластьКолонкиФункция.Текст                   = ТекСтрока.Представление;
			ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			//ОбластьКолонкиФункция.ГраницаСлева          = ?(НомерПервойКолонкиИзмерения = 0,
			//ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева,
			//ГраницаМакета.Функции.ГраницаСлева);
			ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.Функции.ГраницаСверху;
			ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
			
			НомерПервойКолонкиИзмерения = НомерПервойКолонкиИзмерения+1;
			
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ВидыПодтверждающихДокументов Цикл
			
			Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			
			НомерПервойКолонкиФункции = НомерКолонки;
			
			ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки+1, НомерПервойКолонкиФункции);
			ОбластьКолонкиФункция.ШиринаКолонки = 20;
			ОбластьКолонкиФункция.Расшифровка   = Новый Структура("Показатель, Функция, ПутьКДанным, ИмяПоля", ТекСтрока, "", ТекСтрока.Имя, ТекСтрока.Имя);
			
			НомерКолонки = НомерКолонки + 1;
			
			ОбластьКолонкиФункция.Объединить();
			ОбластьКолонкиФункция.Текст                   = ТекСтрока.Представление;
			ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьКолонкиФункция.ГраницаСлева            = ?(НомерПервойКолонкиИзмерения = 0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева);
			ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.Функции.ГраницаСверху;
			ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
			НомерПервойКолонкиИзмерения = НомерПервойКолонкиИзмерения+1;
			
		КонецЦикла;
	КонецЕсли;
	
	ОбластьШапкиТаблицы = МакетОтчета.Область(ВысотаЗаголовка + 1, 3, ВысотаЗаголовка + 2, НомерКолонки - 1);
	ОбластьШапкиТаблицы.Шрифт         = ОформлениеШапки.Шрифт;
	ОбластьШапкиТаблицы.ЦветТекста    = ОформлениеШапки.ЦветТекста;
	ОбластьШапкиТаблицы.ЦветФона      = ОформлениеШапки.ЦветФона;
	//	ОбластьШапкиТаблицы.ГраницаСверху = ЛинияОбычная;
	
	НачальноеОформление = Макс(0, 8 - КоличествоУровней);
	ПараметрыИзмерения  = Новый Структура("РесурсыОтчета,ДеревоРесурсов,КоличествоУровней,ОбластьОформлениеИзмерений,НачальноеОформление",
	РесурсыОтчета,ДеревоРесурсов,КоличествоУровней,ОбластьОформлениеИзмерений,НачальноеОформление);
	
	КлючСтроки = "";
	СчетчикУровня = 1;
	НачалоОформления = Макс(0, 8 - КоличествоУровней);
	ПараметрыИзмерения.Вставить("СтруктураДополненияПоказателей", СтруктураДополненияПоказателей);
	ПараметрыИзмерения.Вставить("КоличествоКолонокПоказателей", КоличествоКолонокПоказателей);
	
	Для Каждого ТекИзмерение Из ТекПостроительОтчета.ИзмеренияСтроки Цикл
		КлючСтроки = "";
		Если ТекИзмерение.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
			ПараметрыИзмерения.Вставить("ЭтоИерархия", Истина);
			КлючСтрокиИерархии = ?(ПустаяСтрока(КлючСтроки), "", КлючСтроки + ?(ИспользоватьАвтоотступ, 2, СчетчикУровня + 1));
			СформироватьМакетИзмеренияСтроки(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтрокиИерархии, ГраницаМакета);
			
			СчетчикУровня = СчетчикУровня + 1;
		КонецЕсли;
		
		ПараметрыИзмерения.Вставить("ЭтоИерархия", Ложь);
		КлючСтроки = ?(ПустаяСтрока(КлючСтроки), "", КлючСтроки + ?(ИспользоватьАвтоотступ, 2, СчетчикУровня + 1));
		СформироватьМакетИзмеренияСтроки(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтроки, ГраницаМакета);
		
		СчетчикУровня = СчетчикУровня + 1;
	КонецЦикла;
	НомерСтроки  = МакетОтчета.ВысотаТаблицы + 1;
	НомерКолонки = НачальныйНомерВыводаКолонок;
	
	ТекДополнительныеПоляОтчета = ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Истина));
	КоличествоДополнительныеПоляОтчета = ТекДополнительныеПоляОтчета.Количество();
	НачальныйНомерВыводаИтогов = НачальныйНомерВыводаКолонок-КоличествоДополнительныеПоляОтчета;
	
	Для ИндПоля = 0 По КоличествоДополнительныеПоляОтчета-1 Цикл
		ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаИтогов+ИндПоля, НомерСтроки, НачальныйНомерВыводаИтогов+ИндПоля);
		
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Если ТекПоле.ВыводитьОбщийИтог Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекПоле.Имя;
			ОбластьКолонки.Формат                  = ТекПоле.Формат;
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		
		ОбластьКолонки.ГраницаСлева  = ГраницаМакета.ИзмеренияИтог.ГраницаСлева;
		ОбластьКолонки.ГраницаСверху = ГраницаМакета.ИзмеренияИтог.ГраницаСверху;
		ОбластьКолонки.ГраницаСнизу  = ГраницаМакета.ИзмеренияИтог.ГраницаСнизу;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияИтог.ГраницаСправа;
	КонецЦикла;
	
	Попытка		
		ИспользованиеРесурсов=ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Использование.Ресурсы;
	Исключение КонецПопытки;
	
	НомерПервойКолонки = НомерКолонки;
	Для Каждого ТекРесурс Из РесурсыОтчета Цикл
		Если ПустаяСтрока(ТекРесурс) Тогда
			ОтображатьПоказатель = Ложь;
		Иначе
		Попытка    ОтображатьПоказатель = ИспользованиеРесурсов[ТекРесурс];
		Исключение ОтображатьПоказатель = Истина;
		КонецПопытки;
		КонецЕсли;
		
		КоличествоДополнений=0;
		Если ЗначениеЗаполнено(ТекРесурс) И СтруктураДополненияПоказателей.Свойство(ТекРесурс) Тогда
			КоличествоДополнений=СтруктураДополненияПоказателей[ТекРесурс].Количество();
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки+КоличествоДополнений);
			ОбластьКолонки.Объединить();
		Иначе
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		КонецЕсли;
		
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Если ОтображатьПоказатель Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекРесурс;
			ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		
		ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		НомерКолонки = НомерКолонки + КоличествоДополнений + 1;
	КонецЦикла;
	ТекНомерКолонки = НомерПервойКолонки;
	СчетчикФункций=0;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		СчетчикПоказателей = 0;
		
		КоличествоДополнений = 0;
		Если СтруктураДополненияПоказателей.Свойство(ТекФункция.ИмяРесурса) Тогда
			КоличествоДополнений = СтруктураДополненияПоказателей[ТекФункция.ИмяРесурса].Количество();
			//				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки,
			//				НомерСтроки, ТекНомерКолонки+КоличествоДополнений);
			////				ОбластьКолонки.Объединить();
			//			Иначе
			//				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
		КонецЕсли;
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки+КоличествоДополнений);
		ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСлева,ГраницаМакета.ФункцииИтог.ГраницаСлева);
		ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиИтог.ГраницаСверху;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ПоказателиИтог.ГраницаСправа;
		ОбластьКолонки.ГраницаСнизу = ГраницаМакета.ПоказателиИтог.ГраницаСнизу;
		ТекНомерКолонки = ТекНомерКолонки+КоличествоДополнений+1;
		
		СчетчикФункций=СчетчикФункций+1;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииИтог.ГраницаСправа;
	КонецЦикла;
	ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСправа;
	
	ОбластьПостроителя = МакетОтчета.Область("R" + НомерСтроки);
	ОбластьПостроителя.Имя = "ОбщиеИтоги";
	ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, 3, НомерСтроки, НачальныйНомерВыводаИтогов - 1);
	ОбластьПостроителя.Объединить();
	ОбластьПостроителя.Текст                   = ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Представление; //"Итог";
	ОбластьПостроителя.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ОбластьПостроителя.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьПостроителя.ГраницаСлева  = ГраницаМакета.ИзмеренияИтог.ГраницаСлева;
	ОбластьПостроителя.ГраницаСверху = ГраницаМакета.ИзмеренияИтог.ГраницаСверху;
	ОбластьПостроителя.ГраницаСнизу  = ГраницаМакета.ИзмеренияИтог.ГраницаСнизу;
	ОбластьПостроителя.ГраницаСправа = ГраницаМакета.ИзмеренияИтог.ГраницаСправа;
	
	ОбластьПодвалаТаблицы = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НомерКолонки - 1);
	ОбластьПодвалаТаблицы.Шрифт         = ОформлениеИтоги.Шрифт;
	ОбластьПодвалаТаблицы.ЦветТекста    = ОформлениеИтоги.ЦветТекста;
	ОбластьПодвалаТаблицы.ЦветФона      = ОформлениеИтоги.ЦветФона;
	
	ОбластьПостроителя = МакетОтчета.Область("R" + (МакетОтчета.ВысотаТаблицы + 1));
	ОбластьПостроителя.Имя = "ПодвалТаблицы";
	
	ОбластьПостроителя = МакетОтчета.Область("R" + (МакетОтчета.ВысотаТаблицы + 1));
	ОбластьПостроителя.Имя = "Подвал";
	
	ОбластьПостроителя = МакетОтчета.Область("R1:R" + (ВысотаЗаголовка + 2));
	ОбластьПостроителя.Имя = "ФиксированныеСтроки";    
	
	ОбластьПостроителя = МакетОтчета.Область("C1:C" + (НачальныйНомерВыводаКолонок - ?(ВыводитьДополнительныеПоляВОтдельнойКолонке, ДополнительныеПоляОтчета.Количество(), КоличествоДополнительныеПоляОтчета) - 1));
	ОбластьПостроителя.Имя = "ФиксированныеКолонки";
	
	Для к = 1 по ВысотаЗаголовка Цикл
		ТекОбласть = МакетОтчета.Область(к, 2, к, МакетОтчета.ШиринаТаблицы);
		ТекОбласть.ПоВыделеннымКолонкам = Истина;
		ТекОбласть.РазмещениеТекста     = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции	//	отПолучитьМакетПостроителя()

// Формирует список допустимых значений вида сравнения
Функция ПолучитьСписокВидовСравнения(ТекТипЗначения) Экспорт
	
	ВидыСравнения = Новый ТаблицаЗначений;
	ВидыСравнения.Колонки.Добавить("ВидСравнения");
	ВидыСравнения.Колонки.Добавить("ЧислоВида");
	
	Для Каждого ТекТип Из ТекТипЗначения.Типы() Цикл
		ТекСтрока = ВидыСравнения.Добавить();
		ТекСтрока.ВидСравнения = ВидСравнения.Равно;
		ТекСтрока.ЧислоВида    = 1;
		
		ТекСтрока = ВидыСравнения.Добавить();
		ТекСтрока.ВидСравнения = ВидСравнения.НеРавно;
		ТекСтрока.ЧислоВида    = 1;
		
		ТекСтрока = ВидыСравнения.Добавить();
		ТекСтрока.ВидСравнения = ВидСравнения.ВСписке;
		ТекСтрока.ЧислоВида    = 1;
		
		ТекСтрока = ВидыСравнения.Добавить();
		ТекСтрока.ВидСравнения = ВидСравнения.НеВСписке;
		ТекСтрока.ЧислоВида    = 1;
		
		Если Справочники.ТипВсеСсылки().СодержитТип(ТекТип) И Метаданные.НайтиПоТипу(ТекТип).Иерархический Тогда
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.ВСпискеПоИерархии;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.НеВСпискеПоИерархии;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.ВИерархии;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.НеВИерархии;
			ТекСтрока.ЧислоВида    = 1;
			
		ИначеЕсли ТекТип = Тип("Число") или ТекТип = Тип("Строка") или ТекТип = Тип("Дата") Тогда
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.Больше;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.БольшеИлиРавно;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.Меньше;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.МеньшеИлиРавно;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.Интервал;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.ИнтервалВключаяНачало;
			ТекСтрока.ЧислоВида    = 1;
			
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.ИнтервалВключаяОкончание;
			ТекСтрока.ЧислоВида    = 1;
		КонецЕсли;
		
		Если ТекТип = Тип("Строка") Тогда
			ТекСтрока = ВидыСравнения.Добавить();
			ТекСтрока.ВидСравнения = ВидСравнения.Содержит;
			ТекСтрока.ЧислоВида    = 1;
		КонецЕсли;
	КонецЦикла;
	
	ВидыСравнения.Свернуть("ВидСравнения", "ЧислоВида");
	
	КоличествоТипов = ТекТипЗначения.Типы().Количество();
	
	СписокВидовСравнения = Новый СписокЗначений;
	Для Каждого ТекСтрока Из ВидыСравнения Цикл
		Если ТекСтрока.ЧислоВида = КоличествоТипов Тогда
			СписокВидовСравнения.Добавить(ТекСтрока.ВидСравнения);
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СписокВидовСравнения;
	
Конецфункции // ПолучитьСписокВидовСравнения()

// обработка расшифровки отчета
Функция ТабличныйДокументОбработкаРасшифровки(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	НомерСтроки = Элемент.ТекущаяОбласть.Низ;
	РасшифровкаГруппировки = Элемент.Область(НомерСтроки, 1, НомерСтроки, 1).Расшифровка;
	ПараметрыГруппировки   = Элемент.Область(НомерСтроки, 2, НомерСтроки, 2).Расшифровка;
	
	ИмяГруппировки      = ПараметрыГруппировки.ИмяГруппировки;
	ЗначениеГруппировки = Элемент.Область(НомерСтроки, ПараметрыГруппировки.Колонка, НомерСтроки, ПараметрыГруппировки.Колонка).Расшифровка;
	Если ПараметрыГруппировки.ДетальнаяЗапись Тогда
		РасшифровкаГруппировки.Вставить(ПараметрыГруппировки.ИмяГруппировки, ЗначениеГруппировки);
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;
	Попытка
		РасшифровкаОтчета = Новый Структура();
		// Добавим расшифровку строки/колонки
		Для Каждого ТекЭлемент Из РасшифровкаГруппировки Цикл
			РасшифровкаОтчета.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
		КонецЦикла;
		
		ОтборДетализации = Новый Структура();
		Для Каждого ТекСтрока из ИзмеренияСтроки Цикл
			Если не ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
			ПозицияТочки = Найти(ТекСтрока.ПутьКДанным,".");
			ТекПутьКДанным = ?(ПозицияТочки>0, Лев(ТекСтрока.ПутьКДанным, ПозицияТочки-1), ТекСтрока.ПутьКДанным);
			ОтборДетализации.Вставить(ТекПутьКДанным);
		КонецЦикла;
		
		Для Каждого ТекКолонка из ИзмеренияКолонки Цикл
			Если не ТекКолонка.Использование Тогда Продолжить; КонецЕсли;
			ПозицияТочки = Найти(ТекКолонка.ПутьКДанным,".");
			ТекПутьКДанным = ?(ПозицияТочки>0, Лев(ТекКолонка.ПутьКДанным, ПозицияТочки-1), ТекКолонка.ПутьКДанным);
			ОтборДетализации.Вставить(ТекПутьКДанным);
		КонецЦикла;
		
		// Инициализируем список выбора варианта детализации расшифровки
		ВыбДетализацияРасшифровки = "";
		ДетализацияРасшифровки = Новый СписокЗначений();
		
		//ЗначениеТекущейГруппировки = Неопределено;
		ТекущийОтбор = Неопределено;
		МетаданныеОтчета = Метаданные();
		МетаданныеРасшифровки = Неопределено;
		ИмяМетаданныхОбъекта = Неопределено;
		
		ЭтоГруппировка = (Элемент.Область(Элемент.ФиксацияСверху, Элемент.ТекущаяОбласть.Лево).Расшифровка = Неопределено);
		Если ЭтоГруппировка Тогда
			ПутьТекущейРасшифровки = ПараметрыГруппировки.ПутьКДанным;
			ИмяПоля = ИмяГруппировки;
			ЗначениеПоля = ЗначениеГруппировки;
		Иначе
			ПутьТекущейРасшифровки = Элемент.Область(Элемент.ФиксацияСверху, Элемент.ТекущаяОбласть.Лево).Расшифровка.ПутьКДанным;
			ИмяПоля                = Элемент.Область(Элемент.ФиксацияСверху, Элемент.ТекущаяОбласть.Лево).Расшифровка.ИмяПоля;
			ЗначениеПоля           = Расшифровка;
		КонецЕсли;
				
		ТекущаяВетвь = ДеревоДоступныхПолей.Строки.Найти(ПутьТекущейРасшифровки, "ПутьКДанным", Истина);
		Если ТекущаяВетвь.Отбор И МетаданныеОтчета.Реквизиты.Найти("ПостроительОтчета") <> Неопределено Тогда
			ДетализацияРасшифровки.Добавить(1, "Установить отбор");
			Для Каждого ТекСтрокаОтбора Из ПостроительОтчета.Отбор Цикл
				Если ТекСтрокаОтбора.ПутьКДанным = ПутьТекущейРасшифровки Тогда
					ТекущийОтбор = ТекСтрокаОтбора;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ТекущийОтбор<>Неопределено И Не обЗначениеНеЗаполнено(ТекущийОтбор.Значение) Тогда
				ДетализацияРасшифровки.Добавить(2, "Добавить в отбор");
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			МетаданныеРасшифровки = ЗначениеПоля.Метаданные();
			ИмяОбъектаМетаданных = СтрЗаменить(МетаданныеРасшифровки.ПолноеИмя(), "."+МетаданныеРасшифровки.Имя,"");
			Если ИмяОбъектаМетаданных="Задача"
				ИЛИ ИмяОбъектаМетаданных="Справочник"
				ИЛИ ИмяОбъектаМетаданных="ПланСчетов"
				ИЛИ ИмяОбъектаМетаданных="БизнесПроцесс"
				ИЛИ ИмяОбъектаМетаданных="ПланВидовРасчета"
				ИЛИ ИмяОбъектаМетаданных="ПланВидовХарактеристик" Тогда
				ДетализацияРасшифровки.Добавить(3,"Открыть элемент");
				ДетализацияРасшифровки.Добавить(4,"Найти в списке");
			ИначеЕсли ИмяОбъектаМетаданных="Документ" Тогда
				ДетализацияРасшифровки.Добавить(3,"Открыть документ");
				ДетализацияРасшифровки.Добавить(4,"Найти в журнале");
				ДетализацияРасшифровки.Добавить(5,"Распечатать документ");
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//Если ИмяПоля = "ДокументВыполнения" ИЛИ ИмяПоля =  Тогда
			//Если НЕ ЗначениеЗаполнено(Расшифровка) И ТипЗнч(РасшифровкаГруппировки) = Тип("Структура") Тогда
		Если ТипЗнч(РасшифровкаГруппировки) = Тип("Структура") Тогда
			//Если РасшифровкаГруппировки.Свойство("СервиснаяКампания") И РасшифровкаГруппировки.Свойство("Автомобиль") Тогда
			Варианты=Новый СписокЗначений();
			ДетализацияРасшифровки.Добавить(20, "Записать на ремонт");
			ДетализацияРасшифровки.Добавить(30, "Создать событие");
			//КонецЕсли;
		КонецЕсли;
		//КонецЕсли;
		
		Если (ИмяПоля = "Автомобиль" И ТипЗнч(ЗначениеПоля) = Тип("СправочникСсылка.Автомобили")) ИЛИ 
			(ИмяГруппировки = "Автомобиль" И ТипЗнч(ЗначениеГруппировки) = Тип("СправочникСсылка.Автомобили")) Тогда
			ДетализацияРасшифровки.Добавить(50, "Вывести отчет ""История по заказ-нарядам""");
			
			Если НЕ Метаданные.НайтиПоПолномуИмени("РегистрНакопления.КомплектацияАвтомобилей") = Неопределено Тогда
				ДетализацияРасшифровки.Добавить(60, "Вывести отчет ""История автомобилей""");
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого ТекПоле Из ДеревоДоступныхПолей.Строки Цикл
			Если (ОтборДетализации.Свойство(ТекПоле.ПутьКДанным)) ИЛИ (НЕ ТекПоле.Измерение) ИЛИ (НЕ ТекПоле.Отбор) Тогда Продолжить; КонецЕсли;
			Попытка
				Если СтруктураСвязиСвойств.Свойство(ТекПоле.Имя) Тогда Продолжить; КонецЕсли;
			Исключение КонецПопытки;
			ТекЭлемент = ДетализацияРасшифровки.Добавить(ТекПоле, ТекПоле.Представление);
			Если ТекПоле.Имя = "ПериодРегистратор" Тогда
				ВыбДетализацияРасшифровки = ТекЭлемент;
			КонецЕсли;
		КонецЦикла;
		Если ТипЗнч(ВыбДетализацияРасшифровки) = Тип("ЭлементСпискаЗначений") Тогда
			ДетализацияРасшифровки.Сдвинуть(ВыбДетализацияРасшифровки, ДетализацияРасшифровки.Количество() - ДетализацияРасшифровки.Индекс(ВыбДетализацияРасшифровки) - 1);
		КонецЕсли;
		
		// если необходимо, добавим возможность расшифровки по движениям с остатками
		Попытка // переменная ИмяОтчетаДвиженийСОстатками есть не у всех отчетов
			СтрокаРегистратора = ДеревоДоступныхПолей.Строки.Найти("ПериодРегистратор", "ПутьКДанным");
			Если СтрокаРегистратора <> Неопределено Тогда
				ИмяОтчетаДвиженийСОстатками = ИмяОтчетаДвиженийСОстатками;
				ТекЭлемент = ДетализацияРасшифровки.Добавить(СтрокаРегистратора, "Документ движения (с остатками)");
				ВыбДетализацияРасшифровки = ТекЭлемент;
			КонецЕсли;
		Исключение КонецПопытки;
		
		ВыбДетализацияРасшифровки = ДетализацияРасшифровки.ВыбратьЭлемент("Выберите вариант расшифровки ...", ВыбДетализацияРасшифровки);
		Если ВыбДетализацияРасшифровки = Неопределено Тогда Возврат Истина; КонецЕсли;
		
		Если ВыбДетализацияРасшифровки.Значение=1 ИЛИ ВыбДетализацияРасшифровки.Значение=2 Тогда
			Отбор = ПостроительОтчета.Отбор;
			СчетчикОтбора = 0;
			КоличествоОтборов = Мин(Отбор.Количество() - 1, 2);
			ЕстьМестоДляОтбора = Ложь;
			Пока СчетчикОтбора <= КоличествоОтборов Цикл
				ПолеОтбора = Отбор[СчетчикОтбора];
				Если Не ПолеОтбора.Использование Тогда ЕстьМестоДляОтбора = Истина; Прервать; КонецЕсли;
				СчетчикОтбора = СчетчикОтбора+1;
			КонецЦикла;
			
			Если ТекущийОтбор=Неопределено Тогда
				ТекущийОтбор = Отбор.Добавить(ТекущаяВетвь.ПутьКДанным);
				Представление = ТекущаяВетвь.Представление;
				Если ТекущаяВетвь.Родитель <> Неопределено Тогда
					Если ТекущаяВетвь.Родитель.Имя = "Свойства" Тогда
						Представление = Представление + " (" + ТекущаяВетвь.Родитель.Родитель.Представление + ")";
					Иначе Представление = Представление + " (" + ТекущаяВетвь.Родитель.Представление + ")";
					КонецЕсли;
				КонецЕсли;
				ТекущийОтбор.Представление = Представление;
			КонецЕсли;
			
			ТекущийОтбор.Использование = Истина;
			Если ВыбДетализацияРасшифровки.Значение=1 Тогда
				ТекущийОтбор.ВидСравнения = ВидСравнения.Равно;
				ТекущийОтбор.Значение = ЗначениеПоля;
			Иначе
				Если ТипЗнч(ТекущийОтбор.Значение) = Тип("СписокЗначений") Тогда
					ТекущийОтбор.Значение.Добавить(ЗначениеПоля);
				Иначе
					СписокОтбора = Новый СписокЗначений;
					СписокОтбора.Добавить(ТекущийОтбор.Значение);
					СписокОтбора.Добавить(ЗначениеПоля);
					ТекущийОтбор.ВидСравнения = ВидСравнения.ВСписке;
					ТекущийОтбор.Значение = СписокОтбора;
				КонецЕсли;
			КонецЕсли;
			
			ИндексТекущегоОтбора = Отбор.Индекс(ТекущийОтбор);
			Если ЕстьМестоДляОтбора И ИндексТекущегоОтбора>=СчетчикОтбора Тогда
				Отбор.Сдвинуть(ИндексТекущегоОтбора, -(ИндексТекущегоОтбора-СчетчикОтбора));
			КонецЕсли;
			
			ВысотаПанели = 5;
			Для СчетчикОтбора = 0 По КоличествоОтборов Цикл
				ЭтаФорма.ЭлементыФормы["ПанельФильтра" + (СчетчикОтбора+1)].Свертка = РежимСверткиЭлементаУправления.Нет;	
				ПолеОтбора = Отбор[СчетчикОтбора];
				ПутьОтбора = "ПостроительОтчета.Отбор." + ПолеОтбора.Имя;
				ЭтаФорма.ЭлементыФормы["ИспользованиеОтбор" + (СчетчикОтбора + 1)].Данные = ПутьОтбора + ".Использование";
				ЭтаФорма.ЭлементыФормы["ИспользованиеОтбор" + (СчетчикОтбора + 1)].Заголовок = ПолеОтбора.Представление + ":";
				ЭтаФорма.ЭлементыФормы["ВидСравненияОтбор" + (СчетчикОтбора + 1)].СписокВыбора = ПолучитьСписокВидовСравнения(ПолеОтбора.ТипЗначения);
				ЭтаФорма.ЭлементыФормы["ВидСравненияОтбор" + (СчетчикОтбора + 1)].Данные = ПутьОтбора + ".ВидСравнения";
				ЭтаФорма.ЭлементыФормы["ЗначениеОтбор" + (СчетчикОтбора + 1)].Данные = ПутьОтбора + ".Значение";
				ЭтаФорма.ЭлементыФормы["ДатаНачалаОтбор" + (СчетчикОтбора + 1)].Данные = ПутьОтбора + ".ЗначениеС";
				ЭтаФорма.ЭлементыФормы["ДатаКонцаОтбор" + (СчетчикОтбора + 1)].Данные = ПутьОтбора + ".ЗначениеПо";
				ВидСравненияОтборПриИзменении(ЭтаФорма, ЭтаФорма.ЭлементыФормы["ВидСравненияОтбор" + (СчетчикОтбора + 1)]);
				ВысотаПанели = ВысотаПанели + 26;
			КонецЦикла;
			
			ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Отбор.Доступность = Истина;
			ЭтаФорма.ЭлементыФормы.ПанельФильтра.Свертка = РежимСверткиЭлементаУправления.Нет;
			ЭтаФорма.ЭлементыФормы.ПанельФильтра.Высота = ВысотаПанели;
			ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Отбор.Пометка = Истина;
			
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=3 Тогда
			ОткрытьЗначение(ЗначениеПоля);
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=4 Тогда
			ФормаСпискаРасшифровки = Неопределено;
			Если ИмяОбъектаМетаданных="Задача" Тогда
				ФормаСпискаРасшифровки=Задачи[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="Справочник" Тогда
				ФормаСпискаРасшифровки=Справочники[ЗначениеПоля.Метаданные().Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="ПланСчетов" Тогда
				ФормаСпискаРасшифровки=ПланыСчетов[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="БизнесПроцесс" Тогда
				ФормаСпискаРасшифровки=БизнесПроцессы[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="ПланВидовРасчета" Тогда
				ФормаСпискаРасшифровки=ПланыВидовРасчета[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="ПланВидовХарактеристик" Тогда
				ФормаСпискаРасшифровки=ПланыВидовХарактеристик[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			ИначеЕсли ИмяОбъектаМетаданных="Документ" Тогда
				ФормаСпискаРасшифровки=Документы[МетаданныеРасшифровки.Имя].ПолучитьФормуСписка();
			КонецЕсли;
			Если ФормаСпискаРасшифровки<>Неопределено Тогда
				ФормаСпискаРасшифровки.ПараметрТекущаяСтрока=ЗначениеПоля;
				ФормаСпискаРасшифровки.Открыть();
			КонецЕсли;
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=5 Тогда
			ПечатныеФормы = дкПолучитьСписокПечатныхФорм(ЗначениеПоля, МетаданныеРасшифровки.Имя, Ложь);
			СписокФорм = Новый СписокЗначений();
			
			Для Каждого ТекМакет Из ПечатныеФормы Цикл
				СписокФорм.Добавить(ТекМакет.Ключ, ТекМакет.Значение);
			КонецЦикла;
			
			// пользователь выбирает
			Форма = ЭтаФорма.ВыбратьИзМеню(СписокФорм);
			
			Если НЕ Форма=Неопределено Тогда
				СохранитьЗначение(СокрЛП(МетаданныеРасшифровки.Имя)+"ПечатнаяФорма",Форма.Представление);
				ЗначениеПоля.ПолучитьОбъект().Печать(Форма.Представление);
			КонецЕсли;
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=20 Тогда
			НовыйДокумент = Документы.ЗаказНаряд.СоздатьДокумент();
			НовыйДокумент.Заполнить(Неопределено);
			НовыйДокумент.ТекущаяВалютаДокумента = НовыйДокумент.ВалютаДокумента;
			НовыйДокумент.ТекущийКурсДокумента   = НовыйДокумент.КурсДокумента;
			ФормаДокумента                       = НовыйДокумент.ПолучитьФорму();
			ВладелецНеДобавлен                   = Истина;
			Если РасшифровкаГруппировки.Свойство("Владелец") Тогда
				НовыйДокумент.Заказчик           = РасшифровкаГруппировки.Владелец;
				ВладелецНеДобавлен               = Ложь;
			КонецЕсли;
			Если РасшифровкаГруппировки.Свойство("Автомобиль") И ТипЗнч(РасшифровкаГруппировки.Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
				НовыйДокумент.Автомобиль         = РасшифровкаГруппировки.Автомобиль;
				Если ВладелецНеДобавлен Тогда
					НовыйДокумент.Заказчик       = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(НовыйДокумент.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, НовыйДокумент.Дата);
				КонецЕсли;
			КонецЕсли;
			НовыйДокумент.ОбработкаРеквизита("Заказчик",,);
			Если РасшифровкаГруппировки.Свойство("СервиснаяКампания") Тогда
				НовыйДокумент.СервиснаяКампания  = РасшифровкаГруппировки.СервиснаяКампания;
				НовыйДокумент.ВидРемонта		 = РасшифровкаГруппировки.СервиснаяКампания.ВидРемонта;
				ФормаДокумента.СервиснаяКампанияПриИзменении(Неопределено);
			КонецЕсли;
			ФормаДокумента.Открыть();
			
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=30 Тогда
			
			ДокументСобытие = Документы.Событие.СоздатьДокумент();
			ДокументСобытие.Заполнить(Неопределено);
			Если РасшифровкаГруппировки.Свойство("СервиснаяКампания") Тогда
				СервиснаяКампания = РасшифровкаГруппировки.СервиснаяКампания;
			Иначе
				СервиснаяКампания = "";
			КонецЕсли;
			Если РасшифровкаГруппировки.Свойство("Автомобиль") Тогда
				Автомобиль = РасшифровкаГруппировки.Автомобиль;
			Иначе
				Автомобиль = "";
			КонецЕсли;
			
			ДокументСобытие.Тема          = "Выполнение сервисной кампании <" + СокрЛП(СервиснаяКампания) + "> для автомобиля <"+СокрЛП(Автомобиль)+">";
			ДокументСобытие.ВидСобытия    = Перечисления.ВидыСобытий.Прочее;
			ФормаДокумента                = ДокументСобытие.ПолучитьФорму("ФормаДокумента");
			ВладелецНеДобавлен            = Истина;
			Если РасшифровкаГруппировки.Свойство("Владелец") Тогда
				ФормаДокумента.Контрагент = РасшифровкаГруппировки.Владелец;
				ВладелецНеДобавлен        = Ложь;
			КонецЕсли;
			Если ВладелецНеДобавлен И ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Автомобили") Тогда
				ФормаДокумента.Контрагент = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин, ДокументСобытие.Дата);
			КонецЕсли;
			ФормаДокумента.Открыть();
			
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=50 Тогда
			
			Если ИмяПоля = "Автомобиль" И ТипЗнч(ЗначениеПоля) = Тип("СправочникСсылка.Автомобили") Тогда
				Автомобиль = ЗначениеПоля;
			ИначеЕсли ИмяГруппировки = "Автомобиль" И ТипЗнч(ЗначениеГруппировки) = Тип("СправочникСсылка.Автомобили") Тогда
				Автомобиль = ЗначениеГруппировки
			Иначе
				Возврат Истина;
			КонецЕсли;
			
			// заполним параметры отчета
			Отчет = Отчеты.ИсторияПоЗаказНарядам.Создать();
			Отчет.ВидОтчета         = Перечисления.ВидыОтчетов.Обороты;
			Отчет.РежимВыводаОтчета = Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
			Отчет.РежимНастройки    = Перечисления.РежимыНастройкиОтчетов.Эксперт;
			Отчет.ИмяФормыНастроек  = "НастройкиОбороты";
			Отчет.ЗаполнитьНачальныеНастройки("ТекстЗапросаОбороты");
			
			// показатели все
			Для Каждого СтрокаПоказателей Из Отчет.Показатели Цикл
				СтрокаПоказателей.Использование=Истина;
			КонецЦикла;
			// фильтры
			Отбор = Отчет.ПостроительОтчета.Отбор;
			ТекОтбор = Отбор.Найти("Автомобиль");
			Если ТекОтбор=Неопределено Тогда
				ТекОтбор = Отбор.Добавить("Автомобиль", "Автомобиль", Отчет.ДеревоДоступныхПолей.Строки.Найти("Автомобиль","ПутьКДанным").Представление);
			КонецЕсли;
			
			ТекОтбор.ВидСравнения  = ВидСравнения.Равно;
			ТекОтбор.Значение      = Автомобиль;
			ТекОтбор.Использование = Истина;
			
			Отчет.ДатаНачала   = Дата(1, 1, 1);
			Отчет.ДатаКонца    = КонецМесяца(ТекущаяДата());
			Отчет.ВалютаОтчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			
			ФормаОтчета=ПолучитьОбщуюФорму("Отчет");
			ФормаОтчета.ОтчетОбъект = Отчет;
			ФормаОтчета.Заголовок   = "История по заказ-нарядам";
			ФормаОтчета.Открыть();
			
		ИначеЕсли ВыбДетализацияРасшифровки.Значение=60 Тогда
			//В расшифровке Автомобиля предусмотреть вызов отчета 
			//	Для Автосервиса - "История по заказ-нарядам"
			//	Для Автосалона - "История автомобилей"
			
			Если ИмяПоля = "Автомобиль" И ТипЗнч(ЗначениеПоля) = Тип("СправочникСсылка.Автомобили") Тогда
				Автомобиль = ЗначениеПоля;
			ИначеЕсли ИмяГруппировки = "Автомобиль" И ТипЗнч(ЗначениеГруппировки) = Тип("СправочникСсылка.Автомобили") Тогда
				Автомобиль = ЗначениеГруппировки
			Иначе
				Возврат Истина;
			КонецЕсли;
			
			Если Автомобиль.Пустая() Тогда
				Возврат Истина;
			КонецЕсли;
			
			АвтомобильОбъект = Автомобиль.ПолучитьОбъект();
			АвтомобильОбъект.ОтчетИсторияАвтомобиля(Дата(1, 1, 1), ТекущаяДата());
			
		Иначе
			
			Если ВыбДетализацияРасшифровки.Представление = "Документ движения (с остатками)" Тогда
				ФормаРасшифровки = Отчеты[ИмяОтчетаДвиженийСОстатками].ПолучитьФорму("НастройкиДвиженияСОстатками",);
				ФормаРасшифровки.ДатаНачала = ДатаНачала;
				ФормаРасшифровки.ДатаКонца = ДатаКонца;
				ФормаРасшифровки.ИспользоватьАвтоотступ = ИспользоватьАвтоотступ;
			Иначе
				ФормаРасшифровки = Отчеты[Метаданные().Имя].ПолучитьФорму(ИмяФормыНастроек,);
				Для Каждого ТекРеквизит Из Метаданные().Реквизиты Цикл
					Если ТекРеквизит.Имя = "ПостроительОтчета" Тогда Продолжить; КонецЕсли;
					ФормаРасшифровки[ТекРеквизит.Имя] = ЭтотОбъект[ТекРеквизит.Имя];
				Конеццикла;
			КонецЕсли;
			
			ФормаРасшифровки.ЗаполнитьНачальныеНастройки(ФормаРасшифровки.ИмяМакета);
			ФормаРасшифровки.Показатели.Загрузить(Показатели.Выгрузить());
			ФормаРасшифровки.Функции.Загрузить(Функции.Выгрузить());
			
			ФормаРасшифровки.ПостроительОтчета.УстановитьНастройки(ПостроительОтчета.ПолучитьНастройки(Истина, Ложь, Ложь, Ложь, Ложь), Истина, Ложь, Ложь, Ложь, Ложь);
			ФормаРасшифровки.ПостроительОтчета.НастроитьРасшифровку(ФормаРасшифровки.ПостроительОтчета, РасшифровкаОтчета);
			ФормаРасшифровки.ЗаполнитьНастройки = Ложь;
			
			Попытка // некоторые отчеты могут не содержать в заголовке таблицы расшифровки показателя
				РасшифровкаПоказателя = Элемент.Область(Элемент.ФиксацияСверху, Элемент.ТекущаяОбласть.Лево).Расшифровка.Показатель;
				Для Каждого ТекПоказатель Из ФормаРасшифровки.Показатели Цикл
					ТекПоказатель.Использование = ТекПоказатель.Имя = РасшифровкаПоказателя.ИмяРесурса;
				КонецЦикла;
			Исключение КонецПопытки;	
			
			к = 0;
			Пока к <= ФормаРасшифровки.ПостроительОтчета.Отбор.Количество() - 1 Цикл
				Если НЕ ФормаРасшифровки.ПостроительОтчета.Отбор[к].Использование Тогда
					ФормаРасшифровки.ПостроительОтчета.Отбор.Удалить(к);
				Иначе
					Попытка
						Если ФормаРасшифровки.ПостроительОтчета.Отбор[к].ВидСравнения = ВидСравнения.ВИерархии И 
							обЗначениеНеЗаполнено(ФормаРасшифровки.ПостроительОтчета.Отбор[к].Значение) Тогда
							ФормаРасшифровки.ПостроительОтчета.Отбор[к].ВидСравнения = ВидСравнения.Равно;
						ИначеЕсли ФормаРасшифровки.ПостроительОтчета.Отбор[к].Значение.ЭтоГруппа Тогда
							ВыбраннаяСтрока = ФормаРасшифровки.ПостроительОтчета.Отбор[к];
							СтрокаПоиска = ФормаРасшифровки.ДеревоДоступныхПолей.Строки.Найти(ВыбраннаяСтрока.ПутьКДанным+".Родитель","ПутьКДанным", Истина);
							Если СтрокаПоиска = Неопределено Тогда 
								к = к + 1;
								Продолжить; 
							КонецЕсли;
							ПутьКДанным = СтрокаПоиска.ПутьКДанным;
							Представление = СтрокаПоиска.Представление;
							Использование = ВыбраннаяСтрока.Использование;
							Значение = ВыбраннаяСтрока.Значение;
							Отборы = ФормаРасшифровки.ПостроительОтчета.Отбор;
							ТекИндекс = Отборы.Индекс(ВыбраннаяСтрока);
							Отборы.Удалить(ТекИндекс);
							
							Попытка
								ТекОтбор = Отборы.Добавить(ПутьКДанным);
								ТекОтбор.Представление = Представление;
								ТекОтбор.Использование = Использование;
								ТекОтбор.ВидСравнения = ВидСравнения.ВИерархии;;
								ТекОтбор.Значение = Значение;
							Исключение 
							КонецПопытки;
							Если Отборы.Количество() - 1 - ТекИндекс > 0 Тогда
								Отборы.Сдвинуть(Отборы.Количество() - 1, -(Отборы.Количество() - 1 - ТекИндекс));
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
					к = к + 1;
				КонецЕсли;
			КонецЦикла;
			
			Попытка ФормаРасшифровки.ИзмеренияСтроки.Очистить(); Исключение КонецПопытки;
			
			ТекИзмерение = ФормаРасшифровки.ИзмеренияСтроки.Добавить();
			ТекИзмерение.Использование = Истина;
			ТекИзмерение.ПутьКДанным   = ВыбДетализацияРасшифровки.Значение.ПутьКДанным;
			ТекИзмерение.Представление = ВыбДетализацияРасшифровки.Значение.Представление;
			ТекИзмерение.ТипИзмерения  = ТипИзмеренияПостроителяОтчета.Элементы;
			Если ВыбДетализацияРасшифровки.Представление = "Документ движения (с остатками)" Тогда
				ТекИзмерение.Фиксированное = Истина;
			Иначе
				Если ФормаРасшифровки.ВидОтчета = Перечисления.ВидыОтчетов.ДвиженияСОстатками Тогда
					ТекИзмерение = ФормаРасшифровки.ИзмеренияСтроки.Добавить();
					ТекИзмерение.Использование = Истина;
					ТекИзмерение.ПутьКДанным   = "ПериодРегистратор";
					ТекИзмерение.Представление = "Документ движения";
					ТекИзмерение.ТипИзмерения  = "Элементы";
					ТекИзмерение.Фиксированное = Истина;
				Иначе
					Попытка
						ФормаРасшифровки.ИзмеренияКолонки.Загрузить(ИзмеренияКолонки.Выгрузить());
						НайденнаяКолонка = ФормаРасшифровки.ИзмеренияКолонки.Найти(ВыбДетализацияРасшифровки.Значение.ПутьКДанным, "ПутьКДанным");
						Если НайденнаяКолонка<>Неопределено Тогда
							ФормаРасшифровки.ИзмеренияКолонки.Удалить(НайденнаяКолонка);
						КонецЕсли;
						
					Исключение КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
			отФорматированиеПостроителяОтчета(ФормаРасшифровки);
			отДействияФормыСформировать(ФормаРасшифровки, ФормаРасшифровки.ЭлементыФормы.ДействияФормы.Кнопки.Сформировать);
		КонецЕсли;
	Исключение КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Обработчик изменения вида сравнения панели быстрых отборов
// управляет видимостью элементов управления 
Процедура ВидСравненияОтборПриИзменении(ЭтаФорма, Элемент)
	
	ИмяОтбора = Сред(Элемент.Имя, Найти(Элемент.Имя, "ВидСравнения") + СтрДлина("ВидСравнения"));
	
	// Управление полями фильтра в зависимости от вида сравнения
	Если Элемент.Значение = ВидСравнения.Интервал или
		Элемент.Значение = ВидСравнения.ИнтервалВключаяГраницы или
		Элемент.Значение = ВидСравнения.ИнтервалВключаяНачало или
		Элемент.Значение = ВидСравнения.ИнтервалВключаяОкончание Тогда
		
		ЭтаФорма.ЭлементыФормы["Значение" + ИмяОтбора].Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы["тДатаНачала" + ИмяОтбора].Видимость = Истина;
		ЭтаФорма.ЭлементыФормы["ДатаНачала" + ИмяОтбора].Видимость = Истина;
		ЭтаФорма.ЭлементыФормы["тДатаКонца" + ИмяОтбора].Видимость = Истина;
		ЭтаФорма.ЭлементыФормы["ДатаКонца" + ИмяОтбора].Видимость = Истина;
		
	Иначе
		ЭлементФильтра = ЭтаФорма.ЭлементыФормы["Значение" + ИмяОтбора];
		ЭлементФильтра.Видимость = Истина;
		Если Элемент.Значение = ВидСравнения.ВСписке или
			Элемент.Значение = ВидСравнения.НеВСписке или
			Элемент.Значение = ВидСравнения.ВСпискеПоИерархии или
			Элемент.Значение = ВидСравнения.НеВСпискеПоИерархии Тогда
			ЭлементФильтра.ОграничениеТипа = Новый ОписаниеТипов("СписокЗначений");
			
		Иначе
			ЭлементФильтра.ОграничениеТипа = Новый ОписаниеТипов(ЭлементФильтра.ТипЗначения,, "СписокЗначений");
		КонецЕсли;
		
		ЭтаФорма.ЭлементыФормы["тДатаНачала" + ИмяОтбора].Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы["ДатаНачала" + ИмяОтбора].Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы["тДатаКонца" + ИмяОтбора].Видимость = Ложь;
		ЭтаФорма.ЭлементыФормы["ДатаКонца" + ИмяОтбора].Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли