
&НаКлиенте
Перем ЗакрытиеРазрешено;

#Область ПредпросмотрТаблиц 
&НаКлиенте
Функция ПолучитьПолноеИмяФормы(ИмяФормы)
    СимволТочка = ".";
    ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
    Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл ПозицияТочки = ПозицияТочки - 1; КонецЦикла; //
    Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуОстатковНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	ТаблицаДляПредпросмотра = Обработка.ПолучитьТаблицуОстатков(Обработка.КонтрагентыПоставщики,Обработка.ПапкаНоменклатуры,Обработка.СкладыКомпании);
	ЗначениеВРеквизитФормы(Обработка,"Объект");
	Возврат ТаблицаДляПредпросмотра;
КонецФункции

&НаСервере
Функция ЗаполнитьТаблицуРеализацийНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Если НЕ ЗначениеЗаполнено(Обработка.НаДату) Тогда
		Обработка.НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	ТаблицаДляПредпросмотра = Обработка.ПолучитьТаблицуРеализаций(Обработка.КонтрагентыПоставщики,
		Обработка.ПапкаНоменклатуры,
		Обработка.СкладыКомпании,
		Обработка.КонтрагентыИсключенияДляРеализаций,
		Обработка.НаДату);
	ЗначениеВРеквизитФормы(Обработка,"Объект");
	Возврат ТаблицаДляПредпросмотра;
КонецФункции

&НаКлиенте
Процедура КомандаПредпросмотрОстатков(Команда)
	ТаблицаДляПредпросмотра = ЗаполнитьТаблицуОстатковНаСервере();
	Форма = ПолучитьФорму(ПолучитьПолноеИмяФормы("ПредпросмотрТаблицы"));
	Форма.ТабличноеПолеПредпросмотр = ТаблицаДляПредпросмотра;
	Форма.открыть(); 
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредпросмотрРеализаций(Команда)
	ТаблицаДляПредпросмотра = ЗаполнитьТаблицуРеализацийНаСервере();
	Форма = ПолучитьФорму(ПолучитьПолноеИмяФормы("ПредпросмотрТаблицы"));
	Форма.ТабличноеПолеПредпросмотр = ТаблицаДляПредпросмотра;
	Форма.открыть();
КонецПроцедуры
#КонецОбласти


#Область Выгрузка 
&НаСервере
Процедура КомандаВыгрузитьОстаткиНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыгрузитьОстатки();
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьОстатки(Команда)
	КомандаВыгрузитьОстаткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыгрузитьРеализацииНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВыгрузитьРеализации(Обработка.НаДату);
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузитьРеализации(Команда)
	КомандаВыгрузитьРеализацииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область Настройки 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВосстановитьНастройки();
	ЗначениеВРеквизитФормы(Обработка,"Объект");
КонецПроцедуры

&НаСервере
Процедура КомандаСохранитьНастройкиНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.СохранитьНастройки();
	ЗначениеВРеквизитФормы(Обработка,"Объект");
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	КомандаСохранитьНастройкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВсемПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность = Истина И ЗакрытиеРазрешено=Неопределено Тогда
		Отказ = Истина;
		ПоказатьВопрос(
          Новый ОписаниеОповещения("ПередЗакрытиемФормы", ЭтотОбъект),
          "Настройки были изменены. Записать настройки?", 
          РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытиемФормы(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		КомандаСохранитьНастройкиНаСервере();
		ЗакрытиеРазрешено = Истина;
		Закрыть();
	Иначе
		ЗакрытиеРазрешено = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура КомандаОткрытьРегистр(Команда)
	ПолучитьФорму("РегистрСведений.БТ_ЛогированиеИнфообменаGeely.ФормаСписка").Открыть();
КонецПроцедуры










