Функция СформироватьСтруктуруТаблицыОшибок() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.ns_Магазины"));
	ОписаниеТиповМагазин = Новый ОписаниеТипов(Массив);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
	Массив.Добавить(Тип("СправочникСсылка.ns_ЗапчастиИАксессуары"));
	Массив.Добавить(Тип("СправочникСсылка.ns_БытоваяЭлектроника"));
	Массив.Добавить(Тип("СправочникСсылка.ns_ДляДомаИДачи"));
	Массив.Добавить(Тип("СправочникСсылка.ns_ДляБизнеса"));
	Массив.Добавить(Тип("СправочникСсылка.ns_ХоббиИОтдых"));
	Массив.Добавить(Тип("СправочникСсылка.ns_МотоциклыИМототехника"));
	Массив.Добавить(Тип("СправочникСсылка.ns_ЛичныеВещи"));
	ОписаниеТиповНоменклатура = Новый ОписаниеТипов(Массив);
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Магазин", ОписаниеТиповМагазин);
	ТаблицаОшибок.Колонки.Добавить("Ошибка", ОписаниеТиповСтрока);
	ТаблицаОшибок.Колонки.Добавить("Номенклатура", ОписаниеТиповНоменклатура);
	
	Возврат ТаблицаОшибок;
КонецФункции 

Функция ЕстьОшибкиВыгрузки(Данные, Остатки, Картинки, ТаблицаОшибок) Экспорт
	ЕстьОшибка = Ложь;
	
	Если НЕ ns_ОбщегоНазначенияПовтИсп.ПолучитьВыгружатьБезОстатков() Тогда
		Если НЕ ЕстьОстаток(Данные, Остатки) Тогда
			ДобавитьОшибку("Нет на остатках", Данные, ТаблицаОшибок); 
			ЕстьОшибка = Истина;	
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Данные.Category) Тогда
		ДобавитьОшибку("Не заполнена Категория (Category)", Данные, ТаблицаОшибок);
		Если ЕстьОшибка = Ложь Тогда
			ЕстьОшибка = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	Если Строка(Данные.Category) = "Запчасти и аксессуары" Тогда
		ЕстьОшибкаВКатегории = ns_ЗапчастиИАксессуарыВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок);
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	ИначеЕсли Строка(Данные.Category.Родитель) = "Бытовая электроника" Тогда	
		ЕстьОшибкаВКатегории = ns_БытоваяЭлектроникаВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки); 
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	ИначеЕсли Строка(Данные.Category.Родитель) = "Для дома и дачи" Тогда	
		ЕстьОшибкаВКатегории = ns_ДляДомаИДачиВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки); 
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	ИначеЕсли Строка(Данные.Category.Родитель) = "Для бизнеса" Тогда	
		ЕстьОшибкаВКатегории = ns_ДляБизнесаВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки); 
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	ИначеЕсли Строка(Данные.Category.Родитель) = "Хобби и отдых" Тогда	
		ЕстьОшибкаВКатегории = ns_ХоббиИОтдыхВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки); 
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	ИначеЕсли Строка(Данные.Category) = "Мотоциклы и мототехника" Тогда	
		ЕстьОшибкаВКатегории = ns_МотоциклыИМототехникаВалидация.ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки); 
		Если ЕстьОшибка = Ложь И ЕстьОшибкаВКатегории = Истина Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибка;
КонецФункции
 
Функция ЕстьОстаток(Данные, Остатки) Экспорт
	Если ЗначениеЗаполнено(Данные.Характеристика) Тогда
		Идентификатор = Строка(Данные.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Данные.Характеристика.УникальныйИдентификатор());
	Иначе
		Идентификатор = Строка(Данные.Номенклатура.УникальныйИдентификатор());
	КонецЕсли;         
	Остаток = Остатки[Идентификатор];
	Если Остаток = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли Остаток > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции
 
Процедура ДобавитьОшибку(ОписаниеОшибки, Данные, ТаблицаОшибок) Экспорт
	НовСтрока = ТаблицаОшибок.Добавить();
	НовСтрока.Ошибка = ОписаниеОшибки;
	НовСтрока.Номенклатура = Данные.Ссылка;
КонецПроцедуры

Функция ПолучитьДанныеОтчетаИзБазы(НомерОтчетаСОшибками, Адрес) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЖурналРезультатов.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ns_ЖурналРезультатов КАК ns_ЖурналРезультатов
	|ГДЕ
	|	ns_ЖурналРезультатов.НомерВыгрузки = &НомерВыгрузки";
	Запрос.УстановитьПараметр("НомерВыгрузки", НомерОтчетаСОшибками);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	ТЗ = Выборка.Данные.Получить();

	Возврат ПоместитьВоВременноеХранилище(ТЗ, Адрес);
КонецФункции
 