// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовРемонтовЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыРемонта.Ссылка КАК ВидРемонта,
	                    |	ВидыРемонта.Представление КАК ВидРемонтаПредставление
	                    |ИЗ
	                    |	Справочник.ВидыРемонта КАК ВидыРемонта
	                    |ГДЕ
	                    |	ВидыРемонта.ПометкаУдаления = ЛОЖЬ
						|"+?(зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон"),"","И ВидыРемонта.Ссылка<>ЗНАЧЕНИЕ(Справочник.ВидыРемонта.КомплектацияАвтомобиля)")+"
	                    |АВТОУПОРЯДОЧИВАНИЕ");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

// Функция получения возможных состояний заказ-нарядов
//
// Возвращаемое значение:
//   <ТаблицаЗначений>   - таблица значений состояний заказ-нарядов
//
Функция ПолучитьТаблицуВидовСостоянийЗаказНарядов() Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ВидыСостоянийЗаказНарядов.Ссылка КАК ВидыСостоянийЗаказНарядов,
	                    |	ВидыСостоянийЗаказНарядов.Представление КАК ВидыСостоянийЗаказНарядовПредставление
	                    |ИЗ
	                    |	Справочник.ВидыСостоянийЗаказНарядов КАК ВидыСостоянийЗаказНарядов
	                    |ГДЕ
	                    |	ВидыСостоянийЗаказНарядов.ПометкаУдаления = ЛОЖЬ
	                    |	И ВидыСостоянийЗаказНарядов.НедоступноДляВыбора = ЛОЖЬ
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	ВидыСостоянийЗаказНарядов.Порядок");
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьТаблицуВидовСостоянийЗаказНарядов()

// функция парсинга строки с доп. кодами
Функция РабобратьСтрокуДопКодов(стрДопКодов) Экспорт
	ВремТЗ = Новый ТаблицаЗначений();
	ВремТЗ.Колонки.Добавить("ДопКод");
	Стр = СтрЗаменить(стрДопКодов, ";", ",");
	Стр = СтрЗаменить(Стр, " ", "");
	ПозицияРазделителя = Найти(Стр,",");
	
	Пока ПозицияРазделителя <> 0 Цикл
		НоваяСтрока= ВремТЗ.Добавить();
		НоваяСтрока.ДопКод = Лев(Стр,ПозицияРазделителя - 1);
		Стр = Сред(Стр,ПозицияРазделителя+1);
		ПозицияРазделителя = Найти(Стр,",");
	КонецЦикла;
	
	НоваяСтрока= ВремТЗ.Добавить();
	НоваяСтрока.ДопКод = Стр;
	
	
	Возврат ВремТЗ;
КонецФункции

// Процедура открытия калькуляции Audatex
Процедура ОткрытьКалькуляцию(ЭтаФорма, Ссылка, ОткрытиеИзДокумента = Ложь, ДокументОбъект = Неопределено) Экспорт
	// поищем связанные дела
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменСAudaPadWebСрезПоследних.Автор,
	|	ОбменСAudaPadWebСрезПоследних.ЗаказНаряд,
	|	ОбменСAudaPadWebСрезПоследних.ИдентификаторДела,
	|	ОбменСAudaPadWebСрезПоследних.ИдентификаторЗадания,
	|	ОбменСAudaPadWebСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.ОбменСAudaPadWeb.СрезПоследних(, ЗаказНаряд = &ЗаказНаряд) КАК ОбменСAudaPadWebСрезПоследних";
	Запрос.УстановитьПараметр("ЗаказНаряд", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ФормаДиалога = РегистрыСведений.ОбменСAudaPadWeb.ПолучитьФорму("ФормаПользовательскогоСценария",ЭтаФорма);
		ФормаДиалога.РегистрСведенийМенеджерЗаписи.ЗаказНаряд = Ссылка;
		Если ОткрытиеИзДокумента Тогда
			ФормаДиалога.ДокументОбъект = ДокументОбъект;
			ФормаДиалога.ОткытиеИзДокумента	= Истина;
		КонецЕсли;
		ФормаДиалога.Открыть();
	Иначе
		ТекСтрока = Запрос.Выполнить().Выгрузить()[0];
		МенеджерРегистра	= РегистрыСведений.ОбменСAudaPadWeb.СоздатьМенеджерЗаписи();
		МенеджерРегистра.Период					= ТекСтрока.Период;
		МенеджерРегистра.Автор 					= ТекСтрока.Автор;
		МенеджерРегистра.ЗаказНаряд				= ТекСтрока.ЗаказНаряд;			
		МенеджерРегистра.ИдентификаторДела		= ТекСтрока.ИдентификаторДела;
		МенеджерРегистра.Идентификаторзадания	= ТекСтрока.Идентификаторзадания;
		МенеджерРегистра.Прочитать();
		
		ФормаОбмена	= МенеджерРегистра.ПолучитьФорму("ФормаПользовательскогоСценария", ЭтаФорма);
		ФормаОбмена.РегистрСведенийМенеджерЗаписи	= МенеджерРегистра;
		ФормаОбмена.Открыть();

	КонецЕсли;
КонецПроцедуры

// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра "Операции прослеживаемых товаров"
//
// Возвращаемое значение:
//  Строка - текст запроса
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВПроизводстве.Регистратор КАК Регистратор,
	|	ТоварыВПроизводстве.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	|ГДЕ
	|	ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|	И ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ТоварыВПроизводстве.ГТД.РНПТ";
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	Если обПраво("ПечатьРасширенногоПакетаДокументовЗаказНаряда") Тогда
		СтруктураМакетов.Вставить("Приложение1"          , "Заявка предварительная");
		СтруктураМакетов.Вставить("АктОсмотра"           , "Акт осмотра");
		СтруктураМакетов.Вставить("ЗаказНарядДоговор"    , "Заказ-наряд договор");
		СтруктураМакетов.Вставить("АктПриема"            , "Акт приема");
		СтруктураМакетов.Вставить("СопроводительныйЛист" , "Сопроводительный лист");
		СтруктураМакетов.Вставить("ЗаявкаНаДетали"       , "Заявка на детали");
		СтруктураМакетов.Вставить("Квитанция"            , "Квитанция к заказ-наряду");
		СтруктураМакетов.Вставить("ЗаказНаряд"    , "Заказ-наряд ТАС-ТАК-ВАЗ");
	Иначе   
		//anton
		//СтруктураМакетов.Вставить("БланкЗаявки"   , "Бланк заявки");
		СтруктураМакетов.Вставить("РабочаяЗаявка" , "Рабочая заявка");
		//СтруктураМакетов.Вставить("ПриемныйАкт"   , "Приемный акт");
		//СтруктураМакетов.Вставить("ЗаказНаряд"    , "Заказ-наряд"); 
		СтруктураМакетов.Вставить("ЗаказНаряд"    , "Заказ-наряд ТАС-ТАК-ВАЗ"); 
		//anton
	КонецЕсли;
	
	//anton	
	//СтруктураМакетов.Вставить("АктСдачи"                           , "Акт сдачи");
	СтруктураМакетов.Вставить("ТОРГ12"                             , "ТОРГ-12 (Товарная накладная)");  
	//anton  
	
	//allgk не печатаем для не закрытых ЗН
	Если ДокументСсылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт ИЛИ 
		ДокументСсылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		//СтруктураМакетов.Вставить("АктОбОказанииУслуг"                 , "Акт об оказании услуг");
		СтруктураМакетов.Вставить("АктОбОказанииУслугУслугиИМатериалы" , "Акт об оказании услуг(услуги + материалы)");
	КонецЕсли;
	//allgk не печатаем для не закрытых ЗН
	
	//БИЗТЕХ МАМОНОВ 05.12.2025 ++
	//Запрещаем печать УПД из всех состояний кроме "Закрыт"
	Если ДокументСсылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		СтруктураМакетов.Вставить("УПД","Универсальный передаточный документ");
	КонецЕсли;
	//БИЗТЕХ МАМОНОВ 05.12.2025 --
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти