// Модуль документа ЗаказНаряд

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаРасчетСкидок Экспорт; // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
                                     // свойства и методы для расчета скидок документа.
Перем ОбработкаРасчетСкидокАвторабот Экспорт; // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
                                     // свойства и методы для расчета скидок документа.
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

Перем ФорматПредставленияГодаВыпускаАвтомобиля Экспорт; //Переменная с форматом отображения года выпуска автомобиля

Перем СтруктураОтбораНоменклатуры; // хранит структуру отбора номенклатуры
Перем СтруктураОтбораНоменклатурыНаСкладе; // хранит структуру отбора номенклатуры на складе

Перем КэшОстатковНоменклатурыНаСкладе; // хранит кеш остатков номенклатуры на складе
Перем КэшДанныхПоПеремещению Экспорт; // хранит кеш данных по перемещению

Перем КешИнформацииЗН; // хранит кеш информации ЗН
Перем КешИтоговойИнформацииЗН; // хранит кеш итоговой информации ЗН

Перем ТекущаяВалютаДокумента Экспорт; // хранит текущую валюту документа
Перем ТекущийКурсДокумента Экспорт; // хранит текущий курс документа
Перем ЗначениеКонтролироватьЗаполнениеТолькоПриПроведении; //Значение права контроля заполнения документа

Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

Перем КэшПакетов;
Перем ТоварыБезНДС;
Перем РаботыБезНДС;
Перем ЗакрыватьИнтервалыРабот Экспорт; //Флаг необходимости закрытия интервалов выполнения работ при закрытии заказ-наряда

//<<Павличенко 10.09.2020
Перем АвтоматСоздание Экспорт;

Перем СкладПоПодразделению Экспорт; //БИЗТЕХ 08.07.2025 КОВАЛЬ ++ //Кеш склада по подразделению

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьДатуДокумента(СостояниеНаряда = Неопределено) Экспорт
	
	Если СостояниеНаряда = Неопределено Тогда
		СостояниеНаряда = Состояние;
	КонецЕсли;
	
	Результат = Дата;
	Если СостояниеНаряда = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
		Результат = ДатаЗакрытия;
	ИначеЕсли СостояниеНаряда = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		Результат = ДатаОкончания;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Если Клиент Тогда
// Функция проверяет корректность изменения количества номенклатуры в ЗН
//
// Возвращаемое значение:
//   Булево   – Результат проверки корректности 
//
Функция КонтрольКоличестваДеталейВПроизводстве(ЭтаФорма, ИмяТаблицы = Неопределено) Экспорт
	
	РезультатПроверки=Истина;
	
	КонтрольКоличестваДеталейВПроизводстве = ЭтаФорма.КонтрольКоличестваДеталейВПроизводстве;
	СтруктураДанныхТекущейСтроки           = ЭтаФорма.СтруктураДанныхТекущейСтроки;
	
	Если КонтрольКоличестваДеталейВПроизводстве=Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		//Если не требуется контролировать, то всегда корректно
		Возврат РезультатПроверки;
	КонецЕсли;
	
	Если ИмяТаблицы = Неопределено Тогда
		ИсходнаяТаблица = ЭтаФорма.Товары;
	Иначе
		ИсходнаяТаблица = ЭтаФорма[ИмяТаблицы];
	КонецЕсли;
	
	Номенклатура               = СтруктураДанныхТекущейСтроки.Номенклатура;
	ХарактеристикаНоменклатуры = СтруктураДанныхТекущейСтроки.ХарактеристикаНоменклатуры;
	ЕдиницаИзмерения           = СтруктураДанныхТекущейСтроки.ЕдиницаИзмерения;
	Количество                 = СтруктураДанныхТекущейСтроки.Количество;
	Коэффициент                = СтруктураДанныхТекущейСтроки.Коэффициент;
	СтрокаТЧ                   = СтруктураДанныхТекущейСтроки.Строка;
	СтрокаИсключение           = СтруктураДанныхТекущейСтроки.СтрокаИсключение;
	
	ТоварыВПроизводстве = ПолучитьСтрокуКешаПеремещения(Номенклатура, ХарактеристикаНоменклатуры, Неопределено, Неопределено, ИсходнаяТаблица);
	ВПроизводстве       = 0;
	Заказано            = 0;
	Зарезервировано     = 0;
	Для Каждого ТекСтрока Из ТоварыВПроизводстве Цикл
		
		ВПроизводстве = ВПроизводстве + ТекСтрока.ВПроизводстве;
		
		Если ТекСтрока.ЗаказаноПодЗН>0 Тогда
			Заказано = ТекСтрока.ЗаказаноПодЗН;
		КонецЕсли;
		
		Если ТекСтрока.ЗарезервированоПодЗН>0 Тогда
			Зарезервировано = ТекСтрока.ЗарезервированоПодЗН;
		КонецЕсли;
		
	КонецЦикла;
	ИспользованоВЗаказах = Заказано + Зарезервировано;
	
	// Если деталь уже перемещена в производство, или зарезервирована или заказана
	Если ВПроизводстве>0 ИЛИ (Заказано + Зарезервировано) > 0 Тогда
		
		// подсчет нового итогового количества деталей в документе
		КоличествоНовое = 0;
		СтрокиДетали = ИсходнаяТаблица.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Номенклатура, ХарактеристикаНоменклатуры));
		Для Каждого ТекСтрока Из СтрокиДетали Цикл
			
			Если ТекСтрока = СтрокаИсключение Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоПоСтроке = (ТекСтрока.Количество * ТекСтрока.Коэффициент);
			КоличествоНовое = КоличествоНовое + КоличествоПоСтроке;
			
		КонецЦикла;
		
		Если ВПроизводстве > 0 Тогда
			КоличествоИспользуемоеВЗН = ВПроизводстве + Заказано + Зарезервировано;
		Иначе
			КоличествоИспользуемоеВЗН = Заказано + Зарезервировано;
		КонецЕсли;
		
		ИмяРеквизитаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(Неопределено, ЭтотОбъект).Имя;
		КодНоменклатуры = дкПолучитьЗначениеКолонкиКода(Номенклатура,ИмяРеквизитаКода,ЭтаФорма,Истина);
		ПредставлениеНоменклатуры = "<" + КодНоменклатуры + "> <" + СокрЛП(Номенклатура)+">";
		Недостача = КоличествоИспользуемоеВЗН - КоличествоНовое;
		Если Недостача > 0 Тогда
			МинимальноеКоличество = 0;
			Если СтрокаТЧ = Неопределено Тогда
				МинимальноеКоличество = (Недостача/Коэффициент);
			Иначе
				МинимальноеКоличество = СтрокаТЧ.Количество + (Недостача/Коэффициент);
			КонецЕсли;
			
			РазрешеноУбрать = Макс(Количество - МинимальноеКоличество, 0);
			
			Если КонтрольКоличестваДеталейВПроизводстве=Перечисления.ВидыКонтроля.Запрещать Тогда
				ТекстСообщения = "Деталь " + ПредставлениеНоменклатуры+"
				| Допускается убрать " + Формат(РазрешеноУбрать, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+":";
				Если Заказано>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Заказано "+Формат(Заказано/Коэффициент, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				Если Зарезервировано>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Зарезервировано "+Формат(Зарезервировано/Коэффициент, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				Если ВПроизводстве>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Перемещено в производство "+Формат(ВПроизводстве/Коэффициент, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				Сообщить(ТекстСообщения, СтатусСообщения.Внимание);
				Если СтрокаТЧ<>Неопределено Тогда
					ОбработкаРеквизитаНоменклатура=Ложь;
					Если СтрокаТЧ.Номенклатура<>Номенклатура Тогда
						СтрокаТЧ.Номенклатура=Номенклатура;
						ОбработкаРеквизитаНоменклатура=Истина;
					КонецЕсли; 
					ОбработкаРеквизитаХарактеристикаНоменклатуры=Ложь;
					Если СтрокаТЧ.ХарактеристикаНоменклатуры<>ХарактеристикаНоменклатуры Тогда
						СтрокаТЧ.ХарактеристикаНоменклатуры=ХарактеристикаНоменклатуры;
						ОбработкаРеквизитаХарактеристикаНоменклатуры=Истина;
					КонецЕсли; 
					ОбработкаРеквизитаЕдиницаИзмерения=Ложь;
					Если СтрокаТЧ.ЕдиницаИзмерения<>ЕдиницаИзмерения Тогда
						СтрокаТЧ.ЕдиницаИзмерения=ЕдиницаИзмерения;
						СтрокаТЧ.Коэффициент=ЕдиницаИзмерения.Коэффициент;
						ОбработкаРеквизитаЕдиницаИзмерения=Истина;
					КонецЕсли; 
					ОбработкаРеквизитаКоличество=Ложь;
					Если СтрокаТЧ.Количество<>Количество Тогда
						СтрокаТЧ.Количество=Количество;
						ОбработкаРеквизитаКоличество=Истина;
					КонецЕсли;
					Если ОбработкаРеквизитаНоменклатура Тогда
						ОбработкаРеквизита("Товары.Номенклатура",СтрокаТЧ,ЭтаФорма);
					КонецЕсли; 
					Если ОбработкаРеквизитаХарактеристикаНоменклатуры Тогда
						ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры",СтрокаТЧ,ЭтаФорма);
					КонецЕсли; 
					Если ОбработкаРеквизитаЕдиницаИзмерения Тогда
						ОбработкаРеквизита("Товары.ЕдиницаИзмерения",СтрокаТЧ,ЭтаФорма);
					КонецЕсли; 
					Если ОбработкаРеквизитаКоличество Тогда
						ОбработкаРеквизита("Товары.Количество",СтрокаТЧ,ЭтаФорма);
					КонецЕсли; 
				КонецЕсли; 
				РезультатПроверки=Ложь;
			ИначеЕсли КонтрольКоличестваДеталейВПроизводстве=Перечисления.ВидыКонтроля.Предупреждать Тогда
				ТекстСообщения = "Деталь "+ПредставлениеНоменклатуры+"
				| Допускается убрать " + Формат(РазрешеноУбрать, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+":";
				Если Заказано>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Заказано "+Формат(Заказано/Коэффициент,"ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				Если Зарезервировано>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Зарезервировано "+Формат(Зарезервировано/Коэффициент,"ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				Если ВПроизводстве>0 Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + "	Перемещено в производство "+Формат(ВПроизводстве/Коэффициент, "ЧДЦ=3; ЧН=0.00")+" "+СокрЛП(ЕдиницаИзмерения)+".";
				КонецЕсли;
				
				ТекстСообщения = ТекстСообщения + Символы.ПС + "Принять изменения?";
				
				Если Вопрос(ТекстСообщения, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Иначе
					Если СтрокаТЧ<>Неопределено Тогда
						ОбработкаРеквизитаНоменклатура=Ложь;
						Если СтрокаТЧ.Номенклатура<>Номенклатура Тогда
							СтрокаТЧ.Номенклатура=Номенклатура;
							ОбработкаРеквизитаНоменклатура=Истина;
						КонецЕсли; 
						ОбработкаРеквизитаХарактеристикаНоменклатуры=Ложь;
						Если СтрокаТЧ.ХарактеристикаНоменклатуры<>ХарактеристикаНоменклатуры Тогда
							СтрокаТЧ.ХарактеристикаНоменклатуры=ХарактеристикаНоменклатуры;
							ОбработкаРеквизитаХарактеристикаНоменклатуры=Истина;
						КонецЕсли; 
						ОбработкаРеквизитаЕдиницаИзмерения=Ложь;
						Если СтрокаТЧ.ЕдиницаИзмерения<>ЕдиницаИзмерения Тогда
							СтрокаТЧ.ЕдиницаИзмерения=ЕдиницаИзмерения;
							СтрокаТЧ.Коэффициент=ЕдиницаИзмерения.Коэффициент;
							ОбработкаРеквизитаЕдиницаИзмерения=Истина;
						КонецЕсли; 
						ОбработкаРеквизитаКоличество=Ложь;
						Если СтрокаТЧ.Количество<>Количество Тогда
							СтрокаТЧ.Количество=Количество;
							ОбработкаРеквизитаКоличество=Истина;
						КонецЕсли;
						Если ОбработкаРеквизитаНоменклатура Тогда
							ОбработкаРеквизита("Товары.Номенклатура",СтрокаТЧ,ЭтаФорма);
						КонецЕсли;
						Если ОбработкаРеквизитаХарактеристикаНоменклатуры Тогда
							ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры",СтрокаТЧ,ЭтаФорма);
						КонецЕсли;
						Если ОбработкаРеквизитаЕдиницаИзмерения Тогда
							ОбработкаРеквизита("Товары.ЕдиницаИзмерения",СтрокаТЧ,ЭтаФорма);
						КонецЕсли;
						Если ОбработкаРеквизитаКоличество Тогда
							ОбработкаРеквизита("Товары.Количество",СтрокаТЧ,ЭтаФорма);
						КонецЕсли;
					КонецЕсли;
					РезультатПроверки=Ложь;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции // КонтрольКоличестваДеталейВПроизводстве()
#КонецЕсли

#Если Клиент Тогда
// Заполнение табличной части "Работы" по виду ремонта
// Параметры: РежимРаботы,РежимПланирование - обработка табличных частей
// 0 - не обрабатывать, 1- заполнять без очистки, 2 - заполнять с очисткой
Процедура ЗаполнитьРаботамиПоВидуРемонта(РежимРаботы=0,РаботыПоВидуРемонта,ЭтаФорма=Неопределено)  Экспорт
	
	Если РаботыПоВидуРемонта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Очистим табличные части, если требуется
	Если РежимРаботы > 1 Тогда
		ЭтотОбъект.Работы.Очистить();
		ЭтотОбъект.Исполнители.Очистить();
	КонецЕсли;
	
	// Заполним
	МассивДобавленныхРабот = Новый СписокЗначений;
	Для Каждого СтрокаРабот Из РаботыПоВидуРемонта Цикл
		ВидИспользованияАвтоработы = обПолучитьЗначениеСвойства(СтрокаРабот.Авторабота,ПланыВидовХарактеристик.СвойстваОбъектов.ВидИспользованияАвтоработы,Перечисления.ВидыИспользованияАвторабот.Производство);
		Если РежимРаботы > 0 И ВидИспользованияАвтоработы <> Перечисления.ВидыИспользованияАвторабот.Планирование Тогда
			// Поищем строку с такой работой в табличной части
			ТекСтрока = ЭтотОбъект.Работы.Найти(СтрокаРабот.Авторабота,"Работа");
			Если ТекСтрока <> Неопределено Тогда
				ТекСтрока.Количество = ТекСтрока.Количество + СтрокаРабот.Количество;
				ОбработкаРеквизита("Работы.Количество",ТекСтрока,ЭтаФорма);
			Иначе
				ТекСтрока = ЭтотОбъект.Работы.Добавить();
				ТекСтрока.Работа = СтрокаРабот.Авторабота;
				ТекСтрока.Количество = СтрокаРабот.Количество;
				ОбработкаРеквизита("Работы.Работа",ТекСтрока,ЭтаФорма);
				ТекСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
				Если ЭтаФорма<>Неопределено Тогда
					ЭтаФорма.ИдентификаторТекущейРаботы = ТекСтрока.ИдентификаторРаботы;
				КонецЕсли; 
				МассивДобавленныхРабот.Добавить(ТекСтрока);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтаФорма<>Неопределено Тогда
		Если МассивДобавленныхРабот.Количество() > 0 Тогда
			зфЗНЗаполнениеИсполнителей(ЭтаФорма,МассивДобавленныхРабот);	
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ЭтаФорма <> Неопределено Тогда
		Если РежимРаботы > 1 Тогда
			ВывестиПодвалСкидокРабот(ЭтаФорма);
		КонецЕсли;
		дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	КонецЕсли
	#КонецЕсли
	
КонецПроцедуры
#КонецЕсли

#Если Клиент Тогда
// Задать вопрос о заполнении табличной частей "Работы" по виду ремонта
//
Процедура ПредложитьЗаполнитьРаботамиПоВидуРемонта(ЭтаФорма=Неопределено)  Экспорт
	Если обПраво("РедактированиеРаботЗаказНаряда",Права)
		И ЗначениеЗаполнено(ВидРемонта) 
		И ВидРемонта.Работы.Количество() > 0 Тогда
		
		Очищать = ИСТИНА;
		Заполнять = ИСТИНА;
		Если ЭтаФорма <> Неопределено Тогда
			Если ЭтотОбъект.Работы.Количество() > 0 Тогда
				ОтветПользователя = Вопрос("Табличная часть ""Работы"" не пуста! Заполнить работами по виду ремонта?
				|	ДА - Очистить и заполнить по виду ремонта;
				|	НЕТ - Заполнить по виду ремонта без очистки;
				|	Отмена - Не заполнять.",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Отмена);
			Иначе
				ОтветПользователя = Вопрос("Заполнить работами по виду ремонта?",РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена);
			КонецЕсли;									
			Очищать = (ОтветПользователя = КодВозвратаДиалога.Да ИЛИ ОтветПользователя = КодВозвратаДиалога.ОК);
			Заполнять = НЕ (ОтветПользователя = КодВозвратаДиалога.Отмена);
		КонецЕсли;
		Если Заполнять Тогда

			//Предложим выбрать работы по виду ремонта (работы по умолчанию)
			ФормаВыбора=Обработки.ПодборРабот.ПолучитьФорму("ФормаПодбораСвязанныхРабот",ЭтаФорма);
			ФормаВыбора.ВидРемонта = ВидРемонта;
			ФормаВыбора.РежимВыбора=Истина;
 			ТаблицаРабот = ФормаВыбора.ОткрытьМодально();
			
			РежимОбработки = ?(Очищать,2,1);
			ЗаполнитьРаботамиПоВидуРемонта(РежимОбработки,ТаблицаРабот,ЭтаФорма);

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецЕсли

#Если Клиент Тогда
// Функция проверки данных перед записью формы документа
//
// Параметры
//  Отказ - Булево - Признак отказа от записи документа.
//	РежимЗаписи - РежимЗаписиДокумента - Режим записи документа.
//	РежимПроведения - РежимПроведенияДокумента - Позволяет определить, выполняется оперативное проведение или нет.
//
// Возвращаемое значение:
//   Булево - Признак возможности записи документа
//
Функция ФормаПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Проверим на наличие открыты интервалов работ
	
	// БИЗТЕХ КОВАЛЬ 19.03.2025 SDK 000000797 ++
	Если ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Платный И Контрагент = Справочники.Контрагенты.ОсновнойПокупатель Тогда
		Сообщить("Для платного вида ремонта запрещается использование контрагента <"+Справочники.Контрагенты.ОсновнойПокупатель+">");
		Отказ=Истина;
	КонецЕсли;
	// БИЗТЕХ КОВАЛЬ 19.03.2025 SDK 000000797 --
	
	ПрверятьВыполнениеРабот = (ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда И Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен)
	ИЛИ (НЕ ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда И Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
	Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Ошибки="";
		Для Каждого СтрокаРабот Из Работы Цикл
			Если НЕ обЗначениеНеЗаполнено(СтрокаРабот.Контрагент) Тогда
				Продолжить;
			КонецЕсли; 
			НомерИсполнителя=0; ПроцентУчастия=0;
			СтрокиИсполнителей=Исполнители.НайтиСтроки(Новый Структура("ИдентификаторРаботы",СтрокаРабот.ИдентификаторРаботы));
			Для Каждого СтрокаИсполнителей Из СтрокиИсполнителей Цикл
				НомерИсполнителя=НомерИсполнителя+1;
				ПроцентУчастия=ПроцентУчастия+СтрокаИсполнителей.Процент;
				Если обЗначениеНеЗаполнено(СтрокаИсполнителей.Исполнитель) Тогда
					дкДобавитьОшибку(Ошибки,"Для работы <"+СокрЛП(СтрокаРабот.Работа)+"> в строке "+Формат(НомерИсполнителя,"ЧДЦ=0")+" не указан исполнитель.");
					Отказ=Истина;
					ТекущийИсполнитель="Не задан";
				Иначе
					ТекущийИсполнитель=СокрЛП(СтрокаИсполнителей.Исполнитель);
				КонецЕсли; 
				Если обЗначениеНеЗаполнено(СтрокаИсполнителей.Цех) Тогда
					дкДобавитьОшибку(Ошибки,"Для работы <"+СокрЛП(СтрокаРабот.Работа)+"> у исполнителя <"+ТекущийИсполнитель+"> не задан цех выполнения работы.");
					Отказ=Истина;
				КонецЕсли; 
				Если обЗначениеНеЗаполнено(СтрокаИсполнителей.Процент) Тогда
					дкДобавитьОшибку(Ошибки,"Для работы <"+СокрЛП(СтрокаРабот.Работа)+"> у исполнителя <"+ТекущийИсполнитель+"> не задан процент участия.");
					Отказ=Истина;
				КонецЕсли; 
			КонецЦикла; 
			Если НомерИсполнителя=0 Тогда
				дкДобавитьОшибку(Ошибки,"Для работы <"+СокрЛП(СтрокаРабот.Работа)+"> не задано ни одного исполнителя.");
				Отказ=Истина;
			Иначе
				Если ПроцентУчастия<>100 Тогда
					дкДобавитьОшибку(Ошибки,"Процент участия исполнителей для работы <"+СокрЛП(СтрокаРабот.Работа)+"> отлично от 100%.");
					Отказ=Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		Если Отказ Тогда
			Сообщить("При записи <"+СокрЛП(ЭтотОбъект)+"> обнаружены ошибки :",СтатусСообщения.Внимание);
			Сообщить(Ошибки,СтатусСообщения.БезСтатуса);
			Сообщить("Из-за возникших ошибок операция записи была отменена.",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли; 
	
	Если ПрверятьВыполнениеРабот И НЕ Отказ Тогда
		РезультатПроверки = ЗакрытиеОткрытыхПакетов();
		
		Если РезультатПроверки Тогда
			Ответ = Вопрос("Обнаружены незавершенные работы. Завершить их принудительно?
							|При отказе проведение будет отменено.", РежимДиалогаВопрос.ДаНет, обПраво("ТаймаутДиалогов",Права,,ЭтотОбъект),КодВозвратаДиалога.Нет, "Учет рабочего времени",КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет ИЛИ Ответ = КодВозвратаДиалога.Таймаут Тогда
				Отказ = Истина;
				Возврат Ложь;
			Иначе
				ЭтотОбъект.ЗакрыватьИнтервалыРабот = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции // ФормаПередЗаписью()

Процедура ПоказатьДопКоды(ЭтаФорма) Экспорт
	ТаблицаДопКодов = Документы.ЗаказНаряд.РабобратьСтрокуДопКодов(ДопКодыРаспределенныеНаТоварыИРаботы);
	
	ФормаДопКод = ПолучитьФорму("ФормаОтображениеДопКодов",ЭтаФорма,ЭтаФорма);
	ФормаДопКод.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаДопКод.СписокДопКодов = ТаблицаДопКодов;
	Если ФормаДопКод.Открыта() Тогда
		ФормаДопКод.Активизировать();
	Иначе
		ФормаДопКод.Открыть();
	КонецЕсли;
КонецПроцедуры

#КонецЕсли

Функция СформироватьСводнуюТаблицу()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Строка");
	Таблица.Колонки.Добавить("Таблица");
	Таблица.Колонки.Добавить("Сумма");
	Таблица.Колонки.Добавить("РаспределенноеЗначение");
	
	Для Каждого Строка Из Товары Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Строка                 = Строка;
		НоваяСтрока.Таблица                = "Товары";
		НоваяСтрока.Сумма                  = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;
		НоваяСтрока.РаспределенноеЗначение = 0;
	КонецЦикла;
	
	Для Каждого Строка Из Работы Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Строка                 = Строка;
		НоваяСтрока.Таблица                = "Работы";
		НоваяСтрока.Сумма                  = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;;
		НоваяСтрока.РаспределенноеЗначение = 0;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	ВремСуммаНоменклатурыДокумента=Товары.Итог("СуммаВсего");
	ВремСуммаРаботДокумента=Работы.Итог("СуммаВсего");
	ВремСуммаДокумента=ВремСуммаРаботДокумента+ВремСуммаНоменклатурыДокумента;
	Если СуммаНоменклатурыДокумента<>ВремСуммаНоменклатурыДокумента Тогда
		СуммаНоменклатурыДокумента=ВремСуммаНоменклатурыДокумента;
	КонецЕсли; 
	Если СуммаРаботДокумента<>ВремСуммаРаботДокумента Тогда
		СуммаРаботДокумента=ВремСуммаРаботДокумента;
	КонецЕсли; 
	Если СуммаДокумента<>ВремСуммаДокумента Тогда
		СуммаДокумента=ВремСуммаДокумента;
	КонецЕсли;
	Возврат СуммаДокумента;
КонецФункции

//Заполнение ТЧ товаров по себестоимости
Процедура ЗаполнитьТоварыПоСебестоимости(ЭтаФорма=Неопределено) Экспорт
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ТоварыВПроизводствеОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(ТоварыВПроизводствеОстатки.СуммаУпрОстаток) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве.Остатки КАК ТоварыВПроизводствеОстатки
	|ГДЕ
	|	ТоварыВПроизводствеОстатки.ЗаказНаряд = &ЗаказНаряд
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВПроизводствеОстатки.Номенклатура";
	Запрос.УстановитьПараметр("ЗаказНаряд",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Номенклатура=Выборка.Номенклатура;
		Количество=Выборка.Количество;
		Если ВалютаДокумента=ВалютаРегл Тогда
			Сумма=Выборка.Сумма;
		ИначеЕсли ВалютаДокумента=ВалютаУпр Тогда
			Сумма=Выборка.СуммаУпр;
		Иначе
			СтруктураКурса=обКурсДляВалюты(ВалютаУпр,МоментВремени());
			КурсУпр=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
			Сумма=Окр(обПересчет(Выборка.СуммаУпр,ВалютаУпр,КурсУпр,ВалютаДокумента,КурсДокумента),2);
		КонецЕсли;
		СуммаОстаток=Сумма;
		СтрокаТЧ=Неопределено;
		СтрокиТоваров=Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
		Для каждого СтрокаТЧ Из СтрокиТоваров Цикл
			СтрокаТЧ.СуммаВсего=(Сумма*СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент)/Количество;
			СуммаОстаток=СуммаОстаток-СтрокаТЧ.СуммаВсего;
		КонецЦикла;
		Если СтрокаТЧ<>Неопределено Тогда
			СтрокаТЧ.СуммаВсего=СтрокаТЧ.СуммаВсего+СуммаОстаток;
		КонецЕсли; 
		Для каждого СтрокаТЧ Из СтрокиТоваров Цикл
			ОбработкаРеквизита("Товары.СуммаВсего",СтрокаТЧ,ЭтаФорма,Неопределено);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// выводит в подвал информацию по скидкам на работы
Процедура ВывестиПодвалСкидокРабот(ЭтаФорма) Экспорт
	Если ЭтаФорма<>Неопределено И
		ЭтаФорма.ЭлементыФормы.Найти("Работы")<>Неопределено И 
		ЭтаФорма.ЭлементыФормы.Работы.Колонки.Найти("Работа")<>Неопределено Тогда
		//Подписи таблицы работ
		ТекстСкидка = "Скидка: ";
		Если СкидкаНаценкаРаботы.Пустая() Тогда
			ТекстСкидка = ТекстСкидка + "<нет>";
		Иначе
			ТекстСкидка = ТекстСкидка + СокрЛП(СкидкаНаценкаРаботы.Наименование);
			ТекстСкидка = ТекстСкидка + " (" + ЗначениеСкидкиНаценкиРабот + " " + ?(СкидкаНаценкаРаботы.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная, "%", Строка(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить())) + ")";
		КонецЕсли;			
		ЭтаФорма.ЭлементыФормы.Работы.Колонки.Работа.ТекстПодвала=ТекстСкидка;
	КонецЕсли; 
КонецПроцедуры

// Заполняет на основании заказа
//
// Параметры:
//  ЗаказПокупателя - ДокументСсылка.
//
Процедура ЗаполнитьЗаказамиНаОснованииЗаказаПокупателя(ЗаказПокупателя = Неопределено) Экспорт
	
	ТекстЗапроса="ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаказыПокупателейОстатки.СкладКомпании,
	|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК Количество,
	|	ЗаказыПокупателейОстатки.СуммаОстаток КАК СуммаЗаказа,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Коэффициент,1) КАК КоличествоБазовое,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.ЕдиницаИзмерения,Значение(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Коэффициент,1) КАК Коэффициент,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.СтавкаНДС, ЗаказыПокупателейОстатки.Номенклатура.СтавкаНДС) КАК СтавкаНДС,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.НомерСтроки, 1000000) КАК НомерСтроки,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.СкидкаНаТовар, ЗНАЧЕНИЕ(Справочник.ТипыСкидок.ПустаяСсылка)) КАК СкидкаНаТовар,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.ПроцентСкидкиСтроки,0) КАК ПроцентСкидкиСтроки,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.ПроцентСкидки,0) КАК ПроцентСкидки
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+",
	|	Контрагент = &ВыбКонтрагент И Заказ = &ВыбЗаказ) КАК ЗаказыПокупателейОстатки
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ПО 
	|	ЗаказыПокупателейОстатки.Заказ = ЗаказПокупателяТовары.Ссылка И 
	|	ЗаказыПокупателейОстатки.Номенклатура = ЗаказПокупателяТовары.Номенклатура И 
	|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры = ЗаказПокупателяТовары.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ЗаказыПокупателейОстатки.Номенклатура.ВидНоменклатуры<>ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.ПрочиеАктивы)
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоБазовое),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(СуммаЗаказа)
	|ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СкладКомпании";
	
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НаМомент", МоментВремени());
	Запрос.УстановитьПараметр("ВыбКонтрагент", Контрагент);
	Запрос.УстановитьПараметр("ВыбЗаказ", ЗаказПокупателя);
	Товары.Очистить(); // нужные только скорректированные позиции
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВалютаЗаказа   = ЗаказПокупателя.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	СтруктураКурса = обКурсДляВалюты(ВалютаЗаказа,Дата);
	КурсЗаказа     = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	
	// перенос скидки
	СкидкаНаценка = ЗаказПокупателя.СкидкаНаценка;
	ОбработкаРеквизита("СкидкаНаценка");
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		ВыборкаХарактеристик = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХарактеристик.Следующий() Цикл
			ВсегоОсталось = ВыборкаХарактеристик.Количество;
			КоличествоБазовоеПоЗаказу = ВыборкаХарактеристик.КоличествоБазовое;
			СуммаОсталось = обПересчет(ВыборкаХарактеристик.СуммаЗаказа, ВалютаЗаказа, КурсЗаказа, ВалютаДокумента, КурсДокумента);
			ВыборкаСкладов = ВыборкаХарактеристик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСкладов.Следующий() Цикл
				ВыборкаДетали = ВыборкаСкладов.Выбрать(ОбходРезультатаЗапроса.Прямой);
				СтрокаДетали  = Неопределено;
				Пока ВыборкаДетали.Следующий() Цикл
					Если ВсегоОсталось=0 Тогда
						Прервать;
					КонецЕсли;
					
					Если ВыборкаДетали.Количество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если КоличествоБазовоеПоЗаказу = 1 Тогда
						КоличествоСтроки = ВыборкаДетали.Количество;
					Иначе
						КоличествоСтроки = ВыборкаДетали.Количество*(ВыборкаДетали.КоличествоБазовое/КоличествоБазовоеПоЗаказу);
					КонецЕсли;
					
					//НомерСтроки = ВыборкаДетали.НомерСтроки;
					ТекущееКоличество = Мин(ВсегоОсталось, КоличествоСтроки);
					СтрокаДетали=Товары.Добавить();
					СтрокаДетали.Номенклатура				= ВыборкаДетали.Номенклатура;
					СтрокаДетали.ХарактеристикаНоменклатуры	= ВыборкаДетали.ХарактеристикаНоменклатуры;
					СтрокаДетали.СкладКомпании				= ВыборкаДетали.СкладКомпании;
					СтрокаДетали.ЕдиницаИзмерения			= ВыборкаДетали.ЕдиницаИзмерения;
					СтрокаДетали.Коэффициент				= ВыборкаДетали.Коэффициент;
					ОбработкаРеквизита("Товары.Номенклатура", СтрокаДетали);
					СтрокаДетали.Количество					= ТекущееКоличество/?(обЗначениеНеЗаполнено(СтрокаДетали.Коэффициент),1,СтрокаДетали.Коэффициент);;
					ТекСумма = (СуммаОсталось/ВсегоОсталось)*ТекущееКоличество;
					СуммаОсталось = СуммаОсталось - ТекСумма;
					
					СтрокаДетали.СтавкаНДС					= ВыборкаДетали.СтавкаНДС;
					
					// перенос скидок
					СтрокаДетали.СкидкаНаТовар = ВыборкаДетали.СкидкаНаТовар;
					СтрокаДетали.ПроцентСкидки = ВыборкаДетали.ПроцентСкидки;
					СтрокаДетали.ПроцентСкидкиСтроки = ВыборкаДетали.ПроцентСкидкиСтроки;
					
					СтрокаДетали.СуммаВсего = ТекСумма;
					ОбработкаРеквизита("Товары.СуммаВсего", СтрокаДетали);
					
					ВсегоОсталось = ВсегоОсталось - ТекущееКоличество;
					
				КонецЦикла;
				
				Если ВсегоОсталось>0 ИЛИ СуммаОсталось>0 Тогда
					Если НЕ СтрокаДетали = Неопределено Тогда
						СтрокаДетали.Количество = СтрокаДетали.Количество + (ВсегоОсталось/?(обЗначениеНеЗаполнено(СтрокаДетали.Коэффициент),1,СтрокаДетали.Коэффициент));
						ОбработкаРеквизита("Товары.Количество", СтрокаДетали);
						СтрокаДетали.СуммаВсего = СтрокаДетали.СуммаВсего + СуммаОсталось;
					Иначе
						СтрокаДетали=Товары.Добавить();
						СтрокаДетали.Номенклатура				= ВыборкаСкладов.Номенклатура;
						СтрокаДетали.ХарактеристикаНоменклатуры = ВыборкаСкладов.ХарактеристикаНоменклатуры;
						СтрокаДетали.СкладКомпании				= ВыборкаСкладов.СкладКомпании;
						ОбработкаРеквизита("Товары.Номенклатура", СтрокаДетали);
						СтрокаДетали.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
						СтрокаДетали.Количество = ВсегоОсталось/?(обЗначениеНеЗаполнено(СтрокаДетали.Коэффициент),1,СтрокаДетали.Коэффициент);
						ОбработкаРеквизита("Товары.Количество", СтрокаДетали);
						СтрокаДетали.СуммаВсего = СуммаОсталось;
					КонецЕсли;
					ОбработкаРеквизита("Товары.СуммаВсего", СтрокаДетали);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьЗаказамиНаОснованииЗаказаПокупателя()

#Если Клиент Тогда
// Формирование перемещений в производство по заказ-наряду
// Параметры
//  ВопросОПеремещении  – Булево – Задание вопроса о необходимости формирования перемещения
// Возвращаемое значение:
//  Булево   – Успешность формирования перемещений
Функция СформироватьПеремещенияВПроизводство(ВопросОПеремещении=Истина) Экспорт
	
	Если ЭтотОбъект.Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен 
		ИЛИ ЭтотОбъект.Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Сообщить("Перемещение в производство по закрытому или выполненному заказ-наряду недопустимо.");
		Возврат Ложь;
	КонецЕсли; 
	
	//Если ЭтотОбъект.Модифицированность() Тогда
	//	Сообщить("Перед формированием перемещений в производство документ должен быть записан.");
	//	Возврат Ложь;
	//КонецЕсли; 
	
	// Запретим создание перемещения, если заказ-наряд в состоянии "Заявка"
	Если ЭтотОбъект.Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
		Сообщить(НСтр("ru = 'Выполнена попытка автоматического перемещения товаров в производство.
			|Заказ-наряд находится в состоянии ""Заявка"". Нельзя создать движение товаров.'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если ВопросОПеремещении Тогда
		Если Вопрос("Сформировать перемещения в производство по заказ-наряду ?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	НовоеПеремещениеВПроизводство=Документы.ПеремещениеТоваровВПроизводство.СоздатьДокумент();
	НовоеПеремещениеВПроизводство.Заполнить(Ссылка);
	НовоеПеремещениеВПроизводствоФорма=НовоеПеремещениеВПроизводство.ПолучитьФорму();
	Отказ=Ложь;
	СтандартнаяОбработка=Истина;
	зфФормаПередОткрытием(НовоеПеремещениеВПроизводствоФорма,Отказ,СтандартнаяОбработка);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	РезультатПеремещения=Истина;
	ТабСкладов=Товары.Выгрузить();
	ТабСкладов.Свернуть("СкладКомпании");
	ТаблицаМатериалов = Материалы.Выгрузить();
	ТаблицаМатериалов.Свернуть("СкладКомпании");
	Для Каждого ТекСтрока Из ТаблицаМатериалов Цикл
		Если ТабСкладов.Найти(ТекСтрока.СкладКомпании, "СкладКомпании") = Неопределено Тогда
			НоваяСтрока = ТабСкладов.Добавить();
			НоваяСтрока.СкладКомпании = ТекСтрока.СкладКомпании;
		КонецЕсли;
	КонецЦикла;
	Для каждого Склад Из ТабСкладов Цикл
		Если Склад.СкладКомпании=Неопределено ИЛИ Склад.СкладКомпании=Справочники.СкладыКомпании.ПустаяСсылка() Тогда Продолжить; КонецЕсли; 
		НовоеПеремещениеВПроизводство=Документы.ПеремещениеТоваровВПроизводство.СоздатьДокумент();
		НовоеПеремещениеВПроизводство.Дата=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
		НовоеПеремещениеВПроизводство.СкладКомпании=Склад.СкладКомпании;
		НовоеПеремещениеВПроизводство.Заполнить(ЭтотОбъект.Ссылка);
		Если НовоеПеремещениеВПроизводство.Товары.Количество()>0 Тогда
			
			//++СнимченкоАА_бизтех++
			флЕстьМаркированныйТовар = Ложь;
			стрПозицииДляКодовМаркировки = "Укажите коды маркировки для:"+Символы.ПС;   
			Для каждого тс Из НовоеПеремещениеВПроизводство.Товары Цикл    
				
				ТипНоменклатуры = тс.Номенклатура.ТипНоменклатуры;	
				Если ТипНоменклатуры.ДатаВведенияМаркировки<=Дата и ТипНоменклатуры.ВедетсяМаркировка Тогда
					флЕстьМаркированныйТовар = Истина;
					
					стрПозицииДляКодовМаркировки = стрПозицииДляКодовМаркировки + тс.Номенклатура+" в строке "+тс.НомерСтроки+Символы.ПС;
					
				КонецЕсли;  
				
			КонецЦикла;     
			
			Если флЕстьМаркированныйТовар Тогда
				
				//Сообщить(стрПозицииДляКодовМаркировки);  
				Предупреждение(стрПозицииДляКодовМаркировки);	
				
				ФормаПеремещенияПроизводства = НовоеПеремещениеВПроизводство.ПолучитьФорму("ФормаДокумента");
				ФормаПеремещенияПроизводства.ПараметрОснование = ЭтотОбъект.Ссылка;
				ФормаПеремещенияПроизводства.Открыть();
				Возврат Ложь;
			КонецЕсли;  			
			//--СнимченкоАА_бизтех--
			
			ТекстОшибки = "";
			Если НЕ дкПроверитьКорректностьМаркировки(НовоеПеремещениеВПроизводство,,, ТекстОшибки) Тогда
				Сообщить(ТекстОшибки);
				ФормаПеремещенияПроизводства = НовоеПеремещениеВПроизводство.ПолучитьФорму("ФормаДокумента");
				ФормаПеремещенияПроизводства.ПараметрОснование = ЭтотОбъект.Ссылка;
				ФормаПеремещенияПроизводства.Открыть();
				Возврат Ложь;
			КонецЕсли;   
			
			//Попытка
				Если обПраво("ПеремещениеДеталейВПроизводство",Права,,ЭтотОбъект) Тогда
					НовоеПеремещениеВПроизводство.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
					Сообщить("Сформирован и проведен документ перемещения в производство <"+СокрЛП(НовоеПеремещениеВПроизводство)+">.");
				Иначе
					НовоеПеремещениеВПроизводство.Записать(РежимЗаписиДокумента.Запись);
					Сообщить("Сформирован документ перемещения в производство <"+СокрЛП(НовоеПеремещениеВПроизводство)+">.
					|Провести его позднее может уполномоченное на это лицо.");
				КонецЕсли;
				
				//БИЗТЕХ КОВАЛЬ 09.09.2024 ++
				//Автоматическая печать перемещений в производство
				Попытка
					Сообщить("Сформирована печатная форма. Документ отправлен на печать.");
					ПечатьПеремещениеВПроизводство(НовоеПеремещениеВПроизводство,"Перемещение товаров в производство с остатком");
				Исключение
					Сообщить("Ошибка печати. Откройте документ "+СокрЛП(НовоеПеремещениеВПроизводство)+" и отправьте на печать вручную");
				КонецПопытки;
				//БИЗТЕХ КОВАЛЬ 09.09.2024 --
				
				дкШтрихКодированиеДокументов(НовоеПеремещениеВПроизводство,Права);
			//Исключение
			//	Если обПраво("ПеремещениеДеталейВПроизводство",Права,,ЭтотОбъект) Тогда
			//		Сообщить("Ошибка проведения документа перемещения в производство <"+СокрЛП(НовоеПеремещениеВПроизводство)+">");
			//	Иначе
			//		Сообщить("Ошибка записи документа перемещения в производство <"+СокрЛП(НовоеПеремещениеВПроизводство)+">");
			//	КонецЕсли;
			//	
			//	РезультатПеремещения=Ложь;
			//КонецПопытки; 
		КонецЕсли; 
	КонецЦикла; 
	Возврат РезультатПеремещения;
КонецФункции // СформироватьПеремещенияВПроизводство()
#КонецЕсли

// извлечение товаров из производства
Процедура ИзвлечениеИзПроизводства(ЭтаФорма=Неопределено) Экспорт
	
	#Если Клиент Тогда
		
	Если ЭтотОбъект.Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен 
		ИЛИ ЭтотОбъект.Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Сообщить("Извлечение из производства для закрытого или выполненного заказ-наряда недопустимо.");
		Возврат;	
	КонецЕсли; 
	
	ИзвлечениеТоваровИзПроизводства=Документы.ИзвлечениеТоваровИзПроизводства.СоздатьДокумент();
	Если обПраво("ВводНаОснованииПроведенныхДокументов",ИзвлечениеТоваровИзПроизводства.Права,,ИзвлечениеТоваровИзПроизводства) Тогда
		Если НЕ Проведен Тогда
			Сообщить("Ввод на основании непроведенного документа запрещен.", СтатусСообщения.Важное); 
			Возврат;
		Иначе
			ЭтотОбъектФорма=ЭтотОбъект.ПолучитьФорму();
			Если ЭтотОбъект.ЭтоНовый() ИЛИ ЭтотОбъектФорма.Модифицированность Тогда
				ОтветНаВопрос=Вопрос("Документ-основание <"+ЭтотОбъект+"> изменен.
				|Записать документ-основание <"+ЭтотОбъект+"> перед вводом подчиненного документа?",
				РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Да,
				"Ввод на основании <"+ЭтотОбъект+">");
				Если ОтветНаВопрос=КодВозвратаДиалога.Да Тогда
					Попытка
						Если НЕ ЭтотОбъектФорма.ЗаписатьВФорме() Тогда
							Возврат;
						КонецЕсли;
					Исключение
						Возврат;
					КонецПопытки; 
				ИначеЕсли ОтветНаВопрос=КодВозвратаДиалога.Отмена Тогда
					Возврат;
				Иначе
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзвлечениеТоваровИзПроизводства.Заполнить(Ссылка);
	ИзвлечениеТоваровИзПроизводства.Товары.Очистить();
	//БИЗТЕХ КОВАЛЬ 14.07.2025 ++
	//ФормаДокумента=ИзвлечениеТоваровИзПроизводства.ПолучитьФорму("ФормаДокументаПодбор",ЭтаФорма);
	ФормаДокумента=ИзвлечениеТоваровИзПроизводства.ПолучитьФорму("ФормаДокументаПодборМодиф",ЭтаФорма);
	//БИЗТЕХ КОВАЛЬ 14.07.2025 --  
	
	ФормаДокумента.Открыть();
	
	#КонецЕсли

КонецПроцедуры 

#Если Клиент Тогда
// Формирует отчет история по заказ нарядам
Процедура ОтчетИсторияПоЗаказНарядам() Экспорт
	
	// заполним параметры отчета
	Отчет = Отчеты.ИсторияПоЗаказНарядам.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ДляЗаказНаряда;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    НачалоМесяца(Дата));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(Дата));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаОтчета",  ВалютаДокумента);
	
	ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "Автомобиль", Автомобиль);
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры

// Формирует отчет по незавершенному производству
Процедура ОтчетПоНезавершенномуПроизводству() Экспорт
	
	// заполним параметры отчета
	Отчет = Отчеты.ОстаткиИОборотыТоваровВПроизводстве.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Обороты;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Дата(1,1,1));
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	КонецЕсли;
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Показатели      = НастройкиВарианта.Выбор;
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Если ИмяФункции = "Приход" ИЛИ ИмяФункции = "Извлечено" Тогда
				ТекПоказатель.Использование = Истина;
				Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
					ТекВложенныйПоказатель.Использование = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "")="Количество";
				КонецЦикла;
			Иначе
				ТекПоказатель.Использование = Ложь;
			КонецЕсли;
		Иначе
			ТекПоказатель.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// фильтры
	Отбор.Элементы.Очистить();
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаказНаряд");
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ТекОтбор.ПравоеЗначение = Ссылка;
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПериодРегистратор");
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
	ТекОтбор.ПравоеЗначение = Ссылка;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	// добавим измерение "Номенклатура"
	ГруппировкаНоменклатура = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Номенклатура");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры

// Формирует отчет анализ состояний заказ наряда
Процедура ОтчетАнализСостоянийЗаказНаряда() Экспорт
	
	Отчет = Отчеты.АнализСостоянийЗаказНаряда.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Основной;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Дата);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", ТекущаяДата());
	
	ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "ЗаказНаряд", Ссылка);
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры

#КонецЕсли

// Получает номер текущего пакета
//
// Возвращаемое значение:
// Число – Номер пакета.
//
Функция ПолучитьНомерТекПакета() Экспорт
	// получим тек номер старшего пакета
	Если Работы.Количество() = 0 Тогда
		Возврат 1;
	КонецЕсли;
	
	КопияРаботы = Работы.Выгрузить();
	КопияРаботы.Свернуть("НомерПакета");
	КопияРаботы.Сортировать("НомерПакета Убыв");
	ТекНомер = КопияРаботы[0].НомерПакета;
	Возврат ТекНомер + 1;
КонецФункции

// Закрывает открытые пакеты
//
// Параметры:
// Проверка	– Булево – Флаг закрытия интервалов.
//
// Возвращаемое значение:
// Булево – Результат закрытия.
//
Функция ЗакрытиеОткрытыхПакетов(Проверка=Истина) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияВремениРаботСрезПоследних.Период,
	|	РегистрацияВремениРаботСрезПоследних.Сотрудник,
	|	РегистрацияВремениРаботСрезПоследних.ВидОтметки,
	|	РегистрацияВремениРаботСрезПоследних.ЗаказНаряд,
	|	РегистрацияВремениРаботСрезПоследних.КонецРаботы,
	|	РегистрацияВремениРаботСрезПоследних.Продолжительность,
	|	РегистрацияВремениРаботСрезПоследних.ПакетРабот,
	|	РегистрацияВремениРаботСрезПоследних.РабочееМесто
	|ИЗ
	|	РегистрСведений.РегистрацияВремениРабот.СрезПоследних КАК РегистрацияВремениРаботСрезПоследних
	|ГДЕ
	|	РегистрацияВремениРаботСрезПоследних.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.Работа)
	|	И РегистрацияВремениРаботСрезПоследних.ЗаказНаряд = &ЗаказНаряд
	|	И РегистрацияВремениРаботСрезПоследних.КонецРаботы = &ПустаяДата";
	
	Запрос.УстановитьПараметр("ЗаказНаряд", Ссылка);
	Запрос.УстановитьПараметр("ПустаяДата",Дата("00010101"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Проверка Тогда
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.РегистрацияВремениРабот.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.КонецРаботы = ТекущаяДата();
				МенеджерЗаписи.Продолжительность = (МенеджерЗаписи.КонецРаботы - МенеджерЗаписи.Период)/3600;
				МенеджерЗаписи.Записать();
				
				урвзфНачатьНовыйИнтервал(Справочники.ВидыОтметокВремени.Простой, Выборка.Сотрудник, Ссылка, Выборка.ПакетРабот, Неопределено);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Выборка.Следующий() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

#Если Клиент Тогда

// Формирует отчет состояние заказов покупателей
Процедура ОтчетСостояниеЗаказовПокупателейПоЗаказНаряду() Экспорт
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// заполним параметры отчета
	Отчет = Отчеты.СостояниеЗаказовПокупателей.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ДляЗаказНаряда;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	// фильтр по заказу
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(ДокументОснование) Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДокументОснование.Дата));
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаказПокупателя.Ссылка КАК Заказ
		               |ИЗ
		               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		               |ГДЕ
		               |	ЗаказПокупателя.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
		МассивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
		МассивЗаказов.Добавить(ДокументОснование);
		
		СписокЗаказов = Новый СписокЗначений;
		СписокЗаказов.ЗагрузитьЗначения(МассивЗаказов);
		
		ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "Заказ", СписокЗаказов, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДатаСоздания));
		ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "Заказ.ДокументОснование", Ссылка);
	КонецЕсли;
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДата()));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("РежимВывода",   1);
	
	НовыйОтбор = ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "Контрагент", Ссылка.Контрагент);
	НовыйОтбор.Использование = Ложь;
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры

#КонецЕсли

// Проверим, что в Материалах нет обязательной маркировки
//
Функция ПроверитьНаличиеМаркированногоМатериала(Ошибки = "")
	
	Результат = Истина;
	
	Если НЕ обПраво("ПроверкаЗаполненияСправочниковИДокументов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов")
		И ДополнительныеСвойства.ГрупповаяОбработкаДокументов Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Материалы Цикл
		Если дкОбязательнаДляМаркировкиТоваров(ТекущаяСтрока.Номенклатура.ТипНоменклатуры) Тогда
			СтрокаРабот = Работы.Найти(ТекущаяСтрока.ИдентификаторРаботы, "ИдентификаторРаботы");
			дкДобавитьОшибку(
				Ошибки,
				"Таблица <Работы>. Запрещено указывать материал <"
				+ТекущаяСтрока.Номенклатура+">, т.к. ведется обязательный его учет по маркировке. Строка номер "
				+СтрокаРабот.НомерСтроки);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПроверитьНаличиеМаркированногоМатериала()

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	//|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ТипЦенРабот КАК ТипЦенРабот,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.КурсВалютыВзаиморасчетов КАК КурсВалютыВзаиморасчетов,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Ссылка КАК ДокументПродажи,
	|	Док.ДатаСоздания КАК ДатаСоздания,
	|	Док.ДатаНачала КАК ДатаНачала,
	|	Док.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА Док.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|		ТОГДА Док.ДатаЗакрытия
	|		ИНАЧЕ Док.ДатаОкончания
	|	КОНЕЦ КАК Дата,
	|	Док.ВидРемонта КАК ВидРемонта,
	|	Док.Цех КАК Цех,
	|	Док.Автомобиль КАК Автомобиль,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СуммаНоменклатурыДокумента КАК СуммаНоменклатурыДокумента,
	|	Док.СуммаРаботДокумента КАК СуммаРаботДокумента,
	|	Док.СуммаДокумента КАК СуммаДокумента,
	|	Док.ДокументОснование КАК ДокументОснование
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого ТекКолонка Из РезультатЗапроса.Колонки Цикл
		Результат.Вставить(ТекКолонка.Имя, Выборка[ТекКолонка.Имя]);
	КонецЦикла;
	
	Если ДокументСсылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
		Результат.Вставить("МоментВремени", Новый МоментВремени(ДокументСсылка.ДатаЗакрытия, ДокументСсылка));
	ИначеЕсли ДокументСсылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		Результат.Вставить("МоментВремени", Новый МоментВремени(ДокументСсылка.ДатаОкончания, ДокументСсылка));
	Иначе
		Результат.Вставить("МоментВремени", ДокументСсылка.МоментВремени);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// формирует движения документа по партионным регистрам
// Режим - режим проведения (оперативный/неоперативный)
// ДокументСсылка - ссылка на документ который надо допровести по партиям
// Возвращает Истина - все хорошо, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	// определим необходимость формирования корректирующих проводок
	СпособВеденияБаланса = Константы.СпособВеденияБаланса.Получить();
	ВедетсяБалансПоПодразделению = (СпособВеденияБаланса = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	//Очистим возможные движения по производственному регистру, 
	//если было отложенное проведение по партиям
	НаборЗаписейПартионногоРегистра=РегистрыНакопления.ТоварыВПроизводстве.СоздатьНаборЗаписей();
	НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
	НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Использование=Истина;
	НаборЗаписейПартионногоРегистра.Записать();
	//Очистим комплектацию автомобилей
	НаборЗаписейКомплектацияАвтомобилей=Движения.Найти("КомплектацияАвтомобилей");
	Если НаборЗаписейКомплектацияАвтомобилей<>Неопределено Тогда
		НаборЗаписейПартионногоРегистра=РегистрыНакопления.КомплектацияАвтомобилей.СоздатьНаборЗаписей();
		НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
		НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Использование=Истина;
		НаборЗаписейПартионногоРегистра.Записать();
	КонецЕсли; 
	//Очистим остатки автомобилей
	НаборЗаписейОстаткиАвтомобилей=Движения.Найти("ОстаткиАвтомобилей");
	Если НаборЗаписейОстаткиАвтомобилей<>Неопределено Тогда
		НаборЗаписейПартионногоРегистра=РегистрыНакопления.ОстаткиАвтомобилей.СоздатьНаборЗаписей();
		НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
		НаборЗаписейПартионногоРегистра.Отбор.Регистратор.Использование=Истина;
		НаборЗаписейПартионногоРегистра.Записать();
	КонецЕсли; 
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	
	ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса=обКурсДляВалюты(ВалютаРегл,ШапкаДокумента.Дата);
	КурсРегл=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Если ШапкаДокумента.КурсВалютыУпр=0 Тогда
		СтруктураКурса=обКурсДляВалюты(ВалютаУпр,ШапкаДокумента.Дата);
		КурсУпр=СтруктураКурса.Курс/?(СтруктураКурса.Кратность=0,1,СтруктураКурса.Кратность);
	Иначе
		КурсУпр=ШапкаДокумента.КурсВалютыУпр;
	КонецЕсли;
	//Если зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") Тогда
		КомплектацияАвтомобиля=Справочники.ВидыРемонта.КомплектацияАвтомобиля;
		Если (КомплектацияАвтомобиля.Пустая()) ИЛИ (НЕ КомплектацияАвтомобиля.Предопределенный) Тогда
			КомплектацияАвтомобиля=Неопределено;
		КонецЕсли; 
	//Иначе
	//	КомплектацияАвтомобиля=Неопределено;
	//КонецЕсли; 
	
	АвтомобильСкладКомпании=Неопределено;
	СуммаНДСАвторабот=ШапкаДокумента.Ссылка.Работы.Итог("СуммаНДС");
	Если ШапкаДокумента.ВидРемонта=КомплектацияАвтомобиля ИЛИ НаСебестоимость Тогда
		//Мы для себя делаем автомобиль, увеличим себестоимость на сумму работ
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
					   |	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
					   |	ОстаткиАвтомобилейОстатки.СтатусПартии КАК СтатусПартии,
					   |	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД
					   |ИЗ
					   |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&НаДату, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
					   |ГДЕ
					   |	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0";
		Запрос.УстановитьПараметр("НаДату",ШапкаДокумента.МоментВремени);
		Запрос.УстановитьПараметр("Автомобиль",ШапкаДокумента.Автомобиль);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПартияКомплектуемогоАвтомобиля=Выборка.Партия;
			СтатусПартииКомплектуемогоАвтомобиля=Выборка.СтатусПартии;
			ГТДКомплектуемогоАвтомобиля=Выборка.ГТД;
			АвтомобильСкладКомпании=Выборка.СкладКомпании;
			Если СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
				Если АвтомобильСкладКомпании.Организация<>Организация Тогда
					дкСообщитьРезультат("Организация склада хранения автомобиля <"+СокрЛП(АвтомобильСкладКомпании.Организация)+"> не соответствует организации документа !",,ЭтотОбъект);
					Отказ=Истина;
				КонецЕсли; 
			КонецЕсли;
			Если (ШапкаДокумента.СуммаРаботДокумента<>0 ИЛИ СуммаНДСАвторабот<>0) И (НЕ Отказ) И (СтатусПартииКомплектуемогоАвтомобиля=Перечисления.СтатусыПартий.ТоварКупленный) Тогда
				НоваяЗапись=НаборЗаписейОстаткиАвтомобилей.Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период=ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.Партия=ПартияКомплектуемогоАвтомобиля;
				НоваяЗапись.СтатусПартии=СтатусПартииКомплектуемогоАвтомобиля;
				НоваяЗапись.ГТД=ГТДКомплектуемогоАвтомобиля;
				НоваяЗапись.СкладКомпании=АвтомобильСкладКомпании;
				НоваяЗапись.Автомобиль=ШапкаДокумента.Автомобиль;
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
				НоваяЗапись.Количество=0;
				НоваяЗапись.Сумма=Окр(обПересчет(ШапкаДокумента.СуммаРаботДокумента,ВалютаДокумента,КурсДокумента,ВалютаРегл,КурсРегл),2);
				НоваяЗапись.СуммаУпр=Окр(обПересчет(ШапкаДокумента.СуммаРаботДокумента,ВалютаДокумента,КурсДокумента,ВалютаУпр,КурсУпр),2);
				НоваяЗапись.СуммаНДС=Окр(обПересчет(СуммаНДСАвторабот,ВалютаДокумента,КурсДокумента,ВалютаРегл,КурсРегл),2);
				НаборЗаписейОстаткиАвтомобилей.Записать();
				
				Если (НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии) Тогда
					//Доходы и расходы
					НаборЗаписейДоходыИРасходы							= Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект 			= ЭтотОбъект;
					Если ВедетсяБалансПоПодразделению Тогда
						НаборЗаписейДоходыИРасходы.Подразделение		= АвтомобильСкладКомпании.Подразделение;
					КонецЕсли; 
					НаборЗаписейДоходыИРасходы.ШапкаДокумента			= ШапкаДокумента;
					Если обЗначениеНеЗаполнено(ШапкаДокумента.ВидРемонта.СтатьяДоходаРаботы) Тогда
						Если ШапкаДокумента.ВидРемонта=КомплектацияАвтомобиля Тогда
							НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.КомплектацияАвтомобилей;
						Иначе
							НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ОтклонениеСебестоимостиПриКомплектации;
						КонецЕсли; 
					Иначе
						НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= ШапкаДокумента.ВидРемонта.СтатьяДоходаРаботы;
					КонецЕсли; 
					НаборЗаписейДоходыИРасходы.ВУпрВалюте				= Ложь;
					НаборЗаписейДоходыИРасходы.Доход					= ШапкаДокумента.СуммаРаботДокумента;
					Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
				КонецЕсли; 
			КонецЕсли; 
		Иначе
			дкСообщитьРезультат("Автомобиль """+СокрЛП(ШапкаДокумента.Автомобиль)+""" отсутствует!","Важное&Партии автомобилей компании:",ЭтотОбъект,ШапкаДокумента.Автомобиль);
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	
	// если идет допроведение, то надо получить те значения которые были раньше
	Если НЕ ДополнительныеСвойства.ОперативноеПроведение И Ссылка<>ДокументСсылка И
		КомплектацияАвтомобиля<>Неопределено И КомплектацияАвтомобиля = ДокументСсылка.ВидРемонта Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
		Результат = Запрос.Выполнить(); АвтомобильСкладКомпанииБыл=Неопределено;
		Если НЕ Результат.Пустой() Тогда
			АвтомобильСкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
		КонецЕсли;
		ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл",АвтомобильСкладКомпанииБыл);
		ДополнительныеСвойства.МоментВремениБыл = ШапкаДокумента.МоментВремени;
	КонецЕсли;
	
	ДвигаемГраницу = (НЕ ДополнительныеСвойства.ОперативноеПроведение И
						ВидРемонта = КомплектацияАвтомобиля И
						НаборЗаписейОстаткиАвтомобилей.Количество()>0);
						
	Если ДополнительныеСвойства.ПроверятьПоследовательность И (ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл)) Тогда
		НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			НаборЗаписейГраницыАвтомобили.СкладКомпании	= АвтомобильСкладКомпании;
			НаборЗаписейГраницыАвтомобили.МоментВремени	= ШапкаДокумента.Дата;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыАвтомобили.СкладКомпании	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремени	= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыАвтомобили.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	КонецЕсли;
	
	СуммаНаСебестоимость=0; СуммаУпрНаСебестоимость=0; СуммаНДСНаСебестоимость=0;
	
	Если НЕ Отказ Тогда
		//Извлечение товаров из производства
		//и помещение их в реализованные или проданные товары
		//Получим остатки деталей в производстве по данному заказ-наряду
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВПроизводствеОстатки.Цех.Организация КАК Организация,
		               |	ТоварыВПроизводствеОстатки.Цех КАК Цех,
		               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		               |	ТоварыВПроизводствеОстатки.СтатусПартии КАК СтатусПартии,
		               |	ТоварыВПроизводствеОстатки.Партия КАК Партия,
		               |	ТоварыВПроизводствеОстатки.Партия.Контрагент КАК Поставщик,
		               |	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ТоварыВПроизводствеОстатки.ГТД КАК ГТД,
		               |	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК Количество,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаОстаток) КАК Сумма,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаУпрОстаток) КАК СуммаУпр,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаНДСОстаток) КАК СуммаНДС
		               |ИЗ
		               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыВПроизводствеОстатки.Цех,
		               |	ТоварыВПроизводствеОстатки.Номенклатура,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры,
		               |	ТоварыВПроизводствеОстатки.СтатусПартии,
		               |	ТоварыВПроизводствеОстатки.Партия,
		               |	ТоварыВПроизводствеОстатки.Партия.Контрагент,
		               |	ТоварыВПроизводствеОстатки.Партия.ДоговорВзаиморасчетов,
		               |	ТоварыВПроизводствеОстатки.ГТД
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ";
		Запрос.УстановитьПараметр("ЗаказНаряд",ШапкаДокумента.Ссылка);
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "ТоварыВПроизводстве");
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период", Новый Диапазон(, ШапкаДокумента.Дата)); 
		ЗначенияБлокировки.Вставить("ЗаказНаряд", ШапкаДокумента.Ссылка); 
		обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки);
		тзДеталиВПроизводстве = Запрос.Выполнить().Выгрузить();
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
					 |	ЗаказНарядТовары.Номенклатура,
					 |	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
					 |	ЗаказНарядТовары.СтавкаНДС,
					 |	СУММА(ВЫРАЗИТЬ(ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент КАК ЧИСЛО(15,3))) КАК Количество,
					 |	СУММА(ЗаказНарядТовары.СуммаНДС) КАК СуммаНДС,
					 |	СУММА(ЗаказНарядТовары.СуммаСкидки + ЗаказНарядТовары.СуммаСкидкиСтроки + ЗаказНарядТовары.СуммаСкидкиБонусами) КАК СуммаСкидки,
					 |	СУММА(ЗаказНарядТовары.СуммаВсего) КАК СуммаВсего
					 |ИЗ
					 |	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
					 |ГДЕ
					 |	ЗаказНарядТовары.Ссылка = &ЗаказНаряд
					 |СГРУППИРОВАТЬ ПО
					 |	ЗаказНарядТовары.Номенклатура,
					 |	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
					 |	ЗаказНарядТовары.СтавкаНДС";
		Запрос.УстановитьПараметр("ЗаказНаряд",ШапкаДокумента.Ссылка);
		тзДеталиЗаказНаряда=Запрос.Выполнить().Выгрузить();
		НаборЗаписейТоварыВПроизводстве=Движения.ТоварыВПроизводстве;
		НаборЗаписейПродажи=Движения.Продажи;
		НаборЗаписейРеализованныеТовары=Движения.РеализованныеТовары;
		Если СписаниеТоваровПоСебестоимости Тогда
			ЗапретПродажиНижеСебестоимости=Ложь;
		Иначе
			ЗапретПродажиНижеСебестоимости=обПраво("ЗапретитьПродажуНижеСебестоимости",Права,,ЭтотОбъект);
		КонецЕсли; 
		Сообщение="";
		Для каждого СтрокаЗаказНаряда Из тзДеталиЗаказНаряда Цикл
			СуммаПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			СуммаПродажиУпр=Окр(обПересчет(СтрокаЗаказНаряда.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
			СуммаНДСПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			СуммаСкидкиПродажи=Окр(обПересчет(СтрокаЗаказНаряда.СуммаСкидки,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
			НоваяЗаписьПродажи=Неопределено;
			СуммаПродажиОсталось=СуммаПродажи;
			СуммаПродажиУпрОсталось=СуммаПродажиУпр;
			СуммаНДСПродажиОсталось=СуммаНДСПродажи;
			СуммаСкидкиПродажиОсталось=СуммаСкидкиПродажи;
			СтрокиВПроизводстве=тзДеталиВПроизводстве.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаЗаказНаряда.Номенклатура,СтрокаЗаказНаряда.ХарактеристикаНоменклатуры));
			ОсталосьСписать=СтрокаЗаказНаряда.Количество; Списано=0;
			Если НаСебестоимость Тогда
				СуммаНаСебестоимость=СуммаНаСебестоимость+СуммаПродажи;
				СуммаУпрНаСебестоимость=СуммаУпрНаСебестоимость+СуммаПродажиУпр;
				СуммаНДСНаСебестоимость=СуммаНДСНаСебестоимость+СуммаНДСПродажи;
			КонецЕсли;
			Для каждого СтрокаВПроизводстве Из СтрокиВПроизводстве Цикл
				Если ОсталосьСписать=0 Тогда Прервать; КонецЕсли; 
				Если СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
					Если СтрокаВПроизводстве.Организация<>Организация Тогда
						дкСообщитьРезультат("Организация цеха <"+СокрЛП(СтрокаВПроизводстве.Цех)+"> не соответствует организации документа !",,ЭтотОбъект);
						Отказ=Истина; Прервать;
					КонецЕсли; 
				КонецЕсли;
				Списывается=Мин(ОсталосьСписать,СтрокаВПроизводстве.Количество);
				НоваяЗаписьТоварыВПроизводстве=НаборЗаписейТоварыВПроизводстве.Добавить();
				НоваяЗаписьТоварыВПроизводстве.ВидДвижения=ВидДвиженияНакопления.Расход;
				НоваяЗаписьТоварыВПроизводстве.Период=ШапкаДокумента.Дата;
				НоваяЗаписьТоварыВПроизводстве.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗаписьТоварыВПроизводстве.ЗаказНаряд=ШапкаДокумента.Ссылка;
				НоваяЗаписьТоварыВПроизводстве.Цех=СтрокаВПроизводстве.Цех;
				НоваяЗаписьТоварыВПроизводстве.Номенклатура=СтрокаВПроизводстве.Номенклатура;
				НоваяЗаписьТоварыВПроизводстве.ХарактеристикаНоменклатуры=СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
				НоваяЗаписьТоварыВПроизводстве.СтатусПартии=СтрокаВПроизводстве.СтатусПартии;
				НоваяЗаписьТоварыВПроизводстве.Партия=СтрокаВПроизводстве.Партия;
				НоваяЗаписьТоварыВПроизводстве.ГТД=СтрокаВПроизводстве.ГТД;
				НоваяЗаписьТоварыВПроизводстве.ХозОперация=ШапкаДокумента.ХозОперация;
				НоваяЗаписьТоварыВПроизводстве.Количество=Списывается;
				НоваяЗаписьТоварыВПроизводстве.Сумма=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.Сумма*Списывается)/СтрокаВПроизводстве.Количество,2));
				НоваяЗаписьТоварыВПроизводстве.СуммаУпр=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.СуммаУпр*Списывается)/СтрокаВПроизводстве.Количество,2));
				НоваяЗаписьТоварыВПроизводстве.СуммаНДС=?(СтрокаВПроизводстве.Количество=0,0,Окр((СтрокаВПроизводстве.СуммаНДС*Списывается)/СтрокаВПроизводстве.Количество,2));
				ОсталосьСписать=ОсталосьСписать-НоваяЗаписьТоварыВПроизводстве.Количество;
				Списано=Списано+НоваяЗаписьТоварыВПроизводстве.Количество;
				СтрокаВПроизводстве.Количество=СтрокаВПроизводстве.Количество-НоваяЗаписьТоварыВПроизводстве.Количество;
				СтрокаВПроизводстве.Сумма=СтрокаВПроизводстве.Сумма-НоваяЗаписьТоварыВПроизводстве.Сумма;
				СтрокаВПроизводстве.СуммаУпр=СтрокаВПроизводстве.СуммаУпр-НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
				СтрокаВПроизводстве.СуммаНДС=СтрокаВПроизводстве.СуммаНДС-НоваяЗаписьТоварыВПроизводстве.СуммаНДС;
				Если СтрокаВПроизводстве.Количество=0 Тогда
					НоваяЗаписьТоварыВПроизводстве.Сумма=НоваяЗаписьТоварыВПроизводстве.Сумма+СтрокаВПроизводстве.Сумма;
					НоваяЗаписьТоварыВПроизводстве.СуммаУпр=НоваяЗаписьТоварыВПроизводстве.СуммаУпр+СтрокаВПроизводстве.СуммаУпр;
					НоваяЗаписьТоварыВПроизводстве.СуммаНДС=НоваяЗаписьТоварыВПроизводстве.СуммаНДС+СтрокаВПроизводстве.СуммаНДС;
				КонецЕсли; 
				НоваяЗаписьКомплектацияАвтомобилей=Неопределено;
				Если ВидРемонта=КомплектацияАвтомобиля Тогда
					//Если мы комплектуем автомобиль
					//Переместим детали в партионный регистр комплектации автомобиля
					Если СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
						Если АвтомобильСкладКомпании.Организация<>НоваяЗаписьТоварыВПроизводстве.Цех.Организация Тогда
							дкСообщитьРезультат("Организация склада хранения автомобиля <"+СокрЛП(АвтомобильСкладКомпании.Организация)+"> не соответствует организации цеха <"+СокрЛП(НоваяЗаписьТоварыВПроизводстве.Цех)+"> !",,ЭтотОбъект);
							Отказ=Истина;
						КонецЕсли; 
					КонецЕсли;
					Если НЕ Отказ Тогда
						НоваяЗаписьКомплектацияАвтомобилей=НаборЗаписейКомплектацияАвтомобилей.Добавить();
						НоваяЗаписьКомплектацияАвтомобилей.ВидДвижения=ВидДвиженияНакопления.Приход;
						НоваяЗаписьКомплектацияАвтомобилей.Период=ШапкаДокумента.Дата;
						НоваяЗаписьКомплектацияАвтомобилей.Регистратор=ШапкаДокумента.Ссылка;
						НоваяЗаписьКомплектацияАвтомобилей.Автомобиль=ШапкаДокумента.Автомобиль;
						НоваяЗаписьКомплектацияАвтомобилей.СкладКомпании=АвтомобильСкладКомпании;
						НоваяЗаписьКомплектацияАвтомобилей.Номенклатура=СтрокаВПроизводстве.Номенклатура;
						НоваяЗаписьКомплектацияАвтомобилей.ХарактеристикаНоменклатуры=СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
						НоваяЗаписьКомплектацияАвтомобилей.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
						НоваяЗаписьКомплектацияАвтомобилей.Партия=СтрокаВПроизводстве.Партия;
						НоваяЗаписьКомплектацияАвтомобилей.ГТД=СтрокаВПроизводстве.ГТД;
						НоваяЗаписьКомплектацияАвтомобилей.ХозОперация=ШапкаДокумента.ХозОперация;
						НоваяЗаписьКомплектацияАвтомобилей.СтавкаНДС=СтрокаЗаказНаряда.СтавкаНДС;
						НоваяЗаписьКомплектацияАвтомобилей.Количество=НоваяЗаписьТоварыВПроизводстве.Количество;
						НоваяЗаписьКомплектацияАвтомобилей.Сумма=НоваяЗаписьТоварыВПроизводстве.Сумма;
						НоваяЗаписьКомплектацияАвтомобилей.СуммаНДС=НоваяЗаписьТоварыВПроизводстве.СуммаНДС;
						НоваяЗаписьКомплектацияАвтомобилей.СуммаУпр=НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
						СуммаПродажи=(СтрокаЗаказНаряда.СуммаВсего*НоваяЗаписьКомплектацияАвтомобилей.Количество)/СтрокаЗаказНаряда.Количество;
						НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажи=Окр(обПересчет(СуммаПродажи,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
						НоваяЗаписьКомплектацияАвтомобилей.СуммаПродажиУпр=Окр(обПересчет(СуммаПродажи,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
					КонецЕсли; 
				КонецЕсли;
				Если НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
					
					СебестоимостьРавнаПродаже = Ложь;
					
					//Сформировать движения для товаров, взятых на комиссию по регистру РеализацияТоваров
					Если СтрокаВПроизводстве.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
						//Комиссионные товары помещаем в реализованные
						НоваяЗаписьРеализованныеТовары=НаборЗаписейРеализованныеТовары.Добавить();
						НоваяЗаписьРеализованныеТовары.ВидДвижения=ВидДвиженияНакопления.Приход;
						НоваяЗаписьРеализованныеТовары.Период=ШапкаДокумента.Дата;
						НоваяЗаписьРеализованныеТовары.Регистратор=ШапкаДокумента.Ссылка;
						НоваяЗаписьРеализованныеТовары.Контрагент=СтрокаВПроизводстве.Поставщик;
						НоваяЗаписьРеализованныеТовары.ДоговорВзаиморасчетов=СтрокаВПроизводстве.ДоговорВзаиморасчетов;
						НоваяЗаписьРеализованныеТовары.Номенклатура=СтрокаВПроизводстве.Номенклатура;
						НоваяЗаписьРеализованныеТовары.ХарактеристикаНоменклатуры=СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
						НоваяЗаписьРеализованныеТовары.ДокументПередачи=СтрокаВПроизводстве.Партия;
						НоваяЗаписьРеализованныеТовары.ГТД=СтрокаВПроизводстве.ГТД;
						НоваяЗаписьРеализованныеТовары.ХозОперация=ШапкаДокумента.ХозОперация;
						НоваяЗаписьРеализованныеТовары.Количество=НоваяЗаписьТоварыВПроизводстве.Количество;
						НоваяЗаписьРеализованныеТовары.СуммаРегл=НоваяЗаписьТоварыВПроизводстве.Сумма;
						НоваяЗаписьРеализованныеТовары.СуммаУпр=НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
						НоваяЗаписьРеализованныеТовары.СуммаПродажи=Окр(обПересчет((СтрокаЗаказНаряда.СуммаВсего*НоваяЗаписьТоварыВПроизводстве.Количество)/СтрокаЗаказНаряда.Количество,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
						НоваяЗаписьРеализованныеТовары.СуммаПродажиРегл=Окр(обПересчет((СтрокаЗаказНаряда.СуммаВсего*НоваяЗаписьТоварыВПроизводстве.Количество)/СтрокаЗаказНаряда.Количество,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
						//СебестоимостьРавнаПродаже
						Если (НЕ НоваяЗаписьРеализованныеТовары.ДоговорВзаиморасчетов.КомиссияОтчетНаОснованииПродаж) Тогда
							НоваяЗаписьРеализованныеТовары.СуммаРегл = НоваяЗаписьРеализованныеТовары.СуммаПродажиРегл;
							НоваяЗаписьРеализованныеТовары.СуммаУпр  = НоваяЗаписьРеализованныеТовары.СуммаПродажи;
							СебестоимостьРавнаПродаже = Истина;
						КонецЕсли;
					КонецЕсли;
					Если ВидРемонта<>КомплектацияАвтомобиля И ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
						Количество=НоваяЗаписьТоварыВПроизводстве.Количество;
						Сумма=Окр((СуммаПродажи*Количество)/СтрокаЗаказНаряда.Количество,2);
						СуммаУпр=Окр((СуммаПродажиУпр*Количество)/СтрокаЗаказНаряда.Количество,2);
						СуммаНДС=Окр((СуммаНДСПродажи*Количество)/СтрокаЗаказНаряда.Количество,2);
						Если НЕ НаСебестоимость Тогда
							//И товары в регистр продаж
							НоваяЗаписьПродажи=НаборЗаписейПродажи.Добавить();
							НоваяЗаписьПродажи.Период=ШапкаДокумента.Дата;
							НоваяЗаписьПродажи.Регистратор=ШапкаДокумента.Ссылка;
							НоваяЗаписьПродажи.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
							НоваяЗаписьПродажи.Номенклатура=СтрокаВПроизводстве.Номенклатура;
							НоваяЗаписьПродажи.ДокументПродажи=ШапкаДокумента.ДокументПродажи;
							НоваяЗаписьПродажи.Поставщик=СтрокаВПроизводстве.Поставщик;
							НоваяЗаписьПродажи.Покупатель=ШапкаДокумента.Контрагент;
							НоваяЗаписьПродажи.СтатусПартии=СтрокаВПроизводстве.СтатусПартии;
							НоваяЗаписьПродажи.ХозОперация=ШапкаДокумента.ХозОперация;
							НоваяЗаписьПродажи.ДоговорВзаиморасчетов=ШапкаДокумента.ДоговорВзаиморасчетов;
							НоваяЗаписьПродажи.ХарактеристикаНоменклатуры=СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
							НоваяЗаписьПродажи.СкладКомпании=СтрокаВПроизводстве.Цех;
							НоваяЗаписьПродажи.СтавкаНДС=СтрокаЗаказНаряда.СтавкаНДС;
							НоваяЗаписьПродажи.Партия=СтрокаВПроизводстве.Партия;
							НоваяЗаписьПродажи.ГТД=СтрокаВПроизводстве.ГТД;
							НоваяЗаписьПродажи.Количество=Количество;
							НоваяЗаписьПродажи.Сумма=Сумма;
							НоваяЗаписьПродажи.СуммаНДС=СуммаНДС;
							НоваяЗаписьПродажи.СуммаСкидки=Окр((СуммаСкидкиПродажи*НоваяЗаписьПродажи.Количество)/СтрокаЗаказНаряда.Количество,2);
							НоваяЗаписьПродажи.СуммаУпр=СуммаУпр;
							НоваяЗаписьПродажи.СебестоимостьУпр=НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
							НоваяЗаписьПродажи.Себестоимость=НоваяЗаписьТоварыВПроизводстве.Сумма;
							НоваяЗаписьПродажи.СуммаНДСВходящий=НоваяЗаписьТоварыВПроизводстве.СуммаНДС;
							Если ЗапретПродажиНижеСебестоимости Тогда  
								
								//Если НоваяЗаписьПродажи.СебестоимостьУпр>НоваяЗаписьПродажи.СуммаУпр Тогда
								//	Если НЕ ПустаяСтрока(Сообщение) Тогда Сообщение=Сообщение+Символы.ПС; КонецЕсли; 
								//	Если обЗначениеНеЗаполнено(СтрокаВПроизводстве.ХарактеристикаНоменклатуры) Тогда
								//		Сообщение=Сообщение+"["+СокрЛП(СтрокаВПроизводстве.Номенклатура.Код)+"] Товар """+СокрЛП(СтрокаВПроизводстве.Номенклатура)+""". Продажа ниже себестоимости запрещена.";
								//	Иначе
								//		Сообщение=Сообщение+"["+СокрЛП(СтрокаВПроизводстве.Номенклатура.Код)+"] Товар """+СокрЛП(СтрокаВПроизводстве.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаВПроизводстве.ХарактеристикаНоменклатуры)+""". Продажа ниже себестоимости запрещена.";
								//	КонецЕсли; 
								//	Отказ=Истина;
								//КонецЕсли;    
								
								//<<Павличенко 03.11.17
								//разрешено вводить ЗН гарантийные с ценой ниже себестоимости
								ПроверятьПродажуНижеСебестоимости  = Истина;
								ГарантийныйЗН = (ВидРемонта=Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010") ИЛИ ВидРемонта=Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011") ИЛИ ВидРемонта=Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000050")) ; //гарантийный
								ВСпискеРазрешенных = обПраво("РазрешитьСписаниеНижеСебестоимостиПоГарантии");  //пользователь в списке тех, кому разрешено
								Если ГарантийныйЗН и ВСпискеРазрешенных тогда
									ПроверятьПродажуНижеСебестоимости = Ложь;
								КонецЕсли;	  
								Если ПроверятьПродажуНижеСебестоимости тогда
									Если НоваяЗаписьПродажи.СебестоимостьУпр>НоваяЗаписьПродажи.СуммаУпр Тогда
										
										// Ульянов 09.07.18 Ищем исключение из правил
										Если НЕ МожноПродать(СтрокаВПроизводстве.Номенклатура) Тогда
											Если НЕ ПустаяСтрока(Сообщение) Тогда Сообщение=Сообщение+Символы.ПС; КонецЕсли; 
											Если обЗначениеНеЗаполнено(СтрокаВПроизводстве.ХарактеристикаНоменклатуры) Тогда
												Сообщение=Сообщение+"["+СокрЛП(СтрокаВПроизводстве.Номенклатура.Код)+"] Товар """+СокрЛП(СтрокаВПроизводстве.Номенклатура)+""". Продажа ниже себестоимости запрещена.";
											Иначе
												Сообщение=Сообщение+"["+СокрЛП(СтрокаВПроизводстве.Номенклатура.Код)+"] Товар """+СокрЛП(СтрокаВПроизводстве.Номенклатура)+""" с характеристикой """+СокрЛП(СтрокаВПроизводстве.ХарактеристикаНоменклатуры)+""". Продажа ниже себестоимости запрещена.";
											КонецЕсли; 
											Отказ=Истина;
										КонецЕсли;
									КонецЕсли; 
								КонецЕсли;
								//>>Павличенко 03.11.17	
								
							КонецЕсли; 
							СуммаПродажиОсталось=СуммаПродажиОсталось-НоваяЗаписьПродажи.Сумма;
							СуммаПродажиУпрОсталось=СуммаПродажиУпрОсталось-НоваяЗаписьПродажи.СуммаУпр;
							СуммаНДСПродажиОсталось=СуммаНДСПродажиОсталось-НоваяЗаписьПродажи.СуммаНДС;
							СуммаСкидкиПродажиОсталось=СуммаСкидкиПродажиОсталось-НоваяЗаписьПродажи.СуммаСкидки;
							
							Если СебестоимостьРавнаПродаже Тогда
								
								СтавкаНДСВходящее   = Окр(НоваяЗаписьПродажи.СуммаНДСВходящий/(НоваяЗаписьПродажи.Себестоимость-НоваяЗаписьПродажи.СуммаНДСВходящий), 2);
								
								//Если (НоваяЗаписьПродажи.Себестоимость-НоваяЗаписьПродажи.СуммаНДСВходящий) = 0 Тогда
								//	Если ЭтотОбъект.Метаданные().Реквизиты.Найти("Контрагент") = Неопределено Тогда
								//		ОсвобожденОтНДС = Ложь;
								//	Иначе
								//		ОсвобожденОтНДС = ЭтотОбъект.Контрагент.ОсвобожденОтНДС;
								//	КонецЕсли;
								//	Если ОсвобожденОтНДС Тогда
								//		СтавкаНДСВходящее = Справочники.СтавкиНДС.БезНДС.Ставка;
								//	Иначе
								//		СтавкаНДСВходящее = НоваяЗаписьПродажи.Номенклатура.СтавкаНДС.Ставка / 100;
								//	КонецЕсли;
								//Иначе
								//	СтавкаНДСВходящее = Окр(НоваяЗаписьПродажи.СуммаНДСВходящий/(НоваяЗаписьПродажи.Себестоимость-НоваяЗаписьПродажи.СуммаНДСВходящий), 2);
								//КонецЕсли;
								
								СебестоимостьБезНДС = (НоваяЗаписьПродажи.Сумма-НоваяЗаписьПродажи.СуммаНДС);
								
								НоваяЗаписьПродажи.Себестоимость    = НоваяЗаписьПродажи.Сумма;
								НоваяЗаписьПродажи.СебестоимостьУпр = НоваяЗаписьПродажи.СуммаУпр;
								НоваяЗаписьПродажи.СуммаНДСВходящий = Окр(СебестоимостьБезНДС*СтавкаНДСВходящее, 2);
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли; 
				Если СтрокаВПроизводстве.Количество=0 Тогда
					тзДеталиВПроизводстве.Удалить(СтрокаВПроизводстве);
				КонецЕсли; 
			КонецЦикла; 
			Если НоваяЗаписьПродажи<>Неопределено Тогда
				НоваяЗаписьПродажи.Сумма=НоваяЗаписьПродажи.Сумма+СуммаПродажиОсталось;
				НоваяЗаписьПродажи.СуммаУпр=НоваяЗаписьПродажи.СуммаУпр+СуммаПродажиУпрОсталось;
				НоваяЗаписьПродажи.СуммаНДС=НоваяЗаписьПродажи.СуммаНДС+СуммаНДСПродажиОсталось;
				НоваяЗаписьПродажи.СуммаСкидки=НоваяЗаписьПродажи.СуммаСкидки+СуммаСкидкиПродажиОсталось;
			КонецЕсли; 
			Если (НЕ Отказ) И (ОсталосьСписать<>0) Тогда
				//Остаток в производстве менее чем в заказ-наряде
				Если НЕ ПустаяСтрока(Сообщение) Тогда Сообщение=Сообщение+Символы.ПС; КонецЕсли; 
				Сообщение=Сообщение+"Товар """+СокрЛП(СтрокаЗаказНаряда.Номенклатура);
				Если НЕ обЗначениеНеЗаполнено(СтрокаЗаказНаряда.ХарактеристикаНоменклатуры) Тогда
					Сообщение=Сообщение+""" с характеристикой """+СокрЛП(СтрокаЗаказНаряда.ХарактеристикаНоменклатуры)+"""";
				КонецЕсли;
				Сообщение=Сообщение+". Требуется по заказ-наряду "+СокрЛП(СтрокаЗаказНаряда.Количество)+" "+СокрЛП(СтрокаЗаказНаряда.Номенклатура.БазоваяЕдиницаИзмерения)+". Помещено в производство "+СокрЛП(Списано)+" "+СокрЛП(СтрокаЗаказНаряда.Номенклатура.БазоваяЕдиницаИзмерения)+". ";
				Сообщение=Сообщение+"Недостает для завершения "+СокрЛП(ОсталосьСписать)+" "+СокрЛП(СтрокаЗаказНаряда.Номенклатура.БазоваяЕдиницаИзмерения);
				Отказ=Истина;
			КонецЕсли; 
		КонецЦикла;
		
		ТаблицаСебестоимостиМатериалов = Новый ТаблицаЗначений;
		ТаблицаСебестоимостиМатериалов.Колонки.Добавить("ИдентификаторРаботы", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
		ТаблицаСебестоимостиМатериалов.Колонки.Добавить("Сумма",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСебестоимостиМатериалов.Колонки.Добавить("СуммаУпр", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		ТаблицаСебестоимостиМатериалов.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		
		Запрос.Текст="ВЫБРАТЬ
					 |	ЗаказНарядМатериалы.ИдентификаторРаботы,
					 |	ЗаказНарядМатериалы.Номенклатура,
					 |	ЗаказНарядМатериалы.ХарактеристикаНоменклатуры,
					 |	СУММА(ЗаказНарядМатериалы.Количество * ЗаказНарядМатериалы.Коэффициент) КАК Количество
					 |ИЗ
					 |	Документ.ЗаказНаряд.Материалы КАК ЗаказНарядМатериалы
					 |ГДЕ
					 |	ЗаказНарядМатериалы.Ссылка = &ЗаказНаряд
					 |СГРУППИРОВАТЬ ПО
					 |	ЗаказНарядМатериалы.ИдентификаторРаботы,
					 |	ЗаказНарядМатериалы.Номенклатура,
					 |	ЗаказНарядМатериалы.ХарактеристикаНоменклатуры";
		
		Выборка = Запрос.Выполнить().Выбрать();
		//Сообщение="";
		Пока Выборка.Следующий() Цикл
			СтрокиВПроизводстве = тзДеталиВПроизводстве.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Выборка.Номенклатура, Выборка.ХарактеристикаНоменклатуры));
			ОсталосьСписать = Выборка.Количество;
			Списано         = 0;
			//Если НаСебестоимость Тогда
			//	СуммаНаСебестоимость=СуммаНаСебестоимость+СуммаПродажи;
			//	СуммаУпрНаСебестоимость=СуммаУпрНаСебестоимость+СуммаПродажиУпр;
			//	СуммаНДСНаСебестоимость=СуммаНДСНаСебестоимость+СуммаНДСПродажи;
			//КонецЕсли;
			Для Каждого СтрокаВПроизводстве Из СтрокиВПроизводстве Цикл
				Если ОсталосьСписать=0 Тогда
					Прервать;
				КонецЕсли;
				
				Если СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоОрганизации Тогда
					Если СтрокаВПроизводстве.Организация<>Организация Тогда
						дкСообщитьРезультат("Организация цеха <"+СокрЛП(СтрокаВПроизводстве.Цех)+"> не соответствует организации документа !",,ЭтотОбъект);
						Отказ=Истина;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				
				НоваяЗаписьТоварыВПроизводстве = НаборЗаписейТоварыВПроизводстве.Добавить();
				НоваяЗаписьТоварыВПроизводстве.ВидДвижения                = ВидДвиженияНакопления.Расход;
				НоваяЗаписьТоварыВПроизводстве.Период                     = ШапкаДокумента.Дата;
				НоваяЗаписьТоварыВПроизводстве.Регистратор                = ШапкаДокумента.Ссылка;
				НоваяЗаписьТоварыВПроизводстве.ЗаказНаряд                 = ШапкаДокумента.Ссылка;
				НоваяЗаписьТоварыВПроизводстве.Цех                        = СтрокаВПроизводстве.Цех;
				НоваяЗаписьТоварыВПроизводстве.Номенклатура               = СтрокаВПроизводстве.Номенклатура;
				НоваяЗаписьТоварыВПроизводстве.ХарактеристикаНоменклатуры = СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
				НоваяЗаписьТоварыВПроизводстве.СтатусПартии               = СтрокаВПроизводстве.СтатусПартии;
				НоваяЗаписьТоварыВПроизводстве.Партия                     = СтрокаВПроизводстве.Партия;
				НоваяЗаписьТоварыВПроизводстве.ГТД                        = СтрокаВПроизводстве.ГТД;
				НоваяЗаписьТоварыВПроизводстве.ХозОперация                = ШапкаДокумента.ХозОперация;
				
				УдалитьСтрокуВПроизводстве = Ложь;
				Если СтрокаВПроизводстве.Количество>ОсталосьСписать Тогда
					НоваяЗаписьТоварыВПроизводстве.Количество             = ОсталосьСписать;
					НоваяЗаписьТоварыВПроизводстве.Сумма                  = Окр((СтрокаВПроизводстве.Сумма*ОсталосьСписать)/СтрокаВПроизводстве.Количество, 2);
					НоваяЗаписьТоварыВПроизводстве.СуммаУпр               = Окр((СтрокаВПроизводстве.СуммаУпр*ОсталосьСписать)/СтрокаВПроизводстве.Количество, 2);
					НоваяЗаписьТоварыВПроизводстве.СуммаНДС               = Окр((СтрокаВПроизводстве.СуммаНДС*ОсталосьСписать)/СтрокаВПроизводстве.Количество, 2);
					
					СтрокаВПроизводстве.Количество = СтрокаВПроизводстве.Количество - ОсталосьСписать;
					СтрокаВПроизводстве.Сумма      = СтрокаВПроизводстве.Сумма      - НоваяЗаписьТоварыВПроизводстве.Сумма;
					СтрокаВПроизводстве.СуммаУпр   = СтрокаВПроизводстве.СуммаУпр   - НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
					СтрокаВПроизводстве.СуммаНДС   = СтрокаВПроизводстве.СуммаНДС   - НоваяЗаписьТоварыВПроизводстве.СуммаНДС;
					
					ОсталосьСписать = 0;
				Иначе
					НоваяЗаписьТоварыВПроизводстве.Количество             = СтрокаВПроизводстве.Количество;
					НоваяЗаписьТоварыВПроизводстве.Сумма                  = СтрокаВПроизводстве.Сумма;
					НоваяЗаписьТоварыВПроизводстве.СуммаУпр               = СтрокаВПроизводстве.СуммаУпр;
					НоваяЗаписьТоварыВПроизводстве.СуммаНДС               = СтрокаВПроизводстве.СуммаНДС;
					ОсталосьСписать = ОсталосьСписать - СтрокаВПроизводстве.Количество;
					
					УдалитьСтрокуВПроизводстве = Истина;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаСебестоимостиМатериалов.Добавить();
				НоваяСтрока.ИдентификаторРаботы = Выборка.ИдентификаторРаботы;
				НоваяСтрока.Сумма               = НоваяЗаписьТоварыВПроизводстве.Сумма;
				НоваяСтрока.СуммаУпр            = НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
				НоваяСтрока.СуммаНДС            = НоваяЗаписьТоварыВПроизводстве.СуммаНДС;
				
				Списано = Списано + НоваяЗаписьТоварыВПроизводстве.Количество;
				
				Если НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
					//Сформировать движения для товаров, взятых на комиссию по регистру РеализацияТоваров
					Если СтрокаВПроизводстве.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
						//Комиссионные товары помещаем в реализованные
						НоваяЗаписьРеализованныеТовары = НаборЗаписейРеализованныеТовары.Добавить();
						НоваяЗаписьРеализованныеТовары.ВидДвижения                = ВидДвиженияНакопления.Приход;
						НоваяЗаписьРеализованныеТовары.Период                     = ШапкаДокумента.Дата;
						НоваяЗаписьРеализованныеТовары.Регистратор                = ШапкаДокумента.Ссылка;
						НоваяЗаписьРеализованныеТовары.Контрагент                 = СтрокаВПроизводстве.Поставщик;
						НоваяЗаписьРеализованныеТовары.ДоговорВзаиморасчетов      = СтрокаВПроизводстве.ДоговорВзаиморасчетов;
						НоваяЗаписьРеализованныеТовары.Номенклатура               = СтрокаВПроизводстве.Номенклатура;
						НоваяЗаписьРеализованныеТовары.ХарактеристикаНоменклатуры = СтрокаВПроизводстве.ХарактеристикаНоменклатуры;
						НоваяЗаписьРеализованныеТовары.ДокументПередачи           = СтрокаВПроизводстве.Партия;
						НоваяЗаписьРеализованныеТовары.ГТД                        = СтрокаВПроизводстве.ГТД;
						НоваяЗаписьРеализованныеТовары.ХозОперация                = ШапкаДокумента.ХозОперация;
						НоваяЗаписьРеализованныеТовары.Количество                 = НоваяЗаписьТоварыВПроизводстве.Количество;
						НоваяЗаписьРеализованныеТовары.СуммаРегл                  = НоваяЗаписьТоварыВПроизводстве.Сумма;
						НоваяЗаписьРеализованныеТовары.СуммаПродажиРегл           = НоваяЗаписьТоварыВПроизводстве.Сумма;
						НоваяЗаписьРеализованныеТовары.СуммаУпр                   = НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
						НоваяЗаписьРеализованныеТовары.СуммаПродажи               = НоваяЗаписьТоварыВПроизводстве.СуммаУпр;
					КонецЕсли;
				КонецЕсли;
				Если УдалитьСтрокуВПроизводстве Тогда
					тзДеталиВПроизводстве.Удалить(СтрокаВПроизводстве);
				КонецЕсли;
			КонецЦикла;
			Если НоваяЗаписьПродажи<>Неопределено Тогда
				НоваяЗаписьПродажи.Сумма=НоваяЗаписьПродажи.Сумма+СуммаПродажиОсталось;
				НоваяЗаписьПродажи.СуммаУпр=НоваяЗаписьПродажи.СуммаУпр+СуммаПродажиУпрОсталось;
				НоваяЗаписьПродажи.СуммаНДС=НоваяЗаписьПродажи.СуммаНДС+СуммаНДСПродажиОсталось;
				НоваяЗаписьПродажи.СуммаСкидки=НоваяЗаписьПродажи.СуммаСкидки+СуммаСкидкиПродажиОсталось;
			КонецЕсли;
			Если (НЕ Отказ) И (ОсталосьСписать<>0) Тогда
				//Остаток в производстве менее чем в заказ-наряде
				Если НЕ ПустаяСтрока(Сообщение) Тогда Сообщение=Сообщение+Символы.ПС; КонецЕсли; 
				Сообщение=Сообщение+"Товар """+СокрЛП(Выборка.Номенклатура);
				Если НЕ обЗначениеНеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
					Сообщение=Сообщение+""" с характеристикой """+СокрЛП(Выборка.ХарактеристикаНоменклатуры)+"""";
				КонецЕсли;
				Сообщение=Сообщение+". Требуется по заказ-наряду "+СокрЛП(Выборка.Количество)+" "+СокрЛП(Выборка.Номенклатура.БазоваяЕдиницаИзмерения)+". Помещено в производство "+СокрЛП(Списано)+" "+СокрЛП(Выборка.Номенклатура.БазоваяЕдиницаИзмерения)+". ";
				Сообщение=Сообщение+"Недостает для завершения "+СокрЛП(ОсталосьСписать)+" "+СокрЛП(Выборка.Номенклатура.БазоваяЕдиницаИзмерения);
				Отказ=Истина;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаСебестоимостиМатериалов.Свернуть("ИдентификаторРаботы", "Сумма, СуммаУпр, СуммаНДС");
		
		// если идет допроведение, то надо получить те значения которые были раньше
		Если НЕ ДополнительныеСвойства.ОперативноеПроведение И Ссылка<>ДокументСсылка И
			КомплектацияАвтомобиля<>Неопределено И КомплектацияАвтомобиля = ДокументСсылка.ВидРемонта Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); АвтомобильБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				АвтомобильБыл = Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("АвтомобильБыл",АвтомобильБыл);
			ДополнительныеСвойства.МоментВремениБыл = ШапкаДокумента.МоментВремени;
		КонецЕсли;
		
		ДвигаемГраницу = (НЕ ДополнительныеСвойства.ОперативноеПроведение И
						  ВидРемонта=КомплектацияАвтомобиля И
						  НаборЗаписейКомплектацияАвтомобилей.Количество()>0);
		// двигаем границу последовательности комплектаций автомобилей
		Если ДополнительныеСвойства.ПроверятьПоследовательность И (ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильБыл)) Тогда
			НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
			Если ДвигаемГраницу Тогда
				НаборЗаписейГраницыКомплектация.Автомобиль		 = Автомобиль;
				НаборЗаписейГраницыКомплектация.МоментВремени	 = ШапкаДокумента.Дата;
				НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = ДополнительныеСвойства.АвтомобильБыл;
				НаборЗаписейГраницыКомплектация.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
			Иначе
				НаборЗаписейГраницыКомплектация.Автомобиль		 = ДополнительныеСвойства.АвтомобильБыл;
				НаборЗаписейГраницыКомплектация.МоментВремени	 = ДополнительныеСвойства.МоментВремениБыл;
				НаборЗаписейГраницыКомплектация.АвтомобильБыл	 = Неопределено;
				НаборЗаписейГраницыКомплектация.МоментВремениБыл = Неопределено;
			КонецЕсли;
			НаборЗаписейГраницыКомплектация.ДокументСсылка	= ШапкаДокумента.Ссылка;
			НаборЗаписейГраницыКомплектация.ИзменитьГраницу();
		КонецЕсли;
		
		тзДеталиВПроизводстве.Свернуть("Номенклатура,ХарактеристикаНоменклатуры","Количество");
		Для каждого СтрокаВПроизводстве Из тзДеталиВПроизводстве Цикл
			Если СтрокаВПроизводстве.Количество<>0 Тогда
				Если НЕ ПустаяСтрока(Сообщение) Тогда Сообщение=Сообщение+Символы.ПС; КонецЕсли; 
				Сообщение=Сообщение+"Товар """+СокрЛП(СтрокаВПроизводстве.Номенклатура);
				Если НЕ обЗначениеНеЗаполнено(СтрокаВПроизводстве.ХарактеристикаНоменклатуры) Тогда
					Сообщение=Сообщение+""" с характеристикой """+СокрЛП(СтрокаВПроизводстве.ХарактеристикаНоменклатуры)+"""";
				КонецЕсли;
				Сообщение=Сообщение+". После закрытия заказ-наряда в производстве осталось "+СокрЛП(СтрокаВПроизводстве.Количество)+" "+СокрЛП(СтрокаВПроизводстве.Номенклатура.БазоваяЕдиницаИзмерения)+". ";
				Отказ=Истина;
			КонецЕсли; 
		КонецЦикла; 
		Если (Отказ) И (НЕ ПустаяСтрока(Сообщение)) Тогда
			дкСообщитьРезультат(Сообщение,СтатусСообщения="Важное",ЭтотОбъект);
		Иначе
			НаборЗаписейТоварыВПроизводстве.Записать();
			НаборЗаписейРеализованныеТовары.Записать();
			Если НоваяЗаписьКомплектацияАвтомобилей<>Неопределено Тогда
				НаборЗаписейКомплектацияАвтомобилей.Записать();
			КонецЕсли; 
		КонецЕсли;
		
		// Маркировка товаров - спишем с заказ-наряда указанную маркировку товаров в производстве
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	МаркировкаТоваровВПроизводствеОстатки.Цех КАК Цех,
		|	МаркировкаТоваровВПроизводствеОстатки.Номенклатура КАК Номенклатура,
		|	МаркировкаТоваровВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МаркировкаТоваровВПроизводствеОстатки.GTIN КАК GTIN,
		|	МаркировкаТоваровВПроизводствеОстатки.СерийныйНомер КАК СерийныйНомер,
		|	МаркировкаТоваровВПроизводствеОстатки.ГТД КАК ГТД,
		|	МаркировкаТоваровВПроизводствеОстатки.КоличествоОстаток КАК Количество,
		|	""(01)"" + МаркировкаТоваровВПроизводствеОстатки.GTIN + ""(21)"" + МаркировкаТоваровВПроизводствеОстатки.СерийныйНомер КАК КодМаркировки,
		|	МаркировкаТоваровВПроизводствеОстатки.КодМаркировкиBase64 КАК КодМаркировкиBase64
		|ИЗ
		|	РегистрНакопления.МаркировкаТоваровВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК МаркировкаТоваровВПроизводствеОстатки";
		Запрос.УстановитьПараметр("ЗаказНаряд", ШапкаДокумента.Ссылка);
		
		НаборМаркировкаТоваровВПроизводстве = Движения.МаркировкаТоваровВПроизводстве;    
		
		//++СнимченкоАА_бизтех++
		НаборКодыМаркировкиВПроизводстве = Движения.КодыМаркировкиВПроизводстве;    
		//--СнимченкоАА_бизтех--
		
		ТаблицаКодовМаркировки = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекущаяСтрока Из ТаблицаКодовМаркировки Цикл
			НоваяЗапись = НаборМаркировкаТоваровВПроизводстве.Добавить();
			НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период                     = ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор                = ШапкаДокумента.Ссылка;
			НоваяЗапись.ЗаказНаряд                 = ШапкаДокумента.Ссылка;
			НоваяЗапись.Цех                        = ТекущаяСтрока.Цех;
			НоваяЗапись.Номенклатура               = ТекущаяСтрока.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			НоваяЗапись.GTIN                       = ТекущаяСтрока.GTIN;
			НоваяЗапись.СерийныйНомер              = ТекущаяСтрока.СерийныйНомер;
			НоваяЗапись.КодМаркировки              = ТекущаяСтрока.КодМаркировки;
			НоваяЗапись.КодМаркировкиBase64        = ТекущаяСтрока.КодМаркировкиBase64;
			НоваяЗапись.ГТД                        = ТекущаяСтрока.ГТД;
			НоваяЗапись.Количество                 = ТекущаяСтрока.Количество;  
			
			//++СнимченкоАА_бизтех++
			НоваяЗапись = НаборКодыМаркировкиВПроизводстве.Добавить(); 
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяЗапись.Период = ШапкаДокумента.Дата;     
			НоваяЗапись.Регистратор                = ШапкаДокумента.Ссылка;
			НоваяЗапись.Организация = ШапкаДокумента.Ссылка.Организация;  
			НоваяЗапись.Цех = ТекущаяСтрока.Цех; 
			НоваяЗапись.ЗаказНаряд = ШапкаДокумента.Ссылка; 
			НоваяЗапись.Номенклатура = ТекущаяСтрока.Номенклатура; 
			НоваяЗапись.КодМаркировки = ТекущаяСтрока.КодМаркировки; 
			НоваяЗапись.GTIN = ТекущаяСтрока.GTIN;
			НоваяЗапись.СерийныйНомер = ТекущаяСтрока.СерийныйНомер;
			НоваяЗапись.Количество = ТекущаяСтрока.Количество;  
			//--СнимченкоАА_бизтех--
			
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			
			СостояниеКодаМаркировки = 
				?(ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Платный,
					Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа,
					Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия);
			
			// Изменим состояние маркировки
			НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
			НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейСостоянияКодовМаркировки.Период = ШапкаДокумента.Дата;
			НаборЗаписейСостоянияКодовМаркировки.Организация = Организация;
			НаборЗаписейСостоянияКодовМаркировки.РезультатЗапросаПоКодамМаркировки = ТаблицаКодовМаркировки;
			НаборЗаписейСостоянияКодовМаркировки.ПроверятьВыводИзОборота = Истина;
			НаборЗаписейСостоянияКодовМаркировки.Состояние = СостояниеКодаМаркировки;
			НаборЗаписейСостоянияКодовМаркировки.РежимПроведения = Режим;
			Отказ = НЕ НаборЗаписейСостоянияКодовМаркировки.СостояниеКодовМаркировки() ИЛИ Отказ;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если НаСебестоимость Тогда
		Если СуммаНаСебестоимость<>0 ИЛИ СуммаУпрНаСебестоимость<>0 ИЛИ СуммаНДСНаСебестоимость<>0 Тогда
			НоваяЗапись=НаборЗаписейОстаткиАвтомобилей.Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период=ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
			НоваяЗапись.Партия=ПартияКомплектуемогоАвтомобиля;
			НоваяЗапись.СтатусПартии=СтатусПартииКомплектуемогоАвтомобиля;
			НоваяЗапись.ГТД=ГТДКомплектуемогоАвтомобиля;
			НоваяЗапись.СкладКомпании=АвтомобильСкладКомпании;
			НоваяЗапись.Автомобиль=ШапкаДокумента.Автомобиль;
			НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
			НоваяЗапись.Количество=0;
			НоваяЗапись.Сумма=СуммаНаСебестоимость;
			НоваяЗапись.СуммаУпр=СуммаУпрНаСебестоимость;
			НоваяЗапись.СуммаНДС=СуммаНДСНаСебестоимость;
			
			Если (СуммаУпрНаСебестоимость<>0) И
				 (СтатусПартииКомплектуемогоАвтомобиля=Перечисления.СтатусыПартий.ТоварКупленный) И
				 (НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии) Тогда
				//Доходы и расходы
				НаборЗаписейДоходыИРасходы							= Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект 			= ЭтотОбъект;
				Если ВедетсяБалансПоПодразделению Тогда
					НаборЗаписейДоходыИРасходы.Подразделение		= АвтомобильСкладКомпании.Подразделение;
				КонецЕсли; 
				НаборЗаписейДоходыИРасходы.ШапкаДокумента			= ШапкаДокумента;
				Если обЗначениеНеЗаполнено(ШапкаДокумента.ВидРемонта.СтатьяДоходаРаботы) Тогда
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= Справочники.СтатьиДоходовИРасходов.ОтклонениеСебестоимостиПриКомплектации;
				Иначе
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов	= ШапкаДокумента.ВидРемонта.СтатьяДоходаДетали;
				КонецЕсли; 
				НаборЗаписейДоходыИРасходы.ВУпрВалюте				= Истина;
				НаборЗаписейДоходыИРасходы.Доход					= СуммаУпрНаСебестоимость;
				Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если (НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии) И
		 (ВидРемонта<>КомплектацияАвтомобиля) Тогда
		Если НЕ НаСебестоимость И ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
			//Проведем работы по регистру продаж
			НаборЗаписейПродажи=Движения.Продажи;
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ЗаказНарядРаботы.НомерСтроки КАК НомерСтроки,
			|	ЗаказНарядРаботы.Работа,
			|	ЗаказНарядРаботы.Контрагент,
			|	ЗаказНарядРаботы.ИдентификаторРаботы,
			|	ЗаказНарядРаботы.Количество,
			|	ВЫБОР
			|		КОГДА ЗаказНарядРаботы.Нормочас.Цена = 1 ТОГДА
			|			0
			|		ИНАЧЕ
			|			ЗаказНарядРаботы.Количество*ЗаказНарядРаботы.Коэффициент
			|	КОНЕЦ КАК КоличествоНормочасов,
			|	ЗаказНарядРаботы.СтавкаНДС,
			|	ЗаказНарядРаботы.СуммаНДС,
			|	ЗаказНарядРаботы.СуммаСкидки+ЗаказНарядРаботы.СуммаСкидкиСтроки+ЗаказНарядРаботы.СуммаСкидкиБонусами КАК СуммаСкидки,
			|	ЗаказНарядРаботы.СуммаВсего
			|ИЗ
			|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
			|ГДЕ
			|	ЗаказНарядРаботы.Ссылка = &Ссылка
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
			ТаблицаРабот=Запрос.Выполнить().Выгрузить();
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ЗаказНарядИсполнители.ИдентификаторРаботы,
			|	ЗаказНарядИсполнители.Цех,
			|	СУММА(ЗаказНарядИсполнители.Процент) КАК Процент
			|ИЗ
			|	Документ.ЗаказНаряд.Исполнители КАК ЗаказНарядИсполнители
			|ГДЕ
			|	ЗаказНарядИсполнители.Ссылка = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ЗаказНарядИсполнители.ИдентификаторРаботы,
			|	ЗаказНарядИсполнители.Цех";
			Запрос.УстановитьПараметр("Ссылка",ШапкаДокумента.Ссылка);
			ТаблицаИсполнителей=Запрос.Выполнить().Выгрузить();
			Для каждого СтрокаРабот Из ТаблицаРабот Цикл
				СуммаУпр=Окр(обПересчет(СтрокаРабот.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,КурсУпр),2);
				СтрокаРабот.СуммаВсего  = Окр(обПересчет(СтрокаРабот.СуммаВсего,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				СтрокаРабот.СуммаНДС    = Окр(обПересчет(СтрокаРабот.СуммаНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				СтрокаРабот.СуммаСкидки = Окр(обПересчет(СтрокаРабот.СуммаСкидки,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаРегл,КурсРегл),2);
				ОстатокКоличество           = СтрокаРабот.Количество;
				ОстатокКоличествоНормочасов = СтрокаРабот.КоличествоНормочасов;
				ОстатокСумма                = СтрокаРабот.СуммаВсего;
				ОстатокСуммаНДС             = СтрокаРабот.СуммаНДС;
				ОстатокСуммаСкидки          = СтрокаРабот.СуммаСкидки;
				ОстатокСуммаУпр             = СуммаУпр;
				ОстатокСебестоимость        = 0;
				ОстатокСебестоимостьУпр     = 0;
				ОстатокСуммаНДСВходящий     = 0;
				
				СебестоимостьРаботы = ТаблицаСебестоимостиМатериалов.Найти(СтрокаРабот.ИдентификаторРаботы, "ИдентификаторРаботы");
				Если НЕ СебестоимостьРаботы = Неопределено Тогда
					ОстатокСебестоимость    = СебестоимостьРаботы.Сумма;
					ОстатокСебестоимостьУпр = СебестоимостьРаботы.СуммаУпр;
					ОстатокСуммаНДСВходящий = СебестоимостьРаботы.СуммаНДС;
				КонецЕсли;
				
				ЦехаРаботы = ТаблицаИсполнителей.НайтиСтроки(Новый Структура("ИдентификаторРаботы",СтрокаРабот.ИдентификаторРаботы));
				Если ЦехаРаботы.Количество()>0 Тогда
					Для Каждого ЦехРаботы Из ЦехаРаботы Цикл
						
						ДоляУчастия = ЦехРаботы.Процент/100;
						
						НоваяЗапись = НаборЗаписейПродажи.Добавить();
						НоваяЗапись.Период                = ШапкаДокумента.Дата;
						НоваяЗапись.Регистратор           = ШапкаДокумента.Ссылка;
						НоваяЗапись.ПодразделениеКомпании = ШапкаДокумента.ПодразделениеКомпании;
						НоваяЗапись.Номенклатура          = СтрокаРабот.Работа.Номенклатура;
						НоваяЗапись.ДокументПродажи       = ШапкаДокумента.ДокументПродажи;
						//НоваяЗапись.Поставщик			  = СтрокаРабот.Контрагент;
						НоваяЗапись.Покупатель            = ШапкаДокумента.Контрагент;
						НоваяЗапись.СтатусПартии		  = Перечисления.СтатусыПартий.ТоварКупленный;
						НоваяЗапись.ХозОперация           = ШапкаДокумента.ХозОперация;
						НоваяЗапись.ДоговорВзаиморасчетов = ШапкаДокумента.ДоговорВзаиморасчетов;
						НоваяЗапись.СкладКомпании         = ЦехРаботы.Цех;
						НоваяЗапись.Авторабота            = СтрокаРабот.Работа;
						НоваяЗапись.СтавкаНДС             = СтрокаРабот.СтавкаНДС;
						НоваяЗапись.Количество            = Окр(СтрокаРабот.Количество*ДоляУчастия, 3);
						НоваяЗапись.КоличествоНормочасов  = Окр(СтрокаРабот.КоличествоНормочасов*ДоляУчастия, 3);
						НоваяЗапись.Сумма                 = Окр(СтрокаРабот.СуммаВсего*ДоляУчастия, 2);
						НоваяЗапись.СуммаНДС              = Окр(СтрокаРабот.СуммаНДС*ДоляУчастия, 2);
						НоваяЗапись.СуммаСкидки           = Окр(СтрокаРабот.СуммаСкидки*ДоляУчастия, 2);
						НоваяЗапись.СуммаУпр              = Окр(СуммаУпр*ДоляУчастия, 2);
						
						Если НЕ СебестоимостьРаботы = Неопределено Тогда
							НоваяЗапись.Себестоимость    = Окр(СебестоимостьРаботы.Сумма    * ДоляУчастия, 2);
							НоваяЗапись.СебестоимостьУпр = Окр(СебестоимостьРаботы.СуммаУпр * ДоляУчастия, 2);
							НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьРаботы.СуммаНДС * ДоляУчастия, 2);
							
							ОстатокСебестоимость    = ОстатокСебестоимость    - СебестоимостьРаботы.Сумма;
							ОстатокСебестоимостьУпр = ОстатокСебестоимостьУпр - СебестоимостьРаботы.СуммаУпр;
							ОстатокСуммаНДСВходящий = ОстатокСуммаНДСВходящий - СебестоимостьРаботы.СуммаНДС;
						КонецЕсли;
						
						ОстатокКоличество           = ОстатокКоличество           - НоваяЗапись.Количество;
						ОстатокКоличествоНормочасов = ОстатокКоличествоНормочасов - НоваяЗапись.КоличествоНормочасов;
						ОстатокСумма                = ОстатокСумма                - НоваяЗапись.Сумма;
						ОстатокСуммаНДС             = ОстатокСуммаНДС             - НоваяЗапись.СуммаНДС;
						ОстатокСуммаСкидки          = ОстатокСуммаСкидки          - НоваяЗапись.СуммаСкидки;
						ОстатокСуммаУпр             = ОстатокСуммаУпр             - НоваяЗапись.СуммаУпр;
						
					КонецЦикла;
					Если ОстатокКоличество<>0 Тогда
						НоваяЗапись.Количество=НоваяЗапись.Количество+ОстатокКоличество;
					КонецЕсли;
					Если ОстатокКоличествоНормочасов<>0 Тогда
						НоваяЗапись.КоличествоНормочасов = НоваяЗапись.КоличествоНормочасов+ОстатокКоличествоНормочасов;
					КонецЕсли;
					Если ОстатокСумма<>0 Тогда
						НоваяЗапись.Сумма=НоваяЗапись.Сумма+ОстатокСумма;
					КонецЕсли; 
					Если ОстатокСуммаНДС<>0 Тогда
						НоваяЗапись.СуммаНДС=НоваяЗапись.СуммаНДС+ОстатокСуммаНДС;
					КонецЕсли; 
					Если ОстатокСуммаСкидки<>0 Тогда
						НоваяЗапись.СуммаСкидки=НоваяЗапись.СуммаСкидки+ОстатокСуммаСкидки;
					КонецЕсли; 
					Если ОстатокСуммаУпр<>0 Тогда
						НоваяЗапись.СуммаУпр=НоваяЗапись.СуммаУпр+ОстатокСуммаУпр;
					КонецЕсли;
					
					Если ОстатокСебестоимость<>0 Тогда
						НоваяЗапись.Себестоимость    = НоваяЗапись.Себестоимость    + ОстатокСебестоимость;
					КонецЕсли;
					
					Если ОстатокСебестоимостьУпр<>0 Тогда
						НоваяЗапись.СебестоимостьУпр = НоваяЗапись.СебестоимостьУпр + ОстатокСебестоимостьУпр;
					КонецЕсли;
					
					Если ОстатокСуммаНДСВходящий<>0 Тогда
						НоваяЗапись.СуммаНДСВходящий = НоваяЗапись.СуммаНДСВходящий + ОстатокСуммаНДСВходящий;
					КонецЕсли;
					
				Иначе
					НоваяЗапись=НаборЗаписейПродажи.Добавить();
					НоваяЗапись.Период				 = ШапкаДокумента.Дата;
					НоваяЗапись.Регистратор			 = ШапкаДокумента.Ссылка;
					НоваяЗапись.ПодразделениеКомпании= ШапкаДокумента.ПодразделениеКомпании;
					НоваяЗапись.Номенклатура		 = СтрокаРабот.Работа.Номенклатура;
					НоваяЗапись.ДокументПродажи		 = ШапкаДокумента.ДокументПродажи;
					НоваяЗапись.Поставщик			 = СтрокаРабот.Контрагент;
					НоваяЗапись.Покупатель			 = ШапкаДокумента.Контрагент;
					НоваяЗапись.СтатусПартии		 = Перечисления.СтатусыПартий.ТоварКупленный;
					НоваяЗапись.ХозОперация			 = ШапкаДокумента.ХозОперация;
					НоваяЗапись.ДоговорВзаиморасчетов= ШапкаДокумента.ДоговорВзаиморасчетов;
					НоваяЗапись.СкладКомпании		 = Цех;
					НоваяЗапись.Авторабота           = СтрокаРабот.Работа;
					НоваяЗапись.СтавкаНДС            = СтрокаРабот.СтавкаНДС;
					НоваяЗапись.Количество           = Окр(СтрокаРабот.Количество,3);
					НоваяЗапись.КоличествоНормочасов = Окр(СтрокаРабот.КоличествоНормочасов,3);
					НоваяЗапись.Сумма                = Окр(СтрокаРабот.СуммаВсего,2);
					НоваяЗапись.СуммаНДС             = Окр(СтрокаРабот.СуммаНДС,2);
					НоваяЗапись.СуммаСкидки          = Окр(СтрокаРабот.СуммаСкидки,2);
					НоваяЗапись.СуммаУпр             = Окр(СуммаУпр,2);
					Если НЕ СебестоимостьРаботы = Неопределено Тогда
						НоваяЗапись.Себестоимость    = Окр(СебестоимостьРаботы.Сумма,    2);
						НоваяЗапись.СебестоимостьУпр = Окр(СебестоимостьРаботы.СуммаУпр, 2);
						НоваяЗапись.СуммаНДСВходящий = Окр(СебестоимостьРаботы.СуммаНДС, 2);
					КонецЕсли;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
		// расход собственного товара на себестоимость
		Если обЗначениеНеЗаполнено(ШапкаДокумента.ВидРемонта.СтатьяРасходаДетали) Тогда
			Если ШапкаДокумента.ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Бесплатный Тогда
				СтатьяДиР=Справочники.СтатьиДоходовИРасходов.БесплатныйРемонтПоЗаказНарядам;
			Иначе
				СтатьяДиР=Справочники.СтатьиДоходовИРасходов.Себестоимость;
			КонецЕсли; 
		Иначе
			СтатьяДиР=ШапкаДокумента.ВидРемонта.СтатьяРасходаДетали;
		КонецЕсли;
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	"+?(ВедетсяБалансПоПодразделению,"ТоварыВПроизводстве.Цех.Подразделение КАК Подразделение,","")+"
		             |	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК СуммаУпр
		             |ИЗ
		             |	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		             |ГДЕ
		             |	ТоварыВПроизводстве.Регистратор = &Регистратор
		             |	И ТоварыВПроизводстве.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
		             |"+?(ВедетсяБалансПоПодразделению,"СГРУППИРОВАТЬ ПО ТоварыВПроизводстве.Цех.Подразделение","")+"
					 |";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если ВедетсяБалансПоПодразделению Тогда
			Пока Выборка.Следующий() Цикл
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					НаборЗаписейДоходыИРасходы.Подразделение=Выборка.Подразделение;
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=СтатьяДиР;
					НаборЗаписейДоходыИРасходы.Расход=Выборка.СуммаУпр;
					Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			Если Выборка.Следующий() Тогда
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=СтатьяДиР;
					НаборЗаписейДоходыИРасходы.Расход=Выборка.СуммаУпр;
					Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		//по ДиР комиссионный товар
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	"+?(ВедетсяБалансПоПодразделению,"РеализованныеТовары.ДоговорВзаиморасчетов.Подразделение КАК Подразделение,","")+"
		             |	СУММА(РеализованныеТовары.СуммаУпр) КАК СуммаУпр
		             |ИЗ
		             |	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
		             |ГДЕ
		             |	РеализованныеТовары.Регистратор = &Регистратор
		             |"+?(ВедетсяБалансПоПодразделению,"СГРУППИРОВАТЬ ПО РеализованныеТовары.ДоговорВзаиморасчетов.Подразделение","")+"
					 |";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если ВедетсяБалансПоПодразделению Тогда
			Пока Выборка.Следующий() Цикл
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					НаборЗаписейДоходыИРасходы.Подразделение=Выборка.Подразделение;
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=СтатьяДиР;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
					НаборЗаписейДоходыИРасходы.Расход=Выборка.СуммаУпр;
					Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
				КонецЕсли; 
			КонецЦикла; 
		Иначе
			Если Выборка.Следующий() Тогда
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=СтатьяДиР;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте=Истина;
					НаборЗаписейДоходыИРасходы.Расход=Выборка.СуммаУпр;
					Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если (НЕ НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии) И 
		 (ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный) И
		 (Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
		// доход на сумму продажи
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=?(обЗначениеНеЗаполнено(ШапкаДокумента.ВидРемонта.СтатьяДоходаДетали),Справочники.СтатьиДоходовИРасходов.ВыручкаПоЗаказНарядам,ШапкаДокумента.ВидРемонта.СтатьяДоходаДетали);
		НаборЗаписейДоходыИРасходы.Доход=ШапкаДокумента.СуммаНоменклатурыДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
		// проведем услуги по доходам и расходам
		НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
		НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
		Если ВедетсяБалансПоПодразделению Тогда
			НаборЗаписейДоходыИРасходы.Подразделение=ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
		КонецЕсли;
		НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейДоходыИРасходы.ВУпрВалюте=Ложь;
		НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов=?(обЗначениеНеЗаполнено(ШапкаДокумента.ВидРемонта.СтатьяДоходаРаботы),Справочники.СтатьиДоходовИРасходов.РаботыПоЗаказНарядам,ШапкаДокумента.ВидРемонта.СтатьяДоходаРаботы);
		НаборЗаписейДоходыИРасходы.Доход=ШапкаДокумента.СуммаРаботДокумента;
		Отказ=НЕ НаборЗаписейДоходыИРасходы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если (НЕ Отказ) И НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		// Доходы и расходы на себестоимость не оприходованных партий
		// Товары в производстве
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Регистратор = &Регистратор
		|	И ТоварыВПроизводстве.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.СуммаУпр<>0 Тогда
				НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
				НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
				НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
				НаборЗаписейДоходыИРасходы.ВУпрВалюте = Истина;
				НаборЗаписейДоходыИРасходы.Расход = Выборка.СуммаУпр;
				НаборЗаписейДоходыИРасходы.Приход();
			КонецЕсли; 
		КонецЕсли;
		Если ШапкаДокумента.ВидРемонта=КомплектацияАвтомобиля Тогда
			// Остатки автомобилей
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	СУММА(ОстаткиАвтомобилей.СуммаУпр) КАК СуммаУпр
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
			|ГДЕ
			|	ОстаткиАвтомобилей.Регистратор = &Регистратор
			|	И ОстаткиАвтомобилей.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)";
			Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					Если ВедетсяБалансПоПодразделению Тогда
						НаборЗаписейДоходыИРасходы.Подразделение = АвтомобильСкладКомпании.Подразделение;
					КонецЕсли; 
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте = Истина;
					НаборЗаписейДоходыИРасходы.Доход = Выборка.СуммаУпр;
					НаборЗаписейДоходыИРасходы.Приход();
				КонецЕсли; 
			КонецЕсли; 
			// Комплектация автомобилей
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	СУММА(КомплектацияАвтомобилей.СуммаУпр) КАК СуммаУпр
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
			|ГДЕ
			|	КомплектацияАвтомобилей.Регистратор = &Регистратор";
			Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.СуммаУпр<>0 Тогда
					НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
					НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
					Если ВедетсяБалансПоПодразделению Тогда
						НаборЗаписейДоходыИРасходы.Подразделение = АвтомобильСкладКомпании.Подразделение;
					КонецЕсли; 
					НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
					НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
					НаборЗаписейДоходыИРасходы.ВУпрВалюте = Истина;
					НаборЗаписейДоходыИРасходы.Доход = Выборка.СуммаУпр;
					НаборЗаписейДоходыИРасходы.Приход();
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	// двигаем границу последовательности производства
	ДвигаемГраницу = (НЕ ДополнительныеСвойства.ОперативноеПроведение И Движения.ТоварыВПроизводстве.Количество()>0);
	Если ДополнительныеСвойства.ПроверятьПоследовательность И (ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказНарядБыл)) Тогда
//	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказНарядБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаряд ИЗ РегистрНакопления.ТоварыВПроизводстве ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
			Результат = Запрос.Выполнить(); ЗаказНарядБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				ЗаказНарядБыл = Результат.Выгрузить().ВыгрузитьКолонку("ЗаказНаряд");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("ЗаказНарядБыл",ЗаказНарядБыл);
			ДополнительныеСвойства.МоментВремениБыл = ШапкаДокумента.МоментВремени;
		КонецЕсли;
		
		НаборЗаписейГраницыПроизводство = РегистрыСведений.ГраницыПроизводство.СоздатьНаборЗаписей();
		Если НЕ ДополнительныеСвойства.ОперативноеПроведение Тогда
			НаборЗаписейГраницыПроизводство.ЗаказНаряд   	 = ШапкаДокумента.Ссылка;
			НаборЗаписейГраницыПроизводство.МоментВремени	 = ШапкаДокумента.Дата;
			НаборЗаписейГраницыПроизводство.ЗаказНарядБыл	 = ДополнительныеСвойства.ЗаказНарядБыл;
			НаборЗаписейГраницыПроизводство.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПроизводство.ЗаказНаряд		 = ДополнительныеСвойства.ЗаказНарядБыл;
			НаборЗаписейГраницыПроизводство.МоментВремени	 = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПроизводство.ЗаказНарядБыл	 = Неопределено;
			НаборЗаписейГраницыПроизводство.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПроизводство.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПроизводство.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции

// перерасчет цен работ
Процедура ПерерасчетЦенАвторабот(ЗадаватьВопрос=Ложь,ДопПараметры) Экспорт
	
	Если ДопПараметры.Свойство("НеВыполнятьПересчет") И ДопПараметры.НеВыполнятьПересчет Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнятьПересчетЦенАвторабот = Истина;
	ПерерасчетЦенРаботВыполнен=Ложь;
	Если ДопПараметры=Неопределено Тогда
		ДопПараметры=Новый Структура;
	Иначе
		Если ДопПараметры.Свойство("ВыполнятьПересчетЦенАвторабот",ВыполнятьПересчетЦенАвторабот) Тогда
			Если НЕ ВыполнятьПересчетЦенАвторабот Тогда
				Возврат;
			КонецЕсли; 
		КонецЕсли;
		Если ДопПараметры.Свойство("ПерерасчетЦенРаботВыполнен",ПерерасчетЦенРаботВыполнен) Тогда
			Если ПерерасчетЦенРаботВыполнен Тогда
				Возврат;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	ДопПараметры.Вставить("ПерерасчетЦенРаботВыполнен",Истина);
	
	Если Работы.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ЗадаватьВопрос Тогда
		Если Вопрос("Выполнить перерасчет цен авторабот?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да,"Изменение цен")<>КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	#КонецЕсли

	Для Каждого СтрокаРабот Из Работы Цикл
		//Если текущая работа не заполнена - больше ничего не делаем
		Если обЗначениеНеЗаполнено(СтрокаРабот.Работа) Тогда Продолжить; КонецЕсли;
		ОбработкаРеквизита("РасчетЦеныРаботы",СтрокаРабот,,ДопПараметры);
		ОбработкаРеквизита("Работы.Цена",СтрокаРабот,,ДопПараметры);
	КонецЦикла;
КонецПроцедуры 

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура();
	КонецЕсли;
	
	Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
		// обработаем бонусы при изменении ТЧ
		Если НЕ(ДопПараметры.Свойство("НеВыполнятьРасчетБонусов") И ДопПараметры.НеВыполнятьРасчетБонусов) Тогда
			Если (Найти(Имя, "Товары.") > 0 ИЛИ Найти(Имя, "Работы.") > 0) И (Имя <> "Товары.СуммаНДС" И Имя <> "Работы.СуммаНДС") Тогда
				Для Каждого Строка Из Товары Цикл
					Если НЕ (Имя = "Товары.СуммаВсего" И ТекСтрока = Строка) Тогда
						Строка.СуммаВсего = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;
					КонецЕсли;
					Строка.СуммаСкидкиБонусами = 0;
				КонецЦикла;
				
				Для Каждого Строка Из Работы Цикл
					Если НЕ (Имя = "Работы.СуммаВсего" И ТекСтрока = Строка) Тогда
						Строка.СуммаВсего = Строка.СуммаВсего + Строка.СуммаСкидкиБонусами;
					КонецЕсли;
					Строка.СуммаСкидкиБонусами = 0;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Дата" Тогда		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Рез=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
		ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		Возврат Рез;
	
	ИначеЕсли Имя="ВалютаДокумента" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Рез=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		Возврат Рез;
	ИначеЕсли Имя="Организация" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// Организация может является плательщиком НДС, а может и нет.. надо обработать таблицу работ
		ТаблицаРабот=ЭтотОбъект.Работы;
		ОсвобожденОтНДС=ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС;
		Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
			Если ОсвобожденОтНДС Тогда
				СтрокаРабот.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				СтрокаРабот.СтавкаНДС=СтрокаРабот.Работа.Номенклатура.СтавкаНДС;
			КонецЕсли; 
			Рез=ЭтотОбъект.ОбработкаРеквизита("Работы.СтавкаНДС",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
		КонецЦикла;	
		ВидимостьПатент = ?(Организация.ВидНалога = Перечисления.ВидыНалогов.ПСН, Истина, Ложь);
		ЭтаФорма.ЭлементыФормы.Патент.Видимость = ВидимостьПатент;
		ЭтаФорма.ЭлементыФормы.ИспользоватьПатент.Видимость = ВидимостьПатент;
		ЭтаФорма.ЭлементыФормы.ИспользоватьПатент.Доступность = ВидимостьПатент;
		ЭтотОбъект.Патент = Неопределено;
		Если ВидимостьПатент Тогда
			ЭтаФорма.ИспользоватьПатент = Ложь;
			ЭтаФорма.ЭлементыФормы.Патент.Доступность = Ложь;
		КонецЕсли;
		Возврат Рез;
	ИначеЕсли Имя="ПодразделениеКомпании" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		// Подразделение может является плательщиком НДС, а может и нет.. надо обработать таблицу работ
		ТаблицаРабот=ЭтотОбъект.Работы;
		ОсвобожденОтНДС=ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС;
		Для Каждого СтрокаРабот Из ТаблицаРабот Цикл
			Если ОсвобожденОтНДС Тогда
				СтрокаРабот.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
			Иначе
				СтрокаРабот.СтавкаНДС=СтрокаРабот.Работа.Номенклатура.СтавкаНДС;
			КонецЕсли; 
			Рез=ЭтотОбъект.ОбработкаРеквизита("Работы.СтавкаНДС",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
		КонецЦикла;
		// Изменение подразделения приводит к необходимости пересчета скидок документа (как "шапочных", так и товарных).
		Рез=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
		Возврат Рез;
	ИначеЕсли Имя="Заказчик" Тогда
		Рез=ОбработкаРеквизита("УстановитьГарантийногоПлательщика",ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="Автомобиль" Тогда
		Рез=Истина;
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Хозяин = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин,Дата);
			Если (НЕ обЗначениеНеЗаполнено(Хозяин)) И (Заказчик<>Хозяин) Тогда
				Заказчик=Хозяин;
				Рез=ОбработкаРеквизита("Заказчик",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
			Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,?(обЗначениеНеЗаполнено(ДатаНачала),ДатаСоздания,ДатаНачала));
		КонецЕсли;
		ДатаМашинозаездаРасчет(ЭтаФорма);
		#Если Клиент Тогда
		// KRAA ++ будем спрашивать только при наличии формы
		ПерерасчетЦенАвторабот(ЭтаФорма <> Неопределено,ДопПараметры);
		// KRAA --
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя="Цех" Тогда
		Рез=Истина;
		Если (НЕ обЗначениеНеЗаполнено(Цех)) И (обЗначениеНеЗаполнено(Мастер)) Тогда
			Мастер=Цех.Мастер;
			Рез=ОбработкаРеквизита("Мастер",СтрокаРабот,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;
		#Если Клиент Тогда
		// KRAA ++ будем спрашивать только при наличии формы
		ПерерасчетЦенАвторабот(ЭтаФорма <> Неопределено,ДопПараметры);
		// KRAA --
		#КонецЕсли
		Рез=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
		ОбработкаРасчетСкидок.СкладКомпании = Цех.СкладКомпании;
		Рез=ОбработкаРеквизита("РассчитатьСкидки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		Возврат Рез;
		
	ИначеЕсли Имя="ВидРемонта" Тогда
		Если обЗначениеНеЗаполнено(ВидРемонта) Тогда
			Возврат Истина;
		КонецЕсли;
		Рез=Истина;
		Если зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") Тогда
			КомплектацияАвтомобиля=Справочники.ВидыРемонта.КомплектацияАвтомобиля;
			Если (КомплектацияАвтомобиля.Пустая()) ИЛИ (НЕ КомплектацияАвтомобиля.Предопределенный) Тогда
				КомплектацияАвтомобиля=Неопределено;
			КонецЕсли; 
		Иначе
			КомплектацияАвтомобиля=Неопределено;
		КонецЕсли; 
		
		ВыработкаСотрудниковПоВыполнениюЗаказНаряда=ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда;
		
		Если ВидРемонта=КомплектацияАвтомобиля ИЛИ 
				ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Бесплатный Тогда
			Если ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент=Справочники.Контрагенты.ПустаяСсылка();
				Рез=ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДоговорВзаиморасчетов) Тогда
				ДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
				Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
		КонецЕсли;
		
		Если ДопПараметры=Неопределено Тогда
			ДопПараметры=Новый Структура;
		КонецЕсли;
		Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
			ДопПараметры.Вставить("ПодставлятьКонтрагентаИзЗаказчика",Ложь);
		КонецЕсли;
		Рез=ОбработкаРеквизита("УстановитьГарантийногоПлательщика",ТекСтрока,ЭтаФорма,ДопПараметры);
		
		#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда
				ПредложитьЗаполнитьРаботамиПоВидуРемонта(ЭтаФорма);
			КонецЕсли;
			
			Если ДопПараметры=Неопределено Тогда
				ДопПараметры=Новый Структура;
			КонецЕсли;
			// KRAA ++ будем спрашивать только при наличии формы
			ПерерасчетЦенАвторабот(ЭтаФорма <> Неопределено,ДопПараметры);
			// KRAA --
			
		#КонецЕсли
		
		Если ВидРемонта=КомплектацияАвтомобиля ИЛИ
			ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Бесплатный Тогда
			
			ОбработкаРасчетСкидок.НеРассчитыватьАвтоматическиеСкидки          = Истина;
			ОбработкаРасчетСкидокАвторабот.НеРассчитыватьАвтоматическиеСкидки = Истина;
			
			Если АвтоЗакрытиеСделок Тогда
				АвтоЗакрытиеСделок=Ложь;
				ОбработкаРеквизита("АвтоЗакрытиеСделок",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
			Если ЗначениеЗаполнено(Карточка) Тогда
				Карточка=Справочники.Карточки.ПустаяСсылка();
				ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Истина);
				ОбработкаРеквизита("Карточка",ТекСтрока,ЭтаФорма,ДопПараметры);
				ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");	
			КонецЕсли; 
			Если ЗначениеЗаполнено(МаркетинговаяПрограмма) Тогда
				МаркетинговаяПрограмма=Справочники.МаркетинговыеПрограммы.ПустаяСсылка();
				ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Истина);
				ОбработкаРеквизита("МаркетинговаяПрограмма",ТекСтрока,ЭтаФорма,ДопПараметры);
				ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СкидкаНаценка) Тогда
				ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Истина);
				СкидкаНаценка=Справочники.ТипыСкидок.ПустаяСсылка();
				Рез=ОбработкаРеквизита("СкидкаНаценка",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
			КонецЕсли; 
			Если ЗначениеЗаполнено(СкидкаНаценкаРаботы) Тогда
				ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Истина);
				СкидкаНаценкаРаботы=Справочники.ТипыСкидок.ПустаяСсылка();
				Рез=ОбработкаРеквизита("СкидкаНаценкаРаботы",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");	
			КонецЕсли;
			ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Истина);
			Для каждого СтрокаТЧ Из Товары Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.СкидкаНаТовар) Тогда
					СтрокаТЧ.СкидкаНаТовар=Справочники.ТипыСкидок.ПустаяСсылка();
					Рез=ОбработкаРеквизита("Товары.СкидкаНаТовар",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			КонецЦикла; 
			Для каждого СтрокаТЧ Из Работы Цикл
				Если ЗначениеЗаполнено(СтрокаТЧ.СкидкаНаТовар) Тогда
					СтрокаТЧ.СкидкаНаТовар=Справочники.ТипыСкидок.ПустаяСсылка();
					Рез=ОбработкаРеквизита("Работы.СкидкаНаТовар",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли; 
			КонецЦикла; 
			ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
		Иначе

			НеВыполнятьПересчет = Ложь;

			Если ДопПараметры<>Неопределено Тогда

				Если ДопПараметры.Свойство("НеВыполнятьПересчет") Тогда
					ДопПараметры.Свойство("НеВыполнятьПересчет", НеВыполнятьПересчет);
				КонецЕсли;

			КонецЕсли;
				
			Если НеВыполнятьПересчет = Ложь И НЕ БлокироватьПерерасчетСкидок Тогда
			
				ОбработкаРасчетСкидок.НеРассчитыватьАвтоматическиеСкидки          = Ложь;
				ОбработкаРасчетСкидокАвторабот.НеРассчитыватьАвтоматическиеСкидки = Ложь;
				
				Если ДопПараметры<>Неопределено Тогда
					Если ДопПараметры.Свойство("НеРассчитыватьСкидки") Тогда
						ДопПараметры.Удалить("НеРассчитыватьСкидки");
					КонецЕсли; 
				КонецЕсли; 
				Если ДополнительныеСвойства.Свойство("НеЗаменятьПустуюСкидку") Тогда
					ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
				КонецЕсли;
				Рез=ОбработкаРеквизита("СкидкаНаценка",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
				Рез=ОбработкаРеквизита("СкидкаНаценкаРаботы",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;

			КонецЕсли;
				
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(ВидРемонта) Тогда
			Если ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Бесплатный И
				 ВидРемонта<>КомплектацияАвтомобиля Тогда
				 НаСебестоимость=ВидРемонта.НаСебестоимость;
			Иначе
				 НаСебестоимость=Ложь;
			КонецЕсли; 
		Иначе
			НаСебестоимость=Ложь;
		КонецЕсли; 
		
		// Посмотрим, что со ставками НДС по Виду Ремонта
		// товары
		Если ТоварыБезНДС <> ВидРемонта.ОсвобожденОтНДС Тогда
			ТоварыБезНДС = ВидРемонта.ОсвобожденОтНДС;
			Для Каждого ТекСтрока Из Товары Цикл
				Если ТоварыБезНДС Тогда
					ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				Иначе
					ТекСтрока.СтавкаНДС = ТекСтрока.Номенклатура.СтавкаНДС;
				КонецЕсли;
				ОбработкаРеквизита("Товары.СтавкаНДС",ТекСтрока);
			КонецЦикла;
		КонецЕсли;
		
		// работы
		Если РаботыБезНДС <> ВидРемонта.ОсвобожденОтНДСРаботы Тогда
			РаботыБезНДС = ВидРемонта.ОсвобожденОтНДСРаботы;
			Для Каждого ТекСтрока Из Работы Цикл
				Если РаботыБезНДС Тогда
					ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				Иначе
					ТекСтрока.СтавкаНДС = ТекСтрока.Работа.Номенклатура.СтавкаНДС;
				КонецЕсли;
				ОбработкаРеквизита("Работы.СтавкаНДС",ТекСтрока);
			КонецЦикла;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=Истина;
		// проверим вид договора
		Если (ДоговорВзаиморасчетов.ВидДоговора=Перечисления.ВидыДоговоров.Покупка) ИЛИ
			 (ДоговорВзаиморасчетов.ВидДоговора=Перечисления.ВидыДоговоров.СКомитентом) Тогда
			 #Если Клиент Тогда
			 Предупреждение("Неправильный вид договора !");
			 #КонецЕсли
			 ДоговорВзаиморасчетов=Неопределено;
			 Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			 Возврат Ложь;
		КонецЕсли;
		#Если Клиент Тогда
		// KRAA ++ будем спрашивать только при наличии формы
		ПерерасчетЦенАвторабот(ЭтаФорма <> Неопределено,ДопПараметры);
		// KRAA --
		#КонецЕсли
		ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",Ложь);
		// Если у документа есть реквизит СкидкаНаценка, заполним его из Договора 
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		ДоговорСкидкаРаботы=ЭтотОбъект.ДоговорВзаиморасчетов.ТипСкидкиНаценкиРабот;
		Если ЭтотОбъект.СкидкаНаценкаРаботы<>ДоговорСкидкаРаботы И НЕ обЗначениеНеЗаполнено(ДоговорСкидкаРаботы) Тогда
			СкидкаНаценкаРаботы=ЭтотОбъект.ДоговорВзаиморасчетов.ТипСкидкиНаценкиРабот;
			Рез=ОбработкаРеквизита("СкидкаНаценкаРаботы",,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;		
		ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
		Если обЗначениеНеЗаполнено(Заказчик) Тогда
			Заказчик=Контрагент;
			Рез=дкОбработкаРеквизита(ЭтотОбъект,"Заказчик",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			ВывестиПодвалСкидокРабот(ЭтаФорма);
		КонецЕсли; 
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя="Карточка" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		#Если Клиент Тогда
		Если НЕ обЗначениеНеЗаполнено(Карточка) Тогда
			//карточка выбрана
			Если Карточка.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта Тогда
				//Выбрана дисконтная карточка
				Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") И
					(НЕ обЗначениеНеЗаполнено(Карточка.Объект)) Тогда
					//в карточке заполнен контрагент
					Если ЭтотОбъект.Контрагент <> ЭтотОбъект.Заказчик Тогда
						Ответ = Вопрос("Плательщик не совпадает с заказчиком. Изменить заказчика?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
						Если Ответ = КодВозвратаДиалога.Да Тогда
							Заказчик = Контрагент;
							ОбработкаРеквизита("Заказчик",,ЭтаФорма);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		Рез=ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
		Рез=Рез ИЛИ ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		Возврат Рез;
		
	ИначеЕсли Имя="МаркетинговаяПрограмма" Тогда
		Рез=Истина;
		Если НЕ обЗначениеНеЗаполнено(МаркетинговаяПрограмма.СкидкаНаценка) Тогда
			СкидкаНаценка=МаркетинговаяПрограмма.СкидкаНаценка;
			Рез=ОбработкаРеквизита("СкидкаНаценка",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли; 
		Если НЕ обЗначениеНеЗаполнено(МаркетинговаяПрограмма.СкидкаНаценкаРаботы) Тогда
			СкидкаНаценкаРаботы=МаркетинговаяПрограмма.СкидкаНаценкаРаботы;
			Рез=ОбработкаРеквизита("СкидкаНаценкаРаботы",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя = "КоличествоКСписанию" Тогда
		
		Если ДопПараметры.Свойство("НеВыполнятьРасчетБонусов") И ДопПараметры.НеВыполнятьРасчетБонусов Тогда
			Возврат Ложь;
		КонецЕсли;
		
		// сравним бонусные баллы с суммой всего
		Если НЕ БонусныеПрограммыСервер.БонуснаяПрограммаАктивна(Карточка.БонуснаяПрограмма, Дата) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ПроверятьБлокировкуКарты")
			И БонусныеПрограммыСервер.ЗаблокированаКарточка(Карточка) Тогда
			КоличествоКСписанию = 0;
		КонецЕсли;
		
		КоличествоКСписанию = Мин(КоличествоКСписанию,
								  БонусныеПрограммыСервер.КоличествоБалловВСуммеДокумента(ЭтотОбъект, Карточка.БонуснаяПрограмма),
								  БонусныеПрограммыСервер.МаксимальноеКоличетсвоБоллов(ЭтотОбъект, Карточка.БонуснаяПрограмма));
		
		// расписываем сумму по строкам документа документам
		СводнаяТаблица = СформироватьСводнуюТаблицу();
		
		БонусныеПрограммыСервер.РаспределитьСуммуПоТаблице(СводнаяТаблица, БонусныеПрограммыСервер.БаллыВВалюту(КоличествоКСписанию, Карточка.БонуснаяПрограмма, ВалютаДокумента, Дата), "Сумма");
		
		Для Каждого Строка Из СводнаяТаблица Цикл
			Строка.Строка.СуммаВсего          = Строка.Сумма;
			Строка.Строка.СуммаНДС            = Строка.Строка.СуммаВсего*Строка.Строка.СтавкаНДС.Ставка/(100+Строка.Строка.СтавкаНДС.Ставка);
			Строка.Строка.СуммаСкидкиБонусами = Строка.РаспределенноеЗначение;
		КонецЦикла;
		
		БонусныеПрограммыСервер.РасчитатьБонусныеБаллыКНачислению(ЭтотОбъект, Карточка.БонуснаяПрограмма);
		
		СуммаСкидкиНаценки = Товары.Итог("СуммаСкидки");
		СуммаСкидкиНаценки = СуммаСкидкиНаценки + Товары.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценки = СуммаСкидкиНаценки + Товары.Итог("СуммаСкидкиБонусами");
		СуммаСкидкиНаценкиРабот = Работы.Итог("СуммаСкидки");
		СуммаСкидкиНаценкиРабот = СуммаСкидкиНаценкиРабот + Работы.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценкиРабот = СуммаСкидкиНаценкиРабот + Работы.Итог("СуммаСкидкиБонусами");

		Возврат Истина;
		
	ИначеЕсли Имя="СкидкаНаценка" Тогда
		Если НЕ ДополнительныеСвойства.Свойство("НеЗаменятьПустуюСкидку") Тогда
			ИзменилиСкидку=ОбработкаРасчетСкидок.ТекущаяСкидкаНаценка<>СкидкаНаценка;
			ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",ИзменилиСкидку И обЗначениеНеЗаполнено(СкидкаНаценка));
		КонецЕсли; 
		Результат = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
		Возврат Результат
		
	ИначеЕсли Имя="СкидкаНаценкаРаботы" Тогда
		// Смена скидки\наценки влияет на видимость некоторых колонок в табличной части.
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма,СкидкаНаценкаРаботы,"Работы");
		КонецЕсли;
		#КонецЕсли
	    Если НЕ ДополнительныеСвойства.Свойство("НеЗаменятьПустуюСкидку") Тогда
			ИзменилиСкидку=ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка<>СкидкаНаценкаРаботы;
			ДополнительныеСвойства.Вставить("НеЗаменятьПустуюСкидку",ИзменилиСкидку И обЗначениеНеЗаполнено(СкидкаНаценкаРаботы));
		КонецЕсли;
		Результат = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидкиРабот", ТекСтрока, ЭтаФорма, ДопПараметры);
		ОбработкаРеквизита("КоличествоКСписанию", ТекСтрока, ЭтаФорма, ДопПараметры);
		ДополнительныеСвойства.Удалить("НеЗаменятьПустуюСкидку");
		Возврат Результат;
		
	ИначеЕсли Имя="УстановитьГарантийногоПлательщика" Тогда
		Рез=Истина;
		НовыйКонтрагент=Неопределено;
		НовыйДоговорВзаиморасчетов=Неопределено;
		Если обЗначениеНеЗаполнено(ВидРемонта) ИЛИ ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
			ВидРемонтаГарантия=ВидРемонта.Гарантия.Найти(Автомобиль.Модель,"Модель");
			Если ВидРемонтаГарантия<>Неопределено Тогда
				НовыйКонтрагент=ВидРемонтаГарантия.Контрагент;
				НовыйДоговорВзаиморасчетов=ВидРемонтаГарантия.ДоговорВзаиморасчетов;
			Иначе
				ПодставлятьКонтрагентаИзЗаказчика=Истина;
				Если ДопПараметры<>Неопределено Тогда
					Если НЕ ДопПараметры.Свойство("ПодставлятьКонтрагентаИзЗаказчика",ПодставлятьКонтрагентаИзЗаказчика) Тогда
						ПодставлятьКонтрагентаИзЗаказчика=Истина;
					КонецЕсли;
				КонецЕсли; 
				Если ПодставлятьКонтрагентаИзЗаказчика Тогда
					Если Контрагент<>Заказчик Тогда
						
						НовыйКонтрагент = РаботаСКонтактнымиЛицами.ПолучитьВедущегоКонтрагента(Заказчик);
						
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Если (НЕ обЗначениеНеЗаполнено(НовыйКонтрагент)) И (Контрагент<>НовыйКонтрагент) ИЛИ
			 (НЕ обЗначениеНеЗаполнено(НовыйДоговорВзаиморасчетов)) И (ДоговорВзаиморасчетов<>НовыйДоговорВзаиморасчетов) Тогда
			Если (НЕ обЗначениеНеЗаполнено(НовыйКонтрагент)) И (Контрагент<>НовыйКонтрагент) Тогда
				Контрагент=НовыйКонтрагент;
				Рез=ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
			Если (НЕ обЗначениеНеЗаполнено(НовыйДоговорВзаиморасчетов)) И (ДоговорВзаиморасчетов<>НовыйДоговорВзаиморасчетов) Тогда
				ДоговорВзаиморасчетов=НовыйДоговорВзаиморасчетов;
				Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли;
			#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда
				Сообщить("Установлен новый плательщик по заказ-наряду: """+СокрЛП(Контрагент)+""" по договору """+СокрЛП(ДоговорВзаиморасчетов)+"""");
			КонецЕсли; 
			#КонецЕсли
		КонецЕсли; 
		Возврат Рез;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
	ИначеЕсли Имя="Товары.Номенклатура" Тогда
		
		Рез = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда Возврат Рез; КонецЕсли; //Это если это был набор и мы удалили эту строку
		//А вот цену мы получим актуальную
		Попытка
			ВариантПоставки = Новый Структура;
			ВариантПоставки.Вставить("Поставщик",            ТекСтрока.Поставщик);
			ВариантПоставки.Вставить("Закупка",              Ложь);
			ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
			ВариантПоставки.Вставить("СрокПоставки",         ТекСтрока.СрокПоставкиВСтроке);
			ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
			#Если Клиент Тогда
				ВариантПоставки.Вставить("ИнтерактивныйВвод", Истина);
			#Иначе
				ВариантПоставки.Вставить("ИнтерактивныйВвод", Ложь);
			#КонецЕсли
			
			ТекСтрока.Цена=обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, ТекущаяДата(),, ВалютаДокумента, КурсДокумента, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеКомпании,, ВариантПоставки);
			Рез=ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
			
			ТекСтрока.Поставщик            = ВариантПоставки.Поставщик;
			ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
			ТекСтрока.СрокПоставкиВСтроке  = ВариантПоставки.СрокПоставки;
		Исключение
		КонецПопытки;
		
		Попытка
			Если обЗначениеНеЗаполнено(ТекСтрока.СкладКомпании) Тогда
				// БИЗТЕХ КОВАЛЬ 08.07.2025 ++ 
				// Склад подставлять по складу по подразделению
				// ТекСтрока.СкладКомпании = обПраво("ОсновнойСкладКомпании",Права);
				ТекСтрока.СкладКомпании = ?(ПолучитьСкладПоПодразделению()=Неопределено,обПраво("ОсновнойСкладКомпании",Права),ПолучитьСкладПоПодразделению());
				// БИЗТЕХ КОВАЛЬ 08.07.2025 --
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		#Если Клиент Тогда
		Попытка
			ЕстьЗамены = (ЭтаФорма.ОбработкаПодборЗамен <> Неопределено);
		Исключение
			ЕстьЗамены = Ложь;
		КонецПопытки;
			
		Если ЕстьЗамены Тогда
			ЭтаФорма.ОбновитьПодборЗамен();
		КонецЕсли;
		#КонецЕсли
		
		Попытка
			Если НЕ ЗначениеЗаполнено(ТекСтрока.ИсточникПродажи) Тогда
				ТекСтрока.ИсточникПродажи = обПраво(ПланыВидовХарактеристик.ПраваИНастройки.ИсточникПродажиПоУмолчанию, Права,, ЭтотОбъект);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.ПроцентСкидки" Тогда
		
		Если ТекСтрока.ПроцентСкидки > 0 И ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.ПроцентСкидки = 0;
		КонецЕсли;
		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,"Товары.ПроцентСкидки",ТекСтрока,ЭтаФорма,ДопПараметры);
		
		Возврат Рез;
	ИначеЕсли Имя = "Товары.СкидкаНаТовар" Тогда
		
		Если ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.СкидкаНаТовар       = Справочники.ТипыСкидок.ПустаяСсылка();
		КонецЕсли;
		
		Возврат дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
	ИначеЕсли Имя = "Товары.ПроцентСкидкиСтроки" Тогда
		
		Если ТекСтрока.ПроцентСкидкиСтроки > 0 И ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.ПроцентСкидкиСтроки = 0;
		КонецЕсли;
		
		Возврат дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "РАБОТЫ"
	ИначеЕсли Имя="Работы.Работа" Тогда
		
		// Проверим вид использования автоработы
		Если обПолучитьЗначениеСвойства(ТекСтрока.Работа, "ВидИспользованияАвтоработы") = Перечисления.ВидыИспользованияАвторабот.Планирование Тогда
			#Если Клиент Тогда
				Предупреждение("В таблицу нельзя вводить работы с видом использования ""Планирование""",5);
			#КонецЕсли
			ТекСтрока.Работа = Неопределено;
		КонецЕсли;
		
		Если (Не СкидкаНаценкаРаботы.Пустая()) И (СкидкаНаценкаРаботы.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная) Тогда
			ТекСтрока.ПроцентСкидки=ЗначениеСкидкиНаценкиРабот; 	
		Иначе	
			ТекСтрока.ПроцентСкидки=0;
		КонецЕсли; 
		// Сбросим значения скидки строки, если таковые имеются.
		ТекСтрока.СкидкаНаТовар=Справочники.ТипыСкидок.ПустаяСсылка(); 
		ТекСтрока.ПроцентСкидкиСтроки=0;
		ТекСтрока.СуммаСкидкиСтроки=0;
	
		//Проверим на повторение строки в таблице
		//Получим из формы последнюю текущую работу
		Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1; КонецЕсли; 
		//Перерассчитаем цену текущей работы
		ОбработкаРеквизита("РасчетЦеныРаботы",ТекСтрока,ЭтаФорма,ДопПараметры);
		//Заполнение ставок налогов
		Если ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС ИЛИ ЭтотОбъект.ВидРемонта.ОсвобожденОтНДСРаботы Тогда
			ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
		Иначе
			ТекСтрока.СтавкаНДС=ТекСтрока.Работа.Номенклатура.СтавкаНДС;
		КонецЕсли;
		
		// Проверим надо ли заполнять пакеты
		ЗаполнятьПакеты = обПраво("УРВ_ДобавлятьРаботыВПакетПриДобавлении",Права,,ЭтотОбъект);
		Если ЗаполнятьПакеты Тогда
			// Заполним уникальный идентификатор пакета
			Если обЗначениеНеЗаполнено(ТекСтрока.ПакетРабот) Тогда
				Если Работы.Количество() = 1 Тогда
					ТекСтрока.ПакетРабот  = Новый УникальныйИдентификатор;
					ТекСтрока.НомерПакета = 1;
				Иначе
					Если КэшПакетов = Неопределено Тогда
						Запрос = Новый Запрос;
						Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
						Запрос.Текст =
						"ВЫБРАТЬ
						|	ЗаказНарядРаботы.ПакетРабот,
						|	ЗаказНарядРаботы.НомерПакета
						|ПОМЕСТИТЬ
						|	ТаблРабот
						|ИЗ
						|	&ТаблРабот КАК ЗаказНарядРаботы
						|;
						|ВЫБРАТЬ
						|	ЗаказНарядРаботы.ПакетРабот,
						|	ЗаказНарядРаботы.НомерПакета КАК НомерПакета
						|ИЗ
						|	ТаблРабот КАК ЗаказНарядРаботы
						|ГДЕ
						|	ЗаказНарядРаботы.НомерПакета <> 0
						|СГРУППИРОВАТЬ ПО
						|	ЗаказНарядРаботы.ПакетРабот,
						|	ЗаказНарядРаботы.НомерПакета
						|
						|УПОРЯДОЧИТЬ ПО
						|	НомерПакета";
						Запрос.УстановитьПараметр("ТаблРабот",Работы.Выгрузить());
						КэшПакетов = Запрос.Выполнить().Выбрать();
					КонецЕсли;
					
					КэшПакетов.Сбросить();
					Если КэшПакетов.Следующий() Тогда
						ТекСтрока.ПакетРабот  = КэшПакетов.ПакетРабот;
						ТекСтрока.НомерПакета = КэшПакетов.НомерПакета;
					Иначе
						КэшПакетов = Неопределено;
						ТекСтрока.ПакетРабот  = Новый УникальныйИдентификатор;
						ТекСтрока.НомерПакета = 1;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ИсточникПродажи) Тогда
			ТекСтрока.ИсточникПродажи = обПраво(ПланыВидовХарактеристик.ПраваИНастройки.ИсточникПродажиПоУмолчанию, Права,, ЭтотОбъект);
		КонецЕсли;
		
		//Расчет сумм по строке
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Количество" Тогда
		Возврат ОбработкаРеквизита("Работы.Коэффициент",ТекСтрока,ЭтаФорма,ДопПараметры);
	ИначеЕсли Имя="Работы.Нормочас" Тогда
		ТекСтрока.Цена=обПересчет(ТекСтрока.Нормочас.Цена,ТекСтрока.Нормочас.Валюта,ТекущаяДата(),ВалютаДокумента,КурсДокумента);
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Коэффициент" Тогда
		Возврат ОбработкаРеквизита("Работы.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество*ТекСтрока.Коэффициент;
		Возврат ОбработкаРеквизита("РассчитатьСкидкиРабот",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.Сумма" Тогда
		ТекСтрока.Цена=?(ТекСтрока.Количество*ТекСтрока.Коэффициент=0,0,ТекСтрока.Сумма/(ТекСтрока.Количество*ТекСтрока.Коэффициент));
		Возврат ОбработкаРеквизита("РассчитатьСкидкиРабот",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.ПроцентСкидки" Тогда
		Рез=Истина;
		// Скидка не может быть выше 100%
		Если ТекСтрока.ПроцентСкидки>100 Тогда
			ТекСтрока.ПроцентСкидки = 100;	
		КонецЕсли;
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СкидкаНаТовар) И ТекСтрока.СкидкаНаТовар.ФлагВытеснения Тогда
			ТекСтрока.ПроцентСкидки = 0;
		КонецЕсли;
			
		Если ТекСтрока.ПроцентСкидки > 0 И ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.ПроцентСкидки = 0;
		КонецЕсли;
		
		ДопПараметры.Вставить("ТипЦен", ЭтотОбъект.ТипЦенРабот);
		ТекСтрока_СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
		СуммаСкидки=Окр(ТекСтрока.ПроцентСкидки*ТекСтрока_СуммаБезСкидки/100,2);
		СуммаСкидки=дкОкруглитьСуммуСкидки(СуммаСкидки,СкидкаНаценкаРаботы);
		Если СуммаСкидки<>ТекСтрока.СуммаСкидки Тогда // Сумма скидки изменилась
			ТекСтрока.СуммаСкидки=СуммаСкидки;
		КонецЕсли; 
		ДопПараметры.Вставить("ПересчитыватьПроцентСкидки",Ложь);
		Рез=ОбработкаРеквизита("Работы.СуммаСкидки",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		Возврат Рез;
		
	ИначеЕсли Имя="Работы.СуммаСкидки" Тогда
		Попытка	// Определим необходимость обратного расчета процента скидки.
			ПересчитыватьПроцентСкидки=ДопПараметры.ПересчитыватьПроцентСкидки;
		Исключение 
			ПересчитыватьПроцентСкидки=Истина;	
		КонецПопытки;
		Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СкидкаНаТовар) И ТекСтрока.СкидкаНаТовар.ФлагВытеснения Тогда
			ТекСтрока.СуммаСкидки = 0;
		КонецЕсли;
		Если ПересчитыватьПроцентСкидки Тогда
			ДопПараметры.Вставить("ТипЦен", ЭтотОбъект.ТипЦенРабот);
			ТекСтрока_СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
			ТекСтрока.ПроцентСкидки=?(ТекСтрока_СуммаБезСкидки=0,0,Окр(ТекСтрока.СуммаСкидки*100/ТекСтрока_СуммаБезСкидки,2));
		КонецЕсли;
		// Выполним расчет итоговой суммы скидки на документ.
		СуммаСкидкиНаценкиРабот=Работы.Итог("СуммаСкидки");
		СуммаСкидкиНаценкиРабот=СуммаСкидкиНаценкиРабот+Работы.Итог("СуммаСкидкиСтроки");
		// Ничего делать не будем - весь расчет от НДС зависит (включено или нет)
		Возврат ОбработкаРеквизита("Работы.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.СкидкаНаТовар" Тогда
		ОбработкаРасчетСкидокАвторабот.ПодобратьСтрочнуюСкидку(ЭтотОбъект,ТекСтрока);
		ТекСтрока.СкидкаНаТовар       = ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаСтроки;
		ТекСтрока.ПроцентСкидкиСтроки = ОбработкаРасчетСкидокАвторабот.ТекущийПроцентСкидкиСтроки;
		ТекСтрока.СуммаСкидкиСтроки   = ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидкиСтроки;
		
		Если ЗначениеЗаполнено(ТекСтрока.СкидкаНаТовар) И ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.СкидкаНаТовар       = Справочники.ТипыСкидок.ПустаяСсылка();
			ТекСтрока.ПроцентСкидкиСтроки = 0;
			ТекСтрока.СуммаСкидкиСтроки   = 0;
			СуммаСкидкиНаценкиРабот       = 0;
		Иначе
			// Пересчитываем общую сумму скидок документа.
			СуммаИтого              = Работы.Итог("СуммаСкидки");
			СуммаИтого              = СуммаИтого+Работы.Итог("СуммаСкидкиСтроки");
			СуммаСкидкиНаценкиРабот = СуммаИтого;
		КонецЕсли;
		
		// Пересчитываем общую сумму скидок документа.
		СуммаИтого=Работы.Итог("СуммаСкидки");
		СуммаИтого=СуммаИтого+Работы.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценкиРабот=СуммаИтого;
		Возврат ЭтотОбъект.ОбработкаРеквизита("Работы.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);			
		
	ИначеЕсли Имя="Работы.ПроцентСкидкиСтроки" Тогда
		// Если скидка на работу (строки) не выбрана, а пользователь пытается установить значение процента, 
		// то не дадим ему это сделать.
		Если ТекСтрока.СкидкаНаТовар.Пустая() Тогда
			ТекСтрока.ПроцентСкидкиСтроки = 0;
		КонецЕсли;
		// Скидка не может быть выше 100%
		Если ТекСтрока.ПроцентСкидкиСтроки>100 Тогда
			ТекСтрока.ПроцентСкидкиСтроки = 100;
		КонецЕсли;
		
		Если ТекСтрока.ПроцентСкидкиСтроки > 0 И ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			ТекСтрока.ПроцентСкидкиСтроки = 0;
		КонецЕсли;
		
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		ДопПараметры.Вставить("ТипЦен", ЭтотОбъект.ТипЦенРабот);
		ТекСтрока_СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
		ТекСтрока.СуммаСкидкиСтроки=Окр(ТекСтрока_СуммаБезСкидки*ТекСтрока.ПроцентСкидкиСтроки/100,2);
		ТекСтрока.СуммаСкидкиСтроки=дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидкиСтроки,ТекСтрока.СкидкаНаТовар);
		// Запрещаем обратный пересчет процента.
		ДопПараметры.Вставить("ПересчитыватьПроцентСкидкиСтроки",Ложь);
		Возврат ЭтотОбъект.ОбработкаРеквизита("Работы.СуммаСкидкиСтроки",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.СуммаСкидкиСтроки" Тогда
		// Если скидка на работу (строки) не выбрана, а пользователь пытается установить сумму скидки,
		// то не дадим ему это сделать.
		Если ТекСтрока.СкидкаНаТовар.Пустая() Тогда
			ТекСтрока.СуммаСкидкиСтроки = 0;
		КонецЕсли;
		// Проверим дополнительные параметры, возможно пересчитывать процент не нужно.
		Попытка // Определим необходимость обратного расчета процента скидки.
			ПересчитыватьПроцентСкидкиСтроки=ДопПараметры.ПересчитыватьПроцентСкидкиСтроки;
		Исключение 
			ПересчитыватьПроцентСкидкиСтроки=Истина;
		КонецПопытки;
		Если ПересчитыватьПроцентСкидкиСтроки Тогда
			Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("ТипЦен", ЭтотОбъект.ТипЦенРабот);
			ТекСтрока_СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
			ТекСтрока.ПроцентСкидкиСтроки=?(ТекСтрока_СуммаБезСкидки=0,0,Окр(ТекСтрока.СуммаСкидкиСтроки*100/ТекСтрока_СуммаБезСкидки,2));
		КонецЕсли;			
		// Выполним расчет итоговой суммы скидки на документ.
		// Вычисляем итоговое значение суммы скидки (скидка шапки + скидки строк). Имя реквизита,
		// в котором должна хранится итоговая сумма скидки, 
		// а также имя табличной части, по которой необходимо вычислить итоговую сумму скидки находятся в реквизитах
		// обработки.
		СуммаИтого=Работы.Итог("СуммаСкидки");
		СуммаИтого=СуммаИтого+Работы.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценкиРабот=СуммаИтого;
		Возврат ОбработкаРеквизита("Работы.СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Работы.СтавкаНДС" Тогда
		СуммаСкидки = ТекСтрока.СуммаСкидки;
		СуммаСкидки = СуммаСкидки + ТекСтрока.СуммаСкидкиСтроки;
		ЦенаВключаетНДС = ЭтотОбъект.ТипЦенРабот.Пустая() ИЛИ ЭтотОбъект.ТипЦенРабот.ЦенаВключаетНДС;
		СтавкаНДС = ТекСтрока.СтавкаНДС.Ставка;
		Сумма = ТекСтрока.Сумма;
		
		Если НЕ ЦенаВключаетНДС Тогда
			Сумма = Сумма + Окр(Сумма*СтавкаНДС/100,2);
		КонецЕсли;
		
		СуммаСоСкидкой = Сумма - СуммаСкидки;

		СтавкаНДС=ТекСтрока.СтавкаНДС.Ставка;
		ТекСтрока.СуммаНДС=Окр((СуммаСоСкидкой*СтавкаНДС)/(100+СтавкаНДС),2);
		ТекСтрока.СуммаВсего=СуммаСоСкидкой;
		Возврат Истина;
		
	ИначеЕсли Имя="Работы.СуммаНДС" Тогда
		Возврат Истина;
	ИначеЕсли Имя="Работы.СуммаВсего" Тогда
		// Определяем какая скидка установлена для строки.
		Если Не ТекСтрока.СкидкаНаТовар.Пустая() Тогда
			СкидкаСтрокиАбсолютная=(ТекСтрока.СкидкаНаТовар.СпособВычисления=Перечисления.СкидкиСпособВычисления.Абсолютная);
			Если СкидкаСтрокиАбсолютная Тогда
				ЗначениеСкидкиСтроки=ТекСтрока.СуммаСкидкиСтроки;	
			Иначе
				ЗначениеСкидкиСтроки=ТекСтрока.ПроцентСкидкиСтроки;
			КонецЕсли;
		Иначе
			СкидкаСтрокиАбсолютная=Истина;
			ЗначениеСкидкиСтроки=0;
		КонецЕсли;
		// Определим включают ли в себя НДС цены документа
		ЦенаВключаетНДС=(обЗначениеНеЗаполнено(ЭтотОбъект.ТипЦенРабот) ИЛИ ЭтотОбъект.ТипЦенРабот.ЦенаВключаетНДС);
		
		// Определим, есть ли скидки.
		// Сначала шапочная скидка.
		Попытка   			
			ПроцентСкидки = ТекСтрока.ПроцентСкидки;
		Исключение 
			ПроцентСкидки = 0;
		КонецПопытки;
		
		// Теперь определяем какая скидка установлена для строки.
		СкидкаСтрокиАбсолютная = Истина;
		ЗначениеСкидкиСтроки = 0;
		Попытка
			Если Не ТекСтрока.СкидкаНаТовар.Пустая() Тогда
				СкидкаСтрокиАбсолютная = (ТекСтрока.СкидкаНаТовар.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная);
				Если СкидкаСтрокиАбсолютная Тогда
					ЗначениеСкидкиСтроки = ТекСтрока.СуммаСкидкиСтроки;	
				Иначе
					ЗначениеСкидкиСтроки = ТекСтрока.ПроцентСкидкиСтроки;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		//// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
		Если ЦенаВКлючаетНДС Тогда
			Если СкидкаСтрокиАбсолютная Тогда
				СуммаДляРасчета    = ТекСтрока.СуммаВсего + ЗначениеСкидкиСтроки;
				ПроцентСкидкиВсего = ПроцентСкидки;
			Иначе
				СуммаДляРасчета = ТекСтрока.СуммаВсего;
				ПроцентСкидкиВсего = ПроцентСкидки + ЗначениеСкидкиСтроки;
			КонецЕсли;
		Иначе
			ВремСуммаНДС = Окр((ТекСтрока.СуммаВсего * ТекСтрока.СтавкаНДС.Ставка)/(100 + ТекСтрока.СтавкаНДС.Ставка), 2);
			Если СкидкаСтрокиАбсолютная Тогда
				СуммаДляРасчета    = ТекСтрока.СуммаВсего - ВремСуммаНДС + ЗначениеСкидкиСтроки;
				ПроцентСкидкиВсего = ПроцентСкидки;
			Иначе
				СуммаДляРасчета = ТекСтрока.СуммаВсего - ВремСуммаНДС;
				ПроцентСкидкиВсего = ПроцентСкидки + ЗначениеСкидкиСтроки;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроцентСкидкиВсего >= 100 Тогда
			ТекСтрока.СуммаВсего = 0;
			ТекСтрока.Сумма = СуммаДляРасчета;
		Иначе
			ТекСтрока.Сумма = СуммаДляРасчета*100/(100 - ПроцентСкидкиВсего)
		КонецЕсли;

		// Пересчитываем цену.
		ТекСтрока.Цена=?(ТекСтрока.Количество=0,0,?(ТекСтрока.Коэффициент=0,(ТекСтрока.Сумма/ТекСтрока.Количество),(ТекСтрока.Сумма/(ТекСтрока.Количество*ТекСтрока.Коэффициент))));
		// Вычисляем новую сумму "шапочной" скидки приходящейся на текущую строку.
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		ДопПараметры.Вставить("ТипЦен", ЭтотОбъект.ТипЦенРабот);
		СуммаБезСкидки=дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
		ТекСтрока.СуммаСкидки=Окр(СуммаБезСкидки*ТекСтрока.ПроцентСкидки/100,2);
		ТекСтрока.СуммаСкидки=дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидки,СкидкаНаценкаРаботы);
		// Вычисляем товарную скидку.		
		Если СкидкаСтрокиАбсолютная Тогда
			ТекСтрока.ПроцентСкидкиСтроки=?(СуммаБезСкидки=0,0,Окр(ТекСтрока.СуммаСкидкиСтроки*100/СуммаБезСкидки,2));
		Иначе
			ТекСтрока.СуммаСкидкиСтроки=Окр(СуммаБезСкидки*ТекСтрока.ПроцентСкидкиСтроки/100,2);
			ТекСтрока.СуммаСкидкиСтроки=дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидкиСтроки,ТекСтрока.СкидкаНаТовар);
		КонецЕсли;
		// Рассчитываем новую сумму НДС. 		
		СуммаВсегоБезСкидки=СуммаБезСкидки-ТекСтрока.СуммаСкидки-ТекСтрока.СуммаСкидкиСтроки;
		//Если ЦенаВключаетНДС Тогда			
			ТекСтрока.СуммаНДС=Окр((СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка)/(100+ТекСтрока.СтавкаНДС.Ставка),2);
		//Иначе
		//	ТекСтрока.СуммаНДС=Окр(СуммаВсегоБезСкидки*ТекСтрока.СтавкаНДС.Ставка/100,2);
		//КонецЕсли;
		// Выполним расчет итоговой суммы скидки на документ.
		СуммаИтого=Работы.Итог("СуммаСкидки");
		СуммаИтого=СуммаИтого+Работы.Итог("СуммаСкидкиСтроки");
		СуммаСкидкиНаценкиРабот=СуммаИтого;
		Возврат Рез;
		
	ИначеЕсли Имя="МатериалыЗаказчика.Номенклатура" Тогда
		
		Если НЕ ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		ДопПараметры.Вставить("ТабличнаяЧастьТовары", МатериалыЗаказчика);
		ДопПараметры.Вставить("ИмяТаблицы", "МатериалыЗаказчика");
		
		Рез=дкОбработкаРеквизита(ЭтотОбъект,"Товары.Номенклатура",ТекСтрока, ЭтаФорма, ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда
			Возврат Рез;
		КонецЕсли; //Это если это был набор и мы удалили эту строку
		
		Возврат Рез;
		
	ИначеЕсли Имя="РасчетЦеныРаботы" Тогда
		//При заполнении на основании заявки не пересчитываем цены
		Если ДопПараметры.Свойство("НеВыполнятьПересчет") И ДопПараметры.НеВыполнятьПересчет Тогда
			Возврат Истина;
		КонецЕсли;
		//Расчет цены работы
		Если обЗначениеНеЗаполнено(ТекСтрока.Работа) Тогда
			Возврат Ложь;
		КонецЕсли;
		//Если работа задана - получим ее цену согласно класса автомобиля (если автомобиль выбран)
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
				Модель = Автомобиль.ВариантКомплектации;
			Иначе
				Модель = Автомобиль.Модель;
			КонецЕсли;
		Иначе
			Модель = Справочники.Модели.ПустаяСсылка();
		КонецЕсли; 
		ЦенаРаботы=орПолучитьЦенуАвтоработы(ТипЦенРабот, ТекСтрока.Работа,Модель,ДоговорВзаиморасчетов,Цех,ВидРемонта,,ВалютаДокумента,КурсДокумента);
		ТекСтрока.Нормочас=ЦенаРаботы.Нормочас;
		ТекСтрока.Коэффициент=?(обЗначениеНеЗаполнено(ЦенаРаботы.НормаВремени),ТекСтрока.Коэффициент,ЦенаРаботы.НормаВремени);
		ТекСтрока.Цена=ЦенаРаботы.Цена;
		Возврат Истина;
	ИначеЕсли Имя="РассчитатьСкидки" Тогда
		
		Если НЕ обПраво("РедактированиеДеталейЗаказНаряда",Права,,ЭтотОбъект) = ИСТИНА Тогда
			Возврат Истина;
		КонецЕсли;
		
		дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
		Возврат Ложь;
		
	ИначеЕсли Имя="РассчитатьСкидкиРабот" Тогда
		
		Рез=Истина;
		
		Если НЕ обПраво("РедактированиеРаботЗаказНаряда",Права,,ЭтотОбъект) = ИСТИНА Тогда
			Возврат Рез;
		КонецЕсли;
		
		Попытка
			НеРассчитыватьСкидки = ДопПараметры.НеРассчитыватьСкидки;
		Исключение 
			НеРассчитыватьСкидки = Ложь;
		КонецПопытки;
		
		Попытка	
			НеРассчитыватьСкидки = ДопПараметры.НеРассчитыватьСкидки;
		Исключение 
			НеРассчитыватьСкидки = Ложь;	
		КонецПопытки;
		
		Попытка
			БлокироватьПерерасчетСкидок = ЭтотОбъект.БлокироватьПерерасчетСкидок;
		Исключение
			БлокироватьПерерасчетСкидок = Ложь;
		КонецПопытки;
		
		НеВыполнятьКонтрольПустойСкидки = Ложь;
		Если ДопПараметры.Свойство("НеВыполнятьКонтрольПустойСкидки") Тогда
			НеВыполнятьКонтрольПустойСкидки = ДопПараметры.НеВыполнятьКонтрольПустойСкидки;
		КонецЕсли;
		
		ОбработкаРасчетСкидокАвторабот.Дата = Дата;
		ОбработкаРасчетСкидокАвторабот.ПодразделениеКомпании = ПодразделениеКомпании;
		ОбработкаРасчетСкидокАвторабот.Карточка = Карточка;
		ОбработкаРасчетСкидокАвторабот.СкидкаНаценка = СкидкаНаценкаРаботы;
		ОбработкаРасчетСкидокАвторабот.СкладКомпании = Цех.СкладКомпании;
		// Подбираем подходящую скидку. Если скидка не изменилась, то функция вернет Ложь.
		Если БлокироватьПерерасчетСкидок Тогда
			Попытка
				Если НЕ НеВыполнятьКонтрольПустойСкидки И обЗначениеНеЗаполнено(ЭтотОбъект[ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСкидкаНаценка]) Тогда
					Для Каждого стрДок Из ЭтотОбъект[ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти] Цикл
						стрДок.ПроцентСкидки = 0;
						ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти + ".ПроцентСкидки", стрДок, ЭтаФорма);
					КонецЦикла;
				КонецЕсли;
			Исключение КонецПопытки;
			
			Если ТекСтрока = Неопределено Тогда
				Возврат Ложь;
			КонецЕсли;
			
			ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти + ".ПроцентСкидки", ТекСтрока, ЭтаФорма);
			Попытка // на случай если в документе нет скидки строки
				ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти + ".ПроцентСкидкиСтроки", ТекСтрока, ЭтаФорма);
			Исключение
			КонецПопытки;
			
			Возврат Истина;
		ИначеЕсли (Не НеРассчитыватьСкидки) И ОбработкаРасчетСкидокАвторабот.ПодобратьСкидку(ЭтотОбъект) Тогда
			СкидкаНаценкаРаботы=ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка;
			ЗначениеСкидкиНаценкиРабот=ОбработкаРасчетСкидокАвторабот.ТекущееЗначениеСкидки;
			СуммаСкидкиНаценкиРабот=ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидки;
			// Подобралась другая "шапочная" скидка, значит, возможно, придется заблокировать работу с некоторыми колонками 
			// в зависимости от типа скидки.
			#Если Клиент Тогда
				Если ЭтаФорма<>Неопределено Тогда
					дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма,ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка,ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти);	
				КонецЕсли;
			#КонецЕсли
			// Применяем скидку к табличной части. Перерассчитваем строчные скидки.
			ОбработкаРасчетСкидокАвторабот.ПрименитьСкидку(ЭтотОбъект);
			СуммаИтого=Работы.Итог("СуммаСкидкиСтроки");
			СуммаСкидкиНаценкиРабот=СуммаСкидкиНаценкиРабот+СуммаИтого;
		Иначе // Просто пересчитываем значение суммы скидки для текущей строки.
			Если ТекСтрока<>Неопределено Тогда
				// Подбираем скидку для текущей строки (скидка на автоработу).
				Если Не ОбработкаРасчетСкидокАвторабот.НеРассчитыватьСтрочныеСкидки Тогда
					Если НЕ НеРассчитыватьСкидки Тогда
						ОбработкаРасчетСкидокАвторабот.ПодобратьСтрочнуюСкидку(ЭтотОбъект,ТекСтрока);
						ТекСтрока.СкидкаНаТовар       = ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаСтроки;
						ТекСтрока.ПроцентСкидкиСтроки = ОбработкаРасчетСкидокАвторабот.ТекущийПроцентСкидкиСтроки;
						ТекСтрока.СуммаСкидкиСтроки   = ОбработкаРасчетСкидокАвторабот.ТекущаяСуммаСкидкиСтроки;
					КонецЕсли; 
				КонецЕсли; 
				
				// Рассчитываем "шапочную" скидку для текущей строки. За одно рассчитаем общую сумму скидки на документ.
				Если СкидкаНаценкаРаботы.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная Тогда
					ОбработкаРеквизита("Работы.ПроцентСкидки",ТекСтрока,ЭтаФорма,ДопПараметры);
				Иначе
					ОбработкаРеквизита("Работы.СуммаСкидки",ТекСтрока,ЭтаФорма,ДопПараметры);
				КонецЕсли;
			Иначе
				// Если произошла смена типа скидки, но значение скидки не изменилась, то пересчитывать ТЧ нет необходимости, но
				// сохранить новый тип скидки нужно.
				СкидкаНаценкаРаботы=ОбработкаРасчетСкидокАвторабот.ТекущаяСкидкаНаценка;

				СуммаИтого = 0;				
				СуммаИтого = Работы.Итог("СуммаСкидки");				

				СуммаИтого = СуммаИтого + Работы.Итог("СуммаСкидкиСтроки");

				СуммаСкидкиНаценкиРабот = СуммаИтого;					
			КонецЕсли;			
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			ВывестиПодвалСкидокРабот(ЭтаФорма);
		КонецЕсли;
		#КонецЕсли
		
		Возврат Рез;
		
	ИначеЕсли Имя = "СоздатьНапоминание" Тогда
		ДатаНапоминания=Неопределено;
		Если НЕ обЗначениеНеЗаполнено(ДатаОкончания) Тогда
			ДатаНапоминания=ДатаОкончания;
		ИначеЕсли НЕ обЗначениеНеЗаполнено(ДатаНачала) Тогда
			ДатаНапоминания=ДатаНачала;
		КонецЕсли;
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры=Новый Структура;
		КонецЕсли; 
		Если ДатаНапоминания<>Неопределено Тогда
			ДопПараметры.Вставить("ДатаНачала",ДатаНапоминания);
			ДопПараметры.Вставить("РеальнаяДатаОповещения",ДатаНапоминания);
		КонецЕсли;
		Получатели=Новый СписокЗначений;
		Получатели.Добавить(Автор);
		ДопПараметры.Вставить("СписокПользователей", Получатели); 
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Процедура поиска и подстановки даты машинозаезда
//
// Параметры
//  ЭтаФорма  - ФормаДокумента - Форма редактирования документа заказ-наряда
Процедура ДатаМашинозаездаРасчет(ЭтаФорма)
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ЗаказНаряд.ДатаМашинозаезда КАК ДатаМашинозаезда
		             |ИЗ
		             |	Документ.ЗаказНаряд КАК ЗаказНаряд
		             |ГДЕ
		             |	ЗаказНаряд.Автомобиль = &Автомобиль
		             |	И ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	ДатаМашинозаезда УБЫВ";
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаМашинозаезда=Выборка.ДатаМашинозаезда;
		КонецЕсли; 
	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(ДатаМашинозаезда) Тогда
		#Если Клиент Тогда
		ДатаМашинозаезда=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
		#Иначе
		ДатаМашинозаезда=ТекущаяДата();
		#КонецЕсли
	КонецЕсли;
	
	Если ЭтаФорма<>Неопределено Тогда
		Если обЗначениеНеЗаполнено(ДатаМашинозаезда) Тогда
			ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Время.Кнопки.ДатаМашинозаезда.Текст="Дата машинозаезда не задана";
		Иначе
			ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Время.Кнопки.ДатаМашинозаезда.Текст="Дата машинозаезда "+Формат(ДатаМашинозаезда,"ДФ=dd.MM.yyyy чч:мм:сс");
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры // ДатаМашинозаездаРасчет() 

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

////// ОБЩИЙ КЕШ ИНФОРМАЦИИ ПО ДЕТАЛЯМ ЗН  ///////////////////////////////////////////////////////

// возвращает строку кеша по параметрам
Функция ПолучитьСтрокуКешаПеремещения(Номенклатура, ХарактеристикаНоменклатуры, СкладКомпании, ЕдиницаИзмерения, ИсходнаяТаблица = Неопределено) Экспорт
	//Если выборка еще не осуществлялась - загрузим ее
	СтруктураОтбора = Новый Структура();
	СтруктураОтбораКеша   = Новый Структура();
	Если НЕ обЗначениеНеЗаполнено(Номенклатура) Тогда
		СтруктураОтбора.Вставить("Номенклатура", Номенклатура);
		СтруктураОтбораКеша.Вставить("Номенклатура", Номенклатура);
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(ХарактеристикаНоменклатуры) Тогда
		СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		СтруктураОтбораКеша.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
		СтруктураОтбора.Вставить("СкладКомпании", СкладКомпании);
		СтруктураОтбораКеша.Вставить("СкладКомпании", СкладКомпании);
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(ЕдиницаИзмерения) Тогда
		СтруктураОтбора.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	КонецЕсли;
	
	Результат = Новый Массив;
	Если СтруктураОтбора.Количество()=0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если КэшДанныхПоПеремещению=Неопределено Тогда
		ПолучитьКэшДанныхПоПеремещению(,,,ИсходнаяТаблица);
		Результат = КэшДанныхПоПеремещению.НайтиСтроки(СтруктураОтбора);
	Иначе
		Результат = КэшДанныхПоПеремещению.НайтиСтроки(СтруктураОтбора);
		Если Результат.Количество()=0 Тогда
			Результат = КэшДанныхПоПеремещению.НайтиСтроки(СтруктураОтбораКеша);
			Если Результат.Количество()=0 Тогда
				ПолучитьКэшДанныхПоПеремещению(,,СтруктураОтбораКеша, ИсходнаяТаблица);
			Иначе
				ПересчитатьКеш(, СтруктураОтбораКеша, ИсходнаяТаблица);
			КонецЕсли;
			Результат = КэшДанныхПоПеремещению.НайтиСтроки(СтруктураОтбора);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьСтрокуКешаПеремещенияПоЗаказам()

// перезаполнение кеша
Процедура ПересчитатьКеш(ПоСкладу=Неопределено, СтруктураОтбора = Неопределено, ТаблицаТоваров = Неопределено) Экспорт
	
	Если НЕ ТипЗнч(КэшДанныхПоПеремещению) = Тип("ТаблицаЗначений") Тогда
		ТипКоличества = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3));
		КэшДанныхПоПеремещению = Новый ТаблицаЗначений;
		КэшДанныхПоПеремещению.Колонки.Добавить("Номенклатура",               Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		КэшДанныхПоПеремещению.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		КэшДанныхПоПеремещению.Колонки.Добавить("СкладКомпании",    Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
		КэшДанныхПоПеремещению.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения"));
	
		КэшДанныхПоПеремещению.Колонки.Добавить("Заказано",             ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ЗаказаноПодЗН",        ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ЗарезервированоПодЗН", ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("Зарезервировано",      ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("Коэффициент",          ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ВПроизводстве",        ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ОсталосьПереместить",  ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ВозможноПереместить",  ТипКоличества);
		КэшДанныхПоПеремещению.Колонки.Добавить("ОстатокНаСкладе",      ТипКоличества);  
		КэшДанныхПоПеремещению.Колонки.Добавить("Ячейка",      Новый ОписаниеТипов("СправочникСсылка.ЯчейкиХранения"));
		
		//Индексы
		КэшДанныхПоПеремещению.Индексы.Добавить("Номенклатура");
		КэшДанныхПоПеремещению.Индексы.Добавить("ХарактеристикаНоменклатуры");   
		КэшДанныхПоПеремещению.Индексы.Добавить("Ячейка");
	КонецЕсли;
	
	Если ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		
		ТекОтбор = Новый Структура;
		Если СтруктураОтбора.Свойство("Номенклатура") Тогда
			ТекОтбор.Вставить("Номенклатура", СтруктураОтбора.Номенклатура);
		КонецЕсли;
		Если СтруктураОтбора.Свойство("ХарактеристикаНоменклатуры") Тогда
			ТекОтбор.Вставить("ХарактеристикаНоменклатуры", СтруктураОтбора.ХарактеристикаНоменклатуры);
		КонецЕсли;
		СтрокиДляУдаления = КэшДанныхПоПеремещению.НайтиСтроки(ТекОтбор);
		Для Каждого ТекСтрока Из СтрокиДляУдаления Цикл
			КэшДанныхПоПеремещению.Удалить(ТекСтрока);
		КонецЦикла;
		Если ТаблицаТоваров = Неопределено Тогда
			ИсходнаяТаблица = Товары.НайтиСтроки(ТекОтбор);
		Иначе
			ИсходнаяТаблица = ТаблицаТоваров.НайтиСтроки(ТекОтбор);
		КонецЕсли;
		ТаблицаПоЗН         = КешИнформацииЗН.Скопировать(КешИнформацииЗН.НайтиСтроки(ТекОтбор));
		ИтоговаяТаблицаПоЗН = КешИтоговойИнформацииЗН.Скопировать(КешИтоговойИнформацииЗН.НайтиСтроки(ТекОтбор));
		
		Если ТаблицаПоЗН.Количество() = 0 И ИтоговаяТаблицаПоЗН.Количество() = 0 И ИсходнаяТаблица.Количество()>0 Тогда
			ПолучитьКэшДанныхПоПеремещению(, , ТекОтбор, ТаблицаТоваров);
			Возврат;
		КонецЕсли;
	Иначе
		КэшДанныхПоПеремещению.Очистить();
		Если ТаблицаТоваров = Неопределено Тогда
			ИсходнаяТаблица = Товары;
		Иначе
			ИсходнаяТаблица = ТаблицаТоваров;
		КонецЕсли;
		ТаблицаПоЗН         = КешИнформацииЗН.Скопировать();
		ИтоговаяТаблицаПоЗН = КешИтоговойИнформацииЗН.Скопировать();
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из ИсходнаяТаблица Цикл
		
		СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры);
		СтрокиПроизводства = ИтоговаяТаблицаПоЗН.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПроизводства.Количество() = 0 Тогда
			ВПроизводстве = 0;
		Иначе
			ВПроизводстве = СтрокиПроизводства[0].ВПроизводстве;
		КонецЕсли;
		
		Заказано             = 0;
		ЗаказаноПодЗН        = 0;
		ЗарезервированоПодЗН = 0;
		СтрокиЗаказов = КешИтоговойИнформацииЗН.НайтиСтроки(СтруктураПоиска);
		Если СтрокиЗаказов.Количество()>0 Тогда
			ПерваяСтрока = СтрокиЗаказов[0];
			Заказано             = ПерваяСтрока.Заказано;
			ЗаказаноПодЗН        = ПерваяСтрока.ЗаказаноПодЗН;
			ЗарезервированоПодЗН = ПерваяСтрока.ЗарезервированоПодЗН;
		КонецЕсли;
		
		Если ПоСкладу = Неопределено Тогда
			СтруктураПоиска.Вставить("СкладКомпании", СтрокаТЧ.СкладКомпании);
		Иначе
			СтруктураПоиска.Вставить("СкладКомпании", ПоСкладу);
		КонецЕсли;
		
		РесурсыСтроки  = ТаблицаПоЗН.НайтиСтроки(СтруктураПоиска);
		Если РесурсыСтроки.Количество()=0 Тогда
			
			//Если ПоСкладу = Неопределено ИЛИ СтрокаТЧ.СкладКомпании = ПоСкладу Тогда
				НоваяСтрока = КэшДанныхПоПеремещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.ОсталосьПереместить  = СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;
				НоваяСтрока.Заказано             = Заказано;
				НоваяСтрока.ЗаказаноПодЗН        = ЗаказаноПодЗН;
				НоваяСтрока.ЗарезервированоПодЗН = ЗарезервированоПодЗН;
			//КонецЕсли;
			
		Иначе
			
			СтрокаРесурсов = РесурсыСтроки[0];
			Количество = СтрокаТЧ.Количество*СтрокаТЧ.Коэффициент;
			
			ВозможноПереместить      = СтрокаРесурсов.КоличествоОстаток;
			ВПроизводствеПоИсточнику = СтрокаРесурсов.ПеремещеноСоСклада;
			ВПроизводствеПоИсточнику = Мин(ВПроизводстве, ВПроизводствеПоИсточнику, Количество);
			ОсталосьПереместить      = Количество - ВПроизводствеПоИсточнику;
			ВозможноПереместить      = Мин(ОсталосьПереместить, ВозможноПереместить);
			
			СтрокаРесурсов.ПеремещеноСоСклада = СтрокаРесурсов.ПеремещеноСоСклада - ВПроизводствеПоИсточнику;
			СтрокаРесурсов.КоличествоОстаток  = СтрокаРесурсов.КоличествоОстаток - ВозможноПереместить;
			
			Если СтрокиПроизводства.Количество() > 0 Тогда
				Если ВПроизводстве = ВПроизводствеПоИсточнику Тогда
					ИтоговаяТаблицаПоЗН.Удалить(СтрокиПроизводства[0]);
				Иначе
					СтрокиПроизводства[0].ВПроизводстве = ВПроизводстве - ВПроизводствеПоИсточнику;
				КонецЕсли;
			КонецЕсли;
			
			//Если ПоСкладу = Неопределено ИЛИ СтрокаТЧ.СкладКомпании = ПоСкладу Тогда
				НоваяСтрока = КэшДанныхПоПеремещению.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурсов);
				НоваяСтрока.ЕдиницаИзмерения     = СтрокаТЧ.ЕдиницаИзмерения;
				НоваяСтрока.Коэффициент          = СтрокаТЧ.Коэффициент;
				НоваяСтрока.Заказано             = Заказано;
				НоваяСтрока.ЗаказаноПодЗН        = ЗаказаноПодЗН;
				НоваяСтрока.ЗарезервированоПодЗН = ЗарезервированоПодЗН;
				НоваяСтрока.ВПроизводстве        = ВПроизводствеПоИсточнику;
				НоваяСтрока.ОсталосьПереместить  = ОсталосьПереместить;
				НоваяСтрока.ВозможноПереместить  = ВозможноПереместить;
			//КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ИтоговаяТаблицаПоЗН Цикл
		СтрокиКеша = КэшДанныхПоПеремещению.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТЧ.Номенклатура, СтрокаТЧ.ХарактеристикаНоменклатуры));
		Если СтрокиКеша.Количество()>0 Тогда
			ПерваяСтрокаКеша = СтрокиКеша[0];
			ВПроизводстве = СтрокаТЧ.ВПроизводстве;
			Для Каждого СтрокаКеша Из СтрокиКеша Цикл
				Если ВПроизводстве = 0 Тогда
					Прервать;
				КонецЕсли;
				Если СтрокаКеша.ОсталосьПереместить = 0 Тогда
					Продолжить;
				КонецЕсли;
				ОсталосьПереместить            = СтрокаКеша.ОсталосьПереместить;
				ДополнительноеПеремещение      = Мин(ОсталосьПереместить, ВПроизводстве);
				ОсталосьПереместить            = ОсталосьПереместить-ДополнительноеПеремещение;
				СтрокаКеша.ОсталосьПереместить = ОсталосьПереместить;
				СтрокаКеша.ВозможноПереместить = Мин(ОсталосьПереместить, СтрокаКеша.ВозможноПереместить);
				СтрокаКеша.ВПроизводстве       = СтрокаКеша.ВПроизводстве + ДополнительноеПеремещение;
				ВПроизводстве = ВПроизводстве  - ДополнительноеПеремещение;
			КонецЦикла;
			ПерваяСтрокаКеша.ВПроизводстве = ПерваяСтрокаКеша.ВПроизводстве + ВПроизводстве;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПересчитатьКеш()

// перезаполнение кеша по перемещению
Процедура ПолучитьКэшДанныхПоПеремещению(ПоСкладу=Неопределено, Знач РезервыПоЗаказНаряду=Неопределено, СтруктураОтбора = Неопределено, ИсходнаяТаблица = Неопределено) Экспорт
	
	Если РезервыПоЗаказНаряду=Неопределено Тогда
		РезервыПоЗаказНаряду=ЗакрыватьЗаказыТолькоПоДанномуЗаказНаряду;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТекстОтбораЗаказПокупателя = "";
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(ДокументОснование) Тогда
		ТекстОтбораЗаказПокупателя = " (Заказ=&ВыбЗаказПокупателя) ИЛИ ";
		Запрос.УстановитьПараметр("ВыбЗаказПокупателя", ДокументОснование);
	КонецЕсли;
	
	//++СнимченкоАА_бизтех++
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт") И ЗначениеЗаполнено(ДокументОснование) Тогда
		ТекстОтбораЗаказПокупателя = " (Заказ=&ВыбЗаявкаНаРемонт) ИЛИ ";
		Запрос.УстановитьПараметр("ВыбЗаявкаНаРемонт", ДокументОснование);
	КонецЕсли;	
	//--СнимченкоАА_бизтех--
	
	ОтборПоСтроке = Ложь;
	ТекстОтбора = "";
	ВиртТекстОтбора = "";
	СтруктураОтбораБезСклада = Новый Структура;
	Если ТипЗнч(КешИнформацииЗН) = Тип("ТаблицаЗначений") И ТипЗнч(СтруктураОтбора) = Тип("Структура") Тогда
		
		Для Каждого ТекЭлемент Из СтруктураОтбора Цикл
			ИмяЭлемента = ТекЭлемент.Ключ;
			ТекстОтбора = ТекстОтбора + ?(ТекстОтбора = "", "ГДЕ ", " И ") + "
			|	ЗаказНарядТовары."+ИмяЭлемента+" = &"+ИмяЭлемента;
			Если НЕ ИмяЭлемента = "СкладКомпании" Тогда
				ВиртТекстОтбора = ВиртТекстОтбора + " И 
				|	"+ИмяЭлемента+" = &"+ИмяЭлемента;
				СтруктураОтбораБезСклада.Вставить(ИмяЭлемента, ТекЭлемент.Значение);
			КонецЕсли;
			Запрос.УстановитьПараметр(ИмяЭлемента, ТекЭлемент.Значение);
			ОтборПоСтроке = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	// Таблица строк
	ТекстЗапроса="
	|ВЫБРАТЬ
	|	ЗаказНарядТовары.Номенклатура,
	|	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
	|	ЗаказНарядТовары.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ ЗаказНарядТовары
	|ИЗ
	|	&Товары КАК ЗаказНарядТовары
	|" + ТекстОтбора +"
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНарядТовары.СкладКомпании КАК СкладКомпании,
	|	ЗаказНарядТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	ЗаказНарядТовары КАК ЗаказНарядТовары
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	СкладКомпании
	|;
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровВПроизводство.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ
	|	ПеремещенияТоваровВПроизводство
	|ИЗ
	|	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
	|ГДЕ
	|	ПеремещениеТоваровВПроизводство.ДокументОснование = &ЗаказНаряд
	|;
	|
	|ВЫБРАТЬ
	|	ЗаказВнутренний.Ссылка КАК Регистратор
	|ПОМЕСТИТЬ
	|	ТаблицаЗаказов
	|ИЗ
	|	Документ.ЗаказВнутренний КАК ЗаказВнутренний
	|ГДЕ
	|	ЗаказВнутренний.ДокументОснование = &ЗаказНаряд
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.ДокументОснование = &ЗаказНаряд
	|;
	|
	|ВЫБРАТЬ
	|	ОбъединеннаяТаблица.Номенклатура КАК Номенклатура,
	|	ОбъединеннаяТаблица.СкладКомпании КАК СкладКомпании,
	|	ОбъединеннаяТаблица.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОбъединеннаяТаблица.ПеремещеноСоСклада) КАК ПеремещеноСоСклада,
	|	СУММА(ОбъединеннаяТаблица.Зарезервировано) КАК Зарезервировано,
	|	СУММА(ОбъединеннаяТаблица.ОстатокНаСкладе)+СУММА(ОбъединеннаяТаблица.Зарезервировано) КАК КоличествоОстаток,
	|	СУММА(ОбъединеннаяТаблица.ОстатокНаСкладе) КАК ОстатокНаСкладе
	|ИЗ(
	|	ВЫБРАТЬ
	|		ТаблицаТоваров.Номенклатура,
	|		ТаблицаТоваров.СкладКомпании,
	|		ТаблицаТоваров.ХарактеристикаНоменклатуры,
	|		0 КАК ПеремещеноСоСклада,
	|		0 КАК Зарезервировано,
	|		0 КАК ОстатокНаСкладе
	|	ИЗ
	|		ТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОстаткиТоваровКомпании.Номенклатура,
	|		ОстаткиТоваровКомпании.СкладКомпании,
	|		ОстаткиТоваровКомпании.ХарактеристикаНоменклатуры,
	|		ОстаткиТоваровКомпании.Количество КАК ПеремещеноСоСклада,
	|		0 КАК Зарезервировано,
	|		0 КАК ОстатокНаСкладе
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
	|	ГДЕ
	|		ОстаткиТоваровКомпании.Регистратор ССЫЛКА Документ.ПеремещениеТоваровВПроизводство И 
	|		ОстаткиТоваровКомпании.Регистратор В (ВЫБРАТЬ Регистратор ИЗ ПеремещенияТоваровВПроизводство)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура,
	|		ЗаказыПокупателейОстатки.СкладКомпании,
	|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
	|		0,
	|		ЕСТЬNULL(ЗаказыПокупателейОстатки.РезервОстаток, 0),
	|		0
	|	ИЗ 
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(,
	|		"+?(РезервыПоЗаказНаряду, ТекстОтбораЗаказПокупателя+"Заказ В (ВЫБРАТЬ ТаблицаЗаказов.Регистратор ИЗ ТаблицаЗаказов КАК ТаблицаЗаказов)","
	|		("+ТекстОтбораЗаказПокупателя+"(Заказ В (ВЫБРАТЬ ТаблицаЗаказов.Регистратор ИЗ ТаблицаЗаказов КАК ТаблицаЗаказов)) ИЛИ (Контрагент=&Контрагент И (СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В 
	|			(ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТоваров КАК ТаблицаТоваров)))")+"
	|		"+?(ПоСкладу=Неопределено,"","И (СкладКомпании=&ПоСкладу)")+") КАК ЗаказыПокупателейОстатки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|		ОстаткиТоваровКомпанииОстатки.СкладКомпании,
	|		ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|		0,
	|		0,
	|		ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток
	|	ИЗ
	|		РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, (СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры) В 
	|			(ВЫБРАТЬ СкладКомпании, Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТоваров КАК ТаблицаТоваров)) КАК ОстаткиТоваровКомпанииОстатки) КАК ОбъединеннаяТаблица
	|СГРУППИРОВАТЬ ПО
	|	ОбъединеннаяТаблица.Номенклатура,
	|	ОбъединеннаяТаблица.СкладКомпании,
	|	ОбъединеннаяТаблица.ХарактеристикаНоменклатуры
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Если ИсходнаяТаблица = Неопределено Тогда
		Запрос.УстановитьПараметр("Товары", Товары);
	Иначе
		Запрос.УстановитьПараметр("Товары", ИсходнаяТаблица);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЗаказНаряд", Ссылка);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПоСкладу",   ПоСкладу);
	
	Если ОтборПоСтроке Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",               Выборка.Номенклатура);
			СтруктураПоиска.Вставить("СкладКомпании",              Выборка.СкладКомпании);
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
			НайденныеСтроки = КешИнформацииЗН.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаКеша = НайденныеСтроки[0];
			Иначе
				СтрокаКеша = КешИнформацииЗН.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаКеша, Выборка);
		КонецЦикла;
	Иначе
		КешИнформацииЗН = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровБезСкладов
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ОбъединенныйЗапрос.Номенклатура,
	|	ОбъединенныйЗапрос.ХарактеристикаНоменклатуры,
	|	СУММА(ОбъединенныйЗапрос.ВПроизводстве) КАК ВПроизводстве,
	|	СУММА(ОбъединенныйЗапрос.Заказано) КАК Заказано,
	|	СУММА(ОбъединенныйЗапрос.ЗаказаноПодЗН) КАК ЗаказаноПодЗН,
	|	СУММА(ОбъединенныйЗапрос.ЗарезервированоПодЗН) КАК ЗарезервированоПодЗН
	|ИЗ
	|	(
	|	ВЫБРАТЬ
	|		ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	|		ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ТоварыВПроизводствеОстатки.КоличествоОстаток КАК ВПроизводстве,
	|		0 КАК Заказано,
	|		0 КАК ЗаказаноПодЗН,
	|		0 КАК ЗарезервированоПодЗН
	|	ИЗ
	|		РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд"+ВиртТекстОтбора+") КАК ТоварыВПроизводствеОстатки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		0,
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(,
	|		"+?(РезервыПоЗаказНаряду, ТекстОтбораЗаказПокупателя+"Заказ В (ВЫБРАТЬ ТаблицаЗаказов.Регистратор ИЗ ТаблицаЗаказов КАК ТаблицаЗаказов)","
	|		("+ТекстОтбораЗаказПокупателя+"(Заказ В (ВЫБРАТЬ ТаблицаЗаказов.Регистратор ИЗ ТаблицаЗаказов КАК ТаблицаЗаказов)) ИЛИ (Контрагент=&Контрагент И (Номенклатура, ХарактеристикаНоменклатуры) В 
	|			(ВЫБРАТЬ Номенклатура, ХарактеристикаНоменклатуры ИЗ ТаблицаТоваровБезСкладов КАК ТаблицаТоваров)))")+") КАК ЗаказыПокупателейОстатки
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ЗаказыПокупателейОстатки.Номенклатура,
	|		ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры,
	|		0,
	|		0,
	|		ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток,
	|		ЗаказыПокупателейОстатки.РезервОстаток
	|	ИЗ
	|		РегистрНакопления.ЗаказыПокупателей.Остатки(,
	|		"+ТекстОтбораЗаказПокупателя+"Заказ В (ВЫБРАТЬ ТаблицаЗаказов.Регистратор ИЗ ТаблицаЗаказов КАК ТаблицаЗаказов)) КАК ЗаказыПокупателейОстатки) КАК ОбъединенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ОбъединенныйЗапрос.Номенклатура,
	|	ОбъединенныйЗапрос.ХарактеристикаНоменклатуры
	|	";
	
	Если ОтборПоСтроке Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура",               Выборка.Номенклатура);
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", Выборка.ХарактеристикаНоменклатуры);
			НайденныеСтроки = КешИтоговойИнформацииЗН.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество()>0 Тогда
				СтрокаКеша = НайденныеСтроки[0];
			Иначе
				СтрокаКеша = КешИтоговойИнформацииЗН.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаКеша, Выборка);
		КонецЦикла;
	Иначе  
		
		//++СнимченкоАА_бизтех++
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт")  Тогда
			Запрос.Текст = СтрЗаменить(запрос.Текст,"ЗаказыПокупателейОстатки.ЗаказаноОстаток-ЗаказыПокупателейОстатки.РезервОстаток","0");
		КонецЕсли;
		//--СнимченкоАА_бизтех--
		
		КешИтоговойИнформацииЗН = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ОтборПоСтроке Тогда
		ПересчитатьКеш(ПоСкладу, СтруктураОтбора, ИсходнаяТаблица);
	Иначе
		ПересчитатьКеш(ПоСкладу,, ИсходнаяТаблица);
	КонецЕсли;

КонецПроцедуры //ПолучитьКэшДанныхПоПеремещению()

////// ОСТАТКИ НА СКЛАДАХ ///////////////////////////////////////////////////////

//Процедура начального заполнения остатков номенклатуры на складах
Процедура ЗаполнитьОстаткиНоменклатурыНаСкладах() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, Номенклатура В (&Номенклатура) И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)) КАК ОстаткиТоваровКомпанииОстатки";
	Запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",Товары.ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
	КэшОстатковНоменклатурыНаСкладе=Запрос.Выполнить().Выгрузить();
КонецПроцедуры

// Получить остатки номенклатуры
// Номенклатура - СправочникСсылка на номенклатуру
// ХарактеристикаНоменклатуры - СправочникСсылка на ХарактеристикаНоменклатуры
// Возвращаемое значение Число - остаток номенклатуры
Функция ПолучитьОстаткиНоменклатурыНаСкладах(Знач СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры) Экспорт
	//Будем считать что остаток нулевой
	ОстатокНоменклатуры=0;
	СтруктураОтбора = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",Номенклатура,ХарактеристикаНоменклатуры);
	Если Не ЗначениеЗаполнено(СкладКомпании) Тогда
		СкладКомпании=Справочники.СкладыКомпании.ПустаяСсылка();
	КонецЕсли;
	СтруктураОтбора.Вставить("СкладКомпании", СкладКомпании);
	//Попробуем найти номенклатуру в кэше
	МассивСтрок=КэшОстатковНоменклатурыНаСкладе.НайтиСтроки(СтруктураОтбора);
	Если МассивСтрок.Количество()=0 Тогда
		//В кэше номенклатура не найдена - добавим остатки номенклатуры из регистра
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток-ОстаткиТоваровКомпанииОстатки.РезервОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(,"+?(ЗначениеЗаполнено(СкладКомпании),"СкладКомпании=&СкладКомпании И ","")+" Номенклатура = &Номенклатура И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ОстаткиТоваровКомпанииОстатки
		|";
		Запрос.УстановитьПараметр("СкладКомпании", СкладКомпании);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		ВыборкаОстатковНоменклатурыНаСкладах=Запрос.Выполнить().Выбрать();
		Если ВыборкаОстатковНоменклатурыНаСкладах.Следующий() Тогда
			ОстатокНоменклатуры=ВыборкаОстатковНоменклатурыНаСкладах.Остаток;
		КонецЕсли; 
		НоваяСтрокаКеша=КэшОстатковНоменклатурыНаСкладе.Добавить();
		НоваяСтрокаКеша.СкладКомпании=СкладКомпании;
		НоваяСтрокаКеша.Номенклатура=Номенклатура;
		НоваяСтрокаКеша.ХарактеристикаНоменклатуры=ХарактеристикаНоменклатуры;
		НоваяСтрокаКеша.Остаток = ОстатокНоменклатуры;
	Иначе
		ОстатокНоменклатуры = МассивСтрок[0].Остаток;
	КонецЕсли;

	Возврат ОстатокНоменклатуры;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Неопределено;
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Результат.Вставить(Перечисления.ВидыНоменклатуры.ПрочиеАктивы,0);
	Возврат Результат;
КонецФункции

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	ОбязательныеТовары.Вставить("Поставщик",2);
	ОбязательныеТовары.Вставить("КлючСтрокиПоставщика",2);
	
	ОбязательныеРаботы=Новый Структура();
	ОбязательныеРаботы.Вставить("Работа",3);
	ОбязательныеРаботы.Вставить("ИдентификаторРаботы",1);
	ОбязательныеРаботы.Вставить("Количество",1);
	ОбязательныеРаботы.Вставить("Нормочас",1);
	ОбязательныеРаботы.Вставить("Коэффициент",1);
	
	ОбязательныеИсполнители=Новый Структура();
	ОбязательныеИсполнители.Вставить("ИдентификаторРаботы",3);
	ОбязательныеИсполнители.Вставить("Исполнитель",3);
	ОбязательныеИсполнители.Вставить("Цех",3);
	ОбязательныеИсполнители.Вставить("Процент",1);
	
	ОбязательныеМатериалыЗаказчика = Новый Структура();
	ОбязательныеМатериалыЗаказчика.Вставить("Номенклатура",3);
	ОбязательныеМатериалыЗаказчика.Вставить("Количество",1);
	ОбязательныеМатериалыЗаказчика.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеМатериалыЗаказчика.Вставить("Коэффициент",1);
	ОбязательныеМатериалыЗаказчика.Вставить("ХарактеристикаНоменклатуры",2);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ТипЦенРабот",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ВидРемонта",1);
	//Если зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") Тогда
		КомплектацияАвтомобиля=Справочники.ВидыРемонта.КомплектацияАвтомобиля;
		Если (КомплектацияАвтомобиля.Пустая()) ИЛИ (НЕ КомплектацияАвтомобиля.Предопределенный) Тогда
			КомплектацияАвтомобиля=Неопределено;
		КонецЕсли; 
	//Иначе
	//	КомплектацияАвтомобиля=Неопределено;
	//КонецЕсли; 
	Если ВидРемонта<>КомплектацияАвтомобиля Тогда
		ОбязательныеРеквизиты.Вставить("Заказчик",1);
		Если ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
			ОбязательныеРеквизиты.Вставить("Контрагент",1);
			ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
		КонецЕсли; 
	КонецЕсли;
	ОбязательныеРеквизиты.Вставить("Состояние",1);
	ОбязательныеРеквизиты.Вставить("Автомобиль",1);
	ОбязательныеРеквизиты.Вставить("ДатаМашинозаезда",1);
	ОбязательныеРеквизиты.Вставить("ДатаСоздания",1);
	ОбязательныеРеквизиты.Вставить("Цех",1);
	Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		ОбязательныеРеквизиты.Вставить("ДатаНачала",1);
	КонецЕсли; 
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	ОбязательныеРеквизиты.Вставить("Работы",ОбязательныеРаботы);
	ОбязательныеРеквизиты.Вставить("Исполнители",ОбязательныеИсполнители);
	ОбязательныеРеквизиты.Вставить("МатериалыЗаказчика", ОбязательныеМатериалыЗаказчика);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации Или Не КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
		
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("Цех",КонтрольПоПодразделению);
			КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов",КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			КонтролируемыеРеквизитыСостава = Новый Структура();
			КонтролируемыеРеквизитыСостава.Вставить("СкладКомпании",КонтрольПоПодразделению);
			ТабличныеЧасти = Новый Структура();
			ТабличныеЧасти.Вставить("Товары",КонтролируемыеРеквизитыСостава);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыТабличныхЧастей",ТабличныеЧасти);
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;	
	КонецЕсли;	
	
	Результат = Результат И ПроверитьНаличиеМаркированногоМатериала(Ошибки);
	
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ЗаказНаряд","Заказ-наряд",Истина);
	
	Возврат СписокХозОпераций;
КонецФункции

// Процедура формирования отчета "РекомендацииПоАвтомобилям"
//
Процедура ОтчетРекомендацииПоАвтомобилям(ДатаНачала = Неопределено, ДатаКонца=Неопределено) Экспорт
	
	Если Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	#Если Клиент Тогда
	
	Отчет = Отчеты.РекомендацииПоАвтомобилям.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.ИсторияРекомендаций;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(?(ДатаКонца=Неопределено,КонецМесяца(ТекущаяДата()),ДатаКонца)));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",  НачалоДня(?(ДатаНачала=Неопределено,НачалоМесяца(ТекущаяДата()),ДатаНачала)));
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен", обПраво("ОсновнойТипЦенПродажиАвтомобилей"));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦенРабот",обПраво("ОсновнойТипЦенРабот"));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ВалютаОтчета", Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());
	
	СтруктураОтчета = НастройкиВарианта.Структура;
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаТиповРекомендации = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "ТипРекомендации");
	ГруппировкаСтатус    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаТиповРекомендации.Структура, "Статус");
	//ГруппировкаАвтомобиль     = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаСтатус.Структура, "Автомобиль");
	ГруппировкаРекомендация     = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаСтатус.Структура, "Рекомендация");

	ОтчетыСервер.КомпоновщикУстановитьОтбор(НастройкиВарианта, "Автомобиль", Ссылка.Автомобиль, ВидСравненияКомпоновкиДанных.Равно);


	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
	#КонецЕсли
	
КонецПроцедуры

// Получение данных о прослеживаемых товаров
//
// Параметры:
//  Объект	 - ДокументОбъект.ЗаказНаряд - Документ, на основании которого произошла операция с товаром
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Список прослеживаемых товаров
//
Функция ОперацииСПрослеживаемымиТоварами() Экспорт
	
	// TODO: На данный момент сделано только для формирования отчета об операциях
	
	// Получим таблицу для формирования данных по операции
	ТаблицаОперацииПрослеживаемости = ПрослеживаемостьТоваровСервер.ИнициализацияТаблицыОпераций();
	
	ОсвобождентОтНДС = ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
	
	// Проверим есть ли ставка НДС в документе
	ТаблицаНДС = Товары.Выгрузить();
	ТаблицаНДС.Свернуть("СтавкаНДС");
	ЕстьНДС = НЕ (ТаблицаНДС.Количество() = 1 И ТаблицаНДС[0].СтавкаНДС = Справочники.СтавкиНДС.БезНДС);
	
	// Операцию об отчете не выводим если есть ставка НДС в документе и организация плательщик НДС
	НеДляОтчетаОбОперациях = ЕстьНДС И НЕ ОсвобождентОтНДС;
	
	// Сформируем запрос из документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПередачаТовараВПроизводство) КАК КодОперации,
	|	ТоварыВПроизводстве.Номенклатура КАК Номенклатура,
	|	ТоварыВПроизводстве.ГТД КАК РНПТ,
	|	СУММА(ТоварыВПроизводстве.Количество) КАК КоличествоПрослеживаемости,
	|	СУММА(ТоварыВПроизводстве.Сумма - ТоварыВПроизводстве.СуммаНДС) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	|ГДЕ
	|	ТоварыВПроизводстве.Регистратор = &Ссылка
	|	И ТоварыВПроизводстве.ГТД.РНПТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВПроизводстве.Номенклатура,
	|	ТоварыВПроизводстве.ГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.РеализацияТоваров) КАК КодОперации,
	|	Продажи.Номенклатура КАК Номенклатура,
	|	Продажи.ГТД КАК РНПТ,
	|	СУММА(Продажи.Количество) КАК КоличествоПрослеживаемости,
	|	СУММА(Продажи.Сумма - Продажи.СуммаНДС) КАК СуммаБезНДС
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Ссылка
	|	И Продажи.ГТД.РНПТ
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура,
	|	Продажи.ГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаряд.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(ЗаказНаряд.ДатаЗакрытия, КВАРТАЛ) КАК ПериодОтчета,
	|	ЗНАЧЕНИЕ(Перечисление.ДокументыОтображенияОпераций.ОтчетОбОперациях) КАК ОтчетностьОперации,
	|	ЗаказНаряд.Ссылка КАК Документ,
	|	ЗаказНаряд.ДатаЗакрытия КАК ДатаДокумента,
	|	ЗаказНаряд.Номер КАК НомерДокумента,
	|	ЗаказНаряд.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДокументов.Другое) КАК ВидДокумента,
	|	ЗаказНаряд.ВидРемонта.ТипРемонта КАК ТипРемонта
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	// Проверим есть РНПТ у документа
	Если ПакетЗапросов[0].Пустой() Тогда
		Возврат ТаблицаОперацииПрослеживаемости;
	КонецЕсли;
	
	РНПТДокумента = ПакетЗапросов[0].Выгрузить();
	ПродажиРНПТ = ПакетЗапросов[1].Выгрузить();
	ШапкаДокумента = ПакетЗапросов[2].Выбрать();
	ШапкаДокумента.Следующий();
	НомерДокумента = дкПолучитьНомерДляПечати(ШапкаДокумента.Документ);
	ДляОтчетаОбОперациях = НЕ (НеДляОтчетаОбОперациях И ШапкаДокумента.ТипРемонта = Перечисления.ТипыРемонта.Платный);
	СтруктураПоиска = Новый Структура("Номенклатура,РНПТ");
	
	Для Каждого ТекущаяСтрока Из РНПТДокумента Цикл
		
		КоличествоТовара = ТекущаяСтрока.КоличествоПрослеживаемости;
		
		// Найдем товар в продажах для фиксации суммы продажи
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		СтрокиПродаж = ПродажиРНПТ.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПродаж.Количество() > 0 Тогда
			// Уменьшим количество по производству
			КоличествоТовара = КоличествоТовара - СтрокиПродаж[0].КоличествоПрослеживаемости;
			Если ДляОтчетаОбОперациях Тогда
				НоваяСтрока = ТаблицаОперацииПрослеживаемости.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ШапкаДокумента);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокиПродаж[0]);
				НоваяСтрока.НомерДокумента = НомерДокумента;
			КонецЕсли;
		КонецЕсли;
		
		// Остались материалы или не проданные товары клиенту
		Если КоличествоТовара > 0 Тогда
			НоваяСтрока = ТаблицаОперацииПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ШапкаДокумента);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.НомерДокумента = НомерДокумента;
			НоваяСтрока.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			Если КоличествоТовара <> ТекущаяСтрока.КоличествоПрослеживаемости Тогда
				НоваяСтрока.КоличествоПрослеживаемости = КоличествоТовара;
				НоваяСтрока.СуммаБезНДС = 
					Окр(НоваяСтрока.СуммаБезНДС / ТекущаяСтрока.КоличествоПрослеживаемости * КоличествоТовара, 2);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТаблицаОперацииПрослеживаемости;
	
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//РАСШИРЕНЫЙ ПЕРЕЧЕНЬ ПЕЧАТНЫХ ФОРМ

// Формирует печатную форму "Приложение1"
// Возвращает сформированный табличный документ:
Функция ПечатьПриложение1(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("Приложение1");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаТелефоны)) Тогда
		ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПричинаОбращения = ПричинаОбращения;
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = ""дд ММММ гггг 'г.'""");
	ОбластьМакета.Параметры.ТекВремя = Формат(ТекущаяДата(), "ДФ = ЧЧ.мм.сс");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "АктОсмотра"
// Возвращает сформированный табличный документ:
Функция ПечатьАктОсмотра(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("АктОсмотра");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаТелефоны)) Тогда
		ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);;
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска, ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
		
		СхемаТС = орПолучитьСхемуТС(Автомобиль.Модель,"СхемаТС");
		Если СхемаТС <> Неопределено Тогда
			ОбластьМакета.Рисунки.СхемаТС.Картинка = СхемаТС;				
			ОбластьМакета.Рисунки.СхемаТС.РазмерКартинки = РазмерКартинки.Пропорционально;
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = ""дд ММММ гггг 'г.'""");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;	
КонецФункции

// Формирует печатную форму "ЗаказНарядДоговор"
// Возвращает сформированный табличный документ:
Функция ПечатьЗаказНарядДоговор(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ЗаказНарядДоговор");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресПочтовый = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресПочтовый)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресПочтовый = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	КонецЕсли;
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаТелефоны)) Тогда
		ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);

	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
			
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли;
	
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
    ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод секции "Услуги" (общие условия договора)
	ОбластьМакета = Макет.ПолучитьОбласть("Услуги");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = ""дд ММММ гггг 'г.'""");
	ТабДокумент.Вывести(ОбластьМакета);

	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "АктПриема"
// Возвращает сформированный табличный документ:
Функция ПечатьАктПриема(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("АктПриема");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьМакета.Параметры.ФирмаНаименование = Организация.Наименование;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "СопроводительныйЛист"
// Возвращает сформированный табличный документ:
Функция ПечатьСопроводительныйЛист(ТабДокумент) Экспорт
	ВалютаПечатногоДокумента = зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаТоваров = Товары.Выгрузить();
	
	зфПерерасчетТаблицыТоваров(ТаблицаТоваров,ЭтотОбъект,ВалютаПечатногоДокумента);
	ТаблицаРабот=Работы.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
		
	Макет = ПолучитьМакет("СопроводительныйЛист");
		
	ЕстьСкидкаПоДеталям = Ложь;
	Если Товары.Итог("СуммаСкидки")<>0 ИЛИ Товары.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Товары.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоДеталям = Истина;
	КонецЕсли;
		
	ЕстьСкидкаПоРаботам = Ложь;
	Если Работы.Итог("СуммаСкидки")<>0 ИЛИ Работы.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Работы.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоРаботам = Истина;
	КонецЕсли;
		
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 10; //поле равно высоте колонтитулов
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	ОбластьСкидка      = Макет.Область("Скидка");
	ОбластьСкидкаРабот = Макет.Область("СкидкаРабот");
		
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");
		
	ОбластьСтрокаДеталей	            = Макет.ПолучитьОбласть("СтрокаДеталей");
    ОбластьСтрокаПримечаниеНоменклатура = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатура");
	ОбластьИтоговПоСтраницеДетали	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталей");
	ОбластьПодвалДеталей	            = Макет.ПолучитьОбласть("ПодвалДетали");
		
	ОбластьСтрокаУслуг		        = Макет.ПолучитьОбласть("СтрокаРабот");
    ОбластьСтрокаПримечаниеРаботы   = Макет.ПолучитьОбласть("СтрокаПримечаниеРаботы");
	ОбластьИтоговПоСтраницеУслуги	= Макет.ПолучитьОбласть("ИтогиПоСтраницеРабот");
	ОбластьПодвалУслуг		        = Макет.ПолучитьОбласть("ПодвалУслуги");
	
	ОбластьСписокОткрытыхЗН         = Макет.ПолучитьОбласть("СписокОткрытыхЗН");
	ОбластьСтрокаСписокОткрытыхЗН   = Макет.ПолучитьОбласть("СтрокаСписокОткрытыхЗН");
	ОбластьИтоговПоСтраницеСписокЗН = Макет.ПолучитьОбласть("ИтогиПоСтраницеСписокОткрытыхЗН");
	ОбластьПодвалСписокОткрытыхЗН   = Макет.ПолучитьОбласть("ПодвалСписокОткрытыхЗН");
	
	ОбластьШапкаМатериалов  = Макет.ПолучитьОбласть("ШапкаМатериалов");
	ОбластьСтрокаМатериалов = Макет.ПолучитьОбласть("СтрокаМатериалов");
	
	ОбластьШапкаИсполнителей  = Макет.ПолучитьОбласть("ШапкаИсполнителей");
	ОбластьСтрокаИсполнителей = Макет.ПолучитьОбласть("СтрокаИсполнителей");
		
	БезЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбычнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	// Настроем колонки вывода деталей если не было скидок
	Если Не ЕстьСкидкаПоДеталям Тогда
		ПоложениеШапкиДеталей = ОбластьДетали.Область("ШапкаДеталей").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 11 Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки,ПоложениеШапкиДеталей-1,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки-2,ПоложениеШапкиДеталей-1,ПозицияКолонки-2).Текст;
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки-2,ПоложениеШапкиДеталей,ПозицияКолонки-2).Текст;
				
			ОбластьИсточник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				
			ОбластьИсточник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				
			ОбластьИсточник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				
			ПозицияКолонки = ПозицияКолонки-2;
		КонецЦикла;
			
		ОбластьДетали.Область(ПоложениеШапкиДеталей-1, 4, ПоложениеШапкиДеталей-1, 11).Объединить();
		ОбластьДетали.Область(ПоложениеШапкиДеталей, 4, ПоложениеШапкиДеталей, 11).Объединить();
		ОбластьСтрокаДеталей.Область(1, 4, 1, 11).Объединить();
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 2, 1, 11);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		ТекОбласть.ГраницаСверху = ОбычнаяЛиния;
			
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 2, 1, 11);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 14, 1, 17);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 14, 1, 17);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 12, 1, 13);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 12, 1, 13);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		СчетчикКолонок = 6;
		Пока ПозицияКолонки <= ОбластьДетали.ШиринаТаблицы Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = СчетчикКолонок;
			ПозицияКолонки = ПозицияКолонки + 2;
			СчетчикКолонок = СчетчикКолонок + 1;
		КонецЦикла;
		
	КонецЕсли;
		
	ОбластьШапкаДеталей = ОбластьДетали.ПолучитьОбласть("ШапкаДеталей");
		
	// Настроем колонки вывода услуг если не было скидок
	Если Не ЕстьСкидкаПоРаботам Тогда
		ПоложениеШапкиУслуг = ОбластьУслуги.Область("ШапкаУслуг").Низ;
		ПозицияКолонки = ОбластьСкидкаРабот.Лево;
		Пока ПозицияКолонки > 11 Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки,ПоложениеШапкиУслуг-1,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки-2,ПоложениеШапкиУслуг-1,ПозицияКолонки-2).Текст;
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки-2,ПоложениеШапкиУслуг,ПозицияКолонки-2).Текст;
				
			ОбластьИсточник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			//ОбластьИсточник = ОбластьШапкаМатериалов.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			//ОбластьПриемник = ОбластьШапкаМатериалов.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			//ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			//ОбластьИсточник = ОбластьШапкаИсполнителей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			//ОбластьПриемник = ОбластьШапкаИсполнителей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			//ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			Если ОбластьИсточник.ПараметрРасшифровки = "Цех" Тогда
				ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки+1).Разъединить();
				ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки,1,ПозицияКолонки+4).Объединить();
				ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-1).Объединить();
			Иначе
				ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			КонецЕсли;
			
			ОбластьИсточник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				
			ОбластьИсточник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки-2,1,ПозицияКолонки-2);
			ОбластьПриемник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				
			ПозицияКолонки = ПозицияКолонки-2;
		КонецЦикла;
			
		//ОбластьУслуги.Область(ПоложениеШапкиУслуг-1, 6, ПоложениеШапкиУслуг-1, 9).Объединить();
		ОбластьУслуги.Область(ПоложениеШапкиУслуг-1, 4, ПоложениеШапкиУслуг-1, 12).Объединить();
		//ОбластьУслуги.Область(ПоложениеШапкиУслуг, 6, ПоложениеШапкиУслуг, 9).Объединить();
		ОбластьУслуги.Область(ПоложениеШапкиУслуг, 4, ПоложениеШапкиУслуг, 12).Объединить();
		//ОбластьСтрокаУслуг.Область(1, 6, 1, 9).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 12).Объединить();
		ОбластьСтрокаМатериалов.Область(1, 6, 1, 12).Объединить();
		ОбластьСтрокаИсполнителей.Область(1, 6, 1, 14).Объединить();
			
		//ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 2, 1, 9);
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 2, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		ТекОбласть.ГраницаСверху = ОбычнаяЛиния;
			
		//ТекОбласть = ОбластьПодвалУслуг.Область(1, 2, 1, 9);
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 2, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		//ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 11, 1, 13);
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 15, 1, 20);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
			
		//ТекОбласть = ОбластьПодвалУслуг.Область(1, 11, 1, 13);
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 15, 1, 20);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 13, 1, 14);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 13, 1, 14);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
			
		ПозицияКолонки = ОбластьСкидкаРабот.Лево;
		СчетчикКолонок = 7;
		Пока ПозицияКолонки <= ОбластьУслуги.ШиринаТаблицы Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = СчетчикКолонок;
			ПозицияКолонки = ПозицияКолонки + 2;
			СчетчикКолонок = СчетчикКолонок + 1;
		КонецЦикла;
	КонецЕсли;
		
	ОбластьШапкаУслуг = ОбластьУслуги.ПолучитьОбласть("ШапкаУслуг");
		
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	ВыводитьПроизводителя  = обПраво("ВыводитьПроизводителяВПечатныхФормах",Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Выводим шапку документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);;
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	//Автомобиль
	ОбластьМакета.Параметры.Автомобиль = Автомобиль;
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли;
	// Рисунки
	ОбластьМакета.Рисунки.Принят.Параметр = "Принят:
	|" + Формат(ДатаСоздания, "ДФ = дд.ММ.гггг") + " в " + Формат(ДатаСоздания, "ДФ = ЧЧ.мм.сс");
	ОбластьМакета.Рисунки.ВидРемонта.Параметр = "Вид ремонта:
	|" + ВидРемонта.Наименование;
	ОбластьМакета.Рисунки.ВидРемонта.Расшифровка = ВидРемонта;
	ОбластьМакета.Рисунки.Диспетчер.Параметр = "Диспетчер:
	|" + Диспетчер.Наименование;
	ОбластьМакета.Рисунки.Диспетчер.Расшифровка = Диспетчер;
	ОбластьМакета.Параметры.Валюта = ВалютаПечатногоДокумента;	
	// Вывод причины
	Если ПустаяСтрока(ПричинаОбращения) Тогда
		ТекОбласть = ОбластьМакета.Область(19, , 19, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 22;
	КонецЕсли;
	ОбластьМакета.Параметры.ПричинаОбращения = ПричинаОбращения;
	
	ТабДокумент.Вывести(ОбластьМакета);
		
	КолонкаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);
		
	//Инициализация итогов по документу
	ИтогоСуммаРабот			= 0;
	ИтогоСуммаСкидкиРабот	= 0;
	ИтогоКоличествоРабот	= 0;
	ИтогоСуммаДеталей		= 0;
	ИтогоСуммаСкидкиДеталей	= 0;
	ИтогоКоличествоДеталей	= 0;
		
	//Временная таблица
	Табл = ТаблицаРабот.Скопировать();
	Для ДопСтр = 1 по 10 Цикл
		Табл.Добавить();
	КонецЦикла;
	КоличествоРабот = Табл.Количество();
		
	//Вывод шапки табличной части работ(услуг)
	ОбластьУслуги.Параметры.НомерДок = НомерДляПечати;
	ОбластьУслуги.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ=дд.ММ.гггг");
	ОбластьУслуги.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
	ТабДокумент.Вывести(ОбластьУслуги);
		
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	ТекстЗаголовка = "Заявка на работы к заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаСоздания, "ДФ=дд.ММ.гггг");
		
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаУслуг.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	ОбластьШапкаУслуг.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		
	//Вывод табличной части работ
	Ном = 0;
	СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаСкидки, Количество", 0, 0, 0);
	МассивОбластиПодвала = Новый Массив;
	//МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
	МассивИсполнителей = Новый Массив;
	МассивМатериалов   = Новый Массив;
	Для каждого СтрокаРабот из Табл Цикл
		Ном = Ном + 1;
		
		МассивИсполнителей.Очистить();
		МассивМатериалов.Очистить();
		
		ОбластьСтрокаУслуг.Параметры.НомСтр = Ном;
		Если Ном > (КоличествоРабот-10) Тогда
			//выводим пустые строки
			ТекОбласть = ОбластьСтрокаУслуг.Область(1, , 1,);
			ТекОбласть.АвтовысотаСтроки = Ложь;
			ТекОбласть.ВысотаСтроки = 22;
			ОбластьСтрокаУслуг.Параметры.Код = "";
			ОбластьСтрокаУслуг.Параметры.Номенклатура = "";
			ОбластьСтрокаУслуг.Параметры.Наименование = "";
			ОбластьСтрокаУслуг.Параметры.Цена = "";
			ОбластьСтрокаУслуг.Параметры.Коэффициент = "";
			ОбластьСтрокаУслуг.Параметры.Количество = "";
			ОбластьСтрокаУслуг.Параметры.Единица = "";
			ОбластьСтрокаУслуг.Параметры.Сумма = "";
			//ОбластьСтрокаУслуг.Параметры.ДопИнформация = "";
			Если ЕстьСкидкаПоРаботам Тогда
				ОбластьСтрокаУслуг.Параметры.Скидка = "";
            КонецЕсли;
            Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
                ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
            КонецЕсли;
		Иначе
			//заполняем параметры
			ОбластьСтрокаУслуг.Параметры.Код = дкПолучитьЗначениеКолонкиКода(СтрокаРабот.Работа, ИмяРеквизитаКода, ЭтотОбъект);
			ОбластьСтрокаУслуг.Параметры.Номенклатура = СтрокаРабот.Работа;
			ОбластьСтрокаУслуг.Параметры.Наименование = спПолучитьНаименование(СтрокаРабот.Работа);
			ОбластьСтрокаУслуг.Параметры.Цена = Формат(СтрокаРабот.Цена,"ЧЦ=15; ЧДЦ=2");
			ОбластьСтрокаУслуг.Параметры.Коэффициент = Формат(СтрокаРабот.Коэффициент,"ЧЦ=10; ЧДЦ=3");
			ОбластьСтрокаУслуг.Параметры.Количество = Формат(СтрокаРабот.Количество, ФорматВыводаКоличества);
			ОбластьСтрокаУслуг.Параметры.Единица = СтрокаРабот.Нормочас;
			ОбластьСтрокаУслуг.Параметры.Сумма = Формат(СтрокаРабот.СуммаВсего, ФорматВыводаСуммы);
			//ПечДопИнф = "";
			//Для каждого ТекИсполнитель из Исполнители Цикл
			//	Если ТекИсполнитель.ИдентификаторРаботы = СтрокаРабот.ИдентификаторРаботы Тогда
			//		ПечДопИнф = ПечДопИнф + СокрЛП(ТекИсполнитель.Исполнитель.Наименование) + Символы.ПС;
			//	КонецЕсли;
			//КонецЦикла;
			//ОбластьСтрокаУслуг.Параметры.ДопИнформация = ПечДопИнф;
			
			МассивМатериалов   = Материалы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
			МассивИсполнителей = Исполнители.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
			
			Если ЕстьСкидкаПоРаботам Тогда
				ОбластьСтрокаУслуг.Параметры.Скидка = Формат(СтрокаРабот.СуммаСкидки+СтрокаРабот.СуммаСкидкиСтроки+СтрокаРабот.СуммаСкидкиБонусами, ФорматВыводаСуммы);
			КонецЕсли;
			Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
				ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
			КонецЕсли;
			//обновим итоги по документу
			ИтогоСуммаРабот = ИтогоСуммаРабот + СтрокаРабот.СуммаВсего;
			ИтогоСуммаСкидкиРабот = ИтогоСуммаСкидкиРабот + СтрокаРабот.СуммаСкидки + СтрокаРабот.СуммаСкидкиСтроки + СтрокаРабот.СуммаСкидкиБонусами;
			ИтогоКоличествоРабот = ИтогоКоличествоРабот + СтрокаРабот.Количество;
		КонецЕсли;
		
		МассивОбластиПодвала.Очистить();
		Если МассивМатериалов.Количество() > 0 Тогда
			ТабДокВрем = Новый ТабличныйДокумент;
			ТабДокВрем.ПолеСверху = 10;
			ТабДокВрем.ПолеСнизу  = 0;
			ТабДокВрем.ПолеСлева  = 0;
			ТабДокВрем.ПолеСправа = 0;
			ТабДокВрем.Вывести(ОбластьШапкаМатериалов);
			Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
				ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
				ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
				ТабДокВрем.Вывести(ОбластьСтрокаМатериалов);
			КонецЦикла;
			МассивОбластиПодвала.Добавить(ТабДокВрем);
		КонецЕсли;
		
		Если МассивИсполнителей.Количество() > 0 Тогда
			ТабДокВрем = Новый ТабличныйДокумент;
			ТабДокВрем.ПолеСверху = 10;
			ТабДокВрем.ПолеСнизу  = 0;
			ТабДокВрем.ПолеСлева  = 0;
			ТабДокВрем.ПолеСправа = 0;
			ТабДокВрем.Вывести(ОбластьШапкаИсполнителей);
			Для Каждого СтрокаИсполнителей Из МассивИсполнителей Цикл
				ОбластьСтрокаИсполнителей.Параметры.Заполнить(СтрокаИсполнителей);
				ОбластьСтрокаИсполнителей.Параметры.ИсполнительНаименование = Строка(СтрокаИсполнителей.Исполнитель);
				ОбластьСтрокаИсполнителей.Параметры.ЦехПредставление        = Строка(СтрокаИсполнителей.Цех);
				ОбластьСтрокаИсполнителей.Параметры.ПроцентУчастия          = Строка(СтрокаИсполнителей.Процент) + " %";
				ТабДокВрем.Вывести(ОбластьСтрокаИсполнителей);
			КонецЦикла;
			МассивОбластиПодвала.Добавить(ТабДокВрем);
		КонецЕсли;
		
		Если Ном = КоличествоРабот Тогда
			МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
		КонецЕсли;
			
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаУслуг, ОбластьШапкаУслуг, ОбластьИтоговПоСтраницеУслуги, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, МассивОбластиПодвала);
		
		Если МассивМатериалов.Количество() > 0 Тогда
			
			ТабДокумент.Вывести(ОбластьШапкаМатериалов);
			Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
				ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
				ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
				ТабДокумент.Вывести(ОбластьСтрокаМатериалов);
			КонецЦикла;
			
		КонецЕсли;
		
		Если МассивИсполнителей.Количество() > 0 Тогда
			
			ТабДокумент.Вывести(ОбластьШапкаИсполнителей);
			Для Каждого СтрокаИсполнителей Из МассивИсполнителей Цикл
				ОбластьСтрокаИсполнителей.Параметры.Заполнить(СтрокаИсполнителей);
				ОбластьСтрокаИсполнителей.Параметры.ИсполнительНаименование = Строка(СтрокаИсполнителей.Исполнитель);
				ОбластьСтрокаИсполнителей.Параметры.ЦехПредставление        = Строка(СтрокаИсполнителей.Цех);
				ОбластьСтрокаИсполнителей.Параметры.ПроцентУчастия          = Строка(СтрокаИсполнителей.Процент) + " %";
				ТабДокумент.Вывести(ОбластьСтрокаИсполнителей);
			КонецЦикла;
			
		КонецЕсли;
		
		Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
			дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеРаботы);	
		КонецЕсли;
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаСкидки, Количество", 0, 0, 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
			
		//обновим итоги по странице
		дкДобавитьИтогиПоСтранице(СтрокаРабот, СтруктураИтоговПоСтранице);
			
	КонецЦикла;
	//довыводим последний итог по странице, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеУслуги, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
		
	//Вывод подвала табличной части услуг
	ОбластьПодвалУслуг.Параметры.Сумма = Формат(ИтогоСуммаРабот, ФорматВыводаСуммы);
	Если ЕстьСкидкаПоРаботам Тогда
		ОбластьПодвалУслуг.Параметры.Скидка = Формат(ИтогоСуммаСкидкиРабот, ФорматВыводаСуммы);
	КонецЕсли;
	ОбластьПодвалУслуг.Параметры.Количество = Формат(ИтогоКоличествоРабот, ФорматВыводаКоличества);
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалУслуг, , , НомерСтраницы, , ЭтотОбъект);
		
	//Временная таблица товаров
	Табл = ТаблицаТоваров.Скопировать();
	ТаблТовары = ТаблицаТоваров.Скопировать();
	Для ТекСтр = 1 по 10 Цикл             
		ТаблТовары.Добавить();
	КонецЦикла;
	КоличествоДеталей = ТаблТовары.Количество();
		
	//Вывод шапки табличной части деталей
	ОбластьДетали.Параметры.НомерДок = НомерДляПечати;
	ОбластьДетали.Параметры.ДатаДок  = Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
	ОбластьДетали.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		
	//Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
	ТабДокВрем = Новый ТабличныйДокумент;
	ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
	ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
	ТабДокВрем.Вывести(ОбластьДетали);
	ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
	СтрокаДеталей = ТаблТовары[0];
	ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
	Если КоличествоДеталей = 10 Тогда
		//присутствуют только пустые строки
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 22;
	Иначе
		//присутствуют заполненные строки (заполняем не все параметры - только наиболее вероятно длинные)
		ТекТовар = СтрокаДеталей.Номенклатура;
		ОбластьМакетаСтрокаВрем.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекТовар,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя);
		ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
	КонецЕсли;
	ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
	ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДетали);
	Попытка
		Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	Исключение
	КонецПопытки;
	ТабДокумент.Вывести(ОбластьДетали);
		
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	ТекстЗаголовка = "Расходная накладная к заказ-наряду №  "+НомерДляПечати+" от "+Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
		
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаДеталей.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	ОбластьШапкаДеталей.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		
	//Вывод табличной части деталей
	Ном = 0;
	СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаСкидки, Количество", 0, 0, 0);
		
	МассивОбластиПодвала = Новый Массив;
	МассивОбластиПодвала.Добавить(ОбластьПодвалДеталей);
	Для каждого СтрокаДеталей из ТаблТовары Цикл
		Ном = Ном + 1;
			
		ОбластьСтрокаДеталей.Параметры.НомСтр = Ном;
		Если Ном > (КоличествоДеталей-10) Тогда
			//установим для пустой строки высоту, равную двум строкам. Параметры не заполняем
			ТекОбласть = ОбластьСтрокаДеталей.Область(1, , 1,);
			ТекОбласть.АвтовысотаСтроки = Ложь;
			ТекОбласть.ВысотаСтроки = 22;
			ОбластьСтрокаДеталей.Параметры.Код = "";
			ОбластьСтрокаДеталей.Параметры.Номенклатура = "";
			ОбластьСтрокаДеталей.Параметры.Наименование = "";
			ОбластьСтрокаДеталей.Параметры.Цена = "";
			ОбластьСтрокаДеталей.Параметры.Количество = "";
			ОбластьСтрокаДеталей.Параметры.Единица = "";
			ОбластьСтрокаДеталей.Параметры.Сумма = "";
			Если ЕстьСкидкаПоДеталям Тогда
				ОбластьСтрокаДеталей.Параметры.Скидка = "";
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.ДопИнформация = "";
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
            КонецЕсли;
		Иначе
			//заполняем параметры
			ТекНоменклатура = СтрокаДеталей.Номенклатура;
			ОбластьСтрокаДеталей.Параметры.Код = дкПолучитьЗначениеКолонкиКода(СтрокаДеталей.Номенклатура,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя);
			ОбластьСтрокаДеталей.Параметры.Номенклатура = СтрокаДеталей.Номенклатура;
			ОбластьСтрокаДеталей.Параметры.Наименование = спПолучитьНаименование(СтрокаДеталей.Номенклатура);
			ОбластьСтрокаДеталей.Параметры.Цена = Формат(СтрокаДеталей.Цена,"ЧЦ=15; ЧДЦ=2");
			ОбластьСтрокаДеталей.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
			ОбластьСтрокаДеталей.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
			ОбластьСтрокаДеталей.Параметры.Сумма = Формат(СтрокаДеталей.СуммаВсего, ФорматВыводаСуммы);
			Если ЕстьСкидкаПоДеталям Тогда
				ОбластьСтрокаДеталей.Параметры.Скидка = Формат(СтрокаДеталей.СуммаСкидки+СтрокаДеталей.СуммаСкидкиСтроки+СтрокаДеталей.СуммаСкидкиБонусами, ФорматВыводаСуммы);
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.ДопИнформация = СокрП(СтрокаДеталей.СкладКомпании.Наименование);
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
            КонецЕсли;
			// Обновим итоги по документу
			ИтогоСуммаДеталей = ИтогоСуммаДеталей + СтрокаДеталей.СуммаВсего;
			ИтогоСуммаСкидкиДеталей	= ИтогоСуммаСкидкиДеталей + СтрокаДеталей.СуммаСкидки + СтрокаДеталей.СуммаСкидкиСтроки + СтрокаДеталей.СуммаСкидкиБонусами;
			ИтогоКоличествоДеталей = ИтогоКоличествоДеталей + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
		КонецЕсли;
			
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталей, ОбластьШапкаДеталей, ОбластьИтоговПоСтраницеДетали, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоДеталей, МассивОбластиПодвала, Неопределено));
        Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
            дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатура);	
        КонецЕсли;	
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаСкидки, Количество", 0, 0, 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
			
		//обновим итоги по странице
		//СтруктураИтоговПоСтранице.Количество  = СтруктураИтоговПоСтранице.Количество  
		//+ СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
		//СтруктураИтоговПоСтранице.СуммаВсего  = СтруктураИтоговПоСтранице.СуммаВсего  + СтрокаДеталей.СуммаВсего;
		//СтруктураИтоговПоСтранице.СуммаСкидки = СтруктураИтоговПоСтранице.СуммаСкидки + СтрокаДеталей.СуммаСкидки
		//+ СтрокаДеталей.СуммаСкидкиСтроки;
		дкДобавитьИтогиПоСтранице(СтрокаДеталей, СтруктураИтоговПоСтранице);
	КонецЦикла;
	//довыводим последний итог по странице, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДетали, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
		
	//Вывод подвала табличной части деталей
	ОбластьПодвалДеталей.Параметры.Сумма = Формат(ИтогоСуммаДеталей, ФорматВыводаСуммы);
	ОбластьПодвалДеталей.Параметры.Количество = Формат(ИтогоКоличествоДеталей, ФорматВыводаКоличества);
	Если ЕстьСкидкаПоДеталям Тогда
		ОбластьПодвалДеталей.Параметры.Скидка = Формат(ИтогоСуммаСкидкиДеталей, ФорматВыводаСуммы);
	КонецЕсли;
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталей, , , НомерСтраницы, , ЭтотОбъект);
	
	// Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Сумма = Формат(ИтогоСуммаРабот+ИтогоСуммаДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = ""дд ММММ гггг 'г.'""");
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);
		
	// Верхние колонтитулы
	ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
	ТабДокумент.ВерхнийКолонтитул.Выводить=Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница=2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа="Заказ-наряд № " + Номер + " от " + Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
	ТабДокумент.ВерхнийКолонтитул.Шрифт=Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТабицаЗаказНаряд.Номер,
	|	ТабицаЗаказНаряд.ВидРемонта,
	|	ТабицаЗаказНаряд.Состояние,
	|	ТабицаЗаказНаряд.ДатаСоздания,
	|	ТабицаЗаказНаряд.Ссылка КАК ЗаказНаряд
	|ИЗ
	|	Документ.ЗаказНаряд КАК ТабицаЗаказНаряд
	|ГДЕ
	|	ТабицаЗаказНаряд.Автомобиль = &Автомобиль И 
	|	((НЕ ТабицаЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)) И 
	|	(НЕ ТабицаЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))) И 
	|	ТабицаЗаказНаряд.ПометкаУдаления = ЛОЖЬ И 
	|	(НЕ ТабицаЗаказНаряд.Ссылка = &Ссылка)");
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаЗН = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗН.Количество() > 0 Тогда
		
		//Вывод шапки табличной части деталей
		ОбластьСписокОткрытыхЗН.Параметры.Автомобиль             = Автомобиль;
		ОбластьСписокОткрытыхЗН.Параметры.АвтомобильПредставление = СокрЛП(Автомобиль);
		
		//Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		ТабДокВрем = Новый ТабличныйДокумент;
		ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
		ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
		ТабДокВрем.Вывести(ОбластьСписокОткрытыхЗН);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаСписокОткрытыхЗН");
		
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		ОбластьМакетаСтрокаВрем.Параметры.Заполнить(ТаблицаЗН[0]);
		
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеСписокЗН);
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Исключение
		КонецПопытки;
		ТабДокумент.Вывести(ОбластьСписокОткрытыхЗН);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Список заказ-нарядов по " + СокрЛП(Автомобиль);
		
		ОбластьШапкаСписокОткрытыхЗН = ОбластьСписокОткрытыхЗН.ПолучитьОбласть("ШапкаСписокОткрытыхЗН");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаСписокОткрытыхЗН.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаСписокОткрытыхЗН.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
		СтруктураИтоговПоСтранице = Новый Структура;
		
		КоличествоЗН = ТаблицаЗН.Количество();
		
		//Вывод табличной части открытые заказ-наряды
		Ном = 0;
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалСписокОткрытыхЗН);
		Для каждого СтрокаЗН из ТаблицаЗН Цикл
			Ном = Ном + 1;
			
			ОбластьСтрокаСписокОткрытыхЗН.Параметры.Заполнить(СтрокаЗН);
			ОбластьСтрокаСписокОткрытыхЗН.Параметры.НомСтр = Ном;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаСписокОткрытыхЗН, ОбластьШапкаСписокОткрытыхЗН, ОбластьИтоговПоСтраницеСписокЗН, НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(Ном=КоличествоЗН, МассивОбластиПодвала, Неопределено));
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаСписокОткрытыхЗН.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
			
		КонецЦикла;
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеСписокЗН, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
		
		//Вывод подвала табличной части деталей
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалСписокОткрытыхЗН, , , НомерСтраницы, , ЭтотОбъект);
	КонецЕсли;
		
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "ЗаявкаНаДетали"
// Возвращает сформированный табличный документ:
Функция ПечатьЗаявкаНаДетали(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ЗаявкаНаДетали");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаТелефоны)) Тогда
		ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);;
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
	
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = Заказчик.НаименованиеПолное;
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = Контрагент.НаименованиеПолное;
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = ""дд ММММ гггг 'г.'""");
	ОбластьМакета.Параметры.ТекВремя = Формат(ТекущаяДата(), "ДФ = ЧЧ.мм.сс");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "Квитанция"
// Возвращает сформированный табличный документ:
Функция ПечатьКвитанция(ТабДокумент) Экспорт
	
	ДатаНаПечать = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),ДатаСоздания,ДатаЗакрытия);
	
	Если Ссылка.Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		//Контроль запрета печати без закрытия
		Если НЕ обПраво("ПечатьЗаказНарядаБезЗакрытия",Права,,ЭтотОбъект) Тогда
			Сообщить("Печать квитанции заказ-наряда без его закрытия запрещена.");
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	//Контроль запрета печати при наличии открытых заказ-нарядов
	Если НЕ обПраво("ПечатьЗаказНарядаПриНаличииОткрытых",Права,,ЭтотОбъект) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказНаряд.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт) И
		|	ЗаказНаряд.ПометкаУдаления = ЛОЖЬ И
		|	ЗаказНаряд.Заказчик = &Заказчик И
		|	ЗаказНаряд.Ссылка <> &ЭтотДокумент";
		Запрос.УстановитьПараметр("Заказчик",Заказчик);
		Запрос.УстановитьПараметр("ЭтотДокумент",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество>0 Тогда
				Сообщить("Печать квитанции заказ-наряда заказчика "+Заказчик.НаименованиеПолное+" запрещено, так как у него имеются другие открытые заказ-наряды.");
				Возврат Неопределено;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
		
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаТоваров=Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаТоваров,ЭтотОбъект,ВалютаПечатногоДокумента);
	ТаблицаРабот=Работы.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
	
	ВыводитьКод = обПраво("ВыводитьКодВПечатныхФормах",Права,ЭтотОбъект);
	ВыводитьПроизводителя = обПраво("ВыводитьПроизводителяВПечатныхФормах",Права,,ЭтотОбъект);
	Макет = ПолучитьМакет("Квитанция");
	
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 10; //поле равно высоте колонтитулов
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		
	ЕстьСкидкаПоДеталям = Ложь;
	Если Товары.Итог("СуммаСкидки")<>0 ИЛИ Товары.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Товары.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоДеталям = Истина;
	КонецЕсли;
		
	ЕстьСкидкаПоРаботам = Ложь;
	Если Работы.Итог("СуммаСкидки")<>0 ИЛИ Работы.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Работы.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоРаботам = Истина;
	КонецЕсли;
		
	ОбластьСкидка = Макет.Область("Скидка");
		
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");
		
	ОбластьСтрокаДеталей	            = Макет.ПолучитьОбласть("СтрокаДеталей");
    ОбластьСтрокаПримечаниеНоменклатура = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатура");
	ОбластьИтоговПоСтраницеДетали	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталей");
	ОбластьПодвалДеталей	            = Макет.ПолучитьОбласть("ПодвалДетали");
	
	ОбластьШапкаДеталейКлиента				    = Макет.ПолучитьОбласть("ШапкаДеталейКлиента");
	ОбластьСтрокаПримечаниеНоменклатураКлиента  = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатураКлиента");
	ОбластьСтрокаДеталейКлиента				    = Макет.ПолучитьОбласть("СтрокаДеталейКлиента");
	ОбластьИтоговПоСтраницеДеталиКлиента	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталейКлиента");
	ОбластьПодвалДеталейКлиента 			    = Макет.ПолучитьОбласть("ПодвалКлиента");
	
	ОбластьСтрокаУслуг		        = Макет.ПолучитьОбласть("СтрокаРабот");
    ОбластьСтрокаПримечаниеРаботы   = Макет.ПолучитьОбласть("СтрокаПримечаниеРаботы");
	ОбластьИтоговПоСтраницеУслуги	= Макет.ПолучитьОбласть("ИтогиПоСтраницеРабот");
	ОбластьПодвалУслуг		        = Макет.ПолучитьОбласть("ПодвалУслуги");
	
	БезЛинии 		= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбычнаяЛиния	= Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	// Настроем колонки вывода деталей если не было скидок
	Если Не ЕстьСкидкаПоДеталям Тогда
		ПоложениеШапкиДеталей = ОбластьДетали.Область("ШапкаДеталей").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 6 Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки,ПоложениеШапкиДеталей-1,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки-1,ПоложениеШапкиДеталей-1,ПозицияКолонки-1).Текст;
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки-1,ПоложениеШапкиДеталей,ПозицияКолонки-1).Текст;
				
			ОбластьИсточник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ОбластьИсточник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ОбластьИсточник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
			
		ОбластьДетали.Область(ПоложениеШапкиДеталей-1, 4, ПоложениеШапкиДеталей-1, 6).Объединить();
		ОбластьДетали.Область(ПоложениеШапкиДеталей, 4, ПоложениеШапкиДеталей, 6).Объединить();
		ОбластьСтрокаДеталей.Область(1, 4, 1, 6).Объединить();
			
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 2, 1, 6);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 2, 1, 6);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 8, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
			
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 8, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
			
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		Пока ПозицияКолонки <= ОбластьДетали.ШиринаТаблицы Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ПозицияКолонки-3;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
		
	// Настроем колонки вывода услуг если не было скидок
	Если Не ЕстьСкидкаПоРаботам Тогда
		ПоложениеШапкиУслуг = ОбластьУслуги.Область("ШапкаУслуг").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 5 Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки,ПоложениеШапкиУслуг-1,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки-1,ПоложениеШапкиУслуг-1,ПозицияКолонки-1).Текст;
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки-1,ПоложениеШапкиУслуг,ПозицияКолонки-1).Текст;
				
			ОбластьИсточник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ОбластьИсточник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ОбластьИсточник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ОбластьПриемник.Текст 		= ОбластьИсточник.Текст;
			ОбластьПриемник.Заполнение	= ОбластьИсточник.Заполнение;
			ОбластьПриемник.Параметр	= ОбластьИсточник.Параметр;
				
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
			
		ОбластьУслуги.Область(ПоложениеШапкиУслуг-1, 4, ПоложениеШапкиУслуг-1, 5).Объединить();
		ОбластьУслуги.Область(ПоложениеШапкиУслуг, 4, ПоложениеШапкиУслуг, 5).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 5).Объединить();
			
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 2, 1, 5);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 2, 1, 5);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
			
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 7, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
			
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 7, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
			
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		Пока ПозицияКолонки <= ОбластьУслуги.ШиринаТаблицы Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ПозицияКолонки-2;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ВыводитьКод Тогда
		ВремОбластьДетали=ОбластьУслуги.Область(4,4,4,4).Текст;
		ОбластьУслуги.Область(4,3,4,4).Объединить();
		ОбластьУслуги.Область(5,3,5,4).Объединить();
		ОбластьУслуги.Область(4,3,4,4).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьУслуги.Область(4,3,4,3).Текст=ВремОбластьДетали;

		ОбластьСтрокаУслуг.Область(1,3,1,4).Объединить();
		ОбластьСтрокаУслуг.Область(1,3,1,4).Параметр=ВремОбластьДетали;
		ОбластьСтрокаУслуг.Область(1,3,1,4).ПараметрРасшифровки="Номенклатура";
		
		ВремОбластьДетали=ОбластьДетали.Область(4,4,4,4).Текст;
		ОбластьДетали.Область(4,3,4,5).Объединить();
		ОбластьДетали.Область(5,3,5,5).Объединить();
		ОбластьДетали.Область(4,3,4,5).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьДетали.Область(4,3,4,3).Текст=ВремОбластьДетали;
		
		ОбластьСтрокаДеталей.Область(1,3,1,5).Объединить();
		ОбластьСтрокаДеталей.Область(1,3,1,3).Параметр=ВремОбластьДетали;
		ОбластьСтрокаДеталей.Область(1,3,1,3).ПараметрРасшифровки="Номенклатура";
		
		Ном=3;
		Для Сч=4 По 11 Цикл
			Если обЗначениеНеЗаполнено(ОбластьДетали.Область(5,Сч+1,5,Сч+1).Текст) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьДетали.Область(5,Сч+1,5,Сч+1).Текст=Ном;
			Ном=Ном+1;
		КонецЦикла;
		
		Ном=3;
		Для Сч=4 По 10 Цикл
			Если обЗначениеНеЗаполнено(ОбластьУслуги.Область(5,Сч+1,5,Сч+1).Текст) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьУслуги.Область(5,Сч+1,5,Сч+1).Текст=Ном;
			Ном=Ном+1;
		КонецЦикла;
	КонецЕсли;
	ОбластьШапкаДеталей = ОбластьДетали.ПолучитьОбласть("ШапкаДеталей");
	ОбластьШапкаУслуг = ОбластьУслуги.ПолучитьОбласть("ШапкаУслуг");
		
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	// Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаНаПечать, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);;
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
		
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли;
	ОбластьМакета.Параметры.Автомобиль = Автомобиль;
	ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
	ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
	ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		
	ОбластьМакета.Рисунки.Принят.Параметр = "Принят:
	|" + Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Рисунки.ВидРемонта.Параметр = "Вид ремонта:
	|" + ВидРемонта.Наименование;
	ОбластьМакета.Рисунки.ВидРемонта.Расшифровка = ВидРемонта;
	ОбластьМакета.Рисунки.Диспетчер.Параметр = "Диспетчер:
	|" + Диспетчер.Наименование;
	ОбластьМакета.Рисунки.Диспетчер.Расшифровка = Диспетчер;
	ОбластьМакета.Рисунки.СрокИсполнения.Параметр = "Срок исполнения:
	|" + Формат(ДатаОкончания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Рисунки.Состояние.Параметр = Состояние;
	ОбластьМакета.Параметры.Валюта = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
		
	КолонкаКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);
		
	//Временная таблица
	Табл = ТаблицаРабот.Скопировать();
	КоличествоРабот = Табл.Количество();
		
	//инициализация итогов по документу
	ИтогоСуммаРабот	       = 0;
	ИтогоКоличествоРабот   = 0;
	ИтогоСуммаНДСРабот     = 0;
	ИтогоСуммаСкидкиРабот  = 0;
	ИтогоСуммаДеталей	   = 0;
	ИтогоКоличествоДеталей = 0;
	ИтогоСуммаНДСДеталей   = 0;
	ИтогоСуммаСкидкиДеталей  = 0;
	ИтогоКоличествоДеталейКлиента = 0;
		
	НомерСтраницы = 1;
	НомерСтраницыПред = 1;
		
	Если КоличествоРабот = 0 Тогда
		//не выводим
	Иначе
		//Вывод шапки табличной части работ(услуг)
		Если ВыводитьКод Тогда
			ОбластьУслуги.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ОбластьУслуги.Параметры.НомерДок = НомерДляПечати;
		ОбластьУслуги.Параметры.ДатаДок = Формат(ДатаНаПечать, "ДФ=дд.ММ.гггг");
		ТабДокумент.Вывести(ОбластьУслуги);
			
		//Вывод табличной части работ(услуг)
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Выполненные работы по заказ-наряду №  "+НомерДляПечати+" от "+Формат(ДатаНаПечать, "ДФ=дд.ММ.гггг");
			
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаУслуг.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаУслуг.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части работ
		Ном	= 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
			
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
			
		Для каждого СтрокаРабот Из Табл Цикл
			Ном = Ном + 1;
				
			ОбластьСтрокаУслуг.Параметры.НомСтр = Ном;
			Если ВыводитьКод Тогда
				ОбластьСтрокаУслуг.Параметры.Код = дкПолучитьЗначениеКолонкиКода(СтрокаРабот.Работа,ИмяРеквизитаКода,ЭтотОбъект);
			КонецЕсли;
			ОбластьСтрокаУслуг.Параметры.Номенклатура = СтрокаРабот.Работа;
			ОбластьСтрокаУслуг.Параметры.Наименование = спПолучитьНаименование(СтрокаРабот.Работа);
			ОбластьСтрокаУслуг.Параметры.Цена = Формат(СтрокаРабот.Цена, "ЧЦ=15; ЧДЦ=2");
			ОбластьСтрокаУслуг.Параметры.Коэффициент = Формат(СтрокаРабот.Коэффициент, "ЧЦ=10; ЧДЦ=3");
			ОбластьСтрокаУслуг.Параметры.Количество = Формат(СтрокаРабот.Количество, ФорматВыводаКоличества);
			ОбластьСтрокаУслуг.Параметры.Единица = СтрокаРабот.Нормочас;
			ОбластьСтрокаУслуг.Параметры.Сумма = Формат(СтрокаРабот.СуммаВсего, ФорматВыводаСуммы);
			ОбластьСтрокаУслуг.Параметры.НДС = Формат(СтрокаРабот.СуммаНДС, ФорматВыводаСуммы);
			Если ЕстьСкидкаПоРаботам Тогда
				ОбластьСтрокаУслуг.Параметры.Скидка = Формат(СтрокаРабот.СуммаСкидки+СтрокаРабот.СуммаСкидкиСтроки+СтрокаРабот.СуммаСкидкиБонусами, ФорматВыводаСуммы);
            КонецЕсли;
            Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
                ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
            КонецЕсли;
			//обновим итоги по документу
			ИтогоСуммаРабот = ИтогоСуммаРабот + СтрокаРабот.СуммаВсего;
			ИтогоКоличествоРабот = ИтогоКоличествоРабот + СтрокаРабот.Количество;
			ИтогоСуммаНДСРабот = ИтогоСуммаНДСРабот + СтрокаРабот.СуммаНДС;
			ИтогоСуммаСкидкиРабот = ИтогоСуммаСкидкиРабот + СтрокаРабот.СуммаСкидки + СтрокаРабот.СуммаСкидкиСтроки + СтрокаРабот.СуммаСкидкиБонусами;
				
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаУслуг, ОбластьШапкаУслуг, ОбластьИтоговПоСтраницеУслуги, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоРабот, МассивОбластиПодвала, Неопределено));
            Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
                дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеРаботы);	
            КонецЕсли;	
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
				
			//обновим итоги по странице
			дкДобавитьИтогиПоСтранице(СтрокаРабот, СтруктураИтоговПоСтранице);
		КонецЦикла; 
			
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеУслуги, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
			
		//Вывод подвала табличной части работ(услуг)
		ОбластьПодвалУслуг.Параметры.Количество = Формат(ИтогоКоличествоРабот, ФорматВыводаКоличества);
		ОбластьПодвалУслуг.Параметры.Сумма = Формат(ИтогоСуммаРабот, ФорматВыводаСуммы);
		ОбластьПодвалУслуг.Параметры.СуммаНДС = Формат(ИтогоСуммаНДСРабот, ФорматВыводаСуммы);
		ОбластьПодвалУслуг.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаРабот, ВалютаПечатногоДокумента);
		Если ЕстьСкидкаПоРаботам Тогда
			ОбластьПодвалУслуг.Параметры.Скидка = Формат(ИтогоСуммаСкидкиРабот, ФорматВыводаСуммы);
		КонецЕсли;
		Если ИтогоСуммаНДСРабот <> 0 Тогда
			ОбластьПодвалУслуг.Параметры.ЧислоПрописью = ОбластьПодвалУслуг.Параметры.ЧислоПрописью + " в т.ч. НДС " + Формат(ИтогоСуммаНДСРабот, ФорматВыводаСуммы) + " " + ВалютаПечатногоДокумента;
		КонецЕсли; 
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалУслуг, , , НомерСтраницы, , ЭтотОбъект);
	КонецЕсли;
		
	//Формирование врем. таблицы товаров
	Табл = ТаблицаТоваров.Скопировать();
	ТаблТовары = ТаблицаТоваров.Скопировать();
	КоличествоДеталей = ТаблТовары.Количество();
		
	НомерСтраницы = 1;
	НомерСтраницыПред = 1;
		
	Если КоличествоДеталей = 0 Тогда
		//не выводим
	Иначе
		//Вывод шапки табличной части деталей
		Если ВыводитьКод Тогда 
			ОбластьДетали.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ОбластьДетали.Параметры.НомерДок = НомерДляПечати;
		ОбластьДетали.Параметры.ДатаДок = Формат(ДатаНаПечать, "ДФ=дд.ММ.гггг");
		//Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		ТабДокВрем = Новый ТабличныйДокумент;
		ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
		ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
		ТабДокВрем.Вывести(ОбластьДетали);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТовары[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		//присутствуют заполненные строки (заполняем не все параметры - только наиболее вероятно длинные)
		ТекТовар = СтрокаДеталей.Номенклатура;
		Если ВыводитьКод Тогда
			ОбластьМакетаСтрокаВрем.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекТовар,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя);
		КонецЕсли;
		ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДетали);
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				НомерСтраницы = НомерСтраницы + 1;
				НомерСтраницыПред = НомерСтраницы;
			КонецЕсли;
		Исключение
		КонецПопытки;
		ТабДокумент.Вывести(ОбластьДетали);
			
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Расходная накладная к заказ-наряду №  "+НомерДляПечати+" от "+Формат(ДатаНаПечать, "ДФ = дд.ММ.гггг");
			
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталей.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталей.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части деталей
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
			
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалДеталей);
			
		Для каждого СтрокаДеталей из ТаблТовары Цикл
			Ном = Ном + 1;
			ОбластьСтрокаДеталей.Параметры.НомСтр = Ном;
			ТекНоменклатура = СтрокаДеталей.Номенклатура;
			Если ВыводитьКод Тогда
				ОбластьСтрокаДеталей.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекНоменклатура,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя);
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.Номенклатура = ТекНоменклатура;
			ОбластьСтрокаДеталей.Параметры.Наименование = спПолучитьНаименование(ТекНоменклатура);
			ОбластьСтрокаДеталей.Параметры.Цена = Формат(СтрокаДеталей.Цена, "ЧЦ=15; ЧДЦ=2");
			ОбластьСтрокаДеталей.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
			ОбластьСтрокаДеталей.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
			ОбластьСтрокаДеталей.Параметры.Сумма = Формат(СтрокаДеталей.СуммаВсего, ФорматВыводаСуммы);
			Если ЕстьСкидкаПоДеталям Тогда
				ОбластьСтрокаДеталей.Параметры.Скидка = Формат(СтрокаДеталей.СуммаСкидки+СтрокаДеталей.СуммаСкидкиСтроки + СтрокаДеталей.СуммаСкидкиБонусами, ФорматВыводаСуммы);
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.НДС = Формат(СтрокаДеталей.СуммаНДС, ФорматВыводаСуммы);
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
            КонецЕсли;
			// Обновим итоги по документу
			ИтогоСуммаДеталей      = ИтогоСуммаДеталей + СтрокаДеталей.СуммаВсего;
			ИтогоКоличествоДеталей = ИтогоКоличествоДеталей + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			ИтогоСуммаСкидкиДеталей	= ИтогоСуммаСкидкиДеталей + СтрокаДеталей.СуммаСкидки + СтрокаДеталей.СуммаСкидкиСтроки + СтрокаДеталей.СуммаСкидкиБонусами;
			ИтогоСуммаНДСДеталей   = ИтогоСуммаНДСДеталей + СтрокаДеталей.СуммаНДС;
				
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталей, ОбластьШапкаДеталей, ОбластьИтоговПоСтраницеДетали, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоДеталей, МассивОбластиПодвала, Неопределено));
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатура);	
            КонецЕсли;	
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
				
			//обновим итоги по странице
			//СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + СтрокаДеталей.СуммаВсего;
			//СтруктураИтоговПоСтранице.СуммаНДС   = СтруктураИтоговПоСтранице.СуммаНДС + СтрокаДеталей.СуммаНДС;
			//СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество
			//+ СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			//СтруктураИтоговПоСтранице.СуммаСкидки = СтруктураИтоговПоСтранице.СуммаСкидки + СтрокаДеталей.СуммаСкидки;
			дкДобавитьИтогиПоСтранице(СтрокаДеталей, СтруктураИтоговПоСтранице);
		КонецЦикла;
			
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДетали, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
			
		//Вывод подвала табличной части деталей
		ОбластьПодвалДеталей.Параметры.Количество = Формат(ИтогоКоличествоДеталей, ФорматВыводаКоличества);
		ОбластьПодвалДеталей.Параметры.Сумма = Формат(ИтогоСуммаДеталей, ФорматВыводаСуммы);
		Если ЕстьСкидкаПоДеталям Тогда
			ОбластьПодвалДеталей.Параметры.Скидка = Формат(ИтогоСуммаСкидкиДеталей, ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьПодвалДеталей.Параметры.СуммаНДС = Формат(ИтогоСуммаНДСДеталей, ФорматВыводаСуммы);
		ОбластьПодвалДеталей.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаДеталей, ВалютаПечатногоДокумента);
		Если ИтогоСуммаНДСДеталей <> 0 Тогда
			ОбластьПодвалДеталей.Параметры.ЧислоПрописью = ОбластьПодвалДеталей.Параметры.ЧислоПрописью + " в т.ч. НДС " + Формат(ИтогоСуммаНДСДеталей, ФорматВыводаСуммы) + " " + ВалютаПечатногоДокумента;
		КонецЕсли; 
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталей, , , НомерСтраницы, , ЭтотОбъект);
	КонецЕсли;
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаДеталейКлиента.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	Если ВыводитьКод Тогда
		ОбластьШапкаДеталей.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
	КонецЕсли;
	
	// Формирование врем. таблиц товаров клиента
	ТаблТоварыКлиента = МатериалыЗаказчика.Выгрузить();
	КоличествоДеталейКлиента = ТаблТоварыКлиента.Количество();
	
	ТабДокВрем = Новый ТабличныйДокумент;
	ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
	ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
	
	Если КоличествоДеталейКлиента = 0 Тогда
		//не выводим
	Иначе
		//Вывод шапки табличной части деталей клиента
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиКлиента");
		Если НЕ ВыводитьКод Тогда
			ВремТекст = ОбластьМакета.Область(5,4,5,4).Текст;
			ОбластьМакета.Область(5,3,5,7).Объединить();
			ОбластьМакета.Область(6,3,6,7).Объединить();
			ОбластьМакета.Область(5,3,5,7).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьМакета.Область(5,3,5,3).Текст = ВремТекст;
			Ном=3;
			Для Сч=3 По 10 Цикл
				Если обЗначениеНеЗаполнено(ОбластьМакета.Область(6,Сч+1,6,Сч+1).Текст) Тогда
					Продолжить;
				КонецЕсли;
				ОбластьМакета.Область(6,Сч+1,6,Сч+1).Текст=Ном;
				Ном=Ном+1;
			КонецЦикла;
			Ном=3;
			Для Сч=3 По 10 Цикл
				Если обЗначениеНеЗаполнено(ОбластьШапкаДеталейКлиента.Область(3,Сч+1,3,Сч+1).Текст) Тогда
					Продолжить;
				КонецЕсли;
				ОбластьШапкаДеталейКлиента.Область(3,Сч+1,3,Сч+1).Текст=Ном;
				Ном=Ном+1;
			КонецЦикла;
		КонецЕсли;
		// Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		Если ВыводитьКод Тогда
			ОбластьМакета.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ТабДокВрем.Очистить();
		ТабДокВрем.Вывести(ОбластьМакета);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТоварыКлиента[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		ТекТовар = СтрокаДеталей.Номенклатура;
		ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДеталиКлиента);
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Исключение
		КонецПопытки;
		ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
		ОбластьМакета.Параметры.ДатаДок  = Формат(ДатаНаПечать,"ДФ = дд.ММ.гггг");
		ТабДокумент.Вывести(ОбластьМакета);
			
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Перечень деталей клиента к заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаНаПечать, "ДФ = дд.ММ.гггг");
			
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталейКлиента.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталейКлиента.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части деталей клиента
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
			
		Для каждого СтрокаДеталей из ТаблТоварыКлиента Цикл
			Ном = Ном + 1;
				
			ОбластьСтрокаДеталейКлиента.Параметры.НомСтр = Ном;
			ТекТоварКлиента = СтрокаДеталей.Номенклатура;
			Если ВыводитьКод Тогда
				ОбластьСтрокаДеталейКлиента.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекТоварКлиента,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя);
			КонецЕсли;
			ОбластьСтрокаДеталейКлиента.Параметры.Номенклатура = ТекТоварКлиента;
			ОбластьСтрокаДеталейКлиента.Параметры.Наименование = спПолучитьНаименование(ТекТоварКлиента);
			ОбластьСтрокаДеталейКлиента.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
			ОбластьСтрокаДеталейКлиента.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                ОбластьСтрокаПримечаниеНоменклатураКлиента.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
            КонецЕсли;
            // Обновим итоги по документу
			ИтогоКоличествоДеталейКлиента = ИтогоКоличествоДеталейКлиента + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьСтрокаПримечаниеНоменклатураКлиента);
			мсвДопОбластиПодвала.Добавить(ОбластьИтоговПоСтраницеДеталиКлиента);
			Если Ном=КоличествоДеталейКлиента Тогда
				мсвДопОбластиПодвала.Добавить(ОбластьПодвалДеталейКлиента);
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталейКлиента, ОбластьШапкаДеталейКлиента, ОбластьИтоговПоСтраницеДеталиКлиента, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, мсвДопОбластиПодвала);
            Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
                дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатураКлиента);	
            КонецЕсли;
	
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
				
			//обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
		КонецЦикла;
			
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДеталиКлиента, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
			
		//Вывод подвала табличной части деталей клиента
		ОбластьПодвалДеталейКлиента.Параметры.КоличествоДеталейЗаказчика = Формат(ИтогоКоличествоДеталейКлиента, ФорматВыводаКоличества);
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталейКлиента, , , НомерСтраницы, , ЭтотОбъект);
	КонецЕсли;
	
	//Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Сумма = Формат(ИтогоСуммаРабот+ИтогоСуммаДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаНДС = Формат(ИтогоСуммаНДСРабот+ИтогоСуммаНДСДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаРабот+ИтогоСуммаДеталей, ВалютаПечатногоДокумента);
	Если (ИтогоСуммаНДСРабот+ИтогоСуммаНДСДеталей) <> 0 Тогда
		ОбластьМакета.Параметры.ЧислоПрописью = ОбластьМакета.Параметры.ЧислоПрописью + " в т.ч. НДС " + Формат(ИтогоСуммаНДСРабот+ИтогоСуммаНДСДеталей, ФорматВыводаСуммы) + " " + ВалютаПечатногоДокумента;
	КонецЕсли; 
	
	// сформируем информацию о бонусных баллах
	ТекстБаллы = "";
	Если ЭтотОбъект.КоличествоКСписанию > 0 Тогда
		ТекстБаллы = ТекстБаллы + "Для оплаты использованы бонусные баллы в количестве " + ЭтотОбъект.КоличествоКСписанию +
		" на сумму "+(ЭтотОбъект.Товары.Итог("СуммаСкидкиБонусами")+ЭтотОбъект.Работы.Итог("СуммаСкидкиБонусами")) + " " + ЭтотОбъект.ВалютаДокумента +".";
	КонецЕсли;
	
	Если ЭтотОбъект.КоличествоКНачислению > 0 Тогда
		ТекстБаллы = ТекстБаллы +?(ПустаяСтрока(ТекстБаллы), "", " ")+ "Было начислено "+ ЭтотОбъект.КоличествоКНачислению +" бонусных баллов на сумму в " +
		КоличествоКНачислению*Карточка.БонуснаяПрограмма.КратностьБонусов + " "+ Карточка.БонуснаяПрограмма.ВалютаБонуса+".";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстБаллы) Тогда
		ТекОбласть = ОбластьМакета.Область(5, , 5, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(5, 2, 5, 2).Текст = "";
	Иначе
		ОбластьМакета.Параметры.БонусныеБаллы = ТекстБаллы;
	КонецЕсли;
	
	Если ПустаяСтрока(Гарантии) Тогда
		ТекОбласть = ОбластьМакета.Область(9, , 9, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(9, 3, 9, 3).Текст = "";
	Иначе
		ОбластьМакета.Параметры.Гарантии = Гарантии;
	КонецЕсли;
	Если ПустаяСтрока(Рекомендации) Тогда
		ТекОбласть = ОбластьМакета.Область(11, , 11, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(11, 11, 9, 11).Текст = "";
	Иначе
		ОбластьМакета.Параметры.Рекомендации = Рекомендации;		
	КонецЕсли;
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаНаПечать,"ДФ = ""дд ММММ гггг 'г.'""");
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);
		
	// Вывод причины
	ОбластьМакета = Макет.ПолучитьОбласть("Причина");
	Если ПустаяСтрока(ПричинаОбращения) Тогда
		ТекОбласть = ОбластьМакета.Область(2, , 2, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 22;
	КонецЕсли;
	ОбластьМакета.Параметры.ПричинаОбращения = ПричинаОбращения;
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);
		
	// Верхние колонтитулы
	ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа = "Заказ-наряд № " + НомерДляПечати + " от " + Формат(ДатаНаПечать, "ДФ = дд.ММ.гггг");
	ТабДокумент.ВерхнийКолонтитул.Шрифт = Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
		
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "УПД"
// Возвращает сформированный табличный документ:
Функция ПечатьУПД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУПД(ЭтотОбъект,ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции //ПечатьУПД()

//СОКРАЩЕННЫЙ ПЕРЕЧЕНЬ ПЕЧАТНЫХ ФОРМ

// Формирует печатную форму "БланкЗаявки"
// Возвращает сформированный табличный документ:
Функция ПечатьБланкЗаявки(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("БланкЗаявки");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаСоздания = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель.Наименование;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Причина=СокрЛП(ПричинаОбращения);
	Если ПустаяСтрока(Причина) Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ПричинаОбращенияПустая");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ПричинаОбращения");
		ОбластьМакета.Параметры.ПричинаОбращения = Причина;
	КонецЕсли; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("НаружныеПовреждения");
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		СхемаТС = орПолучитьСхемуТС(Автомобиль.Модель,"СхемаТС");
		Если СхемаТС <> Неопределено Тогда
			ОбластьМакета.Рисунки.СхемаТС.Картинка = СхемаТС;				
			ОбластьМакета.Рисунки.СхемаТС.РазмерКартинки = РазмерКартинки.Пропорционально;
		КонецЕсли;
	КонецЕсли; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	//Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "РабочаяЗаявка"
// Возвращает сформированный табличный документ:
Функция ПечатьРабочаяЗаявка(ТабДокумент) Экспорт
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаТоваров=Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаТоваров,ЭтотОбъект,ВалютаПечатногоДокумента);
	ТаблицаРабот=Работы.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
	
	Макет = ПолучитьМакет("РабочаяЗаявка");
	
	//зададим параметры макета
	ТабДокумент.ПолеСверху = 10; //поле равно высоте колонтитулов
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ЕстьСкидкаПоДеталям = Ложь;
	Если Товары.Итог("СуммаСкидки")<>0 ИЛИ Товары.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Товары.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоДеталям = Истина;
	КонецЕсли;
	
	ЕстьСкидкаПоРаботам = Ложь;
	Если Работы.Итог("СуммаСкидки")<>0 ИЛИ Работы.Итог("СуммаСкидкиСтроки")<>0 ИЛИ Работы.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоРаботам = Истина;
	КонецЕсли;
	
	ВыводитьКод = обПраво("ВыводитьКодВПечатныхФормах",Права,ЭтотОбъект); 
	
	
	ОбластьСкидка      = Макет.Область("Скидка");
	ОбластьСкидкаРабот = Макет.Область("СкидкаРабот");
	
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");
	
	ОбластьСтрокаДеталей	            = Макет.ПолучитьОбласть("СтрокаДеталей");
	ОбластьСтрокаПримечаниеНоменклатура = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатура");
	ОбластьИтоговПоСтраницеДетали	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталей");
	ОбластьПодвалДеталей	            = Макет.ПолучитьОбласть("ПодвалДетали");
	
	ОбластьСтрокаУслуг		        = Макет.ПолучитьОбласть("СтрокаРабот");
	ОбластьСтрокаПримечаниеРаботы   = Макет.ПолучитьОбласть("СтрокаПримечаниеРаботы");
	ОбластьИтоговПоСтраницеУслуги	= Макет.ПолучитьОбласть("ИтогиПоСтраницеРабот");
	ОбластьПодвалУслуг		        = Макет.ПолучитьОбласть("ПодвалУслуги");
	
	ОбластьШапкаДеталейКлиента				    = Макет.ПолучитьОбласть("ШапкаДеталейКлиента");
	ОбластьСтрокаПримечаниеНоменклатураКлиента  = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатураКлиента");
	ОбластьСтрокаДеталейКлиента				    = Макет.ПолучитьОбласть("СтрокаДеталейКлиента");
	ОбластьИтоговПоСтраницеДеталиКлиента	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталейКлиента");
	ОбластьПодвалДеталейКлиента 			    = Макет.ПолучитьОбласть("ПодвалКлиента");
	
	ОбластьСписокОткрытыхЗН         = Макет.ПолучитьОбласть("СписокОткрытыхЗН");
	ОбластьСтрокаСписокОткрытыхЗН   = Макет.ПолучитьОбласть("СтрокаСписокОткрытыхЗН");
	ОбластьИтоговПоСтраницеСписокЗН = Макет.ПолучитьОбласть("ИтогиПоСтраницеСписокОткрытыхЗН");
	ОбластьПодвалСписокОткрытыхЗН   = Макет.ПолучитьОбласть("ПодвалСписокОткрытыхЗН");
	
	ОбластьШапкаМатериалов  = Макет.ПолучитьОбласть("ШапкаМатериалов");
	ОбластьСтрокаМатериалов = Макет.ПолучитьОбласть("СтрокаМатериалов");
	
	ОбластьШапкаИсполнителей  = Макет.ПолучитьОбласть("ШапкаИсполнителей");
	ОбластьСтрокаИсполнителей = Макет.ПолучитьОбласть("СтрокаИсполнителей");
	
	БезЛинии 	 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбычнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	// Настроем колонки вывода деталей если не было скидок
	Если Не ЕстьСкидкаПоДеталям Тогда
		ПоложениеШапкиДеталей = ОбластьДетали.Область("ШапкаДеталей").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 6 Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки,ПоложениеШапкиДеталей-1,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки-1,ПоложениеШапкиДеталей-1,ПозицияКолонки-1).Текст;
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки-1,ПоложениеШапкиДеталей,ПозицияКолонки-1).Текст;
			
			ОбластьИсточник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
		
		ОбластьДетали.Область(ПоложениеШапкиДеталей-1, 4, ПоложениеШапкиДеталей-1, 8).Объединить();
		ОбластьДетали.Область(ПоложениеШапкиДеталей, 4, ПоложениеШапкиДеталей, 8).Объединить();
		ОбластьСтрокаДеталей.Область(1, 4, 1, 8).Объединить();
		
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 2, 1, 8);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 2, 1, 8);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 10, 1, 11);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 10, 1, 11);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		Пока ПозицияКолонки <= ОбластьДетали.ШиринаТаблицы Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ПозицияКолонки-5;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьШапкаДеталей = ОбластьДетали.ПолучитьОбласть("ШапкаДеталей");
	
	// Настроем колонки вывода услуг если не было скидок
	Если Не ЕстьСкидкаПоРаботам Тогда
		ПоложениеШапкиУслуг = ОбластьУслуги.Область("ШапкаУслуг").Низ;
		ПозицияКолонки = ОбластьСкидкаРабот.Лево;
		Пока ПозицияКолонки > 6 Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки,ПоложениеШапкиУслуг-1,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки-1,ПоложениеШапкиУслуг-1,ПозицияКолонки-1).Текст;
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки-1,ПоложениеШапкиУслуг,ПозицияКолонки-1).Текст;
			
			ОбластьИсточник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			
			Если ОбластьИсточник.ПараметрРасшифровки = "Цех" Тогда
				ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки).Разъединить();
				ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				ОбластьСтрокаИсполнителей.Область(1,ПозицияКолонки,1,ПозицияКолонки+2).Объединить();
			Иначе
				ОбластьПриемник.Текст               = ОбластьИсточник.Текст;
				ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
				ОбластьПриемник.ГраницаСлева        = ОбычнаяЛиния;
			КонецЕсли;
			
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
		
		ОбластьУслуги.Область(ПоложениеШапкиУслуг-1, 4, ПоложениеШапкиУслуг-1, 9).Объединить();
		ОбластьУслуги.Область(ПоложениеШапкиУслуг, 4, ПоложениеШапкиУслуг, 9).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 9).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 9).ГраницаСнизу = БезЛинии;
		ОбластьСтрокаМатериалов.Область(1, 6, 1, 9).Объединить();
		ОбластьСтрокаИсполнителей.Область(1, 6, 1, 9).Объединить();
		
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 2, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 2, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 11, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 11, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ПозицияКолонки = ОбластьСкидкаРабот.Лево-1;
		Пока ПозицияКолонки <= ОбластьУслуги.ШиринаТаблицы Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ПозицияКолонки-6;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ВыводитьКод Тогда
		ВремОбластьДетали=ОбластьУслуги.Область(4,4,4,4).Текст;
		ОбластьУслуги.Область(4,3,4,8).Объединить();
		ОбластьУслуги.Область(5,3,5,8).Объединить();
		ОбластьУслуги.Область(4,3,4,4).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьУслуги.Область(4,3,4,3).Текст=ВремОбластьДетали;
		
		ОбластьСтрокаУслуг.Область(1,3,1,8).Объединить();
		ОбластьСтрокаУслуг.Область(1,3,1,8).Параметр=ВремОбластьДетали;
		ОбластьСтрокаУслуг.Область(1,3,1,8).ПараметрРасшифровки="Номенклатура";
		
		ОбластьШапкаМатериалов.Область(1,3,1,4).Объединить();
		
		ОбластьСтрокаМатериалов.Область(1,3,1,4).Объединить();
		ОбластьСтрокаМатериалов.Область(1,3,1,4).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ОбластьШапкаИсполнителей.Область(1,3,1,4).Объединить();
		ОбластьШапкаИсполнителей.Область(1,3,1,4).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ОбластьСтрокаИсполнителей.Область(1,3,1,4).Объединить();
		ОбластьСтрокаИсполнителей.Область(1,3,1,4).ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		ОбластьСтрокаИсполнителей.Область(1,3,1,4).ГраницаСнизу  = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
		
		ВремОбластьДетали=ОбластьДетали.Область(4,4,4,4).Текст;
		ОбластьДетали.Область(4,3,4,7).Объединить();
		ОбластьДетали.Область(5,3,5,7).Объединить();
		ОбластьДетали.Область(4,3,4,4).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьДетали.Область(4,3,4,3).Текст=ВремОбластьДетали;
		
		ОбластьСтрокаДеталей.Область(1,3,1,7).Объединить();
		ОбластьСтрокаДеталей.Область(1,3,1,7).Параметр=ВремОбластьДетали;
		ОбластьСтрокаДеталей.Область(1,3,1,7).ПараметрРасшифровки="Номенклатура";
		
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,9).Объединить();
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,9).Параметр=ВремОбластьДетали;
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,3).ПараметрРасшифровки="Номенклатура";
		
		Ном=3;
		Для Сч=3 По 14 Цикл
			Если обЗначениеНеЗаполнено(ОбластьДетали.Область(5,Сч+1,5,Сч+1).Текст) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьДетали.Область(5,Сч+1,5,Сч+1).Текст=Ном;
			Ном=Ном+1;
		КонецЦикла;
		
		Ном=3;
		Для Сч=4 По 14 Цикл
			Если обЗначениеНеЗаполнено(ОбластьУслуги.Область(5,Сч+1,5,Сч+1).Текст) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьУслуги.Область(5,Сч+1,5,Сч+1).Текст=Ном;
			Ном=Ном+1;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьШапкаУслуг = ОбластьУслуги.ПолучитьОбласть("ШапкаУслуг");
	ОбластьШапкаДеталей = ОбластьДетали.ПолучитьОбласть("ШапкаДеталей");
	
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	
	//misha	   вывод ШК	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Попытка
			ОбластьМакета.Рисунки.ШК.Объект.Сообщение = Результат.ШтрихКод;
		Исключение
		КонецПопытки;			
	КонецЦикла;
	//misha	
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		//<<Павличенко 06.05.19
		//ОбластьМакета.Параметры.НомерГаражный = Автомобиль.НомерГаражный;
		ОбластьМакета.Параметры.НомерГаражный = ?(Автомобиль.НомерГаражный = "", "", "гар.ном. " + Автомобиль.НомерГаражный);
		//>>Павличенко 06.05.19
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		//<<Павличенко 06.05.19
		//ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
		ОбластьМакета.Параметры.АвтомобильПробег = ?(Пробег =0, "", Формат(Пробег,"ЧЦ=10") + " км.");
		//>>Павличенко 06.05.19
	КонецЕсли;
	
	ОбластьМакета.Рисунки.Принят.Параметр = "Принят:
	|" + Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Рисунки.ВидРемонта.Параметр = "Вид ремонта:
	|" + ВидРемонта.Наименование;
	ОбластьМакета.Рисунки.ВидРемонта.Расшифровка = ВидРемонта;
	//<<Павличенко 06.05.19
	//ОбластьМакета.Рисунки.Диспетчер.Параметр = "Диспетчер:
	//|" + Диспетчер.Наименование;
	//ОбластьМакета.Рисунки.Диспетчер.Расшифровка = Диспетчер;
	
	ОбластьМакета.Рисунки.ПлановаяДатаВыдачи.Параметр = "Плановая дата выдачи:
	|" + ПлановаяДатаВыдачи;
	ОбластьМакета.Рисунки.ПлановаяДатаВыдачи.Расшифровка = ПлановаяДатаВыдачи;
	
	
	ОбластьМакета.Рисунки.Мастер.Параметр = "Мастер:
	//|" + Мастер.Наименование;
	//ОбластьМакета.Рисунки.Мастер.Расшифровка = Мастер;
	|" + Диспетчер.Наименование;
	ОбластьМакета.Рисунки.Мастер.Расшифровка = Диспетчер;
	//>>Павличенко 06.05.19
	ОбластьМакета.Параметры.Валюта = ВалютаПечатногоДокумента;
	// Вывод причины
	Если ПустаяСтрока(ПричинаОбращения) Тогда
		ТекОбласть = ОбластьМакета.Область(13, , 13, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(13, 2, 13, 2).Текст = "";
	Иначе
		ОбластьМакета.Параметры.ПричинаОбращения = ПричинаОбращения;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьМакета);
	
	//Вывод шапки табличной части работ
	КолонкаКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);
	
	//<<Павличенко 06.05.19
	//Если ВыводитьКод Тогда
	//	ОбластьУслуги.Параметры.ИмяКолонкиКодов=КолонкаКода.Синоним;
	//КонецЕсли;
	//ОбластьУслуги.Параметры.НомерДок = НомерДляПечати;
	//ОбластьУслуги.Параметры.ДатаДок = Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
	//ТабДокумент.Вывести(ОбластьУслуги);
	
	//Временная таблица
	Табл = ТаблицаРабот.Скопировать();
	//Для ДопСтр = 1 по 10 Цикл
	//	Табл.Добавить();
	//КонецЦикла;
	//>>Павличенко 06.05.19
	КоличествоРабот = Табл.Количество();
	
	// инициализация итогов по документу
	ИтогоСуммаРабот	              = 0;
	ИтогоСуммаСкидкиРабот	      = 0;
	ИтогоКоличествоРабот          = 0;
	ИтогоСуммаДеталей	          = 0;
	ИтогоСуммаСкидкиДеталей	      = 0;
	ИтогоКоличествоДеталей        = 0;
	ИтогоКоличествоДеталейКлиента = 0;
	
	//<<Павличенко 06.05.19
	Если КоличествоРабот>0 Тогда
		Если ВыводитьКод Тогда
			ОбластьУслуги.Параметры.ИмяКолонкиКодов=КолонкаКода.Синоним;
		КонецЕсли;
		ОбластьУслуги.Параметры.НомерДок = НомерДляПечати;
		ОбластьУслуги.Параметры.ДатаДок = Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
		ТабДокумент.Вывести(ОбластьУслуги);
		//>>Павличенко 06.05.19
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Заявка на работы по заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаСоздания, "ДФ=дд.ММ.гггг");
		
		
		ОбластьШапкаУслуг.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаУслуг.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		
		
		//Вывод табличной части работ
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, Количество, СуммаСкидки", 0, 0, 0);
		
		МассивОбластиПодвала = Новый Массив;
		//МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
		МассивИсполнителей = Новый Массив;
		МассивМатериалов   = Новый Массив;
		Для каждого СтрокаРабот из Табл Цикл
			Ном = Ном + 1;
			
			МассивИсполнителей.Очистить();
			МассивМатериалов.Очистить();
			
			ТекОбласть = ОбластьСтрокаУслуг.Область(1, , 1,);
			ОбластьСтрокаУслуг.Параметры.НомСтр = Ном;
			//<<Павличенко 06.05.19
			//Если Ном > (КоличествоРабот-10) Тогда
			Если Ном > (КоличествоРабот) Тогда
				//>>Павличенко 06.05.19	
				//установим для пустой строки высоту, равную двум строкам. Параметры не заполняем
				ТекОбласть.АвтовысотаСтроки = Ложь;
				ТекОбласть.ВысотаСтроки = 22;
				Если ВыводитьКод Тогда
					ОбластьСтрокаУслуг.Параметры.Код="";
				КонецЕсли;
				ОбластьСтрокаУслуг.Параметры.Номенклатура = "";
				ОбластьСтрокаУслуг.Параметры.Наименование = "";
				ОбластьСтрокаУслуг.Параметры.Цена = "";
				ОбластьСтрокаУслуг.Параметры.Количество = "";
				ОбластьСтрокаУслуг.Параметры.Единица = "";
				ОбластьСтрокаУслуг.Параметры.Сумма = "";
				Если ЕстьСкидкаПоРаботам Тогда
					ОбластьСтрокаУслуг.Параметры.Скидка = "";
				КонецЕсли;
				//ОбластьСтрокаУслуг.Параметры.ДопИнформация = "";
				Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
					ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
				КонецЕсли;
			Иначе
				//заполним параметры
				Если ВыводитьКод Тогда
					ОбластьСтрокаУслуг.Параметры.Код=дкПолучитьЗначениеКолонкиКода(СтрокаРабот.Работа,ИмяРеквизитаКода,ЭтотОбъект);
				КонецЕсли;
				ОбластьСтрокаУслуг.Параметры.Номенклатура = СтрокаРабот.Работа;
				ОбластьСтрокаУслуг.Параметры.Наименование = спПолучитьНаименование(СтрокаРабот.Работа);
				ОбластьСтрокаУслуг.Параметры.Цена = Формат(СтрокаРабот.Цена, "ЧЦ=15; ЧДЦ=2");
				ОбластьСтрокаУслуг.Параметры.Количество = Формат(СтрокаРабот.Количество*СтрокаРабот.Коэффициент, "ЧЦ=15; ЧДЦ=3");
				ОбластьСтрокаУслуг.Параметры.Единица = СтрокаРабот.Нормочас;
				ОбластьСтрокаУслуг.Параметры.Сумма = Формат(СтрокаРабот.СуммаВсего, "ЧЦ=15; ЧДЦ=2");
				Если ЕстьСкидкаПоРаботам Тогда
					ОбластьСтрокаУслуг.Параметры.Скидка = Формат(СтрокаРабот.СуммаСкидки+СтрокаРабот.СуммаСкидкиСтроки+СтрокаРабот.СуммаСкидкиБонусами, ФорматВыводаСуммы);
				КонецЕсли;
				//ОбластьСтрокаУслуг.Параметры.ДопИнформация = "";
				//МассивИсполнителей = Исполнители.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
				//Для каждого Исполнитель Из МассивИсполнителей Цикл
				//	Если ОбластьСтрокаУслуг.Параметры.ДопИнформация <> "" Тогда
				//		ОбластьСтрокаУслуг.Параметры.ДопИнформация = ОбластьСтрокаУслуг.Параметры.ДопИнформация + Символы.ПС;
				//	КонецЕсли; 
				//	ОбластьСтрокаУслуг.Параметры.ДопИнформация = ОбластьСтрокаУслуг.Параметры.ДопИнформация + Исполнитель.Исполнитель;
				//КонецЦикла;
				МассивМатериалов   = Материалы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
				МассивИсполнителей = Исполнители.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
				
				Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
					ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
				КонецЕсли;	
				// Обновим итоги по документу
				ИтогоСуммаРабот = ИтогоСуммаРабот + СтрокаРабот.СуммаВсего;
				ИтогоСуммаСкидкиРабот = ИтогоСуммаСкидкиРабот + СтрокаРабот.СуммаСкидки + СтрокаРабот.СуммаСкидкиСтроки + СтрокаРабот.СуммаСкидкиБонусами;
				ИтогоКоличествоРабот = ИтогоКоличествоРабот + СтрокаРабот.Количество*СтрокаРабот.Коэффициент;
			КонецЕсли;
			
			МассивОбластиПодвала.Очистить();
			Если МассивМатериалов.Количество() > 0 Тогда
				ТабДокВрем = Новый ТабличныйДокумент;
				ТабДокВрем.ПолеСверху = 10;
				ТабДокВрем.ПолеСнизу  = 0;
				ТабДокВрем.ПолеСлева  = 0;
				ТабДокВрем.ПолеСправа = 0;
				ТабДокВрем.Вывести(ОбластьШапкаМатериалов);
				Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
					ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
					ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
					ТабДокВрем.Вывести(ОбластьСтрокаМатериалов);
				КонецЦикла;
				МассивОбластиПодвала.Добавить(ТабДокВрем);
			КонецЕсли;
			
			Если МассивИсполнителей.Количество() > 0 Тогда
				ТабДокВрем = Новый ТабличныйДокумент;
				ТабДокВрем.ПолеСверху = 10;
				ТабДокВрем.ПолеСнизу  = 0;
				ТабДокВрем.ПолеСлева  = 0;
				ТабДокВрем.ПолеСправа = 0;
				ТабДокВрем.Вывести(ОбластьШапкаИсполнителей);
				Для Каждого СтрокаИсполнителей Из МассивИсполнителей Цикл
					ОбластьСтрокаИсполнителей.Параметры.Заполнить(СтрокаИсполнителей);
					ОбластьСтрокаИсполнителей.Параметры.ПроцентУчастия          = Строка(СтрокаИсполнителей.Процент) + " %";
					ОбластьСтрокаИсполнителей.Параметры.ИсполнительНаименование = Строка(СтрокаИсполнителей.Исполнитель);
					ОбластьСтрокаИсполнителей.Параметры.ЦехПредставление        = Строка(СтрокаИсполнителей.Цех);
					ТабДокВрем.Вывести(ОбластьСтрокаИсполнителей);
				КонецЦикла;
				МассивОбластиПодвала.Добавить(ТабДокВрем);
			КонецЕсли;
			
			Если Ном = КоличествоРабот Тогда
				МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаУслуг, ОбластьШапкаУслуг, ОбластьИтоговПоСтраницеУслуги, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоРабот, МассивОбластиПодвала, Неопределено));
			
			Если МассивМатериалов.Количество() > 0 Тогда
				
				ТабДокумент.Вывести(ОбластьШапкаМатериалов);
				Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
					ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
					ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
					ТабДокумент.Вывести(ОбластьСтрокаМатериалов);
				КонецЦикла;
				
			КонецЕсли;
			
			Если МассивИсполнителей.Количество() > 0 Тогда
				
				ТабДокумент.Вывести(ОбластьШапкаИсполнителей);
				Для Каждого СтрокаИсполнителей Из МассивИсполнителей Цикл
					ОбластьСтрокаИсполнителей.Параметры.Заполнить(СтрокаИсполнителей);
					ОбластьСтрокаИсполнителей.Параметры.ПроцентУчастия          = Строка(СтрокаИсполнителей.Процент) + " %";
					ОбластьСтрокаИсполнителей.Параметры.ИсполнительНаименование = Строка(СтрокаИсполнителей.Исполнитель);
					ОбластьСтрокаИсполнителей.Параметры.ЦехПредставление        = Строка(СтрокаИсполнителей.Цех);
					ТабДокумент.Вывести(ОбластьСтрокаИсполнителей);
				КонецЦикла;
				
			КонецЕсли;
			
			Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеРаботы);	
			КонецЕсли;
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, Количество, СуммаСкидки", 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			//СтруктураИтоговПоСтранице.СуммаВсего  = СтруктураИтоговПоСтранице.СуммаВсего + СтрокаРабот.СуммаВсего;
			//СтруктураИтоговПоСтранице.СуммаСкидки = СтруктураИтоговПоСтранице.СуммаСкидки + СтрокаРабот.СуммаСкидки;
			//СтруктураИтоговПоСтранице.Количество  = СтруктураИтоговПоСтранице.Количество 
			//+ СтрокаРабот.Количество*СтрокаРабот.Коэффициент;
			дкДобавитьИтогиПоСтранице(СтрокаРабот, СтруктураИтоговПоСтранице);
		КонецЦикла;
		
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеУслуги, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;  
		
		//Вывод подвала табличной части услуг
		ОбластьПодвалУслуг.Параметры.Количество = Формат(ИтогоКоличествоРабот, ФорматВыводаКоличества);
		ОбластьПодвалУслуг.Параметры.Сумма = Формат(ИтогоСуммаРабот, ФорматВыводаСуммы);
		Если ЕстьСкидкаПоРаботам Тогда
			ОбластьПодвалУслуг.Параметры.Скидка = Формат(ИтогоСуммаСкидкиРабот, ФорматВыводаСуммы);
		КонецЕсли;
		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалУслуг, , , НомерСтраницы, , ЭтотОбъект);
		//<<Павличенко06.05.19
		
	КонецЕсли;
	//>>Павличенко 06.05.19
	
	
	// Формирование врем. таблиц товаров
	ТаблТовары        = ТаблицаТоваров.Скопировать();
	ТаблТоварыКлиента = МатериалыЗаказчика.Выгрузить();
	//<<Павличенко 06.05.19
	//Для ТекСтр = 1 по 10 Цикл
	//	ТаблТовары.Добавить();
	//	ТаблТоварыКлиента.Добавить();
	//КонецЦикла;
	//>>Павличенко 06.05.19
	КоличествоДеталей = ТаблТовары.Количество();
	КоличествоДеталейКлиента = ТаблТоварыКлиента.Количество();
	
	//Вывод шапки табличной части деталей
	//<<Павличенко 06.05.19
	Если КоличествоДеталей > 0 тогда
		//>> Павличенко 06.09.18
		ОбластьДетали.Параметры.НомерДок = НомерДляПечати;
		ОбластьДетали.Параметры.ДатаДок  = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
		Если ВыводитьКод Тогда
			ОбластьДетали.Параметры.ИмяКолонкиКодов=КолонкаКода.Синоним;
		КонецЕсли;
		// Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		ТабДокВрем = Новый ТабличныйДокумент;
		ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
		ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
		ТабДокВрем.Вывести(ОбластьДетали);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТовары[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		Если КоличествоДеталей = 10 Тогда
			//присутствуют только пустые строки
			ТекОбласть.АвтовысотаСтроки = Ложь;
			ТекОбласть.ВысотаСтроки = 22;
		Иначе
			//присутствуют заполненные строки (заполняем не все параметры - только наиболее вероятно длинные)
			ТекТовар = СтрокаДеталей.Номенклатура;
			ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		КонецЕсли;
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДетали);
		Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьДетали);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Требование к заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталей.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталей.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		
		//Вывод табличной части деталей
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, Количество, СуммаСкидки", 0, 0, 0);
		
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалДеталей);
		Для каждого СтрокаДеталей из ТаблТовары Цикл
			Ном = Ном + 1;
			ТекОбласть = ОбластьСтрокаДеталей.Область(1, , 1,);
			ОбластьСтрокаДеталей.Параметры.НомСтр = Ном;
			//<<Павличенко 06.05.19
			//Если Ном > (КоличествоДеталей-10) Тогда
			Если Ном > (КоличествоДеталей) Тогда
				//установим для пустой строки высоту, равную двум строкам. Параметры не заполняем
				ТекОбласть.АвтовысотаСтроки = Ложь;
				ТекОбласть.ВысотаСтроки = 22;
				Если ВыводитьКод Тогда
					ОбластьСтрокаДеталей.Параметры.Код="";
				КонецЕсли;
				ОбластьСтрокаДеталей.Параметры.Номенклатура = "";
				ОбластьСтрокаДеталей.Параметры.Наименование = "";
				ОбластьСтрокаДеталей.Параметры.Цена = "";
				ОбластьСтрокаДеталей.Параметры.Количество = "";
				ОбластьСтрокаДеталей.Параметры.Единица = "";
				ОбластьСтрокаДеталей.Параметры.Сумма = "";
				Если ЕстьСкидкаПоДеталям Тогда
					ОбластьСтрокаДеталей.Параметры.Скидка = "";
				КонецЕсли;
				ОбластьСтрокаДеталей.Параметры.ДопИнформация = "";
				Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
					ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
				КонецЕсли;
			Иначе
				//заполним параметры
				Если ВыводитьКод Тогда
					ОбластьСтрокаДеталей.Параметры.Код=дкПолучитьЗначениеКолонкиКода(СтрокаДеталей.Номенклатура,ИмяРеквизитаКода,ЭтотОбъект,Истина);
				КонецЕсли;
				ОбластьСтрокаДеталей.Параметры.Номенклатура = СтрокаДеталей.Номенклатура;
				ОбластьСтрокаДеталей.Параметры.Наименование = спПолучитьНаименование(СтрокаДеталей.Номенклатура);
				ОбластьСтрокаДеталей.Параметры.Цена = Формат(СтрокаДеталей.Цена, "ЧЦ=15; ЧДЦ=2");
				ОбластьСтрокаДеталей.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
				ОбластьСтрокаДеталей.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
				ОбластьСтрокаДеталей.Параметры.Сумма = Формат(СтрокаДеталей.СуммаВсего, ФорматВыводаСуммы);
				Если ЕстьСкидкаПоДеталям Тогда
					ОбластьСтрокаДеталей.Параметры.Скидка = Формат(СтрокаДеталей.СуммаСкидки+СтрокаДеталей.СуммаСкидкиСтроки+СтрокаДеталей.СуммаСкидкиБонусами, ФорматВыводаСуммы);
				КонецЕсли;
				ОбластьСтрокаДеталей.Параметры.ДопИнформация = "";
				Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
					ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
				КонецЕсли;
				// Обновим итоги по документу
				ИтогоСуммаДеталей = ИтогоСуммаДеталей + СтрокаДеталей.СуммаВсего;
				ИтогоСуммаСкидкиДеталей = ИтогоСуммаСкидкиДеталей + СтрокаДеталей.СуммаСкидки + СтрокаДеталей.СуммаСкидкиСтроки + СтрокаДеталей.СуммаСкидкиБонусами;
				ИтогоКоличествоДеталей = ИтогоКоличествоДеталей + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталей, ОбластьШапкаДеталей, ОбластьИтоговПоСтраницеДетали, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоДеталей, МассивОбластиПодвала, Неопределено));
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатура);	
			КонецЕсли;	
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, Количество, СуммаСкидки", 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			//СтруктураИтоговПоСтранице.СуммаВсего  = СтруктураИтоговПоСтранице.СуммаВсего + СтрокаДеталей.СуммаВсего;
			//СтруктураИтоговПоСтранице.СуммаСкидки = СтруктураИтоговПоСтранице.СуммаСкидки + СтрокаДеталей.СуммаСкидки;
			//СтруктураИтоговПоСтранице.Количество 
			//= СтруктураИтоговПоСтранице.Количество + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			дкДобавитьИтогиПоСтранице(СтрокаДеталей, СтруктураИтоговПоСтранице);
		КонецЦикла; 
		
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДетали, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
		
		//Вывод подвала табличной части деталей
		ОбластьПодвалДеталей.Параметры.Количество = Формат(ИтогоКоличествоДеталей, ФорматВыводаКоличества);
		ОбластьПодвалДеталей.Параметры.Сумма = Формат(ИтогоСуммаДеталей, ФорматВыводаСуммы);
		Если ЕстьСкидкаПоДеталям Тогда
			ОбластьПодвалДеталей.Параметры.Скидка = Формат(ИтогоСуммаСкидкиДеталей, ФорматВыводаСуммы);
		КонецЕсли;
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталей, , , НомерСтраницы, , ЭтотОбъект);
		//<<Павличенко 06.05.19
	КонецЕсли;
	//Вывод шапки табличной части деталей клиента
	Если КоличествоДеталейКлиента > 0 тогда
		//>>Павличенко 06.05.19
		
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиКлиента");
		Если НЕ ВыводитьКод Тогда
			ВремТекст = ОбластьМакета.Область(4,4,4,4).Текст;
			ОбластьМакета.Область(4,3,4,9).Объединить();
			ОбластьМакета.Область(5,3,5,9).Объединить();
			ОбластьМакета.Область(4,3,4,9).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьМакета.Область(4,3,4,3).Текст = ВремТекст;
			Ном=3;
			Для Сч=3 По 10 Цикл
				Если обЗначениеНеЗаполнено(ОбластьМакета.Область(5,Сч+1,5,Сч+1).Текст) Тогда
					Продолжить;
				КонецЕсли;
				ОбластьМакета.Область(5,Сч+1,5,Сч+1).Текст=Ном;
				Ном=Ном+1;
			КонецЦикла;
		КонецЕсли;
		
		ОбластьШапкаДеталейКлиента = ОбластьМакета.ПолучитьОбласть("ШапкаДеталейКлиента");
		
		ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
		ОбластьМакета.Параметры.ДатаДок  = Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
		Если ВыводитьКод Тогда
			ОбластьМакета.Параметры.ИмяКолонкиКодов=КолонкаКода.Синоним;
		КонецЕсли;
		// Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		ТабДокВрем.Очистить();
		ТабДокВрем.Вывести(ОбластьМакета);
		//ТабДокВрем.Вывести(ОбластьШапкаДеталей);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТоварыКлиента[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		Если КоличествоДеталейКлиента = 10 Тогда
			//присутствуют только пустые строки
			ТекОбласть.АвтовысотаСтроки = Ложь;
			ТекОбласть.ВысотаСтроки = 22;
		Иначе
			//присутствуют заполненные строки (заполняем не все параметры - только наиболее вероятно длинные)
			ТекТовар = СтрокаДеталей.Номенклатура;
			ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		КонецЕсли;
		ТекОбласть.АвтовысотаСтроки = Истина;
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДеталиКлиента);
		Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Перечень деталей клиента к заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталейКлиента.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталейКлиента.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		
		//Вывод табличной части деталей клиента
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
		
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалДеталейКлиента);
		Для каждого СтрокаДеталей Из ТаблТоварыКлиента Цикл
			Ном = Ном + 1;
			ТекОбласть = ОбластьСтрокаДеталейКлиента.Область(1, , 1,);
			ОбластьСтрокаДеталейКлиента.Параметры.НомСтр = Ном;
			//Если Ном > (КоличествоДеталейКлиента-10) Тогда
			Если Ном > (КоличествоДеталейКлиента) Тогда
				//установим для пустой строки высоту, равную двум строкам. Параметры не заполняем
				ТекОбласть.АвтовысотаСтроки = Ложь;
				ТекОбласть.ВысотаСтроки = 22;
				Если ВыводитьКод Тогда
					ОбластьСтрокаДеталейКлиента.Параметры.Код="";
				КонецЕсли;
				ОбластьСтрокаДеталейКлиента.Параметры.Номенклатура = "";
				ОбластьСтрокаДеталейКлиента.Параметры.Наименование = "";
				ОбластьСтрокаДеталейКлиента.Параметры.Количество = "";
				ОбластьСтрокаДеталейКлиента.Параметры.Единица = "";
				Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
					ОбластьСтрокаПримечаниеНоменклатураКлиента.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
				КонецЕсли;
			Иначе
				//заполним параметры
				ТекТоварКлиента = СтрокаДеталей.Номенклатура;
				Если ВыводитьКод Тогда
					ОбластьСтрокаДеталейКлиента.Параметры.Код=дкПолучитьЗначениеКолонкиКода(ТекТоварКлиента,ИмяРеквизитаКода,ЭтотОбъект,Истина);
				КонецЕсли;
				ОбластьСтрокаДеталейКлиента.Параметры.Номенклатура = ТекТоварКлиента;
				ОбластьСтрокаДеталейКлиента.Параметры.Наименование = спПолучитьНаименование(ТекТоварКлиента);
				ОбластьСтрокаДеталейКлиента.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
				ОбластьСтрокаДеталейКлиента.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
				Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
					ОбластьСтрокаПримечаниеНоменклатураКлиента.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
				КонецЕсли;	
				// Обновим итоги по документу
				ИтогоКоличествоДеталейКлиента = ИтогоКоличествоДеталейКлиента + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталейКлиента, ОбластьШапкаДеталейКлиента, ОбластьИтоговПоСтраницеДеталиКлиента, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, ?(Ном=КоличествоДеталей, МассивОбластиПодвала, Неопределено));
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатураКлиента);	
			КонецЕсли;	
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
		КонецЦикла;
		
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДеталиКлиента, СтруктураИтоговПоСтранице, ЭтотОбъект);
		КонецЕсли;
		
		//Вывод подвала табличной части деталей клиента
		ОбластьПодвалДеталейКлиента.Параметры.КоличествоДеталейЗаказчика = Формат(ИтогоКоличествоДеталейКлиента, ФорматВыводаКоличества);
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталейКлиента, , , НомерСтраницы, , ЭтотОбъект);
	КонецЕсли;
	//Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Сумма = Формат(ИтогоСуммаРабот + ИтогоСуммаДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.УсловияПриема = обПраво("УсловияПриемаАвтомобиляВРемонт", Права,,ЭтотОбъект);
	ОбластьМакета.Параметры.Мастер = Мастер;
	//<<Павличенко 06.05.19
	//ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Диспетчер.Наименование;
	//>>Павличенко 06.05.19
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);
	
	ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
	ТабДокумент.ВерхнийКолонтитул.Выводить=Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница=2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа="Заявка по заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаСоздания,"ДФ = дд.ММ.гггг");
	ТабДокумент.ВерхнийКолонтитул.Шрифт = Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
	//<<Павличенко 07.03.19
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//|	ТабицаЗаказНаряд.Номер,
	//|	ТабицаЗаказНаряд.ВидРемонта,
	//|	ТабицаЗаказНаряд.Состояние,
	//|	ТабицаЗаказНаряд.ДатаСоздания,
	//|	ТабицаЗаказНаряд.Ссылка КАК ЗаказНаряд
	//|ИЗ
	//|	Документ.ЗаказНаряд КАК ТабицаЗаказНаряд
	//|ГДЕ
	//|	ТабицаЗаказНаряд.Автомобиль = &Автомобиль И 
	//|	((НЕ ТабицаЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)) И 
	//|	(НЕ ТабицаЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))) И 
	//|	ТабицаЗаказНаряд.ПометкаУдаления = ЛОЖЬ И 
	//|	(НЕ ТабицаЗаказНаряд.Ссылка = &Ссылка)");
	//Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	//Запрос.УстановитьПараметр("Ссылка",     Ссылка);
	//
	//ТаблицаЗН = Запрос.Выполнить().Выгрузить();
	//
	//Если ТаблицаЗН.Количество() > 0 Тогда
	//	
	//	//Вывод шапки табличной части деталей
	//	ОбластьСписокОткрытыхЗН.Параметры.Автомобиль             = Автомобиль;
	//	ОбластьСписокОткрытыхЗН.Параметры.АвтомобильПредставление = СокрЛП(Автомобиль);
	//	
	//	//Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
	//	ТабДокВрем = Новый ТабличныйДокумент;
	//	ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
	//	ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
	//	ТабДокВрем.Вывести(ОбластьСписокОткрытыхЗН);
	//	ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаСписокОткрытыхЗН");
	//	
	//	ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
	//	ОбластьМакетаСтрокаВрем.Параметры.Заполнить(ТаблицаЗН[0]);
	//	
	//	ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
	//	ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеСписокЗН);
	//	Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
	//		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	ТабДокумент.Вывести(ОбластьСписокОткрытыхЗН);
	//	
	//	НомерСтраницы = 2;
	//	НомерСтраницыПред = 2;
	//	ТекстЗаголовка = "Список заказ-нарядов по " + СокрЛП(Автомобиль);
	//	
	//	ОбластьШапкаСписокОткрытыхЗН = ОбластьСписокОткрытыхЗН.ПолучитьОбласть("ШапкаСписокОткрытыхЗН");
	//	
	//	//заполним параметры шапки таблицы для следующего листа
	//	ОбластьШапкаСписокОткрытыхЗН.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	//	ОбластьШапкаСписокОткрытыхЗН.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	//	
	//	СтруктураИтоговПоСтранице = Новый Структура;
	//	
	//	КоличествоЗН = ТаблицаЗН.Количество();
	//	
	//	//Вывод табличной части открытые заказ-наряды
	//	Ном = 0;
	//	МассивОбластиПодвала = Новый Массив;
	//	МассивОбластиПодвала.Добавить(ОбластьПодвалСписокОткрытыхЗН);
	//	Для каждого СтрокаЗН из ТаблицаЗН Цикл
	//		Ном = Ном + 1;
	//		
	//		ОбластьСтрокаСписокОткрытыхЗН.Параметры.Заполнить(СтрокаЗН);
	//		ОбластьСтрокаСписокОткрытыхЗН.Параметры.НомСтр = Ном;
	//		
	//		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаСписокОткрытыхЗН, ОбластьШапкаСписокОткрытыхЗН, ОбластьИтоговПоСтраницеСписокЗН, НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(Ном=КоличествоЗН, МассивОбластиПодвала, Неопределено));
	//		
	//		//инициализация итогов по странице
	//		Если НомерСтраницы <> НомерСтраницыПред Тогда
	//			НомерСтраницыПред = НомерСтраницы;
	//			ОбластьШапкаСписокОткрытыхЗН.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//	//довыводим последний итог по странице, если страниц больше единицы
	//	Если НомерСтраницы > 2 Тогда
	//		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеСписокЗН, СтруктураИтоговПоСтранице, ЭтотОбъект);
	//	КонецЕсли;
	//	
	//	//Вывод подвала табличной части деталей
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалСписокОткрытыхЗН, , , НомерСтраницы, , ЭтотОбъект);
	//КонецЕсли;
	//>>Павличенко 07.03.19	
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "ПриемныйАкт"
// Возвращает сформированный табличный документ:
Функция ПечатьПриемныйАкт(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ПриемныйАкт");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаСоздания = Формат(ДатаСоздания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Автомобиль = Автомобиль.Модель;
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли; 
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ОбластьМакета.Параметры.Диспетчер = Диспетчер;
	ОбластьМакета.Параметры.ДиспетчерПолноеНаименование = Диспетчер.Наименование;
	ТабДокумент.Вывести(ОбластьМакета);
	
	//Вывод подвала документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.УсловияПриема = обПраво("УсловияПриемаАвтомобиляВРемонт",Права,,ЭтотОбъект);
	ОбластьМакета.Параметры.Организация = Организация;
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ФирмаАдресПочтовый = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "ЗаказНаряд"
// Возвращает сформированный табличный документ:
Функция ПечатьЗаказНаряд(ТабДокумент) Экспорт
	
	
	//misha
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),ДатаСоздания,ДатаЗакрытия);	
	//ДатаПечатная = ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДатаОкончания),ЭтотОбъект.ДатаСоздания,ЭтотОбъект.ДатаОкончания);
	//ДатаПечатная = ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДатаЗакрытия),ЭтотОбъект.ДатаСоздания,ЭтотОбъект.ДатаЗакрытия);
	//misha	
	
	Если ЭтотОбъект.Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		//Контроль запрета печати без закрытия
		Если НЕ обПраво("ПечатьЗаказНарядаБезЗакрытия",Права,,ЭтотОбъект) Тогда     
			Сообщить("Печать заказ-наряда без его закрытия запрещена.");
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	//Контроль запрета печати при наличии открытых заказ-нарядов
	Если НЕ обПраво("ПечатьЗаказНарядаПриНаличииОткрытых",Права,,ЭтотОбъект) Тогда  
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказНаряд.Ссылка) КАК Количество
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт) И
		|	ЗаказНаряд.ПометкаУдаления = ЛОЖЬ И
		|	ЗаказНаряд.Заказчик = &Заказчик И
		|	ЗаказНаряд.Ссылка <> &ЭтотДокумент";
		Запрос.УстановитьПараметр("Заказчик",ЭтотОбъект.Заказчик);
		Запрос.УстановитьПараметр("ЭтотДокумент",ЭтотОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Количество>0 Тогда
				Сообщить("Печать заказ-наряда заказчика "+ЭтотОбъект.Заказчик.НаименованиеПолное+" запрещено, так как у него имеются другие открытые заказ-наряды.");
				Возврат Неопределено;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);  
	
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаТоваров=ЭтотОбъект.Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаТоваров,ЭтотОбъект,ВалютаПечатногоДокумента);   	
	ТаблицаРабот=ЭтотОбъект.Работы.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);  	
	Макет = ПолучитьМакет("ЗаказНаряд");
	ВыводитьКод = обПраво("ВыводитьКодВПечатныхФормах",Права,ЭтотОбъект);
	ВыводитьПроизводителя = обПраво("ВыводитьПроизводителяВПечатныхФормах",Права,,ЭтотОбъект);
	
	ЕстьСкидкаПоДеталям = Ложь;
	Если ЭтотОбъект.Товары.Итог("СуммаСкидки")<>0 ИЛИ ЭтотОбъект.Товары.Итог("СуммаСкидкиСтроки")<>0 ИЛИ ЭтотОбъект.Товары.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоДеталям = Истина;
	КонецЕсли;
	
	ЕстьСкидкаПоРаботам = Ложь;
	Если ЭтотОбъект.Работы.Итог("СуммаСкидки")<>0 ИЛИ ЭтотОбъект.Работы.Итог("СуммаСкидкиСтроки")<>0 ИЛИ ЭтотОбъект.Работы.Итог("СуммаСкидкиБонусами")<>0 Тогда
		ЕстьСкидкаПоРаботам = Истина;
	КонецЕсли;
	
	//зададим параметры макета 
	
	//<<Павличенко 31.10.18 по заявке Духу
	ТабДокумент.ПолеСверху = 10; //поле равно высоте колонтитулов
	//ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСлева  = 20;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 10;
	//ТабДокумент.ПолеСправа = 0;
	//>>Павличенко 31.10.18	 
		
	//ТабДокумент.ПолеСверху = 10; //поле равно высоте колонтитулов
	//ТабДокумент.ПолеСлева  = 0;
	//ТабДокумент.ПолеСнизу  = 0;
	//ТабДокумент.ПолеСправа = 0;  
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ОбластьСкидка = Макет.Область("Скидка");
	
	ОбластьУслуги = Макет.ПолучитьОбласть("Услуги");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");
	
	ОбластьСтрокаДеталей	            = Макет.ПолучитьОбласть("СтрокаДеталей");
	ОбластьСтрокаПримечаниеНоменклатура = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатура");
	ОбластьИтоговПоСтраницеДетали	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталей");
	ОбластьПодвалДеталей	            = Макет.ПолучитьОбласть("ПодвалДетали");
	ОбластьСтрокаУслуг		            = Макет.ПолучитьОбласть("СтрокаРабот");
	ОбластьСтрокаПримечаниеРаботы       = Макет.ПолучитьОбласть("СтрокаПримечаниеРаботы");
	ОбластьИтоговПоСтраницеУслуги	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеРабот");
	ОбластьПодвалУслуг		            = Макет.ПолучитьОбласть("ПодвалУслуги");
	
	ОбластьШапкаДеталейКлиента				    = Макет.ПолучитьОбласть("ШапкаДеталейКлиента");
	ОбластьСтрокаПримечаниеНоменклатураКлиента  = Макет.ПолучитьОбласть("СтрокаПримечаниеНоменклатураКлиента");
	ОбластьСтрокаДеталейКлиента				    = Макет.ПолучитьОбласть("СтрокаДеталейКлиента");
	ОбластьИтоговПоСтраницеДеталиКлиента	    = Макет.ПолучитьОбласть("ИтогиПоСтраницеДеталейКлиента");
	ОбластьПодвалДеталейКлиента 			    = Макет.ПолучитьОбласть("ПодвалКлиента");
	
	ОбластьШапкаМатериалов    = Макет.ПолучитьОбласть("ШапкаМатериалов");
	ОбластьСтрокаМатериалов   = Макет.ПолучитьОбласть("СтрокаМатериалов");
	
	ОбластьУслугиРекомендацииШапка = Макет.ПолучитьОбласть("УслугиРекомендацииШапка");
	ОбластьУслугиРекомендацииСтрока= Макет.ПолучитьОбласть("УслугиРекомендацииСтрока");
	ОбластьУслугиРекомендацииПодвал= Макет.ПолучитьОбласть("УслугиРекомендацииПодвал");

	ОбластьДеталиРекомендацииШапка = Макет.ПолучитьОбласть("ДеталиРекомендацииШапка");
	ОбластьДеталиРекомендацииСтрока= Макет.ПолучитьОбласть("ДеталиРекомендацииСтрока");
	ОбластьДеталиРекомендацииПодвал= Макет.ПолучитьОбласть("ДеталиРекомендацииПодвал");
	
	БезЛинии = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
	ОбычнаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	// Настроем колонки вывода деталей если не было скидок
	Если Не ЕстьСкидкаПоДеталям Тогда
		ПоложениеШапкиДеталей = ОбластьДетали.Область("ШапкаДеталей").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 8 Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки,ПоложениеШапкиДеталей-1,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей-1,ПозицияКолонки-1,ПоложениеШапкиДеталей-1,ПозицияКолонки-1).Текст;
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки-1,ПоложениеШапкиДеталей,ПозицияКолонки-1).Текст;
			
			ОбластьИсточник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеДетали.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалДеталей.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
		
		ОбластьДетали.Область(ПоложениеШапкиДеталей-1, 4, ПоложениеШапкиДеталей-1, 9).Объединить();
		ОбластьДетали.Область(ПоложениеШапкиДеталей, 4, ПоложениеШапкиДеталей, 9).Объединить();
		ОбластьСтрокаДеталей.Область(1, 4, 1, 9).Объединить();
		
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 2, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 2, 1, 9);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьИтоговПоСтраницеДетали.Область(1, 11, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьПодвалДеталей.Область(1, 11, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		Пока ПозицияКолонки <= ОбластьДетали.ШиринаТаблицы Цикл
			ОбластьДетали.Область(ПоложениеШапкиДеталей,ПозицияКолонки,ПоложениеШапкиДеталей,ПозицияКолонки).Текст = ПозицияКолонки-6;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
	// Настроем колонки вывода услуг если не было скидок
	Если Не ЕстьСкидкаПоРаботам Тогда
		ПоложениеШапкиУслуг = ОбластьУслуги.Область("ШапкаУслуг").Низ;
		ПозицияКолонки = ОбластьСкидка.Лево;
		Пока ПозицияКолонки > 7 Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки,ПоложениеШапкиУслуг-1,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг-1,ПозицияКолонки-1,ПоложениеШапкиУслуг-1,ПозицияКолонки-1).Текст;
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки-1,ПоложениеШапкиУслуг,ПозицияКолонки-1).Текст;
			
			ОбластьИсточник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьИтоговПоСтраницеУслуги.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьПодвалУслуг.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьШапкаМатериалов.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьШапкаМатериалов.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ОбластьИсточник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки-1,1,ПозицияКолонки-1);
			ОбластьПриемник = ОбластьСтрокаМатериалов.Область(1,ПозицияКолонки,1,ПозицияКолонки);
			ЗаполнитьЗначенияСвойств(ОбластьПриемник, ОбластьИсточник);
			
			ПозицияКолонки = ПозицияКолонки-1;
		КонецЦикла;
		
		ОбластьУслуги.Область(ПоложениеШапкиУслуг-1, 4, ПоложениеШапкиУслуг-1, 8).Объединить();
		ОбластьУслуги.Область(ПоложениеШапкиУслуг, 4, ПоложениеШапкиУслуг, 8).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 8).Объединить();
		ОбластьСтрокаУслуг.Область(1, 4, 1, 8).ГраницаСнизу = БезЛинии;
		
		ОбластьСтрокаМатериалов.Область(1, 6, 1, 8).Объединить();
		
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 2, 1, 8);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 2, 1, 8);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСнизу = БезЛинии;
		
		ТекОбласть = ОбластьИтоговПоСтраницеУслуги.Область(1, 10, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ТекОбласть = ОбластьПодвалУслуг.Область(1, 10, 1, 12);
		ТекОбласть.Объединить();
		ТекОбласть.ГраницаСлева = ОбычнаяЛиния;
		ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ТекОбласть.Текст = "на сумму:";
		
		ПозицияКолонки = ОбластьСкидка.Лево-1;
		Пока ПозицияКолонки <= ОбластьУслуги.ШиринаТаблицы Цикл
			ОбластьУслуги.Область(ПоложениеШапкиУслуг,ПозицияКолонки,ПоложениеШапкиУслуг,ПозицияКолонки).Текст = ПозицияКолонки-5;
			ПозицияКолонки = ПозицияКолонки + 1;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ВыводитьКод Тогда
		ВремОбластьДетали=ОбластьУслуги.Область(4,4,4,4).Текст;
		ОбластьУслуги.Область(4,3,4,7).Объединить();
		ОбластьУслуги.Область(5,3,5,7).Объединить();
		ОбластьУслуги.Область(4,3,4,4).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьУслуги.Область(4,3,4,3).Текст=ВремОбластьДетали;
		
		ОбластьСтрокаУслуг.Область(1,3,1,7).Объединить();
		ОбластьСтрокаУслуг.Область(1,3,1,7).Параметр=ВремОбластьДетали;
		ОбластьСтрокаУслуг.Область(1,3,1,7).ПараметрРасшифровки="Номенклатура";
		
		ВремОбластьДетали=ОбластьДетали.Область(4,4,4,4).Текст;
		ОбластьДетали.Область(4,3,4,8).Объединить();
		ОбластьДетали.Область(5,3,5,8).Объединить();
		ОбластьДетали.Область(4,3,4,4).Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьДетали.Область(4,3,4,3).Текст=ВремОбластьДетали;
		
		ОбластьСтрокаДеталей.Область(1,3,1,8).Объединить();
		ОбластьСтрокаДеталей.Область(1,3,1,8).Параметр=ВремОбластьДетали;
		ОбластьСтрокаДеталей.Область(1,3,1,8).ПараметрРасшифровки="Номенклатура";
		
		ВремТекст = ОбластьШапкаДеталейКлиента.Область(2,4,2,4).Текст;
		ОбластьШапкаДеталейКлиента.Область(2,3,5,7).Объединить();
		ОбластьШапкаДеталейКлиента.Область(3,3,6,7).Объединить();
		ОбластьШапкаДеталейКлиента.Область(2,3,5,7).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьШапкаДеталейКлиента.Область(3,3,5,3).Текст = ВремТекст;
		
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,7).Объединить();
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,7).Параметр=ВремОбластьДетали;
		ОбластьСтрокаДеталейКлиента.Область(1,3,1,3).ПараметрРасшифровки="Номенклатура";
		
	КонецЕсли;	
	
	ОбластьШапкаУслуг = ОбластьУслуги.ПолучитьОбласть("ШапкаУслуг");
	ОбластьШапкаДеталей = ОбластьДетали.ПолучитьОбласть("ШапкаДеталей");
	// инициализация итогов по документу
	ИтогоСуммаРабот	              = 0;
	ИтогоСуммаНДСРабот            = 0;
	ИтогоСуммаСкидкиРабот         = 0;
	ИтогоКоличествоРабот          = 0;
	ИтогоСуммаДеталей	          = 0;
	ИтогоСуммаНДСДеталей          = 0;
	ИтогоСуммаСкидкиДеталей       = 0;
	ИтогоКоличествоДеталей        = 0;
	ИтогоКоличествоДеталейКлиента = 0;
	
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);  
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект); 
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);  	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Организация = ЭтотОбъект.Организация;   
	
	//bz
	//misha
	ОбластьМакета.Параметры.ОрганизацияИНН = ЭтотОбъект.Организация.ИНН;	
	//misha
		
	ОбластьМакета.Параметры.ФирмаПолноеНаименование = спПолучитьНаименование(ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ОбластьМакета.Параметры.ФирмаАдресЮридический)) Тогда
		ОбластьМакета.Параметры.ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ЭтотОбъект.Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная,"ДФ=дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = ЭтотОбъект.Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(ЭтотОбъект.Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(ЭтотОбъект.Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(ЭтотОбъект.Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Если ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
		ОбластьМакета.Параметры.Контрагент = ЭтотОбъект.Организация;
		ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(ЭтотОбъект.Организация);
		ОбластьМакета.Параметры.КонтрагентИНН = ЭтотОбъект.Организация.ИНН;
		ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(ЭтотОбъект.Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(ЭтотОбъект.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Иначе
		ОбластьМакета.Параметры.Контрагент = ЭтотОбъект.Контрагент;
		ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(ЭтотОбъект.Контрагент);
		ОбластьМакета.Параметры.КонтрагентИНН = ЭтотОбъект.Контрагент.ИНН;
		ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(ЭтотОбъект.Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(ЭтотОбъект.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = ЭтотОбъект.Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = ЭтотОбъект.Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = ЭтотОбъект.Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(ЭтотОбъект.Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ЭтотОбъект.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ЭтотОбъект.ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(ЭтотОбъект.Пробег,"ЧЦ=10");
	КонецЕсли;
	
	//ОбластьМакета.Рисунки.Принят.Параметр = "Принят:
	//|" + Формат(ЭтотОбъект.ДатаСоздания, "ДФ = дд.ММ.гггг");  
	
	//anton
	Если ВидРемонта=Справочники.ВидыРемонта.ДополнительноеОборудование Тогда
		ОбластьМакета.Рисунки.Принят.Параметр = "Принят:";
	Иначе
		ОбластьМакета.Рисунки.Принят.Параметр = "Принят:
		|" + Формат(ЭтотОбъект.ДатаСоздания, "ДФ=""дд ММММ гггг 'г.' ЧЧ:мм:сс""");
	КонецЕсли;
	//anton	
	
	ОбластьМакета.Рисунки.ВидРемонта.Параметр = "Вид ремонта:
	|" + ЭтотОбъект.ВидРемонта.Наименование;
	ОбластьМакета.Рисунки.ВидРемонта.Расшифровка = ЭтотОбъект.ВидРемонта;
	ОбластьМакета.Рисунки.Диспетчер.Параметр = "Диспетчер:
	|" + ЭтотОбъект.Диспетчер.Наименование;
	ОбластьМакета.Рисунки.Диспетчер.Расшифровка = ЭтотОбъект.Диспетчер;
	ОбластьМакета.Рисунки.Мастер.Параметр = "Мастер:
	|" + ЭтотОбъект.Мастер.Наименование;
	ОбластьМакета.Рисунки.Мастер.Расшифровка = ЭтотОбъект.Мастер;
	ОбластьМакета.Рисунки.СрокИсполнения.Параметр = "Срок исполнения:
	|" + Формат(ЭтотОбъект.ДатаОкончания, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Рисунки.Состояние.Параметр = ЭтотОбъект.Состояние;
	ОбластьМакета.Параметры.Валюта = ВалютаПечатногоДокумента;
	
	ТабДокумент.Вывести(ОбластьМакета); 
	
	//misha
	Если Заказчик.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		ОбластьМакета=Макет.ПолучитьОбласть("СогласиеНаОбрДанных");	
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	//misha	    
		
	КолонкаКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект);  
	
	//Временная таблица
	Табл = ТаблицаРабот.Скопировать();
	КоличествоРабот = Табл.Количество();
	
	// инициализация итогов по документу
	ИтогоСуммаРабот		= 0;
	ИтогоСуммаНДСРабот	= 0;
	
	Если КоличествоРабот = 0 Тогда
		//не выводим
	Иначе
		//Вывод шапки табличной части работ(услуг)
		ОбластьУслуги.Параметры.НомерДок = НомерДляПечати;
		ОбластьУслуги.Параметры.ДатаДок = Формат(ДатаПечатная, "ДФ=дд.ММ.гггг");
		Если ВыводитьКод Тогда
			ОбластьУслуги.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьУслуги);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Выполненные работы по заказ-наряду №  "+НомерДляПечати+" от "+Формат(ДатаПечатная, "ДФ=дд.ММ.гггг");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаУслуг.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод тогда
			ОбластьШапкаУслуг.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части работ
		Ном	= 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
		
		МассивМатериалов   = Новый Массив;
		Для каждого СтрокаРабот Из Табл Цикл
			Ном = Ном + 1;
			ОбластьСтрокаУслуг.Параметры.НомСтр = Ном;
			Если ВыводитьКод Тогда
				ОбластьСтрокаУслуг.Параметры.Код = дкПолучитьЗначениеКолонкиКода(СтрокаРабот.Работа,ИмяРеквизитаКода,ЭтотОбъект);  
			КонецЕсли;
			ОбластьСтрокаУслуг.Параметры.Номенклатура = СтрокаРабот.Работа;
			ОбластьСтрокаУслуг.Параметры.Наименование = спПолучитьНаименование(СтрокаРабот.Работа);
			ОбластьСтрокаУслуг.Параметры.Цена = Формат(СтрокаРабот.Цена, "ЧЦ=15; ЧДЦ=2");
			Если ЕстьСкидкаПоРаботам Тогда
				ОбластьСтрокаУслуг.Параметры.Скидка = Формат(СтрокаРабот.СуммаСкидки+СтрокаРабот.СуммаСкидкиСтроки + СтрокаРабот.СуммаСкидкиБонусами, ФорматВыводаСуммы);
			КонецЕсли;
			ОбластьСтрокаУслуг.Параметры.Коэффициент = Формат(СтрокаРабот.Коэффициент, "ЧЦ=10; ЧДЦ=3");
			ОбластьСтрокаУслуг.Параметры.Количество = Формат(СтрокаРабот.Количество, ФорматВыводаКоличества);
			ОбластьСтрокаУслуг.Параметры.Единица = СтрокаРабот.Нормочас;
			ОбластьСтрокаУслуг.Параметры.Сумма = Формат(СтрокаРабот.СуммаВсего, ФорматВыводаСуммы);
			ОбластьСтрокаУслуг.Параметры.НДС = Формат(СтрокаРабот.СуммаНДС, ФорматВыводаСуммы);
			Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
				ОбластьСтрокаПримечаниеРаботы.Параметры.ПримечаниеРаботы = СтрокаРабот.ПримечаниеРаботыПечать;
			КонецЕсли;
			
			МассивОбластиПодвала = Новый Массив;
			МассивОбластиПодвала.Очистить();
			
			МассивМатериалов   = ЭтотОбъект.Материалы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабот.ИдентификаторРаботы));
			
			Если МассивМатериалов.Количество() > 0 Тогда
				ТабДокВрем = Новый ТабличныйДокумент;
				ТабДокВрем.ПолеСверху = 10;
				ТабДокВрем.ПолеСнизу  = 0;
				ТабДокВрем.ПолеСлева  = 0;
				ТабДокВрем.ПолеСправа = 0;
				ТабДокВрем.Вывести(ОбластьШапкаМатериалов);
				Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
					ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
					ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
					ТабДокВрем.Вывести(ОбластьСтрокаМатериалов);
				КонецЦикла;
				МассивОбластиПодвала.Добавить(ТабДокВрем);
			КонецЕсли;
			
			//доп. области
			МассивОбластиПодвала.Добавить(ОбластьСтрокаПримечаниеРаботы);
			МассивОбластиПодвала.Добавить(ОбластьИтоговПоСтраницеУслуги);
			Если Ном = КоличествоРабот Тогда
				МассивОбластиПодвала.Добавить(ОбластьПодвалУслуг);
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаУслуг, ОбластьШапкаУслуг, ОбластьИтоговПоСтраницеУслуги, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, МассивОбластиПодвала);   
			
			Если МассивМатериалов.Количество() > 0 Тогда
				
				ТабДокумент.Вывести(ОбластьШапкаМатериалов);
				Для Каждого СтрокаМатериалов Из МассивМатериалов Цикл
					ОбластьСтрокаМатериалов.Параметры.Заполнить(СтрокаМатериалов);
					ОбластьСтрокаМатериалов.Параметры.Наименование = спПолучитьНаименование(СтрокаМатериалов.Номенклатура);
					ТабДокумент.Вывести(ОбластьСтрокаМатериалов);
				КонецЦикла;
				
			КонецЕсли;
			
			Если СтрокаРабот.ПримечаниеРаботыПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеРаботы);	
			КонецЕсли;
			
			// Обновим итоги по документу
			ИтогоКоличествоРабот  = ИтогоКоличествоРабот + СтрокаРабот.Количество;
			ИтогоСуммаРабот       = ИтогоСуммаРабот + СтрокаРабот.СуммаВсего;
			ИтогоСуммаНДСРабот    = ИтогоСуммаНДСРабот + СтрокаРабот.СуммаНДС;
			ИтогоСуммаСкидкиРабот = ИтогоСуммаСкидкиРабот + СтрокаРабот.СуммаСкидки + СтрокаРабот.СуммаСкидкиСтроки + СтрокаРабот.СуммаСкидкиБонусами;
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаУслуг.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			дкДобавитьИтогиПоСтранице(СтрокаРабот, СтруктураИтоговПоСтранице);
		КонецЦикла; 
		
		//выводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеУслуги, СтруктураИтоговПоСтранице, ЭтотОбъект); 
		КонецЕсли;
		
		//Вывод подвала табличной части услуг
		ОбластьПодвалУслуг.Параметры.Количество = Формат(ИтогоКоличествоРабот, ФорматВыводаКоличества);
		ОбластьПодвалУслуг.Параметры.Сумма = Формат(ИтогоСуммаРабот, ФорматВыводаСуммы);
		ОбластьПодвалУслуг.Параметры.НДС = Формат(ИтогоСуммаНДСРабот, ФорматВыводаСуммы);
		Если ЕстьСкидкаПоРаботам Тогда
			ОбластьПодвалУслуг.Параметры.Скидка = Формат(ИтогоСуммаСкидкиРабот, ФорматВыводаСуммы);
		КонецЕсли;
		
		ОбластьПодвалУслуг.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаРабот, ВалютаПечатногоДокумента);
		Если ИтогоСуммаНДСРабот <> 0 Тогда
			ОбластьПодвалУслуг.Параметры.ЧислоПрописью = ОбластьПодвалУслуг.Параметры.ЧислоПрописью + " в т.ч. НДС " + Формат(ИтогоСуммаНДСРабот, "ЧЦ=15; ЧДЦ=2") + " " + ВалютаПечатногоДокумента;
		КонецЕсли; 
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалУслуг, , , НомерСтраницы, , ЭтотОбъект);  
	КонецЕсли;
	
	// Формирование врем. таблиц товаров
	ТаблТовары = ТаблицаТоваров.Скопировать();
	ТаблТоварыКлиента = ЭтотОбъект.МатериалыЗаказчика.Выгрузить();
	
	КоличествоДеталей = ТаблТовары.Количество();
	КоличествоДеталейКлиента = ТаблТоварыКлиента.Количество();
	
	ТабДокВрем = Новый ТабличныйДокумент;
	ТабДокВрем.ПолеСверху = 10; ТабДокВрем.ПолеСнизу  = 0;
	ТабДокВрем.ПолеСлева  = 0; ТабДокВрем.ПолеСправа = 0;
	
	Если КоличествоДеталей = 0 Тогда
		//не выводим
	Иначе
		// Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		Если ВыводитьКод Тогда
			ОбластьДетали.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ТабДокВрем.Вывести(ОбластьДетали);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТовары[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		//присутствуют заполненные строки (заполняем не все параметры - только наиболее вероятно длинные)
		ТекТовар = СтрокаДеталей.Номенклатура;
		
		ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДетали);
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Исключение
		КонецПопытки;
		ОбластьДетали.Параметры.НомерДок = НомерДляПечати;
		ОбластьДетали.Параметры.ДатаДок = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
		ТабДокумент.Вывести(ОбластьДетали);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Расходная накладная к заказ-наряду №  "+НомерДляПечати+" от "+Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталей.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталей.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части деталей
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
		
		МассивОбластиПодвала = Новый Массив;
		МассивОбластиПодвала.Добавить(ОбластьПодвалДеталей);
		Для каждого СтрокаДеталей Из ТаблТовары Цикл
			Ном = Ном + 1;
			
			ОбластьСтрокаДеталей.Параметры.НомСтр = Ном;
			ТекТовар = СтрокаДеталей.Номенклатура;
			Если ВыводитьКод Тогда
				ОбластьСтрокаДеталей.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекТовар,ИмяРеквизитаКода,ЭтотОбъект,ВыводитьПроизводителя); 
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.Номенклатура = ТекТовар;
			ОбластьСтрокаДеталей.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
			ОбластьСтрокаДеталей.Параметры.Цена = Формат(СтрокаДеталей.Цена, "ЧЦ=15; ЧДЦ=2");
			Если ЕстьСкидкаПоДеталям Тогда
				ОбластьСтрокаДеталей.Параметры.Скидка = Формат(СтрокаДеталей.СуммаСкидки+СтрокаДеталей.СуммаСкидкиСтроки+СтрокаДеталей.СуммаСкидкиБонусами, ФорматВыводаСуммы);
			КонецЕсли;
			ОбластьСтрокаДеталей.Параметры.Количество = Формат(СтрокаДеталей.Количество, ФорматВыводаКоличества);
			ОбластьСтрокаДеталей.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
			ОбластьСтрокаДеталей.Параметры.Сумма = Формат(СтрокаДеталей.СуммаВсего, ФорматВыводаСуммы);
			ОбластьСтрокаДеталей.Параметры.НДС = Формат(СтрокаДеталей.СуммаНДС, ФорматВыводаСуммы);
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				ОбластьСтрокаПримечаниеНоменклатура.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
			КонецЕсли;
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьСтрокаПримечаниеНоменклатура);
			мсвДопОбластиПодвала.Добавить(ОбластьИтоговПоСтраницеДетали);
			Если Ном=КоличествоДеталей Тогда
				мсвДопОбластиПодвала.Добавить(ОбластьПодвалДеталей);
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталей, ОбластьШапкаДеталей, ОбластьИтоговПоСтраницеДетали, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, мсвДопОбластиПодвала);
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатура);	
			КонецЕсли;
			
			// Обновим итоги по документу
			ИтогоКоличествоДеталей = ИтогоКоличествоДеталей + СтрокаДеталей.Количество;
			ИтогоСуммаДеталей		= ИтогоСуммаДеталей		+ СтрокаДеталей.СуммаВсего;
			ИтогоСуммаНДСДеталей	= ИтогоСуммаНДСДеталей	+ СтрокаДеталей.СуммаНДС;
			ИтогоСуммаСкидкиДеталей	= ИтогоСуммаСкидкиДеталей + СтрокаДеталей.СуммаСкидки + СтрокаДеталей.СуммаСкидкиСтроки + СтрокаДеталей.СуммаСкидкиБонусами;
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки, Количество", 0, 0, 0, 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталей.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			//СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + СтрокаДеталей.СуммаВсего;
			//СтруктураИтоговПоСтранице.СуммаНДС   = СтруктураИтоговПоСтранице.СуммаНДС + СтрокаДеталей.СуммаНДС;
			//СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество
			//+ СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			//СтруктураИтоговПоСтранице.СуммаСкидки = СтруктураИтоговПоСтранице.СуммаСкидки + СтрокаДеталей.СуммаСкидки;
			дкДобавитьИтогиПоСтранице(СтрокаДеталей, СтруктураИтоговПоСтранице);
		КонецЦикла;
		
		//выводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДетали, СтруктураИтоговПоСтранице, ЭтотОбъект); 
		КонецЕсли;
		
		//Вывод подвала табличной части деталей
		ОбластьПодвалДеталей.Параметры.Количество = Формат(ИтогоКоличествоДеталей, ФорматВыводаКоличества);
		ОбластьПодвалДеталей.Параметры.Сумма = Формат(ИтогоСуммаДеталей, ФорматВыводаСуммы);
		ОбластьПодвалДеталей.Параметры.НДС = Формат(ИтогоСуммаНДСДеталей, ФорматВыводаСуммы);
		Если ЕстьСкидкаПоДеталям Тогда
			ОбластьПодвалДеталей.Параметры.Скидка = Формат(ИтогоСуммаСкидкиДеталей, ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьПодвалДеталей.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаДеталей, ВалютаПечатногоДокумента);
		Если ИтогоСуммаНДСДеталей <> 0 Тогда
			ОбластьПодвалДеталей.Параметры.ЧислоПрописью = ОбластьПодвалДеталей.Параметры.ЧислоПрописью + " в т.ч. НДС " +Формат(ИтогоСуммаНДСДеталей, ФорматВыводаСуммы) + " " + ВалютаПечатногоДокумента;
		КонецЕсли; 
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталей, , , НомерСтраницы, , ЭтотОбъект); 
	КонецЕсли;
	
	Если КоличествоДеталейКлиента = 0 Тогда
		//не выводим
	Иначе
		//Вывод шапки табличной части деталей клиента
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиКлиента");
		Если НЕ ВыводитьКод Тогда
			ВремТекст = ОбластьМакета.Область(5,4,5,4).Текст;
			ОбластьМакета.Область(5,3,5,7).Объединить();
			ОбластьМакета.Область(6,3,6,7).Объединить();
			ОбластьМакета.Область(5,3,5,7).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьМакета.Область(5,3,5,3).Текст = ВремТекст;
			Ном=3;
			Для Сч=3 По 10 Цикл
				Если обЗначениеНеЗаполнено(ОбластьМакета.Область(6,Сч+1,6,Сч+1).Текст) Тогда
					Продолжить;
				КонецЕсли;
				ОбластьМакета.Область(6,Сч+1,6,Сч+1).Текст=Ном;
				Ном=Ном+1;
			КонецЦикла;
			Ном=3;
			Для Сч=3 По 10 Цикл
				Если обЗначениеНеЗаполнено(ОбластьШапкаДеталейКлиента.Область(3,Сч+1,3,Сч+1).Текст) Тогда
					Продолжить;
				КонецЕсли;
				ОбластьШапкаДеталейКлиента.Область(3,Сч+1,3,Сч+1).Текст=Ном;
				Ном=Ном+1;
			КонецЦикла;
		КонецЕсли;
		// Если помещается только шапка, но ни одной строчки, то шапку переносим на след. страницу
		Если ВыводитьКод Тогда
			ОбластьМакета.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		ТабДокВрем.Очистить();
		ТабДокВрем.Вывести(ОбластьМакета);
		ОбластьМакетаСтрокаВрем = Макет.ПолучитьОбласть("СтрокаДеталей");
		СтрокаДеталей = ТаблТоварыКлиента[0];
		ТекОбласть = ОбластьМакетаСтрокаВрем.Область(1, , 1, );
		ТекТовар = СтрокаДеталей.Номенклатура;
		ОбластьМакетаСтрокаВрем.Параметры.Наименование = спПолучитьНаименование(ТекТовар);
		ТабДокВрем.Вывести(ОбластьМакетаСтрокаВрем);
		ТабДокВрем.Вывести(ОбластьИтоговПоСтраницеДеталиКлиента);
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ТабДокВрем) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Исключение
		КонецПопытки;
		ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
		ОбластьМакета.Параметры.ДатаДок  = Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
		ТабДокумент.Вывести(ОбластьМакета);
		
		НомерСтраницы = 2;
		НомерСтраницыПред = 2;
		ТекстЗаголовка = "Перечень деталей клиента к заказ-наряду № "+НомерДляПечати+" от "+Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
		
		//заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаДеталейКлиента.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Если ВыводитьКод Тогда
			ОбластьШапкаДеталейКлиента.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
		КонецЕсли;
		//Вывод табличной части деталей клиента
		Ном = 0;
		СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
		
		Для каждого СтрокаДеталей из ТаблТоварыКлиента Цикл
			Ном = Ном + 1;
			
			ОбластьСтрокаДеталейКлиента.Параметры.НомСтр = Ном;
			ТекТоварКлиента = СтрокаДеталей.Номенклатура;
			Если ВыводитьКод Тогда
				ОбластьСтрокаДеталейКлиента.Параметры.Код = дкПолучитьЗначениеКолонкиКода(ТекТоварКлиента,ИмяРеквизитаКода,ЭтотОбъект,Истина);  
			КонецЕсли;
			ОбластьСтрокаДеталейКлиента.Параметры.Номенклатура = ТекТоварКлиента;
			ОбластьСтрокаДеталейКлиента.Параметры.Наименование = спПолучитьНаименование(ТекТоварКлиента);
			ОбластьСтрокаДеталейКлиента.Параметры.Количество = Формат(СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент, ФорматВыводаКоличества);
			ОбластьСтрокаДеталейКлиента.Параметры.Единица = СтрокаДеталей.ЕдиницаИзмерения;
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				ОбластьСтрокаПримечаниеНоменклатураКлиента.Параметры.ПримечаниеНоменклатура = СтрокаДеталей.ПримечаниеНоменклатураПечать;
			КонецЕсли;
			// Обновим итоги по документу
			ИтогоКоличествоДеталейКлиента = ИтогоКоличествоДеталейКлиента + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
			
			//доп. области
			мсвДопОбластиПодвала = Неопределено;
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьСтрокаПримечаниеНоменклатураКлиента);
			мсвДопОбластиПодвала.Добавить(ОбластьИтоговПоСтраницеДеталиКлиента);
			Если Ном=КоличествоДеталейКлиента Тогда
				мсвДопОбластиПодвала.Добавить(ОбластьПодвалДеталейКлиента);
			КонецЕсли;
			
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаДеталейКлиента, ОбластьШапкаДеталейКлиента, ОбластьИтоговПоСтраницеДеталиКлиента, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект, мсвДопОбластиПодвала);  
			Если СтрокаДеталей.ПримечаниеНоменклатураПечать <> "" Тогда
				дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрокаПримечаниеНоменклатураКлиента);	
			КонецЕсли;
			
			//инициализация итогов по странице
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				СтруктураИтоговПоСтранице = Новый Структура("Количество", 0);
				НомерСтраницыПред = НомерСтраницы;
				ОбластьШапкаДеталейКлиента.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			
			//обновим итоги по странице
			СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + СтрокаДеталей.Количество*СтрокаДеталей.Коэффициент;
		КонецЦикла;
		
		//довыводим последний итог по странице, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтоговПоСтраницеДеталиКлиента, СтруктураИтоговПоСтранице, ЭтотОбъект); 
		КонецЕсли;
		
		//Вывод подвала табличной части деталей клиента
		ОбластьПодвалДеталейКлиента.Параметры.КоличествоДеталейЗаказчика = Формат(ИтогоКоличествоДеталейКлиента, ФорматВыводаКоличества);
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвалДеталейКлиента, , , НомерСтраницы, , ЭтотОбъект);  
	КонецЕсли;
	
	//Вывод подвала документа
	
	//ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНачало");
	
	ОбластьМакета.Параметры.Сумма = Формат(ИтогоСуммаРабот + ИтогоСуммаДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.НДС = Формат(ИтогоСуммаНДСРабот + ИтогоСуммаНДСДеталей, ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ЧислоПрописью = обЧислоПрописью(ИтогоСуммаРабот + ИтогоСуммаДеталей, ВалютаПечатногоДокумента);
	
	Если (ИтогоСуммаНДСРабот + ИтогоСуммаНДСДеталей) <> 0 Тогда
		ОбластьМакета.Параметры.ЧислоПрописью = ОбластьМакета.Параметры.ЧислоПрописью + " в т.ч. НДС " + Формат(ИтогоСуммаНДСРабот+ИтогоСуммаНДСДеталей, ФорматВыводаСуммы) + " " + ВалютаПечатногоДокумента;
	КонецЕсли; 
	
	// сформируем информацию о бонусных баллах
	ТекстБаллы = "";
	Если КоличествоКСписанию > 0 Тогда
		ТекстБаллы = ТекстБаллы + "Для оплаты использованы бонусные баллы в количестве " +КоличествоКСписанию+
		" на сумму "+(Товары.Итог("СуммаСкидкиБонусами")+Работы.Итог("СуммаСкидкиБонусами")) + " " + ВалютаДокумента +".";
	КонецЕсли;
	
	Если КоличествоКНачислению > 0 Тогда
		ТекстБаллы = ТекстБаллы +?(ПустаяСтрока(ТекстБаллы), "", " ")+ "Было начислено "+КоличествоКНачислению+" бонусных баллов на сумму в " +
		КоличествоКНачислению*Карточка.БонуснаяПрограмма.КратностьБонусов + " "+ Карточка.БонуснаяПрограмма.ВалютаБонуса+".";
	КонецЕсли;
	
	ОбластьМакета.Параметры.БонусныеБаллы = ТекстБаллы;
	
	Если ПустаяСтрока(ЭтотОбъект.Гарантии) Тогда
		ТекОбласть = ОбластьМакета.Область(9, , 9, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(9, 3, 9, 3).Текст = "";
	Иначе
		ОбластьМакета.Параметры.Гарантии = ЭтотОбъект.Гарантии;
	КонецЕсли;
	Если ПустаяСтрока(ЭтотОбъект.Рекомендации) Тогда
		ТекОбласть = ОбластьМакета.Область(11, , 11, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 1;
		ОбластьМакета.Область(11, 3, 11, 3).Текст = "";
	Иначе
		ОбластьМакета.Параметры.Рекомендации = ЭтотОбъект.Рекомендации;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Мастер) Тогда 
		ОбластьМакета.Параметры.МастерПолноеНаименование = "/" + ЭтотОбъект.Мастер.Наименование + "/";
	Иначе
		ОбластьМакета.Параметры.МастерПолноеНаименование = "/________________________/";
	КонецЕсли;
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);

	ТаблицаРекомендаций = ПолучитьТаблицыРекомендаций(ЭтотОбъект.Автомобиль,ЭтотОбъект,ВалютаПечатногоДокумента);
	НомерТаблицы = 1;	
	
	СуммаРекомендаций = 0;
	
	Пока НомерТаблицы <= 2 Цикл
		
		Если НомерТаблицы = 1 Тогда
			ТипОбластиСтрока = ОбластьУслугиРекомендацииСтрока;
			ТипОбластиШапка = ОбластьУслугиРекомендацииШапка;
			ТипОбластиПодвал = ОбластьУслугиРекомендацииПодвал;
			ТекстЗаголовка = "Рекомендованные работы";
			ТипТаблицы = "Услуги";
			
		Иначе
			ТипОбластиСтрока = ОбластьДеталиРекомендацииСтрока;
			ТипОбластиШапка = ОбластьДеталиРекомендацииШапка;
			ТипОбластиПодвал = ОбластьДеталиРекомендацииПодвал;
			ТекстЗаголовка = "Рекомендованные детали";
			ТипТаблицы = "Детали";
			
		КонецЕсли;
		
		Сч = 0;
		
		КоличествоСтрок	 = ТаблицаРекомендаций[ТипТаблицы].Количество();
		
		ТекОбластьПодвал = ТипОбластиПодвал;
		ТекОбластьПодвал.Параметры.Количество = ТаблицаРекомендаций["Количество"+ТипТаблицы];
		ТекОбластьПодвал.Параметры.Сумма = ТаблицаРекомендаций["Сумма"+ТипТаблицы];
		//ТекОбластьПодвал.Параметры.ЧислоПрописью = обЧислоПрописью(ТаблицаРекомендаций["Сумма"+ТипТаблицы],ВалютаПечатногоДокумента);
		
		СуммаРекомендаций = СуммаРекомендаций + ТаблицаРекомендаций["Сумма"+ТипТаблицы];
		
		Пока Сч < КоличествоСтрок   Цикл
			СтрокаТаблицы = ТаблицаРекомендаций[ТипТаблицы][Сч];
			ТекОбласть = ТипОбластиСтрока;
			ЗаполнитьЗначенияСвойств(ТекОбласть.Параметры,СтрокаТаблицы);
			//Если ВыводитьКод Тогда
			//	ТекОбласть.Параметры.Код = дкПолучитьЗначениеКолонкиКода(СтрокаТаблицы.Наименование,ИмяРеквизитаКода,ЭтотОбъект); 
			//КонецЕсли;
			
			ТекОбласть.Параметры.НомСтр = Сч + 1;
			
			Если Сч = 0 Тогда 
				ТекОбластьШапка = ТипОбластиШапка;
				ТекОбластьШапка.Параметры.ТекстЗаголовка = ТекстЗаголовка;
				//Если ВыводитьКод Тогда
				//	ТекОбластьШапка.Параметры.ИмяКолонкиКодов = КолонкаКода.Синоним;
				//КонецЕсли;
				
				МассивОбластей = Новый Массив();
				МассивОбластей.Добавить(ТекОбластьШапка);
				МассивОбластей.Добавить(ТекОбласть);
				Попытка
					Если НЕ ТабДокумент.ПроверитьВывод(МассивОбластей) ТОгда
						ТекОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						НомерСтраницы = НомерСтраницы + 1;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				ТабДокумент.Вывести(ТекОбластьШапка);
				//Зполним Шапку для след. вывода:
				ТекОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
				ТекОбластьШапка.Параметры.ТекстЗаголовка = "";
			КонецЕсли;
			//обновим текст в шапке
			ТекОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			Если Сч = КоличествоСтрок - 1 Тогда
				
				МассивОбластей = Новый Массив();
				МассивОбластей.Добавить(ТекОбласть);
				МассивОбластей.Добавить(ТекОбластьПодвал);
				Попытка
					Если НЕ ТабДокумент.ПроверитьВывод(МассивОбластей) ТОгда
						ТекОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ТабДокумент.Вывести(ТекОбластьШапка);
						НомерСтраницы = НомерСтраницы + 1;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ТекОбласть,ТекОбластьШапка, , НомерСтраницы, , ЭтотОбъект); 
				НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ТекОбластьПодвал,,, НомерСтраницы, , ЭтотОбъект); 
				
			Иначе
				НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ТекОбласть,ТекОбластьШапка, , НомерСтраницы, , ЭтотОбъект); 
			КонецЕсли;
			Сч = Сч + 1;
		КонецЦикла;
		
		НомерТаблицы = НомерТаблицы + 1;
		
	КонецЦикла;	
	
	Если СуммаРекомендаций > 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("РекомендацииПодвал");
		ОбластьМакета.Параметры.СуммаРекомендаций = Формат(СуммаРекомендаций,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.ЧислоПрописью = обЧислоПрописью(СуммаРекомендаций, ВалютаПечатногоДокумента);
		ОбластьМакета.Параметры.Валюта = ВалютаПечатногоДокумента;
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект); 
	КонецЕсли;
	
	//ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОкончание");
	//Попытка
	//	Если НЕ ТабДокумент.ПроверитьВывод(ОбластьМакета) ТОгда
	//		ОбластьМакета.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	//
	//ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = "/" + спПолучитьНаименование(ЭтотОбъект.Заказчик) + "/";
	//ОбластьМакета.Параметры.КонтрагентПолноеНаименование = "/" + спПолучитьНаименование(ЭтотОбъект.Контрагент) + "/";
	//
	//ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
	//НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект); 
	
	//misha
	Если ВидРемонта = справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда			
		ОбластьМакета = Макет.ПолучитьОбласть("ПСО_ДляТТ");
		Если НЕ ТабДокумент.ПроверитьВывод(ОбластьМакета) ТОгда
			ОбластьМакета.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		КонецЕсли;
		ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = "/" + спПолучитьНаименование(ЭтотОбъект.Заказчик) + "/";
		ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);	
	Иначе
		Попытка	
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалОкончание");
			Если НЕ ТабДокумент.ПроверитьВывод(ОбластьМакета) ТОгда
				ОбластьМакета.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			КонецЕсли;
		Исключение
		КонецПопытки;
		ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = "/" + спПолучитьНаименование(ЭтотОбъект.Заказчик) + "/";
		ОбластьМакета.Параметры.КонтрагентПолноеНаименование = "/" + спПолучитьНаименование(ЭтотОбъект.Контрагент) + "/";
		
		ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект); 
	КонецЕсли;
	//misha
		
	// Вывод причины
	ОбластьМакета = Макет.ПолучитьОбласть("Причина");
	Если ПустаяСтрока(ЭтотОбъект.ПричинаОбращения) Тогда
		ТекОбласть = ОбластьМакета.Область(2, , 2, );
		ТекОбласть.АвтовысотаСтроки = Ложь;
		ТекОбласть.ВысотаСтроки = 22;
	КонецЕсли;
	ОбластьМакета.Параметры.ПричинаОбращения = ЭтотОбъект.ПричинаОбращения;
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы, , ЭтотОбъект);  
	
	// Верхние колонтитулы
	ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
	ТабДокумент.ВерхнийКолонтитул.Выводить=Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница=2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа="Заказ-наряд № "+НомерДляПечати+" от "+Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
	ТабДокумент.ВерхнийКолонтитул.Шрифт=Новый Шрифт(ТабДокумент.ВерхнийКолонтитул.Шрифт,,,,Истина,Истина,);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьТаблицыРекомендаций(Автомобиль,ДокументОбъект,ВалютаПечатногоДокумента)
	
	ТаблицаРекомендованныхУслуг = Новый ТаблицаЗначений();
	ТаблицаРекомендованныхДеталей = Новый ТаблицаЗначений();
	
	Запрос = Новый Запрос();  
	Запрос.Текст = "ВЫБРАТЬ
	               |	РекомендацииПоАвтомобилюСрезПоследних.Рекомендация КАК Наименование,
	               |	РекомендацииПоАвтомобилюСрезПоследних.Количество,
	               |	0 КАК Цена,
	               |	0 КАК Коэффициент,
	               |	0 КАК Сумма
	               |ИЗ
	               |	РегистрСведений.РекомендацииПоАвтомобилю.СрезПоследних(
	               |			,
	               |			Автомобиль = &Автомобиль
	               |				И ЗаказНаряд = ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |				И НЕ Выполнена
	               |				И ТИПЗНАЧЕНИЯ(Рекомендация) = ТИП(Справочник.Автоработы)
	               |				И ПричинаОтказа = Значение(Справочник.ПричиныОтказаОтОбслуживания.ПустаяСсылка)) КАК РекомендацииПоАвтомобилюСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РекомендацииПоАвтомобилюСрезПоследних.Рекомендация КАК Наименование,
	               |	РекомендацииПоАвтомобилюСрезПоследних.Количество,
	               |	0 КАК Цена,
	               |	0 КАК Сумма,
	               |	0 КАК Коэффициент
	               |ИЗ
	               |	РегистрСведений.РекомендацииПоАвтомобилю.СрезПоследних(
	               |			,
	               |			Автомобиль = &Автомобиль
	               |				И ЗаказНаряд = ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |				И НЕ Выполнена
	               |				И НЕ ТИПЗНАЧЕНИЯ(Рекомендация) = ТИП(Справочник.Автоработы)
	               |				И ПричинаОтказа = Значение(Справочник.ПричиныОтказаОтОбслуживания.ПустаяСсылка)) КАК РекомендацииПоАвтомобилюСрезПоследних";
	
	
	Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаРекомендованныхУслуг = МассивРезультатов[0].Выгрузить();
	ТаблицаРекомендованныхУслуг.Колонки.Добавить("Нормочас");
	ТаблицаРекомендованныхДеталей = МассивРезультатов[1].Выгрузить();
	
	КоличествоУслуги = 0;
	СуммаУслуги = 0;	
	Для Каждого Строка Из ТаблицаРекомендованныхУслуг Цикл
		РасчитатьЦенуРекомендации(Строка,ДокументОбъект,ВалютаПечатногоДокумента);
		КоличествоУслуги = КоличествоУслуги + Строка.Количество;
		СуммаУслуги = СуммаУслуги + Строка.Сумма;
	КонецЦикла;
	КоличествоДетали = 0;
	СуммаДетали = 0;
	Для Каждого Строка Из ТаблицаРекомендованныхДеталей Цикл
		РасчитатьЦенуРекомендации(Строка,ДокументОбъект,ВалютаПечатногоДокумента);
		КоличествоДетали = КоличествоДетали + Строка.Количество;
		СуммаДетали = СуммаДетали + Строка.Сумма;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("Услуги, Детали, КоличествоУслуги, СуммаУслуги, КоличествоДетали, СуммаДетали",ТаблицаРекомендованныхУслуг,ТаблицаРекомендованныхДеталей,КоличествоУслуги, СуммаУслуги, КоличествоДетали, СуммаДетали);
	Возврат СтруктураВозврата;
КонецФункции		

Процедура РасчитатьЦенуРекомендации(СтрокаРекомендации,ДокументОбъект,ВалютаПечатногоДокумента) 
	Модель = ДокументОбъект.Автомобиль.Модель; 
	
	Если ЗначениеЗаполнено(ДокументОбъект.Дата) Тогда
		ДатаЦен=КонецДня(ДокументОбъект.Дата);
	Иначе
		ДатаЦен=Неопределено;
	КонецЕсли;
	//ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ВалютаРегл = ВалютаПечатногоДокумента;       //т.к. печатать хотим в валюте док-та
	Коэффициент=1;
	Если ЗначениеЗаполнено(СтрокаРекомендации.Наименование) Тогда
		Если ТипЗнч(СтрокаРекомендации.Наименование)=Тип("СправочникСсылка.Номенклатура") Тогда
			Цена=обПолучитьЦену(ТипЦен,СтрокаРекомендации.Наименование,ДатаЦен,,ВалютаРегл,,,,ПараметрыСеанса.ПодразделениеКомпании);
		ИначеЕсли ТипЗнч(СтрокаРекомендации.Наименование)=Тип("СправочникСсылка.Автоработы") Тогда
			ЦенаРаботы=орПолучитьЦенуАвтоработы(ТипЦенРабот,СтрокаРекомендации.Наименование,Модель,ДоговорВзаиморасчетов,Цех,ВидРемонта,ДатаЦен,ВалютаРегл,1);
			Нормочас=ЦенаРаботы.Нормочас;
			Коэффициент=?(обЗначениеНеЗаполнено(ЦенаРаботы.НормаВремени),1,ЦенаРаботы.НормаВремени);
			Цена=ЦенаРаботы.Цена;
			СтрокаРекомендации.Нормочас ="" + Нормочас.Наименование;      
		Иначе
			Цена=0;
		КонецЕсли; 
	Иначе
		Цена=0;
	КонецЕсли; 
	СтрокаРекомендации.Цена=Цена;
	СтрокаРекомендации.Коэффициент=Коэффициент;
	СтрокаРекомендации.Сумма=СтрокаРекомендации.Цена*СтрокаРекомендации.Количество*СтрокаРекомендации.Коэффициент;
КонецПроцедуры

//ШАБЛОНЫ ОФИСНЫХ ДОКУМЕНТОВ

// Формирует структуру с данными объекта, которые необходимы для заполнения шаблона
Функция ПолучитьДанныеОбъекта() Экспорт
	
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),ДатаСоздания,ДатаЗакрытия);
	
	ДанныеОбъекта = Новый Структура;
	
	ДанныеОбъекта.Вставить("Организация", Организация);
	ДанныеОбъекта.Вставить("ФирмаПолноеНаименование",	спПолучитьНаименование(Организация));
	
	ФирмаАдресПочтовый = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	Если ПустаяСтрока(СокрЛП(ФирмаАдресПочтовый)) Тогда
		ФирмаАдресПочтовый = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	КонецЕсли;
	ДанныеОбъекта.Вставить("ФирмаАдресПочтовый", ФирмаАдресПочтовый);
	
	ФирмаАдресЮридический = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ПустаяСтрока(СокрЛП(ФирмаАдресЮридический)) Тогда
		ФирмаАдресЮридический = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	ДанныеОбъекта.Вставить("ФирмаАдресЮридический", ФирмаАдресЮридический);
	
	ФирмаТелефоны = киПолучитьПредставлениеКИ(ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	Если ПустаяСтрока(СокрЛП(ФирмаТелефоны)) Тогда
		ФирмаТелефоны = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;
	ДанныеОбъекта.Вставить("ФирмаТелефоны", ФирмаТелефоны);
	
	ДанныеОбъекта.Вставить("НомерДок", дкПолучитьНомерДляПечати(Ссылка));
	ДанныеОбъекта.Вставить("ДатаДок", Формат(ДатаПечатная, "ДФ = дд.ММ.гггг 'г.'"""));
	ДанныеОбъекта.Вставить("ДатаДок2", Формат(ДатаПечатная, "ДФ = ""дд ММММ гггг 'г.'"""));
	ДанныеОбъекта.Вставить("ДатаДок3", Формат(ДатаПечатная, "ДФ = ""дд ММММ гггг 'г.'"""));
	ДанныеОбъекта.Вставить("Заказчик", Заказчик);
	ДанныеОбъекта.Вставить("ЗаказчикПолноеНаименование", спПолучитьНаименование(Заказчик));
	ДанныеОбъекта.Вставить("ЗаказчикАдресПочтовый", киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый));
	ДанныеОбъекта.Вставить("ЗаказчикТелефоны", киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный));
	ДанныеОбъекта.Вставить("Контрагент", Контрагент);
	ДанныеОбъекта.Вставить("КонтрагентПолноеНаименование", спПолучитьНаименование(Контрагент));
	ДанныеОбъекта.Вставить("КонтрагентИНН", Контрагент.ИНН);
	ДанныеОбъекта.Вставить("КонтрагентАдресЮридический", киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ДанныеОбъекта.Вставить("КонтрагентТелефоны", киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий));
	
	ДанныеОбъекта.Вставить("Автомобиль", Автомобиль);
	ДанныеОбъекта.Вставить("АвтомобильКод", Автомобиль.VIN);
	ДанныеОбъекта.Вставить("АвтомобильМодель", Автомобиль.Модель);
	ДанныеОбъекта.Вставить("АвтомобильГодВыпуска", Формат(Автомобиль.ГодВыпуска,орПолучитьФорматПредставленияГодаВыпускаАвтомобиля(Права)));
	ДанныеОбъекта.Вставить("АвтомобильНомерДвигателя", Автомобиль.НомерДвигателя);
	ДанныеОбъекта.Вставить("АвтомобильНомерШасси", Автомобиль.НомерШасси);
	ДанныеОбъекта.Вставить("АвтомобильНомерКузова", Автомобиль.НомерКузова);
	ДанныеОбъекта.Вставить("АвтомобильЦвет", Автомобиль.Цвет);
	ДанныеОбъекта.Вставить("АвтомобильГосНомер", Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания));
	ДанныеОбъекта.Вставить("АвтомобильТехПаспорт", СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания)));
	ДанныеОбъекта.Вставить("АвтомобильПробег", СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ДатаСоздания)));
	
	ДанныеОбъекта.Вставить("Мастер", Мастер);
	ДанныеОбъекта.Вставить("МастерПолноеНаименование", Мастер.Наименование);
	ДанныеОбъекта.Вставить("Заказчик", Заказчик);
	ДанныеОбъекта.Вставить("ЗаказчикПолноеНаименование", спПолучитьНаименование(Заказчик));
	ДанныеОбъекта.Вставить("Контрагент", Контрагент);
	ДанныеОбъекта.Вставить("КонтрагентПолноеНаименование", спПолучитьНаименование(Контрагент));
	ДанныеОбъекта.Вставить("Автомобиль", Автомобиль);
	ДанныеОбъекта.Вставить("Автомобиль", Автомобиль);
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Формирует структуру с описанием областей шаблона
Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента() Экспорт
	
	ОписаниеОбластей = Новый Структура;
	
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул",	"ВерхнийКолонтитул");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул",		"НижнийКолонтитул");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ШапкаДоговора",		"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ПриложенияУсловия",	"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ПодвалДоговора",		"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбщиеУсловия",			"Общая");
	пчДобавитьОписаниеОбласти(ОписаниеОбластей, "ОбщиеУсловияПодвал",	"Общая");
		
	Возврат ОписаниеОбластей;
	
КонецФункции

// Формирует печатную форму "ЗаказНаряд"
// Возвращает сформированный табличный документ:
Функция ПечатьШаблонаЗаказНарядДоговор(ТабДокумент,ДвоичныеДанныеМакета,ИмяМакета) Экспорт
	
	Области = ПолучитьОписаниеОбластейМакетаОфисногоДокумента();
	ДанныеОбъекта = ПолучитьДанныеОбъекта();

	Попытка
		
		Если пчПроверитьCOMСоединениеMSWord() Тогда
			ТипМакета = "MS";
		ИначеЕсли пчПроверитьCOMСоединениеOOWriter() Тогда
			ТипМакета = "OO";
		Иначе
			Сообщить("Ошибка при попытке установки соединения. 
			|Для вывода печатных форм требуется, чтобы на компьютере был установлен пакет Microsoft Office или Open Office.");
			Возврат Ложь;	
		КонецЕсли;
		
		Макет		   = пчИнициализироватьМакет(ДвоичныеДанныеМакета, ТипМакета);
 		ПечатнаяФорма  = пчИнициализироватьПечатнуюФорму(ТипМакета, Макет.НастройкиСтраницыМакета);
		
		Если ПечатнаяФорма <> Неопределено И Макет <> Неопределено Тогда
			
			// Вывод колонтитулов документа.
			Область = пчПолучитьОбласть(Макет, Области["ВерхнийКолонтитул"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта);
			
			Область = пчПолучитьОбласть(Макет, Области["НижнийКолонтитул"]);
			пчПрисоединитьОбласть(ПечатнаяФорма, Область);
			
			// Вывод верхней части документа - обычная область с параметрами.
 			Область = пчПолучитьОбласть(Макет, Области["ШапкаДоговора"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = пчПолучитьОбласть(Макет, Области["ПриложенияУсловия"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = пчПолучитьОбласть(Макет, Области["ПодвалДоговора"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = пчПолучитьОбласть(Макет, Области["ОбщиеУсловия"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			Область = пчПолучитьОбласть(Макет, Области["ОбщиеУсловияПодвал"]);
			пчПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, Область, ДанныеОбъекта, Ложь);
			
			пчПоказатьДокумент(ПечатнаяФорма);
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Сообщить(ИнформацияОбОшибке);
		пчОчиститьСсылки(ПечатнаяФорма,Ложь);
		пчОчиститьСсылки(Макет);
		Возврат Ложь;
	КонецПопытки;
	
	пчОчиститьСсылки(ПечатнаяФорма,Ложь);
	пчОчиститьСсылки(Макет);
	
	Возврат ТабДокумент;
	
КонецФункции

//ОБЩИЕ ПЕЧАТНЫЕ ФОРМЫ

// Формирует печатную форму "АктСдачи"
// Возвращает сформированный табличный документ:
Функция ПечатьАктСдачи(ТабДокумент) Экспорт
	
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),ДатаСоздания,ДатаЗакрытия);
	
	Макет = ПолучитьМакет("АктСдачи");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//Вывод шапки документа
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная,"ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Заказчик = Заказчик;
	ОбластьМакета.Параметры.ЗаказчикПолноеНаименование = спПолучитьНаименование(Заказчик);
	ОбластьМакета.Параметры.ЗаказчикАдресПочтовый = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ОбластьМакета.Параметры.ЗаказчикТелефоны = киПолучитьПредставлениеКИ(Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	ОбластьМакета.Параметры.Контрагент = Контрагент;
	ОбластьМакета.Параметры.КонтрагентПолноеНаименование = спПолучитьНаименование(Контрагент);
	ОбластьМакета.Параметры.КонтрагентИНН = Контрагент.ИНН;
	ОбластьМакета.Параметры.КонтрагентАдресЮридический = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	ОбластьМакета.Параметры.КонтрагентТелефоны = киПолучитьПредставлениеКИ(Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	ОбластьМакета.Параметры.Мастер = Мастер;
	ОбластьМакета.Параметры.МастерПолноеНаименование = Мастер.Наименование;
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьМакета.Параметры.Автомобиль = Автомобиль;
		ОбластьМакета.Параметры.АвтомобильКод = Автомобиль.VIN;
		ОбластьМакета.Параметры.АвтомобильМодель = Автомобиль.Модель;
		ОбластьМакета.Параметры.АвтомобильГодВыпуска = Формат(Автомобиль.ГодВыпуска,ФорматПредставленияГодаВыпускаАвтомобиля);
		ОбластьМакета.Параметры.АвтомобильНомерДвигателя = Автомобиль.НомерДвигателя;
		ОбластьМакета.Параметры.АвтомобильНомерШасси = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.АвтомобильНомерКузова = Автомобиль.НомерКузова;
		ОбластьМакета.Параметры.АвтомобильЦвет = Автомобиль.Цвет;
		
		ОбластьМакета.Параметры.АвтомобильГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ДатаСоздания);
		ОбластьМакета.Параметры.АвтомобильТехПаспорт = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт,ДатаСоздания));
		ОбластьМакета.Параметры.АвтомобильПробег = Формат(Пробег,"ЧЦ=10");
	КонецЕсли; 
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.Автомасштаб = Истина;
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "ТОРГ-12"
// Возвращает сформированный табличный документ:
Функция ПечатьТОРГ12(ТабДокумент) Экспорт
	
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),Дата,ДатаЗакрытия);
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	// Получим валюту регламентированного учета для перерасчета цены и суммы
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("ТОРГ12");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	СтруктураПредставления1=Новый Структура(
		"Наименование,ИНН,КПП,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	СтруктураПредставления2=Новый Структура(
		"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	
	// получим р/с из свойств документа
	РасчетныйСчетДокумента=обПолучитьЗначениеСвойства(ЭтотОбъект, "РасчетныйСчет", Неопределено);
	
	// Правим, что автоматом не заполнилось, или заполнилось неправильно
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	ДополнительныеПараметры.РасчетныйСчетДокумента = РасчетныйСчетДокумента;
	ОбластьМакета.Параметры.ОрганизацияПредставление = спПолучитьПредставление(
		ОбластьМакета.Параметры.ПодразделениеКомпании, СтруктураПредставления2, ДополнительныеПараметры);
	ОбластьМакета.Параметры.Поставщик				= обПолучитьЗначениеСвойства(ЭтотОбъект,"ПоставщикОрганизация",ЭтотОбъект.Организация);
	ОбластьМакета.Параметры.ПоставщикПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,СтруктураПредставления2);
	
	ОбластьМакета.Параметры.Грузополучатель				= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Заказчик);
	ОбластьМакета.Параметры.ГрузополучательПредставление= спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель,СтруктураПредставления2);
	ОбластьМакета.Параметры.Плательщик					= обПолучитьЗначениеСвойства(ЭтотОбъект,"Плательщик",ЭтотОбъект.Контрагент);
	ОбластьМакета.Параметры.ПлательщикПредставление		= спПолучитьПредставление(ОбластьМакета.Параметры.Плательщик,СтруктураПредставления1);

	//дальше заполнить Шапку
	ОбластьМакета.Параметры.КодПоОКПО				= ЭтотОбъект.Организация.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП	= ЭтотОбъект.Организация.КодПоОКДП;
	ОбластьМакета.Параметры.ГрузополучательПоОКПО	= ОбластьМакета.Параметры.Грузополучатель.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО			= ОбластьМакета.Параметры.Поставщик.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО		= ОбластьМакета.Параметры.Плательщик.КодПоОКПО;
	
	Если обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
		ОбластьМакета.Параметры.ДокументОснованиеПредставление = ЭтотОбъект.Метаданные().Синоним + " № " + НомерДляПечати + " от " + Формат(ДатаПечатная,"ДФ = dd.MM.yyyy");
		ОбластьМакета.Параметры.ДокументОснование	= ЭтотОбъект;
	Иначе
		ОбластьМакета.Параметры.ДокументОснованиеПредставление = ДоговорВзаиморасчетов.Наименование;
		ОбластьМакета.Параметры.ДокументОснование = ДоговорВзаиморасчетов;
	КонецЕсли;
	
	ОбластьМакета.Параметры.ОснованиеДата	= "";
	ОбластьМакета.Параметры.ОснованиеНомер	= ""; 
	
	ОбластьМакета.Параметры.Дата = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.Номер = НомерДляПечати;
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;
	КоличествоСтрокНаТекущейСтранице=0;
	
	ОбластьЗаголовокТаблицы	= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги			= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего			= Макет.ПолучитьОбласть("Всего");
	//!!! TimR: В новой пф данное поле не выводится
	//ОбластьВсегоСтавкаНДС	= Макет.ПолучитьОбласть("ВсегоСтавкаНДС");

	СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);		
	
	ОбластьЗаголовокТаблицы.Параметры.Валюта = ВалютаРегл;
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	ВыборкаСтрок = ЭтотОбъект.Товары.ВыгрузитьКолонки();
	Для Каждого СтрокаТЧ Из Товары Цикл
		ЗаполнитьЗначенияСвойств(ВыборкаСтрок.Добавить(), СтрокаТЧ);
	КонецЦикла;
	
	КоличествоСтрок = ВыборкаСтрок.Количество();

	// инициализация итогов по документу
	ИтогоКоличество = 0;
	ИтогоСумма      = 0;
	ИтогоНДС        = 0;
	ИтогоСуммаСНДС  = 0;
	
	СоответствиеИтоговПоставкамНДС = Новый Соответствие();
	
	// Выводим многострочную часть документа
	Для каждого СтрокаТоваров Из ВыборкаСтрок Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТоваров,ЭтотОбъект);
		ОбластьСтрока.Параметры.Заполнить(СтруктураСтроки);
		ОбластьСтрока.Параметры.Код							= дкПолучитьЗначениеКолонкиКода(СтрокаТоваров.Номенклатура,, ЭтотОбъект);
		ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= СтрокаТоваров.ЕдиницаИзмерения;
		ОбластьСтрока.Параметры.БазоваяЕдиницаКодПоОКЕИ		= СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
		ОбластьСтрока.Параметры.Количество					= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоМест				= Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.КоличествоВОдномМесте		= Формат(СтрокаТоваров.Коэффициент,ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.ТоварНаименование 			= СтруктураСтроки.ТоварНаименование +?(ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.Артикул), ", "+СтрокаТоваров.Номенклатура.Артикул, "");

		// Пересчитаем сумму в соответствии с регламентированной валютой
		СуммаВсего = Окр(обПересчет(СтрокаТоваров.СуммаВсего, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
		СуммаНДС   = Окр(обПересчет(СтрокаТоваров.СуммаНДС, ВалютаДокумента, КурсДокумента, ВалютаРегл, Дата), 2);
		СуммаБезНДС = СуммаВсего - СуммаНДС;
		
		ОбластьСтрока.Параметры.СуммаВсего  = Формат(СуммаВсего, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС    = ?(СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС, "", Формат(СуммаНДС, ФорматВыводаСуммы));
		ОбластьСтрока.Параметры.СуммаБезНДС = Формат(СуммаБезНДС, ФорматВыводаСуммы);
		
		// Рассчитаем цену.
		ОбластьСтрока.Параметры.ЦенаБезНДС = Формат(СуммаБезНДС / (СтрокаТоваров.Количество * ?(СтрокаТоваров.Коэффициент = 0, 1, СтрокаТоваров.Коэффициент)), ФорматВыводаСуммы);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаСтрок.Индекс(СтрокаТоваров) = ВыборкаСтрок.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьВсего);
			//!!! TimR: В новой пф данное поле не выводится
			//мсвДопОбластиПодвала.Добавить(ОбластьВсегоСтавкаНДС);
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		Если КоличествоСтрокНаТекущейСтранице=0 Тогда
			ТабДокумент.Вывести(ОбластьСтрока);
		Иначе
			//выводим строку, делая проверку попадания на лист		
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги,
				НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		КонецЕсли; 
		
		// увеличим итоги по странице
		СтруктураСтрокиИтогов = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице");
		СтруктураСтрокиИтогов.ИтогКоличествоПоСтранице = СтрокаТоваров.Количество;
		СтруктураСтрокиИтогов.ИтогСуммыПоСтранице      = СуммаБезНДС;
		СтруктураСтрокиИтогов.ИтогНДСПоСтранице		   = СуммаНДС;
		СтруктураСтрокиИтогов.ИтогСуммыСНДСПоСтранице  = СуммаВсего;
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ИтогКоличествоПоСтранице,ИтогСуммыПоСтранице,ИтогНДСПоСтранице,ИтогСуммыСНДСПоСтранице",0,0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			КоличествоСтрокНаТекущейСтранице=0;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		Иначе
			КоличествоСтрокНаТекущейСтранице=КоличествоСтрокНаТекущейСтранице+1;
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
		
		// итоги по ставкам НДС
		Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.СтавкаНДС) Тогда
			Если СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = Неопределено Тогда
				СоответствиеИтоговПоставкамНДС.Вставить(СтрокаТоваров.СтавкаНДС,0);
			КонецЕсли;
			СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] = СоответствиеИтоговПоставкамНДС[СтрокаТоваров.СтавкаНДС] + СтрокаТоваров.СуммаНДС;
		КонецЕсли;
		
		//Сформируем итоги по документу
		ИтогоСумма      = ИтогоСумма + СуммаБезНДС;
		ИтогоНДС        = ИтогоНДС + СуммаНДС;
		ИтогоСуммаСНДС  = ИтогоСуммаСНДС + СуммаВсего;
		
	КонецЦикла;
	
	//довыводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 1 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	// Выводим итоги по документу в целом
	ОбластьВсего.Параметры.ИтогКоличество = Формат(ВыборкаСтрок.Итог("Количество"), ФорматВыводаКоличества);
	ОбластьВсего.Параметры.ИтогСуммы      = Формат(ИтогоСумма, ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогНДС        = Формат(ИтогоНДС, ФорматВыводаСуммы);
	ОбластьВсего.Параметры.ИтогСуммыСНДС  = Формат(ИтогоСуммаСНДС, ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьВсего);
	
	//!!! TimR: В новой пф данное поле не выводится
	//// выведем итоги по ставкам НДС
	//Для Каждого ЭлементСоответствия Из СоответствиеИтоговПоставкамНДС Цикл
	//	ОбластьВсегоСтавкаНДС.Параметры.СтавкаНДС = "Итого по ставке НДС: "
	//	+дкПолучитьПредставлениеСтавкиНДС(ЭлементСоответствия.Ключ,"%");
	//	ОбластьВсегоСтавкаНДС.Параметры.ИтогНДС = ЭлементСоответствия.Значение;
	//	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьВсегоСтавкаНДС, , , НомерСтраницы,,ЭтотОбъект);
	//КонецЦикла;

	// Выводим подвал документа
	ОбластьПодвал.Параметры.Заполнить(ЭтотОбъект);
	ОбластьПодвал.Параметры.Дата = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
	ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок, ,",,,,,,,,0");
	ОбластьПодвал.Параметры.СуммаПрописью = обЧислоПрописью(ИтогоСуммаСНДС,ВалютаРегл);

	Доверенность = обПолучитьЗначениеСвойства(ЭтотОбъект,"Доверенность");
	Если НЕ обЗначениеНеЗаполнено(Доверенность) Тогда
		ОбластьПодвал.Параметры.ДоверенностьНомер = ?(ПустаяСтрока(Доверенность.Серия),"",Доверенность.Серия + "-") + Доверенность.Номер;
		ОбластьПодвал.Параметры.ДоверенностьДата  = Доверенность.ДатаВыдачи;
		ОбластьПодвал.Параметры.ДоверенностьВыдана= Доверенность.КемВыдан;
		ВладелецДоверенности = Доверенность.Владелец;
		Если ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Контрагенты") ИЛИ
			 ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Организации") Тогда
			ОбластьПодвал.Параметры.ДоверенностьЧерезКого = спПолучитьНаименование(ВладелецДоверенности);
		ИначеЕсли ТипЗнч(ВладелецДоверенности)=Тип("СправочникСсылка.Сотрудники") Тогда
			ОбластьПодвал.Параметры.ДоверенностьЧерезКого = ?(обЗначениеНеЗаполнено(ВладелецДоверенности.Должность),"",спПолучитьНаименование(ВладелецДоверенности.Должность)+", ")+спПолучитьНаименование(ВладелецДоверенности);
		КонецЕсли;
	КонецЕсли; 
	
	ДатаОтгрузки=обПолучитьЗначениеСвойства(ЭтотОбъект,"ДатаОтгрузки",Дата('00010101'));
	ДатаОтгрузки=?(обЗначениеНеЗаполнено(ДатаОтгрузки),"""___""____________ 20___",Формат(ДатаОтгрузки,"ДФ=dd.MM.yyyy"));
	ОбластьПодвал.Параметры.ДатаОтгрузки = ДатаОтгрузки;
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьПодвал.Параметры.Заполнить(Руководитель);
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	
	Получил = дкОтветственноеЛицо(ЭтотОбъект,"ПолучилКонтрагент");
	Получил.Вставить("ПолучилПредставление", Получил.ПолучилКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "Акт об оказании услуг"
// Возвращает сформированный табличный документ:
Функция ПечатьАктОбОказанииУслуг(ТабДокумент) Экспорт
	
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),Дата,ДатаЗакрытия);
	
	Макет = ПолучитьМакет("АктОбОказанииУслуг");
	
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//зададим параметры макета
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаРабот=Работы.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
		
	ЕстьСкидка = Истина;
	Если ТаблицаРабот.Итог("СуммаСкидки")=0 И ТаблицаРабот.Итог("СуммаСкидкиСтроки")=0 И ТаблицаРабот.Итог("СуммаСкидкиБонусами")=0 Тогда
		ЕстьСкидка = Ложь;
		ОбластьСкидка = Макет.Область("Скидка");
		ОбластьУслуга = Макет.Область("Услуга");
		
		ОбластьУслуга.ШиринаКолонки = ОбластьУслуга.ШиринаКолонки + ОбластьСкидка.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьСкидка, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
		
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(
		ЭтотОбъект.ПодразделениеКомпании, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПолучателя = спПолучитьПредставление(ЭтотОбъект.Контрагент);
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьАвтомобиль = Макет.ПолучитьОбласть("Автомобиль");
		ОбластьАвтомобиль.Параметры.ПредставлениеАвтомобиля = СокрЛП(Автомобиль.Наименование);
		ТабДокумент.Вывести(ОбластьАвтомобиль);
	КонецЕсли;
	
	ОбластьДокументОснование = Макет.ПолучитьОбласть("ДокументОснование");
	ОбластьДокументОснование.Параметры.ДокументОснование = ЭтотОбъект.Метаданные().Синоним + " № " + НомерДляПечати + " от " + Формат(ДатаПечатная,"ДФ = dd.MM.yyyy");;
	ТабДокумент.Вывести(ОбластьДокументОснование);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапка);
		
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	ТекстЗаголовка = "Акт об оказании услуг №  "+НомерДляПечати+" от "+Формат(ДатаПечатная, "ДФ=дд.ММ.гггг");
		
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапка.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	//Вывод табличной части работ
	Ном	= 0;
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента, 0, 0, 0);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтогПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		
	ВыборкаТабличнойЧасти = ТаблицаРабот;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		ОбластьСтрока.Параметры.НомерСтроки = СтрокаТабличнойЧасти.НомерСтроки;
		ОбластьСтрока.Параметры.Работа = спПолучитьНаименование(СтрокаТабличнойЧасти.Работа);
		ОбластьСтрока.Параметры.Количество = Формат(СтрокаТабличнойЧасти.Количество, ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.Коэффициент = Формат(СтрокаТабличнойЧасти.Коэффициент, "ЧЦ=10; ЧДЦ=3");
		ОбластьСтрока.Параметры.Нормочас = СтрокаТабличнойЧасти.Нормочас;
		ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.Цена, ФорматВыводаСуммы);
		Если ЕстьСкидка Тогда
			ОбластьСтрока.Параметры.СуммаСкидки = Формат(СтрокаТабличнойЧасти.СуммаСкидки+СтрокаТабличнойЧасти.СуммаСкидкиСтроки+СтрокаТабличнойЧасти.СуммаСкидкиБонусами, ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьСтрока.Параметры.СуммаВсего = Формат(СтрокаТабличнойЧасти.СуммаВсего, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС = Формат(СтрокаТабличнойЧасти.СуммаНДС, ФорматВыводаСуммы);
			
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапка, ОбластьИтогПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента , 0, 0, 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
			
		//обновим итоги по странице
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти, СтруктураИтоговПоСтранице);
	КонецЦикла; 
		
	//довыводим последний итог по странице, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтогПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
		
	СуммаВсего=ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	СуммаНДС=ВыборкаТабличнойЧасти.Итог("СуммаНДС");
		
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ЕстьСкидка Тогда
		ОбластьМакета.Параметры.СуммаСкидки = Формат(ВыборкаТабличнойЧасти.Итог("СуммаСкидки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиСтроки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами"), ФорматВыводаСуммы);
	КонецЕсли;
		
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаНДС = Формат(СуммаНДС,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего услуг "+ВыборкаТабличнойЧасти.Количество()+" на сумму "+Формат(СуммаВсего,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+" (в т.ч. НДС "+Формат(СуммаНДС,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+")";
	ОбластьМакета.Параметры.СуммаПрописью = обЧислоПрописью(СуммаВсего,ВалютаПечатногоДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	Отпустил = обПолучитьЗначениеСвойства(ЭтотОбъект,"Отпустил",Мастер);
	ОбластьМакета.Параметры.ОтпустилПредставление=Отпустил.Наименование;
		
	Получил = обПолучитьЗначениеСвойства(ЭтотОбъект,"ПолучилКонтрагент");
	ОбластьМакета.Параметры.ПолучилПредставление=Получил.Наименование;
		
	ТабДокумент.Вывести(ОбластьМакета);
		
	Возврат ТабДокумент;
КонецФункции

// Формирует печатную форму "Акт об оказании услуг(услуги + материалы)"
// Возвращает сформированный табличный документ:
Функция ПечатьАктОбОказанииУслугУслугиИМатериалы(ТабДокумент) Экспорт
	
	ДатаПечатная = ?(обЗначениеНеЗаполнено(ДатаЗакрытия),Дата,ДатаЗакрытия);
	
	Макет = ПолучитьМакет("АктОбОказанииУслугУслугиИМатериалы");
	
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//зададим параметры макета
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента=Неопределено Тогда Возврат Неопределено; КонецЕсли; 
	ТаблицаРабот=Работы.Выгрузить();
    ТаблицаТоваров=Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ТаблицаРабот,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
    зфПерерасчетТаблицыТоваров(ТаблицаТоваров,ЭтотОбъект,ВалютаПечатногоДокумента,Истина);
		
	ЕстьСкидка = Истина;
	Если ТаблицаРабот.Итог("СуммаСкидки")=0 И ТаблицаРабот.Итог("СуммаСкидкиСтроки")=0 И ТаблицаРабот.Итог("СуммаСкидкиБонусами")=0 И ТаблицаТоваров.Итог("СуммаСкидки")=0 И ТаблицаТоваров.Итог("СуммаСкидкиСтроки")=0 И ТаблицаТоваров.Итог("СуммаСкидкиБонусами")=0 Тогда
		ЕстьСкидка = Ложь;
		ОбластьСкидка = Макет.Область("Скидка");
		ОбластьУслуга = Макет.Область("Услуга");
		
		ОбластьУслуга.ШиринаКолонки = ОбластьУслуга.ШиринаКолонки + ОбластьСкидка.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьСкидка, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
		
	ФорматВыводаСуммы      = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
    
    СтруктураОтбора=Новый Структура("Автомобиль,ВидЗначения",Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
    ДатаЗаписи=Неопределено;
	СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи,СтруктураОтбора);

    
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.НомерДок = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДок = Формат(ДатаПечатная, "ДФ = дд.ММ.гггг");
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(
		ЭтотОбъект.ПодразделениеКомпании, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПолучателя = спПолучитьПредставление(ЭтотОбъект.Контрагент);
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		ОбластьАвтомобиль = Макет.ПолучитьОбласть("Автомобиль");
		ОбластьАвтомобиль.Параметры.ПредставлениеАвтомобиля = СокрЛП(Автомобиль.Наименование);
		ТабДокумент.Вывести(ОбластьАвтомобиль);
	КонецЕсли;
	
	ОбластьДокументОснование = Макет.ПолучитьОбласть("ДокументОснование");
	ОбластьДокументОснование.Параметры.ДокументОснование = ЭтотОбъект.Метаданные().Синоним + " № " + НомерДляПечати + " от " + Формат(ДатаПечатная,"ДФ = dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьДокументОснование);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьШапка);
       
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
    //ТекстЗаголовка = "Акт об оказании услуг №  "+НомерДляПечати+" от "+Формат(Дата, "ДФ=дд.ММ.гггг");
    ТекстЗаголовка = "Ремонт\обслуживание автомобиля Модель: " + Автомобиль.Модель + ", VIN: " + Автомобиль.VIN + ", Гос. № " + СтруктураСведений.Значение;
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапка.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	//Вывод табличной части работ
	Ном	= 0;
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента, 0, 0, 0);
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтогПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		
	ВыборкаТабличнойЧасти = ТаблицаРабот;
    НомерСтроки = 1;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
        ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Работа = спПолучитьНаименование(СтрокаТабличнойЧасти.Работа);
		ОбластьСтрока.Параметры.Количество = Формат(СтрокаТабличнойЧасти.Количество, ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.Коэффициент = Формат(СтрокаТабличнойЧасти.Коэффициент, "ЧЦ=10; ЧДЦ=3");
		ОбластьСтрока.Параметры.Нормочас = СтрокаТабличнойЧасти.Нормочас;
		ОбластьСтрока.Параметры.Цена = Формат(СтрокаТабличнойЧасти.Цена, ФорматВыводаСуммы);
		Если ЕстьСкидка Тогда
			ОбластьСтрока.Параметры.СуммаСкидки = Формат(СтрокаТабличнойЧасти.СуммаСкидки+СтрокаТабличнойЧасти.СуммаСкидкиСтроки+СтрокаТабличнойЧасти.СуммаСкидкиБонусами, ФорматВыводаСуммы);
		КонецЕсли;
		ОбластьСтрока.Параметры.СуммаВсего = Формат(СтрокаТабличнойЧасти.СуммаВсего, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.СуммаНДС = Формат(СтрокаТабличнойЧасти.СуммаНДС, ФорматВыводаСуммы);
			
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапка, ОбластьИтогПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
			
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента , 0, 0, 0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;	
		//обновим итоги по странице
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти, СтруктураИтоговПоСтранице);
	КонецЦикла; 
    
	// Соберём данные из ТЧ "Товары"        
	СуммаВсегоТовары = ТаблицаТоваров.Итог("СуммаВсего");
	СуммаНДСТовары = ТаблицаТоваров.Итог("СуммаНДС");
	СуммаВсего=ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	СуммаНДС=ВыборкаТабличнойЧасти.Итог("СуммаНДС");
	СуммаСкидкиТовары = ТаблицаТоваров.Итог("СуммаСкидки")+ТаблицаТоваров.Итог("СуммаСкидкиСтроки") + ТаблицаТоваров.Итог("СуммаСкидкиБонусами");
	
	ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
	ОбластьСтрока.Параметры.Работа = "Запасные части";
	ОбластьСтрока.Параметры.Количество = ТаблицаТоваров.Итог("Количество");
	ОбластьСтрока.Параметры.Цена = "-";  // ставим прочерки в полях
	ОбластьСтрока.Параметры.Коэффициент = "-"; // ставим прочерки в полях
	ОбластьСтрока.Параметры.Нормочас = "-"; // ставим прочерки в полях
	СтруктураСтроки = Новый Структура("СуммаВсего, СуммаНДС, СуммаСкидки", 0, 0, 0);
	Если ЕстьСкидка Тогда
		ОбластьСтрока.Параметры.СуммаСкидки = Формат(СуммаСкидкиТовары, ФорматВыводаСуммы);
		СтруктураСтроки.СуммаСкидки = СуммаСкидкиТовары;
	КонецЕсли;
	ОбластьСтрока.Параметры.СуммаВсего = Формат(СуммаВсегоТовары, ФорматВыводаСуммы);
	ОбластьСтрока.Параметры.СуммаНДС = Формат(СуммаНДСТовары, ФорматВыводаСуммы);
	СтруктураСтроки.СуммаВсего = СуммаВсегоТовары;
	СтруктураСтроки.СуммаНДС = СуммаНДСТовары;
	
	//обновим итоги по странице
	дкДобавитьИтогиПоСтранице(СтруктураСтроки, СтруктураИтоговПоСтранице);
	
    НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьШапка, ОбластьИтогПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
    
    //инициализация итогов по странице
    Если НомерСтраницы <> НомерСтраницыПред Тогда
        СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаВсего, СуммаНДС, СуммаСкидки",ВалютаПечатногоДокумента , 0, 0, 0);
        НомерСтраницыПред = НомерСтраницы;
        ОбластьШапка.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
    КонецЕсли;
	
	//довыводим последний итог по странице, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьИтогПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
		
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	Если ЕстьСкидка Тогда
		ОбластьМакета.Параметры.СуммаСкидки = Формат(ВыборкаТабличнойЧасти.Итог("СуммаСкидки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиСтроки")+ВыборкаТабличнойЧасти.Итог("СуммаСкидкиБонусами")+ТаблицаТоваров.Итог("СуммаСкидки")+ТаблицаТоваров.Итог("СуммаСкидкиСтроки")+ТаблицаТоваров.Итог("СуммаСкидкиБонусами"), ФорматВыводаСуммы);
	КонецЕсли;
		
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего+СуммаВсегоТовары,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаНДС = Формат(СуммаНДС+СуммаНДСТовары,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаПечатногоДокумента;
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего услуг "+ВыборкаТабличнойЧасти.Количество()+" на сумму "+Формат(СуммаВсего+СуммаВсегоТовары,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+" (в т.ч. НДС "+Формат(СуммаНДС+СуммаНДСТовары,ФорматВыводаСуммы)+" "+ВалютаПечатногоДокумента+")";
	ОбластьМакета.Параметры.СуммаПрописью = обЧислоПрописью(СуммаВсего+СуммаВсегоТовары,ВалютаПечатногоДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
	Отпустил = обПолучитьЗначениеСвойства(ЭтотОбъект,"Отпустил",Мастер);
	ОбластьМакета.Параметры.ОтпустилПредставление=Отпустил.Наименование;
		
	Получил = обПолучитьЗначениеСвойства(ЭтотОбъект,"ПолучилКонтрагент");
	ОбластьМакета.Параметры.ПолучилПредставление=Получил.Наименование;
		
	ТабДокумент.Вывести(ОбластьМакета);
		
	Возврат ТабДокумент;
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено, ДопПараметры=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы    
	
	//<<ЧалапАЮ БизТех 21.12.2023   
	//ДатаЗапретаРедактирования = КонецДня(орПолучитьДатуЗапретаРедактирования(ЭтотОбъект));
	
	
	ПодразделениеО2Ли = Неопределено;
	ПодразделениеО2Ли = Справочники.БТ_СписокКонстантныхЗначений.ПодразделениеО2Ли(ЭтотОбъект.ПодразделениеКомпании);
	
	Если обПраво("Печать_ЗН_ЗакрытогоПериода") 
		ИЛИ РольДоступна("БТ_РасширенныйДоступ") 
		ИЛИ (РольДоступна("БТ_СотрудникО2") И ПодразделениеО2Ли = ИСТИНА) 
		ИЛИ ЭтотОбъект.Дата > обПолучитьПраваИНастройкиПользователя(ЭтотОбъект.Организация,"ДатаЗапретаРедактирования",ЭтотОбъект) Тогда
		
		Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ, ДопПараметры);
	Иначе
		Сообщить("Запрещено печатать документы закрытого периода"); 
		Возврат неопределено;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик вода на основании
//Процедура ОбработкаЗаполнения(Основание, ТекстЗаполнения, СтандартнаяОбработка, Копирование=Ложь)
Процедура ОбработкаЗаполнения(Основание, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтоКопирование=Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоКопирование",ЭтоКопирование) Тогда
		ЭтоКопирование=Ложь;
	КонецЕсли; 
	Пробег = 0;
	
	//Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание, Копирование) Тогда Возврат; КонецЕсли;
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание, ЭтоКопирование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		#Если Клиент Тогда
		ДатаСоздания=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
		#Иначе
		ДатаСоздания=ТекущаяДата();
		#КонецЕсли
		ДатаНачала=Неопределено;
		ДатаОкончания=Неопределено;
		ДатаЗакрытия=Неопределено;
		ПлановаяДатаВыдачи=Неопределено;
		ДатаСледующегоТО=Неопределено;
		ДатаМашинозаезда=Неопределено;
	КонецЕсли;
	
	// если не указан тип цен
	Если обЗначениеНеЗаполнено(ТипЦен) Тогда
		ТипЦен=обПраво("ОсновнойТипЦенПродажи",Права,,ЭтотОбъект);
	КонецЕсли;
	Если обЗначениеНеЗаполнено(ТипЦенРабот) Тогда
		ТипЦенРабот = обПраво("ОсновнойТипЦенРабот",Права,,ЭтотОбъект);
	КонецЕсли;
	
	ОсновнойСкладКомпании=обПраво("ОсновнойСкладКомпании",Права,,ЭтотОбъект);
	
	Если Метаданные.Документы.Найти("ЗаказНаАвтомобиль")<>Неопределено Тогда
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			//Если зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") Тогда
				ВидРемонта=Справочники.ВидыРемонта.КомплектацияАвтомобиля;
			//КонецЕсли; 
			Если (обЗначениеНеЗаполнено(Автомобиль)) И (НЕ обЗначениеНеЗаполнено(Основание.VIN)) Тогда
				АвтомобильЗаказа=Справочники.Автомобили.НайтиПоРеквизиту("VIN",Основание.VIN);
				Если НЕ обЗначениеНеЗаполнено(АвтомобильЗаказа) Тогда
					Автомобиль=АвтомобильЗаказа;
				КонецЕсли; 
			КонецЕсли;
			Для каждого СтрокаТоваров Из Товары Цикл
				СтрокаТоваров.СкладКомпании=ОсновнойСкладКомпании;
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаявкаНаРемонт") ИЛИ ТипЗнч(Основание)=Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
		//Подкорректируем то, что заполнилось неправильно
		
		//ПодставлятьКонтрагентаИзЗаказчика=Истина;
		//Если НЕ обЗначениеНеЗаполнено(Контрагент) Тогда
		//	ПодставлятьКонтрагентаИзЗаказчика=Ложь;
		//КонецЕсли; 
		//ДопПараметры=Новый Структура("ПодставлятьКонтрагентаИзЗаказчика",ПодставлятьКонтрагентаИзЗаказчика);
		//ОбработкаРеквизита("УстановитьГарантийногоПлательщика",,ЭтотОбъект.ПолучитьФорму(),ДопПараметры);
		
		#Если Клиент Тогда
		Если ТипЗнч(Основание.Заказчик)<>Тип("СправочникСсылка.Контрагенты") 
			ИЛИ ТипЗнч(Основание.Автомобиль)<>Тип("СправочникСсылка.Автомобили") Тогда
			ФормаСоздания = Документы.ЗаказНаряд.ПолучитьФорму("ФормаСозданияЗаказНаряда");
			ФормаСоздания.ЗаявкаНаРемонт = Основание;
			ПараметрыВводаЗаказНаряда = ФормаСоздания.ОткрытьМодально();
			Если ПараметрыВводаЗаказНаряда <> Неопределено Тогда
				 ПараметрыВводаЗаказНаряда.Свойство("Автомобиль",Автомобиль);
				 ПараметрыВводаЗаказНаряда.Свойство("Заказчик",Заказчик);
				 ПараметрыВводаЗаказНаряда.Свойство("Контрагент",Контрагент);
			КонецЕсли;
		КонецЕсли;
		#КонецЕсли
		
		//если бесплатный вид ремонта, очистим поля контрагент и договор, подставим из документа валюту
		Если ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Бесплатный Тогда
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ВалютаДокумента = Основание.ВалютаДокумента;
		КонецЕсли;
			
		Если (обЗначениеНеЗаполнено(Автомобиль)) И (ТипЗнч(Основание.Автомобиль)=Тип("Строка")) Тогда
			АвтомобильЗаявкиНаРемонт=Справочники.Автомобили.НайтиПоРеквизиту("VIN",Основание.Автомобиль);
			Если НЕ обЗначениеНеЗаполнено(АвтомобильЗаявкиНаРемонт) Тогда
				Автомобиль=АвтомобильЗаявкиНаРемонт;
			КонецЕсли;
		КонецЕсли;
		ПлановаяДатаВыдачи=Основание.ДатаОкончания;
		Для каждого СтрокаТоваров Из Товары Цикл
			Если обЗначениеНеЗаполнено(СтрокаТоваров.СкладКомпании) Тогда
				СтрокаТоваров.СкладКомпании=ОсновнойСкладКомпании;
			КонецЕсли; 
		КонецЦикла;
		
		ЗаполнятьПакеты = обПраво("УРВ_ДобавлятьРаботыВПакетПриДобавлении",Права,,ЭтотОбъект);
		Если ЗаполнятьПакеты Тогда
			GUINПакет = Новый УникальныйИдентификатор;
			Для Каждого СтрокаРабот Из Работы Цикл
				Если обЗначениеНеЗаполнено(СтрокаРабот.ПакетРабот) Тогда
					СтрокаРабот.ПакетРабот  = GUINПакет;
					СтрокаРабот.НомерПакета = 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Заказчик=Контрагент;
		ОбработкаРеквизита("Заказчик");
		Если ЗначениеЗаполнено(Автомобиль) Тогда
			ОбработкаРеквизита("Автомобиль");
		КонецЕсли;
		ЗаполнитьЗаказамиНаОснованииЗаказаПокупателя(Основание);
		
	ИначеЕсли ТипЗнч(Основание)=Тип("СправочникСсылка.Контрагенты") Тогда
		Заказчик=Основание;
		Контрагент=Основание;
		ДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		ОбработкаРеквизита("Контрагент");
	КонецЕсли; 
	
	Если ЭтоНовый() Тогда
		Состояние=Справочники.ВидыСостоянийЗаказНарядов.Заявка;
		Если обЗначениеНеЗаполнено(ВидРемонта) Тогда 
			ВидРемонта=обПраво("ВидРемонтаПоУмолчанию",Права,,ЭтотОбъект); 
		КонецЕсли;
		// KRAA
		//ОбработкаРеквизита("ВидРемонта",,,
		//	?(ЗначениеЗаполнено(Основание) ИЛИ ЭтоКопирование, Новый Структура("НеВыполнятьПересчет", Истина), Неопределено));
		ОбработкаРеквизита("ВидРемонта");		
		Если обЗначениеНеЗаполнено(Цех) Тогда
			Цех=обПраво("ОсновнойЦех",Права,,ЭтотОбъект); 
			ОбработкаРеквизита("Цех");
		КонецЕсли; 
		Если обЗначениеНеЗаполнено(Гарантии) Тогда
			Гарантии=обПраво("ГарантииНаРемонт",Права,,ЭтотОбъект);
		КонецЕсли; 
		Если (НЕ обЗначениеНеЗаполнено(Заказчик)) И (обЗначениеНеЗаполнено(Контрагент)) Тогда
			ОбработкаРеквизита("Заказчик");
		КонецЕсли;
		СписаниеТоваровПоСебестоимости = (обПраво("СписаниеТоваровПоСебестоимости",,,ЭтотОбъект) = Перечисления.ВариантыОтветов.Да); 
		
		//misha
		//галка себестоимость
		Если НЕ РольДоступна("ПолныеПрава") Тогда
			Если ЭтотОбъект.ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
				Если ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010")    //Гарантийный заказ
					И ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011")  //Гарантия диллера для ТТ
					И ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда //Рекламация для ОПА
					Если СписаниеТоваровПоСебестоимости Тогда
						СписаниеТоваровПоСебестоимости = Ложь;
					КонецЕсли
					//ЭтаФорма.ЭлементыФормы.СписаниеТоваровПоСебестоимости.Доступность = Ложь;
				КонецЕсли;
			Иначе
				Если ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017")   //Комплектация автомобиля К
					И ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000018") Тогда //Комплектация автомобиля П
					Если НЕ СписаниеТоваровПоСебестоимости Тогда
						СписаниеТоваровПоСебестоимости = ИСТИНА;
					КонецЕсли;
					//ЭтаФорма.ЭлементыФормы.СписаниеТоваровПоСебестоимости.Доступность = Истина;				
				КонецЕсли;
				//<<Павличенко 14.07.2020  Письмо Коновалов
				Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017")  тогда //Комплектация автомобиля К
					СписаниеТоваровПоСебестоимости = ЛОЖЬ;
				КонецЕсли;
				//>>Павличенко 14.07.2020
			КонецЕсли;	
		КонецЕсли;	
		//misha	
		
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
		Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ДатаСоздания);
	КонецЕсли; 
	
	ДатаМашинозаездаРасчет(Неопределено);
	
	Если НЕ ЭтоКопирование Тогда
		ЗакрыватьЗаказыТолькоПоДанномуЗаказНаряду=Истина;
	Иначе
		ЗаполнятьПакеты = обПраво("УРВ_ДобавлятьРаботыВПакетПриДобавлении",Права,,ЭтотОбъект);
		GUID = Новый УникальныйИдентификатор;
		Для Каждого стрРабот Из Работы Цикл
			Если НЕ обЗначениеНеЗаполнено(стрРабот.Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			стрРабот.ПакетЗакрыт = Ложь;
			Если ЗаполнятьПакеты Тогда
				стрРабот.ПакетРабот  = GUID;
				стрРабот.НомерПакета = 1;
			Иначе
				стрРабот.ПакетРабот  = Неопределено;
				стрРабот.НомерПакета = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяВалютаДокумента = ВалютаДокумента;
	ТекущийКурсДокумента   = КурсДокумента;
	
	// заполнение источника продаж документа
	ОснованиеЗаявкаНаРемонт    = (ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявкаНаРемонт"));
	ИсточникПродажиПоУмолчанию = обПраво(ПланыВидовХарактеристик.ПраваИНастройки.ИсточникПродажиПоУмолчанию, Права,, ЭтотОбъект);
	Для Каждого Авторабота Из Работы Цикл
		Авторабота.ИсточникПродажи = ?(ОснованиеЗаявкаНаРемонт, Перечисления.ИсточникиПродажАвтосервиса.Клиент, ИсточникПродажиПоУмолчанию);
	КонецЦикла;
	
	Для Каждого Товар Из Товары Цикл
		Товар.ИсточникПродажи = ?(ОснованиеЗаявкаНаРемонт, Перечисления.ИсточникиПродажАвтосервиса.Клиент, ИсточникПродажиПоУмолчанию);
		//Если ЗначениеЗаполнено(Товар.Поставщик) Тогда
		//	Товар.СкладКомпании = Товар.Поставщик;
		//ИначеЕсли ЗначениеЗаполнено(Товар.СкладКомпании) Тогда
		//	Товар.Поставщик = Товар.СкладКомпании;
		//КонецЕсли;
	КонецЦикла;
	
	//ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
	//	ИдентификаторГосударственногоКонтракта,
	//	ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	//
	//Если ВидРемонта.ТехОбслуживание И ЗначениеЗаполнено(Автомобиль) Тогда
	//	МежсервисныйПробегТО = ?(ЗначениеЗаполнено(Автомобиль.ВариантКомплектации.МежсервисныйПробегТО), Автомобиль.ВариантКомплектации.МежсервисныйПробегТО, Автомобиль.Модель.МежсервисныйПробегТО);
	//	ПробегСледующегоТО = Пробег + МежсервисныйПробегТО;
	//	ДатаОтсчета = ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, Дата);
	//	МежсервисныйИнтервалТО = ?(ЗначениеЗаполнено(Автомобиль.ВариантКомплектации.МежсервисныйИнтервалТО), Автомобиль.ВариантКомплектации.МежсервисныйИнтервалТО, Автомобиль.Модель.МежсервисныйИнтервалТО);
	//	ДатаСледующегоТО = ДобавитьМесяц(ДатаОтсчета, МежсервисныйИнтервалТО);
	//КонецЕсли;
	
	//БИЗТЕХ МАМОНОВ 09.02.2026 ++
	//Если заявка на ремонт создана по О2 API, то отключаем обработку реквизита
	Если НЕ О2_API_ОбщийМодуль.ЯвляетсяЛиЗаказО2(ЭтотОбъект.ДокументОснование) Тогда
		//<<ЧалапАЮ БизТех 25.07.2024   - когда создают ЗН копированием - пересчитываем цены
		Если ЭтоНовый() тогда
			для каждого Стр из Товары цикл
				ОбработкаРеквизита("Товары.Номенклатура", Стр);
			КонецЦикла;
		КонецЕсли;
		//ЧалапАЮ БизТех 25.07.2024>>
	КонецЕсли;
	//БИЗТЕХ МАМОНОВ 09.02.2026 -- 
	
	//БИЗТЕХ КОВАЛЬ 29.10.2024 ++
	Если этоновый() и ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") ИЛИ 
		ТипЗнч(Основание) = Тип("ДокументОбъект.ЗаказНаАвтомобиль") тогда
		ЗаполнениеПоЗаказуНаАвтомобиль(Основание);
	КонецЕсли;
	//--
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	//получим свойства объекта копирования и запишем их в переменную модуля объекта
	//ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов = Обработки.ЗначенияСвойствОбъекта.Создать();
	//ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений=ОбъектКопирования.Ссылка;
	//ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ПрочитатьЗаполнитьСвойстваИЗначения();
	//ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений=ЭтотОбъект.Ссылка;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоКопирование",Истина);
	//misha
	//Заполнить(ДокументОснование);
	Заполнить(ОбъектКопирования);
	//misha
	ЭтотОбъект.ДополнительныеСвойства.Удалить("ЭтоКопирование");
КонецПроцедуры

//ЧалапАю БизТех 25.09.2024
Функция ПолучениеПлательщикаПоВидуРемонта(ВидРемонтаЗН, ПодразделениеЗН, ДатаЗН)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.Период КАК Период,
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.ВидРемонта КАК ВидРемонта,
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.Подразделение КАК Подразделение,
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.Контрагент КАК Контрагент,
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	                      |ИЗ
	                      |	РегистрСведений.БТ_ПлательщикиПоВидамРемонта.СрезПоследних(&Дата, ) КАК БТ_ПлательщикиПоВидамРемонтаСрезПоследних
	                      |ГДЕ
	                      |	БТ_ПлательщикиПоВидамРемонтаСрезПоследних.ВидРемонта = &ВидРемонта
	                      |	И БТ_ПлательщикиПоВидамРемонтаСрезПоследних.Подразделение = &Подразделение");
	
	Запрос.УстановитьПараметр("Видремонта",ВидРемонтаЗН);
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеЗН);
	Запрос.УстановитьПараметр("Дата",ДатаЗН);        
	
	Результат = Запрос.Выполнить().Выбрать();  
	
	СтруктураКонтрагента = Новый Структура;
	Если Результат.Следующий() тогда   
		СтруктураКонтрагента.Вставить("Контрагент",Результат.Контрагент); 
		СтруктураКонтрагента.Вставить("ДоговорВзаиморасчетов",Результат.ДоговорВзаиморасчетов);
	иначе
		СтруктураКонтрагента.Вставить("Контрагент",Справочники.Контрагенты.ОсновнойПокупатель); 
		СтруктураКонтрагента.Вставить("ДоговорВзаиморасчетов",Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка());
	КонецЕсли;    
	
	Возврат СтруктураКонтрагента;
КонецФункции


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		// Если текущий режим Загрузка, то ничего проверять не надо
		Возврат;
	КонецЕсли;      
	
	//allgk
	Если ЭтотОбъект.проведен Тогда
		если ЭтотОбъект.ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("ПСО",ложь) тогда
			Если НЕ обПраво("РедактированиеПроведенныхЗаказНарядовПСО",Права,,ЭтотОбъект) Тогда
				Сообщить("Нет права на редактирование проведенных заказ-нарядов с видом работ ПСО.",СтатусСообщения.Важное);
				Отказ=Истина; Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//allgk
	
	ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл");
	ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("АвтомобильБыл");
	ДополнительныеСвойства.Вставить("ЗаказНарядБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	ДополнительныеСвойства.Вставить("ПроверятьПоследовательность", Ложь);
	ДополнительныеСвойства.Вставить("ОперативноеПроведение",       Ложь);
	
	Если НЕ Этотобъект.ПометкаУдаления Тогда

		ТекСостояние=Неопределено;
		Если (НЕ Ссылка.Пустая()) И (Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ЗаказНаряд.Состояние
			|ИЗ
			|	Документ.ЗаказНаряд КАК ЗаказНаряд
			|ГДЕ
			|	ЗаказНаряд.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекСостояние=Выборка.Состояние;
			КонецЕсли; 
		КонецЕсли;
		Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И 
			 ТекСостояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт И
			 ТекСостояние<>Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
			 Сообщить("Перевод заказ-наряда в состояние ""Закрыт"" возможен только из состояния ""Выполнен"".",СтатусСообщения.Важное);
			 Отказ=Истина; Возврат;
		КонецЕсли; 
		
		Если Ссылка.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И НЕ ЭтотОбъект.АвтоматСоздание Тогда
			//Если Ссылка.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			Если РежимЗаписи<>РежимЗаписиДокумента.Проведение Тогда
				Если НЕ обПраво("РедактированиеЗакрытыхЗаказНарядов",Права,,ЭтотОбъект) Тогда
					Сообщить("Нет права на редактирование закрытых заказ-нарядов.",СтатусСообщения.Важное);
					Отказ=Истина; Возврат;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		//Если состояние заказ-наряда отлично от "заявки" и дата начала работ не заполнена - установим текущую дату 
		Если Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Заявка И обЗначениеНеЗаполнено(ДатаНачала) Тогда
			#Если Клиент Тогда
			ДатаНачала=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
			#Иначе
			ДатаНачала=ТекущаяДата();
			#КонецЕсли
		КонецЕсли; 
		
		Если РежимЗаписи=РежимЗаписиДокумента.Запись И Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.Проведение И Состояние=Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
			ОбработкаУдаленияПроведения(Отказ);
			Если Отказ Тогда
				Возврат;
			КонецЕсли; 
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			Проведен = Ложь;
		ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения И Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
			Состояние=Справочники.ВидыСостоянийЗаказНарядов.Заявка;
		КонецЕсли;
		
		//Если состояние заказ-наряда "выполнен" или "закрыт" и дата окончания работ не заполнена - установим текущую дату 
		Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ
			 Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			 Если обЗначениеНеЗаполнено(ДатаОкончания) Тогда
				#Если Клиент Тогда
				ДатаОкончания=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
				ДатаОкончания=ТекущаяДата();
				#КонецЕсли
				Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
					ДополнительныеСвойства.Вставить("ОперативноеПроведение", Истина);
				КонецЕсли;
			 КонецЕсли; 
		Иначе
			//ДатаОкончания = Неопределено;
		КонецЕсли;
		
		//бизтех++
		//Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		//	 Если обЗначениеНеЗаполнено(ДатаЗакрытия) Тогда
		//		#Если Клиент Тогда
		//		ДатаЗакрытия=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
		//		#Иначе
		//		ДатаЗакрытия=ТекущаяДата();
		//		#КонецЕсли
		//		ДополнительныеСвойства.Вставить("ОперативноеПроведение", Истина);
		//	КонецЕсли;
		//Иначе
		//	ДополнительныеСвойства.Вставить("ДатаДокумента", ПолучитьДатуДокумента(Ссылка.Состояние));
		//	ДатаЗакрытия=Неопределено;
		//КонецЕсли;
		
		//код из прошлой версии 1С
		
		Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			Если обЗначениеНеЗаполнено(ДатаЗакрытия) Тогда
				
				#Если Клиент Тогда
					ДатаЗакрытия=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
					ДатаЗакрытия=ТекущаяДата();
				#КонецЕсли   
				
				Если не Рольдоступна("ВосстПослед") Тогда
					Если не Дата=ДатаЗакрытия Тогда
						Дата=ДатаЗакрытия;
					КонецЕсли;
				КонецЕсли;	
				
				ДополнительныеСвойства.Вставить("ОперативноеПроведение", Истина);  
				
			Иначе 
				Если не Рольдоступна("ВосстПослед") Тогда
					Если не Дата=ДатаЗакрытия Тогда
						Дата=ДатаЗакрытия;
					КонецЕсли;
				КонецЕсли;			
			КонецЕсли;
		Иначе
			ДополнительныеСвойства.Вставить("ДатаДокумента", ПолучитьДатуДокумента(Ссылка.Состояние));
			//ДатаЗакрытия=Неопределено;
		КонецЕсли;
		
		//бизтех--
		
		Если обЗначениеНеЗаполнено(ДатаМашинозаезда) Тогда
			ДатаМашинозаезда=ДатаСоздания;
		КонецЕсли;
		
		СуммаНоменклатурыДокумента=Товары.Итог("СуммаВсего");
		СуммаРаботДокумента=Работы.Итог("СуммаВсего");
		СуммаДокумента=СуммаНоменклатурыДокумента+СуммаРаботДокумента;
		Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
			Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
				Состояние=Справочники.ВидыСостоянийЗаказНарядов.ВРаботе;
				//Дата=ДатаСоздания;
				ДополнительныеСвойства.Вставить("ДатаДокумента", ПолучитьДатуДокумента(Ссылка.Состояние));
				ДатаОкончания=Неопределено;
				ДатаЗакрытия=Неопределено;
			КонецЕсли; 
		КонецЕсли; 
		
	//Проверим наличие подчиненных документов позже даты заказ-наряда
	//<<Павличенко 07.09.2020
	//Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
	Если НЕ Ссылка.Пустая() И (Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
		//>>Павличенко 07.09.2020
			Запрос=Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВводОстатковТоваровВПроизводстве.Ссылка КАК ПодчиненныйДокумент,
			               |	ПРЕДСТАВЛЕНИЕ(ВводОстатковТоваровВПроизводстве.Ссылка) КАК ПодчиненныйДокументПредставление
			               |ИЗ
			               |	Документ.ВводОстатковТоваровВПроизводстве КАК ВводОстатковТоваровВПроизводстве
			               |ГДЕ
			               |	ВводОстатковТоваровВПроизводстве.Дата > &ДатаЗаказНаряда
			               |	И ВводОстатковТоваровВПроизводстве.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЗаказВнутренний.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(ЗаказВнутренний.Ссылка)
			               |ИЗ
			               |	Документ.ЗаказВнутренний КАК ЗаказВнутренний
			               |ГДЕ
			               |	ЗаказВнутренний.Дата > &ДатаЗаказНаряда
			               |	И ЗаказВнутренний.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЗаказПокупателя.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.Ссылка)
			               |ИЗ
			               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			               |ГДЕ
			               |	ЗаказПокупателя.Дата > &ДатаЗаказНаряда
			               |	И ЗаказПокупателя.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ЗаказПоставщику.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(ЗаказПоставщику.Ссылка)
			               |ИЗ
			               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			               |ГДЕ
			               |	ЗаказПоставщику.Дата > &ДатаЗаказНаряда
			               |	И ЗаказПоставщику.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ИзвлечениеТоваровИзПроизводства.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(ИзвлечениеТоваровИзПроизводства.Ссылка)
			               |ИЗ
			               |	Документ.ИзвлечениеТоваровИзПроизводства КАК ИзвлечениеТоваровИзПроизводства
			               |ГДЕ
			               |	ИзвлечениеТоваровИзПроизводства.Дата > &ДатаЗаказНаряда
			               |	И ИзвлечениеТоваровИзПроизводства.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ПеремещениеТоваровВПроизводство.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(ПеремещениеТоваровВПроизводство.Ссылка)
			               |ИЗ
			               |	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
			               |ГДЕ
			               |	ПеремещениеТоваровВПроизводство.Дата > &ДатаЗаказНаряда
			               |	И ПеремещениеТоваровВПроизводство.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	СнятиеРезервовЗаказовПокупателя.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(СнятиеРезервовЗаказовПокупателя.Ссылка)
			               |ИЗ
			               |	Документ.СнятиеРезервовЗаказовПокупателя КАК СнятиеРезервовЗаказовПокупателя
			               |ГДЕ
			               |	СнятиеРезервовЗаказовПокупателя.Дата > &ДатаЗаказНаряда
			               |	И СнятиеРезервовЗаказовПокупателя.ДокументОснование = &ДокументОснование
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	СписаниеТоваров.Ссылка,
			               |	ПРЕДСТАВЛЕНИЕ(СписаниеТоваров.Ссылка)
			               |ИЗ
			               |	Документ.СписаниеТоваров КАК СписаниеТоваров
			               |ГДЕ
			               |	СписаниеТоваров.Дата > &ДатаЗаказНаряда
			               |	И СписаниеТоваров.ДокументОснование = &ДокументОснование
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ПодчиненныйДокумент";
			Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
			
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				ДатаПроверки = ДатаОкончания;
			Иначе
			#Если Клиент Тогда
				ДатаПроверки = РабочаяДата + (Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
			#Иначе
				ДатаПроверки = ТекущаяДата();
			#КонецЕсли
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ДатаЗаказНаряда", ДатаПроверки);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Количество()>0 Тогда
				ТекстСообщения="У заказ наряда есть подчиненные документы с более поздней датой:";
				Пока Выборка.Следующий() Цикл
					ТекстСообщения=ТекстСообщения+"
						|"+Выборка.ПодчиненныйДокументПредставление;
				КонецЦикла; 
				Сообщить(ТекстСообщения,СтатусСообщения.Внимание);
				Отказ=Истина; Возврат;
			КонецЕсли; 
		КонецЕсли; 
		
		НовоеВремяВыполненияРабот=0;
		Для каждого СтрокаРабот Из Работы Цикл
			Если СтрокаРабот.Нормочас.Цена<>1 Тогда
				НовоеВремяВыполненияРабот=НовоеВремяВыполненияРабот+(СтрокаРабот.Коэффициент*СтрокаРабот.Количество);
			КонецЕсли; 
		КонецЦикла;
		Если НовоеВремяВыполненияРабот<>ВремяВыполненияРабот Тогда
			ВремяВыполненияРабот=НовоеВремяВыполненияРабот;
		КонецЕсли;

	КонецЕсли;
		
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Этотобъект.ПометкаУдаления Тогда

		Если БонусныеПрограммыСервер.ЗаблокированаКарточка(Карточка)
			И (ДополнительныеСвойства.Свойство("ПроверятьБлокировкуКарты") ИЛИ (КоличествоКНачислению = 0 И ЗначениеЗаполнено(Ссылка))) Тогда
			КоличествоКНачислению = 0;
		Иначе
			БонусныеПрограммыСервер.РасчитатьБонусныеБаллыКНачислению(ЭтотОбъект, Карточка.БонуснаяПрограмма);
		КонецЕсли;
		
		// получим старые значения, влияющие на границы последовательности
		Если НЕ Отказ И Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			// прошлый момент времени
			Запрос = Новый Запрос("ВЫБРАТЬ МоментВремени, ВидРемонта, Состояние, ДатаОкончания, ДатаЗакрытия ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			СтрокаРезультата = Запрос.Выполнить().Выгрузить().Получить(0);
			БылиДвижения = Ложь;
			
			Если СтрокаРезультата.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт ИЛИ 
					Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
				ДополнительныеСвойства.Вставить("ПроверятьПоследовательность", Истина);
			КонецЕсли;
			
			Если СтрокаРезультата.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
				
				//Если зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") Тогда
					КомплектацияАвтомобиля=Справочники.ВидыРемонта.КомплектацияАвтомобиля;
					Если (КомплектацияАвтомобиля.Пустая()) ИЛИ (НЕ КомплектацияАвтомобиля.Предопределенный) Тогда
						КомплектацияАвтомобиля=Неопределено;
					КонецЕсли;
				//Иначе
				//	КомплектацияАвтомобиля=Неопределено;
				//КонецЕсли;
				
				Если СтрокаРезультата.ВидРемонта = КомплектацияАвтомобиля Тогда
					// автомобили
					Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка";
					Результат = Запрос.Выполнить();
					Если НЕ Результат.Пустой() Тогда
						БылиДвижения = Истина;
						ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
					КонецЕсли;
					
					// комплектация
					Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка";
					Результат = Запрос.Выполнить();
					Если НЕ Результат.Пустой() Тогда
						БылиДвижения = Истина;
						ДополнительныеСвойства.Вставить("АвтомобильБыл", Результат.Выгрузить().ВыгрузитьКолонку("Автомобиль"));
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаРезультата.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
					// взаиморасчеты
					Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор=&Ссылка";
					Результат = Запрос.Выполнить();
					Если НЕ Результат.Пустой() Тогда
						БылиДвижения = Истина;
						ДополнительныеСвойства.Вставить("ДоговорВзаиморасчетовБыл", Результат.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
					КонецЕсли;
				КонецЕсли;
				
				// производство
				Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаряд ИЗ РегистрНакопления.ТоварыВПроизводстве ГДЕ Регистратор=&Ссылка";
				Результат = Запрос.Выполнить();
				Если НЕ Результат.Пустой() Тогда
					БылиДвижения = Истина;
					ДополнительныеСвойства.Вставить("ЗаказНарядБыл", Результат.Выгрузить().ВыгрузитьКолонку("ЗаказНаряд"));
				КонецЕсли;
			КонецЕсли;
			
			Если БылиДвижения Тогда
				Если СтрокаРезультата.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
					ДополнительныеСвойства.Вставить("МоментВремениБыл", Новый МоментВремени(СтрокаРезультата.ДатаЗакрытия, Ссылка));
				ИначеЕсли СтрокаРезультата.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
					ДополнительныеСвойства.Вставить("МоментВремениБыл", Новый МоментВремени(СтрокаРезультата.ДатаОкончания, Ссылка));
				Иначе
					ДополнительныеСвойства.Вставить("МоментВремениБыл", СтрокаРезультата.МоментВремени);
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ВидРемонта.ТехОбслуживание ИЛИ обЗначениеНеЗаполнено(Автомобиль) Тогда
			ПробегСледующегоТО = 0;
			ДатаСледующегоТО   = Дата(1, 1, 1);
		КонецЕсли;
		
		Если Отказ Тогда
			ДополнительныеСвойства.Вставить("ДатаДокумента", ПолучитьДатуДокумента(Ссылка.Состояние));
			Если обЗначениеНеЗаполнено(Ссылка) Тогда
				ДатаОкончания = Неопределено;
				ДатаЗакрытия = Неопределено;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;  
	
	//<<ЧалапАю БизТех 25.09.2024   
	Если ВидРемонта.БТ_ПлательщикПоУмолчанию тогда
		ВидРемонтаЗН = ВидРемонта;   //это будет новое значениен? оно еще не записано в объект
		ПодразделениеЗН = ПодразделениеКомпании;
		ДатаЗН = Дата; 
		
		ДанныеПлательщика = ПолучениеПлательщикаПоВидуРемонта(ВидРемонтаЗН, ПодразделениеЗН, ДатаЗН); 
		//БИЗТЕХ КОВАЛЬ ТЗ 000000760 05.03.2025 ++
		//Если контрагент и договор не найден по регистру то его не подменять.
		Если НЕ ДанныеПлательщика.Контрагент = Справочники.Контрагенты.ОсновнойПокупатель И
			НЕ ДанныеПлательщика.ДоговорВзаиморасчетов.Пустая() Тогда
			Контрагент = ДанныеПлательщика.Контрагент;
			ДоговорВзаиморасчетов = ДанныеПлательщика.ДоговорВзаиморасчетов;
			Сообщить("Изменен плательщик по виду ремонта и подразделению");
		КонецЕсли;
		//БИЗТЕХ КОВАЛЬ ТЗ 000000760 05.03.2025 --
		
	КонецЕсли;
	//ЧалапАю БизТех 25.09.2024>> 
	
	//<<БАА 13.10.24   
	Если видРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037") и не ЗначениеЗаполнено(БТ_НомерТО) тогда   //ЧалапАю БизТех 14.10.2024 ограничимся видом ремонта от греха
		БТ_НомерТО  = БТ_СлужебныеФункции.ОпределитьНомерТО(ЭтотОбъект);
	КонецЕсли;
	//>>БАА 13.10.24   
	
	//<<БАА 17.06.25
	ПроверкаДублейОткрытыхЗН(Отказ);
	//>>
КонецПроцедуры    

Процедура ПроверкаДублейОткрытыхЗН(Отказ)
	
	Если ПометкаУдаления или Ссылка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Подразделения,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК ВидыРемонта,    
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК Цеха
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ПроверкаНаличияДублейОткрытыхЗН""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроверкаДублейОткрытыхЗНПоНастройке(Отказ, ВыборкаДетальныеЗаписи.Подразделения, ВыборкаДетальныеЗаписи.ВидыРемонта, ВыборкаДетальныеЗаписи.Цеха);		
		
	КонецЦикла;
	
КонецПроцедуры	 

Процедура ПроверкаДублейОткрытыхЗНПоНастройке(Отказ, Подразделения, ВидыРемонта, Цеха) 
	
	МасЦехов = Новый Массив;
	Если ТипЗнч(Цеха) = Тип("СправочникСсылка.Цеха") Тогда
		МасЦехов.Добавить(цеха);
	Иначе	
		Стр = СтрРазделить(Цеха, ";");
		
		Для Каждого Элем Из Стр Цикл  
			
			_Цех = Справочники.Цеха.НайтиПоКоду(Элем);
			Если Не _Цех.Пустая() Тогда 
				МасЦехов.Добавить(_Цех);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если МасЦехов.Найти(Цех) = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	
	МасВидовРемонта = Новый Массив;
	Если ТипЗнч(ВидыРемонта) = Тип("СправочникСсылка.ВидыРемонта") Тогда
		МасВидовРемонта.Добавить(ВидыРемонта);
	Иначе	

		Стр = СтрРазделить(ВидыРемонта, ";");
		
		Для Каждого Элем Из Стр Цикл  
			
			_ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду(Элем);
			Если Не _ВидРемонта.Пустая() Тогда 
				МасВидовРемонта.Добавить(_ВидРемонта);
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	Если МасВидовРемонта.Найти(ВидРемонта) = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	МасПодразделений = Новый Массив;
		
	Если ТипЗнч(Подразделения) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		МасПодразделений.Добавить(Подразделения);
	Иначе	
        Стр = СтрРазделить(Подразделения, ";");

		Для Каждого Элем Из Стр Цикл  
			
			_Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду(Элем);
			Если Не _Подразделение.Пустая() Тогда 
				МасПодразделений.Добавить(_Подразделение);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если МасПодразделений.Найти(ПодразделениеКомпании) = Неопределено Тогда
		Возврат;
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	НЕ ЗаказНаряд.ПометкаУдаления
		|	И ЗаказНаряд.Проведен
		|	И ЗаказНаряд.Состояние <> &Закрыт
		|	И ЗаказНаряд.ВидРемонта = &ВидРемонта
		|	И ЗаказНаряд.Цех = &Цех
		|	И ЗаказНаряд.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И ЗаказНаряд.Автомобиль = &Автомобиль
		|	И ЗаказНаряд.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Запрос.УстановитьПараметр("Закрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Цех", Цех);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ошибки = "";
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Ошибки = Ошибки + ВыборкаДетальныеЗаписи.Ссылка+Символы.ПС;
	КонецЕсли;                                                     
	
	Если Не ПустаяСтрока(Ошибки) тогда
		Ошибки = "По данному автомобилю, подразделению, цеху и виду ремонта есть Открытые Заказ-наряды: " + Символы.ПС + Ошибки;
		
		Отказ = Истина;
		
		#Если Клиент Тогда
			Предупреждение(Ошибки);	
		#КонецЕсли
	КонецЕсли;	
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры	

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Ошибки="";
	
	//БИЗТЕХ МАМОНОВ 14.07.2025 ++
	//Проверка на корректность склада в ТЧ товары
	Если НЕ РольДоступна("ПолныеПрава") Тогда // БИЗТЕХ КОВАЛЬ 26.08.2025 Вернул роль
		СкладВИсключении = Ложь;
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.СкладыКомпании) КАК Склад
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""СкладыИсключенияДляЗН""");
		МассивСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
		
		Для Каждого СтрокаТаблЧасти из Товары Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблЧасти.СкладКомпании) И 
				МассивСкладов.Найти(СтрокаТаблЧасти.СкладКомпании) <> Неопределено Тогда
				
				СкладВИсключении = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СкладВИсключении = ЛОЖЬ И ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000051") Тогда
			ПроверитьСкладПоПодразделению(Отказ);
		КонецЕсли;
	КонецЕсли;
	//БИЗТЕХ МАМОНОВ 14.07.2025 -- 
	
	// БИЗТЕХ МАМОНОВ 29.07.2025 ++
	// Ограничение для вида ремонта "Дефектовка"
	Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 
		
		Если Товары.Количество() Тогда
			Товары.Очистить();
		КонецЕсли;
		
		ДефектовкаРабота = Справочники.Автоработы.НайтиПоКоду("ЦБ00007765");
		
		Если ЗначениеЗаполнено(ДефектовкаРабота) Тогда
			Если Работы.Найти(ДефектовкаРабота,"Работа") = Неопределено Тогда
				СтрокаДефектовка = Работы.Добавить();
				СтрокаДефектовка.Работа = ДефектовкаРабота;
				СтрокаДефектовка.ИдентификаторРаботы = Новый УникальныйИдентификатор;
				ОбработкаРеквизита("Работы.Работа", СтрокаДефектовка);
				СтрокаДефектовка.Количество = 1; 
				ОбработкаРеквизита("Работы.Количество", СтрокаДефектовка);
				ОбработкаРеквизита("Работы.Нормочас", СтрокаДефектовка);
				ОбработкаРеквизита("Работы.Цена", СтрокаДефектовка); 
				ОбработкаРеквизита("Работы.Сумма", СтрокаДефектовка);
				ОбработкаРеквизита("Работы.СтавкаНДС", СтрокаДефектовка);
				ОбработкаРеквизита("Работы.СуммаНДС", СтрокаДефектовка);
				ОбработкаРеквизита("Работы.СуммаВсего", СтрокаДефектовка);
			КонецЕсли;  
		КонецЕсли;
	КонецЕсли;	
	//БИЗТЕХ МАМОНОВ 29.07.2025 --
	
	//Проверка корректности дат
	Если (НЕ обЗначениеНеЗаполнено(ДатаСоздания)) И (НЕ обЗначениеНеЗаполнено(ДатаНачала)) Тогда
		Если ДатаСоздания>ДатаНачала Тогда
			дкДобавитьОшибку(Ошибки,"Дата создания заказ-наряда более даты его начала.");
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли; 
	Если (НЕ обЗначениеНеЗаполнено(ДатаНачала)) И (НЕ обЗначениеНеЗаполнено(ДатаОкончания)) Тогда
		Если ДатаНачала>ДатаОкончания Тогда
			дкДобавитьОшибку(Ошибки,"Дата начала заказ-наряда более даты его окончания.");
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
	Если (НЕ обЗначениеНеЗаполнено(ДатаОкончания)) И (НЕ обЗначениеНеЗаполнено(ДатаЗакрытия)) Тогда
		Если ДатаОкончания>ДатаЗакрытия Тогда
			дкДобавитьОшибку(Ошибки,"Дата окончания работ по заказ-наряду более даты его закрытия.");
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка) Тогда
			Отказ=Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(СервиснаяКампания) Тогда
		СервисныеКампании=орПроверитьСервиснуюКампанию(Автомобиль,Дата,Ложь,Ссылка);
		СервиснаяКампанияАктуальна=Ложь;
		СервиснаяКампанияАктуальнаСообщение="VIN ["+Автомобиль.VIN+"] автомобиля <"+Автомобиль+"> не включен в сервисную кампанию <"+СервиснаяКампания+">.";
		
		СтрокиСервисныхКампаний=СервисныеКампании.НайтиСтроки(Новый Структура("СервиснаяКампания",СервиснаяКампания));
		Для каждого СтрокаСервисныхКампаний Из СтрокиСервисныхКампаний Цикл
			Если СтрокаСервисныхКампаний.ДокументВыполнения=Ссылка Тогда
				СервиснаяКампанияАктуальна=Истина;
				Прервать;
			КонецЕсли;
			Если (обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.ДатаВыполнения)) И
				 (НачалоДня(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаНачала)<Дата ИЛИ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаНачала)) И
				 (КонецДня(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания)>Дата ИЛИ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания)) Тогда
				СервиснаяКампанияАктуальна=Истина;
				Прервать;
			КонецЕсли; 
			Если НЕ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.ДатаВыполнения) Тогда
				Если обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.ДокументВыполнения) Тогда
					СервиснаяКампанияАктуальнаСообщение="Сервисная кампания <"+СервиснаяКампания+"> для автомобиля <"+Автомобиль+"> с VIN ["+Автомобиль.VIN+"] уже выполнена сторонней организацией.";
				Иначе
					СервиснаяКампанияАктуальнаСообщение="Сервисная кампания <"+СервиснаяКампания+"> для автомобиля <"+Автомобиль+"> с VIN ["+Автомобиль.VIN+"] уже выполнена по заказ-наряду <"+СтрокаСервисныхКампаний.ДокументВыполнения+">.";
				КонецЕсли; 
				СервиснаяКампанияАктуальна=Ложь;
				Прервать;
			КонецЕсли; 
			Если (НачалоДня(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаНачала)>Дата) ИЛИ
				 (КонецДня(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания)<Дата И НЕ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания)) Тогда
				СервиснаяКампанияАктуальнаСообщение="Период действия сервисной кампании <"+СервиснаяКампания+">";
				Если НЕ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаНачала) Тогда
					СервиснаяКампанияАктуальнаСообщение=СервиснаяКампанияАктуальнаСообщение+" с "+Формат(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаНачала,"ДФ=dd.MM.yyyy");
				КонецЕсли; 
				Если НЕ обЗначениеНеЗаполнено(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания) Тогда
					СервиснаяКампанияАктуальнаСообщение=СервиснаяКампанияАктуальнаСообщение+" по "+Формат(СтрокаСервисныхКампаний.СервиснаяКампания.ДатаОкончания,"ДФ=dd.MM.yyyy");
				КонецЕсли;
				СервиснаяКампанияАктуальнаСообщение=СервиснаяКампанияАктуальнаСообщение+".";
				СервиснаяКампанияАктуальна=Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Если НЕ СервиснаяКампанияАктуальна Тогда
			дкДобавитьОшибку(Ошибки,СервиснаяКампанияАктуальнаСообщение);
			Отказ=Истина;
		Иначе
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	ВыполнениеСервисныхКампаний.VIN,
			|	ВыполнениеСервисныхКампаний.СервиснаяКампания
			|ИЗ
			|	РегистрСведений.ВыполнениеСервисныхКампаний КАК ВыполнениеСервисныхКампаний
			|ГДЕ
			|	ВыполнениеСервисныхКампаний.ДокументВыполнения = &ДокументВыполнения";
			Запрос.УстановитьПараметр("ДокументВыполнения",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ВыполнениеСервисныхКампанийНаборЗаписей=РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьНаборЗаписей();
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Значение=Выборка.VIN;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Использование=Истина;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Значение=Выборка.СервиснаяКампания;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Использование=Истина;
				ВыполнениеСервисныхКампанийНаборЗаписей.Прочитать();
				ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
				Для Каждого СтрокаНабора Из ВыполнениеСервисныхКампанийНаборЗаписей Цикл
					СтрокаНабора.ДатаВыполнения='00010101';
					СтрокаНабора.ДокументВыполнения=Документы.ЗаказНаряд.ПустаяСсылка();
				КонецЦикла;
				Попытка
					ВыполнениеСервисныхКампанийНаборЗаписей.Записать(Истина);
				Исключение
					дкДобавитьОшибку(Ошибки,"Ошибка записи сервисной кампании: "+ОписаниеОшибки()+".");
					Отказ=Истина;
				КонецПопытки; 
				ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
			КонецЦикла;
			Если НЕ ПометкаУдаления Тогда
				ВыполнениеСервисныхКампанийНаборЗаписей=РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьНаборЗаписей();
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Значение=Автомобиль.VIN;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Использование=Истина;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Значение=СервиснаяКампания;
				ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Использование=Истина;
				ВыполнениеСервисныхКампанийНаборЗаписей.Прочитать();
				ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
				Для Каждого СтрокаНабора Из ВыполнениеСервисныхКампанийНаборЗаписей Цикл
					СтрокаНабора.ДатаВыполнения=?(Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт,Дата,'00010101');
					СтрокаНабора.ДокументВыполнения=Ссылка;
				КонецЦикла;
				Попытка
					ВыполнениеСервисныхКампанийНаборЗаписей.Записать(Истина);
				Исключение
					дкДобавитьОшибку(Ошибки,"Ошибка записи сервисной кампании: "+ОписаниеОшибки()+".");
					Отказ=Истина;
				КонецПопытки; 
				ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
				
				Если НЕ обЗначениеНеЗаполнено(Автомобиль.ОригинальныйVIN) Тогда
					ВыполнениеСервисныхКампанийНаборЗаписей=РегистрыСведений.ВыполнениеСервисныхКампаний.СоздатьНаборЗаписей();
					ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Значение=Автомобиль.ОригинальныйVIN;
					ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.VIN.Использование=Истина;
					ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Значение=СервиснаяКампания;
					ВыполнениеСервисныхКампанийНаборЗаписей.Отбор.СервиснаяКампания.Использование=Истина;
					ВыполнениеСервисныхКампанийНаборЗаписей.Прочитать();
					ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
					Для Каждого СтрокаНабора Из ВыполнениеСервисныхКампанийНаборЗаписей Цикл
						СтрокаНабора.ДатаВыполнения=?(Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт,Дата,'00010101');
						СтрокаНабора.ДокументВыполнения=Ссылка;
					КонецЦикла;
					Попытка
						ВыполнениеСервисныхКампанийНаборЗаписей.Записать(Истина);
					Исключение
						дкДобавитьОшибку(Ошибки,"Ошибка записи сервисной кампании: "+ОписаниеОшибки()+".");
						Отказ=Истина;
					КонецПопытки; 
					ВыполнениеСервисныхКампанийНаборЗаписей.НеИзменятьАвтора=Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	//bizteh(САА 23.12.2021)++
	Если ВидРемонта.Код = "ЦБ000013" и не ПометкаУдаления Тогда //Диагностика ТРЕЙД ИН платный
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	тт_РабочийЛистТрейдИн.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|ГДЕ
		|	тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
		|	И НЕ тт_РабочийЛистТрейдИн.ПометкаУдаления";
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если РезультатЗапроса.Пустой() Тогда
			
			док_тт_РабочийЛистТрейдИн = Документы.тт_РабочийЛистТрейдИн.СоздатьДокумент(); 
			док_тт_РабочийЛистТрейдИн.Дата = ТекущаяДата();
			док_тт_РабочийЛистТрейдИн.Автомобиль = Автомобиль;  
			док_тт_РабочийЛистТрейдИн.Модель = Автомобиль.Модель;
			док_тт_РабочийЛистТрейдИн.Марка = Автомобиль.БТ_МаркаАвто;
			док_тт_РабочийЛистТрейдИн.ХозОперация = Справочники.ХозОперации.НайтиПоНаименованию("РабочийЛист",Истина);
			док_тт_РабочийЛистТрейдИн.Состояние = Перечисления.БТ_ТрейдИнСостояние.Ремонт;   
			док_тт_РабочийЛистТрейдИн.Статус = Перечисления.БТ_ТрейдИнСтатус.TradeIn;
			док_тт_РабочийЛистТрейдИн.ПодразделениеНахождения = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000129"); 
			док_тт_РабочийЛистТрейдИн.Автор = ПараметрыСеанса.Пользователь;
			док_тт_РабочийЛистТрейдИн.Организация = ПараметрыСеанса.Организация;
			док_тт_РабочийЛистТрейдИн.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			док_тт_РабочийЛистТрейдИн.Комментарий = "Создан автоматически по заказ-наряду № " + Номер + " от " + формат(Дата,"ДФ=dd.MM.yyyy");	 
			док_тт_РабочийЛистТрейдИн.Записать(РежимЗаписиДокумента.Запись); 
			
			Стр = Документы.тт_РабочийЛистТрейдИн.НайтиДанныеПоступления(Автомобиль,док_тт_РабочийЛистТрейдИн.Ссылка);
			
			док_тт_РабочийЛистТрейдИн.ЦенаПокупки = Стр.ЦенаПокупки;  
			док_тт_РабочийЛистТрейдИн.ДокументПоступленияНаСклад = Стр.ДокументПоступленияНаСклад;
			док_тт_РабочийЛистТрейдИн.Записать(РежимЗаписиДокумента.Проведение); 
			
			Сообщить("Создан рабочий лист трейд-ин "+док_тт_РабочийЛистТрейдИн.Номер+" от "+Формат(док_тт_РабочийЛистТрейдИн.Дата,"ДФ=dd.MM.yyyy"));
			
		КонецЕсли;
	КонецЕсли;
	//bizteh(САА 23.12.2021)--
	
	Если ПометкаУдаления Тогда
		//Удалим накопление сумм
		НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
		НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейНакоплениеСумм.ОтменаПроведения();
		// Очистим регистр ГрафикРаботыРесурсов
		НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
		НаборЗаписейГрафикРаботыРесурсов.ДокументОбъект = Ссылка;
		НаборЗаписейГрафикРаботыРесурсов.ОтменаПроведения();
		
		// Удалим введенные в оборот коды маркировки
		НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
		
	ИначеЕсли НЕ Отказ Тогда
		Отказ=НЕ орГрафикРаботыРесурсовПоЗаказНаряду(Ссылка);
	КонецЕсли;
	
	Если Отказ Тогда
		Сообщить("При записи <"+СокрЛП(ЭтотОбъект)+"> обнаружены ошибки :",СтатусСообщения.Внимание);
		Сообщить(Ошибки,СтатусСообщения.БезСтатуса);
		Сообщить("Из-за возникших ошибок операция записи была отменена.",СтатусСообщения.Важное);
	КонецЕсли; 
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	//Удалим накопление сумм
	НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
	НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейНакоплениеСумм.ОтменаПроведения();
	
	НаборЗаписейФактическоеВремя = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
	НаборЗаписейФактическоеВремя.Отбор.ЗаказНаряд.Установить(Ссылка);
	НаборЗаписейФактическоеВремя.Прочитать();
	НаборЗаписейФактическоеВремя.Очистить();
	НаборЗаписейФактическоеВремя.Записать();
	
	// Удалим введенные в оборот коды маркировки
	НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры

// Функция производит сравнение данных заказ наряда и складских ордеров
// и возвращает результат сравнения
Функция ПроверитьСкладскиеОрдера()
	КонтрольСкладскихОрдеровПоЗаказНаряду=обПраво("КонтрольСкладскихОрдеровПоЗаказНаряду",Права,,ЭтотОбъект);
	Если КонтрольСкладскихОрдеровПоЗаказНаряду=Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИзвлечениеТоваровИзПроизводства.Ссылка КАК ДокументИзвлечения
	|ПОМЕСТИТЬ
	|	ТаблицаИзвлечениеТоваровИзПроизводства
	|ИЗ
	|	Документ.ИзвлечениеТоваровИзПроизводства КАК ИзвлечениеТоваровИзПроизводства
	|ГДЕ
	|	ИзвлечениеТоваровИзПроизводства.ДокументОснование = &ЗаказНаряд
	|СГРУППИРОВАТЬ ПО
	|	ИзвлечениеТоваровИзПроизводства.Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ПеремещениеТоваровВПроизводство.Ссылка КАК ДокументПеремещения
	|ПОМЕСТИТЬ
	|	ТаблицаПеремещениеТоваровВПроизводство
	|ИЗ
	|	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
	|ГДЕ
	|	ПеремещениеТоваровВПроизводство.ДокументОснование = &ЗаказНаряд
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровВПроизводство.Ссылка
	|;	
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистраторов.Регистратор КАК Регистратор,
	|	ТаблицаРегистраторов.СкладКомпании КАК СкладКомпании
	|ПОМЕСТИТЬ
	|	ТаблицаРегистраторов
	|ИЗ(
	|	ВЫБРАТЬ
	|		ПриходныйСкладскойОрдер.Ссылка КАК Регистратор,
	|		ПриходныйСкладскойОрдер.СкладКомпании КАК СкладКомпании
	|	ИЗ
	|		Документ.ПриходныйСкладскойОрдер КАК ПриходныйСкладскойОрдер
	|	ГДЕ
	|		ПриходныйСкладскойОрдер.ДокументОснование В (ВЫБРАТЬ ДокументИзвлечения ИЗ ТаблицаИзвлечениеТоваровИзПроизводства)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходныйСкладскойОрдер.Ссылка,
	|		РасходныйСкладскойОрдер.СкладКомпании
	|	ИЗ
	|		Документ.РасходныйСкладскойОрдер КАК РасходныйСкладскойОрдер
	|	ГДЕ
	|		РасходныйСкладскойОрдер.ДокументОснование В (ВЫБРАТЬ ДокументПеремещения ИЗ ТаблицаПеремещениеТоваровВПроизводство)) КАК ТаблицаРегистраторов
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРегистраторов.Регистратор,
	|	ТаблицаРегистраторов.СкладКомпании
	|ИНДЕКСИРОВАТЬ ПО
	|	СкладКомпании
	|;
	|
	|ВЫБРАТЬ
	|	ОбъединенныйЗапрос.СкладКомпании КАК СкладКомпании,
	|	ОбъединенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ОбъединенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ОбъединенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(СУММА(ОбъединенныйЗапрос.КоличествоПриход), 0) КАК КоличествоПриход,
	|	ЕСТЬNULL(СУММА(ОбъединенныйЗапрос.КоличествоПриходОрдер), 0) КАК КоличествоПриходОрдер,
	|	ЕСТЬNULL(СУММА(ОбъединенныйЗапрос.КоличествоРасход), 0) КАК КоличествоРасход,
	|	ЕСТЬNULL(СУММА(ОбъединенныйЗапрос.КоличествоРасходОрдер), 0) КАК КоличествоРасходОрдер
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыВПроизводствеОбороты.Регистратор.СкладКомпании КАК СкладКомпании,
	|		ТоварыВПроизводствеОбороты.Номенклатура КАК Номенклатура,
	|		ТоварыВПроизводствеОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		ТоварыВПроизводствеОбороты.КоличествоПриход КАК КоличествоПриход,
	|		ТоварыВПроизводствеОбороты.КоличествоРасход КАК КоличествоРасход,
	|		0 КАК КоличествоПриходОрдер,
	|		0 КАК КоличествоРасходОрдер
	|	ИЗ
	|		РегистрНакопления.ТоварыВПроизводстве.Обороты(, , Регистратор, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОбороты
	|	ГДЕ
	|		ТоварыВПроизводствеОбороты.Регистратор.СкладКомпании.ВидСклада <> ЗНАЧЕНИЕ(Перечисление.ВидыСкладов.Обычный)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаРегистраторов.СкладКомпании,
	|		ОстаткиТоваровОрдерныйСклад.Номенклатура,
	|		ОстаткиТоваровОрдерныйСклад.ХарактеристикаНоменклатуры,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ОстаткиТоваровОрдерныйСклад.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				0
	|			ИНАЧЕ ОстаткиТоваровОрдерныйСклад.Количество
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ОстаткиТоваровОрдерныйСклад.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				ОстаткиТоваровОрдерныйСклад.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаРегистраторов КАК ТаблицаРегистраторов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровОрдерныйСклад КАК ОстаткиТоваровОрдерныйСклад
	|	ПО
	|		ТаблицаРегистраторов.СкладКомпании = ОстаткиТоваровОрдерныйСклад.СкладКомпании И 
	|		ТаблицаРегистраторов.Регистратор = ОстаткиТоваровОрдерныйСклад.Регистратор) КАК ОбъединенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединенныйЗапрос.СкладКомпании,
	|	ОбъединенныйЗапрос.Номенклатура,
	|	ОбъединенныйЗапрос.ХарактеристикаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	СкладКомпании.Наименование,
	|	Номенклатура.Наименование,
	|	ХарактеристикаНоменклатуры.Наименование";
	Запрос.УстановитьПараметр("ЗаказНаряд",Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	
	СообщениеОбОшибке="";
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоПриход<>Выборка.КоличествоПриходОрдер ИЛИ
			 Выборка.КоличествоРасход<>Выборка.КоличествоРасходОрдер Тогда
			СообщениеОбОшибке=СообщениеОбОшибке+?(ПустаяСтрока(СообщениеОбОшибке),"",Символы.ПС);
			СообщениеОбОшибке=СообщениеОбОшибке+Выборка.СкладКомпании+": ";
			СообщениеОбОшибке=СообщениеОбОшибке+?(ПустаяСтрока(Выборка.Артикул),"","["+Выборка.Артикул+"]");
			СообщениеОбОшибке=СообщениеОбОшибке+Выборка.Номенклатура;
			СообщениеОбОшибке=СообщениеОбОшибке+?(обЗначениеНеЗаполнено(Выборка.ХарактеристикаНоменклатуры),""," ("+Выборка.ХарактеристикаНоменклатуры+")");
			Если Выборка.КоличествоПриход<>Выборка.КоличествоПриходОрдер Тогда
				СообщениеОбОшибке=СообщениеОбОшибке+Символы.ПС+Символы.Таб;
				СообщениеОбОшибке=СообщениеОбОшибке+"Перемещено в производство "+Формат(Выборка.КоличествоПриход,"ЧДЦ=3; ЧН=0,000");
				СообщениеОбОшибке=СообщениеОбОшибке+"; По ордерному учету "+Формат(Выборка.КоличествоПриходОрдер,"ЧДЦ=3; ЧН=0,000");
			КонецЕсли;
			Если Выборка.КоличествоРасход<>Выборка.КоличествоРасходОрдер Тогда
				СообщениеОбОшибке=СообщениеОбОшибке+Символы.ПС+Символы.Таб;
				СообщениеОбОшибке=СообщениеОбОшибке+"Извлечено из производства "+Формат(Выборка.КоличествоРасход,"ЧДЦ=3; ЧН=0,000");
				СообщениеОбОшибке=СообщениеОбОшибке+"; По ордерному учету "+Формат(Выборка.КоличествоРасходОрдер,"ЧДЦ=3; ЧН=0,000");
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Результат=Истина;
	Если НЕ ПустаяСтрока(СообщениеОбОшибке) Тогда
		ЗаголовокОбОшибке="По заказ-наряду <"+СокрЛП(Ссылка)+"> обнаружено расхождение документов оперативного и складского учета:";
		Если КонтрольСкладскихОрдеровПоЗаказНаряду=Перечисления.ВидыКонтроля.Запрещать Тогда
			Результат=Ложь;
			Сообщить(ЗаголовокОбОшибке,СтатусСообщения.Важное);
		Иначе
			Сообщить(ЗаголовокОбОшибке,СтатусСообщения.Информация);
		КонецЕсли; 
		Сообщить(СообщениеОбОшибке);
	КонецЕсли;
	Возврат Результат;
КонецФункции // ПроверитьСкладскиеОрдера()

// Процедура выполняет очистку движений документа по регистрам
Процедура ОчиститьДвиженияДокумента()
	//Удалим все сформированные движения
	Для каждого РегистрДвижения Из Движения Цикл
		Если РегистрДвижения.Метаданные()=Метаданные.РегистрыНакопления.ВыработкаСотрудников Тогда
			//Выработка формируется всегда при выполнении
			Продолжить;
		КонецЕсли; 
		РегистрДвижения.Очистить();
		РегистрДвижения.Записать();
	КонецЦикла; 	
	НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
	НаборЗаписейНакоплениеСумм.Отбор.Документ.Значение=Ссылка;
	НаборЗаписейНакоплениеСумм.Отбор.Документ.Использование=Истина;
	НаборЗаписейНакоплениеСумм.Прочитать();
	НаборЗаписейНакоплениеСумм.Очистить();
	НаборЗаписейНакоплениеСумм.Записать();
	
	// Удалим введенные в оборот коды маркировки
	НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	Если Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Выполнен И
		 Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		 // Для невыполненного и не закрытого заказ-наряда проведение не нужно
		 ОчиститьДвиженияДокумента();
		 дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		 Возврат;
	КонецЕсли;

	ГрупповаяОбработкаДокументов = Ложь;
	Если НЕ ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов", ГрупповаяОбработкаДокументов) Тогда 
		ГрупповаяОбработкаДокументов = Ложь;
	КонецЕсли;		

	Если ГрупповаяОбработкаДокументов = Ложь Тогда
		
		КонтрольРезервовПоЗаказНарядам = обПраво("КонтрольРезервовПоЗаказНарядам",Права,,ЭтотОбъект);
		
		Если КонтрольРезервовПоЗаказНарядам = Перечисления.ВидыКонтроля.Запрещать 
			 ИЛИ КонтрольРезервовПоЗаказНарядам = Перечисления.ВидыКонтроля.Предупреждать Тогда

			// фильтр по заказу
			ДопОтбор = "";
			Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") И ЗначениеЗаполнено(ДокументОснование) Тогда
				ДопОтбор = " ИЛИ Заказ = &ЗаказОснование";
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			             |	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
			             |	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			             |	ЕСТЬNULL(ЗаказыПокупателейОстатки.ЗаказаноОстаток, 0) КАК Заказано,
			             |	ЕСТЬNULL(ЗаказыПокупателейОстатки.РезервОстаток, 0) КАК Резерв
			             |ИЗ
			             |	РегистрНакопления.ЗаказыПокупателей.Остатки(,Заказ ССЫЛКА Документ.ЗаказПокупателя И Заказ.ДокументОснование = &ДокументОснование" + ДопОтбор + ") КАК ЗаказыПокупателейОстатки
			             |УПОРЯДОЧИТЬ ПО
			             |	Номенклатура,
			             |	ХарактеристикаНоменклатуры";
			Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
			Запрос.УстановитьПараметр("ЗаказОснование",    ДокументОснование);
			
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Количество()>0 Тогда
				Сообщить("По заказ-наряду <"+СокрЛП(Ссылка)+"> существуют заказанные/зарезервированные детали:",
					?(КонтрольРезервовПоЗаказНарядам = Перечисления.ВидыКонтроля.Запрещать,
					СтатусСообщения.Важное,
					СтатусСообщения.Информация));
				ИмяРеквизитаКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
				Пока Выборка.Следующий() Цикл
					Код=дкПолучитьЗначениеКолонкиКода(Выборка.Номенклатура,ИмяРеквизитаКода,ЭтотОбъект,Истина);
					ЕдИзм=СокрЛП(Выборка.Номенклатура.БазоваяЕдиницаИзмерения);
					ТекстСообщения="Деталь ["+Код+"] """+СокрЛП(Выборка.Номенклатура)+"""";
					Если НЕ обЗначениеНеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
						ТекстСообщения=ТекстСообщения+" с характеристикой "+СокрЛП(Выборка.ХарактеристикаНоменклатуры);
					КонецЕсли;
					ТекстСообщения=ТекстСообщения+" заказана под заказ-наряд в количестве "+Формат(Выборка.Заказано,"ЧДЦ=2; ЧН=0,00")+" "+ЕдИзм;
					Если Выборка.Резерв<>0 Тогда
						ТекстСообщения=ТекстСообщения+" и зарезервирована в количестве "+Формат(Выборка.Резерв,"ЧДЦ=2; ЧН=0,00")+" "+ЕдИзм;
					КонецЕсли;
					ТекстСообщения=ТекстСообщения+".";
					Сообщить(ТекстСообщения);
				КонецЦикла;

				Если КонтрольРезервовПоЗаказНарядам = Перечисления.ВидыКонтроля.Запрещать Тогда
					Сообщить("Произведите корректировку/снятие резервов данных деталей.");
					Отказ=Истина;
					Возврат;
				КонецЕсли;
					
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если НЕ ПроверитьСкладскиеОрдера() Тогда
		Отказ=Истина; Возврат;
	КонецЕсли; 
	
	//БИЗТЕХ КОВАЛЬ 16.05.2025 ++
	//Для подразделения "Сервис ФКДД Haval Сочи" ЦБ000280 выполнить проверку заполненной почты контрагента
	Если ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000280") И
		Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен И
		НЕ ЗначениеЗаполнено(Справочники.Контрагенты.ПолучитьПочту(Заказчик)) Тогда
		Сообщить("Проведение прервано! Не заполнена почта заказчика!");
		Отказ=Истина; Возврат;
	КонецЕсли;
	//БИЗТЕХ КОВАЛЬ 16.05.2025 --
	
	//БИЗТЕХ КОВАЛЬ 29.01.2024 ++
	//Проверка максимальной скидки по товарам
	//Скидка не должна быть больше чем себестоимость товара
	Если ПроверитьСкидкиПоТоварам(ЭтотОбъект) Тогда
		Сообщить("Проведение прервано! Скидки на товары не должны быть больше себестоимости товаров!");
		Отказ=Истина; Возврат;
	КонецЕсли;
	//БИЗТЕХ КОВАЛЬ 29.01.2024 --
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);

	//БизТех 14.11.2022г. <<
	Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт  и Не АвтоЕстьНаСкладе(ЭтотОбъект, ШапкаДокумента.МоментВремени.Дата)
		//Комплектация К, Восстаноление товарных а/м, Предпродажка
		И (ВидРемонта.Код = "ЦБ000017" ИЛИ ВидРемонта.Код = "ЦБ000007" ИЛИ ВидРемонта.Код = "ЦБ000023" ИЛИ ВидРемонта.Код = "ЦБ000012") Тогда  
		Сообщить("Не найден автомобиль "+ЭтотОбъект.Автомобиль+ " на складе организации. Заказ-наряд не может быть закрыт! Проведите приход автомобиля на склад.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
    //>>
	
	//Вычислим сумму задолженности по заказ-наряду 
	//БизТех Коваль А.Д. 02.04.2024 добавлен вид работы для исключения "Сервисные кампании"    
	Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И 
		ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный И (ВидРемонта.Наименование <> "Гарантийный заказ" И ВидРемонта.Наименование <> "Сервисные кампании") Тогда
		//Если НЕ обПраво("РазрешитьОтгрузкуВДолг",Права,,ЭтотОбъект) Тогда
		ЗапретитьПереплатуПоЗаказНарядам=ПланыВидовХарактеристик.ТипыСделок.ЗаказНаряд.ЗапретитьПереплатуПоСделкам;
		//Вычислим сумму задолженности по заказ-наряду
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаОборот КАК Сумма,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаУпрОборот КАК СуммаУпр,
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.СуммаБазОборот КАК СуммаБаз
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
		|				И Контрагент = &Контрагент
		|				" + ?(ЗапретитьПереплатуПоЗаказНарядам, "И (Сделка = &ЗаказНаряд ИЛИ Сделка.ДокументОснование = &ЗаказНаряд ИЛИ Сделка = &Сделка)", "") + "
		|			) КАК ВзаиморасчетыКомпанииОстаткиИОбороты
		|ГДЕ
		|	ВзаиморасчетыКомпанииОстаткиИОбороты.Регистратор <> &ЗаказНаряд";
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Запрос.УстановитьПараметр("ЗаказНаряд",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Сделка", ЭтотОбъект.ДокументОснование);
		тзДолги=Запрос.Выполнить().Выгрузить();
		Если обПраво("ПроверкаМаксимальногоПревышенияКредитаКонтрагента",Права,,ЭтотОбъект) И НЕ ДоговорВзаиморасчетов.ОтменаКонтроляСуммыКредита Тогда
			МаксимальныйКредит=ДоговорВзаиморасчетов.МаксимальныйКредит;
		Иначе
			МаксимальныйКредит=0;
		КонецЕсли;
		Если ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=ВалютаДокумента Тогда
			Долг=тзДолги.Итог("Сумма")-МаксимальныйКредит;
		ИначеЕсли ВалютаДокумента=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
			Долг=тзДолги.Итог("СуммаБаз")-обПересчет(МаксимальныйКредит,ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, ШапкаДокумента.МоментВремени,ВалютаДокумента,КурсДокумента);
		Иначе
			Долг=обПересчет(тзДолги.Итог("Сумма")-МаксимальныйКредит,ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, ШапкаДокумента.МоментВремени,ВалютаДокумента,КурсДокумента);
		КонецЕсли;
		СуммаДолга=СуммаДокумента+Долг; 
		
		//begin taty 24.03.2021
		//Если СуммаДолга>=0.01 Тогда
		//	Сообщить("Сумма долга до заказ-наряду составляет "+Формат(СуммаДолга,"ЧЦ=15; ЧДЦ=2")+" "+СокрЛП(ВалютаДокумента));
		//	Отказ=Истина; Возврат;
		//КонецЕсли; 
		ЭМ_ПодписалОплату = обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ПодписалОплату, Справочники.Пользователи.ПустаяСсылка());
		Если ЗначениеЗаполнено(ЭМ_ПодписалОплату) Тогда
			ОплатаПодписана = Истина;
		Иначе
			ОплатаПодписана = Ложь;
		КонецЕсли;	
		Если СуммаДолга>=0.01 и Не ОплатаПодписана и не РольДоступна("ВосстПослед") Тогда
			Сообщить("Сумма долга до заказ-наряду составляет "+Формат(СуммаДолга,"ЧЦ=15; ЧДЦ=2")+" "+СокрЛП(ВалютаДокумента)+ ". Необходимо подписать оплату!", СтатусСообщения.Важное);
			Отказ=Истина; Возврат;
		КонецЕсли	
		//end  
		
		//КонецЕсли; 
		
	КонецЕсли; 
	
	Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И 
		ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный Тогда
		// проводим взаиморасчеты
		НаборЗаписейВзаиморасчеты=Движения.ВзаиморасчетыКомпании;
		НаборЗаписейВзаиморасчеты.ШапкаДокумента=ШапкаДокумента;
		НаборЗаписейВзаиморасчеты.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейВзаиморасчеты.РежимПроведения=Режим;
		НаборЗаписейВзаиморасчеты.Контрагент=Контрагент;
		НаборЗаписейВзаиморасчеты.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		
		НаборЗаписейВзаиморасчеты.Сделка=Ссылка; 
		
		//Если НЕ обЗначениеНеЗаполнено(ДокументОснование)
		//	И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//	НаборЗаписейВзаиморасчеты.Сделка=ДокументОснование;
		//Иначе
		//	НаборЗаписейВзаиморасчеты.Сделка=Ссылка;
		//КонецЕсли; 
		
		НаборЗаписейВзаиморасчеты.ВзаиморасчетыСПокупателем=Истина;
		НаборЗаписейВзаиморасчеты.АвтоЗакрытиеСделок=АвтоЗакрытиеСделок;
		НаборЗаписейВзаиморасчеты.Сумма=СуммаДокумента;
		НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц=0;
		Отказ=НЕ НаборЗаписейВзаиморасчеты.Приход() ИЛИ Отказ;
		// доходы и расходы по суммовым разницам
		СуммаДоходаРасходаСуммовыхРазниц=НаборЗаписейВзаиморасчеты.СуммаДоходаРасходаСуммовыхРазниц;
		Если СуммаДоходаРасходаСуммовыхРазниц<>0 Тогда
			НаборЗаписейДиР = Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ШапкаДокумента = ШапкаДокумента;
			НаборЗаписейДиР.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СуммовыеРазницы;
			НаборЗаписейДиР.ВУпрВалюте = Истина;
			Если СуммаДоходаРасходаСуммовыхРазниц<0 Тогда
				НаборЗаписейДиР.Расход = -СуммаДоходаРасходаСуммовыхРазниц;
			Иначе
				НаборЗаписейДиР.Доход = СуммаДоходаРасходаСуммовыхРазниц;
			КонецЕсли;
			Отказ = НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		//Движение по субподряду
		НаборЗаписейСубподряд=Движения.Субподряд;
		НаборЗаписейСубподряд.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейСубподряд.ДатаВыполнения=ШапкаДокумента.Дата;
		Запрос=Новый Запрос("ВЫБРАТЬ
		                    |	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		                    |	ЗаказНарядРаботы.Работа КАК Работа,
		                    |	ЗаказНарядРаботы.Контрагент КАК Контрагент,
		                    |	ЗаказНарядРаботы.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		                    |	СУММА(ЗаказНарядРаботы.СуммаВсего) КАК СуммаВсего,
		                    |	СУММА(ЗаказНарядРаботы.СуммаНДС) КАК СуммаНДС
		                    |ИЗ
		                    |	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		                    |ГДЕ
		                    |	ЗаказНарядРаботы.Ссылка = &Ссылка
		                    |	И ЗаказНарядРаботы.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ЗаказНарядРаботы.Ссылка,
		                    |	ЗаказНарядРаботы.Работа,
		                    |	ЗаказНарядРаботы.Контрагент,
		                    |	ЗаказНарядРаботы.ДоговорВзаиморасчетов");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		НаборЗаписейСубподряд.РезультатЗапросаПоРаботам=Запрос.Выполнить().Выгрузить();
		Отказ=НЕ НаборЗаписейСубподряд.Движение(Истина) ИЛИ Отказ;
	КонецЕсли;
	
	// запишем изменения по фактическому времени выполнения работ
	 
	Если ?(ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда,Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен , Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт) И Не Отказ Тогда
		Если ЗакрыватьИнтервалыРабот Тогда
			ЗакрытиеОткрытыхПакетов(Ложь);
		КонецЕсли;
		// сначала проверим наличие открытых работ по пакету
		НаборЗаписейФактВремя = РегистрыСведений.УРВ_ФактическоеВремяРабот.СоздатьНаборЗаписей();
		НаборЗаписейФактВремя.ДокЗаказНаряд = Ссылка;
		НаборЗаписейФактВремя.ВыполнитьДвиженияПоЗН();
	КонецЕсли;
	
	//Формирование выработки исполнителей работ
	НаборЗаписейВыработкаСотрудников=Движения.ВыработкаСотрудников;
	НаборЗаписейВыработкаСотрудников.РежимПроведения=Режим;
	НаборЗаписейВыработкаСотрудников.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейВыработкаСотрудников.РезультатЗапросаПоРаботам=Неопределено;
	НаборЗаписейВыработкаСотрудников.РезультатЗапросаПоИсполнителям=Неопределено;
	НаборЗаписейВыработкаСотрудников.ВидРемонта=Неопределено;
	НаборЗаписейВыработкаСотрудников.Автомобиль=Неопределено;
	Если ВыработкаСотрудниковПоВыполнениюЗаказНаряда И Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		НаборЗаписейВыработкаСотрудников.ПериодДвижения=ДатаОкончания;
		ЕстьДвиженияПоВыработке=Истина;
	ИначеЕсли Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Если ВыработкаСотрудниковПоВыполнениюЗаказНаряда Тогда
			НаборЗаписейВыработкаСотрудников.ПериодДвижения=ДатаОкончания;
		Иначе
			НаборЗаписейВыработкаСотрудников.ПериодДвижения=ДатаЗакрытия;
		КонецЕсли; 
		ЕстьДвиженияПоВыработке=Истина;
	Иначе
		ЕстьДвиженияПоВыработке=Ложь;
	КонецЕсли;
	Если ЕстьДвиженияПоВыработке Тогда
		Отказ=НЕ НаборЗаписейВыработкаСотрудников.Движение() ИЛИ Отказ;
	КонецЕсли; 
	НаборЗаписейВыработкаСотрудников.РежимПроведения=Неопределено;
	НаборЗаписейВыработкаСотрудников.ДокументОбъект=Неопределено;
	НаборЗаписейВыработкаСотрудников.РезультатЗапросаПоРаботам=Неопределено;
	НаборЗаписейВыработкаСотрудников.РезультатЗапросаПоИсполнителям=Неопределено;
	НаборЗаписейВыработкаСотрудников.ВидРемонта=Неопределено;
	НаборЗаписейВыработкаСотрудников.Автомобиль=Неопределено;
	НаборЗаписейВыработкаСотрудников.ПериодДвижения=Неопределено;
	
	// проведем партии товаров
	Отказ = НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	Если (НЕ Отказ) И (ВидРемонта.ТипРемонта=Перечисления.ТипыРемонта.Платный) И 
		 (Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда
		//Сформируем сумму накопления
		НаборЗаписейНакоплениеСумм=РегистрыСведений.НакоплениеСумм.СоздатьНаборЗаписей();
		//НаборЗаписейНакоплениеСумм.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейНакоплениеСумм.ДокументОбъект=ШапкаДокумента;
		НаборЗаписейНакоплениеСумм.Контрагент=Контрагент;
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент),0) КАК Количество
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НаборЗаписейНакоплениеСумм.КоличествоНоменклатуры=Выборка.Количество;
		Иначе
			НаборЗаписейНакоплениеСумм.КоличествоНоменклатуры=0;
		КонецЕсли; 
		НаборЗаписейНакоплениеСумм.Карточка=Карточка;
		НаборЗаписейНакоплениеСумм.Сторно=Ложь;
		Отказ=НЕ НаборЗаписейНакоплениеСумм.НакоплениеСуммы() ИЛИ Отказ;
	КонецЕсли;
	
//<<Павличенко 26.09.2019
	
	Если (НЕ Отказ) И (Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда	
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.Работа,
		|	ЗначенияСвойствОбъектов.Значение КАК НомерТО
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ЗаказНарядРаботы.Работа = ЗначенияСвойствОбъектов.Объект
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &СвойствоНомерТО
		|	И ЗаказНарядРаботы.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("СвойствоНомерТО", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12185"));
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаВыгрузки = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей = РегистрыСведений.ТТ_Пройденные_ТО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Для каждого СтрокаТаблицы из ТаблицаВыгрузки цикл
			
			НовЗапись = НаборЗаписей.Добавить();
			
			НовЗапись.Период  = ДатаЗакрытия;
			НовЗапись.Автомобиль = Автомобиль;
			НовЗапись.НомерТО = СтрокаТаблицы.НомерТО;
			НовЗапись.Авторабота = СтрокаТаблицы.Работа;
			
			НовЗапись.Пробег = Пробег;
			
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;	
	//>>Павличенко 26.09.2019
	
	// бонусные баллы
	НаборБонусныеПрограммы = Движения.БонусныеБаллы;
	Если КоличествоКНачислению > 0 Тогда
		НаборБонусныеПрограммы.Карта             = Карточка;
		НаборБонусныеПрограммы.БонуснаяПрограмма = Карточка.БонуснаяПрограмма;
		НаборБонусныеПрограммы.ХозОперация       = ХозОперация;
		НаборБонусныеПрограммы.КоличетсвоБаллов  = КоличествоКНачислению;
		НаборБонусныеПрограммы.Регистратор       = Ссылка;
		НаборБонусныеПрограммы.ДокДата           = Дата;
		
		Отказ = НЕ НаборБонусныеПрограммы.Приход() ИЛИ Отказ;
	КонецЕсли;
	
	Если КоличествоКСписанию > 0 Тогда
		МаксимальноеКоличествоБаллов = БонусныеПрограммыСервер.МаксимальноеКоличетсвоБоллов(ЭтотОбъект, Карточка.БонуснаяПрограмма);
		Если КоличествоКСписанию > МаксимальноеКоличествоБаллов Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Максимальное количество бонусных баллов доступных к оплате %1 меньше указанных %2.'");
			ТекстСообщения = СтрЗаменить(СтрЗаменить(ТекстСообщения, "%1", МаксимальноеКоличествоБаллов), "%2", КоличествоКСписанию);
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		КонецЕсли;
		//Если Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		//	НаборБонусныеПрограммы.ПериодДвижения=ДатаОкончания;
		//ИначеЕсли Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		//	НаборБонусныеПрограммы.ПериодДвижения=ДатаЗакрытия;
		//КонецЕсли;
		НаборБонусныеПрограммы.Карта = Карточка;
		НаборБонусныеПрограммы.БонуснаяПрограмма = Карточка.БонуснаяПрограмма;
		НаборБонусныеПрограммы.ХозОперация       = ХозОперация;
		НаборБонусныеПрограммы.КоличетсвоБаллов  = КоличествоКСписанию;
		НаборБонусныеПрограммы.Регистратор       = Ссылка;
		НаборБонусныеПрограммы.ДокДата           = Дата;
		
		Отказ = НЕ НаборБонусныеПрограммы.Расход() ИЛИ Отказ;
		
	КонецЕсли;
	
	// двигаем границу последовательности взаиморасчетов
	ДвигаемГраницу = (НЕ ДополнительныеСвойства.ОперативноеПроведение И Движения.ВзаиморасчетыКомпании.Количество()>0);
	Если ДополнительныеСвойства.ПроверятьПоследовательность И (ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ДоговорВзаиморасчетовБыл)) Тогда
		НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			ТаблицаДоговоров = Движения.ВзаиморасчетыКомпании.Выгрузить();
			ТаблицаДоговоров.Свернуть("ДоговорВзаиморасчетов","");
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ШапкаДокумента.Дата;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = ДополнительныеСвойства.ДоговорВзаиморасчетовБыл;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетовБыл = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
	КонецЕсли;
	
	Если Отказ Тогда
		ДатаОкончания = Неопределено;
		ДатаЗакрытия = Неопределено;
	КонецЕсли;
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
	Если Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		//Для состояния выполнен требуется очистка движений
		ОчиститьДвиженияДокумента();
	Иначе
		// Проверим наличие прослеживаемых товаров, которые были возвращены из розницы
		Если НЕ Отказ Тогда
			Движения.ТоварыВПроизводстве.Записать();
			Движения.Продажи.Записать();
		КонецЕсли;
		НаборЗаписейОперацииПрослеживаемости = Движения.ОперацииПрослеживаемыхТоваров;
		НаборЗаписейОперацииПрослеживаемости.ДокументОбъект = ЭтотОбъект;
		НаборЗаписейОперацииПрослеживаемости.ТаблицаПрослеживаемыхТоваров = ОперацииСПрослеживаемымиТоварами();
		Если НЕ НаборЗаписейОперацииПрослеживаемости.ДобавитьОперациюПрослеживаемости() Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли; 
	
//bizteh(САА 23.12.2021)++
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	тт_РабочийЛистТрейдИн.Ссылка КАК Ссылка,
	|	тт_РабочийЛистТрейдИн.Состояние КАК Состояние
	|ИЗ
	|	Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
	|ГДЕ
	|	тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
	|	И НЕ тт_РабочийЛистТрейдИн.ПометкаУдаления";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВидРемонта.Код = "ЦБ000012" и Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда //Предпродажная подготовка авто с пробегом 
			ТекСостояние = Перечисления.БТ_ТрейдИнСостояние.ВПродаже;
		КонецЕсли; 
		
		Если ВидРемонта.Код = "ЦБ000012" и Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе Тогда //Предпродажная подготовка авто с пробегом 
			ТекСостояние = Перечисления.БТ_ТрейдИнСостояние.Ремонт;
		КонецЕсли;  
		
		Если ВыборкаДетальныеЗаписи.Состояние <> ТекСостояние и ВыборкаДетальныеЗаписи.Состояние <> Перечисления.БТ_ТрейдИнСостояние.Продан Тогда
			
			отт_РабочийЛистТрейдИн = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			отт_РабочийЛистТрейдИн.Состояние = ТекСостояние; 
			отт_РабочийЛистТрейдИн.Записать(РежимЗаписиДокумента.Запись);
			
			НоваяЗапись = РегистрыСведений.БТ_РабочийЛистТрейдИнИсторияСостояний.СоздатьМенеджерЗаписи();
			НоваяЗапись.тт_РабочийЛистТрейдИн = ВыборкаДетальныеЗаписи.Ссылка;
			НоваяЗапись.ДатаИзменения = ТекущаяДата();
			НоваяЗапись.Состояние = ТекСостояние;
			НоваяЗапись.Пользователь = ПараметрыСеанса.Пользователь;
			НоваяЗапись.Записать();	
			
		КонецЕсли;  
		
	КонецЦикла; 
	//bizteh(САА 23.12.2021)--
	
	//<<БАА
	Если Не Отказ И Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_СопоставлениеДанныхHaval.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеДанныхHaval КАК БТ_СопоставлениеДанныхHaval
		                      |ГДЕ
		                      |	БТ_СопоставлениеДанныхHaval.Тип = &Тип
		                      |	И БТ_СопоставлениеДанныхHaval.Данные1С = &Данные1С");
		Запрос.УстановитьПараметр("Тип", "Бренд");
		Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
		
		Если Не Запрос.Выполнить().Пустой() 
			И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000045", ПодразделениеКомпании)
			//БИЗТЕХ КОВАЛЬ 15.04.2025 SDK 000000844 ++
			И БТ_СлужебныеФункции.ПроверитьВидРемонтаДляВыгрузки("БТ_СопоставлениеВидовРемонтаHaval",ВидРемонта) Тогда
			//БИЗТЕХ КОВАЛЬ 15.04.2025 -- 
			
			НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхHaval.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
			НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Мен = РегистрыСведений.БТ_СопоставлениеДанныхHaval.СоздатьМенеджерЗаписи();
				Мен.Период = ТекущаяДатаСеанса();
				Мен.Тип = "ЗаказНаряд";
				Мен.Данные1С = Ссылка;
				Мен.Записать();
			КонецЕсли;	
		КонецЕсли;	
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение КАК Подразделение
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеПодразделенийChangan КАК БТ_СопоставлениеПодразделенийChangan
		                      |ГДЕ
		                      |	БТ_СопоставлениеПодразделенийChangan.Подразделение = &Подразделение
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	БТ_СопоставлениеДанныхChangan.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеДанныхChangan КАК БТ_СопоставлениеДанныхChangan
		                      |ГДЕ
		                      |	БТ_СопоставлениеДанныхChangan.Тип = &Тип
		                      |	И БТ_СопоставлениеДанныхChangan.Данные1С = &Данные1С
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта КАК ВидРемонта,
		                      |	БТ_СопоставлениеВидовРемонтаChangan.ДанныеChangan КАК ДанныеChangan,
		                      |	БТ_СопоставлениеВидовРемонтаChangan.ТипОплатыChangan КАК ТипОплатыChangan
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеВидовРемонтаChangan КАК БТ_СопоставлениеВидовРемонтаChangan
		                      |ГДЕ
		                      |	БТ_СопоставлениеВидовРемонтаChangan.ВидРемонта = &ВидРемонта");
		Запрос.УстановитьПараметр("Тип", "Бренд");
		Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);

		Пакет = Запрос.ВыполнитьПакет();
		
		//БИЗТЕХ КОВАЛЬ 11.02.2025 - Добавил проверку по виду ремонта
		Если Не Пакет[0].Пустой() и Не пакет[1].Пустой() И НЕ Пакет[2].пустой() и 
			БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000039", ПодразделениеКомпании) Тогда
			
			НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхChangan.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
			НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Мен = РегистрыСведений.БТ_СопоставлениеДанныхChangan.СоздатьМенеджерЗаписи();
				Мен.Период = ТекущаяДатаСеанса();
				Мен.Тип = "ЗаказНаряд";
				Мен.Данные1С = Ссылка;
				Мен.Записать();
			КонецЕсли;	
		КонецЕсли; 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_СопоставлениеДанныхGeely.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеДанныхGeely КАК БТ_СопоставлениеДанныхGeely
		                      |ГДЕ
		                      |	БТ_СопоставлениеДанныхGeely.Тип = &Тип
		                      |	И БТ_СопоставлениеДанныхGeely.Данные1С = &Данные1С");
		Запрос.УстановитьПараметр("Тип", "Модель");
		Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
		
		ОбработкаGeely = Обработки.БТ_ИнфообменGeely.Создать();
		СтрокаДляПодмены = ОбработкаGeely.ПолучитьПодменяемоеПодразделение(ПодразделениеКомпании);
		 
		Если СтрокаДляПодмены <> Неопределено Тогда
			ПодразделенияДляВыгрузки = СтрокаДляПодмены.ЗначениеПодмены;		
		Иначе
			ПодразделенияДляВыгрузки = ПодразделениеКомпании;	
		КонецЕсли;
		
		Если Не Запрос.Выполнить().Пустой() 
				И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("ZAZ000002", ПодразделенияДляВыгрузки)
				//БИЗТЕХ КОВАЛЬ 15.04.2025 SDK 000000844 ++
				И БТ_СлужебныеФункции.ПроверитьВидРемонтаДляВыгрузки("БТ_СопоставлениеВидовРемонтаGeely",ВидРемонта) Тогда
				//БИЗТЕХ КОВАЛЬ 15.04.2025 -- 
				
				НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхGeely.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
				НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
					Мен = РегистрыСведений.БТ_СопоставлениеДанныхGeely.СоздатьМенеджерЗаписи();
					Мен.Период = ТекущаяДатаСеанса();
					Мен.Тип = "ЗаказНаряд";
					Мен.Данные1С = Ссылка;
					Мен.Записать();
				КонецЕсли;	
		КонецЕсли;
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_СопоставлениеДанныхGAC.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
		                      |ГДЕ
		                      |	БТ_СопоставлениеДанныхGAC.Тип = &Тип
		                      |	И БТ_СопоставлениеДанныхGAC.Данные1С = &Данные1С");
		Запрос.УстановитьПараметр("Тип", "Модель");
		Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
		
		Если Не Запрос.Выполнить().Пустой() 
			И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("000000056", ПодразделениеКомпании)
			//БИЗТЕХ КОВАЛЬ 15.04.2025 SDK 000000844 ++
			И БТ_СлужебныеФункции.ПроверитьВидРемонтаДляВыгрузки("БТ_СопоставлениеВидовРемонтаGAC",ВидРемонта) Тогда
			//БИЗТЕХ КОВАЛЬ 15.04.2025 --
			
			
			НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
			НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Мен = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьМенеджерЗаписи();
				Мен.Период = ТекущаяДатаСеанса();
				Мен.Тип = "ЗаказНаряд";
				Мен.Данные1С = Ссылка;
				Мен.Записать();
			КонецЕсли;	
		КонецЕсли; 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_СопоставлениеДанныхAvatr.Период КАК Период
		                      |ИЗ
		                      |	РегистрСведений.БТ_СопоставлениеДанныхAvatr КАК БТ_СопоставлениеДанныхAvatr
		                      |ГДЕ
		                      |	БТ_СопоставлениеДанныхAvatr.Тип = &Тип
		                      |	И БТ_СопоставлениеДанныхAvatr.Данные1С = &Данные1С");
		Запрос.УстановитьПараметр("Тип", "Модель");
		Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель);
		
		Если Не Запрос.Выполнить().Пустой()
			И БТ_СлужебныеФункции.ВыгружаемМаркуПодразделения("AVATR", ПодразделениеКомпании)
			//БИЗТЕХ КОВАЛЬ 15.04.2025 SDK 000000844 ++
			И БТ_СлужебныеФункции.ПроверитьВидРемонтаДляВыгрузки("БТ_СопоставлениеВидовРемонтаAvatr",ВидРемонта) Тогда
			//БИЗТЕХ КОВАЛЬ 15.04.2025 -- 

			НаборЗаписей = РегистрыСведений.БТ_СопоставлениеДанныхAvatr.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Тип.Установить("ЗаказНаряд");
			НаборЗаписей.Отбор.Данные1С.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Мен = РегистрыСведений.БТ_СопоставлениеДанныхAvatr.СоздатьМенеджерЗаписи();
				Мен.Период = ТекущаяДатаСеанса();
				Мен.Тип = "ЗаказНаряд";
				Мен.Данные1С = Ссылка;
				Мен.Записать();
			КонецЕсли;	
		КонецЕсли;
		
		
		//БИЗТЕХ КОВАЛЬ 02.07.2025 ++
		//инфообмен Changan
		Обработки.БТ_ИнфообменHavalСтаврополь.Создать().ПроверитьИЗаписатьДляВыгрузки(Ссылка);
		//БИЗТЕХ КОВАЛЬ 02.07.2025 --

		//БИЗТЕХ КОВАЛЬ 12.09.2025 ++
		//инфообмен Belgee
		Обработки.БТ_ИнфообменBelgee.Создать().ПроверитьИЗаписатьДляВыгрузки(Ссылка);
		//БИЗТЕХ КОВАЛЬ 12.09.2025 -- 
		
		//БИЗТЕХ КОВАЛЬ 23.10.2025 ++
		//инфообмен Belgee
		Обработки.БТ_ИнфообменHongqi.Создать().ПроверитьИЗаписатьДляВыгрузки(Ссылка);
		//БИЗТЕХ КОВАЛЬ 23.10.2025 --
		
		//БИЗТЕХ КОВАЛЬ 18.10.2025 ++
		//инфообмен JETOUR
		Обработки.БТ_ИнфообменJETOUR.Создать().ПроверитьИЗаписатьДляВыгрузки(Ссылка);
		//БИЗТЕХ КОВАЛЬ 18.10.2025 --

		
	КонецЕсли;	
	//>>БАА
	
КонецПроцедуры // ОбработкаПроведения

//БизТех 14.11.2022г. 
Функция АвтоЕстьНаСкладе(Док, НаДату) 
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	                |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	                |	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	                |	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток
	                |ИЗ
	                |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	                |			&ДатаОстатка,
	                |			Автомобиль = &Авто
	                |				И СкладКомпании.Организация = &Организация) КАК ОстаткиАвтомобилейОстатки
	                |ГДЕ
	                |	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("ДатаОстатка", НаДату);
	Запрос.УстановитьПараметр("Авто", Док.Автомобиль);
	Запрос.УстановитьПараметр("Организация",Док.Организация);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()>0 тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

/// Ульянов
// Ищем исключение из правил
Функция МожноПродать(Ном) Экспорт
	
	Можно=Ложь;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|ЗначенияСвойствОбъектов.Объект,
	|ЗначенияСвойствОбъектов.Свойство,
	|ЗначенияСвойствОбъектов.Значение КАК Ответ
	|ИЗ
	|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|ЗначенияСвойствОбъектов.Объект = &Объект
	|И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект",Ном);		
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12175"));
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Можно=Рез.Ответ;
	КонецЦикла;	
	Возврат Можно;
КонецФункции

Функция ПолучитьБрэнд(Элемент)
	
	Если Элемент.Родитель.Пустая() Тогда
		Возврат Элемент;
	Иначе
		Возврат ПолучитьБрэнд(Элемент.Родитель);
	КонецЕсли;
	
КонецФункции

//misha
Функция ПолучитьНормочас(Модель, ВидРемонта) Экспорт
	//Получим нормочас по Брэнду
	БрэндАвто = ПолучитьБрэнд(Модель);
	Нормочас = Неопределено;
	
	Если БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000031") Тогда 		  	//ВАЗ
		
		Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000024");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000007");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000026");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");                                                     
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000029");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000005");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
			Если Модель.Родитель = Справочники.Модели.НайтиПоКоду("ЦБ00000758") Тогда  
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000016");    //LARGUS
			Иначе
				Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
			КонецЕсли;
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		КонецЕсли;	
		
	ИначеЕсли БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000006") Тогда		  //Ssang Yong
		
		Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000024");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000007");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000026");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
			//Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");                                                     
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000002");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000017");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		КонецЕсли;
		
	ИначеЕсли БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000124") Тогда		  //Chevrolet
		
		Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000024");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000007");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000026");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000018");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000018");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000018");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
			//Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");                                                     
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000018");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000030");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000031");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000018");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		КонецЕсли;
		
	ИначеЕсли БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000332") Тогда		  //ГАЗ	
		
		//Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)	
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000022"); 
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000022");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000022");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000013");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000011");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000023");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000022");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		//	Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000023");
		//ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		//КонецЕсли;	
		
	ИначеЕсли БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000004") Тогда		  //UAZ
		
		Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000024");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000007");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000026");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000014");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000014");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000014");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
			//Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");                                                     
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000014");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000032");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000003");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000014");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000025");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		КонецЕсли;
		
	ИначеЕсли БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000707") Тогда		  //Geely
		
		Если ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") Тогда  			//ПСО по возмещению (крайслер)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") Тогда 	    //ПСО по контрактам (УАЗ)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025") Тогда 	//Ремонт автомобилей для тест-драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000024");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1") Тогда 			//ПСО, работы с парком новых автомобилей
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000007");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда 	//Мойка автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I2") Тогда 			//Мойка автомобиля для тест драйва
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000006");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020") Тогда 	//Комплектация автомобиля П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000108");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009") Тогда 	//Гарантия салона
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") Тогда 	//Восстановление товарных а/м
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000026");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") Тогда 	//Сервисный клиентский заказ для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000112");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 	//Сервисный клиентский заказ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000113");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") Тогда 	//Ремонт автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000033");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") Тогда 	//ПСО для ТТ
			//Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000015");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") Тогда 	//Мойка автомобилей для тест-драйва для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");                                                     
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008") Тогда 	//Гарантия диллера 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда 	//Восстановление товарных а/м для ТТ 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000033");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") Тогда 	//Дополнительное оборудование
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000034");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") Тогда 	//Дополнительное оборудование П
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000105");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G") Тогда  	//Гарантийный заказ
			//Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000003");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") Тогда 	//Гарантия диллера для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000033");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003") Тогда 	//Гарантия сервиса	
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000021");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда 	//Комплектация автомобиля_К 
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000107");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000002") Тогда 	//Комплектация автомобиля
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000106");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") Тогда 	//Кузовной ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") Тогда 	//Мойка автомобилей для ТТ
			Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000027");
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ") Тогда 	//Сервисный клиентский заказ (Министерства Обороны)
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") Тогда 	//Страховой ремонт
		ИначеЕсли ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") Тогда 	//Субподряд	
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Нормочас = Неопределено Тогда
		Нормочас = справочники.Нормочасы.НайтиПоКоду("ЦБ000001"); // Н/ч
	КонецЕсли;
	
	Возврат Нормочас;
	
КонецФункции

//БИЗТЕХ КОВАЛЬ 09.09.2024 ++
//Вывод на печать при перемещении товаров в производство
Функция ПечатьПеремещениеВПроизводство(ОбъектДляПечати,НазваниеПечатнойФормы = "",КоличествоЭкземпляров = 1, НаПринтер = Истина)
	Документ = Неопределено;
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяПринтера","ДиалогВыбораПринтера");
	дкПечать(ОбъектДляПечати, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ, ДопПараметры);
КонецФункции
//БИЗТЕХ КОВАЛЬ 09.09.2024 --

//БИЗТЕХ КОВАЛЬ 29.10.2024 ++
Функция ЗаполнениеПоЗаказуНаАвтомобиль(Основание) 
	//БИЗТЕХ МАМОНОВ 29.07.2025 ++
	//Сопоставление подразделений автосалон - сервис
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.ПодразделенияКомпании) КАК ПодразделениеАвтосалон,
	|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Справочник.ПодразделенияКомпании) КАК ПодразделениеСервис
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""СопоставлениеПодразделенийАвтосалонСервис""");
	МассивПодразделений = Запрос.Выполнить().Выгрузить();
	СтрокаИскомогоПодразделения = МассивПодразделений.Найти(Основание.ПодразделениеКомпании,"ПодразделениеАвтосалон");	
		
	Если ЗначениеЗаполнено(СтрокаИскомогоПодразделения) И ЗначениеЗаполнено(СтрокаИскомогоПодразделения.ПодразделениеСервис) Тогда
		ПодразделениеКомпании = СтрокаИскомогоПодразделения.ПодразделениеСервис;		
	КонецЕсли;
    //БИЗТЕХ МАМОНОВ 29.07.2025 --
	
	
	ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000051");
	Пробег = Пробег + 1;
	Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе;
	Диспетчер = ПараметрыСеанса.Пользователь.Сотрудник;
	ПричинаОбращения = "Установка доп. оборудования";
	Рекомендации = "Доп. Оборудование установлено"; 
	Контрагент = Заказчик;
	Цех = Справочники.Цеха.НайтиПоКоду("ЦБ000008");
	
	НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовыйДоговор.УстановитьНовыйКод();
	НовыйДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
	НовыйДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("643");
	НовыйДоговор.Владелец = Заказчик;
	НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	НовыйДоговор.Организация = Основание.Организация;
	НовыйДоговор.Подразделение = Основание.ПодразделениеКомпании;
	НовыйДоговор.ДляАвтоСервиса = Истина;
	НовыйДоговор.Комментарий = "Заполнен автоматически при создании ЗН на основании " + Основание.ссылка + " (" + ТекущаяДата() + ")";
	//НовыйДоговор.ОбработкаЗаполнения(Неопределено);
	НовыйДоговор.ДатаНачала=ТекущаяДата();
	НовыйДоговор.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000002");   ///УС - Услуги сервиса
	НовыйДоговор.СформироватьНаименование();
	НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
	НовыйДоговор.Записать();
	Сообщить("Создан новый договор контрагента - " + НовыйДоговор.Ссылка); 
	
	ДоговорВзаиморасчетов = НовыйДоговор.ссылка;
	
	Если ЗначениеЗаполнено(Диспетчер) И НЕ ЗначениеЗаполнено(Мастер) Тогда
		Мастер = Диспетчер;	
	КонецЕсли;
	
КонецФункции
//БИЗТЕХ КОВАЛЬ 29.10.2024 --

//БИЗТЕХ КОВАЛЬ 29.01.2025 ++
Функция ПроверитьСкидкиПоТоварам(ДокументЗН)
	
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументЗН.Ссылка);
	Сообщение = "";
	
	Если ДокументЗН.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен И 	//проверка для "выполнен"
		обПраво("ЗапретитьПродажуНижеСебестоимости",Права,,ЭтотОбъект) = Истина И 	// проверять если есть запрет
		(ДокументЗН.ВидРемонта<>Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000010") ИЛИ ДокументЗН.ВидРемонта<>Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000011")) Тогда  //проверять если не гарантийный
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
		               |	СУММА(ТоварыВПроизводствеОстатки.СуммаУпрОстаток) КАК СуммаУпр,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		               |ИЗ
		               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, ЗаказНаряд = &ЗаказНаряд) КАК ТоварыВПроизводствеОстатки
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыВПроизводствеОстатки.Номенклатура,
		               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры";
		Запрос.УстановитьПараметр("ЗаказНаряд",ДокументЗН.Ссылка);
		ДеталиВПроизводстве = Запрос.Выполнить().Выгрузить();
		
		ТаблицаТоваров = ДокументЗН.Товары.Выгрузить();
		Для Каждого СтрокаЗаказНаряда из ТаблицаТоваров Цикл
			СтрокиВПроизводстве=ДеталиВПроизводстве.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаЗаказНаряда.Номенклатура,СтрокаЗаказНаряда.ХарактеристикаНоменклатуры));
			Если СтрокиВПроизводстве.Количество() Тогда 
				СтрокиВПроизводстве = СтрокиВПроизводстве[0]; //т.к. запросом происходит группировка достаточно всегда первой строки
			Иначе
				Продолжить;
			КонецЕсли;
			СуммаСкидок = СтрокаЗаказНаряда.СуммаСкидки + СтрокаЗаказНаряда.СуммаСкидкиСтроки + СтрокаЗаказНаряда.СуммаСкидкиБонусами;
			
			Если СуммаСкидок>СтрокиВПроизводстве.СуммаУпр Тогда
				Сообщение=Сообщение+"["+СокрЛП(СтрокаЗаказНаряда.Номенклатура.Код)+"] Товар """+СокрЛП(СтрокаЗаказНаряда.Номенклатура)+""". Сумма скидок ["+СуммаСкидок+"] больше чем себестоимость ["+СтрокиВПроизводстве.СуммаУпр+"]"+Символы.ПС;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Сообщение = "" Тогда Возврат Ложь;
	Иначе Сообщить(Сообщение); Возврат Истина;
	КонецЕсли;
	
КонецФункции
//БИЗТЕХ КОВАЛЬ 29.01.2025 --

//БИЗТЕХ КОВАЛЬ 08.07.2025 ++
Функция ПолучитьСкладПоПодразделению() Экспорт
	Если ЗначениеЗаполнено(СкладПоПодразделению) Тогда
		Возврат СкладПоПодразделению;
	Иначе
		СкладПоПодразделению = РегистрыСведений.СкладПоУмолчаниюПоПодразделению.ПолучитьСкладПоПодразделению(ПодразделениеКомпании);
		Возврат СкладПоПодразделению;
	КонецЕсли;
КонецФункции
//БИЗТЕХ КОВАЛЬ 08.07.2025 --

//БИЗТЕХ МАМОНОВ 14.07.2025 ++    
//Функция проверки склада в ТЧ товары по подрзаделению документа
Функция ПроверитьСкладПоПодразделению(Отказ) Экспорт
	Для Каждого СтрокаТаблЧасти из Товары Цикл
		Если СтрокаТаблЧасти.СкладКомпании.Подразделение <> ПодразделениеКомпании Тогда
			Сообщить("Недопустимое значение склада! Строка " + СтрокаТаблЧасти.НомерСтроки + " имеет склад с подразделением" + " <" + СтрокаТаблЧасти.СкладКомпании.Подразделение+ ">. Подразделение документа <" + ПодразделениеКомпании + ">");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецФункции
//БИЗТЕХ МАМОНОВ 14.07.2025 --


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

ОбработкаРасчетСкидок=Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидок.ИмяРеквизитаСкладКомпании="Цех";
ОбработкаРасчетСкидокАвторабот=Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСкладКомпании="Цех";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСкидкаНаценка="СкидкаНаценкаРаботы";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаЗначениеСкидкиНаценки="ЗначениеСкидкиНаценкиРабот";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСуммаСкидкиНаценки="СуммаСкидкиНаценкиРабот";
ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти="Работы";
ОбработкаРасчетСкидокАвторабот.СкидкаНаРаботы=Истина;

ФорматПредставленияГодаВыпускаАвтомобиля=орПолучитьФорматПредставленияГодаВыпускаАвтомобиля(Права);

СтруктураОтбораНоменклатуры=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
СтруктураОтбораНоменклатурыНаСкладе=Новый Структура("СкладКомпании,Номенклатура,ХарактеристикаНоменклатуры");

МассивТиповСкладыКомпании=Новый Массив(1); МассивТиповСкладыКомпании[0]=Тип("СправочникСсылка.СкладыКомпании");
ОписаниеТиповСкладыКомпании=Новый ОписаниеТипов(МассивТиповСкладыКомпании);

//++бизтех++
МассивТиповЯчеек=Новый Массив(1); МассивТиповЯчеек[0]=Тип("СправочникСсылка.ЯчейкиХранения");
ОписаниеТиповЯчеек=Новый ОписаниеТипов(МассивТиповЯчеек);
//--бизтех--

МассивТиповНоменклатура=Новый Массив(1); МассивТиповНоменклатура[0]=Тип("СправочникСсылка.Номенклатура");
ОписаниеТиповНоменклатура=Новый ОписаниеТипов(МассивТиповНоменклатура);

МассивТиповХарактеристикиНоменклатуры=Новый Массив(1); МассивТиповХарактеристикиНоменклатуры[0]=Тип("СправочникСсылка.ХарактеристикиНоменклатуры");
ОписаниеТиповХарактеристикиНоменклатуры=Новый ОписаниеТипов(МассивТиповХарактеристикиНоменклатуры);

МассивТиповЧисло=Новый Массив(1); МассивТиповЧисло[0]=Тип("Число");
ОписаниеТиповЧисло=Новый ОписаниеТипов(МассивТиповЧисло);

КэшОстатковНоменклатурыНаСкладе=Новый ТаблицаЗначений;
КэшОстатковНоменклатурыНаСкладе.Колонки.Добавить("СкладКомпании",ОписаниеТиповСкладыКомпании);
КэшОстатковНоменклатурыНаСкладе.Колонки.Добавить("Номенклатура",ОписаниеТиповНоменклатура);
КэшОстатковНоменклатурыНаСкладе.Колонки.Добавить("ХарактеристикаНоменклатуры",ОписаниеТиповХарактеристикиНоменклатуры);
КэшОстатковНоменклатурыНаСкладе.Колонки.Добавить("Остаток",ОписаниеТиповЧисло); 

//++бизтех++
КэшОстатковНоменклатурыНаСкладе.Колонки.Добавить("Ячейка",ОписаниеТиповЯчеек);
//-бизтех--

ТоварыБезНДС = Ложь;
РаботыБезНДС = Ложь;
ЗакрыватьИнтервалыРабот = Ложь;
КэшПакетов = Неопределено;

//<<Павличенко 10.09.2020
АвтоматСоздание = Ложь;
//>>Павличенко 10.09.2020
