&НаКлиенте
Процедура ПолучитьТокен(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ClientSecret",	"");
	СтруктураВозврата.Вставить("access_token",	"");
	СтруктураВозврата.Вставить("refresh_token",	"");
	СтруктураВозврата.Вставить("expires_in",	'00010101');
	
	ПолучитьТокенНаСервере(СтруктураВозврата,ЭтотОбъект.Адрес,ЭтотОбъект.ClientID,ЭтотОбъект.ClientSecret,ЭтотОбъект.refresh_token);
	
	ОповеститьОВыборе(СтруктураВозврата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ClientID") Тогда
		
		//https://id.alfabank.ru/
		url = "https://id.alfabank.ru/oidc/authorize?response_type=code&client_id="+Параметры.ClientID+"&redirect_uri=http://localhost&scope=openid%20signature%20transactions&state="+ строка(Новый УникальныйИдентификатор);		
		
		ЭтотОбъект.Адрес = url;
		ЭтотОбъект.ClientID = Параметры.ClientID;
		ЭтотОбъект.ClientSecret = Параметры.ClientSecret;
		ЭтотОбъект.refresh_token = Параметры.refresh_token;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ClientSecret) Тогда
			обработка = Обработки.AB_ОбменАльфаБанк.Создать();
			ЭтотОбъект.ClientSecret = обработка.ПолучитьСекрет(Параметры.ClientID);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьТокенНаСервере(СтруктураВозврата,URL,ClientID,ClientSecret,refresh_token)
	
	КодАвторизации = СтрНайтиПоРегулярномуВыражению(URL,"[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}");
	КодАвторизации = КодАвторизации.Значение;
	
	Обработка = Обработки.AB_ОбменАльфаБанк.Создать();
	СтрТокен = Обработка.ПолучитьТокен(ClientID,ClientSecret,,КодАвторизации);
	
	СтруктураВозврата.ClientSecret 	= ЭтотОбъект.ClientSecret;
	СтруктураВозврата.access_token 	= СтрТокен.Токен;
	СтруктураВозврата.refresh_token = СтрТокен.ТокенОбновления;
	СтруктураВозврата.expires_in 	= СтрТокен.СрокЖизни;
	
КонецПроцедуры


&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	Адрес = Элемент.Документ.url;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтотОбъект.HTML = ЭтотОбъект.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтраницу(Команда)
	ЭтотОбъект.HTML = ЭтотОбъект.Адрес;
КонецПроцедуры

