&НаКлиенте
Процедура ВРегистр(Команда)
	Форма = ОткрытьФорму("РегистрСведений.DN_АВ_КредитноСтраховыеСделки.ФормаСписка"); 
	
	ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборВладелец.Использование = Истина;
	ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктСверки");
	ОтборВладелец.ПравоеЗначение = Элементы.Список.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеДокументы(Команда)
	Дерево=Обработки.ДеревоДокументов.Создать();
	Дерево.ВыбДокумент=Элементы.Список.ТекущаяСтрока;
	Попытка
		Дерево.ПолучитьДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.ВывестиДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.НастроитьПолеДеревоДокументов();
	Исключение
		Предупреждение("По документу данного вида построение дерева невозможно!",10);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЛистыКредитногоОтдела(Команда)
	Форма = ОткрытьФорму("Документ.РабочийЛистКредитногоОтдела.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура РабочийеЛистыОтделаСтрахования(Команда)
	Форма = ОткрытьФорму("Документ.РабочийЛистОтделаСтрахования.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗаявкуНаОплату(Команда)
	ОткрытьФорму("Обработка.DN_СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО.Форма.Форма");
КонецПроцедуры
