Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения


Функция ЕстьОстатокАвто(Авто)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата1, Автомобиль = &Авто) КАК ОстаткиАвтомобилейОстатки";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	Запрос.УстановитьПараметр("Дата1", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;
	КонецЕсли;
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЭтоВнутр = ТТ_Общий.ВнутрКонтрагент(Контрагент);
		Если ЭтоВнутр Тогда
			Сообщить("Запись прервана! Запрещено вводить статус по внутренним контрагентам холдинга.");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Движения.ТТ_ТекущиеСтатусыАвтомобилей.Записывать = Истина;
	Движения.ТТ_ТекущиеСтатусыАвтомобилей.Очистить();
	
	Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
		
		Если обЗначениеНеЗаполнено(ТекСтрокаАвтомобили.Автомобиль) Тогда
			Отказ=Истина;
			Сообщить("В строке № "+ТекСтрокаАвтомобили.НомерСтроки+" не заполнен Автомобиль.");
			Возврат;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(ТекСтрокаАвтомобили.Статус) Тогда
			Отказ=Истина;
			Сообщить("В строке № "+ТекСтрокаАвтомобили.НомерСтроки+" не заполнен статус.");
			Возврат;
		КонецЕсли;
		
		Движение = Движения.ТТ_ТекущиеСтатусыАвтомобилей.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = ТекСтрокаАвтомобили.Автомобиль;
		Движение.Статус = ТекСтрокаАвтомобили.Статус;
		Движение.Организация = Организация;
		Движение.Себестоимость = ТекСтрокаАвтомобили.Себестоимость;
		
		Отбор = Новый Структура("Автомобиль",ТекСтрокаАвтомобили.Автомобиль);
		РС=РегистрыСведений.ТТ_ТекущиеСтатусыАвтомобилей.ПолучитьПоследнее(Новый Граница(Дата,ВидГраницы.Исключая), Отбор);
		Если РС.Себестоимость>0 И НЕ РС.ПартияЗакрыта Тогда
			Движение.Партия = РС.Партия;
		Иначе
			Движение.Партия = Ссылка;
		КонецЕсли;
		
		Если РС.Себестоимость>0 И НЕ ЕстьОстатокАвто(ТекСтрокаАвтомобили.Автомобиль) И (РС.Статус.ВидСтатуса <> Перечисления.ТТ_ВидыФинСтатусовАвтомобилей.ВЗалоге И НЕ РС.ПартияЗакрыта) Тогда
			Движение.ПартияЗакрыта = ИСТИНА;
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого ТекСтрокаАвтомобили Из Автомобили Цикл
		//НачатьТранзакцию();
		//Ввод заявки на расход	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходДС.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаРасходДС.Автомобили КАК ЗаявкаНаРасходДСАвтомобили
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|		ПО ЗаявкаНаРасходДСАвтомобили.Ссылка = ЗаявкаНаРасходДС.Ссылка
		|ГДЕ
		|	ЗаявкаНаРасходДС.ПометкаУдаления = ЛОЖЬ
		|	И ЗаявкаНаРасходДС.ДокументОснование = &ДокументОснование
		|	И ЗаявкаНаРасходДСАвтомобили.Автомобиль = &Автомобиль";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Автомобиль", ТекСтрокаАвтомобили.Автомобиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() 
			И ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) 
			И ТипЗнч(ЭтотОбъект.ДокументОснование)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
			Если ТТ_Общий.ВнутрКонтрагент(ЭтотОбъект.ДокументОснование.Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			
			//<<Павличенко 01.04.2020
			Если ЭтотОбъект.ДокументОснование.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо тогда
				Продолжить;
			КонецЕсли;
			Если ТекСтрокаАвтомобили.Статус.ВидСтатуса = Перечисления.ТТ_ВидыФинСтатусовАвтомобилей.Транзит тогда
				Продолжить;
			КонецЕсли;
			
			//Если ТекСтрокаАвтомобили.Статус.Родитель = Справочники.ТТ_СтатусАвтомобиля.НайтиПоНаименованию("ТИ и Прочие") тогда
			//	Продолжить;
			//КонецЕсли;
			
			Если ЭтотОбъект.ДокументОснование.ХозОперация = Справочники.ХозОперации.ПоступлениеАвтомобилейКомиссия тогда
				Продолжить;
			КонецЕсли;
			//>>Павличенко 01.04.2020
			//KamikadZe begin add 09.07.2020 21:05:41
			Если ЭтотОбъект.ДокументОснование.СкладКомпании.тт_КатегорияСклада = Справочники.тт_КатегорияСклада.НайтиПоКоду("000000004") Тогда //корпораты не делаем заявку
				Продолжить;
			КонецЕсли;
			//KamikadZe end add
			
			Если ЭтотОбъект.ДокументОснование.Дата < Дата(2020,3,7) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекСтрокаАвтомобили.Статус = Справочники.ТТ_СтатусАвтомобиля.НайтиПоКоду("02") Тогда // В залоге Автоваз с беспроцентным периодом 30дн
				Продолжить;
			КонецЕсли;	
			
			НайдСтрока=ТекСтрокаАвтомобили.Статус.ПериодыСтавки.Найти(0,"Процент");
			Если НайдСтрока<> Неопределено Тогда
				КолДней=НайдСтрока.Конец-НайдСтрока.Начало-3;
				
				Док=Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(Док, ЭтотОбъект.ДокументОснование);
				Док.ОбработкаРеквизита("Организация");
				Док.СтруктурнаяЕдиница=Док.Организация.ОсновнойБанковскийСчет;
				Док.ОбработкаРеквизита("ДоговорВзаиморасчетов");
				Док.СчетКонтрагента=Док.Контрагент.ОсновнойБанковскийСчет;
				Док.Комментарий=ТекСтрокаАвтомобили.Автомобиль.VIN;
				Бренд=ТТ_Общий.ПолучитьБрэнд(ТекСтрокаАвтомобили.Автомобиль.Модель);
				Док.СтатьяДДС=Справочники.СтатьиДДС.НайтиПоНаименованию("Автомобили "+Бренд,,Справочники.СтатьиДДС.НайтиПоКоду("ЦБ0000115")); //Покупка товарных авто
				Если Док.СтатьяДДС.Пустая() тогда
					Док.СтатьяДДС=Справочники.СтатьиДДС.НайтиПоКоду("ЦБ0000129");  //сваливаем в прочие авто
				КонецЕсли;
				Док.СтатусТТ=Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
				Док.ДатаСоздания=ЭтотОбъект.ДокументОснование.Дата;
				Док.ДатаПлатежа=Док.ДатаСоздания+24*3600*КолДней;
				Док.Дата=Док.ДатаПлатежа;
				Док.ДокументОснование=ЭтотОбъект.Ссылка;
				Док.ХозОперация=Справочники.ХозОперации.ЗаявкаНаРасходСРС;
				
				СтрокаПлатежа=Док.Платежи.Добавить();
				СтрокаПлатежа.Описание="Создано автоматически. Проверьте расчетные счета и договор!";
				СтрокаПлатежа.ДатаПлатежа=Док.ДатаПлатежа;
				СтрокаОснования=ЭтотОбъект.ДокументОснование.Автомобили.Найти(ТекСтрокаАвтомобили.Автомобиль,"Автомобиль");
				Если СтрокаОснования=Неопределено Тогда Продолжить; КонецЕсли;
				СтрокаПлатежа.СтавкаНДС=СтрокаОснования.СтавкаНДС;
				СтрокаПлатежа.Сумма=СтрокаОснования.СуммаВсего;
				СтрокаПлатежа.СуммаНДС=СтрокаОснования.СуммаНДС;
				
				СтрокаАвто=Док.Автомобили.Добавить();
				СтрокаАвто.Автомобиль=ТекСтрокаАвтомобили.Автомобиль;
				СтрокаАвто.СуммаОплаты=СтрокаПлатежа.Сумма;
				
				 
				Док.УстановитьНовыйНомер();
				Док.Записать();
				Сообщить("Автоматически создана "+Док);

				
				//Попытка
				//---Бренд---
				Бренд=ТТ_Общий.ПолучитьБрэнд(ТекСтрокаАвтомобили.Автомобиль.Модель);
				
				РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
				РС.Объект=Док.Ссылка;
				РС.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ЦФОБренд");
				
				Значение=Справочники.ЗначенияСвойств.НайтиПоНаименованию(Бренд,,,РС.Свойство);
				
				Если НЕ Значение.Пустая() Тогда
					РС.Значение=Значение;
				Иначе
					РС.Значение=Справочники.ЗначенияСвойств.НайтиПоНаименованию("Общие затраты",,,РС.Свойство);
				КонецЕсли;
				
				РС.Записать();
				//Исключение
				//	Сообщить("Не удалось создать заявку на расход ДС по причине: "+ОписаниеОшибки());					
				//КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		//ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.ТТ_ТекущиеСтатусыАвтомобилей.Записывать = Истина;
	Движения.ТТ_ТекущиеСтатусыАвтомобилей.Очистить();
	
КонецПроцедуры

Функция ВернутьТекСтатус(Авто) Экспорт
	Отбор=Новый Структура("Автомобиль", Авто);
	РС=РегистрыСведений.ТТ_ТекущиеСтатусыАвтомобилей.ПолучитьПоследнее(Новый Граница(Дата,ВидГраницы.Исключая), Отбор);
	Возврат РС.Статус;
	
КонецФункции

Функция ВернутьСС(Авто) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОстаткиАвтомобилейОстатки.СуммаОстаток) КАК СуммаОстаток,
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
	
	Возврат 0;
			
КонецФункции

Функция ВернутьССизПоследнего(Авто) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Себестоимость
	|ИЗ
	|	РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(
	|			&Дата1,
	|			Автомобиль = &Авто
	|				И Регистратор <> &ТекДокумент) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	Запрос.УстановитьПараметр("Дата1", Дата);
	Запрос.УстановитьПараметр("ТекДокумент", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Себестоимость;
	КонецЦикла;
	
	Возврат 0;
			
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
		Для Каждого Стр из ДанныеЗаполнения.Автомобили Цикл
			НовСтр=Автомобили.Добавить();
			НовСтр.Автомобиль = Стр.Автомобиль;
			НовСтр.Поставщик = ДанныеЗаполнения.Контрагент;
			НовСтр.СтарыйСтатус = ВернутьТекСтатус(Стр.Автомобиль);
			НовСтр.Себестоимость = Стр.СуммаВсего;
		КонецЦикла;
		
		Организация=ДанныеЗаполнения.Организация;
		ПодразделениеКомпании=ДанныеЗаполнения.ПодразделениеКомпании;		
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		ЭтотОбъект.Контрагент = ДанныеЗаполнения.Контрагент;
		Дата = ДанныеЗаполнения.Дата+60;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеАвтомобилей") Тогда
		Для Каждого Стр из ДанныеЗаполнения.Автомобили Цикл
			НовСтр=Автомобили.Добавить();
			НовСтр.Автомобиль=Стр.Автомобиль;
			НовСтр.СтарыйСтатус = ВернутьТекСтатус(Стр.Автомобиль);
			НовСтр.Себестоимость = Стр.СуммаВсего;
		КонецЦикла;
		Организация=ДанныеЗаполнения.Организация;
		ПодразделениеКомпании=ДанныеЗаполнения.ПодразделениеКомпании;		
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		Дата = ДанныеЗаполнения.Дата+60;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Выписка") Тогда
		Контрагент=ДанныеЗаполнения.Контрагент;
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		Организация=ДанныеЗаполнения.Организация;
		ПодразделениеКомпании=ДанныеЗаполнения.ПодразделениеКомпании;	
		Дата = ДанныеЗаполнения.Дата+60;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
		Контрагент=ДанныеЗаполнения.Контрагент;
		ДокументОснование=ДанныеЗаполнения.Ссылка;
		Организация=ДанныеЗаполнения.Организация;
		ПодразделениеКомпании=ДанныеЗаполнения.ПодразделениеКомпании;		
		
		Для Каждого Стр из ДанныеЗаполнения.Автомобили Цикл
			НовСтр=Автомобили.Добавить();
			НовСтр.Автомобиль=Стр.Автомобиль;
			НовСтр.СтарыйСтатус = ВернутьТекСтатус(Стр.Автомобиль);
			НовСтр.Себестоимость = Стр.СуммаОплаты;
		КонецЦикла;
		
		Дата = ДанныеЗаполнения.ДатаПлатежа+60;
		
	КонецЕсли;
	
	
	Автор=ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
		
	Если НЕ ОбменДанными.Загрузка И ЭтоНовый() И ЗначениеЗаполнено(ДокументОснование) Тогда		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеСтатусаВыкупаАвтомобилей.Ссылка
		|ИЗ
		|	Документ.ИзменениеСтатусаВыкупаАвтомобилей КАК ИзменениеСтатусаВыкупаАвтомобилей
		|ГДЕ
		|	ИзменениеСтатусаВыкупаАвтомобилей.ДокументОснование = &ДокументОснование
		|	И ИзменениеСтатусаВыкупаАвтомобилей.ПометкаУдаления = ЛОЖЬ
		|	И ИзменениеСтатусаВыкупаАвтомобилей.Проведен";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);			
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Сообщить("Запись прервана! Уже существует изменение статуса по данному основанию.");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ХозОперация=Справочники.ХозОперации.ИзменениеСтатусаАвтомобиля;
	
	Если обЗначениеНеЗаполнено(Автор) Тогда
		Автор=ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	
	Для каждого Стр из Автомобили Цикл
		
		Если Стр.Статус.ВидСтатуса <> Перечисления.ТТ_ВидыФинСтатусовАвтомобилей.Выкупленные Тогда
			Продолжить;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Период, ) КАК ОстаткиАвтомобилейОстатки
		|ГДЕ
		|	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
		|	И ОстаткиАвтомобилейОстатки.Автомобиль = &Автомобиль";
		
		Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		Запрос.УстановитьПараметр("Период", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();	
		
		Если РезультатЗапроса.Пустой() Тогда
			
			Запрос1 = Новый Запрос;
			Запрос1.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ОстаткиАвтомобилейОбороты.Автомобиль,
			|	ОстаткиАвтомобилейОбороты.ПериодСекунда КАК Период,
			|	ОстаткиАвтомобилейОбороты.Регистратор
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(, , Авто, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ОстаткиАвтомобилейОбороты.Автомобиль,
			|	ОстаткиАвтомобилейОбороты.ПериодСекунда,
			|	ОстаткиАвтомобилейОбороты.Регистратор
			|
			|ИМЕЮЩИЕ
			|	СУММА(ОстаткиАвтомобилейОбороты.КоличествоРасход) - СУММА(ОстаткиАвтомобилейОбороты.КоличествоПриход) > 0
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
			
			Запрос1.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
			
			Выборка = Запрос1.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Дата=НачалоДня(Дата);	
			Иначе
				//Сообщить("Вводится статус ""Выкуплен"" по отсутствующему автомобилю!");		
				//Отказ=Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = Новый Структура();
	КонецЕсли;
	
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()




////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

