////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;                                    // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;                       // Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаРасчетСкидок Экспорт;                    // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
// свойства и методы для расчета скидок документа.
Перем ОбработкаРасчетСкидокАвторабот Экспорт;           // Переменная для хранения ссылки на обработку "Расчет скидок". Данная обработка содержит необходимые
// свойства и методы для расчета скидок документа.
Перем ОбработкаЗначенияСвойствОбъектов Экспорт;         // Переменная для хранения значения свойств основания/объекта копирования
Перем ФорматПредставленияГодаВыпускаАвтомобиля Экспорт; //Переменная с форматом отображения года выпуска автомобиля
Перем ТекущаяВалютаДокумента Экспорт;                   // Текущая валюта документа
Перем ТекущийКурсДокумента Экспорт;                     // Текущий курс валюты документа
Перем ИмяРеквизитаКода Экспорт;                         // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

Процедура СоздатьЧекиКоррекции(Основание, НачальноеЗаполнение = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Если НачальноеЗаполнение Тогда
			СоздатьЧекСторно(Неопределено);
			СоздатьЧекКоррекции(Неопределено);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДокументСоздан = Ложь;
	Если ЗначениеЗаполнено(Основание.ДатаФР) Тогда
		ДокументСоздан = СоздатьЧекСторно(Основание);
		НеприменениеККТ = Ложь;
	Иначе
		НеприменениеККТ = Истина;
		ДокументСоздан = Истина;
	КонецЕсли;
	
	Если ДокументСоздан Тогда
		СоздатьЧекКоррекции(Основание);
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьЧекСторно(Основание)
	
	ЧекСторно = Документы.ЧекКоррекции.СоздатьДокумент();
	ЧекСторно.Заполнить(Новый Структура("ДокументОснование, ЭтоСторно", Основание, Истина));
	ЕстьОшибкиСоздания = Ложь;
	//УправлениеДиалогомСервер.ПроверитьВозможностьОткрытияФормыОбъекта(ЭтотОбъект, ЕстьОшибкиСоздания);
	Если ЕстьОшибкиСоздания Тогда
		ЧекСторно = Документы.ЧекКоррекции.СоздатьДокумент();
		Возврат Ложь;
	КонецЕсли;
	Документы.ЧекКоррекции.ПроизвестиРаспределениеСуммыОплаты(ЧекСторно.СуммаДокумента, ЧекСторно.Товары);
	ЧекСторно.УстановитьНовыйНомер();
	Возврат Истина;
	
КонецФункции

Функция СоздатьЧекКоррекции(Основание)
	
	ЧекКоррекции = Документы.ЧекКоррекции.СоздатьДокумент();
	ЧекКоррекции.Заполнить(Новый Структура("ДокументОснование, ЭтоСторно", Основание, Ложь));
	ЕстьОшибкиСоздания = Ложь;
	Если ЕстьОшибкиСоздания Тогда
		ЧекКоррекции = Документы.ЧекКоррекции.СоздатьДокумент();
		ЧекКоррекции.Заполнить(Неопределено);
		Возврат Ложь;
	КонецЕсли;
	ЧекКоррекции.УстановитьНовыйНомер();
	Возврат Истина;
	
КонецФункции

Процедура ОткрытьФормуПомощника(Документ) Экспорт
	ФормаОбработки = ЭтотОбъект.ПолучитьФорму("Форма");
	ФормаОбработки.ВходящийДокумент = Документ;
	ФормаОбработки.Открыть();
КонецПроцедуры

Права = Неопределено;
#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли

ОбработкаРасчетСкидок=Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидок.ИмяРеквизитаСкладКомпании="Цех";
ОбработкаРасчетСкидокАвторабот=Обработки.РасчетСкидок.Создать();
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСкладКомпании="Цех";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСкидкаНаценка="СкидкаНаценкаРаботы";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаЗначениеСкидкиНаценки="ЗначениеСкидкиНаценкиРабот";
ОбработкаРасчетСкидокАвторабот.ИмяРеквизитаСуммаСкидкиНаценки="СуммаСкидкиНаценкиРабот";
ОбработкаРасчетСкидокАвторабот.ИмяТабличнойЧасти="Работы";
ОбработкаРасчетСкидокАвторабот.СкидкаНаРаботы=Истина;
