#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру несвязанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем Подразделение;                                   // хранит текущее подразделение
Перем ТипЦенПоУмолчанию;                               // хранит тип цен по умолчанию
Перем ВыводитьОтборПодразделение;                      // флаг вывода отбора по подразделению
Перем ВыводитьОтборКонтрагента;                        // флаг вывода отбора по контрагенту
Перем ВыводитьОтборТипаЦен;                            // флаг вывода отбора по типу цен

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// проверяет настройки отчета на корректность заполнения, возвращает "истина", если корректно, "ложь" - если нет
//
// без параметров
// 
Функция КорректностьЗаполнения() Экспорт
	
	Если обЗначениеНеЗаполнено(ВалютаОтчета) Тогда
		Предупреждение("Не указана валюта!", 10);
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина;
	
КонецФункции // КорректностьЗаполнения()

// устанавливает основные параметры
//
// без параметров
// 
Процедура УстановитьОсновныеПараметры()
	
	//Заполним параметры
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКонца, Новый Структура("Валюта", ВалютаОтчета));
	ПостроительОтчета.Параметры.Вставить("КурсВалютыОтчета", КурсВалюты.Курс/?(КурсВалюты.Кратность=0,1,КурсВалюты.Кратность));
	
КонецПроцедуры // УстановитьОсновныеПараметры()

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	ТипЦенПоУмолчанию = обПраво("ОсновнойТипЦенЗакупки", глПрава);
	ПостроительОтчета.Параметры.Вставить("ПодразделениеКомпании", Подразделение);
	ПостроительОтчета.Параметры.Вставить("ТипЦенПоУмолчанию", ТипЦенПоУмолчанию);
	
	ВалютаОтчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента – передает ссылку на табличный документ 
//						или поле табличного документа
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("ИмяКолонки");
	ТаблицаКолонок.Колонки.Добавить("Значение");
	ТаблицаКолонок.Колонки.Добавить("ПозицияСтроки");
	ТаблицаКолонок.Колонки.Добавить("ПозицияКолонки");
	
	Для Каждого ТекКолонка Из ИзмеренияКолонки Цикл
		Если НЕ ТекКолонка.Использование Тогда Продолжить; КонецЕсли;
		ТекКолонка.ТипИзмерения="Элементы";
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.ИмяКолонки = СтрЗаменить(ТекКолонка.ПутьКДанным,".","");
		НоваяСтрока.ПозицияСтроки = ТаблицаКолонок.Индекс(НоваяСтрока);
	КонецЦикла;
	
	ВременТекстЗапроса = ТекстЗапроса;
	ТекстЗапроса = ПолучитьТекстЗапроса();
	
	УстановитьОсновныеПараметры();	
	ПостроительОтчета.Параметры.Вставить("спВыбКонтрагент", спВыбКонтрагент);
	ПостроительОтчета.Параметры.Вставить("спВыбКонтрагентКоличество", спВыбКонтрагент.Количество());
	Попытка
		Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат);
		Если НЕ Результат.Области.Найти("ШапкаСтрок")=Неопределено Тогда
			//Если ТаблицаКолонок.Количество()>1 Тогда
			// Удалим последнюю колонку ее не надо объединять (всегда уникальная).
			ТаблицаКолонок.Удалить(ТаблицаКолонок.Количество()-1);
			
			ТекущаяПозицияКолонки=Результат.Области.ШапкаСтрок.Право+1;
			ПоследняяПозицияКолонок = Результат.ШиринаТаблицы;
			ТекущаяПозицияСтроки = Результат.Области.ШапкаСтрок.Верх;
			Шаг = Показатели.НайтиСтроки(Новый Структура("Использование",Истина)).Количество();
			Расшифровка = Результат.Область(ТекущаяПозицияСтроки, ТекущаяПозицияКолонки, ТекущаяПозицияСтроки, ТекущаяПозицияКолонки).Расшифровка;
			Если НЕ Расшифровка=Неопределено Тогда
				Для Каждого ТекСтрока Из ТаблицаКолонок Цикл
					ТекЗначение = Расшифровка[ТекСтрока.ИмяКолонки];
					ТекСтрока.Значение = ТекЗначение;
					ТекСтрока.ПозицияКолонки = ТекущаяПозицияКолонки;
					ТекСтрока.ПозицияСтроки = ТекСтрока.ПозицияСтроки+ТекущаяПозицияСтроки;
					Если ТекЗначение=Справочники.Контрагенты.ПустаяСсылка() Тогда
						Результат.Область(ТекСтрока.ПозицияСтроки, ТекущаяПозицияКолонки, ТекСтрока.ПозицияСтроки, ТекущаяПозицияКолонки).Текст="Собственные цены";
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ТекущаяПозицияКолонки=ТекущаяПозицияКолонки+Шаг;
			Структура = Новый Структура;
			Пока ТекущаяПозицияКолонки < ПоследняяПозицияКолонок Цикл
				Расшифровка = Результат.Область(ТекущаяПозицияСтроки, ТекущаяПозицияКолонки, ТекущаяПозицияСтроки, ТекущаяПозицияКолонки).Расшифровка;
				Если Расшифровка=Неопределено Тогда Прервать; КонецЕсли;
				Для Каждого ТекСтрока Из ТаблицаКолонок Цикл
					ТекЗначение = Расшифровка[ТекСтрока.ИмяКолонки];
					Если ТекЗначение=ТекСтрока.Значение Тогда Продолжить; КонецЕсли;
					Для НачПозиция=ТаблицаКолонок.Индекс(ТекСтрока) По ТаблицаКолонок.Количество()-1 Цикл
						ГраничнаяСтрока = ТаблицаКолонок[НачПозиция];
						Результат.Область(ГраничнаяСтрока.ПозицияСтроки, ГраничнаяСтрока.ПозицияКолонки, ГраничнаяСтрока.ПозицияСтроки, ТекущаяПозицияКолонки-1).Объединить();
						ТекЗначение=Расшифровка[ГраничнаяСтрока.ИмяКолонки];
						Если ТекЗначение=Справочники.Контрагенты.ПустаяСсылка() Тогда
							Результат.Область(ГраничнаяСтрока.ПозицияСтроки, ТекущаяПозицияКолонки, ГраничнаяСтрока.ПозицияСтроки, ТекущаяПозицияКолонки).Текст="Собственные цены";
						КонецЕсли;
						ГраничнаяСтрока.Значение=ТекЗначение;
						ГраничнаяСтрока.ПозицияКолонки = ТекущаяПозицияКолонки;
					КонецЦикла;
					Прервать;
				КонецЦикла;
				ТекущаяПозицияКолонки=ТекущаяПозицияКолонки+Шаг;
			КонецЦикла;
			Для Каждого ТекСтрока Из ТаблицаКолонок Цикл
				Если ТекущаяПозицияКолонки-1=ТекСтрока.ПозицияКолонки Тогда Продолжить; КонецЕсли;
				Результат.Область(ТекСтрока.ПозицияСтроки, ТекСтрока.ПозицияКолонки, ТекСтрока.ПозицияСтроки, ТекущаяПозицияКолонки-1).Объединить();
			КонецЦикла;
			// для непонятного случая, когда появляется из-за отбора пустой кусок отчета
			Если ТекущаяПозицияКолонки<=Результат.ШиринаТаблицы Тогда
				ЗначениеГраницыОтчета = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
				Для Каждого ТекСтрока Из ТаблицаКолонок Цикл
					Результат.Область(ТекСтрока.ПозицияСтроки, ТекСтрока.ПозицияКолонки, ТекСтрока.ПозицияСтроки, ТекущаяПозицияКолонки-1).ГраницаСправа=ЗначениеГраницыОтчета;
				КонецЦикла;
				Результат.УдалитьОбласть(Результат.Область(, ТекущаяПозицияКолонки,, Результат.ШиринаТаблицы), ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ТекстЗапроса = ВременТекстЗапроса;
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьНачальныеНастройки()

// формирует текст запроса по подразделениям
Функция ПолучитьТекстЗапросаПодразделений(ТекЗапрос, ОтборПоПодразделению)
	
	ТекЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	// получим максимальный уровень подразделений по заданным отборам
	СоответствиеПодразделений = Новый Соответствие;
	
	ТекЗапрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаИзмерения.Ссылка КАК Подразделение
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ТаблицаИзмерения
	|ГДЕ
	|	(НЕ ТаблицаИзмерения.ПометкаУдаления)
	|	"+ОтборПоПодразделению;
	
	ТекЗапрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);
	ТекстОбъединенияУровней = "";
	Выборка  = ТекЗапрос.Выполнить().Выбрать();
	Если Выборка.Количество()=0 Тогда
		ТекстОбъединенияУровней = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка) КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка) КАК Родитель,
		|	0 КАК Уровень
		|ПОМЕСТИТЬ ТаблицаПодразделений
		|ИНДЕКСИРОВАТЬ ПО Родитель
		|;";
	Иначе
		
		СчетчикПодразделений=0;
		Пока Выборка.Следующий() Цикл
			ТекПодразделение=Выборка.Подразделение;
			УровеньПодразделения=Формат(СчетчикПодразделений,"ЧН=0; ЧГ=");
			ИмяПараметра="Подразделение"+УровеньПодразделения+"0";
			ПостроительОтчета.Параметры.Вставить(ИмяПараметра, Выборка.Подразделение);
			СоответствиеПодразделений.Вставить(Выборка.Подразделение, ИмяПараметра);
			Уровень = 0;
			Пока ЗначениеЗаполнено(ТекПодразделение) Цикл
				
				ИмяПараметраРодителя = СоответствиеПодразделений[ТекПодразделение];
				Если ИмяПараметраРодителя=Неопределено Тогда
					ИмяПараметраРодителя="Подразделение"+УровеньПодразделения+Строка(Уровень);
					ПостроительОтчета.Параметры.Вставить(ИмяПараметраРодителя, ТекПодразделение);
					СоответствиеПодразделений.Вставить(ТекПодразделение, ИмяПараметраРодителя);
				КонецЕсли;
				
				ТекстОбъединенияУровней = ТекстОбъединенияУровней+"
				|"+?(ТекстОбъединенияУровней="","","ОБЪЕДИНИТЬ ВСЕ")+"
				|ВЫБРАТЬ 
				|	&"+ИмяПараметра+" КАК Подразделение,
				|	&"+ИмяПараметраРодителя+" КАК Родитель,
				|	"+Формат(Уровень,"ЧН=0; ЧГ=")+" КАК Уровень";
				
				// Получаем родителя подразделения
				Уровень = Уровень + 1;
				
				ТекПодразделение=ТекПодразделение.Родитель;
			КонецЦикла;
			
			ТекстОбъединенияУровней = ТекстОбъединенияУровней+"
			|ОБЪЕДИНИТЬ ВСЕ
			|ВЫБРАТЬ
			|	&"+ИмяПараметра+" КАК Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка) КАК Родитель,
			|	"+Формат(Уровень,"ЧН=0; ЧГ=")+" КАК Уровень";
			СчетчикПодразделений=СчетчикПодразделений+1;
		КонецЦикла;
		ТекстОбъединенияУровней = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаПодразделений.Подразделение КАК Справочник.ПодразделенияКомпании) КАК Подразделение,
		|	ВЫРАЗИТЬ(ТаблицаПодразделений.Родитель КАК Справочник.ПодразделенияКомпании) КАК Родитель,
		|	ТаблицаПодразделений.Уровень КАК Уровень
		|ПОМЕСТИТЬ ТаблицаПодразделений
		| ИЗ ("+ТекстОбъединенияУровней+"
		|) КАК ТаблицаПодразделений
		|ИНДЕКСИРОВАТЬ ПО 
		|	Родитель,
		|	Подразделение
		|;";
	КонецЕсли;
		
	Возврат ТекстОбъединенияУровней;
	
КонецФункции

// формирует текст запроса отчета
Функция ПолучитьТекстЗапроса()
	
	ЕстьОбъектСравнения = Ложь;
	ЕстьКонтрагент		= Ложь;
	ЕстьПодразделение	= Ложь;
	ЕстьЕдиница			= Ложь;
	ЕстьХарактеристика	= Ложь;
	ТипЦенВСтроке		= Ложь;
	ЕстьТипЦен			= Ложь;
	ИндексХарактеристик = 0;
	ИндексЕдиниц		= 0;
	
	ПостроительОтчета.ВыводитьОбщиеИтоги = Ложь;
	ПостроительОтчета.ВыводитьПодвалОтчета = Ложь;
	ПостроительОтчета.ВыводитьПодвалТаблицы = Ложь;
	
	Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
		Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
		Если Найти(ТекСтрока.ПутьКДанным, "ХарактеристикаНоменклатуры")=1 Тогда
			ЕстьХарактеристика	= Истина;
			ИндексХарактеристик = ИзмеренияСтроки.Индекс(ТекСтрока);
		КонецЕсли;
		Если Найти(ТекСтрока.ПутьКДанным, "ЕдиницаИзмерения")=1 Тогда
			ЕстьЕдиница			= Истина;
			ИндексЕдиниц		= ИзмеренияСтроки.Индекс(ТекСтрока);
		КонецЕсли;
		Если Найти(ТекСтрока.ПутьКДанным, "ТипЦен")=1 Тогда
			ТипЦенВСтроке		= Истина;
			ЕстьТипЦен			= Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекКолонка Из ИзмеренияКолонки Цикл
		Если НЕ ТекКолонка.Использование Тогда Продолжить; КонецЕсли;
		Если Найти(ТекКолонка.ПутьКДанным, "Контрагент")=1 Тогда
			ЕстьКонтрагент		= Истина;
		КонецЕсли;
		Если Найти(ТекКолонка.ПутьКДанным, "Подразделение")=1 Тогда
			ЕстьПодразделение	= Истина;
		КонецЕсли;
		Если Найти(ТекКолонка.ПутьКДанным, "ТипЦен")=1 Тогда
			ЕстьТипЦен			= Истина;
		КонецЕсли;
	КонецЦикла;
	ЕстьОбъектСравнения = ЕстьКонтрагент ИЛИ ЕстьПодразделение;
		
	// Получим текст отборов
	ТекстОтбора = "
	|ГДЕ 
	|	ТаблицаЦен.Период<=&ДатаКон";
	ТекстПоКонтрагенту = "";
	ОтборПоПодразделению = "";
	
	Запрос = Новый Запрос;
	ОдиночныйОтборКонтрагента	= Ложь;
	ОдиночныйОтборПодразделения	= Ложь;
	ОдиночныйОтборПоТипуЦен		= Ложь;
	Для Каждого ТекОтбор ИЗ ПостроительОтчета.Отбор Цикл
		Если НЕ ТекОтбор.Использование Тогда Продолжить; КонецЕсли;
		Если Найти(ТекОтбор.ПутьКДанным, "Подразделение")=1 Тогда
			ТекПуть = "ТаблицаИзмерения."+СтрЗаменить(ТекОтбор.ПутьКДанным,"Подразделение","Ссылка");
			ОтборПоПодразделению=ОтборПоПодразделению+?(ОтборПоПодразделению="",""," И ")+"
			|	"+СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ТекОтбор.ВидСравнения),"#",ТекПуть),"&","&Выб"+ТекОтбор.Имя);
			ОдиночныйОтборПодразделения = (ТекОтбор.ПутьКДанным = "Подразделение" И ТекОтбор.ВидСравнения=ВидСравнения.Равно);
			Запрос.УстановитьПараметр("Выб"+ТекОтбор.Имя, ТекОтбор.Значение);
		ИначеЕсли Найти(ТекОтбор.ПутьКДанным, "Контрагент")=1 Тогда
			ТекстПоКонтрагенту=ТекстПоКонтрагенту+?(ТекстПоКонтрагенту="",""," И ")+"
			|	"+СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ТекОтбор.ВидСравнения),"#","ТаблицаЦен."+ТекОтбор.ПутьКДанным),"&","&Выб"+ТекОтбор.Имя);
			ОдиночныйОтборКонтрагента = (ТекОтбор.ПутьКДанным = "Контрагент" И ТекОтбор.ВидСравнения=ВидСравнения.Равно);
			ПостроительОтчета.Параметры.Вставить("Выб"+ТекОтбор.Имя, ТекОтбор.Значение);
		Иначе
			Если ТекОтбор.ПутьКДанным = "ТипЦен" Тогда
				Если ТекОтбор.ВидСравнения = ВидСравнения.Равно Тогда
					ОдиночныйОтборПоТипуЦен = Истина;
				КонецЕсли;
			КонецЕсли;
			ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
			|	"+СтрЗаменить(СтрЗаменить(отСформироватьСтрокуВидаСравнения(ТекОтбор.ВидСравнения),"#","ТаблицаЦен."+ТекОтбор.ПутьКДанным),"&","&Выб"+ТекОтбор.Имя);
			ПостроительОтчета.Параметры.Вставить("Выб"+ТекОтбор.Имя, ТекОтбор.Значение);
		КонецЕсли;
	КонецЦикла;
	ВыводитьОтборКонтрагента = Ложь;
	Если ОдиночныйОтборКонтрагента Тогда
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	(ТаблицаЦен.Контрагент=ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ 
		|("+ТекстПоКонтрагенту+"))";
	ИначеЕсли Не ЕстьКонтрагент Тогда
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	ТаблицаЦен.Контрагент=ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
		Сообщить("Невозможно определить, цены какого контрагента выводить! Будут выбраны только собственные цены");
		ВыводитьОтборКонтрагента = Истина;
	ИначеЕсли Не ПустаяСтрока(ТекстПоКонтрагенту) Тогда
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	(ТаблицаЦен.Контрагент=ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ 
		|("+ТекстПоКонтрагенту+"))";
	КонецЕсли;
	ВыводитьОтборПодразделение = Ложь;
	Если ОдиночныйОтборПодразделения Тогда
		ОтборПоПодразделению = " И "+ОтборПоПодразделению;
	ИначеЕсли Не ЕстьПодразделение Тогда
		ВыводитьОтборПодразделение = Истина;
		Сообщить("Невозможно определить, цены какого подразделения выводить! Будут выбраны только цены подразделения """+СокрЛП(Подразделение)+"""");
		ОтборПоПодразделению = " И ТаблицаИзмерения.Ссылка = &ПодразделениеКомпании";
	ИначеЕсли Не ПустаяСтрока(ОтборПоПодразделению) Тогда 
		ОтборПоПодразделению = " И (ТаблицаИзмерения.Ссылка = &ПодразделениеКомпании ИЛИ 
		|	("+ОтборПоПодразделению+"))";
	КонецЕсли;
	ВыводитьОтборТипаЦен=Ложь;
	Если ОдиночныйОтборПоТипуЦен Тогда
	ИначеЕсли Не ЕстьТипЦен Тогда
		ВыводитьОтборТипаЦен=Истина;
		Сообщить("Невозможно определить тип цен! Будет выбран тип цен """+СокрЛП(ТипЦенПоУмолчанию)+"""");
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	ТаблицаЦен.ТипЦен = &ТипЦенПоУмолчанию";
	КонецЕсли;
	
	Если Не ЕстьХарактеристика Тогда
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	КонецЕсли;
	
	Если Не ЕстьЕдиница Тогда
		ТекстОтбора=ТекстОтбора+?(ТекстОтбора=""," ГДЕ ", " И ")+"
		|	ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
	КонецЕсли;
	
	//ФОРМИРОВАНИЕ ЗАПРОСА ДЛЯ ПОЛУЧЕНИЯ ЦЕН ОБЪЕКТА СРАВНЕНИЯ
	// Для Выбранного подразделения получим всех родителей
	ТекстЗапросаРезультат = ПолучитьТекстЗапросаПодразделений(Запрос, ОтборПоПодразделению);
	ТекстЗапросаРезультат = "
	|	"+ТекстЗапросаРезультат+"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаПодразделений.Подразделение КАК Подразделение,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаПодразделений.Уровень КАК Уровень,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ ТаблицаЦен
	|ИЗ
	|	РегистрСведений.Цены КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПодразделений КАК ТаблицаПодразделений
	|ПО 
	|	ТаблицаЦен.ПодразделениеКомпании = ТаблицаПодразделений.Родитель
	|"+ТекстОтбора+"
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	Контрагент,
	|	Подразделение,
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПодразделений
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.Подразделение,
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	Контрагент,
	|	Подразделение,
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень КАК Уровень,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенПодразделений
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
	|ПО 
	|	СрезПоследних.Контрагент = ТаблицаЦен.Контрагент И 
	|	СрезПоследних.Подразделение = ТаблицаЦен.Подразделение И 
	|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	СрезПоследних.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры И 
	|	СрезПоследних.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения И 
	|	СрезПоследних.ТипЦен = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Период = ТаблицаЦен.Период
	|ГДЕ
	|	(НЕ ТаблицаЦен.Цена = 0)
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.Подразделение,
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень,
	|	ТаблицаЦен.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	Контрагент,
	|	Подразделение,
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	МИНИМУМ(ТаблицаЦен.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.Подразделение,
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.ТипЦен
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипЦен,
	|	Контрагент,
	|	Подразделение,
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.Подразделение КАК Подразделение,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Цена*(КурсыВалютСрезПоследних.Курс/ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)/&КурсВалютыОтчета) КАК Цена
	|"+?(ЕстьОбъектСравнения ИЛИ ЕстьЕдиница ИЛИ ЕстьХарактеристика, "ПОМЕСТИТЬ ЦеныСрезПоследних",",
	|	ТаблицаЦен.Номенклатура.ЭтоГруппа КАК НоменклатураЭтоГруппа,
	|	0 КАК ОтклонениеЦены
	|{ВЫБРАТЬ
	|	Контрагент.* КАК Контрагент,
	|	Подразделение.* КАК Подразделение,
	|	Номенклатура.* КАК Номенклатура,
	|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ТипЦен.* КАК ТипЦен}")+"
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Контрагент = ТаблицаЦен.Контрагент И 
	|	СрезПоследних.Подразделение = ТаблицаЦен.Подразделение И 
	|	СрезПоследних.Номенклатура = ТаблицаЦен.Номенклатура И 
	|	СрезПоследних.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры И 
	|	СрезПоследних.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения И 
	|	СрезПоследних.ТипЦен = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Уровень = ТаблицаЦен.Уровень
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
	|	ПО ТаблицаЦен.ТипЦен.ВВалютеУчета И ТаблицаЦен.Номенклатура.ВалютаУчета = КурсыВалютСрезПоследних.Валюта ИЛИ
	|	(НЕ ТаблицаЦен.ТипЦен.ВВалютеУчета) И ТаблицаЦен.ТипЦен.ВалютаЦены = КурсыВалютСрезПоследних.Валюта";
	
	ЕстьОтдельныеЦены = (ЕстьХарактеристика ИЛИ ЕстьЕдиница);
	Если ЕстьОтдельныеЦены Тогда
		ТекстЗапросаРезультат = ТекстЗапросаРезультат+"
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦен,
		|	Контрагент,
		|	Подразделение,
		|	Номенклатура
		|;
		|
		|УНИЧТОЖИТЬ ТаблицаЦенПодразделений
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатуры.ТипЦен КАК ТипЦен,
		|	ТаблицаНоменклатуры.Контрагент КАК Контрагент,
		|	ТаблицаНоменклатуры.Подразделение КАК Подразделение,
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	"+?(ЕстьХарактеристика,"ЕСТЬNULL(ТаблицаХарактеристик.ХарактеристикаНоменклатуры, ","(")+"ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
		|	"+?(ЕстьЕдиница,"ЕСТЬNULL(ТаблицаЕдиниц.ЕдиницаИзмерения, ТаблицаНоменклатуры.Номенклатура.БазоваяЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	ВЫБОР КОГДА ТаблицаЕдиниц.ЕдиницаИзмерения ЕСТЬ NULL ТОГДА 1 ИНАЧЕ ТаблицаЕдиниц.ЕдиницаИзмерения.Коэффициент КОНЕЦ КАК Коэффициент","ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) КАК ЕдиницаИзмерения,
		|	1 КАК Коэффициент")+"
		|ПОМЕСТИТЬ СтруктураНоменклатуры
		|ИЗ
		|(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦеныСрезПоследних.ТипЦен КАК ТипЦен,
		|	ЦеныСрезПоследних.Контрагент КАК Контрагент,
		|	ЦеныСрезПоследних.Подразделение КАК Подразделение,
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура
		|ИЗ
		|	ЦеныСрезПоследних КАК ЦеныСрезПоследних) КАК ТаблицаНоменклатуры"+?(ЕстьХарактеристика,"
		|ЛЕВОЕ СОЕДИНЕНИЕ(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	"+?(ТипЦенВСтроке,"ЦеныСрезПоследних.ТипЦен КАК ТипЦен,","")+"
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|	ИЗ
		|		ЦеныСрезПоследних КАК ЦеныСрезПоследних
		|	ГДЕ
		|		(НЕ ЦеныСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ТаблицаХарактеристик
		|ПО ТаблицаНоменклатуры.Номенклатура = ТаблицаХарактеристик.Номенклатура
		|	"+?(ТипЦенВСтроке," И ТаблицаНоменклатуры.ТипЦен = ТаблицаХарактеристик.ТипЦен",""),"")+?(ЕстьЕдиница,"
		|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	"+?(ТипЦенВСтроке,"ЦеныСрезПоследних.ТипЦен КАК ТипЦен,","")+"
		|		ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|		ЦеныСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|	ИЗ
		|		ЦеныСрезПоследних КАК ЦеныСрезПоследних
		|	ГДЕ
		|		(НЕ ЦеныСрезПоследних.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))) КАК ТаблицаЕдиниц
		|ПО ТаблицаНоменклатуры.Номенклатура = ТаблицаЕдиниц.Номенклатура
		|	"+?(ТипЦенВСтроке," И ТаблицаНоменклатуры.ТипЦен = ТаблицаЕдиниц.ТипЦен",""),"")+"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦен,
		|	Контрагент,
		|	Подразделение,
		|	Номенклатура
		|;
		|
		|ВЫБРАТЬ
		|	СтруктураНоменклатуры.ТипЦен КАК ТипЦен,
		|	СтруктураНоменклатуры.Контрагент КАК Контрагент,
		|	СтруктураНоменклатуры.Подразделение КАК Подразделение,
		|	СтруктураНоменклатуры.Номенклатура КАК Номенклатура,
		|	СтруктураНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СтруктураНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(ОбщиеЦены.Цена, 0) КАК ЦенаНоменклатуры,"+?(ЕстьХарактеристика И ЕстьЕдиница,"
		|	ВЫБОР
		|		КОГДА СтруктураНоменклатуры.Коэффициент=1 ТОГДА
		|			ЕСТЬNULL(ЦеныСрезПоследних.Цена, ОбщиеЦены.Цена)
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК ЦенаХарактеристики,","")+"
		|	ВЫБОР
		|		КОГДА СтруктураНоменклатуры.Коэффициент>1 И СтруктураНоменклатуры.ТипЦен.АлгоритмПолученияЦены = ЗНАЧЕНИЕ(Перечисление.АлгоритмПолученияЦены.ПоЕдиницеИзмерения) ТОГДА
		|			ЕСТЬNULL(ЦеныСрезПоследних.Цена, ОбщиеЦены.Цена*СтруктураНоменклатуры.Коэффициент)
		|		КОГДА СтруктураНоменклатуры.Коэффициент>1 ТОГДА 
		|			ЕСТЬNULL(ЦеныСрезПоследних.Цена, ОбщиеЦены.Цена)*СтруктураНоменклатуры.Коэффициент
		|		ИНАЧЕ
		|			ЕСТЬNULL(ЦеныСрезПоследних.Цена, ОбщиеЦены.Цена)
		|	КОНЕЦ КАК Цена
		|"+?(ЕстьОбъектСравнения, "ПОМЕСТИТЬ ЦеныСрезПоследнихСДополнением",",
		|	СтруктураНоменклатуры.Номенклатура.ЭтоГруппа КАК НоменклатураЭтоГруппа,"+?(ЕстьХарактеристика И ЕстьЕдиница,"
		|	0 КАК ОтклонениеЦеныХарактеристик,","")+"
		|	0 КАК ОтклонениеЦеныНоменклатуры,
		|	0 КАК ОтклонениеЦены
		|{ВЫБРАТЬ
		|	Контрагент.* КАК Контрагент,
		|	Подразделение.* КАК Подразделение,
		|	Номенклатура.* КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
		|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
		|	ТипЦен.* КАК ТипЦен}")+"
		|ИЗ	
		|	СтруктураНоменклатуры КАК СтруктураНоменклатуры
		|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ЦеныСрезПоследних
		|ПО 
		|	СтруктураНоменклатуры.Номенклатура = ЦеныСрезПоследних.Номенклатура И 
		|	СтруктураНоменклатуры.ТипЦен = ЦеныСрезПоследних.ТипЦен И 
		|	СтруктураНоменклатуры.Контрагент = ЦеныСрезПоследних.Контрагент И 
		|	СтруктураНоменклатуры.Подразделение = ЦеныСрезПоследних.Подразделение И
		|	(((НЕ СтруктураНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) И 
		|	СтруктураНоменклатуры.ХарактеристикаНоменклатуры = ЦеныСрезПоследних.ХарактеристикаНоменклатуры) ИЛИ 
		|	((НЕ СтруктураНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) И 
		|	СтруктураНоменклатуры.ЕдиницаИзмерения = ЦеныСрезПоследних.ЕдиницаИзмерения))
		|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних КАК ОбщиеЦены
		|ПО 
		|	ОбщиеЦены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
		|	ОбщиеЦены.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) И 
		|	СтруктураНоменклатуры.Номенклатура = ОбщиеЦены.Номенклатура И 
		|	СтруктураНоменклатуры.ТипЦен = ОбщиеЦены.ТипЦен И 
		|	СтруктураНоменклатуры.Контрагент = ОбщиеЦены.Контрагент И 
		|	СтруктураНоменклатуры.Подразделение = ОбщиеЦены.Подразделение";
		
 	КонецЕсли;	
	
	Если ЕстьОбъектСравнения Тогда
		ТекстДополнения = ?(ЕстьОтдельныеЦены,"СДополнением","");
		ТекстЗапросаРезультат = ТекстЗапросаРезультат+"
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипЦен,
		|	Номенклатура
		|;
		|
		|УНИЧТОЖИТЬ "+?(ЕстьОтдельныеЦены,"ЦеныСрезПоследних
		|;
		|
		|УНИЧТОЖИТЬ СтруктураНоменклатуры","ТаблицаЦенПодразделений")+"
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаЦен.Контрагент,
		|	ТаблицаЦен.Подразделение,
		|	ТаблицаЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаЦен.ТипЦен КАК ТипЦен,
		|	ТаблицаЦен.Номенклатура.ЭтоГруппа КАК НоменклатураЭтоГруппа,"+?(ЕстьОтдельныеЦены,"
		|	ТаблицаЦен.ЦенаНоменклатуры КАК ЦенаНоменклатуры,"+?(ЕстьХарактеристика И ЕстьЕдиница,"
		|	ТаблицаЦен.ЦенаХарактеристики КАК ЦенаХарактеристики,
		|	ВЫБОР
		|		КОГДА ((СобственныеЦеныСрезПоследних.ЦенаХарактеристики ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.ЦенаХарактеристики = 0)) И (НЕ ТаблицаЦен.ЦенаХарактеристики = 0) ТОГДА
		|			- 100
		|		КОГДА ((СобственныеЦеныСрезПоследних.ЦенаХарактеристики ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.ЦенаХарактеристики = 0)) ТОГДА
		|			0
		|		ИНАЧЕ 
		|			100*(ТаблицаЦен.ЦенаХарактеристики - СобственныеЦеныСрезПоследних.ЦенаХарактеристики)/СобственныеЦеныСрезПоследних.ЦенаХарактеристики 
		|	КОНЕЦ КАК ОтклонениеЦеныХарактеристик,","")+"
		|	ВЫБОР
		|		КОГДА ((СобственныеЦеныСрезПоследних.ЦенаНоменклатуры ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.ЦенаНоменклатуры = 0)) И (НЕ ТаблицаЦен.ЦенаНоменклатуры = 0) ТОГДА
		|			- 100
		|		КОГДА ((СобственныеЦеныСрезПоследних.ЦенаНоменклатуры ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.ЦенаНоменклатуры = 0)) ТОГДА
		|			0
		|		ИНАЧЕ 
		|			100*(ТаблицаЦен.ЦенаНоменклатуры - СобственныеЦеныСрезПоследних.ЦенаНоменклатуры)/СобственныеЦеныСрезПоследних.ЦенаНоменклатуры 
		|	КОНЕЦ КАК ОтклонениеЦеныНоменклатуры,","")+"
		|	ТаблицаЦен.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА ((СобственныеЦеныСрезПоследних.Цена ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.Цена = 0)) И (НЕ ТаблицаЦен.Цена = 0) ТОГДА
		|			- 100
		|		КОГДА ((СобственныеЦеныСрезПоследних.Цена ЕСТЬ NULL) ИЛИ (СобственныеЦеныСрезПоследних.Цена = 0)) ТОГДА
		|			0
		|		ИНАЧЕ 
		|			100*(ТаблицаЦен.Цена - СобственныеЦеныСрезПоследних.Цена)/СобственныеЦеныСрезПоследних.Цена 
		|	КОНЕЦ КАК ОтклонениеЦены	
		|{ВЫБРАТЬ
		|	Контрагент.* КАК Контрагент,
		|	Подразделение.* КАК Подразделение,
		|	Номенклатура.* КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
		|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
		|	ТипЦен.* КАК ТипЦен}
		|ИЗ
		|	ЦеныСрезПоследних"+ТекстДополнения+" КАК ТаблицаЦен
		|ЛЕВОЕ СОЕДИНЕНИЕ ЦеныСрезПоследних"+ТекстДополнения+" КАК СобственныеЦеныСрезПоследних
		|ПО 
		|	СобственныеЦеныСрезПоследних.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
		|	ТаблицаЦен.ТипЦен = СобственныеЦеныСрезПоследних.ТипЦен И 
		|	ТаблицаЦен.Подразделение = СобственныеЦеныСрезПоследних.Подразделение И 
		|	ТаблицаЦен.Номенклатура = СобственныеЦеныСрезПоследних.Номенклатура И 
		|	ТаблицаЦен.ХарактеристикаНоменклатуры = СобственныеЦеныСрезПоследних.ХарактеристикаНоменклатуры И 
		|	ТаблицаЦен.ЕдиницаИзмерения = СобственныеЦеныСрезПоследних.ЕдиницаИзмерения";
	КонецЕсли;
	ТекстЗапросаРезультат = ТекстЗапросаРезультат+"
	|{УПОРЯДОЧИТЬ ПО
	|	Контрагент.* КАК Контрагент,
	|	Подразделение.* КАК Подразделение,
	|	Номенклатура.* КАК Номенклатура,
	|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ТипЦен.* КАК ТипЦен}
	|
	|{ИТОГИ ПО
	|	Контрагент.* КАК Контрагент,
	|	Подразделение.* КАК Подразделение,
	|	Номенклатура.* КАК Номенклатура,
	|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
	|	ТипЦен.* КАК ТипЦен}
	|
	|ИТОГИ
	|	"+?(ЕстьОтдельныеЦены,"ВЫБОР "+?(ЕстьХарактеристика И ЕстьЕдиница,"
	|	КОГДА (НЕ ХарактеристикаНоменклатуры ЕСТЬ NULL) И (ЕдиницаИзмерения ЕСТЬ NULL) ТОГДА МАКСИМУМ(ЦенаХарактеристики)","")+"
	|	КОГДА (НЕ ХарактеристикаНоменклатуры ЕСТЬ NULL) ИЛИ (НЕ ЕдиницаИзмерения ЕСТЬ NULL) ТОГДА МАКСИМУМ(Цена)
	|	КОГДА НоменклатураЭтоГруппа ТОГДА 0
	|	ИНАЧЕ МАКСИМУМ(ЦенаНоменклатуры)
	|	КОНЕЦ КАК Цена,
	|ВЫБОР "+?(ЕстьХарактеристика И ЕстьЕдиница,"
	|	КОГДА (НЕ ХарактеристикаНоменклатуры ЕСТЬ NULL) И (ЕдиницаИзмерения ЕСТЬ NULL) ТОГДА МАКСИМУМ(ОтклонениеЦеныХарактеристик)","")+"
	|	КОГДА (НЕ ХарактеристикаНоменклатуры ЕСТЬ NULL) ИЛИ (НЕ ЕдиницаИзмерения ЕСТЬ NULL) ТОГДА МАКСИМУМ(ОтклонениеЦены)
	|	КОГДА НоменклатураЭтоГруппа ТОГДА 0
	|	ИНАЧЕ МАКСИМУМ(ОтклонениеЦеныНоменклатуры)
	|	КОНЕЦ КАК ОтклонениеЦены
	|	","ВЫБОР 
	|		КОГДА НоменклатураЭтоГруппа ТОГДА 0
	|		ИНАЧЕ МАКСИМУМ(Цена) КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА НоменклатураЭтоГруппа ТОГДА 0
	|		ИНАЧЕ МАКСИМУМ(ОтклонениеЦены) КОНЕЦ КАК ОтклонениеЦены")+"
	|ПО 
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	ЕдиницаИзмерения";
	
	Возврат ТекстЗапросаРезультат;
	
КонецФункции //ПолучитьТекстЗапроса()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

 //// Процедура формирует строку измерений макета построителя отчета
////
//// Параметры:
////	ОтчетОбъект        - ОтчетОбъект                - Объект отчета
////	ПостроительОтчета  - ПостроительОтчета          - Построитель отчета
////	МакетОтчета        - ТабличныйДокумент          - Макет отчета
////	ТекИзмерение       - ИзмерениеПостроителяОтчета - Текущее измерение
////	СчетчикУровня      - Число						- Счетчик уровня
////	ПараметрыИзмерения - Структура					- Параметры измерения
////	КлючСтроки         - Строка						- Ключ строки
////	ГраницаМакета      - Структура					- Границы макета
////
Процедура СформироватьМакетИзмеренияСтроки(ОтчетОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтроки, ГраницаМакета)
	
	РесурсыОтчета              = ПараметрыИзмерения.РесурсыОтчета;
	ДеревоРесурсов             = ПараметрыИзмерения.ДеревоРесурсов;
	КоличествоРазверток		   = ПараметрыИзмерения.КоличествоРазверток;
	КоличествоУровней          = ПараметрыИзмерения.КоличествоУровней;
	ЭтоИерархия                = ПараметрыИзмерения.ЭтоИерархия;
	ОбластьОформлениеИзмерений = ПараметрыИзмерения.ОбластьОформлениеИзмерений;
	НачальноеОформление        = ПараметрыИзмерения.НачальноеОформление;
	
	Попытка	   ДополнительныеПоляВОтдельнойКолонке = ОтчетОбъект.ВыводитьДополнительныеПоляВОтдельнойКолонке;
	Исключение ДополнительныеПоляВОтдельнойКолонке = Ложь;
	КонецПопытки;
	
	Попытка СтруктураФорматаПолей = ОтчетОбъект.СтруктураФорматированияПолей();
	Исключение СтруктураФорматаПолей = Новый Структура();
	КонецПопытки;	
	
	СтруктураСвязиСвойств = Новый Структура();
	Попытка СтруктураСвязиСвойств = ОтчетОбъект.СтруктураСвязиСвойств;
	Исключение КонецПопытки;	
	Если ТипЗнч(СтруктураСвязиСвойств) <> Тип("Структура") Тогда
		СтруктураСвязиСвойств = Новый Структура();
	КонецЕсли;
	
	ПоследнееИзмерение = ТекПостроительОтчета.ИзмеренияСтроки.Индекс(ТекИзмерение) = ТекПостроительОтчета.ИзмеренияСтроки.Количество() - 1;
	НомерСтроки = МакетОтчета.ВысотаТаблицы + 1;
	НачальныйНомерВыводаКолонок = ?(ОтчетОбъект.ИспользоватьАвтоотступ, 3, КоличествоУровней + 2);
	
	ТекПараметрыИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекИзмерение.ПутьКДанным, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей);
	ИмяТекИзмерения = ТекИзмерение.Имя;
	ПутьОсновногоПредставления = "";
	ТипЗаполненияОбластиИзмерения =	ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	Попытка
		Если ТекПараметрыИзмерения.Свойство("ОсновноеПредставление") Тогда
			ПутьОсновногоПредставления = ТекПараметрыИзмерения.ОсновноеПредставление;
			ИмяТекИзмерения = СтрЗаменить(ПутьОсновногоПредставления,".","");
		ИначеЕсли ТекПараметрыИзмерения.Свойство("СоставноеПредставление") Тогда
			ИмяТекИзмерения = ТекПараметрыИзмерения.СоставноеПредставление.Представление;
			ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
		КонецЕсли;
	Исключение
	КонецПопытки;
	// Установим ключ строки, что бы в дальнейшем удалить "пустышки"
	Если Не ПустаяСтрока(КлючСтроки) Тогда
		МакетОтчета.Область(НомерСтроки, 1).Текст = КлючСтроки;
	КонецЕсли;
	
	ТекДополнительныеПоляОтчета = ОтчетОбъект.ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Ложь));
	
	Если ТекДополнительныеПоляОтчета.Количество() > 0 И Не ДополнительныеПоляВОтдельнойКолонке Тогда
		
		ТекстШаблона = "";
		Для ИндПоля=0 По ТекДополнительныеПоляОтчета.Количество()-1 Цикл
			ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			Если (СтруктураСвязиСвойств.Свойство(ТекПоле.Имя)) И (НЕ ЭтоИерархия) Тогда
				ЗаполнятьПараметр = ТекИзмерение.Имя = СтруктураСвязиСвойств[ТекПоле.Имя].ИмяИзмерения;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			Если ЗаполнятьПараметр Тогда ТекстШаблона = ТекстШаблона + ", [" + ТекПоле.Имя + "]"; КонецЕсли;
		КонецЦикла;
		
		Если Не обЗначениеНеЗаполнено(ТекстШаблона) Тогда
			ТипЗаполненияОбластиИзмерения =	ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
			ИмяТекИзмерения = "[" + ИмяТекИзмерения + "]"+ТекстШаблона;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
		Для к = 1 по СчетчикУровня - 1 Цикл
			ОформлениеУровня = ОбластьОформлениеИзмерений.Область(НачальноеОформление + к, 1);
			
			ОбластьПредУровня = МакетОтчета.Область(НомерСтроки, к + 1);
			ОбластьПредУровня.Шрифт        = ОформлениеУровня.Шрифт;
			ОбластьПредУровня.ЦветТекста   = ОформлениеУровня.ЦветТекста;
			ОбластьПредУровня.ЦветФона     = ОформлениеУровня.ЦветФона;
			ОбластьПредУровня.ГраницаСлева = ГраницаМакета.ИзмерениеСтрока.ГраницаСлева;
			ОбластьПредУровня.ШиринаКолонки = 2;
		КонецЦикла;
		
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		
	Иначе
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
	КонецЕсли;	
	
	ОформлениеУровня = ОбластьОформлениеИзмерений.Область(НачальноеОформление + СчетчикУровня, 1);
	
	ОбластьКолонки.Объединить();
	ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьКолонки.Заполнение    = ТипЗаполненияОбластиИзмерения;
	ОбластьКолонки.Параметр      = ИмяТекИзмерения;
	ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	ОбластьКолонки.Шрифт         = ОформлениеУровня.Шрифт;
	
	Если ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
		Попытка
			Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
				ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
			Иначе
				ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей).Формат;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ОбластьКолонки.ЦветТекста    = ОформлениеУровня.ЦветТекста;
	ОбластьКолонки.ЦветФона      = ОформлениеУровня.ЦветФона;
	ОбластьКолонки.ГраницаСверху = ГраницаМакета.ИзмерениеСтрока.ГраницаСверху;
	ОбластьКолонки.ГраницаСлева  = ГраницаМакета.ИзмерениеСтрока.ГраницаСлева;
	Если ОтчетОбъект.ИспользоватьАвтоотступ Тогда
		ОбластьКолонки.Автоотступ = 1;
	КонецЕсли;	
									  
	ОбластьКолонки.ПараметрРасшифровки = "Расшифровка";
	Если обЗначениеНеЗаполнено(ОбластьКолонки.Формат) И СтруктураФорматаПолей.Свойство(ТекИзмерение.Имя) Тогда
		ОбластьКолонки.Формат = СтруктураФорматаПолей[ТекИзмерение.Имя];
	КонецЕсли;
	
	Если ТекДополнительныеПоляОтчета.Количество() > 0 И ДополнительныеПоляВОтдельнойКолонке Тогда
		
		// Теперь добавим выбранные дополнительные поля
		Для ИндПоля=0 По ТекДополнительныеПоляОтчета.Количество()-1 Цикл
			
			ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			Если (СтруктураСвязиСвойств.Свойство(ТекПоле.Имя)) И (НЕ ЭтоИерархия) Тогда
				ЗаполнятьПараметр = ТекИзмерение.Имя = СтруктураСвязиСвойств[ТекПоле.Имя].ИмяИзмерения;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			
			Если ЗаполнятьПараметр Тогда
				ОбластьДопПоле.Заполнение          = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьДопПоле.Параметр            = ТекПоле.Имя;
				ОбластьДопПоле.ПараметрРасшифровки = ТекПоле.Имя;
				ОбластьДопПоле.Формат              = ТекПоле.Формат;
			Иначе
				ОбластьДопПоле.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьДопПоле.Текст      = "";
			КонецЕсли;
			ОбластьДопПоле.ГраницаСверху = ГраницаМакета.ДопПоляСтрока.ГраницаСверху;
			ОбластьДопПоле.ГраницаСлева  = ГраницаМакета.ДопПоляСтрока.ГраницаСлева;
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
		
		Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		Иначе ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		КонецЕсли;
		ОбластьДопПоле.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.Шрифт         = ОформлениеУровня.Шрифт;
		ОбластьДопПоле.ЦветТекста    = ОформлениеУровня.ЦветТекста;
		ОбластьДопПоле.ЦветФона      = ОформлениеУровня.ЦветФона;
	КонецЕсли;	
	
	НеСвязанныеДополнительныеПоляОтчета = ОтчетОбъект.ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Истина));
	Если НеСвязанныеДополнительныеПоляОтчета.Количество() > 0 Тогда
		
		Для ИндПоля=0 По НеСвязанныеДополнительныеПоляОтчета.Количество()-1 Цикл
			
			ТекПоле = НеСвязанныеДополнительныеПоляОтчета[ИндПоля];
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, НачальныйНомерВыводаКолонок);
			ЗаполнятьПараметр = Ложь;
			
			Если ТекПоле.ВыводитьИтогДляВсехУровней Тогда
				ЗаполнятьПараметр = Истина;
			ИначеЕсли ОтчетОбъект.СтруктураНеСвязанныхПоказателей.Свойство(ТекИзмерение.Имя) Тогда
				Если ЭтоИерархия Тогда
					Если (ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"].Свойство(ТекПоле.Имя)) Тогда
						ЗаполнятьПараметр = ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"][ТекПоле.Имя].ВыводитьИтогПоИерархии;
					КонецЕсли;
				Иначе
					ЗаполнятьПараметр = ОтчетОбъект.СтруктураНеСвязанныхПоказателей[ТекИзмерение.Имя]["Показатели"].Свойство(ТекПоле.Имя);
				КонецЕсли;
			Иначе ЗаполнятьПараметр = (ТекПоле.ПутьКДанным <> ТекИзмерение.ПутьКДанным И Найти(ТекПоле.ПутьКДанным, ТекИзмерение.ПутьКДанным) > 0);
			КонецЕсли;
			
			Если ЗаполнятьПараметр Тогда
				ОбластьДопПоле.Заполнение          = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьДопПоле.Параметр            = ТекПоле.Имя;
				ОбластьДопПоле.ПараметрРасшифровки = ТекПоле.Имя;
				ОбластьДопПоле.Формат              = ТекПоле.Формат;
			Иначе
				ОбластьДопПоле.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьДопПоле.Текст      = "";
			КонецЕсли;
			ОбластьДопПоле.ГраницаСверху = ГраницаМакета.ДопПоляСтрока.ГраницаСверху;
			ОбластьДопПоле.ГраницаСлева  = ГраницаМакета.ДопПоляСтрока.ГраницаСлева;
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
		
		Если НЕ ОтчетОбъект.ИспользоватьАвтоотступ Тогда
			ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, СчетчикУровня + 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		Иначе ОбластьДопПоле = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		КонецЕсли;
		ОбластьДопПоле.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.Шрифт         = ОформлениеУровня.Шрифт;
		ОбластьДопПоле.ЦветТекста    = ОформлениеУровня.ЦветТекста;
		ОбластьДопПоле.ЦветФона      = ОформлениеУровня.ЦветФона;
	КонецЕсли;
	
	НомерКолонки = НачальныйНомерВыводаКолонок;
	Если КоличествоРазверток > 0 Тогда
		ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		НомерКолонки = НомерКолонки + ((КоличествоРазверток - 1) * РесурсыОтчета.Количество());
	Иначе
		ОбластьПостроителя = МакетОтчета.Область("R" + НомерСтроки);
	КонецЕсли;
	
	Если НЕ ТекПостроительОтчета.ВыводитьДетальныеЗаписи ИЛИ НЕ ПоследнееИзмерение ИЛИ ЭтоИерархия Тогда
		ОбластьПостроителя.Имя = ТекИзмерение.Имя + ?(ЭтоИерархия, "Иерархия", "");
		
	Иначе
		ОбластьПостроителя.Имя = "Детали";
	КонецЕсли;
	
	ИспользованиеРесурсов = Новый Структура();
	Попытка
		Если ЭтоИерархия Тогда
			СтрПутьКДанным = ТекИзмерение.ПутьКДанным+".Родитель";
		Иначе
			СтрПутьКДанным = ТекИзмерение.ПутьКДанным;
		КонецЕсли;
		ИспользованиеРесурсов=отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(СтрПутьКДанным, ОтчетОбъект.ПараметрыИспользованияПолейИПоказателей);
		ИспользованиеРесурсов=ИспользованиеРесурсов["Использование"]["Ресурсы"]
	Исключение КонецПопытки;
	
	НомерПервойКолонки = НомерКолонки;
	Для Каждого ТекРесурс Из РесурсыОтчета Цикл
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Если ПустаяСтрока(ТекРесурс) Тогда
			ОтображатьПоказатель = Ложь;
		Иначе
		Попытка    ОтображатьПоказатель = ИспользованиеРесурсов[ТекРесурс];
		Исключение ОтображатьПоказатель = Истина;
		КонецПопытки;
		КонецЕсли;
		
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		
		Если ОтображатьПоказатель Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекРесурс;
			ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	ТекНомерКолонки = НомерПервойКолонки;
	СчетчикФункций=0;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		СчетчикПоказателей = 0;
		Если ТекФункция.Одиночный Тогда
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
			ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСлева,ГраницаМакета.ФункцииСтрока.ГраницаСлева);
			ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
			ТекНомерКолонки = ТекНомерКолонки+1;
		Иначе
			Для Каждого ТекПоказатель Из ТекФункция.Строки Цикл
				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
				ОбластьКолонки.ГраницаСлева  = ?(СчетчикПоказателей=0,?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСлева,ГраницаМакета.ФункцииСтрока.ГраницаСлева), ГраницаМакета.ПоказателиСтрока.ГраницаСлева);
				ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиСтрока.ГраницаСверху;
				ТекНомерКолонки = ТекНомерКолонки+1;
				СчетчикПоказателей = СчетчикПоказателей+1;
			КонецЦикла;
		КонецЕсли;
		СчетчикФункций=СчетчикФункций+1;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииСтрока.ГраницаСправа;
	КонецЦикла;
	ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа;
	
	Если КоличествоРазверток > 0 Тогда
		ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерКолонки - 1);
		ОбластьПостроителя.Имя = ТекИзмерение.Имя + "Ресурсы" + ?(ЭтоИерархия, "Иерархия", "");
	КонецЕсли;
	
	ОформлениеСтроки = ОбластьОформлениеИзмерений.Область(НачальноеОформление + СчетчикУровня, 1);
	
	ОбластьСтроки = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаКолонок, НомерСтроки, МакетОтчета.ШиринаТаблицы);
	ОбластьСтроки.Шрифт         = ОформлениеСтроки.Шрифт;
	ОбластьСтроки.ЦветТекста    = ОформлениеСтроки.ЦветТекста;
	ОбластьСтроки.ЦветФона      = ОформлениеСтроки.ЦветФона;
	
КонецПроцедуры	//	отСформироватьМакетИзмеренияСтроки()

//// Функция возвращает оформленный табличный документ для использования в качестве макета построителя отчета
////
//// Параметры:
////	ОтчетОбъект       - ОтчетОбъект       - Объект отчета
////	ПостроительОтчета - ПостроительОтчета - Построитель отчета
////
//// Возвращаемое значение:
////	ТабличныйДокумент - Макет отчета
////
Функция ПолучитьМакетПостроителя(ТекПостроительОтчета, МакетОтчета, ПараметрыОформления) Экспорт
	
	Попытка	   МакетОформления = ПолучитьОбщийМакет(ИмяМакетаОформленияТабличногоДокумента);
	Исключение МакетОформления = ПолучитьОбщийМакет("МакетОформлениеОтчета");
	КонецПопытки;
	
	Попытка    СтруктураФорматаПолей = СтруктураФорматированияПолей();
	Исключение СтруктураФорматаПолей = Новый Структура();
	КонецПопытки;
	
	Попытка	   ДополнительныеПоляВОтдельнойКолонке = ВыводитьДополнительныеПоляВОтдельнойКолонке;
	Исключение ДополнительныеПоляВОтдельнойКолонке = Ложь;
	КонецПопытки; 
	
	ОбластьОформлениеГраниц = Неопределено;
	
	ОбластьОформлениеИзмерений = МакетОформления.ПолучитьОбласть("ОформлениеИзмерений");
	ОформлениеШапки            = МакетОформления.ПолучитьОбласть("ОформлениеШапки").Область(1, 1);
	ОформлениеИтоги            = МакетОформления.ПолучитьОбласть("ОформлениеИтоги").Область(1, 1);
	Попытка 
		ОбластьОформлениеГраниц    = МакетОформления.ПолучитьОбласть("ОформлениеГраниц");
	Исключение
	КонецПопытки;
	
	Если ОбластьОформлениеГраниц<>Неопределено Тогда
		ЗначениеГраницОтчета  = ОбластьОформлениеГраниц.Области.ЗначениеГраницОтчета;
		ВключитьГраницуСправа = ЗначениеГраницОтчета.АвтоОтступ=1;
	Иначе
		ЗначениеГраницОтчета  = Новый Структура("ГраницаСправа", Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1));
		ВключитьГраницуСправа = Истина;
	КонецЕсли;
	
	ОбластьОформлениеИзмерений	= ПараметрыОформления.ОбластьОформлениеИзмерений;
	ОформлениеШапки				= ПараметрыОформления.ОформлениеШапки;
	ОформлениеИтоги				= ПараметрыОформления.ОформлениеИтоги;
	ГраницаМакета				= ПараметрыОформления.ГраницаМакета;
			
	ЗаголовокШапки    = "";
	КоличествоУровней = 0;
	Для Каждого ТекИзмерение Из ТекПостроительОтчета.ИзмеренияСтроки Цикл
		ЗаголовокШапки = ЗаголовокШапки + ?(ЗаголовокШапки = "", "", " / ") + ТекИзмерение.Представление;
		
		Если ТекИзмерение.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
			КоличествоУровней = КоличествоУровней + 1;
		КонецЕсли;	
		
		КоличествоУровней = КоличествоУровней + 1;
	КонецЦикла;
	
	КоличествоРазверток = 0;
	Для Каждого ТекИзмерение Из ТекПостроительОтчета.ИзмеренияКолонки Цикл
		Если ТекИзмерение.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
			КоличествоРазверток = КоличествоРазверток + 1;
		КонецЕсли;

		КоличествоРазверток = КоличествоРазверток + 1;
	КонецЦикла;
	
	ПеремГраницаСправа = ?(ВключитьГраницуСправа, ЗначениеГраницОтчета.ГраницаСправа, ?(КоличествоРазверток>0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева));
	
	РесурсыОтчета = Новый Массив();
	ДеревоРесурсов = Новый ДеревоЗначений;
	ДеревоРесурсов.Колонки.Добавить("ИмяРесурса");
	ДеревоРесурсов.Колонки.Добавить("Представление");
	ДеревоРесурсов.Колонки.Добавить("ФорматнаяСтрока");
	ДеревоРесурсов.Колонки.Добавить("ШиринаКолонки");
	ДеревоРесурсов.Колонки.Добавить("Одиночный");
		
	Для Каждого ТекФункция Из Функции Цикл
		Если НЕ ТекФункция.Использование Тогда Продолжить; КонецЕсли;
		Если ТекФункция.Представление="" И ТекФункция.Имя="" Тогда
			Для Каждого ТекПоказатель Из Показатели Цикл
				Если НЕ ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
				ИмяРесурса = ТекПоказатель.Имя;
				РесурсыОтчета.Добавить(ИмяРесурса);
				НоваяГруппа = ДеревоРесурсов.Строки.Добавить();
				НоваяГруппа.ИмяРесурса = ИмяРесурса;
				НоваяГруппа.Представление = ТекПоказатель.Представление;
				НоваяГруппа.ФорматнаяСтрока = ТекПоказатель.ФорматнаяСтрока;
				НоваяГруппа.ШиринаКолонки = ТекПоказатель.ШиринаКолонки;
				НоваяГруппа.Одиночный = Истина;
			КонецЦикла;
		Иначе
			НоваяГруппа = ДеревоРесурсов.Строки.Добавить();
			НоваяГруппа.ИмяРесурса = "";
			НоваяГруппа.Представление = ТекФункция.Представление;
			НоваяГруппа.ФорматнаяСтрока = "";
			НоваяГруппа.ШиринаКолонки = "";
			НоваяГруппа.Одиночный = Ложь;
			Для Каждого ТекПоказатель Из Показатели Цикл
				Если НЕ ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
				ИмяРесурса = ТекПоказатель.Имя + ТекФункция.Имя;
				РесурсыОтчета.Добавить(ИмяРесурса);
				НоваяСтрока = НоваяГруппа.Строки.Добавить();
				НоваяСтрока.ИмяРесурса = ИмяРесурса;
				НоваяСтрока.Представление = ТекПоказатель.Представление;
				НоваяСтрока.ФорматнаяСтрока = ТекПоказатель.ФорматнаяСтрока;
				НоваяСтрока.ШиринаКолонки = ТекПоказатель.ШиринаКолонки;
				НоваяСтрока.Одиночный = Ложь;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Приступим к формированию макета
	ТаблицаЗаголовка = отПолучитьТаблицуЗаголовкаОтчета(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета.Область(1, 2).Шрифт);
	
	Для Инд=0 По ТаблицаЗаголовка.Количество()-1 Цикл
		ТекСтрокаЗаголовка = ТаблицаЗаголовка[Инд];
		ОбластьЗаголовок = МакетОтчета.Область(Инд+1, 2);
		Для Каждого ТекКолонка Из ТаблицаЗаголовка.Колонки Цикл
			Если ТекКолонка.Имя="ИмяСтроки" Тогда Продолжить; КонецЕсли;
			ТекПараметрЗаголовка = ТекСтрокаЗаголовка[ТекКолонка.Имя];
			Если обЗначениеНеЗаполнено(ТекПараметрЗаголовка) Тогда Продолжить; КонецЕсли;
			ОбластьЗаголовок[ТекКолонка.Имя] = ТекПараметрЗаголовка;
		КонецЦикла;
	КонецЦикла;
	
	ВысотаЗаголовка = МакетОтчета.ВысотаТаблицы;
	МакетОтчета.Область(1, 1).ШиринаКолонки = 1;
	МакетОтчета.Область("R1:R" + ВысотаЗаголовка).Имя = "ЗаголовокШаблон";
	
	// Создадим отступы уровней измерений строк
	Если НЕ ИспользоватьАвтоотступ Тогда
		НачальныйНомерВыводаКолонок = 2;
		Для к = 1 по КоличествоУровней Цикл
			МакетОтчета.Область(ВысотаЗаголовка + 1, НачальныйНомерВыводаКолонок).ШиринаКолонки = ?(к = КоличествоУровней, 40, 1.5);
			НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
		КонецЦикла;
	Иначе
		НачальныйНомерВыводаКолонок = 3;
		МакетОтчета.Область(ВысотаЗаголовка + 1, 2).ШиринаКолонки = 40;
	КонецЕсли;
	
	ОбластьЗаголовокСтрок = МакетОтчета.Область(ВысотаЗаголовка + 1, 2, ВысотаЗаголовка + 2 + КоличествоРазверток, НачальныйНомерВыводаКолонок - 1);
	ОбластьЗаголовокСтрок.Объединить();
	ОбластьЗаголовокСтрок.Текст                   = ЗаголовокШапки;
	ОбластьЗаголовокСтрок.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	ОбластьЗаголовокСтрок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовокСтрок.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьЗаголовокСтрок.ГраницаСлева            = ГраницаМакета.Измерения.ГраницаСлева;
	ОбластьЗаголовокСтрок.ГраницаСверху           = ГраницаМакета.Измерения.ГраницаСверху;
	ОбластьЗаголовокСтрок.ГраницаСнизу            = ГраницаМакета.Измерения.ГраницаСнизу;
	
	ДоступныеПоля = ДеревоДоступныхПолей;
	Для Каждого ТекПоле Из ДополнительныеПоляОтчета Цикл
		Если (НЕ ТекПоле.НеСвязанные) И (Не ДополнительныеПоляВОтдельнойКолонке) Тогда Продолжить; КонецЕсли;
		ОбластьДопПоле = МакетОтчета.Область(ВысотаЗаголовка + 1, НачальныйНомерВыводаКолонок, ВысотаЗаголовка + 2 + КоличествоРазверток, НачальныйНомерВыводаКолонок);
		ОбластьДопПоле.Объединить();
		ОбластьДопПоле.Текст                   = ТекПоле.ПолноеПредставление;
		ОбластьДопПоле.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьДопПоле.ШиринаКолонки           = ТекПоле.ШиринаКолонки;
		ОбластьДопПоле.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьДопПоле.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ОбластьДопПоле.ГраницаСлева            = ГраницаМакета.ДопПоля.ГраницаСлева;
		ОбластьДопПоле.ГраницаСверху           = ГраницаМакета.ДопПоля.ГраницаСверху;
		ОбластьДопПоле.ГраницаСнизу            = ГраницаМакета.Измерения.ГраницаСнизу;
		НачальныйНомерВыводаКолонок = НачальныйНомерВыводаКолонок + 1;
	КонецЦикла;
	
	Если КоличествоРазверток > 0 Тогда
		// Для кросс-отчета 
		ОбластьШапкаСтрок = МакетОтчета.Область(ВысотаЗаголовка + 1, 1, ВысотаЗаголовка + 2 + КоличествоРазверток, НачальныйНомерВыводаКолонок - 1);
		ОбластьШапкаСтрок.Имя = "ШапкаСтрок";
	Иначе
		ОбластьШапкаСтрок = МакетОтчета.Область("R" + (ВысотаЗаголовка + 1) + ":R" + (ВысотаЗаголовка + 2));
		ОбластьШапкаСтрок.Имя = "ШапкаТаблицы";
	КонецЕсли;
	
	НомерСтроки  = ВысотаЗаголовка + 1;
	НомерКолонки = НачальныйНомерВыводаКолонок;
	УровеньГруппировки=0;
	Для Каждого ТекКолонка Из ТекПостроительОтчета.ИзмеренияКолонки Цикл
		НомерПервойКолонки = НомерКолонки;
		ИмяТекИзмерения = ТекКолонка.Имя;
		ПутьОсновногоПредставления = "";
		ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		ТекПараметрыИзмерения = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекКолонка.ПутьКДанным, ПараметрыИспользованияПолейИПоказателей);
		Попытка
			Если ТекПараметрыИзмерения.Свойство("ОсновноеПредставление") Тогда
				ПутьОсновногоПредставления = ТекПараметрыИзмерения.ОсновноеПредставление;
				ИмяТекИзмерения = СтрЗаменить(ПутьОсновногоПредставления,".","");
			ИначеЕсли ТекПараметрыИзмерения.Свойство("СоставноеПредставление") Тогда
				ИмяТекИзмерения = ТекПараметрыИзмерения.СоставноеПредставление.Представление;
				ТипЗаполненияОбластиИзмерения = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Если УровеньГруппировки<КоличествоРазверток-1 Тогда
			Если ТекКолонка.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерПервойКолонки);
				ОбластьКолонки.Заполнение          = ТипЗаполненияОбластиИзмерения;
				ОбластьКолонки.Параметр            = ИмяТекИзмерения;
				ОбластьКолонки.ПараметрРасшифровки = "Расшифровка";
				ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
				ОбластьКолонки.ГраницаСлева        = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
				ОбластьКолонки.ГраницаСверху       = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
				ОбластьКолонки.ГраницаСправа       = ПеремГраницаСправа;
				Попытка
					Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
						ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
					Иначе
						ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ПараметрыИспользованияПолейИПоказателей).Формат;
					КонецЕсли;
				Исключение
				КонецПопытки;
				ОбластьПостроителя = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерПервойКолонки);
				ОбластьПостроителя.Имя = ТекКолонка.Имя + "Иерархия";
				НомерСтроки = НомерСтроки + 1;
				УровеньГруппировки = УровеньГруппировки+1;
				НомерПервойКолонки = НомерКолонки;
			КонецЕсли;
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерПервойКолонки);
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиИзмерения;
			ОбластьКолонки.Параметр                = ИмяТекИзмерения;
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонки.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьКолонки.ГраницаСлева        		= ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
			ОбластьКолонки.ГраницаСверху       		= ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
			ОбластьКолонки.ГраницаСправа       		= ПеремГраницаСправа;
			Попытка
				Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
					ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
				Иначе
					ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ПараметрыИспользованияПолейИПоказателей).Формат;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если обЗначениеНеЗаполнено(ОбластьКолонки.Формат) И СтруктураФорматаПолей.Свойство(ТекКолонка.Имя) Тогда
				ОбластьКолонки.Формат = СтруктураФорматаПолей[ТекКолонка.Имя];
			КонецЕсли;	
			
			ОбластьПостроителя = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерПервойКолонки);
			ОбластьПостроителя.Имя = ТекКолонка.Имя;
			НомерСтроки = НомерСтроки + 1;
			УровеньГруппировки = УровеньГруппировки+1;
		Иначе
			Если ТекКолонка.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерПервойКолонки);
				//ОбластьКолонки.Объединить();
				ОбластьКолонки.Заполнение          = ТипЗаполненияОбластиИзмерения;
				ОбластьКолонки.Параметр            = ИмяТекИзмерения;
				ОбластьКолонки.ПараметрРасшифровки = "Расшифровка";
				ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
				ОбластьКолонки.ГраницаСлева        = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
				ОбластьКолонки.ГраницаСверху       = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
				ОбластьКолонки.ГраницаСправа       = ПеремГраницаСправа;
				Попытка
					Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
						ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
					Иначе
						ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ПараметрыИспользованияПолейИПоказателей).Формат;
					КонецЕсли;
				Исключение
				КонецПопытки;
				ОбластьПостроителя = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерПервойКолонки);
				ОбластьПостроителя.Имя = ТекКолонка.Имя + "Иерархия";
				НомерСтроки = НомерСтроки + 1;
				УровеньГруппировки = УровеньГруппировки+1;
			КонецЕсли;
			НомерПервойКолонкиИзмерения = 0;
			ОбластьКолонкиПоказатель = Неопределено;
			ОстатокВысоты = ВысотаЗаголовка + КоличествоРазверток - НомерСтроки;
			Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
				НомерПервойКолонкиФункции = НомерКолонки;
				Для Каждого ТекПоказатель Из ТекФункция.Строки Цикл
					ОбластьКолонкиПоказатель = МакетОтчета.Область(НомерСтроки + 2, НомерКолонки, НомерСтроки + 2 + ОстатокВысоты, НомерКолонки);
					Если ОстатокВысоты > 0 Тогда
						ОбластьКолонкиПоказатель.Объединить();
					КонецЕсли;
					ОбластьКолонкиПоказатель.Текст                   = ТекПоказатель.Представление;
					ОбластьКолонкиПоказатель.Расшифровка             = Новый Структура("Показатель,Функция", ТекПоказатель, ТекФункция);
					//ОбластьДопПоле.ПараметрРасшифровки				 = ТекКолонка.Имя;
					ОбластьКолонкиПоказатель.ШиринаКолонки	  	     = ТекПоказатель.ШиринаКолонки;
					ОбластьКолонкиПоказатель.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
					ОбластьКолонкиПоказатель.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
					ОбластьКолонкиПоказатель.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
					ОбластьКолонкиПоказатель.ГраницаСлева            = ?(НомерПервойКолонкиФункции = НомерКолонки, ?(НомерПервойКолонкиИзмерения = 0,ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева,ГраницаМакета.Функции.ГраницаСправа), ГраницаМакета.Показатели.ГраницаСлева);
					ОбластьКолонкиПоказатель.ГраницаСверху           = ГраницаМакета.Показатели.ГраницаСверху;
					ОбластьКолонкиПоказатель.ГраницаСнизу            = ГраницаМакета.Показатели.ГраницаСнизу;
					
					НомерКолонки = НомерКолонки + 1;
				КонецЦикла;
				
				Если ТекФункция.Одиночный Тогда
					ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки + 1, НомерПервойКолонкиФункции, НомерСтроки + 2+ОстатокВысоты, НомерПервойКолонкиФункции);
					ОбластьКолонкиФункция.ШиринаКолонки = ?(ЗначениеЗаполнено(ТекФункция.ШиринаКолонки), ТекФункция.ШиринаКолонки, 14);
					НомерКолонки = НомерКолонки + 1;
				Иначе
					ОбластьКолонкиПоказатель.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
					ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки + 1, НомерПервойКолонкиФункции, НомерСтроки + 1, НомерКолонки - 1);
				КонецЕсли;
				
				ОбластьКолонкиФункция.Объединить();
				ОбластьКолонкиФункция.Текст                   = ТекФункция.Представление;
				ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
				ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
				ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				ОбластьКолонкиФункция.ГраницаСлева            = ?(НомерПервойКолонкиИзмерения = 0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева);
				ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
				ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
				НомерПервойКолонкиИзмерения=НомерПервойКолонкиИзмерения+1;
			КонецЦикла;
			
			ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
			Если ОбластьКолонкиПоказатель <> Неопределено Тогда
				ОбластьКолонкиПоказатель.ГраницаСправа        = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
			КонецЕсли;
			
			Если УровеньГруппировки >0 Тогда
				ТекУровень=1;
				Пока ТекУровень<УровеньГруппировки+1 Цикл
					ОбластьКолонки = МакетОтчета.Область(НомерСтроки-ТекУровень, НомерПервойКолонки, НомерСтроки-ТекУровень, НомерКолонки - 1);
					ОбластьКолонки.ГраницаСверху       = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
					ТекУровень=ТекУровень+1;
				КонецЦикла;
			КонецЕсли;
			
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерКолонки - 1);
			ОбластьКолонки.Объединить();
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиИзмерения;
			ОбластьКолонки.Параметр                = ИмяТекИзмерения;
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонки.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьКолонки.ГраницаСлева        		= ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
			ОбластьКолонки.ГраницаСверху       		= ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
			ОбластьКолонки.ГраницаСправа       		= ПеремГраницаСправа;
			Попытка
				Если обЗначениеНеЗаполнено(ПутьОсновногоПредставления) Тогда
					ОбластьКолонки.Формат = ТекПараметрыИзмерения.Формат;
				Иначе
					ОбластьКолонки.Формат = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ПутьОсновногоПредставления, ПараметрыИспользованияПолейИПоказателей).Формат;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если обЗначениеНеЗаполнено(ОбластьКолонки.Формат) И СтруктураФорматаПолей.Свойство(ТекКолонка.Имя) Тогда
				ОбластьКолонки.Формат = СтруктураФорматаПолей[ТекКолонка.Имя];
			КонецЕсли;	
			
			ОбластьПостроителя = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерКолонки - 1);
			ОбластьПостроителя.Имя = ТекКолонка.Имя;
			
			НомерСтроки = НомерСтроки + 1;
			УровеньГруппировки = УровеньГруппировки+1;
		КонецЕсли;
	КонецЦикла;
	
	Если (ТекПостроительОтчета.ИзмеренияКолонки.Количество() > 0) И ВключитьГраницуСправа Тогда
		ОбластьКолонки.ГраницаСправа = ЗначениеГраницОтчета.ГраницаСправа;
	КонецЕсли;
	
	Если (ТекПостроительОтчета.ИзмеренияКолонки.Количество()>0) И (НЕ ТекПостроительОтчета.ВыводитьОбщиеИтоги) Тогда
		ОбластьКолонки.ГраницаСправа               = ПеремГраницаСправа;
		ОбластьКолонкиФункция.ГраницаСправа        = ПеремГраницаСправа;
	КонецЕсли;
	
	НомерСтроки = ВысотаЗаголовка + 1;
	НомерПервойКолонки = НомерКолонки;
	НомерПервойКолонкиИзмерения = 0;
	ОбластьКолонкиПоказатель = Неопределено;
	ОстатокВысоты = ВысотаЗаголовка + КоличествоРазверток - НомерСтроки;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		НомерПервойКолонкиФункции = НомерКолонки;
		Для Каждого ТекПоказатель Из ТекФункция.Строки Цикл
			Если КоличествоРазверток > 0 Тогда
				ОбластьКолонкиПоказатель = МакетОтчета.Область(НомерСтроки + 2 + ОстатокВысоты, НомерКолонки, НомерСтроки + 2 + ОстатокВысоты, НомерКолонки);
			Иначе
				ОбластьКолонкиПоказатель = МакетОтчета.Область(НомерСтроки + 1, НомерКолонки, НомерСтроки + 1, НомерКолонки);
			КонецЕсли;
			ОбластьКолонкиПоказатель.Текст                   = ТекПоказатель.Представление;
			ОбластьКолонкиПоказатель.Расшифровка             = Новый Структура("Показатель,Функция", ТекПоказатель, ТекФункция);
			ОбластьКолонкиПоказатель.ШиринаКолонки	  	     = ТекПоказатель.ШиринаКолонки;
			ОбластьКолонкиПоказатель.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			ОбластьКолонкиПоказатель.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			ОбластьКолонкиПоказатель.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ОбластьКолонкиПоказатель.ГраницаСлева            = ?(НомерПервойКолонкиФункции = НомерКолонки, ?(НомерПервойКолонкиИзмерения = 0,ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева,ГраницаМакета.Функции.ГраницаСправа), ГраницаМакета.Показатели.ГраницаСлева);
			ОбластьКолонкиПоказатель.ГраницаСверху           = ГраницаМакета.Показатели.ГраницаСверху;
			ОбластьКолонкиПоказатель.ГраницаСнизу            = ГраницаМакета.Показатели.ГраницаСнизу;
			
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
		
		Если ТекФункция.Одиночный Тогда
			Если КоличествоРазверток > 0 Тогда
				ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки + 1 + ОстатокВысоты, НомерПервойКолонкиФункции, НомерСтроки + 2 + ОстатокВысоты, НомерПервойКолонкиФункции);
			Иначе	
				ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки+1, НомерПервойКолонкиФункции);
			КонецЕсли;	
			ОбластьКолонкиФункция.ШиринаКолонки = ?(ЗначениеЗаполнено(ТекФункция.ШиринаКолонки), ТекФункция.ШиринаКолонки, 14);
			НомерКолонки = НомерКолонки+1;
		Иначе	
			ОбластьКолонкиПоказатель.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
			Если КоличествоРазверток > 0 Тогда
				ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки + 1 + ОстатокВысоты, НомерПервойКолонкиФункции, НомерСтроки + 1 + ОстатокВысоты, НомерКолонки - 1);
			Иначе	
				ОбластьКолонкиФункция = МакетОтчета.Область(НомерСтроки, НомерПервойКолонкиФункции, НомерСтроки, НомерКолонки - 1);
			КонецЕсли;	
		КонецЕсли;	
		ОбластьКолонкиФункция.Объединить();
		ОбластьКолонкиФункция.Текст                   = ТекФункция.Представление;
		ОбластьКолонкиФункция.ПараметрРасшифровки     = "Расшифровка";
		ОбластьКолонкиФункция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьКолонкиФункция.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ОбластьКолонкиФункция.РазмещениеТекста        = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		ОбластьКолонкиФункция.ГраницаСлева            = ?(НомерПервойКолонкиИзмерения = 0, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева, ГраницаМакета.Функции.ГраницаСлева);
		ОбластьКолонкиФункция.ГраницаСверху           = ГраницаМакета.Функции.ГраницаСверху;
		ОбластьКолонкиФункция.ГраницаСправа           = ГраницаМакета.Функции.ГраницаСправа;
		НомерПервойКолонкиИзмерения = НомерПервойКолонкиИзмерения+1;
	КонецЦикла;
	
	ОбластьКолонкиФункция.ГраницаСправа           = ПеремГраницаСправа;
	Если ОбластьКолонкиПоказатель<> Неопределено Тогда
		ОбластьКолонкиПоказатель.ГраницаСправа        = ПеремГраницаСправа;//ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
	КонецЕсли;
	Если КоличествоРазверток > 0 Тогда
		ОбластьКолонки = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + КоличествоРазверток, НомерКолонки - 1);
		ОбластьКолонки.Объединить();
		ОбластьКолонки.Текст                   = "Итог";
		ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
		ОбластьКолонки.ГраницаСлева        = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева;
		ОбластьКолонки.ГраницаСверху       = ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСверху;
		ОбластьКолонки.ГраницаСправа       = ПеремГраницаСправа;
	КонецЕсли;
	Если ТекПостроительОтчета.ИзмеренияКолонки.Количество() > 0 Тогда
		ОбластьПостроителя = МакетОтчета.Область(ВысотаЗаголовка + 1, НомерПервойКолонки, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерКолонки - 1);
		ОбластьПостроителя.Имя = "ЗаголовокИтогаПоСтроке";
	КонецЕсли;
	
	ОбластьШапкиТаблицы = МакетОтчета.Область(ВысотаЗаголовка + 1, 2, ВысотаЗаголовка + 2 + КоличествоРазверток, НомерКолонки - 1);
	ОбластьШапкиТаблицы.Шрифт         = ОформлениеШапки.Шрифт;
	ОбластьШапкиТаблицы.ЦветТекста    = ОформлениеШапки.ЦветТекста;
	ОбластьШапкиТаблицы.ЦветФона      = ОформлениеШапки.ЦветФона;
	//	ОбластьШапкиТаблицы.ГраницаСверху = ЛинияОбычная;
	
	НачальноеОформление = Макс(0, 8 - КоличествоУровней);
	ПараметрыИзмерения  = Новый Структура("РесурсыОтчета,ДеревоРесурсов,КоличествоУровней,КоличествоРазверток,ОбластьОформлениеИзмерений,НачальноеОформление",
	РесурсыОтчета,ДеревоРесурсов,КоличествоУровней,КоличествоРазверток,ОбластьОформлениеИзмерений,НачальноеОформление);
	
	КлючСтроки = "";
	СчетчикУровня = 1;
	НачалоОформления = Макс(0, 8 - КоличествоУровней);
	
	Для Каждого ТекИзмерение Из ТекПостроительОтчета.ИзмеренияСтроки Цикл
		КлючСтроки = "";
		Если ТекИзмерение.ТипИзмерения = ТипИзмеренияПостроителяОтчета.Иерархия Тогда
			ПараметрыИзмерения.Вставить("ЭтоИерархия", Истина);
			КлючСтрокиИерархии = ?(ПустаяСтрока(КлючСтроки), "", КлючСтроки + ?(ИспользоватьАвтоотступ, 2, СчетчикУровня + 1));
			СформироватьМакетИзмеренияСтроки(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтрокиИерархии, ГраницаМакета);
			
			СчетчикУровня = СчетчикУровня + 1;
		КонецЕсли;
		
		ПараметрыИзмерения.Вставить("ЭтоИерархия", Ложь);
		КлючСтроки = ?(ПустаяСтрока(КлючСтроки), "", КлючСтроки + ?(ИспользоватьАвтоотступ, 2, СчетчикУровня + 1));
		СформироватьМакетИзмеренияСтроки(ЭтотОбъект, ТекПостроительОтчета, МакетОтчета, ТекИзмерение, СчетчикУровня, ПараметрыИзмерения, КлючСтроки, ГраницаМакета);
		
		СчетчикУровня = СчетчикУровня + 1;
	КонецЦикла;
	НомерСтроки  = МакетОтчета.ВысотаТаблицы + 1;
	НомерКолонки = НачальныйНомерВыводаКолонок;
	Если КоличествоРазверток > 0 Тогда
		НомерКолонки = НомерКолонки + ((КоличествоРазверток - 1) * РесурсыОтчета.Количество());
	КонецЕсли;
	
	ТекДополнительныеПоляОтчета = ДополнительныеПоляОтчета.НайтиСтроки(Новый Структура("НеСвязанные", Истина));
	КоличествоДополнительныеПоляОтчета = ТекДополнительныеПоляОтчета.Количество();
	НачальныйНомерВыводаИтогов = НачальныйНомерВыводаКолонок-КоличествоДополнительныеПоляОтчета;
	
	Для ИндПоля = 0 По КоличествоДополнительныеПоляОтчета-1 Цикл
		ТекПоле = ТекДополнительныеПоляОтчета[ИндПоля];
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НачальныйНомерВыводаИтогов+ИндПоля, НомерСтроки, НачальныйНомерВыводаИтогов+ИндПоля);
		
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Если ТекПоле.ВыводитьОбщийИтог Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекПоле.Имя;
			ОбластьКолонки.Формат                  = ТекПоле.Формат;
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		
		ОбластьКолонки.ГраницаСлева  = ГраницаМакета.ИзмеренияИтог.ГраницаСлева;
		ОбластьКолонки.ГраницаСверху = ГраницаМакета.ИзмеренияИтог.ГраницаСверху;
		ОбластьКолонки.ГраницаСнизу  = ГраницаМакета.ИзмеренияИтог.ГраницаСнизу;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияИтог.ГраницаСправа;
	КонецЦикла;
	
	Попытка		
		ИспользованиеРесурсов=ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Использование.Ресурсы;
	Исключение КонецПопытки;
	
	НомерПервойКолонки = НомерКолонки;
	Для Каждого ТекРесурс Из РесурсыОтчета Цикл
		Если ПустаяСтрока(ТекРесурс) Тогда
			ОтображатьПоказатель = Ложь;
		Иначе
		Попытка    ОтображатьПоказатель = ИспользованиеРесурсов[ТекРесурс];
		Исключение ОтображатьПоказатель = Истина;
		КонецПопытки;
		КонецЕсли;
		
		ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Если ОтображатьПоказатель Тогда
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ОбластьКолонки.Параметр                = ТекРесурс;
			ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
			ОбластьКолонки.ПараметрРасшифровки     = "Расшифровка";
			ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		Иначе
			ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
			ОбластьКолонки.Текст                   = "";
			ОбластьКолонки.ПараметрРасшифровки     = "";
		КонецЕсли;
		
		ОбластьКолонки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		Если КоличествоРазверток > 0 Тогда
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, НомерКолонки + РесурсыОтчета.Количество(), НомерСтроки, НомерКолонки + РесурсыОтчета.Количество());
			ОбластьКолонки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			Если ОтображатьПоказатель Тогда
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ОбластьКолонки.Параметр                = ТекРесурс;
				ОбластьКолонки.Формат                  = СтруктураФорматаПолей[ТекРесурс];
				ОбластьКолонки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
				ОбластьКолонки.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
			Иначе
				ОбластьКолонки.Заполнение              = ТипЗаполненияОбластиТабличногоДокумента.Текст;
				ОбластьКолонки.Текст                   = "";
				ОбластьКолонки.ПараметрРасшифровки     = "";
			КонецЕсли;
		КонецЕсли;
		
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	ТекНомерКолонки = НомерПервойКолонки;
	СчетчикФункций=0;
	Для Каждого ТекФункция Из ДеревоРесурсов.Строки Цикл
		СчетчикПоказателей = 0;
		
		Если ТекФункция.Одиночный Тогда
			ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
			ОбластьКолонки.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСлева,ГраницаМакета.ФункцииИтог.ГраницаСлева);
			ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиИтог.ГраницаСверху;
			ОбластьКолонки.ГраницаСправа = ГраницаМакета.ПоказателиИтог.ГраницаСправа;
			ОбластьКолонки.ГраницаСнизу = ГраницаМакета.ПоказателиИтог.ГраницаСнизу;
			
			Если КоличествоРазверток > 0 Тогда
				ОбластьКолонкиИтога = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки + РесурсыОтчета.Количество(), НомерСтроки, ТекНомерКолонки + РесурсыОтчета.Количество());
				ОбластьКолонкиИтога.ГраницаСлева  = ?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСлева,ГраницаМакета.ФункцииИтог.ГраницаСлева);
				ОбластьКолонкиИтога.ГраницаСверху = ГраницаМакета.ПоказателиИтог.ГраницаСверху;
				ОбластьКолонкиИтога.ГраницаСправа = ГраницаМакета.ПоказателиИтог.ГраницаСправа;
				ОбластьКолонкиИтога.ГраницаСнизу = ГраницаМакета.ПоказателиИтог.ГраницаСнизу;
			КонецЕсли;
			
			ТекНомерКолонки = ТекНомерКолонки+1;
		Иначе
			Для Каждого ТекПоказатель Из ТекФункция.Строки Цикл
				ОбластьКолонки = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки, НомерСтроки, ТекНомерКолонки);
				ОбластьКолонки.ГраницаСлева  = ?(СчетчикПоказателей=0,?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСлева,ГраницаМакета.ФункцииИтог.ГраницаСлева), ГраницаМакета.ПоказателиИтог.ГраницаСлева);
				ОбластьКолонки.ГраницаСверху = ГраницаМакета.ПоказателиИтог.ГраницаСверху;
				ОбластьКолонки.ГраницаСправа = ГраницаМакета.ПоказателиИтог.ГраницаСправа;
				ОбластьКолонки.ГраницаСнизу = ГраницаМакета.ПоказателиИтог.ГраницаСнизу;
				
				Если КоличествоРазверток > 0 Тогда
					ОбластьКолонкиИтога = МакетОтчета.Область(НомерСтроки, ТекНомерКолонки + РесурсыОтчета.Количество(), НомерСтроки, ТекНомерКолонки + РесурсыОтчета.Количество());
					ОбластьКолонкиИтога.ГраницаСлева  = ?(СчетчикПоказателей=0,?(СчетчикФункций=0,ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСлева,ГраницаМакета.ФункцииИтог.ГраницаСлева), ГраницаМакета.ПоказателиИтог.ГраницаСлева);
					ОбластьКолонкиИтога.ГраницаСверху = ГраницаМакета.ПоказателиИтог.ГраницаСверху;
					ОбластьКолонкиИтога.ГраницаСправа = ГраницаМакета.ПоказателиИтог.ГраницаСправа;
					ОбластьКолонкиИтога.ГраницаСнизу = ГраницаМакета.ПоказателиИтог.ГраницаСнизу;
				КонецЕсли;
				
				ТекНомерКолонки = ТекНомерКолонки+1;
				СчетчикПоказателей = СчетчикПоказателей+1;
			КонецЦикла;
		КонецЕсли;
		СчетчикФункций=СчетчикФункций+1;
		ОбластьКолонки.ГраницаСправа = ГраницаМакета.ФункцииИтог.ГраницаСправа;
	КонецЦикла;
	ОбластьКолонки.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСправа;
	
	Если КоличествоРазверток > 0 Тогда
		ОбластьКолонкиИтога.ГраницаСправа = ГраницаМакета.ИзмеренияПоГоризонталиИтог.ГраницаСправа;
		ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки, НомерСтроки, НомерКолонки - 1);
		ОбластьПостроителя.Имя = "РесурсыИтогПоКолонке";
		
		ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, НомерПервойКолонки + РесурсыОтчета.Количество(), НомерСтроки, НомерКолонки - 1 + РесурсыОтчета.Количество());
	Иначе
		ОбластьПостроителя = МакетОтчета.Область("R" + НомерСтроки);
	КонецЕсли;
	ОбластьПостроителя.Имя = "ОбщиеИтоги";
	ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НачальныйНомерВыводаИтогов - 1);
	ОбластьПостроителя.Объединить();
	ОбластьПостроителя.Текст                   = ПараметрыИспользованияПолейИПоказателей.ОбщийИтог.Представление; //"Итог";
	ОбластьПостроителя.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	ОбластьПостроителя.ВертикальноеПоложение   = ВертикальноеПоложение.Центр;
	ОбластьПостроителя.ГраницаСлева  = ГраницаМакета.ИзмеренияИтог.ГраницаСлева;
	ОбластьПостроителя.ГраницаСверху = ГраницаМакета.ИзмеренияИтог.ГраницаСверху;
	ОбластьПостроителя.ГраницаСнизу  = ГраницаМакета.ИзмеренияИтог.ГраницаСнизу;
	ОбластьПостроителя.ГраницаСправа = ГраницаМакета.ИзмеренияИтог.ГраницаСправа;
	
	Если КоличествоРазверток > 0 Тогда
		ОбластьПостроителя = МакетОтчета.Область(НомерСтроки, 1, НомерСтроки, НачальныйНомерВыводаКолонок - 1);
		ОбластьПостроителя.Имя = "ЗаголовокИтогаПоКолонке";
	КонецЕсли;
	
	ОбластьПодвалаТаблицы = МакетОтчета.Область(НомерСтроки, 2, НомерСтроки, НомерКолонки - 1 + ?(КоличествоРазверток > 0, РесурсыОтчета.Количество(), 0));
	ОбластьПодвалаТаблицы.Шрифт         = ОформлениеИтоги.Шрифт;
	ОбластьПодвалаТаблицы.ЦветТекста    = ОформлениеИтоги.ЦветТекста;
	ОбластьПодвалаТаблицы.ЦветФона      = ОформлениеИтоги.ЦветФона;
	
	ОбластьПостроителя = МакетОтчета.Область("R" + (МакетОтчета.ВысотаТаблицы + 1));
	ОбластьПостроителя.Имя = "ПодвалТаблицы";
	
	ОбластьПостроителя = МакетОтчета.Область("R" + (МакетОтчета.ВысотаТаблицы + 1));
	ОбластьПостроителя.Имя = "Подвал";
	
	ОбластьПостроителя = МакетОтчета.Область("R1:R" + (ВысотаЗаголовка + КоличествоРазверток + 2));
	ОбластьПостроителя.Имя = "ФиксированныеСтроки";    
	
	ОбластьПостроителя = МакетОтчета.Область("C1:C" + (НачальныйНомерВыводаКолонок - ?(ВыводитьДополнительныеПоляВОтдельнойКолонке, ДополнительныеПоляОтчета.Количество(), КоличествоДополнительныеПоляОтчета) - 1));
	ОбластьПостроителя.Имя = "ФиксированныеКолонки";
	
	Для к = 1 по ВысотаЗаголовка Цикл
		ТекОбласть = МакетОтчета.Область(к, 2, к, МакетОтчета.ШиринаТаблицы);
		ТекОбласть.ПоВыделеннымКолонкам = Истина;
		ТекОбласть.РазмещениеТекста     = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции	//	ПолучитьМакетПостроителя()

// корректировка таблицы заголовка
Процедура ОбработкаТаблицыЗаголовка(ТаблицаЗаголовка) Экспорт 
	
	СтрокаПоиска = ТаблицаЗаголовка.Найти("Отбор", "ИмяСтроки");
	ИндексВставки = ТаблицаЗаголовка.Индекс(СтрокаПоиска);
	
	Если ВыводитьОтборТипаЦен Тогда
		НоваяСтрока = ТаблицаЗаголовка.Вставить(ИндексВставки);
		НоваяСтрока.ИмяСтроки = "ТипЦен";
		НоваяСтрока.Текст = "Тип цен: "+СокрЛП(ТипЦенПоУмолчанию);
		НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
		НоваяСтрока.Шрифт = Новый Шрифт(СтрокаПоиска.Шрифт,, 10, Истина);
	КонецЕсли;
	
	Если ВыводитьОтборПодразделение Тогда
		НоваяСтрока = ТаблицаЗаголовка.Вставить(ИндексВставки);
		НоваяСтрока.ИмяСтроки = "Подразделение";
		НоваяСтрока.Текст = "Подразделение: "+СокрЛП(Подразделение);
		НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
		НоваяСтрока.Шрифт = Новый Шрифт(СтрокаПоиска.Шрифт,, 10, Истина);
	КонецЕсли;
	
	Если ВыводитьОтборКонтрагента Тогда
		НоваяСтрока = ТаблицаЗаголовка.Вставить(ИндексВставки);
		НоваяСтрока.ИмяСтроки = "Контрагент";
		НоваяСтрока.Текст = "Контрагент: Собственные цены";
		НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
		НоваяСтрока.Шрифт = Новый Шрифт(СтрокаПоиска.Шрифт,, 10, Истина);
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//ИмяРегистра = "ОстаткиТоваровКомпании";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли