Функция НайтиЭлементПоНаименованию(Наименование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_TiresModels.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_TiresModels КАК ns_TiresModels
	|ГДЕ
	|	ns_TiresModels.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование", Наименование);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 	
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
КонецФункции
 