Перем Копирование Экспорт;

Процедура ПередЗаписью(Отказ)
	
	Если Автор.Пустая() Тогда
		Автор = ПараметрыСеанса.Пользователь;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
	Если не СвободныйПроверитьID() Тогда
		
		Отказ = истина;
		Сообщить("Указанный ID в показателе, занят другим показателем");
		
	КонецЕсли;
	
	Если не ПроверитьСортировочныйНомер() Тогда
		
		Отказ = истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСортировочныйНомер() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_Показатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БТ_Показатели КАК БТ_Показатели
		|ГДЕ
		|	БТ_Показатели.сортировка = &сортировка
		|	И БТ_Показатели.Ссылка <> &Ссылка
		|	И БТ_Показатели.НаправлениеДеятельности = &НаправлениеДеятельности";
	
	Запрос.УстановитьПараметр("сортировка", сортировка);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Сообщить("Сортирочный номер занят показателем: "+Выборка.Ссылка);
		
	КонецЕсли;
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Функция СвободныйПроверитьID() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_Показатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БТ_Показатели КАК БТ_Показатели
		|ГДЕ
		|	БТ_Показатели.ID = &ID
		|	И БТ_Показатели.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ID", ID);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Сообщить("ID показателя занят показателем: "+Выборка.Ссылка);
		
	КонецЕсли;
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Копирование=истина;
КонецПроцедуры

Копирование=ложь;