
// Заполняет предопределенные элементы(если они не существуют - создает новые(не предопределенные!))
// при обновлении релиза
// Флаг ЗаполнятьВсе=Истина - перезаполняет уже существующие элементы(строгое заполнение)
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	Перем ИмяТехПоддержки;     // Имя тех. поддержки
	Перем ИмяНовостейРаруса;   // Имя новостей раруса
	ИмяТехПоддержки   = "Техподдержка";
	ИмяНовостейРаруса = "Новости о продукте";
	
	// Заполнение учетной записи "Новости о продукте".
	Объект = Справочники.УчетныеЗаписиЭлектроннойПочты.Новости.ПолучитьОбъект();
	Объект.ЭтоУчетнаяЗаписьНовостей = Истина;
	Объект.Наименование             = ИмяНовостейРаруса;
	Объект.АдресЭлектроннойПочты    = элСформироватьАдресНаНовостнойПотокПродукта(); 
	Объект.ОбщийДоступ              = Истина;
	Объект.АвтоматическаяУстановкаПометкиРассмотрено = Истина;
	Объект.ИнтервалАвтоматическойУстановкиОтметкиРассмотрено = 3;
	
	// Добавим текущего пользователя в качестве администратора.
	ТекущийПользователь = ПараметрыСеанса.Пользователь;
	Если Объект.Пользователи.Найти(ТекущийПользователь, "Пользователь")=Неопределено Тогда
		НовыйПользователь = Объект.Пользователи.Добавить();
		НовыйПользователь.Пользователь      = ТекущийПользователь;
		НовыйПользователь.Администрирование = Истина;
	КонецЕсли;
	Объект.Записать();
	Объект.СоздатьПапкиУчетнойЗаписиПоУмолчанию(Объект);
	
	// Заполнение учетной записи "Техподдержка".
	Объект = Справочники.УчетныеЗаписиЭлектроннойПочты.Поддержка.ПолучитьОбъект();
	Объект.ЭтоУчетнаяЗаписьНовостей = Ложь;
	Объект.Наименование             = ИмяТехПоддержки;
	Объект.ОбщийДоступ              = Истина;
	Объект.АвтоматическаяУстановкаПометкиРассмотрено = Истина; 
	Объект.ИнтервалАвтоматическойУстановкиОтметкиРассмотрено = 3;  
	
	// Добавим текущего пользователя в качестве администратора.
	ТекущийПользователь = ПараметрыСеанса.Пользователь;
	Если Объект.Пользователи.Найти(ТекущийПользователь, "Пользователь")=Неопределено Тогда
		НовыйПользователь = Объект.Пользователи.Добавить();
		НовыйПользователь.Пользователь      = ТекущийПользователь;
		НовыйПользователь.Администрирование = Истина;
	КонецЕсли;

	Объект.Записать();  
	Объект.СоздатьПапкиУчетнойЗаписиПоУмолчанию(Объект);
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
