Процедура ЗагрузитьНСИ() Экспорт
	Загрузить_DisplayAreas();
	Загрузить_TiresModels();
КонецПроцедуры

Процедура Загрузить_DisplayAreas()

	Попытка
		Каталог = КаталогВременныхФайлов();

		HTTPСоединение = Новый HTTPСоединение("autoload.avito.ru",,,,, 30, Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос = Новый HTTPЗапрос("format/DisplayAreas.xml");
		
		ИмяФайлаXML = Каталог + "DisplayAreas.xml";
		
		Результат = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос, ИмяФайлаXML);
		Если НЕ Результат.КодСостояния = 200 Тогда
			РегистрыСведений.ns_ЖурналАвито.ЗаписатьОшибкуВЖурнал(Перечисления.ns_ВидыСобытийЖурнала.ОшибкаОбращенияКСерверу, Результат.ПолучитьТелоКакСтроку());
			ВызватьИсключение "";
		КонецЕсли;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаXML);
		
		СписокDisplayAreas = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		
		Если ТипЗнч(СписокDisplayAreas.Area) = Тип("СписокXDTO") Тогда		
			ТекущиеДанные = ПолучитьТекущиеДанные_DisplayAreas();
			Попытка
				Для каждого Area Из СписокDisplayAreas.Area Цикл
					Данные = ОбработатьXDTO("ns_DisplayAreas", Area, ТекущиеДанные);
				КонецЦикла; 	
				ns_ОбщегоНазначения.СообщениеПользователю("Загружен справочник DisplayAreas");
			Исключение
			    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
	Исключение
		ns_ОбщегоНазначения.СообщениеПользователю("Не могу загрузить справочник DisplayAreas. Проверьте интернет соединение");
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТекущиеДанные_DisplayAreas()
	ТекущиеДанные = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	DisplayAreas.Ссылка КАК Ссылка,
	|	DisplayAreas.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ns_DisplayAreas КАК DisplayAreas";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекущиеДанные;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущиеДанные.Вставить(Выборка.Наименование, Выборка.Ссылка);	
	КонецЦикла; 	

	Возврат ТекущиеДанные;
КонецФункции

Функция ОбработатьXDTO(ИмяСправочника, Данные, ТекущиеДанные)
	НайденныйЭлемент = ТекущиеДанные[Данные];
	Если НайденныйЭлемент = Неопределено Тогда
		НайденныйЭлемент = СоздатьОбновитьЭлемент(ИмяСправочника, Данные);
	Иначе
		НайденныйЭлемент = СоздатьОбновитьЭлемент(ИмяСправочника, Данные, НайденныйЭлемент);
	КонецЕсли;
	
	Возврат НайденныйЭлемент;
КонецФункции

Функция СоздатьОбновитьЭлемент(ИмяСправочника, Данные, Ссылка = Неопределено)
	Если Ссылка = Неопределено Тогда
		ТекущийЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
	Иначе
		ТекущийЭлемент = Ссылка.ПолучитьОбъект();
	КонецЕсли; 
	ТекущийЭлемент.Наименование = Данные;
	ТекущийЭлемент.Записать();
	
	Возврат ТекущийЭлемент.Ссылка;
КонецФункции

Процедура Загрузить_TiresModels()

	Попытка
		Каталог = КаталогВременныхФайлов();

		HTTPСоединение = Новый HTTPСоединение("autoload.avito.ru",,,,, 30, Новый ЗащищенноеСоединениеOpenSSL);
		HTTPЗапрос = Новый HTTPЗапрос("format/TiresModels.xml");
		
		ИмяФайлаXML = Каталог + "TiresModels.xml";
		
		Результат = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос, ИмяФайлаXML);
		Если НЕ Результат.КодСостояния = 200 Тогда
			РегистрыСведений.ns_ЖурналАвито.ЗаписатьОшибкуВЖурнал(Перечисления.ns_ВидыСобытийЖурнала.ОшибкаОбращенияКСерверу, Результат.ПолучитьТелоКакСтроку());
			ВызватьИсключение "";
		КонецЕсли;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяФайлаXML);
		
		СписокTiresModels = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		
		Если ТипЗнч(СписокTiresModels.Model) = Тип("СписокXDTO") Тогда		
			ТекущиеДанные = ПолучитьТекущиеДанные_TiresModels();
			Попытка
				Для каждого Model Из СписокTiresModels.Model Цикл
					Данные = ОбработатьXDTO("ns_TiresModels", Model.name, ТекущиеДанные);
				КонецЦикла; 	
				ns_ОбщегоНазначения.СообщениеПользователю("Загружен справочник TiresModels");
			Исключение
			    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли;
		
		ЧтениеXML.Закрыть();
	Исключение
		ns_ОбщегоНазначения.СообщениеПользователю("Не могу загрузить справочник TiresModels. Проверьте интернет соединение");
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьТекущиеДанные_TiresModels()
	ТекущиеДанные = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_TiresModels.Ссылка КАК Ссылка,
	|	ns_TiresModels.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ns_TiresModels КАК ns_TiresModels";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТекущиеДанные;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекущиеДанные.Вставить(Выборка.Наименование, Выборка.Ссылка);	
	КонецЦикла; 	

	Возврат ТекущиеДанные;
КонецФункции
