
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Отказ=истина;
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Для Каждого ТекСтр из  ПерсональныеПоказатели Цикл
			
			Если ТипЗнч(ТекСтр.Показатель)=Тип("СправочникСсылка.ПоказателиДляРасчетаМотивации") Тогда
				Пок=УзнатьПоказатель(текСтр.Показатель);
			Иначе
				Пок=ТекСтр.Показатель;
			КонецЕсли;
			
			Если Пок=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Сотрудники.Сортировать("Сотрудник");
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ОтражениеФактическихЗначенийKPI.Ссылка
		|ИЗ                                             
		|	Документ.ОтражениеФактическихЗначенийKPI КАК ОтражениеФактическихЗначенийKPI
		|ГДЕ
		|	ОтражениеФактическихЗначенийKPI.Ссылка <> &Ссылка
		|	И ОтражениеФактическихЗначенийKPI.Периодичность = &Периодичность
		|	И ОтражениеФактическихЗначенийKPI.ПериодПланирования = &ПериодПланирования
		|	И ОтражениеФактическихЗначенийKPI.ВидОперации = &ВидОперации
		|	И ОтражениеФактическихЗначенийKPI.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И НЕ ОтражениеФактическихЗначенийKPI.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ПериодПланирования",ЭтотОбъект.ПериодПланирования);
		Запрос.УстановитьПараметр("Периодичность",ЭтотОбъект.Периодичность);
		Запрос.УстановитьПараметр("ВидОперации",ЭтотОбъект.ВидОперации);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ЭтотОбъект.ПодразделениеКомпании);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			Сообщить("В этот период уже есть аналогичный документ "+Выб.Ссылка);
			Отказ=истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УзнатьПоказатель(Эл)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	KPIПоказателиДляРасчета.Ссылка
	|ИЗ
	|	Справочник.KPI.ПоказателиДляРасчета КАК KPIПоказателиДляРасчета
	|ГДЕ
	|	KPIПоказателиДляРасчета.Показатель = &Показатель
	|	И KPIПоказателиДляРасчета.Ссылка.ИмеетПереодическоеОписание
	|	И KPIПоказателиДляРасчета.Ссылка.ПодразделениеКомпании = &Подразделение");
	
	Запрос.УстановитьПараметр("Показатель", Эл);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Возврат Выб.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
    // регистр ФактическиеЗначенияKPI
	Если ПустаяСтрока(ЭтотОбъект.ПодразделениеКомпании) Тогда
		Отказ=истина;
		Сообщить("Не заполнено подразделение компании");
		Возврат;
	КонецЕсли;
	
	дат = НачалоМесяца(ТекущаяДата()-86400*5);
	дат = ?(Дат < НачалоКвартала(Дата), НачалоКвартала(Дата),Дат);
	Дат = ?(Дат < КонецКвартала(Дата) И КонецМесяца(Дат) > КонецКвартала(Дата),НачалоМесяца(КонецКвартала(Дата)),Дат);
	
	Движения.ФактическиеЗначенияKPI.Записывать = Истина;
	Движения.ФактическиеЗначенияKPI.Очистить();
	
	Для Каждого ТекСтрокаФактKPI Из ПерсональныеПоказатели Цикл
		
			Движение = Движения.ФактическиеЗначенияKPI.Добавить();
			Движение.Период = ПериодПланирования;
			Движение.Сотрудник = ТекСтрокаФактKPI.Сотрудник;
			Движение.Должность = ТекСтрокаФактKPI.Сотрудник.Должность;
			Движение.KPI = ТекСтрокаФактKPI.Показатель;
			Движение.Организация = Организация;
			
			Если ТипЗнч(ТекСтрокаФактKPI.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
				Движение.Периодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
				ДПериодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
			Иначе
				Движение.Периодичность = Периодичность;
				ДПериодичность = Периодичность;
			КонецЕсли;
			Движение.Факт = ТекСтрокаФактKPI.Факт;
			Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		КонецЦикла;
		
		Для Каждого ТекСтрокаФактKPI Из ОбщиеПоказатели Цикл
			
			Движение = Движения.ФактическиеЗначенияKPI.Добавить();
			Движение.Период = ПериодПланирования;
			Движение.Сотрудник = "";
			Движение.KPI = ТекСтрокаФактKPI.Показатель;
			Движение.Организация = Организация;
			
			Если ТипЗнч(ТекСтрокаФактKPI.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
				Движение.Периодичность = ТекСтрокаФактKPI.Показатель.Периодичность;
			Иначе
				Движение.Периодичность = Периодичность;
			КонецЕсли;
			
			Движение.Факт = ТекСтрокаФактKPI.Факт;
			Движение.ПодразделениеКомпании=ПодразделениеКомпании;
			
		КонецЦикла;
	
КонецПроцедуры

