
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеНастройки = Константы.CMExpertНастройки.Получить().Получить();
	Если ЗначениеЗаполнено(ДанныеНастройки) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ДанныеНастройки = Новый Структура("ДатаПоследнейВыгрузки, ИдентификаторДилера, Логин, Пароль");
	ЗаполнитьЗначенияСвойств(ДанныеНастройки, ЭтаФорма);
	
	Константы.CMExpertНастройки.Установить(Новый ХранилищеЗначения(ДанныеНастройки));
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	лОбъект = РеквизитФормыВЗначение("Объект");
	лОбъект.ВыгрузитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры
