// Модуль менеджера документа "Заказ на автомобиль"

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Получение списка подчиненных заказ-нарядов и заявок на ремонт
//
Процедура ПолучитьПодчиненныеЗаказНаряды(СсылкаУзла, Строки, ВидРемонта=Неопределено, Автомобиль = Неопределено) Экспорт
	Если СсылкаУзла.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			 |	ПодчиненныеДокументы.Ссылка КАК ЗаказНаряд,
	//			 |	ВЫБОР 
	//			 |		КОГДА ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ЗаявкаНаРемонт ТОГДА 
	//			 |			""ЗнР""
	//			 |		ИНАЧЕ
	//			 |			""ЗН""
	//			 |	КОНЕЦ КАК ЗаказНарядНазвание,
	//			 |	ПодчиненныеДокументы.Ссылка.Номер КАК ЗаказНарядНомер,
	//			 |	ПодчиненныеДокументы.Ссылка.Дата КАК ЗаказНарядДата,
	//			 |	ПодчиненныеДокументы.Ссылка.ВидРемонта КАК ВидРемонта,
	//			 |	ЕСТЬNULL(ПодчиненныеДокументы.Ссылка.Состояние,ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ПустаяСсылка)) КАК Состояние,
	//			 |	ПодчиненныеДокументы.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	//			 |	ПодчиненныеДокументы.Ссылка.Проведен КАК Проведен
	//			 |ИЗ
	//			 |	КритерийОтбора.ПодчиненныеДокументы(&ДокументОснование) КАК ПодчиненныеДокументы
	//			 |ГДЕ
	//			 |	(ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ЗаявкаНаРемонт
	//			 |			ИЛИ ПодчиненныеДокументы.Ссылка ССЫЛКА Документ.ЗаказНаряд)
	//			 |
	//			 |УПОРЯДОЧИТЬ ПО
	//			 |	ПодчиненныеДокументы.Ссылка.Дата";
				 
				 
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Документ.Ссылка КАК Ссылка,
	             |	""Заявка на ремонт"" КАК Название,
	             |	Документ.Номер КАК Номер,
	             |	Документ.Дата КАК Дата,
	             |	Документ.ВидРемонта КАК ВидРемонта,
	             |	ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.ПустаяСсылка) КАК Состояние,
	             |	Документ.ПометкаУдаления КАК ПометкаУдаления,
	             |	Документ.Проведен КАК Проведен
	             |ИЗ
	             |	Документ.ЗаявкаНаРемонт КАК Документ
	             |ГДЕ
	             |	&УсловиеПоАвтомобилю
	             |	И &УсловиеПоОснованию
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Документ.Ссылка,
	             |	""Заказ-наряд"",
	             |	Документ.Номер,
	             |	Документ.Дата,
	             |	Документ.ВидРемонта,
	             |	Документ.Состояние,
	             |	Документ.ПометкаУдаления,
	             |	Документ.Проведен
	             |ИЗ
	             |	Документ.ЗаказНаряд КАК Документ
	             |ГДЕ
	             |	&УсловиеПоАвтомобилю
	             |	И &УсловиеПоОснованию
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Дата,
	             |	Номер";
				 
	Если ЗначениеЗаполнено(СсылкаУзла) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоАвтомобилю","Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоОснованию","Документ.ДокументОснование = &ДокументОснование");
		Запрос.УстановитьПараметр("ДокументОснование",СсылкаУзла);
	ИначеЕсли ЗначениеЗаполнено(Автомобиль) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоАвтомобилю","Документ.Автомобиль = &Автомобиль");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеПоОснованию","Истина");
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
	Иначе
		Возврат;
	КонецЕсли;
				 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока=Неопределено;
		Если обЗначениеНеЗаполнено(ВидРемонта) ИЛИ Выборка.ВидРемонта=ВидРемонта Тогда
			НоваяСтрока=Строки.Добавить();
			НоваяСтрока.Ссылка = Выборка.Ссылка;
			Текст = Выборка.Название+" № "+Выборка.Номер+" от "+Формат(Выборка.Дата,"ДФ=dd.MM.yy");
			Текст = Текст + " (вид ремонта: " + Выборка.ВидРемонта + ?(Выборка.Состояние=Справочники.ВидыСостоянийЗаказНарядов.ПустаяСсылка(), ")", ", состояние: "+Выборка.Состояние+")");
			НоваяСтрока.Представление = Текст;
			НоваяСтрока.Картинка=12+?(Выборка.Проведен,1,0)+?(Выборка.ПометкаУдаления,3,0);
		КонецЕсли; 
		ПолучитьПодчиненныеЗаказНаряды(Выборка.Ссылка,?(НоваяСтрока=Неопределено,Строки,НоваяСтрока.Строки), ВидРемонта);
	КонецЦикла; 
КонецПроцедуры // ПолучитьПодчиненныеЗаказНаряды() 

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ЗаказНаАвтомобиль" , "Заказ на автомобиль");
	
	//bizteh++26022021
	//СтруктураМакетов.Вставить("ДоговорПродажи"    , "Договор продажи");
	//bizteh--26022021
	
	СтруктураМакетов.Вставить("АктПриема"         , "Акт осмотра автомобиля с пробегом");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти
