
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("Автор");
	СтруктураСвойств.Вставить("Источник");
	СтруктураСвойств.Вставить("Причина");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	//ПоказательАвтомобиля=Неопределено;
	//Если ПараметрыИспользованияПолейИПоказателей.Свойство("Автомобиль",ПоказательАвтомобиля) Тогда
	//	ПоказательГодВыпуска=Неопределено;
	//	Если ПоказательАвтомобиля.Поля.Свойство("ГодВыпуска",ПоказательГодВыпуска) Тогда
	//		ФорматПредставленияГодаВыпускаАвтомобиля=орПолучитьФорматПредставленияГодаВыпускаАвтомобиля();
	//		ПоказательГодВыпуска.Формат=ФорматПредставленияГодаВыпускаАвтомобиля;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры