Функция ЗаполнитьКалендарь() Экспорт
	
	ДатаНачалаРаботыСистемы = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ДатаНачалаРасчетаПоказателей");
	
	Если ДатаНачалаРаботыСистемы = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СпрКалендарь = Справочники.БТ_СписокКонстантныхЗначений.НайтиПоНаименованию("ССП_КалендарьРаботы");
	      
	Если СпрКалендарь.Пустая() Тогда
		
		СпрКалендарь = Справочники.БТ_СписокКонстантныхЗначений.СоздатьЭлемент();
		СпрКалендарь.УстановитьНовыйКод();
		СпрКалендарь.Наименование = "ССП_КалендарьРаботы";
		
	Иначе
		
		СпрКалендарь = СпрКалендарь.ПолучитьОбъект();
		
	КонецЕсли;
		
	ТаблицаДанных = СпрКалендарь.ТаблицаДанных;
	
	Дата = ДатаНачалаРаботыСистемы;
	Пока Дата <= ТекущаяДата() Цикл
		
		Если ТаблицаДанных.Найти(дата,"Значение") = Неопределено Тогда
			
			ТаблицаДанных.Добавить().Значение = Дата;
			
		КонецЕсли;
		
		Дата = Дата + 86400;
		
	КонецЦикла;
	
	Если СпрКалендарь.Модифицированность() тогда
		
		СпрКалендарь.Записать();
		
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьТекстЗапросаПересчета()
	Возврат "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация
	|ПОМЕСТИТЬ СписокОрганизаций
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(БТ_КонстантныеЗначения.Значение КАК ДАТА) КАК Дата
	|ПОМЕСТИТЬ ДатаНачалаРасчетаПоказателей
	|ИЗ
	|	РегистрСведений.БТ_КонстантныеЗначения КАК БТ_КонстантныеЗначения
	|ГДЕ
	|	БТ_КонстантныеЗначения.Параметр = ""ДатаНачалаРасчетаПоказателей""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	|ПОМЕСТИТЬ ДатыРасчета
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	|		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение >= ДатаНачалаРасчетаПоказателей.Дата
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_КалендарьРаботы""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка КАК Показатель,
	|	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата) КАК Дата,
	|	СписокОрганизаций.Организация КАК Организация,
	|	БТ_ИзменениеМетаданных.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ПоказательСДатой
	|ИЗ
	|	Справочник.БТ_Показатели.ЗависимостьОтМетаданных КАК БТ_ПоказателиЗависимостьОтМетаданных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДатыРасчета КАК ДатыРасчета
	|			ПО БТ_ИзменениеМетаданных.ДатаИзменения <= ДатыРасчета.Дата
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокОрганизаций КАК СписокОрганизаций
	|			ПО БТ_ИзменениеМетаданных.Организация = СписокОрганизаций.Организация
	|		ПО БТ_ПоказателиЗависимостьОтМетаданных.Документ = БТ_ИзменениеМетаданных.Метаданные
	|ГДЕ
	|	(НЕ БТ_ИзменениеМетаданных.Учтено
	|			ИЛИ БТ_ИзменениеМетаданных.Учтено ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка,
	|	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата),
	|	СписокОрганизаций.Организация,
	|	БТ_ИзменениеМетаданных.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказательСДатой.Показатель.ПериодичностьРасчетов КАК ПериодичностьРасчетов,
	|	ВЫБОР
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	|			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	|		ИНАЧЕ ПоказательСДатой.Дата
	|	КОНЕЦ КАК ДатаНачалаРасчета,
	|	ВЫБОР
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	|		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	|			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	|		ИНАЧЕ ПоказательСДатой.Дата
	|	КОНЕЦ КАК ДатаОкончанияРасчета,
	|	ПоказательСДатой.Показатель КАК Ссылка,
	|	ПоказательСДатой.Организация КАК Организация,
	|	ПоказательСДатой.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ СписокПоказателейПересчета
	|ИЗ
	|	ПоказательСДатой КАК ПоказательСДатой
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
	|		ПО ПоказательСДатой.Показатель = БТ_Показатели.Ссылка
	|ГДЕ
	|	НЕ БТ_Показатели.ПометкаУдаления
	|	И БТ_Показатели.Включен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПоказателейПересчета.Ссылка КАК Показатель,
	|	СписокПоказателейПересчета.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	|	СписокПоказателейПересчета.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	|	СписокПоказателейПересчета.Организация КАК Организация,
	|	СписокПоказателейПересчета.Организация КАК Организация1,
	|	СписокПоказателейПересчета.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	СписокПоказателейПересчета КАК СписокПоказателейПересчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СписокПоказателейПересчета.Ссылка,
	|	СписокПоказателейПересчета.ДатаНачалаРасчета,
	|	СписокПоказателейПересчета.ДатаОкончанияРасчета,
	|	СписокПоказателейПересчета.Организация,
	|	СписокПоказателейПересчета.Подразделение,
	|	СписокПоказателейПересчета.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Показатель КАК Показатель,
	|	Итог.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	|	Итог.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	|	Итог.ДатаОкончанияРасчета КАК Период,
	|	Итог.Организация КАК Организация,
	|	Итог.Показатель.ЗначениеПоказателя КАК ЗначениеПоказателя,
	|	Итог.Показатель.РучнойПоказатель КАК РучнойПоказатель,
	|	Итог.Показатель.НовыйРасчетСПодразделениями КАК НовыйРасчетСПодразделениями,
	|	Итог.Подразделение КАК Подразделение
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	НЕ Итог.Показатель.РучнойПоказатель
	|	И Итог.ДатаОкончанияРасчета < &Дата2"	
КонецФункции	

Процедура ПересчетПоказателейФоново() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП,
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"
		|ИТОГИ ПО
		|	БТ_НазваниеДляССП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответсвиеПодразделенийДляРасчета = новый Соответствие;
	
	ВыборкаБТ_НазваниеДляССП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаБТ_НазваниеДляССП.Сбросить();
	Пока ВыборкаБТ_НазваниеДляССП.Следующий() Цикл
		// Вставить обработку выборки ВыборкаБТ_НазваниеДляССП
	
		ВыборкаДетальныеЗаписи = ВыборкаБТ_НазваниеДляССП.Выбрать();
	    СписокПодразделений = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокПодразделений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		СоответсвиеПодразделенийДляРасчета.Вставить(ВыборкаБТ_НазваниеДляССП.БТ_НазваниеДляССП, СписокПодразделений);
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПересчета();
	Запрос.УстановитьПараметр("Дата2", НачалоДня(ТекущаяДата()-86400));  
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()-86400));  
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Сжатие = Новый СжатиеДанных(9);
	
	Для Каждого ТекПодразделение из СоответсвиеПодразделенийДляРасчета Цикл
		
		Для Каждого ПодразделениеЭлемент Из ТекПодразделение.Значение Цикл
			
			Подразделение = ПодразделениеЭлемент.Значение;
			
			МасСтрок = РезультатЗапроса.НайтиСтроки(Новый Структура("Подразделение", Подразделение));
			РезультатЗапросаПоПодразделению = РезультатЗапроса.Скопировать(МасСтрок);
			
			Ном = 0;
			МассивФоновыхЗаданий = Новый Массив;	
			
			Для Каждого Выборка Из РезультатЗапросаПоПодразделению Цикл
				
				Параметры = Новый Структура;
				Для каждого ТекКолонка из РезультатЗапроса.Колонки Цикл
					
					Параметры.Вставить(ТекКолонка.Имя, Выборка[ТекКолонка.Имя]);
					
				КонецЦикла;
				
				Ном = Ном + 1;
			
				УИД = Новый УникальныйИдентификатор;  ;
				МассивПараметров = Новый Массив;
				МассивПараметров.Добавить(Параметры); 
				МассивПараметров.Добавить(ТекПодразделение.Значение); 
				МассивПараметров.Добавить(ТекПодразделение.Ключ); 
				МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("БТ_РасчетПоказателей.РасчитатьИЗаписьПоказатель",МассивПараметров,УИД));
				
				Если Ном%6=0 Тогда		
					ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "ВыгрузкаССП");
					МассивФоновыхЗаданий.Очистить();
				КонецЕсли;

				Если МассивФоновыхЗаданий.Количество()>0 Тогда
					ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "СформироватьАрхивПоКРСводная");
					МассивФоновыхЗаданий.Очистить();
				КонецЕсли;

				
			КонецЦикла;	
		КонецЦикла;	
		
	КонецЦикла;
	
	ЗафиксироватьИзменения();
		
	ВыгрузитьДанные();
	
КонецПроцедуры	

Процедура ПроизвестиРасчетПоказателейФоново(ДатаРасчета = Неопределено,ПолныйРасчет = Ложь, Показатель = Неопределено, Ежедневный = Ложь, СВыгрузкой = Ложь, СписокОрганизацийФильтр = Неопределено, СписокПодразделенийФильтр = Неопределено, БезКалендаря = Ложь, ТолькоВыбраннаяДата = Ложь) Экспорт
	
	Если Не БезКалендаря Тогда
		Если не ЗаполнитьКалендарь() Тогда
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;	
	
	Если ДатаРасчета = Неопределено Тогда
		
		ДатаРасчета = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП,
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"
		|	И (ПодразделенияКомпании.БТ_НазваниеДляССП В (&БТ_НазваниеДляССП)
		|			ИЛИ &ВсеПодразделения)
		|ИТОГИ ПО
		|	БТ_НазваниеДляССП";
	
	Если СписокПодразделенийФильтр = Неопределено Тогда
		СписокПодразделенийФильтр = Новый Массив;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("БТ_НазваниеДляССП", СписокПодразделенийФильтр);
	Запрос.УстановитьПараметр("ВсеПодразделения", СписокПодразделенийФильтр.Количество() = 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответсвиеПодразделенийДляРасчета = новый Соответствие;
	
	ВыборкаБТ_НазваниеДляССП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаБТ_НазваниеДляССП.Сбросить();
	Пока ВыборкаБТ_НазваниеДляССП.Следующий() Цикл
		// Вставить обработку выборки ВыборкаБТ_НазваниеДляССП
	
		ВыборкаДетальныеЗаписи = ВыборкаБТ_НазваниеДляССП.Выбрать();
	    СписокПодразделений = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокПодразделений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		СоответсвиеПодразделенийДляРасчета.Вставить(ВыборкаБТ_НазваниеДляССП.БТ_НазваниеДляССП, СписокПодразделений);
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоказательРасчета();
	Запрос.УстановитьПараметр("ТекДата",ДатаРасчета);  
	Запрос.УстановитьПараметр("ПолныйРасчет",ПолныйРасчет);
	Запрос.УстановитьПараметр("СчитатьВЛюбомСлучае", ТолькоВыбраннаяДата);
	
	КоличествоДнейЕжедневногоРасчетаПоказателей = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("КоличествоДнейЕжедневногоРасчетаПоказателей");
	
	Если Не ЗначениеЗаполнено(КоличествоДнейЕжедневногоРасчетаПоказателей) Тогда
		
		КоличествоДнейЕжедневногоРасчетаПоказателей = 1;
		
	КонецЕсли;	
	
	ДатаНачалаРасчета = НачалоДня(ТекущаяДата() - КоличествоДнейЕжедневногоРасчетаПоказателей*86400);
	
	Если ТолькоВыбраннаяДата И ЗначениеЗаполнено(ДатаРасчета) Тогда
		Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаРасчета));
		Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаРасчета));
	Иначе	
		Если Ежедневный Тогда
			
			Запрос.УстановитьПараметр("Дата1", ДатаНачалаРасчета);
			Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДата() - 86400));
			
		Иначе
			
			Запрос.УстановитьПараметр("Дата1", ДатаНачалаВыгрузкиПоказателейПоУмолчанию());
			Запрос.УстановитьПараметр("Дата2", ?(СВыгрузкой, КонецДня(ТекущаяДата() - 86400), ДатаНачалаРасчета - 86400));
			
		КонецЕсли;	
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Сжатие = Новый СжатиеДанных(9);
	
	Пока Выборка.Следующий() Цикл
		
		Если не Показатель = Неопределено Тогда
			
			Если ТипЗнч(Показатель) = Тип("Массив") Тогда
				Если Показатель.Найти(Выборка.Показатель) = Неопределено Тогда
					ПродолжитЬ;
				КонецЕсли;	   
			Иначе
				Если Показатель <>  Выборка.Показатель Тогда
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
			
		КонецЕсли;
		
		Если СписокОрганизацийФильтр <> Неопределено Тогда
			Если СписокОрганизацийФильтр.найти(Выборка.Организация) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	
		
		Если Выборка.РучнойПоказатель Тогда
			
			Продолжить;
			
		КонецЕсли;    
		
		Параметры = Новый Структура;
		Для каждого ТекКолонка из РезультатЗапроса.Колонки Цикл
			
			Параметры.Вставить(ТекКолонка.Имя, Выборка[ТекКолонка.Имя]);
			
		КонецЦикла;
		
		Ном = 0;
		МассивФоновыхЗаданий = Новый Массив;	
	
		
		Для каждого ТекПодразделение из СоответсвиеПодразделенийДляРасчета Цикл
			
			Ном = Ном + 1;
		
			УИД = Новый УникальныйИдентификатор;  ;
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(Параметры); 
			МассивПараметров.Добавить(ТекПодразделение.Значение); 
			МассивПараметров.Добавить(ТекПодразделение.Ключ); 
			МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("БТ_РасчетПоказателей.РасчитатьИЗаписьПоказатель",МассивПараметров,УИД));
			
			Если Ном%6=0 Тогда		
				ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "ВыгрузкаССП");
				МассивФоновыхЗаданий.Очистить();
			КонецЕсли;

		КонецЦикла;  
		
		Если МассивФоновыхЗаданий.Количество()>0 Тогда
			ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "СформироватьАрхивПоКРСводная");
			МассивФоновыхЗаданий.Очистить();
		КонецЕсли;

		
	КонецЦикла;
	
	Если Ежедневный или СВыгрузкой Тогда
		ВыгрузитьДанные(?(Не СВыгрузкой, ДатаНачалаРасчета, Неопределено));
		
		СнятьФлагВыгружен();
	КонецЕсли;	
	
КонецПроцедуры   

Процедура РасчитатьИЗаписьПоказатель(Выборка, ТекПодразделение, Ключ) Экспорт
	
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
	Если Выборка.НовыйРасчетСПодразделениями Тогда
	
		Результат = ВыполнитьРасчет(Выборка, ТекПодразделение, Ключ);
		
	Иначе
		
		Результат = ВыполнитьРасчет(Выборка, Неопределено);
		
	КонецЕсли;      
	
	ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
	
	Если типЗнч(Результат) = тип("Строка") Тогда
		
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,""+Выборка.Показатель+": "+Результат);
		
		МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);
		Если Выборка.НовыйРасчетСПодразделениями Тогда
			МенеджерЗаписей.Подразделение = Ключ;
		КонецЕсли;
		
		МенеджерЗаписей.ВремяВыполнения = ВремяВыполнения ;
		МенеджерЗаписей.ДатаДобавления = ТекущаяДатаСеанса();
		МенеджерЗаписей.ТекстОшибки = Результат;
		МенеджерЗаписей.Записать();
		
		Возврат;
		
	КонецЕсли;
	
	МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);
	Если Выборка.НовыйРасчетСПодразделениями Тогда
		МенеджерЗаписей.Подразделение = Ключ;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Число") Тогда
		
		МенеджерЗаписей.Значение = Результат;
		
	Иначе
		
		Сжатие = Новый СжатиеДанных(9);
		МенеджерЗаписей.Значение = Результат.Итог(Выборка.ЗначениеПоказателя);
		МенеджерЗаписей.Таблица = Новый ХранилищеЗначения(Результат, Сжатие);
		
	КонецЕсли;              
	МенеджерЗаписей.ВремяВыполнения = ВремяВыполнения ;
	МенеджерЗаписей.ДатаДобавления = ТекущаяДатаСеанса();
	МенеджерЗаписей.Записать();
	
КонецПроцедуры


Процедура ПроизвестиРасчетПоказателей(ДатаРасчета = Неопределено,ПолныйРасчет = Ложь, Показатель = Неопределено, Ежедневный = Истина, СВыгрузкой = Ложь, СписокОрганизаций = Неопределено, СписокПодразделений = Неопределено, БезКалендаря = Ложь, ТолькоВыбраннаяДата = Ложь) Экспорт
	
	ПроизвестиРасчетПоказателейФоново(ДатаРасчета,ПолныйРасчет, Показатель, Ежедневный, СВыгрузкой, СписокОрганизаций, СписокПодразделений, БезКалендаря, ТолькоВыбраннаяДата);
	
	Возврат;
	
	Если не ЗаполнитьКалендарь() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДатаРасчета = Неопределено Тогда
		
		ДатаРасчета = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП,
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"
		|ИТОГИ ПО
		|	БТ_НазваниеДляССП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответсвиеПодразделенийДляРасчета = новый Соответствие;
	
	ВыборкаБТ_НазваниеДляССП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаБТ_НазваниеДляССП.Сбросить();
	Пока ВыборкаБТ_НазваниеДляССП.Следующий() Цикл
		// Вставить обработку выборки ВыборкаБТ_НазваниеДляССП
	
		ВыборкаДетальныеЗаписи = ВыборкаБТ_НазваниеДляССП.Выбрать();
	    СписокПодразделений = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокПодразделений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		СоответсвиеПодразделенийДляРасчета.Вставить(ВыборкаБТ_НазваниеДляССП.БТ_НазваниеДляССП, СписокПодразделений);
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоказательРасчета();
	Запрос.УстановитьПараметр("ТекДата",ДатаРасчета);  
	Запрос.УстановитьПараметр("ПолныйРасчет",ПолныйРасчет);
	
	

	Выборка = Запрос.Выполнить().Выбрать();
	Сжатие = Новый СжатиеДанных(9);
	
	Пока Выборка.Следующий() Цикл
		
		Если не Показатель = Неопределено и не Показатель =  Выборка.Показатель Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.РучнойПоказатель Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Для каждого ТекПодразделение из СоответсвиеПодразделенийДляРасчета Цикл
			
			ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			Если Выборка.НовыйРасчетСПодразделениями Тогда
			
				Результат = ВыполнитьРасчет(Выборка, ТекПодразделение.Значение, ТекПодразделение.Ключ);
				
			Иначе
				
				Результат = ВыполнитьРасчет(Выборка, Неопределено);
				
			КонецЕсли;      
			
			ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала;
			
			Если типЗнч(Результат) = тип("Строка") Тогда
				
				ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,""+Выборка.Показатель+": "+Результат);
				Продолжить;
				
			КонецЕсли;
			
			МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);
			Если Выборка.НовыйРасчетСПодразделениями Тогда
				МенеджерЗаписей.Подразделение = ТекПодразделение.Ключ;
			КонецЕсли;
			
			Если ТипЗнч(Результат) = Тип("Число") Тогда
				
				МенеджерЗаписей.Значение = Результат;
				
			Иначе
				
				МенеджерЗаписей.Значение = Результат.Итог(Выборка.ЗначениеПоказателя);
				МенеджерЗаписей.Таблица = Новый ХранилищеЗначения(Результат,Сжатие);
				
			КонецЕсли;              
			МенеджерЗаписей.ВремяВыполнения = ВремяВыполнения ;
			МенеджерЗаписей.ДатаДобавления = ТекущаяДатаСеанса();
			МенеджерЗаписей.Записать();
			
			Если не Выборка.НовыйРасчетСПодразделениями Тогда
				
				Прервать;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	Если Показатель = Неопределено Тогда
		
		ЗафиксироватьИзменения();
		
	КонецЕсли;
	
	ВыгрузитьДанные();
	
КонецПроцедуры

Процедура ПроизвестиРасчетПоказателей_v2(ДатаРасчета = Неопределено,ПолныйРасчет = Ложь, Показатель = Неопределено) Экспорт
	
	Если не ЗаполнитьКалендарь() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДатаРасчета = Неопределено Тогда
		
		ДатаРасчета = ТекущаяДата();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП,
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"
		|ИТОГИ ПО
		|	БТ_НазваниеДляССП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответсвиеПодразделенийДляРасчета = новый Соответствие;
	
	ВыборкаБТ_НазваниеДляССП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаБТ_НазваниеДляССП.Сбросить();           
	
	Пока ВыборкаБТ_НазваниеДляССП.Следующий() Цикл
	
		ВыборкаДетальныеЗаписи = ВыборкаБТ_НазваниеДляССП.Выбрать();
	    СписокПодразделений = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СписокПодразделений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			
		КонецЦикла;
		
		СоответсвиеПодразделенийДляРасчета.Вставить(ВыборкаБТ_НазваниеДляССП.БТ_НазваниеДляССП, СписокПодразделений);
		
	КонецЦикла;
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоказателяПоПодразделениям();
	Запрос.УстановитьПараметр("ТекДата",ДатаРасчета);  
	Запрос.УстановитьПараметр("ПолныйРасчет",ПолныйРасчет);

	Выборка = Запрос.Выполнить().Выбрать();
	Сжатие = Новый СжатиеДанных(9);
	
	Пока Выборка.Следующий() Цикл
		
		Если не Показатель = Неопределено и не Показатель =  Выборка.Показатель Тогда
			
			Продолжить;       
			
		КонецЕсли;
		
		Если Выборка.РучнойПоказатель Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.БТ_НазваниеДляССП) Тогда
			
			Результат = ВыполнитьРасчет(Выборка, СоответсвиеПодразделенийДляРасчета.Получить(Выборка.БТ_НазваниеДляССП), Выборка.БТ_НазваниеДляССП);
			
		Иначе
			
			Результат = ВыполнитьРасчет(Выборка, Неопределено);

		КонецЕсли;
				
		Если типЗнч(Результат) = тип("Строка") Тогда
			
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,""+Выборка.Показатель+": "+Результат);
			Продолжить;
			
		КонецЕсли;
		
		МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей, Выборка);       
		
		Если Выборка.НовыйРасчетСПодразделениями Тогда           
			
			МенеджерЗаписей.Подразделение = Выборка.БТ_НазваниеДляССП; 
			
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("Число") Тогда
			
			МенеджерЗаписей.Значение = Результат;
			
		Иначе
			
			МенеджерЗаписей.Значение = Результат.Итог(Выборка.ЗначениеПоказателя);
			МенеджерЗаписей.Таблица = Новый ХранилищеЗначения(Результат, Сжатие);
			
		КонецЕсли;           
		
		МенеджерЗаписей.Записать();
		
	КонецЦикла;
	
	Если Показатель = Неопределено Тогда
		
		ЗафиксироватьИзменения();
		
	КонецЕсли;
	
	ВыгрузитьДанные();
	
КонецПроцедуры



Процедура ЗафиксироватьИзменения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ИзменениеМетаданных.Метаданные КАК Метаданные,
		|	ИСТИНА КАК Учтено,
		|	БТ_ИзменениеМетаданных.ДатаИзменения КАК ДатаИзменения,
		|	БТ_ИзменениеМетаданных.Организация КАК Организация,
		|	БТ_ИзменениеМетаданных.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РегистрыСведений.БТ_ИзменениеМетаданных.СоздатьНаборЗаписей().Записать();
	
	НаборДанных = РегистрыСведений.БТ_ИзменениеМетаданных.СоздатьНаборЗаписей();
	НаборДанных.Загрузить(РезультатЗапроса);
	НаборДанных.Записать(истина);	
КонецПроцедуры

Функция ПолучитьТекстЗапросаВыгрузкиДанных()
	
	Возврат "ВЫБРАТЬ
	        |	БТ_ЗначенияПоказателейСрезПоследних.Период КАК Период,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель КАК Показатель,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Организация КАК Организация,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Таблица КАК Таблица,
	        |	ВЫРАЗИТЬ(БТ_ЗначенияПоказателейСрезПоследних.Значение КАК ЧИСЛО(15, 2)) КАК Значение,
	        |	ИСТИНА КАК Выгружен,
	        |	&ТекДата КАК ДатаВыгрузки,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.Наименование КАК ПоказательНаименование,
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК ОрганизацияНаименование,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.ID КАК ПоказательID,
	        |	ВЫБОР
	        |		КОГДА БТ_ЗначенияПоказателейСрезПоследних.План
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК План,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Подразделение КАК Подразделение,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.НовыйРасчетСПодразделениями КАК НовыйРасчетСПодразделениями,
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
	        |	БТ_ЗначенияПоказателейСрезПоследних.ВремяВыполнения КАК ВремяВыполнения,
	        |	БТ_ЗначенияПоказателейСрезПоследних.ДатаДобавления КАК ДатаДобавления
	        |ИЗ
	        |	РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателейСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |		ПО ((ВЫРАЗИТЬ(БТ_ЗначенияПоказателейСрезПоследних.Организация КАК Справочник.Организации)) = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение)
	        |			И (БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации"")
	        |ГДЕ
	        |	НЕ БТ_ЗначенияПоказателейСрезПоследних.Выгружен
	        |	И НЕ БТ_ЗначенияПоказателейСрезПоследних.План
	        |	И НЕ БТ_ЗначенияПоказателейСрезПоследних.Показатель.РучнойПоказатель
	        |	И БТ_ЗначенияПоказателейСрезПоследних.Период >= &Период
	        |	И БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	        |	И БТ_ЗначенияПоказателейСрезПоследних.ТекстОшибки ПОДОБНО """""
	
КонецФункции

Функция ПолучитьТекстЗапросаВыгрузкиДанныхПоПодразделениям()
	
	Возврат "ВЫБРАТЬ
	        |	БТ_ЗначенияПоказателейСрезПоследних.Период КАК Период,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель КАК Показатель,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Организация КАК Организация,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Таблица КАК Таблица,
	        |	ВЫРАЗИТЬ(БТ_ЗначенияПоказателейСрезПоследних.Значение КАК ЧИСЛО(15, 2)) КАК Значение,
	        |	ИСТИНА КАК Выгружен,
	        |	&ТекДата КАК ДатаВыгрузки,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.Наименование КАК ПоказательНаименование,
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК ОрганизацияНаименование,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.ID КАК ПоказательID,
	        |	ВЫБОР
	        |		КОГДА БТ_ЗначенияПоказателейСрезПоследних.План
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК План,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Подразделение КАК Подразделение,
	        |	БТ_ЗначенияПоказателейСрезПоследних.Показатель.НовыйРасчетСПодразделениями КАК НовыйРасчетСПодразделениями,
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
	        |	БТ_ЗначенияПоказателейСрезПоследних.ВремяВыполнения КАК ВремяВыполнения,
	        |	БТ_ЗначенияПоказателейСрезПоследних.ДатаДобавления КАК ДатаДобавления
	        |ИЗ
	        |	РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателейСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |		ПО ((ВЫРАЗИТЬ(БТ_ЗначенияПоказателейСрезПоследних.Организация КАК Справочник.Организации)) = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение)
	        |			И (БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации"")
	        |ГДЕ
	        |	НЕ БТ_ЗначенияПоказателейСрезПоследних.Выгружен
	        |	И НЕ БТ_ЗначенияПоказателейСрезПоследних.План
	        |	И НЕ БТ_ЗначенияПоказателейСрезПоследних.Показатель.РучнойПоказатель
	        |	И БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	        |	И БТ_ЗначенияПоказателейСрезПоследних.Подразделение = &Подразделение
	        |	И БТ_ЗначенияПоказателейСрезПоследних.Период >= &Период"
	
КонецФункции

функция клЧисло(ч)
	возврат стрЗаменить(ч,Символы.НПП,"");
КонецФункции

Функция НайтиОрганизациюДляВыгрузки(Организация) Экспорт
	
	  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Наименование,
		|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации).Код КАК Код
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
		|	И БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Организация);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.Наименование;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВыгрузкаОрганизаций(ADOСоединение) Экспорт
	
	СоответствиеОрганизаций = новый Соответствие;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[orgs]", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			ид 		= клЧисло(Rs.Fields.Item("id").Value);
			name 	= Rs.Fields.Item("name").Value;
			СоответствиеОрганизаций.Вставить(name,ид);
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;
  
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Наименование,
		|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации).Код КАК Код
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СоответствиеОрганизаций.Получить(СокрЛП(ВыборкаДетальныеЗаписи.Наименование)) = Неопределено Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС+"INSERT INTO [dbo].[orgs] ([name],[active],[brand_id])
    	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Наименование)+",1,1)";
			
		КонецЕсли;
		
	КонецЦикла;

	Если не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Команда = Новый ComObject("ADODB.Command");
		Команда.CommandText = ТекстЗапроса;
	    Команда.ActiveConnection = ADOСоединение; 
		Команда.CommandType = 1;
		попытка
			Команда.Execute();
			
		исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ВыгрузкаОрганизаций(ADOСоединение);
		
	КонецЕсли;
	
	Возврат СоответствиеОрганизаций; 
КонецФункции

Функция ВыгрузкаЕдиницыИзмерения(ADOСоединение) Экспорт
	
	СоответствиеЕИ = новый Соответствие;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[ind_units]", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			ид 		= клЧисло(Rs.Fields.Item("id").Value);
			name 	= Rs.Fields.Item("name").Value;
			СоответствиеЕИ.Вставить(name,ид);
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;
  
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ЕдиницыИзмеренияПоказателей.Наименование КАК Наименование,
		|	БТ_ЕдиницыИзмеренияПоказателей.Код КАК Код
		|ИЗ
		|	Справочник.БТ_ЕдиницыИзмеренияПоказателей КАК БТ_ЕдиницыИзмеренияПоказателей
		|ГДЕ
		|	НЕ БТ_ЕдиницыИзмеренияПоказателей.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СоответствиеЕИ.Получить(СокрЛП(ВыборкаДетальныеЗаписи.Наименование)) = Неопределено Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС+"INSERT INTO [dbo].[ind_units] ([name])
    	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Наименование)+")";
			
		КонецЕсли;
		
	КонецЦикла;

	Если не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Команда = Новый ComObject("ADODB.Command");
		Команда.CommandText = ТекстЗапроса;
	    Команда.ActiveConnection = ADOСоединение; 
		Команда.CommandType = 1;
		попытка
			Команда.Execute();
			
		исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ВыгрузкаЕдиницыИзмерения(ADOСоединение);
		
	КонецЕсли;
	
	Возврат СоответствиеЕИ; 
КонецФункции

Функция ВыгрузкаПодразделения(ADOСоединение) Экспорт
	
	СоответствиеПодразделений = новый Соответствие;
	
	тзкодовПодразделеий = Новый ТаблицаЗначений;
	тзкодовПодразделеий.Колонки.Добавить("ид"); 
	тзкодовПодразделеий.Колонки.Добавить("идСтрока");
	тзкодовПодразделеий.Колонки.Добавить("код"); 
	тзкодовПодразделеий.Колонки.Добавить("наименование");  
	тзкодовПодразделеий.Колонки.Добавить("ПометкаУдаления"); 
	тзкодовПодразделеий.Колонки.Добавить("Ссылка"); 
	тзкодовПодразделеий.Колонки.Добавить("измененв1С");
	

	
	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[subdivisions]", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			ид 		= Число(СокрЛП(Rs.Fields.Item("id").Value));
			name 	= Rs.Fields.Item("name").Value;   
			код 	= Rs.Fields.Item("code").Value;
			ПометкаУдаления 	= не Rs.Fields.Item("active").Value;
			измененВ1С 	= (Rs.Fields.Item("rename_1C").Value = Истина);
			
			идСтрока = Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ид);
			
			Элемент = Справочники.БТ_ПодразделенияССП.НайтиПоКоду(идСтрока);
			Если Элемент.Пустая() Тогда 
				Элемент = Справочники.БТ_ПодразделенияССП.СоздатьЭлемент();
				Элемент.Код = идСтрока;
				Элемент.Наименование = name;
				Элемент.ПометкаУдаления = ПометкаУдаления;
				Элемент.Записать();
				
			КонецЕсли;	 
			
			Если Не ПометкаУдаления тогда
				ПроверитьПОдразделения(name, Элемент.Ссылка);
			КонецЕсли;
			
			Новстр = тзкодовПодразделеий.Добавить();
			НовСтр.ид = ид;
			Новстр.наименование = name; 
			новстр.код = код;
			новстр.пометкаУдаления = ПометкаУдаления;
			Новстр.ссылка = элемент.ссылка;  
			новстр.идстрока = идСтрока;
			новстр.измененв1С = измененВ1С;
			
			СоответствиеПодразделений.Вставить(name, ид);
			rs.MoveNext();
			
		КонецЦикла;  
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;  
	
	для Каждого стр из тзкодовПодразделеий цикл  
		Если стр.ПометкаУдаления <> стр.ссылка.пометкаУдаления или нрег(стр.Наименование) <> нрег(стр.ссылка.наименование) тогда
			если не стр.измененв1С тогда
				ОбновитьПодразделениеСкуль(стр.ид, стр.ссылка, ADOСоединение);  
			иначе
				Об = стр.ссылка.получитьОбъект();
				об.наименование = стр.Наименование;
				об.пометкаУдаления = стр.ПометкаУдаления; 
				об.записать();
				
				ОбновитьПодразделениеСкуль(стр.ид, стр.ссылка, ADOСоединение, истина);
			конецесли;
			
			Возврат ВыгрузкаПодразделения(ADOСоединение); 
		КонецЕсли;	
	КонецЦикла;	  
	
	//проверка создания в 1С
	Выборка = справочники.БТ_ПодразделенияССП.Выбрать();
	Пока Выборка.Следующий() цикл 
		стрп = тзкодовПодразделеий.Найти(выборка.код, "идСтрока"); 
		Если стрп = Неопределено тогда 
			СоздатьПодразделениеСкуль(выборка.Ссылка, ADOСоединение); 
			
			Возврат ВыгрузкаПодразделения(ADOСоединение);
		КонецЕсли;	
	КонецЦикла;	
  
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК Наименование,
		|	ПодразделенияКомпании.Код КАК Код
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	НЕ ПодразделенияКомпании.ПометкаУдаления
		|	И НЕ ПодразделенияКомпании.БТ_НазваниеДляССП = """"
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодразделенияКомпании.БТ_НазваниеДляССП,
		|	ПодразделенияКомпании.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ид = СоответствиеПодразделений.Получить(СокрЛП(Строка(ВыборкаДетальныеЗаписи.Наименование)));
		
		Если ид = Неопределено Тогда
			ВызватьИсключение "такое создание невозможно";
			ТекстЗапроса = ТекстЗапроса + Символы.ПС+"INSERT INTO [dbo].[subdivisions] ([name])
    	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Строка(ВыборкаДетальныеЗаписи.Наименование))+")";
		//Иначе
		//	//проверим код
		//	стрп = тзкодовПодразделеий.Найти(ид, "ид");
		//	Если стрп <> Неопределено Тогда
		//		Если нрег(стрп.код) <> нрег(ВыборкаДетальныеЗаписи.Код) Тогда
		//			ОбновитьКодПодразделения(ид, ВыборкаДетальныеЗаписи.Код, ADOСоединение);
		//		КонецЕсли;	
		//	КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;

	Если не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Команда = Новый ComObject("ADODB.Command");
		Команда.CommandText = ТекстЗапроса;
	    Команда.ActiveConnection = ADOСоединение; 
		Команда.CommandType = 1;
		попытка
			Команда.Execute();
			
		исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ВыгрузкаПодразделения(ADOСоединение);
		
	КонецЕсли;
	
	Возврат СоответствиеПодразделений; 
КонецФункции   

Процедура СоздатьПодразделениеСкуль(Элемент, ADOСоединение) 
	
	ПредставлениеИд = Элемент.Код; 
	ПредставлениеНаименования = Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Элемент.Наименование);  
	ПредставлениеАктивности = ?(Элемент.ПометкаУдаления, 0, 1);
	
	ТекстЗапроса = "INSERT INTO [dbo].[subdivisions] ([name],[active])
    	 	|VALUES ("+ПредставлениеНаименования+", "+ПредставлениеАктивности+")";
			
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	Команда.Execute();
			
	RS = Новый COMОбъект("ADODB.Recordset");
	RS.Open("SELECT SCOPE_IDENTITY() AS NewID", ADOСоединение);
	Если RS.EOF() = 0 Тогда 			
		
		ид = СокрЛП(Rs.Fields.Item("NewID").Value); 
		
		Если Элемент.Код <> ид Тогда  
			Об = Элемент.ПолучитьОбъект();
			Об.Код = ид;
			Об.ЗАписать();
		КонецЕсли;
		
  КонецЕсли;
КонецПроцедуры	

Процедура ПроверитьПодразделения(name, Элемент)
	Если ПустаяСтрока(name) Тогда 
		Возврат;
	КонецЕсли;	
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП = &БТ_НазваниеДляССП
		|	И ПодразделенияКомпании.БТ_ПодразделениеССП <> &Элемент";
	
	Запрос.УстановитьПараметр("БТ_НазваниеДляССП", name);
	Запрос.УстановитьПараметр("Элемент", Элемент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		об = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
		об.БТ_ПодразделениеССП = Элемент;
		Об.обменданными.загрузка = истина;
		об.Записать();
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
	
Процедура ОбновитьКодПодразделения(ид, Код, ADOСоединение)  
	ПредставлениеКода = Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Код); 
	ПредставлениеИд = Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ид);
	
	ТекстЗапроса = "UPDATE [dbo].[subdivisions] SET [code] = "+ПредставлениеКода +"  WHERE [id] = " + ПредставлениеИд;
   	
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	попытка
		Команда.Execute();
		
	исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки()); 
		ВызватьИсключение "не смогли обновит код подразделения " + ид;
	КонецПопытки;

КонецПроцедуры

Процедура ОбновитьПодразделениеСкуль(ид, Элемент, ADOСоединение, СброситьФлагИзмененв1С = ложь)
	
	ПредставлениеИд = Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ид); 
	ПредставлениеНаименования = Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Элемент.Наименование);  
	ПредставлениеАктивности = ?(Элемент.ПометкаУдаления, 0, 1);
	
	Если Не СброситьФлагИзмененв1С тогда
		
		ТекстЗапроса = "UPDATE [dbo].[subdivisions] SET [rename_1c] = 1, [active] = "+ПредставлениеАктивности +", [name] = "+ПредставлениеНаименования+" WHERE [id] = " + ПредставлениеИд;
	иначе 
		ТекстЗапроса = "UPDATE [dbo].[subdivisions] SET [rename_1c] = 0 WHERE [id] = " + ПредставлениеИд;
	КонецЕсли;
	
	Команда = Новый ComObject("ADODB.Command");
	Команда.CommandText = ТекстЗапроса;
    Команда.ActiveConnection = ADOСоединение; 
	Команда.CommandType = 1;
	попытка
		Команда.Execute();
		
	исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки()); 
		ВызватьИсключение "не смогли обновит код подразделения " + ид;
	КонецПопытки;

КонецПроцедуры	

Функция ВыгрузкаДепартаменты(ADOСоединение) Экспорт
	
	СоответствиеДепартаменты = новый Соответствие;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[departments]", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			ид 		= клЧисло(Rs.Fields.Item("id").Value);
			name 	= Rs.Fields.Item("name").Value;
			СоответствиеДепартаменты.Вставить(name,ид);
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;
  
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_НаправлениеДеятельности.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.БТ_НаправлениеДеятельности КАК БТ_НаправлениеДеятельности";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если СоответствиеДепартаменты.Получить(СокрЛП(Строка(ВыборкаДетальныеЗаписи.Ссылка))) = Неопределено Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС+"INSERT INTO [dbo].[departments] ([name])
    	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(Строка(ВыборкаДетальныеЗаписи.Ссылка))+")";
			
		КонецЕсли;
		
	КонецЦикла;

	Если не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Команда = Новый ComObject("ADODB.Command");
		Команда.CommandText = ТекстЗапроса;
	    Команда.ActiveConnection = ADOСоединение; 
		Команда.CommandType = 1;
		попытка
			Команда.Execute();
			
		исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ВыгрузкаДепартаменты(ADOСоединение);
		
	КонецЕсли;
	
	Возврат СоответствиеДепартаменты; 
КонецФункции

Функция ВыгрузитьПоказатели(ADOСоединение,СоотвествиеВидовРасчета) ЭКспорт
	
	СоответствиеПоказателей = новый Соответствие;
	
	СоотвествиеДепартаментов = ВыгрузкаДепартаменты(ADOСоединение);
	СоотвествиеЕИ = ВыгрузкаЕдиницыИзмерения(ADOСоединение);
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	ТаблицаПоказателей.Колонки.Добавить("id",Новый ОписаниеТипов("Число"));
	ТаблицаПоказателей.Колонки.Добавить("name",Новый ОписаниеТипов("Строка"));
	ТаблицаПоказателей.Колонки.Добавить("active",Новый ОписаниеТипов("Булево"));
	ТаблицаПоказателей.Колонки.Добавить("calc_type",Новый ОписаниеТипов("Число"));    
	ТаблицаПоказателей.Колонки.Добавить("id_1C",Новый ОписаниеТипов("Число"));    
	ТаблицаПоказателей.Колонки.Добавить("dep_id",Новый ОписаниеТипов("Число"));    
	ТаблицаПоказателей.Колонки.Добавить("unit_id",Новый ОписаниеТипов("Число"));    
	ТаблицаПоказателей.Колонки.Добавить("sort",Новый ОписаниеТипов("Число"));         
	ТаблицаПоказателей.Колонки.Добавить("info",Новый ОписаниеТипов("Строка"));

	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[inds] where id_1C is not NULL ", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			id 				= клЧисло(Rs.Fields.Item("id").Value);
			name 			= Rs.Fields.Item("name").Value;
			active 			= Rs.Fields.Item("active").Value;
			calc_type 		= клЧисло(Rs.Fields.Item("calc_type").Value);
			id_1C 			= клЧисло(Rs.Fields.Item("id_1C").Value);
			
			dep_id 			= клЧисло(Rs.Fields.Item("dep_id").Value);
			unit_id 		= клЧисло(Rs.Fields.Item("unit_id").Value);
			sort 			= клЧисло(Rs.Fields.Item("sort").Value);     
			info 			= Rs.Fields.Item("info").Value;
			СоответствиеПоказателей.Вставить(СтрЗаменить(СтрЗаменить(Строка(Формат(Число(id_1C),"ЧГ=0"))," ",""),".",""),СтрЗаменить(СтрЗаменить(Строка(Формат(Число(id),"ЧГ=0"))," ",""),".",""));
			НовоеЗначение = ТаблицаПоказателей.Добавить();
			НовоеЗначение.id 		= id;
			НовоеЗначение.name 		= name;
			НовоеЗначение.active 	= active;
			НовоеЗначение.calc_type = calc_type;  
			НовоеЗначение.id_1C 	= id_1C;  
			НовоеЗначение.dep_id 	= dep_id;  
			НовоеЗначение.unit_id 	= unit_id;  
			НовоеЗначение.sort 		= sort;        
			НовоеЗначение.info 		= info;
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;
  
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПоказателей.id КАК id,
		|	ТаблицаПоказателей.name КАК name,
		|	ТаблицаПоказателей.active КАК active,
		|	ТаблицаПоказателей.calc_type КАК calc_type,
		|	ТаблицаПоказателей.id_1C КАК id_1C,
		|	ТаблицаПоказателей.dep_id КАК dep_id,
		|	ТаблицаПоказателей.unit_id КАК unit_id,
		|	ТаблицаПоказателей.sort КАК sort,
		|	ТаблицаПоказателей.info КАК info
		|ПОМЕСТИТЬ ТаблицаПоказателей
		|ИЗ
		|	&ТаблицаПоказателей КАК ТаблицаПоказателей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПоказателей.id КАК id,
		|	ТаблицаПоказателей.name КАК name,
		|	ТаблицаПоказателей.active КАК active,
		|	ТаблицаПоказателей.calc_type КАК calc_type,
		|	ТаблицаПоказателей.dep_id КАК dep_id,
		|	ТаблицаПоказателей.unit_id КАК unit_id,
		|	ТаблицаПоказателей.sort КАК sort,
		|	ТаблицаПоказателей.info КАК info,
		|	БТ_Показатели.Код КАК Код,
		|	БТ_Показатели.Наименование КАК Наименование,
		|	БТ_Показатели.ТипРасчета КАК ТипРасчета,
		|	БТ_Показатели.ID КАК IDПоказателя,
		|	БТ_Показатели.Включен КАК Включен,
		|	БТ_Показатели.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	БТ_Показатели.ЕдиницаИзмерения.Наименование КАК ЕИ,
		|	БТ_Показатели.сортировка КАК сортировка,
		|	ТаблицаПоказателей.id_1C КАК id_1C,
		|	БТ_Показатели.Описание КАК Описание
		|ИЗ
		|	ТаблицаПоказателей КАК ТаблицаПоказателей
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
		|		ПО ТаблицаПоказателей.id_1C = БТ_Показатели.ID
		|
		|УПОРЯДОЧИТЬ ПО
		|	IDПоказателя";
	Запрос.УстановитьПараметр("ТаблицаПоказателей",ТаблицаПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстЗапроса = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЕИ = СоотвествиеЕИ.Получить(ВыборкаДетальныеЗаписи.ЕИ);
		НаправлениеДеятельности = СоотвествиеДепартаментов.Получить(Строка(ВыборкаДетальныеЗаписи.НаправлениеДеятельности));
		ТипРасчета = СоотвествиеВидовРасчета.Получить(Строка(ВыборкаДетальныеЗаписи.ТипРасчета));
		
		Если ВыборкаДетальныеЗаписи.name = NULL Тогда  
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС+"INSERT INTO [dbo].[inds]([name],[calc_type],[active],[id_1C],[dep_id],[unit_id],[sort],[info])
    	 	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Наименование)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ТипРасчета)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(?(ВыборкаДетальныеЗаписи.Включен = истина,1,0))+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ВыборкаДетальныеЗаписи.IDПоказателя)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(НаправлениеДеятельности)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ЕИ)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ВыборкаДетальныеЗаписи.сортировка)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Описание)+")";
			
		ИначеЕсли не СокрЛП(ВыборкаДетальныеЗаписи.name) = СокрЛП(ВыборкаДетальныеЗаписи.Наименование)
			или ВыборкаДетальныеЗаписи.active <> ВыборкаДетальныеЗаписи.Включен
			или ВыборкаДетальныеЗаписи.sort <> ВыборкаДетальныеЗаписи.сортировка
			или Строка(ВыборкаДетальныеЗаписи.unit_id) <> ЕИ                    			
			или Строка(ВыборкаДетальныеЗаписи.calc_type) <> ТипРасчета			
			или Строка(ВыборкаДетальныеЗаписи.dep_id) <> НаправлениеДеятельности			
			или Строка(ВыборкаДетальныеЗаписи.info) <> СокрЛП(ВыборкаДетальныеЗаписи.Описание) Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС + "UPDATE [dbo].[inds]
   			|SET [name] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Наименование)+",
			|[active] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(?(ВыборкаДетальныеЗаписи.Включен = истина,1,0))+",
			|[unit_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ЕИ)+",
			|[sort] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ВыборкаДетальныеЗаписи.сортировка)+",
			|[dep_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(НаправлениеДеятельности)+",
			|[calc_type] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ТипРасчета)+",
			|[info] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеСтрокиSQL(ВыборкаДетальныеЗаписи.Описание)+"
    		|WHERE [id_1C] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(ВыборкаДетальныеЗаписи.IDПоказателя);
			
		КонецЕсли;
		
	КонецЦикла;

	Если не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Команда = Новый ComObject("ADODB.Command");
		Команда.CommandText = ТекстЗапроса;
	    Команда.ActiveConnection = ADOСоединение; 
		Команда.CommandType = 1;
		попытка
			Команда.Execute();
			
		исключение
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
			сообщить(ОписаниеОшибки());
			Возврат Неопределено;
		КонецПопытки;
		
		Возврат ВыгрузитьПоказатели(ADOСоединение,СоотвествиеВидовРасчета);
		
	КонецЕсли;
	
	Возврат СоответствиеПоказателей; 
КонецФункции

Функция УзнатьСоответсвиеВидовРасчета(ADOСоединение) Экспорт
	
	СоответствиеВидовРасчета = новый Соответствие;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	УжеЕстьЗапись = Ложь;
	Попытка
		RS.Open("select * from [ssp].[dbo].[ind_calc_types]", ADOСоединение);
		Пока RS.EOF() = 0 Цикл 			
			
			ид 		= клЧисло(Rs.Fields.Item("id").Value);
			name 	= Rs.Fields.Item("name").Value;
			СоответствиеВидовРасчета.Вставить(name,ид);
			rs.MoveNext();
			
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
		сообщить(ОписаниеОшибки());
		Возврат Неопределено;	
	КонецПопытки;	

    Попытка 
		RS.Close();
	Исключение
	КонецПопытки;
	
	Возврат СоответствиеВидовРасчета;
КонецФункции

Функция ПолучитьЗапросПоПользователям()
	
	Возврат "";
	
КонецФункции

Процедура ВыгрузитьДанныеПоПодразделениям(Подразделение) Экспорт
	
	ПрофильSQL = Справочники.БТ_ПрофилиSQL.Показатели;
	
	ADOСоединение = Справочники.БТ_ПрофилиSQL.ПодключитьSQL(ПрофильSQL);
	
	Если ADOСоединение  = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоответсвиеОрганизаций = ВыгрузкаОрганизаций(ADOСоединение);
	
	Если СоответсвиеОрганизаций = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СоответсвиеПодразедлений = ВыгрузкаПодразделения(ADOСоединение);
	
	Если СоответсвиеПодразедлений = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	
	СоотвествиеВидовРасчета = УзнатьСоответсвиеВидовРасчета(ADOСоединение);	
	
	Если СоотвествиеВидовРасчета = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоотвествиеПоказателей = ВыгрузитьПоказатели(ADOСоединение,СоотвествиеВидовРасчета);	
	
	Если СоотвествиеПоказателей = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаВыгрузкиДанныхПоПодразделениям();
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());       
	Запрос.УстановитьПараметр("Период", НачалоГода(ТекущаяДата()));  
	Запрос.УстановитьПараметр("Подразделение", Подразделение);

	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
		
	Команда = Новый ComObject("ADODB.Command"); 
	
	МаксимальноеКоличествоЗаписейВТранзакции = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("МаксимальноеКоличествоЗаписейВТранзакции");
	
	Если МаксимальноеКоличествоЗаписейВТранзакции = Неопределено Тогда
		
		МаксимальноеКоличествоЗаписейВТранзакции = 100;
		
	КонецЕсли;
	
	КоличествоЗаписей = 0;
	ТекстЗапроса = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НовыйРасчетСПодразделениями Тогда
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"DELETE FROM [dbo].[values]
	      	|WHERE [ind_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+" 
			|and [org_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+"
			|and ([sub_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеПодразедлений.Получить(Выборка.Подразделение))+" or [sub_id] is null)
			|and [date] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+"
			|and [is_plan] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План);
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan], [sub_id])
	     	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(Выборка.Значение,"ЧН=0; ЧГ=0"))+","+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План)+","+СоответсвиеПодразедлений.Получить(Выборка.Подразделение)+")";
			
			
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"DELETE FROM [dbo].[values]
			|WHERE [ind_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+" 
			|and [org_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+"
			|and [date] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+"
			|and [is_plan] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План);
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan])
			|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(Выборка.Значение,"ЧН=0; ЧГ=0"))+","+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План)+")";
		КонецЕсли;
		Если КоличествоЗаписей >= МаксимальноеКоличествоЗаписейВТранзакции Тогда
			
			КоличествоЗаписей = 0;
				ЗафиксироватьТранзакцию();
				НачатьТранзакцию();       
			Если не ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) Тогда
				
					ТекстЗапроса = ""; 
					ОтменитьТранзакцию();  
					
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;	 
			
		МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей,Выборка);
		МенеджерЗаписей.Записать();
		
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Если не ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
	КонецЕсли;    
	
	Если ТранзакцияАктивна() Тогда
	
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	
КонецПроцедуры       

Процедура ОжидатьЗавершенияФоновыхЗаданий(Знач мЗаданий, Знач КоличествоИтераций = 0, ЗаписьВЛогОшибки = Ложь, РегламентноеЗадание = "") Экспорт
	
	Пока мЗаданий.Количество()>0 Цикл
		Попытка
			мЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(мЗаданий, 60);
		Исключение
			Прервать;
		КонецПопытки;
		мВыполненныхЗаданий = Новый Массив;
		Для Каждого мЗадание ИЗ мЗаданий Цикл
			Если мЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
				мВыполненныхЗаданий.Добавить(мЗадание);
			КонецЕсли;
			Если ЗаписьВЛогОшибки И мЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			КонецЕсли;
		КонецЦикла;
		Для Каждого ВыполненноеЗадание ИЗ мВыполненныхЗаданий Цикл
			УдаляемыйИндекс = мЗаданий.Найти(ВыполненноеЗадание);
			Если УдаляемыйИндекс = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			мЗаданий.Удалить(УдаляемыйИндекс);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыгрузкаФоновоНажатие()  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	ПодразделенияКомпании.БТ_НазваниеДляССП <> """"";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Ном = 0;
	МассивФоновыхЗаданий = Новый Массив;	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Ном = Ном + 1;
		
		УИД = Новый УникальныйИдентификатор;  ;
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(ВыборкаДетальныеЗаписи.БТ_НазваниеДляССП); 
		МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("БТ_РасчетПоказателей.ВыгрузитьДанныеПоПодразделениям",МассивПараметров,УИД));
		
		Если Ном%2=0 Тогда		
			ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "ВыгрузкаССП");
			МассивФоновыхЗаданий.Очистить();
		КонецЕсли;
		
	КонецЦикла;

	Если МассивФоновыхЗаданий.Количество()>0 Тогда
		//ОжидатьЗавершенияФоновогоЗадания(МассивФоновыхЗаданий);
		ОжидатьЗавершенияФоновыхЗаданий(МассивФоновыхЗаданий, МассивФоновыхЗаданий.Количество(), Истина, "СформироватьАрхивПоКРСводная");
		МассивФоновыхЗаданий.Очистить();
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	

КонецПроцедуры


Процедура ВыгрузитьДанные(ДатаВыгрузкиПоказателей = Неопределено) Экспорт
	
	//ВыгрузкаФоновоНажатие();
	
	ПрофильSQL = Справочники.БТ_ПрофилиSQL.Показатели;
	
	ADOСоединение = Справочники.БТ_ПрофилиSQL.ПодключитьSQL(ПрофильSQL);
	
	Если ADOСоединение  = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоответсвиеОрганизаций = ВыгрузкаОрганизаций(ADOСоединение);
	
	Если СоответсвиеОрганизаций = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	СоответсвиеПодразедлений = ВыгрузкаПодразделения(ADOСоединение);
	
	Если СоответсвиеПодразедлений = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;

	
	СоотвествиеВидовРасчета = УзнатьСоответсвиеВидовРасчета(ADOСоединение);	
	
	Если СоотвествиеВидовРасчета = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоотвествиеПоказателей = ВыгрузитьПоказатели(ADOСоединение,СоотвествиеВидовРасчета);	
	
	Если СоотвествиеПоказателей = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВыгрузкиПоказателей) Тогда
		ДатаВыгрузкиПоказателей = ДатаНачалаВыгрузкиПоказателейПоУмолчанию();	                                    
	КонецЕсли;	
	
	Запрос = новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаВыгрузкиДанных();
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата()); 
	Запрос.УстановитьПараметр("Период", ДатаВыгрузкиПоказателей);  

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВыключитьТранзакцию") = истина Тогда
	
		НачатьТранзакцию();
		
	КонецЕсли;
	Команда = Новый ComObject("ADODB.Command");
	
	МаксимальноеКоличествоЗаписейВТранзакции = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("МаксимальноеКоличествоЗаписейВТранзакции");
	
	Если МаксимальноеКоличествоЗаписейВТранзакции = Неопределено Тогда
		
		МаксимальноеКоличествоЗаписейВТранзакции = 100;
		
	КонецЕсли;
	
	КоличествоЗаписей = 0;
	ТекстЗапроса = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.НовыйРасчетСПодразделениями Тогда
			
			идПодр = СоответсвиеПодразедлений.Получить(Выборка.Подразделение);
			
			Если Не ЗначениеЗаполнено(идПодр) Тогда 
				Продолжить;
			КонецЕсли;	
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"DELETE FROM [dbo].[values]
	      	|WHERE [ind_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+" 
			|and [org_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+"
			|and ([sub_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(идПодр)+" or [sub_id] is null)
			|and [date] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+"
			|and [is_plan] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План);
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan], [sub_id])
	     	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+",
	        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(Выборка.Значение,"ЧН=0; ЧГ=0"))+","+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План)+","+идПодр+")";
			
			
		Иначе
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"DELETE FROM [dbo].[values]
			|WHERE [ind_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+" 
			|and [org_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+"
			|and [date] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+"
			|and [is_plan] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План);
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan])
			|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(СоотвествиеПоказателей.Получить(Строка(Формат(Выборка.ПоказательID,"ЧН=0; ЧГ=0"))),"ЧН=0; ЧГ=0"))+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СоответсвиеОрганизаций.Получить(Выборка.ОрганизацияНаименование))+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Выборка.Период)+",
			|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(Выборка.Значение,"ЧН=0; ЧГ=0"))+","+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Выборка.План)+")";
		КонецЕсли;
		Если КоличествоЗаписей >= МаксимальноеКоличествоЗаписейВТранзакции Тогда
			
			КоличествоЗаписей = 0;
			Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВыключитьТранзакцию") = истина Тогда
				ЗафиксироватьТранзакцию();
				НачатьТранзакцию();       
			КонецЕсли;
			Если не ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) Тогда
				
				ТекстЗапроса = ""; 
				Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВыключитьТранзакцию") = истина Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;	 
			
		МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписей,Выборка);
		МенеджерЗаписей.Записать();
		
		КоличествоЗаписей = КоличествоЗаписей + 1;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Если не ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) тогда
			Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВыключитьТранзакцию") = истина Тогда
				ОтменитьТранзакцию();
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТранзакцияАктивна() Тогда
	
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ДатаНачалаВыгрузкиПоказателейПоУмолчанию()
	ДатаВыгрузкиПоказателей = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ДатаНачалаВыгрузкиПоказателей");
		
	Если Не ЗначениеЗаполнено(ДатаВыгрузкиПоказателей) Тогда
		
		ДатаВыгрузкиПоказателей = НачалоГода(ТекущаяДата());
		
	КонецЕсли;
	
	Возврат ДатаВыгрузкиПоказателей;
КонецФункции	

Функция ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) ЭКспорт
	
	Команда.CommandText 		= ТекстЗапроса;
	Команда.ActiveConnection 	= ADOСоединение; 
	Команда.CommandType 		= 1;    
	Команда.CommandTimeout 		= 120;
	
	Попытка
		
		Команда.Execute();
		ТекстЗапроса = "";
		Возврат Истина;
		
	Исключение
		
		Попытка
			
			Команда.Execute();
			ТекстЗапроса = "";
			Возврат Истина;
			
		Исключение
			
			ЗаписьЖурналаРегистрации("ОшибкиSQL",УровеньЖурналаРегистрации.Ошибка,,,"" + ОписаниеОшибки() +Символы.ПС+ ТекстЗапроса);
			сообщить(ОписаниеОшибки());
			Возврат Ложь;
			
		КонецПопытки; 
		
	КонецПопытки;  
	
КонецФункции

Функция ПолучитьТекстЗапросаПоказателяПоПодразделениям()

	Возврат "ВЫБРАТЬ
	        |	Организации.Ссылка КАК Организация
	        |ПОМЕСТИТЬ СписокОрганизаций_old
	        |ИЗ
	        |	Справочник.Организации КАК Организации
	        |ГДЕ
	        |	НЕ Организации.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация
	        |ПОМЕСТИТЬ СписокОрганизаций
	        |ИЗ
	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |ГДЕ
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ПодразделенияКомпании.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ Подразделения
	        |ИЗ
	        |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	        |ГДЕ
	        |	ПодразделенияКомпании.БТ_НазваниеДляССП <> """"
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	        |ПОМЕСТИТЬ ДатыРасчета
	        |ИЗ
	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |ГДЕ
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_КалендарьРаботы""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_КонстантныеЗначения.Значение КАК ДАТА) КАК Дата
	        |ПОМЕСТИТЬ ДатаНачалаРасчетаПоказателей
	        |ИЗ
	        |	РегистрСведений.БТ_КонстантныеЗначения КАК БТ_КонстантныеЗначения
	        |ГДЕ
	        |	БТ_КонстантныеЗначения.Параметр = ""ДатаНачалаРасчетаПоказателей""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка КАК Показатель,
	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата) КАК Дата,
	        |	СписокОрганизаций.Организация КАК Организация,
	        |	Подразделения.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ ПоказательСДатой
	        |ИЗ
	        |	Справочник.БТ_Показатели.ЗависимостьОтМетаданных КАК БТ_ПоказателиЗависимостьОтМетаданных
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ДатыРасчета КАК ДатыРасчета
	        |			ПО БТ_ИзменениеМетаданных.ДатаИзменения <= ДатыРасчета.Дата
	        |		ПО БТ_ПоказателиЗависимостьОтМетаданных.Документ = БТ_ИзменениеМетаданных.Метаданные,
	        |	СписокОрганизаций КАК СписокОрганизаций,
	        |	Подразделения КАК Подразделения
	        |ГДЕ
	        |	(НЕ БТ_ИзменениеМетаданных.Учтено
	        |			ИЛИ БТ_ИзменениеМетаданных.Учтено ЕСТЬ NULL)
	        |	И НЕ БТ_ПоказателиЗависимостьОтМетаданных.Ссылка.РучнойПоказатель
	        |	И БТ_ПоказателиЗависимостьОтМетаданных.Ссылка.Включен
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка,
	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата),
	        |	СписокОрганизаций.Организация,
	        |	Подразделения.БТ_НазваниеДляССП
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоказательСДатой.Показатель.ПериодичностьРасчетов КАК ПериодичностьРасчетов,
	        |	ВЫБОР
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	        |		ИНАЧЕ ПоказательСДатой.Дата
	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	        |	ВЫБОР
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	        |		ИНАЧЕ ПоказательСДатой.Дата
	        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	        |	ПоказательСДатой.Показатель КАК Ссылка,
	        |	ПоказательСДатой.Организация КАК Организация,
	        |	ПоказательСДатой.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ СписокПоказателейПересчета
	        |ИЗ
	        |	ПоказательСДатой КАК ПоказательСДатой
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
	        |		ПО ПоказательСДатой.Показатель = БТ_Показатели.Ссылка
	        |ГДЕ
	        |	НЕ БТ_Показатели.ПометкаУдаления
	        |	И БТ_Показатели.Включен
	        |	И НЕ БТ_Показатели.РучнойПоказатель
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокПоказателей.Ссылка КАК Ссылка,
	        |	ДатыРасчета.Дата КАК Дата,
	        |	СписокОрганизаций.Организация КАК Организация,
	        |	Подразделения.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ ВсеПоказатели
	        |ИЗ
	        |	Справочник.БТ_Показатели КАК СписокПоказателей,
	        |	ДатыРасчета КАК ДатыРасчета,
	        |	СписокОрганизаций КАК СписокОрганизаций,
	        |	Подразделения КАК Подразделения
	        |ГДЕ
	        |	НЕ СписокПоказателей.ПометкаУдаления
	        |	И СписокПоказателей.Включен
	        |	И НЕ СписокПоказателей.РучнойПоказатель
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеПоказатели.Ссылка КАК Ссылка,
	        |	ВсеПоказатели.Дата КАК Дата,
	        |	ВсеПоказатели.Организация КАК Организация,
	        |	ВсеПоказатели.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ НеРасчитанныеПоказатели
	        |ИЗ
	        |	ВсеПоказатели КАК ВсеПоказатели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
	        |		ПО ВсеПоказатели.Ссылка = БТ_ЗначенияПоказателей.Показатель
	        |			И ВсеПоказатели.Дата = БТ_ЗначенияПоказателей.Период
	        |			И ВсеПоказатели.Организация = БТ_ЗначенияПоказателей.Организация
	        |			И (НЕ БТ_ЗначенияПоказателей.План)
	        |			И ВсеПоказатели.БТ_НазваниеДляССП = БТ_ЗначенияПоказателей.Подразделение
	        |ГДЕ
	        |	БТ_ЗначенияПоказателей.Период ЕСТЬ NULL
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НеРасчитанныеПоказатели.Ссылка КАК Показатель,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.БТ_ТипРасчета.НаКонецПериода)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	        |	НеРасчитанныеПоказатели.Организация КАК Организация,
	        |	НеРасчитанныеПоказатели.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ПОМЕСТИТЬ Итог
	        |ИЗ
	        |	НеРасчитанныеПоказатели КАК НеРасчитанныеПоказатели,
	        |	ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НеРасчитанныеПоказатели.Ссылка,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ,
	        |	НеРасчитанныеПоказатели.Организация,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.БТ_ТипРасчета.НаКонецПериода)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ,
	        |	НеРасчитанныеПоказатели.БТ_НазваниеДляССП
	        |
	        |ОБЪЕДИНИТЬ
	        |
	        |ВЫБРАТЬ
	        |	СписокПоказателейПересчета.Ссылка,
	        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	        |	СписокПоказателейПересчета.ДатаОкончанияРасчета,
	        |	СписокПоказателейПересчета.Организация,
	        |	СписокПоказателейПересчета.БТ_НазваниеДляССП
	        |ИЗ
	        |	СписокПоказателейПересчета КАК СписокПоказателейПересчета
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	СписокПоказателейПересчета.Ссылка,
	        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	        |	СписокПоказателейПересчета.ДатаОкончанияРасчета,
	        |	СписокПоказателейПересчета.Организация,
	        |	СписокПоказателейПересчета.БТ_НазваниеДляССП
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Итог.Показатель КАК Показатель,
	        |	Итог.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	        |	Итог.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	        |	Итог.ДатаОкончанияРасчета КАК Период,
	        |	Итог.Организация КАК Организация,
	        |	Итог.Показатель.ЗначениеПоказателя КАК ЗначениеПоказателя,
	        |	Итог.Показатель.РучнойПоказатель КАК РучнойПоказатель,
	        |	Итог.Показатель.НовыйРасчетСПодразделениями КАК НовыйРасчетСПодразделениями,
	        |	Итог.БТ_НазваниеДляССП КАК БТ_НазваниеДляССП
	        |ИЗ
	        |	Итог КАК Итог
	        |ГДЕ
	        |	НЕ Итог.Показатель.РучнойПоказатель
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Показатель,
	        |	Период";
	
КонецФункции

Функция ПолучитьТекстЗапросаПоказательРасчета() 
	Возврат "ВЫБРАТЬ
	        |	Организации.Ссылка КАК Организация
	        |ПОМЕСТИТЬ СписокОрганизаций_old
	        |ИЗ
	        |	Справочник.Организации КАК Организации
	        |ГДЕ
	        |	НЕ Организации.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация
	        |ПОМЕСТИТЬ СписокОрганизаций
	        |ИЗ
	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |ГДЕ
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_КонстантныеЗначения.Значение КАК ДАТА) КАК Дата
	        |ПОМЕСТИТЬ ДатаНачалаРасчетаПоказателей
	        |ИЗ
	        |	РегистрСведений.БТ_КонстантныеЗначения КАК БТ_КонстантныеЗначения
	        |ГДЕ
	        |	БТ_КонстантныеЗначения.Параметр = ""ДатаНачалаРасчетаПоказателей""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	        |ПОМЕСТИТЬ ДатыРасчета
	        |ИЗ
	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	        |		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение >= ДатаНачалаРасчетаПоказателей.Дата
	        |ГДЕ
	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_КалендарьРаботы""
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка КАК Показатель,
	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата) КАК Дата,
	        |	СписокОрганизаций.Организация КАК Организация
	        |ПОМЕСТИТЬ ПоказательСДатой
	        |ИЗ
	        |	Справочник.БТ_Показатели.ЗависимостьОтМетаданных КАК БТ_ПоказателиЗависимостьОтМетаданных
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
	        |			ЛЕВОЕ СОЕДИНЕНИЕ ДатыРасчета КАК ДатыРасчета
	        |			ПО БТ_ИзменениеМетаданных.ДатаИзменения <= ДатыРасчета.Дата
	        |		ПО БТ_ПоказателиЗависимостьОтМетаданных.Документ = БТ_ИзменениеМетаданных.Метаданные,
	        |	СписокОрганизаций КАК СписокОрганизаций
	        |ГДЕ
	        |	(НЕ БТ_ИзменениеМетаданных.Учтено
	        |			ИЛИ БТ_ИзменениеМетаданных.Учтено ЕСТЬ NULL)
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка,
	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата),
	        |	СписокОрганизаций.Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПоказательСДатой.Показатель.ПериодичностьРасчетов КАК ПериодичностьРасчетов,
	        |	ВЫБОР
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	        |		ИНАЧЕ ПоказательСДатой.Дата
	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	        |	ВЫБОР
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	        |		ИНАЧЕ ПоказательСДатой.Дата
	        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	        |	ПоказательСДатой.Показатель КАК Ссылка,
	        |	ПоказательСДатой.Организация КАК Организация
	        |ПОМЕСТИТЬ СписокПоказателейПересчета
	        |ИЗ
	        |	ПоказательСДатой КАК ПоказательСДатой
	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
	        |		ПО ПоказательСДатой.Показатель = БТ_Показатели.Ссылка
	        |ГДЕ
	        |	НЕ БТ_Показатели.ПометкаУдаления
	        |	И БТ_Показатели.Включен
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	СписокПоказателей.Ссылка КАК Ссылка,
	        |	ДатыРасчета.Дата КАК Дата,
	        |	СписокОрганизаций.Организация КАК Организация
	        |ПОМЕСТИТЬ ВсеПоказатели
	        |ИЗ
	        |	Справочник.БТ_Показатели КАК СписокПоказателей,
	        |	ДатыРасчета КАК ДатыРасчета,
	        |	СписокОрганизаций КАК СписокОрганизаций
	        |ГДЕ
	        |	НЕ СписокПоказателей.ПометкаУдаления
	        |	И СписокПоказателей.Включен
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВсеПоказатели.Ссылка КАК Ссылка,
	        |	ВсеПоказатели.Дата КАК Дата,
	        |	ВсеПоказатели.Организация КАК Организация
	        |ПОМЕСТИТЬ НеРасчитанныеПоказатели
	        |ИЗ
	        |	ВсеПоказатели КАК ВсеПоказатели
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
	        |		ПО ВсеПоказатели.Ссылка = БТ_ЗначенияПоказателей.Показатель
	        |			И ВсеПоказатели.Дата = БТ_ЗначенияПоказателей.Период
	        |			И ВсеПоказатели.Организация = БТ_ЗначенияПоказателей.Организация
	        |			И (НЕ БТ_ЗначенияПоказателей.План)
	        |ГДЕ
	        |	(БТ_ЗначенияПоказателей.Период ЕСТЬ NULL ИЛИ &СчитатьВЛюбомСлучае)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	НеРасчитанныеПоказатели.Ссылка КАК Показатель,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.БТ_ТипРасчета.НаКонецПериода)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	        |	НеРасчитанныеПоказатели.Организация КАК Организация
	        |ПОМЕСТИТЬ Итог
	        |ИЗ
	        |	НеРасчитанныеПоказатели КАК НеРасчитанныеПоказатели,
	        |	ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	НеРасчитанныеПоказатели.Ссылка,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ,
	        |	НеРасчитанныеПоказатели.Организация,
	        |	ВЫБОР
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.БТ_ТипРасчета.НаКонецПериода)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	        |	КОНЕЦ
	        |
			//|ОБЪЕДИНИТЬ
			//|
			//|ВЫБРАТЬ
			//|	СписокПоказателейПересчета.Ссылка,
			//|	СписокПоказателейПересчета.ДатаНачалаРасчета,
			//|	СписокПоказателейПересчета.ДатаОкончанияРасчета,
			//|	СписокПоказателейПересчета.Организация
			//|ИЗ
			//|	СписокПоказателейПересчета КАК СписокПоказателейПересчета
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	СписокПоказателейПересчета.Ссылка,
			//|	СписокПоказателейПересчета.ДатаНачалаРасчета,
			//|	СписокПоказателейПересчета.ДатаОкончанияРасчета,
			//|	СписокПоказателейПересчета.Организация
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Итог.Показатель КАК Показатель,
	        |	Итог.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	        |	Итог.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	        |	Итог.ДатаОкончанияРасчета КАК Период,
	        |	Итог.Организация КАК Организация,
	        |	Итог.Показатель.ЗначениеПоказателя КАК ЗначениеПоказателя,
	        |	Итог.Показатель.РучнойПоказатель КАК РучнойПоказатель,
	        |	Итог.Показатель.НовыйРасчетСПодразделениями КАК НовыйРасчетСПодразделениями
	        |ИЗ
	        |	Итог КАК Итог
	        |ГДЕ
	        |	НЕ Итог.Показатель.РучнойПоказатель
	        |	И Итог.ДатаОкончанияРасчета МЕЖДУ &Дата1 И &Дата2";
	//Если не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВестиУчетВРазрезеОрганизаций") = Истина Тогда
	//	Возврат "ВЫБРАТЬ
	//	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	//	        |ПОМЕСТИТЬ ДатыРасчета
	//	        |ИЗ
	//	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	//	        |ГДЕ
	//	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_КалендарьРаботы""
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	//	        |ПОМЕСТИТЬ ССП_Организации
	//	        |ИЗ
	//	        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	//	        |ГДЕ
	//	        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	ВЫРАЗИТЬ(БТ_КонстантныеЗначения.Значение КАК ДАТА) КАК Дата
	//	        |ПОМЕСТИТЬ ДатаНачалаРасчетаПоказателей
	//	        |ИЗ
	//	        |	РегистрСведений.БТ_КонстантныеЗначения КАК БТ_КонстантныеЗначения
	//	        |ГДЕ
	//	        |	БТ_КонстантныеЗначения.Параметр = ""ДатаНачалаРасчетаПоказателей""
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка КАК Показатель,
	//	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата) КАК Дата
	//	        |ПОМЕСТИТЬ ПоказательСДатой
	//	        |ИЗ
	//	        |	Справочник.БТ_Показатели.ЗависимостьОтМетаданных КАК БТ_ПоказателиЗависимостьОтМетаданных
	//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
	//	        |			ЛЕВОЕ СОЕДИНЕНИЕ ДатыРасчета КАК ДатыРасчета
	//	        |			ПО БТ_ИзменениеМетаданных.ДатаИзменения <= ДатыРасчета.Дата
	//	        |		ПО БТ_ПоказателиЗависимостьОтМетаданных.Документ = БТ_ИзменениеМетаданных.Метаданные
	//	        |ГДЕ
	//	        |	(НЕ БТ_ИзменениеМетаданных.Учтено
	//	        |			ИЛИ БТ_ИзменениеМетаданных.Учтено ЕСТЬ NULL)
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка,
	//	        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата)
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	ПоказательСДатой.Показатель.ПериодичностьРасчетов КАК ПериодичностьРасчетов,
	//	        |	ВЫБОР
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	//	        |		ИНАЧЕ ПоказательСДатой.Дата
	//	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	//	        |	ВЫБОР
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	//	        |		ИНАЧЕ ПоказательСДатой.Дата
	//	        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	//	        |	ПоказательСДатой.Показатель КАК Ссылка
	//	        |ПОМЕСТИТЬ СписокПоказателейПересчета
	//	        |ИЗ
	//	        |	ПоказательСДатой КАК ПоказательСДатой
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
	//	        |		ПО ПоказательСДатой.Показатель = БТ_Показатели.Ссылка
	//	        |ГДЕ
	//	        |	НЕ БТ_Показатели.ПометкаУдаления
	//	        |	И БТ_Показатели.Включен
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	СписокПоказателей.Ссылка КАК Ссылка,
	//	        |	ДатыРасчета.Дата КАК Дата
	//	        |ПОМЕСТИТЬ ВсеПоказатели
	//	        |ИЗ
	//	        |	Справочник.БТ_Показатели КАК СписокПоказателей,
	//	        |	ДатыРасчета КАК ДатыРасчета
	//	        |ГДЕ
	//	        |	НЕ СписокПоказателей.ПометкаУдаления
	//	        |	И СписокПоказателей.Включен
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	ВсеПоказатели.Ссылка КАК Ссылка,
	//	        |	ВсеПоказатели.Дата КАК Дата
	//	        |ПОМЕСТИТЬ НеРасчитанныеПоказатели
	//	        |ИЗ
	//	        |	ВсеПоказатели КАК ВсеПоказатели
	//	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
	//	        |		ПО ВсеПоказатели.Ссылка = БТ_ЗначенияПоказателей.Показатель
	//	        |			И ВсеПоказатели.Дата = БТ_ЗначенияПоказателей.Период
	//	        |ГДЕ
	//	        |	БТ_ЗначенияПоказателей.Период ЕСТЬ NULL
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	НеРасчитанныеПоказатели.Ссылка КАК Показатель,
	//	        |	ВЫБОР
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//	        |	КОНЕЦ КАК ДатаНачалаРасчета,
	//	        |	ВЫБОР
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//	        |	КОНЕЦ КАК ДатаОкончанияРасчета
	//	        |ПОМЕСТИТЬ Итог
	//	        |ИЗ
	//	        |	НеРасчитанныеПоказатели КАК НеРасчитанныеПоказатели,
	//	        |	ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	НеРасчитанныеПоказатели.Ссылка,
	//	        |	ВЫБОР
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//	        |	КОНЕЦ,
	//	        |	ВЫБОР
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//	        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//	        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//	        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//	        |	КОНЕЦ
	//	        |
	//	        |ОБЪЕДИНИТЬ
	//	        |
	//	        |ВЫБРАТЬ
	//	        |	СписокПоказателейПересчета.Ссылка,
	//	        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	//	        |	СписокПоказателейПересчета.ДатаОкончанияРасчета
	//	        |ИЗ
	//	        |	СписокПоказателейПересчета КАК СписокПоказателейПересчета
	//	        |
	//	        |СГРУППИРОВАТЬ ПО
	//	        |	СписокПоказателейПересчета.Ссылка,
	//	        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	//	        |	СписокПоказателейПересчета.ДатаОкончанияРасчета
	//	        |;
	//	        |
	//	        |////////////////////////////////////////////////////////////////////////////////
	//	        |ВЫБРАТЬ
	//	        |	Итог.Показатель КАК Показатель,
	//	        |	Итог.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	//	        |	Итог.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	//	        |	Итог.ДатаОкончанияРасчета КАК Период,
	//	        |	Итог.Показатель.ЗначениеПоказателя КАК ЗначениеПоказателя
	//	        |ИЗ
	//	        |	Итог КАК Итог";
	//КонецЕсли;
	//Возврат "ВЫБРАТЬ
	//        |	Организации.Ссылка КАК Организация
	//        |ПОМЕСТИТЬ СписокОрганизаций_old
	//        |ИЗ
	//        |	Справочник.Организации КАК Организации
	//        |ГДЕ
	//        |	НЕ Организации.ПометкаУдаления
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация
	//        |ПОМЕСТИТЬ СписокОрганизаций
	//        |ИЗ
	//        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	//        |ГДЕ
	//        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ДАТА) КАК Дата
	//        |ПОМЕСТИТЬ ДатыРасчета
	//        |ИЗ
	//        |	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	//        |ГДЕ
	//        |	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_КалендарьРаботы""
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВЫРАЗИТЬ(БТ_КонстантныеЗначения.Значение КАК ДАТА) КАК Дата
	//        |ПОМЕСТИТЬ ДатаНачалаРасчетаПоказателей
	//        |ИЗ
	//        |	РегистрСведений.БТ_КонстантныеЗначения КАК БТ_КонстантныеЗначения
	//        |ГДЕ
	//        |	БТ_КонстантныеЗначения.Параметр = ""ДатаНачалаРасчетаПоказателей""
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка КАК Показатель,
	//        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата) КАК Дата,
	//        |	СписокОрганизаций.Организация КАК Организация
	//        |ПОМЕСТИТЬ ПоказательСДатой
	//        |ИЗ
	//        |	Справочник.БТ_Показатели.ЗависимостьОтМетаданных КАК БТ_ПоказателиЗависимостьОтМетаданных
	//        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
	//        |			ЛЕВОЕ СОЕДИНЕНИЕ ДатыРасчета КАК ДатыРасчета
	//        |			ПО БТ_ИзменениеМетаданных.ДатаИзменения <= ДатыРасчета.Дата
	//        |		ПО БТ_ПоказателиЗависимостьОтМетаданных.Документ = БТ_ИзменениеМетаданных.Метаданные,
	//        |	СписокОрганизаций КАК СписокОрганизаций
	//        |ГДЕ
	//        |	(НЕ БТ_ИзменениеМетаданных.Учтено
	//        |			ИЛИ БТ_ИзменениеМетаданных.Учтено ЕСТЬ NULL)
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	БТ_ПоказателиЗависимостьОтМетаданных.Ссылка,
	//        |	ЕСТЬNULL(ДатыРасчета.Дата, &ТекДата),
	//        |	СписокОрганизаций.Организация
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ПоказательСДатой.Показатель.ПериодичностьРасчетов КАК ПериодичностьРасчетов,
	//        |	ВЫБОР
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	//        |		ИНАЧЕ ПоказательСДатой.Дата
	//        |	КОНЕЦ КАК ДатаНачалаРасчета,
	//        |	ВЫБОР
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ДЕНЬ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, НЕДЕЛЯ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, МЕСЯЦ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, КВАРТАЛ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА ПоказательСДатой.Показатель.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(ПоказательСДатой.Дата, ГОД)
	//        |		ИНАЧЕ ПоказательСДатой.Дата
	//        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	//        |	ПоказательСДатой.Показатель КАК Ссылка,
	//        |	ПоказательСДатой.Организация КАК Организация
	//        |ПОМЕСТИТЬ СписокПоказателейПересчета
	//        |ИЗ
	//        |	ПоказательСДатой КАК ПоказательСДатой
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_Показатели КАК БТ_Показатели
	//        |		ПО ПоказательСДатой.Показатель = БТ_Показатели.Ссылка
	//        |ГДЕ
	//        |	НЕ БТ_Показатели.ПометкаУдаления
	//        |	И БТ_Показатели.Включен
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	СписокПоказателей.Ссылка КАК Ссылка,
	//        |	ДатыРасчета.Дата КАК Дата,
	//        |	СписокОрганизаций.Организация КАК Организация
	//        |ПОМЕСТИТЬ ВсеПоказатели
	//        |ИЗ
	//        |	Справочник.БТ_Показатели КАК СписокПоказателей,
	//        |	ДатыРасчета КАК ДатыРасчета,
	//        |	СписокОрганизаций КАК СписокОрганизаций
	//        |ГДЕ
	//        |	НЕ СписокПоказателей.ПометкаУдаления
	//        |	И СписокПоказателей.Включен
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	ВсеПоказатели.Ссылка КАК Ссылка,
	//        |	ВсеПоказатели.Дата КАК Дата,
	//        |	ВсеПоказатели.Организация КАК Организация
	//        |ПОМЕСТИТЬ НеРасчитанныеПоказатели
	//        |ИЗ
	//        |	ВсеПоказатели КАК ВсеПоказатели
	//        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
	//        |		ПО ВсеПоказатели.Ссылка = БТ_ЗначенияПоказателей.Показатель
	//        |			И ВсеПоказатели.Дата = БТ_ЗначенияПоказателей.Период
	//        |			И ВсеПоказатели.Организация = БТ_ЗначенияПоказателей.Организация
	//        |ГДЕ
	//        |	БТ_ЗначенияПоказателей.Период ЕСТЬ NULL
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	НеРасчитанныеПоказатели.Ссылка КАК Показатель,
	//        |	ВЫБОР
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//        |	КОНЕЦ КАК ДатаНачалаРасчета,
	//        |	ВЫБОР
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//        |	КОНЕЦ КАК ДатаОкончанияРасчета,
	//        |	НеРасчитанныеПоказатели.Организация КАК Организация
	//        |ПОМЕСТИТЬ Итог
	//        |ИЗ
	//        |	НеРасчитанныеПоказатели КАК НеРасчитанныеПоказатели,
	//        |	ДатаНачалаРасчетаПоказателей КАК ДатаНачалаРасчетаПоказателей
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	НеРасчитанныеПоказатели.Ссылка,
	//        |	ВЫБОР
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА КОНЕЦПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//        |	КОНЕЦ,
	//        |	ВЫБОР
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежедневно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ДЕНЬ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Еженедельно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, НЕДЕЛЯ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежемесячно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, МЕСЯЦ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Поквартально)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, КВАРТАЛ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.ПоПолугодию)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ПОЛУГОДИЕ)
	//        |		КОГДА НеРасчитанныеПоказатели.Ссылка.ПериодичностьРасчетов = ЗНАЧЕНИЕ(Перечисление.БТ_периодичность.Ежегодно)
	//        |			ТОГДА НАЧАЛОПЕРИОДА(НеРасчитанныеПоказатели.Дата, ГОД)
	//        |		ИНАЧЕ НеРасчитанныеПоказатели.Дата
	//        |	КОНЕЦ,
	//        |	НеРасчитанныеПоказатели.Организация
	//        |
	//        |ОБЪЕДИНИТЬ
	//        |
	//        |ВЫБРАТЬ
	//        |	СписокПоказателейПересчета.Ссылка,
	//        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	//        |	СписокПоказателейПересчета.ДатаОкончанияРасчета,
	//        |	СписокПоказателейПересчета.Организация
	//        |ИЗ
	//        |	СписокПоказателейПересчета КАК СписокПоказателейПересчета
	//        |
	//        |СГРУППИРОВАТЬ ПО
	//        |	СписокПоказателейПересчета.Ссылка,
	//        |	СписокПоказателейПересчета.ДатаНачалаРасчета,
	//        |	СписокПоказателейПересчета.ДатаОкончанияРасчета,
	//        |	СписокПоказателейПересчета.Организация
	//        |;
	//        |
	//        |////////////////////////////////////////////////////////////////////////////////
	//        |ВЫБРАТЬ
	//        |	Итог.Показатель КАК Показатель,
	//        |	Итог.ДатаНачалаРасчета КАК ДатаНачалаРасчета,
	//        |	Итог.ДатаОкончанияРасчета КАК ДатаОкончанияРасчета,
	//        |	Итог.ДатаОкончанияРасчета КАК Период,
	//        |	Итог.Организация КАК Организация,
	//        |	Итог.Показатель.ЗначениеПоказателя КАК ЗначениеПоказателя
	//        |ИЗ
	//        |	Итог КАК Итог";
	
КонецФункции

Процедура БТ_РасчетИВыгрузкаПоказателей(параметр1 = Неопределено, параметр2 = Неопределено) Экспорт
	ПроизвестиРасчетПоказателей(,,,Истина);
КонецПроцедуры

Процедура БТ_РасчетИВыгрузкаПоказателейПересчет(параметр1 = Неопределено, параметр2 = Неопределено) Экспорт
	ПроизвестиРасчетПоказателей(,,,Ложь);
	
	ПересчетПоказателейФоново();
КонецПроцедуры

Функция ВыполнитьРасчет(Выборка, ПодразделениеКомпании = Неопределено, БТ_НазваниеДляССП = Неопределено) Экспорт
	//Знач НачПериода,Знач КонПериода,Знач Показатель, Знач Организация=Неопределено) Экспорт
	Попытка
		Показатель = Выборка.Показатель;
		
		Если Ложь Тогда Показатель = Справочники.БТ_Показатели.ПустаяСсылка(); КонецЕсли;
		
		Если Показатель.ВидПоказателя=Перечисления.БТ_ВидПоказателя.Запрос Тогда
			
			Запрос=Новый Запрос();
			
			Если ПодразделениеКомпании = Неопределено Тогда
				
				Запрос.Текст = Показатель.ТекстЗапроса;
				
			Иначе
				
				Запрос.Текст = СтрЗаменить(Показатель.ТекстЗапроса, "ИЛИ &ПодразделениеКомпании = НЕОПРЕДЕЛЕНО", "");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ &БТ_НазваниеДляССП = НЕОПРЕДЕЛЕНО", "");
				
			КонецЕсли;
			
			
			
			Для Каждого ТекПараметр Из Показатель.Параметры Цикл 
				
				Если ТекПараметр.ИмяПараметра = "ПодразделениеКомпании" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, ПодразделениеКомпании);
					
				ИначеЕсли ТекПараметр.ИмяПараметра = "БТ_НазваниеДляССП" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, БТ_НазваниеДляССП);
					
				ИначеЕсли Не ТекПараметр.ЭтоВыражение Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра,ТекПараметр.ЗначениеПараметра);
					
				Иначе
					
					ТекЗнач="";
					Выполнить("ТекЗнач="+ТекПараметр.ЗначениеПараметра);
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра,ТекЗнач);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="НачалоПериода" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.ДатаНачалаРасчета);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="КонецПериода" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.ДатаОкончанияРасчета);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="Организация" и не Выборка.Организация=Неопределено Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, Выборка.Организация);
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра = "ПодразделениеКомпании" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, ПодразделениеКомпании);
					
				КонецЕсли;   
				
				Если ТекПараметр.ИмяПараметра = "БТ_НазваниеДляССП" Тогда
					
					Запрос.УстановитьПараметр(ТекПараметр.ИмяПараметра, БТ_НазваниеДляССП);
					
				КонецЕсли;
				
			КонецЦикла;
			
			Рез = Запрос.Выполнить().Выгрузить();
			
			ПоляГрупировки = "";
			Для каждого ТекСтр из Показатель.Аналитика Цикл
				
				ПоляГрупировки = ПоляГрупировки + ?(ПустаяСтрока(ПоляГрупировки),"",",") + ТекСтр.Аналитика.Наименование;
				
			КонецЦикла;
			
			Рез.Свернуть(ПоляГрупировки,Показатель.ЗначениеПоказателя);
			
			//Возврат Рез;
			Возврат Рез;//.Итог(Показатель.ЗначениеПоказателя);
			
		ИначеЕсли Показатель.ВидПоказателя=Перечисления.БТ_ВидПоказателя.Модуль Тогда
			
			СтрокаПараметров="";
			Сч=-1;
			
			Для Каждого ТекПараметр Из Показатель.Параметры Цикл 
				
				Сч=Сч+1;
				
				Если ТекПараметр.ИмяПараметра="НачПериода" Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.ДатаНачалаРасчета;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="КонПериода" Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.ДатаОкончанияРасчета;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;
				
				Если ТекПараметр.ИмяПараметра="Организация" и не Выборка.Организация=Неопределено Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"=Выборка.Организация;";
					Выполнить(Строка);
					Продолжить;
					
				КонецЕсли;

				Если ТекПараметр.ЭтоВыражение Тогда
					
					Строка=ТекПараметр.ИмяПараметра+"="+ТекПараметр.ЗначениеПараметра+";";
					СтрокаПараметров=СтрокаПараметров+Строка+"
					|";
					
				Иначе
					
					Строка=ТекПараметр.ИмяПараметра+"=Показатель.Параметры["+Сч+"].ЗначениеПараметра;";
					СтрокаПараметров=СтрокаПараметров+Строка+"
					|";
					
				КонецЕсли;
				
			КонецЦикла;
			
			//выполним модуль
			ТаблицаМодуля=Новый ТаблицаЗначений;
			Выполнить(СтрокаПараметров+Показатель.ПроизвольныйМодуль);
			Возврат ТаблицаМодуля.Итог(Показатель.ЗначениеПоказателя);
			
		КонецЕсли;
		
	Исключение
		
		Возврат ОписаниеОшибки();
		
	КонецПопытки;
КонецФункции

Процедура БТ_ВыгрузкаПоказателей(Ключ) Экспорт
	
	ВыгрузитьДанные('20230101');
	
КонецПроцедуры

Процедура СнятьФлагВыгружен(Дата1 = Неопределено, Дата2 = Неопределено) Экспорт   
	Если Не ЗначениеЗаполнено(Дата1) Тогда 
		Дата1 = НачалоДня(ТекущаяДатаСеанса()-86400);
		Дата2 = НачалоДня(ТекущаяДатаСеанса()); 
		
		Обр = Обработки.БТ_ВыборочныйРасчетПоказателей
	КонецЕсли;	
КонецПроцедуры	
