
Функция ЗагрузитьПрайсЛист(ПрайсЛист, СтрокаПодключения = Неопределено, КлючЗадания = Неопределено) Экспорт
	
	ОбработкаЗагрузки = Обработки.ЗагрузкаПрайсЛистов.Создать();
	ОбработкаЗагрузки.ПрайсЛистКонтрагента = ПрайсЛист;
	Возврат ОбработкаЗагрузки.ЗагрузитьПрайсЛистДляРазбора(СтрокаПодключения, КлючЗадания);
	
КонецФункции

Функция ЗагрузитьПрайсЛистИзНовогоФайла(ПрайсЛист, КлючЗадания = Неопределено) Экспорт
	
	ПрайсЛистОбъект = ПрайсЛист.ПолучитьОбъект();
	Возврат ПрайсЛистОбъект.ЗагрузитьНовыйПрайсЛист(КлючЗадания);
	
КонецФункции

