Перем СкладКомпании Экспорт;   // Справочник.СкладыКомпании ИЛИ Массив. Содержит склад(ы) по которым сдвигается граница последовательности
Перем МоментВремени Экспорт;   // Дата-время документа
Перем ДокументСсылка Экспорт;  // Ссылка на документ
Перем СкладКомпанииБыл Экспорт; // Склад(ы) до изменения
Перем МоментВремениБыл Экспорт;   // Дата-время документа до изменения


// проверяет, надо ли двигать границу последовательности и если надо - сдвигает
Функция ИзменитьГраницу(БезПроверок=Ложь) Экспорт
	
	МассивСкладовНовые = Новый Массив();
	МассивСкладовСтарые = Новый Массив();
	// фильтр на склады
	МассивСкладовФильтр = Новый Массив();
	Если ТипЗнч(СкладКомпании)<>Тип("Массив") Тогда
		МассивСкладовФильтр.Добавить(СкладКомпании);
		МассивСкладовНовые.Добавить(СкладКомпании);
	Иначе
		Для Каждого Склад Из СкладКомпании Цикл
			МассивСкладовФильтр.Добавить(Склад);
			МассивСкладовНовые.Добавить(Склад);
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(СкладКомпанииБыл) И ТипЗнч(СкладКомпанииБыл)<>Тип("Массив") И МассивСкладовНовые.Найти(СкладКомпанииБыл)=Неопределено Тогда
		МассивСкладовФильтр.Добавить(СкладКомпанииБыл);
		МассивСкладовСтарые.Добавить(СкладКомпанииБыл);
	ИначеЕсли ЗначениеЗаполнено(СкладКомпанииБыл) Тогда
		Для Каждого Склад Из СкладКомпанииБыл Цикл
			Если МассивСкладовНовые.Найти(Склад)=Неопределено Тогда
				МассивСкладовФильтр.Добавить(Склад);
				МассивСкладовСтарые.Добавить(Склад);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// получаем текущую границу
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	СкладКомпании КАК СкладКомпании,
	|	МоментВремени КАК МоментВремени,
	|	ДокументСсылка КАК ДокументСсылка
	|ИЗ
	|	РегистрСведений.ГраницыАвтомобилиОрдерныйСклад
	|ГДЕ
	|	СкладКомпании В(&СкладыКомпании)
	|");
	Запрос.УстановитьПараметр("СкладыКомпании",МассивСкладовФильтр);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	МоментВремениДокумента = ?(ТипЗнч(МоментВремени)=Тип("МоментВремени") И ДокументСсылка<>Неопределено, Новый МоментВремени(Мин(ДокументСсылка.Дата, МоментВремени.Дата), ДокументСсылка), Новый МоментВремени(МоментВремени, ДокументСсылка));
	Если ЗначениеЗаполнено(МоментВремениБыл) Тогда
		МоментВремениДокумента = ?(МоментВремениДокумента.Сравнить(МоментВремениБыл)=1,МоментВремениБыл,МоментВремениДокумента);
	КонецЕсли;
	// идем по новым складам и смотрим надо ли сдвинуть границу
	Для Каждого Склад Из МассивСкладовНовые Цикл
		ДвигаемГраницу = Ложь;
		СтрокаРезультата = ТаблицаРезультата.Найти(Склад,"СкладКомпании");

		Если СтрокаРезультата=Неопределено Тогда
			ДвигаемГраницу = Истина;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(СтрокаРезультата.ДокументСсылка) Тогда
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени,СтрокаРезультата.ДокументСсылка);
			Иначе
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени);
			КонецЕсли;
			ДвигаемГраницу = (МоментВремениГраницы.Сравнить(МоментВремениДокумента) = 1);
		КонецЕсли;
		
		// если границу надо двигать, двигаем
		Если ДвигаемГраницу ИЛИ БезПроверок Тогда
			НоваяЗапись = РегистрыСведений.ГраницыАвтомобилиОрдерныйСклад.СоздатьМенеджерЗаписи();
			НоваяЗапись.СкладКомпании = Склад;
			НоваяЗапись.МоментВремени = МоментВремениДокумента.Дата;
			НоваяЗапись.ДокументСсылка = МоментВремениДокумента.Ссылка;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// теперь тот-же проход, но по старым складам
	Для Каждого Склад Из МассивСкладовСтарые Цикл
		ДвигаемГраницу = Ложь;
		СтрокаРезультата = ТаблицаРезультата.Найти(Склад,"СкладКомпании");
				
		Если СтрокаРезультата=Неопределено Тогда
			ДвигаемГраницу = Истина;
		Иначе
			Если НЕ обЗначениеНеЗаполнено(СтрокаРезультата.ДокументСсылка) Тогда
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени,СтрокаРезультата.ДокументСсылка);
			Иначе
				МоментВремениГраницы = Новый МоментВремени(СтрокаРезультата.МоментВремени);
			КонецЕсли;
			ДвигаемГраницу = (МоментВремениГраницы.Сравнить(МоментВремениБыл) = 1);
		КонецЕсли;
		
		// если границу надо двигать, двигаем
		Если ДвигаемГраницу ИЛИ БезПроверок Тогда
			НоваяЗапись = РегистрыСведений.ГраницыАвтомобилиОрдерныйСклад.СоздатьМенеджерЗаписи();
			НоваяЗапись.СкладКомпании = Склад;
			НоваяЗапись.МоментВремени = МоментВремениБыл.Дата;
			НоваяЗапись.ДокументСсылка = МоментВремениБыл.Ссылка;
			НоваяЗапись.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// убираем циклические ссылки
	ДокументСсылка = Неопределено;
	
	Возврат Истина;
КонецФункции

// вызывается при непосредственном удалении проведенного документа
// проверяет есть ли граница с таким документом, если есть, то очищает ссылку
Процедура УбратьСсылку(Ссылка) Экспорт
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	СкладКомпании,
	|	МоментВремени
	|ИЗ
	|	РегистрСведений.ГраницыАвтомобилиОрдерныйСклад 
	|ГДЕ
	|	ДокументСсылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.ГраницыАвтомобилиОрдерныйСклад.СоздатьМенеджерЗаписи();
			НоваяЗапись.СкладКомпании = Выборка.СкладКомпании;
			НоваяЗапись.МоментВремени = Выборка.МоментВремени;
			НоваяЗапись.ДокументСсылка = Неопределено;
			НоваяЗапись.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры