
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("ПодразделениеКомпании");
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("ДоговорВзаиморасчетов");
	СтруктураСвойств.Вставить("ЗаказНаряд");
	СтруктураСвойств.Вставить("Работа");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);

КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

