
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Для Каждого Документ из Ссылка цикл
		Если Документ.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда		
			//Печатаем акт по страховым компаниям
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	DN_АктСверкиКредитСтрах.Организация КАК Организация,
			|	DN_АктСверкиКредитСтрах.НаДату КАК НаДату,
			|	DN_АктСверкиКредитСтрах.ХозОперация КАК ХозОперация,
			|	DN_АктСверкиКредитСтрах.Контрагент КАК Контрагент,
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	DN_АктСверкиКредитСтрах.Проведен КАК Проведен,
			|	DN_АктСверкиКредитСтрах.РабочиеЛисты.(
			|		НомерСтроки КАК НомерСтроки,
			|		Клиент КАК Клиент,
			|		БланкКСО КАК БланкКСО,
			|		ДатаЛиста КАК ДатаЛиста,
			|		ПроцентКомиссии КАК ПроцентКомиссии,
			|		ОбщаяСуммаАВ КАК ОбщаяСуммаАВ,
			|		Брутто КАК Брутто,
			|		Нетто КАК Нетто,
			|		Удержание КАК Удержание,
			|		Расхождение КАК Расхождение,
			|		АВПоАкту КАК АВПоАкту
			|	) КАК РабочиеЛисты,
			|	DN_АктСверкиКредитСтрах.Дата КАК Дата,
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов.НомерДоговора КАК ДоговорВзаиморасчетовНомерДоговора,
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов.ДатаНачала КАК ДоговорВзаиморасчетовДатаНачала,
			|	DN_АктСверкиКредитСтрах.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
			|	DN_АктСверкиКредитСтрах.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное,
			|	DN_АктСверкиКредитСтрах.Номер КАК Номер
			|ИЗ
			|	Документ.DN_АктСверкиКредитСтрах КАК DN_АктСверкиКредитСтрах
			|ГДЕ
			|	DN_АктСверкиКредитСтрах.Ссылка = &Ссылка";
			Запрос.Параметры.Вставить("Ссылка", Документ);
			Выборка = Запрос.Выполнить().Выбрать();
								
			Макет = Документы.DN_АктСверкиКредитСтрах.ПолучитьМакет("ПечатьСтраховой");
			
			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			Шапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьРабочиеЛистыШапка = Макет.ПолучитьОбласть("РабочиеЛистыШапка");
			ОбластьРабочиеЛисты = Макет.ПолучитьОбласть("РабочиеЛисты");
			Итоги = Макет.ПолучитьОбласть("Итоги");
			Подвал = Макет.ПолучитьОбласть("Подвал");
	
			ТабДок.Очистить();

			ВставлятьРазделительСтраниц = Ложь;
			Пока Выборка.Следующий() Цикл
				
				Если ВставлятьРазделительСтраниц Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

				ОбластьЗаголовок.Параметры.НомерДоговора = Выборка.ДоговорВзаиморасчетовНомерДоговора;
				ОбластьЗаголовок.Параметры.ДатаДоговора = Формат(Выборка.ДоговорВзаиморасчетовДатаНачала,"ДФ=dd.MM.yyyy");
				ТабДок.Вывести(ОбластьЗаголовок);
				
				Если Выборка.Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо тогда
					ОбластьТекста = Макет.Область("R12C2:R16C4");
					ОбластьТекста.Объединить();
					ОбластьТекста.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон; 
					
					Текст = "	Мы, ниже подписавшиеся, [Организация], именуемое в дальнейшем «Страховой агент», в лице [Должность] [Руководитель], действующего на основании Устава с одной стороны, и  [Контрагент], именуемое в дальнейшем «Страховщик», в лице [ДолжностьКА] [ЛицоКонтрагента], с другой стороны, составили настоящий Акт о том, что на дату [НаДату]. Страховым агентом по [ДоговорВзаиморасчетов] (Далее – Договор) надлежащим образом совершены действия, предусмотренные пунктом 1.1.2. Договора, в частности Страховым агентом заключены (подписаны) от имени Страховщика перечисленные ниже договоры (полисы) страхования";
					
					ОбластьТекста.Текст = Текст;
										
					//Чтение значения для руководителя
					СтруктураОтбора = Новый Структура("Организация,Объект",Выборка.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
					СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ТекущаяДата(),СтруктураОтбора);
					Руководитель = СтруктураСведений.Значение;
					Шапка = Макет.ПолучитьОбласть("Шапка");				
					
					Должность = ПолучитьСклоненияСтроки(Строка(Руководитель.Должность), "ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.Должность = Должность[0];
					
					РуководительРод = ПолучитьСклоненияСтроки(Строка(Руководитель), "ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.Руководитель = РуководительРод[0];  					
					Подвал.Параметры.Руководитель = Руководитель; 

				Иначе
					Подвал.Параметры.Руководитель = Выборка.Организация.Наименование;
				КонецЕсли;
				
				Шапка.Параметры.ХозОперация = Выборка.ХозОперация;
				Шапка.Параметры.ДокНомер = Выборка.Номер;
				Шапка.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				Шапка.Параметры.Организация = Выборка.ОрганизацияНаименованиеПолное;
				Шапка.Параметры.Контрагент = Выборка.КонтрагентНаименованиеПолное;
				Шапка.Параметры.НаДату = Формат(Выборка.НаДату,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов;
				
				ЛицоКонтрагента = Неопределено;
				ТаблицаВедомых = Неопределено;
				Если РаботаСКонтактнымиЛицами.ПолучитьВедомых(Выборка.Контрагент, ТаблицаВедомых) Тогда
					Для Каждого Строка Из ТаблицаВедомых Цикл
						Если Строка.Основной тогда
							ЛицоКонтрагента = Строка.Ведомый;
							ДолжностьКА = Строка.Должность;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ ЛицоКонтрагента = Неопределено тогда
					ЛицоКонтрагентаРод = ПолучитьСклоненияСтроки(Строка(ЛицоКонтрагента),, "ПД=Родительный");
					ДолжностьКАРод = ПолучитьСклоненияСтроки(Строка(ДолжностьКА),"ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.ДолжностьКА = ДолжностьКАРод[0];
					Шапка.Параметры.ЛицоКонтрагента = ЛицоКонтрагентаРод[0];
				КонецЕсли;
				
				ТабДок.Вывести(Шапка);

				ТабДок.Вывести(ОбластьРабочиеЛистыШапка);
				ВыборкаРабочиеЛисты = Выборка.РабочиеЛисты.Выбрать();
				
				ИтогоСтрахПремия = 0;ИтогоКПеречислению = 0;
				Пока ВыборкаРабочиеЛисты.Следующий() Цикл
					ОбластьРабочиеЛисты.Параметры.Заполнить(ВыборкаРабочиеЛисты);
					
					Если ВыборкаРабочиеЛисты.Удержание тогда
						//ОбластьРабочиеЛисты.Параметры.КПеречислению = ВыборкаРабочиеЛисты.Нетто; 
						ОбластьРабочиеЛисты.Параметры.КПеречислению = ВыборкаРабочиеЛисты.Нетто-ВыборкаРабочиеЛисты.Расхождение;
						ОбластьРабочиеЛисты.Параметры.Удержание = "Да";
						ИтогоКПеречислению = ИтогоКПеречислению + ВыборкаРабочиеЛисты.Нетто-ВыборкаРабочиеЛисты.Расхождение;
					Иначе
						ОбластьРабочиеЛисты.Параметры.КПеречислению = ВыборкаРабочиеЛисты.Брутто;
						ОбластьРабочиеЛисты.Параметры.Удержание = "Нет";
						ИтогоКПеречислению = ИтогоКПеречислению + ВыборкаРабочиеЛисты.Брутто;
					КонецЕсли;
					
					ОбластьРабочиеЛисты.Параметры.ДатаЛиста = Формат(ВыборкаРабочиеЛисты.ДатаЛиста,"ДФ=dd.MM.yyyy");
					ИтогоСтрахПремия = ИтогоСтрахПремия + ВыборкаРабочиеЛисты.Брутто;				
					ТабДок.Вывести(ОбластьРабочиеЛисты, ВыборкаРабочиеЛисты.Уровень());
					
				КонецЦикла;

				Итоги.Параметры.ИтогКПеречислению = ИтогоКПеречислению;
				Итоги.Параметры.ИтогПолучено = ИтогоСтрахПремия;
				Итоги.Параметры.СуммаПрописью = ЧислоПрописью(ИтогоКПеречислению, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
				ТабДок.Вывести(Итоги);
				
				Подвал.Параметры.ЛицоКонтрагента = ЛицоКонтрагента;
				ТабДок.Вывести(Подвал);

				ВставлятьРазделительСтраниц = Истина;
				
			КонецЦикла;
		//Печатаем акт по кредитным компаниям
		Иначе
			Макет = Документы.DN_АктСверкиКредитСтрах.ПолучитьМакет("ПечатьКредитный");
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов.НомерДоговора КАК ДоговорВзаиморасчетовНомерДоговора,
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов.ДатаНачала КАК ДоговорВзаиморасчетовДатаНачала,
			|	DN_АктСверкиКредитСтрах.ХозОперация КАК ХозОперация,
			|	DN_АктСверкиКредитСтрах.Номер КАК Номер,
			|	DN_АктСверкиКредитСтрах.Дата КАК Дата,
			|	DN_АктСверкиКредитСтрах.Организация КАК Организация,
			|	DN_АктСверкиКредитСтрах.Контрагент КАК Контрагент,
			|	DN_АктСверкиКредитСтрах.НаДату КАК НаДату,
			|	DN_АктСверкиКредитСтрах.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
			|	DN_АктСверкиКредитСтрах.РабочиеЛисты.(
			|		НомерСтроки КАК НомерСтроки,
			|		Автомобиль КАК Автомобиль,
			|		VIN КАК VIN,
			|		Клиент КАК Клиент,
			|		Программа КАК Программа,
			|		ДатаЛиста КАК ДатаЛиста,
			|		СтоимостьАвтомобиля КАК СтоимостьАвтомобиля,
			|		СуммаКредита КАК СуммаКредита,
			|		ОбщаяСуммаАВ КАК ОбщаяСуммаАВ
			|	) КАК РабочиеЛисты,
			|	DN_АктСверкиКредитСтрах.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
			|	DN_АктСверкиКредитСтрах.Контрагент.НаименованиеПолное КАК КонтрагентНаименованиеПолное
			|ИЗ
			|	Документ.DN_АктСверкиКредитСтрах КАК DN_АктСверкиКредитСтрах
			|ГДЕ
			|	DN_АктСверкиКредитСтрах.Ссылка = &Ссылка";
			Запрос.Параметры.Вставить("Ссылка", Документ);
			Выборка = Запрос.Выполнить().Выбрать();

			ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
			Шапка = Макет.ПолучитьОбласть("Шапка");
			ОбластьРабочиеЛистыШапка = Макет.ПолучитьОбласть("РабочиеЛистыШапка");
			ОбластьРабочиеЛисты = Макет.ПолучитьОбласть("РабочиеЛисты");
			Итоги = Макет.ПолучитьОбласть("Итоги");
			Подвал = Макет.ПолучитьОбласть("Подвал");

			ТабДок.Очистить();

			ВставлятьРазделительСтраниц = Ложь;
			Пока Выборка.Следующий() Цикл
				Если ВставлятьРазделительСтраниц Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;

				ОбластьЗаголовок.Параметры.НомерДоговора = Выборка.ДоговорВзаиморасчетовНомерДоговора;
				ОбластьЗаголовок.Параметры.ДатаДоговора = Формат(Выборка.ДоговорВзаиморасчетовДатаНачала,"ДФ=dd.MM.yyyy");
				ТабДок.Вывести(ОбластьЗаголовок);

				Если Выборка.Организация.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо тогда
					
					ОбластьТекста = Макет.Область("R12C2:R16C4");
					ОбластьТекста.Объединить();
					ОбластьТекста.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон; 
					
					Текст = "	Мы, ниже подписавшиеся, [Организация], именуемое в дальнейшем «Кредитный агент», в лице [Должность] [Руководитель], действующего на основании Устава с одной стороны, и  [Контрагент], именуемое в дальнейшем «Кредитор», в лице [ДолжностьКА] [ЛицоКонтрагента], с другой стороны, составили настоящий Акт о том, что на дату [НаДату]. Кредитным агентом по [ДоговорВзаиморасчетов] (Далее – Договор) надлежащим образом совершены действия, предусмотренные пунктом 1.1.2. Договора, в частности Кредитным агентом заключены (подписаны) от имени Кредитора перечисленные ниже договоры кредитования";
					
					ОбластьТекста.Текст = Текст;
										
					//Чтение значения для руководителя
					СтруктураОтбора = Новый Структура("Организация,Объект",Выборка.Организация,Перечисления.ВидыОбъектовСведений.Руководитель);
					СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ТекущаяДата(),СтруктураОтбора);
					Руководитель = СтруктураСведений.Значение;
					
					Шапка = Макет.ПолучитьОбласть("Шапка");				
					
					Должность = ПолучитьСклоненияСтроки(Строка(Руководитель.Должность), "ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.Должность = Должность[0];
					
					РуководительРод = ПолучитьСклоненияСтроки(Строка(Руководитель), "ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.Руководитель = РуководительРод[0];  					
					Подвал.Параметры.Руководитель = Руководитель;
					
				Иначе
					Подвал.Параметры.Руководитель = Выборка.Организация.Наименование;
				КонецЕсли;
				
				Шапка.Параметры.ХозОперация = Выборка.ХозОперация;
				Шапка.Параметры.ДокНомер = Выборка.Номер;
				Шапка.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
				Шапка.Параметры.Организация = Выборка.ОрганизацияНаименованиеПолное;
				Шапка.Параметры.Контрагент = Выборка.КонтрагентНаименованиеПолное;
				Шапка.Параметры.НаДату = Формат(Выборка.НаДату,"ДФ=dd.MM.yyyy");
				Шапка.Параметры.ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов;
				
				ЛицоКонтрагента = Неопределено;
				ТаблицаВедомых = Неопределено;
				Если РаботаСКонтактнымиЛицами.ПолучитьВедомых(Выборка.Контрагент, ТаблицаВедомых) Тогда
					Для Каждого Строка Из ТаблицаВедомых Цикл
						Если Строка.Основной тогда
							ЛицоКонтрагента = Строка.Ведомый;
							ДолжностьКА = Строка.Должность;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если НЕ ЛицоКонтрагента = Неопределено тогда
					ЛицоКонтрагентаРод = ПолучитьСклоненияСтроки(Строка(ЛицоКонтрагента),, "ПД=Родительный");
					ДолжностьКАРод = ПолучитьСклоненияСтроки(Строка(ДолжностьКА),"ПЛ=Мужской", "ПД=Родительный");
					Шапка.Параметры.ДолжностьКА = ДолжностьКАРод[0];
					Шапка.Параметры.ЛицоКонтрагента = ЛицоКонтрагентаРод[0];
				КонецЕсли;
				
				ТабДок.Вывести(Шапка);

				ТабДок.Вывести(ОбластьРабочиеЛистыШапка);
				ВыборкаРабочиеЛисты = Выборка.РабочиеЛисты.Выбрать();
				
				ИтогоКредитов = 0;ИтогСуммаАВ = 0;
				Пока ВыборкаРабочиеЛисты.Следующий() Цикл
					ОбластьРабочиеЛисты.Параметры.Заполнить(ВыборкаРабочиеЛисты);
					ИтогСуммаАВ = ИтогСуммаАВ + ВыборкаРабочиеЛисты.ОбщаяСуммаАВ;							
					ИтогоКредитов = ИтогоКредитов + ВыборкаРабочиеЛисты.СуммаКредита;				
					ТабДок.Вывести(ОбластьРабочиеЛисты, ВыборкаРабочиеЛисты.Уровень());
					
				КонецЦикла;

				Итоги.Параметры.ИтогоКредитов = ИтогоКредитов;
				Итоги.Параметры.ИтогСуммаАВ = ИтогСуммаАВ;
				Итоги.Параметры.СуммаПрописью = ЧислоПрописью(ИтогСуммаАВ, "Л=ru_RU;ДП=Истина", "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");;
				ТабДок.Вывести(Итоги);
				
				Подвал.Параметры.ЛицоКонтрагента = ЛицоКонтрагента;
				ТабДок.Вывести(Подвал);

				ВставлятьРазделительСтраниц = Истина;
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры
