
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Справочник = "";
	Если Параметры.Свойство("Справочник",Справочник) Тогда
		
		СписокИсключения.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка."+Справочник);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = &Наименование
		|	И НЕ БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение";
	
	Запрос.УстановитьПараметр("Наименование", "СписокИсключенияДляДЗ"+Справочник);
	
	СписокИсключения.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Спр = Справочники.БТ_СписокКонстантныхЗначений.НайтиПоНаименованию("СписокИсключенияДляДЗ"+Справочник);
	
	Если не Спр.Пустая() Тогда
		
		СпрОб = Спр.ПолучитьОбъект();
		
	Иначе
		
		СпрОб = Справочники.БТ_СписокКонстантныхЗначений.СоздатьЭлемент();
		СпрОб.УстановитьНовыйКод();
		СпрОб.Наименование = "СписокИсключенияДляДЗ"+Справочник;

	КонецЕсли;
	
	СпрОб.ТаблицаДанных.Очистить();
	
	Для Каждого ТекСтр из СписокИсключения Цикл
		
		СпрОб.ТаблицаДанных.Добавить().Значение = ТекСтр.Значение;
		
	КонецЦикла;
	СпрОб.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры
