
&НаСервере
Процедура ЗакрытьСессиюНаСервере(Терминал)
	AB_ОбщийМодульАльфаБанкСервер.ЗакончитьРаботуСТерминаломПринудительно(Терминал);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСессию(Команда)
	Если ЗначениеЗаполнено(Элементы.Терминалы.ТекущиеДанные.Терминал) Тогда
		Если Элементы.Терминалы.ТекущиеДанные.Статус = Занят Тогда 
			ЗакрытьСессиюНаСервере(Элементы.Терминалы.ТекущиеДанные.Терминал);
		Иначе
			Сообщить("Терминал не занят");
		КонецЕсли;
	Иначе
		Сообщить("Не выбран терминал");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Занят = Перечисления.AB_СтатусыТерминаловАльфабанк.Занят;
КонецПроцедуры
