
Процедура ОбновитьОтображениеПериода()
	Элементы.ПредствалениеПериод.Заголовок = Формат(Объект.Период,"ДФ='MMMM yyyy ''г.'''");
КонецПроцедуры

&НаКлиенте
Процедура НазадПериод(Команда)
	
	Объект.Период = НачалоМесяца(НачалоМесяца(ОБъект.Период) - 1);
	ОбновитьОтображениеПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ВпередПериод(Команда)
	
	ОБъект.Период = КонецМесяца(ОБъект.Период) + 1;
	ОбновитьОтображениеПериода();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Период = НачалоМесяца(ТекущаяДата());
		
	КонецЕсли;
	
	ОбновитьОтображениеПериода();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Организация.Пустая() Тогда
		
		Сообщить("Не выбрана организация, запись отменена!");
		Отказ = истина;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Показатели.Количество() = 0 ТОгда
		
		ЗаполнитьНаСервере();
		
	Иначе
		
		Оп = новый ОписаниеОповещения("ПослеВопроса",ЭтаФорма);
		ПоказатьВопрос(ОП,"В таблице есть данные, очистить?",РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВопроса(Результат,ДопПараметры) Экспорт
	
	
	Если Результат = КодВозвратаДиалога.Да ТОгда
		
		Объект.Показатели.Очистить();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_Показатели.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БТ_Показатели КАК БТ_Показатели
		|ГДЕ
		|	НЕ БТ_Показатели.ПометкаУдаления
		|	И БТ_Показатели.Включен";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Объект.Показатели.НайтиСтроки(Новый Структура("Показатель",ВыборкаДетальныеЗаписи.Ссылка)).Количество() = 0 Тогда
			
			Объект.Показатели.Добавить().Показатель = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокВыбора()
	
	Возврат Справочники.ПодразделенияКомпании.ПолучитьСписокПодразделенийССП();
	
КонецФункции


&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ПолучитьСписокВыбора();
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзФайлаНаСервере(Адрес)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
    ДвоичныеДанные.Записать(ИмяВременногоФайла);
    
    Таб = Новый ТабличныйДокумент;
    Таб.Прочитать(ИмяВременногоФайла);
    
    Для сч = 2 По Таб.ВысотаТаблицы Цикл 
    	Значение = СтрЗаменить(СтрЗаменить(таб.область(сч, 1).Текст, Символы.НПП, ""),",","."); 
    	ид = СтрЗАменить(таб.область(сч, 2).Текст, Символы.НПП, ""); 
    	ПланПоДням = таб.область(сч, 3).Текст;
    	
    	Если ПустаяСтрока(ид) Тогда
    		Продолжить;
    	КонецЕсли;	   
    	
    	ид = Число(ид);
    	
    	Элемент = Справочники.БТ_Показатели.НайтиПоРеквизиту("ID", ид);
    	Если Элемент.Пустая() Тогда
    		Сообщить("Не найден показатель по ид " + ид);
    		Продолжить;
    	КонецЕсли;	   
    	
    	НоваяСтрока = Объект.Показатели.Добавить();
    	НоваяСтрока.Показатель = Элемент;
    	Новаястрока.Значение = Значение;
    	НоваяСтрока.ПланПоДням = Не ПустаяСтрока(ПланПоДням) и СокрЛП(ПланПоДням) <> "0" и нрег(ПланПоДням) <> "ложь";
    	
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ВыбранныеФайлы[0]);
   		АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
   	 
   		ЗаполнитьИзФайлаНаСервере(АдресВХ)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)
	
	СтандартнаяОбработка = ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр 			= "Книга Excel 2007 (*.xlsx)|*.xlsx";
	Диалог.Заголовок 		= НСтр("ru=’Выберите файл Excel'");
	ОповещениеЗавершения 	= Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
	
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры
