
// преобразование к числовому значению
Функция ПреобразоватьКЧислу(Знач Значение) Экспорт
	
	Если Значение = Перечисления.ВидыЗначенийСветофора.Норма Тогда
		Возврат 1;
	ИначеЕсли Значение = Перечисления.ВидыЗначенийСветофора.Замечание Тогда
		Возврат 2;
	ИначеЕсли Значение = Перечисления.ВидыЗначенийСветофора.Отказ Тогда
		Возврат 3;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// преобразование к перечисления
Функция ПреобразоватьКПеречислению(Знач Значение) Экспорт
	
	Если Значение = "1" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Норма;
	ИначеЕсли Значение = "2" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Замечание;
	ИначеЕсли Значение = "3" Тогда
		Возврат Перечисления.ВидыЗначенийСветофора.Отказ;
	Иначе
		Возврат Перечисления.ВидыЗначенийСветофора.НеВыбрано;
	КонецЕсли;
	
КонецФункции