

Процедура Сформировать(Период, Периодичность, Организация, ПодразделениеКомпании) Экспорт
	
	#Если НЕ Клиент тогда
		Если НачалоМесяца(Период)<>НачалоМесяца(ТекущаяДата()) Тогда
			Если (НачалоДня(ТекущаяДата())-КонецМесяца(Период))>2*86400 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;	
	#КонецЕсли
		
	Период=НачалоМесяца(Период);
	Если Периодичность=Перечисления.Периодичность.Квартал Тогда
		Пер=НачалоМесяца(КонецКвартала(Период));
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		Пер=НачалоМесяца(КонецГода(Период));
	Иначе
		пер=НачалоМесяца(Период);
	КонецЕсли;
	Период=Пер;
	
	Если НЕ Мотивация.ПроверитьРазрешениеРедактирования(Пер,Организация,ПодразделениеКомпании,истина,ложь) Тогда
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(ПодразделениеКомпании) Тогда
		ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	КонецЕсли;
	
	Если ПустаяСтрока(Организация) Тогда
		Организация=Справочники.Организации.ОсновнаяОрганизация;
	КонецЕсли;

	//Активные должности
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Организация,
	|	СоставKPI.ПодразделениеКомпании,
	|	СоставKPI.Должность
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Организация = &Организация
	|	И (СоставKPI.СрокДействия >= &ДействуетПо
	|			ИЛИ СоставKPI.СрокДействия = &ПустаяДата)
	|	И (СоставKPI.ПодразделениеКомпании = &Подразделение
	|			ИЛИ &Все)");
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Дата",КонецМесяца(Период));
	Запрос.УстановитьПараметр("ДействуетПо",Период);
	Запрос.УстановитьПараметр("ПустаяДата",Дата("01.01.01 00:00:00"));	
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Все",ПустаяСтрока(ПодразделениеКомпании)
	ИЛИ ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	ТЗ=Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтр из ТЗ Цикл
		Если ПустаяСтрока(ТекСтр.ПодразделениеКомпании) и НЕ (ТекСтр.ПодразделениеКомпании)=null Тогда
			ТекСтр.ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
	КонецЦикла;
	
    ТекстПоПланам="";
	ТЗ.Свернуть("ПодразделениеКомпании");
	
	Для Каждого ТекСтр из ТЗ Цикл
		
		ТекПодразделение=ТекСтр.ПодразделениеКомпании;
		
		Если ПустаяСтрока(ТекПодразделение) ТОгда
			Продолжить;
		КонецЕсли;
		
		//Если ТекПодразделение<>ПодразделениеКомпании Тогда
		//	Продолжить;
		//КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	РасчетВыполненияKPI.Ссылка
		|ИЗ
		|	Документ.РасчетВыполненияKPI КАК РасчетВыполненияKPI
		|ГДЕ
		|	РасчетВыполненияKPI.ПериодПланирования = &Период
		|	И РасчетВыполненияKPI.Периодичность = &Периодичность
		|	И РасчетВыполненияKPI.ПодразделениеКомпании = &ПодразделениеКомпании");
		
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("Периодичность", Периодичность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ТекПодразделение);
		
		ТР=Запрос.Выполнить().Выгрузить();
		
		Если ТР.Количество()>0 Тогда
			
			Для Каждого Выб из ТР Цикл
				
				Попытка
					
					Док=Выб.Ссылка;
					
					Об=Док.ПолучитьОбъект();
					
					Об.ЗаполнитьДокумент();
					
					Об.Организация=ТекПодразделение.Организация;
					
					Об.Записать();
					
					Об.АвторасчетФОТ();
					
					Если Об.ФОТ.Количество()=0 Тогда
						Продолжить;
					КонецЕсли;
					
					Об.Записать();
					
					Об.Записать(РежимЗаписиДокумента.Проведение);
					
				Исключение
					
					ОО=ОписаниеОшибки();
					
					Сообщить(ОО);
					
					ЗаписьЖурналаРегистрации("Ошибка автоформирования", УровеньЖурналаРегистрации.Ошибка, , Док, ОО);
					
				КонецПопытки;
				
			КонецЦикла;
			
		Иначе
			
			Попытка
				
				НовДок=Документы.РасчетВыполненияKPI.СоздатьДокумент();
				НовДок.ПодразделениеКомпании=ТекПодразделение;
				НовДок.Автор=ПараметрыСеанса.Пользователь;
				НовДок.Дата=ТекущаяДата();
				НовДок.ПериодПланирования=Период;
				НовДок.Периодичность=Периодичность;
				НовДок.Подразделение=ТекПодразделение;
				НовДок.Организация=ТекПодразделение.Организация;
				НовДок.ЗаполнитьДокумент();
				
				НовДок.Записать();
				
				НовДок.АвторасчетФОТ();
				
				Если НовДок.ФОТ.Количество()=0 Тогда
					Продолжить;
				КонецЕсли;
				
				НовДок.Записать();
				НовДок.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				ОО=ОписаниеОшибки();
				Сообщить(ОО);
				
				ЗаписьЖурналаРегистрации("Ошибка автоформирования", УровеньЖурналаРегистрации.Ошибка, , , ОО); 
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
