
&НаКлиенте
Процедура Поехали(Команда)
	ПоехалиНаСервере();
КонецПроцедуры         

&НаСервере
Процедура ПоехалиНаСервере()

	УИД = ЗаказНаАвтомобиль.УникальныйИдентификатор();
	Отправлен = DN_HTTP_Обмен.ОтправитьОбъект(ЗаказНаАвтомобиль,УИД);
	Если Отправлен тогда
		Сообщить("Данные успешно получены базой приемником");
	Иначе
		Сообщить("Что то пошло не так, данные не отправлены в базу приемник, но записаны и будут переданы позднее, по регламенту");
	КонецЕсли;

КонецПроцедуры // ПоехалиНаСервере()

&НаКлиенте
Процедура ОтработатьРегламент(Команда)
	ОтработатьРегламентНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтработатьРегламентНаСервере();

	DN_HTTP_Обмен.РегламентОтправки(0);	

КонецПроцедуры // ОтработатьРегламентНаСервере();()


