#Если Клиент Тогда
// Модуль отчета Активы и Пассивы

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем КоличествоГруппировок, МакетОтчета, ОформлениеСтроки, ОформлениеШапки, ОформлениеИтоги; //настройки оформления табличного документа
Перем ВедетсяБалансПоПодразделению Экспорт;                                                   //флаг наличия баланса по подразделению
Перем СписокФильтровПодразделение;                                                            //список фильтров по подразделению
Перем ВыводитьОтчетыПоПодразделениям;                                                         //флаг вывода отчетов по подразделениям

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//Функция получения списка подразделений, по которым проводилась корректировка при проведении документа ВыбРегистратор
//Параметры:
// ВыбРегистратор - ссылка на документ 
//Возвращаемое значение:
//СписокПодразделений - список значений
Функция ПолучитьСписокПодразделений(ВыбРегистратор)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачПериода", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("КонПериода", КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Ссылка", ВыбРегистратор);
	Запрос.УстановитьПараметр("Статья", Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодразделенияКомпании.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	               |ГДЕ
	               |	ПодразделенияКомпании.Балансовое = ИСТИНА
	               |	И ПодразделенияКомпании.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |				ДоходыИРасходыОбороты.ПодразделениеКомпании КАК Подразделение
	               |			ИЗ
	               |				РегистрНакопления.ДоходыИРасходы.Обороты(&НачПериода, &КонПериода, Регистратор, СтатьяДоходовИРасходов = &Статья) КАК ДоходыИРасходыОбороты
	               |			ГДЕ
	               |				ДоходыИРасходыОбороты.Регистратор = &Ссылка)";
	
	СписокПодразделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат СписокПодразделений;
КонецФункции

//функция проверки балансового уравнения
//Параметры:
// Документ - ссылка на документ иди движения документа
// флБалансСходится - Истина - баланс сходится либо нет движений по балансовым регистрам
//                  - Ложь   - баланс не сходится 
Функция ПроверитьБалансноеУравнение(Документ,РазницаБаланса,ПараметрПриход=Неопределено,ПараметрРасход=Неопределено) Экспорт
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Документ)) Тогда
		// в параметре "Документ" передан документ
		пкФильтр = 3;
		пкДетализация = 3;
		ВыбРегистратор = Документ;
		ДатаНачала = Документ.Дата;
		ДатаКонца = Документ.Дата;

		Если ВедетсяБалансПоПодразделению Тогда
			СписокПодразделений = ПолучитьСписокПодразделений(ВыбРегистратор);
			Если СписокПодразделений.Количество() = 0 Тогда
				ВыводитьОтчетыПоПодразделениям = Ложь;
			Иначе
				ВыводитьОтчетыПоПодразделениям = Истина;
			КонецЕсли;
		Иначе
			ВыводитьОтчетыПоПодразделениям = Ложь;
		КонецЕсли;
		
		флБалансСходится = Истина;
		ТекстЗапроса = ПолучитьТекстЗапроса();
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ДатаНачала));
		Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ДатаКонца));
		Запрос.УстановитьПараметр("ТоварКупленный",Перечисления.СтатусыПартий.ТоварКупленный);
		Запрос.УстановитьПараметр("ВыбДокумент",ВыбРегистратор);
		Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Приход);
		Запрос.УстановитьПараметр("ДатаНачалаИсключая",Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ДатаНачалаВключая",Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("ДатаКонцаИсключая",Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ДатаКонцаВключая",Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая));

		СписокСпособовОплат = Новый Массив();
		СписокСпособовОплат.Добавить(Перечисления.ТипыОплатыВРознице.Безналичные);
		СписокСпособовОплат.Добавить(Перечисления.ТипыОплатыВРознице.Наличные);
		Запрос.УстановитьПараметр("СписокСпособовОплат", СписокСпособовОплат);
		
		Если ВыводитьОтчетыПоПодразделениям Тогда
			
			Для Каждого БалПодразделение Из СписокПодразделений Цикл
				
				Запрос.УстановитьПараметр("ВыбПодразделение",БалПодразделение);
				Результат = Запрос.Выполнить();
				Если Результат.Пустой() Тогда
					Продолжить;
				КонецЕсли;
				Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); Выборка.Следующий();
				РазницаБаланса = Выборка.Приход - Выборка.Расход;
				Если НЕ РазницаБаланса=0 Тогда
			   	флБалансСходится = Ложь;
				КонецЕсли;

			КонецЦикла;
		Иначе
			
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Возврат флБалансСходится;
			КонецЕсли;
			Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); Выборка.Следующий();
			РазницаБаланса = Выборка.Приход - Выборка.Расход;
			Если НЕ РазницаБаланса=0 Тогда
		   	флБалансСходится = Ложь;
			КонецЕсли;

		КонецЕсли;
		
	Иначе
		// в параметре "Документ" переданы движения документа
		флБалансСходится = Истина;
		Движения = Документ;
		
		ПриходИтог = 0;
		РасходИтог = 0;
		
		Для Каждого Движение Из Движения Цикл
			РегистрИмя = Движение.Метаданные().Имя;
			
			ТаблицаДвижений = Движение.Выгрузить();
			Если ТаблицаДвижений.Количество() = 0 Тогда
				// если набор записей пустой - продолжаем, обрабатывать нечего
				Продолжить;
			КонецЕсли;
			
			Для Каждого ТекСтр Из ТаблицаДвижений Цикл
				Если РегистрИмя="ДоходыИРасходы" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.РасходУпр;
						РасходИтог = РасходИтог + ТекСтр.ДоходУпр;
					Иначе
						ПриходИтог = ПриходИтог - ТекСтр.РасходУпр;
						РасходИтог = РасходИтог - ТекСтр.ДоходУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ДенежныеСредстваКомпании" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="КассыККМ" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ВзаиморасчетыКомпании" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ПартииТоваровКомпании" Тогда
					Если ТекСтр.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
						Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
						Иначе
							РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ПартииТоваровОтданные" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаСебестоимостиУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаСебестоимостиУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="РеализованныеТовары" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ТоварыВПроизводстве" Тогда
					Если ТекСтр.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
						Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
						Иначе
							РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ПрочиеАктивыВЭксплуатации" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.БалансоваяСтоимостьУпр - ТекСтр.СуммаАмортизацииУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.БалансоваяСтоимостьУпр - ТекСтр.СуммаАмортизацииУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="ОстаткиАвтомобилей" Тогда
					Если ТекСтр.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
						Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
						Иначе
							РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли РегистрИмя="КомплектацияАвтомобилей" Тогда
					Если ТекСтр.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
						Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
							ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
						Иначе
							РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли РегистрИмя="АвтомобилиОтданные" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаСебестоимостиУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаСебестоимостиУпр;
					КонецЕсли;
				ИначеЕсли РегистрИмя="РеализованныеАвтомобили" Тогда
					Если ТекСтр.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
						ПриходИтог = ПриходИтог + ТекСтр.СуммаУпр;
					Иначе
						РасходИтог = РасходИтог + ТекСтр.СуммаУпр;
					КонецЕсли;
				Иначе
					// регистр не участвует в балансе
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		ПараметрПриход = ПриходИтог;
		ПараметрРасход = РасходИтог;
		// посчитаем разницу баланса
		РазницаБаланса = Окр(ПриходИтог - РасходИтог, 2);
		Если НЕ РазницаБаланса=0 Тогда
		   флБалансСходится = Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат флБалансСходится;
КонецФункции  // ПроверитьБалансноеУравнение()

//Формирует текст запроса
//
//Без параметров
//
// Возвращаемое значение:
//   ТекстЗапроса – текст
//
Функция ПолучитьТекстЗапроса()
	
	// Текст отборов таблиц запросов
	//Параметры виртуальных таблиц
	ТекстПараметрыДоходыИРасходы = "";
	ТекстПараметрыДенежныеСредстваКомпании = "";
	ТекстПараметрыКассыККМ = "";
	ТекстПараметрыВзаиморасчетыКомпании = "";
	ТекстПараметрыПартииТоваровКомпании = "";
	ТекстПараметрыПартииТоваровОтданные = "";
	ТекстПараметрыРеализованныеТовары = "";
	ТекстПараметрыПрочиеАктивыВЭксплуатации = "";
	ТекстПараметрыТоварыВПроизводстве = "";
	ТекстПараметрыОстаткиАвтомобилей = "";
	ТекстПараметрыКомплектацияАвтомобилей = "";
	ТекстПараметрыАвтомобилиОтданные = "";
	ТекстПараметрыРеализованныеАвтомобили = "";
	//Отборы физических таблиц
	ТекстОтборыКассыККМ = "";
	ТекстОтборыВзаиморасчетыКомпании = "";
	ТекстОтборыПартииТоваровКомпании = "";
	ТекстОтборыПартииТоваровОтданные = "";
	ТекстОтборыРеализованныеТовары = "";
	ТекстОтборыПрочиеАктивыВЭксплуатации = "";
	ТекстОтборыТоварыВПроизводстве = "";
	ТекстОтборыОстаткиАвтомобилей = "";
	ТекстОтборыКомплектацияАвтомобилей = "";
	ТекстОтборыАвтомобилиОтданные = "";
	ТекстОтборыРеализованныеАвтомобили = "";
	
	Если пкФильтр = 1 Тогда
		//Параметры виртуальных таблиц
		ТекстПараметрыДоходыИРасходы = "ПодразделениеКомпании.Организация = &ВыбОрганизация";
		ТекстПараметрыДенежныеСредстваКомпании = "
		|	ВЫБОР
		|		КОГДА СтруктурнаяЕдиница ССЫЛКА Справочник.БанковскиеСчета ТОГДА
		|	   		СтруктурнаяЕдиница.Владелец = &ВыбОрганизация
		|		ИНАЧЕ
		|			СтруктурнаяЕдиница.Организация = &ВыбОрганизация
		|	КОНЕЦ";
		ТекстПараметрыКассыККМ = " И КассаККМ.Подразделение.Организация = &ВыбОрганизация";
		ТекстПараметрыВзаиморасчетыКомпании = "ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстПараметрыПартииТоваровКомпании = " И СкладКомпании.Организация = &ВыбОрганизация";
		ТекстПараметрыПартииТоваровОтданные = "ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстПараметрыРеализованныеТовары = "ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстПараметрыПрочиеАктивыВЭксплуатации = "ПодразделениеКомпании.Организация = &ВыбОрганизация";
		ТекстПараметрыТоварыВПроизводстве = " И Цех.Организация = &ВыбОрганизация";
		ТекстПараметрыОстаткиАвтомобилей = " И СкладКомпании.Организация = &ВыбОрганизация";
		ТекстПараметрыКомплектацияАвтомобилей = " И СкладКомпании.Организация = &ВыбОрганизация";
		ТекстПараметрыАвтомобилиОтданные = "ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстПараметрыРеализованныеАвтомобили = "ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		//Отборы физических таблиц
		ТекстОтборыДоходыИРасходы = "	И ДоходыИРасходы.ПодразделениеКомпании.Организация = &ВыбОрганизация";
		ТекстОтборыДенежныеСредстваКомпании = "	И
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.СтруктурнаяЕдиница ССЫЛКА Справочник.БанковскиеСчета ТОГДА
		|	   		ДенежныеСредстваКомпании.СтруктурнаяЕдиница.Владелец = &ВыбОрганизация
		|		ИНАЧЕ
		|			ДенежныеСредстваКомпании.СтруктурнаяЕдиница.Организация = &ВыбОрганизация
		|	КОНЕЦ";
		ТекстОтборыКассыККМ = "	И КассыККМ.КассаККМ.Подразделение.Организация = &ВыбОрганизация";
		ТекстОтборыВзаиморасчетыКомпании = "	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстОтборыПартииТоваровКомпании = "	И ПартииТоваровКомпании.СкладКомпании.Организация = &ВыбОрганизация";
		ТекстОтборыПартииТоваровОтданные = "	И ПартииТоваровОтданныеКомпании.ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстОтборыРеализованныеТовары = "	И РеализованныеТоварыКомпании.ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстОтборыПрочиеАктивыВЭксплуатации = "	И ПрочиеАктивыВЭксплуатацииКомпании.ПодразделениеКомпании.Организация = &ВыбОрганизация";
		ТекстОтборыТоварыВПроизводстве = "	И ТоварыВПроизводстве.Цех.Организация = &ВыбОрганизация";
		ТекстОтборыОстаткиАвтомобилей = "	И ОстаткиАвтомобилей.СкладКомпании.Организация = &ВыбОрганизация";
		ТекстОтборыКомплектацияАвтомобилей = "	И КомплектацияАвтомобилей.СкладКомпании.Организация = &ВыбОрганизация";
		ТекстОтборыАвтомобилиОтданные = "	И АвтомобилиОтданные.ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
		ТекстОтборыРеализованныеАвтомобили = "	И РеализованныеАвтомобили.ДоговорВзаиморасчетов.Организация = &ВыбОрганизация";
	ИначеЕсли пкФильтр = 2 Тогда
		
		Если ВедетсяБалансПоПодразделению Тогда
			//Параметры виртуальных таблиц
			ТекстПараметрыДоходыИРасходы = "ПодразделениеКомпании В(&СписокПодразделений)";
			ТекстПараметрыДенежныеСредстваКомпании = "СтруктурнаяЕдиница.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыКассыККМ = " И КассаККМ.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыВзаиморасчетыКомпании = "ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыПартииТоваровКомпании = " И СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыПартииТоваровОтданные = "ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыРеализованныеТовары = "ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыПрочиеАктивыВЭксплуатации = "ПодразделениеКомпании В(&СписокПодразделений)";
			ТекстПараметрыТоварыВПроизводстве = " И Цех.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыОстаткиАвтомобилей = " И СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыКомплектацияАвтомобилей = " И СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыАвтомобилиОтданные = "ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстПараметрыРеализованныеАвтомобили = "ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			//Отборы физических таблиц
			ТекстОтборыДоходыИРасходы = "	И ДоходыИРасходы.ПодразделениеКомпании В(&СписокПодразделений)";
			ТекстОтборыДенежныеСредстваКомпании = "	И ДенежныеСредстваКомпании.СтруктурнаяЕдиница.Подразделение В(&СписокПодразделений)";
			ТекстОтборыКассыККМ = "	И КассыККМ.КассаККМ.Подразделение В(&СписокПодразделений)";
			ТекстОтборыВзаиморасчетыКомпании = "	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстОтборыПартииТоваровКомпании = "	И ПартииТоваровКомпании.СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстОтборыПартииТоваровОтданные = "	И ПартииТоваровОтданныеКомпании.ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстОтборыРеализованныеТовары = "	И РеализованныеТоварыКомпании.ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстОтборыПрочиеАктивыВЭксплуатации = "	И ПрочиеАктивыВЭксплуатацииКомпании.ПодразделениеКомпании В(&СписокПодразделений)";
			ТекстОтборыТоварыВПроизводстве = "	И ТоварыВПроизводстве.Цех.Подразделение В(&СписокПодразделений)";
			ТекстОтборыОстаткиАвтомобилей = "	И ОстаткиАвтомобилей.СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстОтборыКомплектацияАвтомобилей = "	И КомплектацияАвтомобилей.СкладКомпании.Подразделение В(&СписокПодразделений)";
			ТекстОтборыАвтомобилиОтданные = "	И АвтомобилиОтданные.ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
			ТекстОтборыРеализованныеАвтомобили = "	И РеализованныеАвтомобили.ДоговорВзаиморасчетов.Подразделение В(&СписокПодразделений)";
		Иначе
			//Параметры виртуальных таблиц
			ТекстПараметрыДоходыИРасходы = "ПодразделениеКомпании = &ВыбПодразделение";
			ТекстПараметрыДенежныеСредстваКомпании = "СтруктурнаяЕдиница.Подразделение = &ВыбПодразделение";
			ТекстПараметрыКассыККМ = " И КассаККМ.Подразделение = &ВыбПодразделение";
			ТекстПараметрыВзаиморасчетыКомпании = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыПартииТоваровКомпании = " И СкладКомпании.Подразделение  = &ВыбПодразделение";
			ТекстПараметрыПартииТоваровОтданные = "ДоговорВзаиморасчетов.Подразделение  = &ВыбПодразделение";
			ТекстПараметрыРеализованныеТовары = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыПрочиеАктивыВЭксплуатации = "ПодразделениеКомпании = &ВыбПодразделение";
			ТекстПараметрыТоварыВПроизводстве = " И Цех.Подразделение = &ВыбПодразделение";
			ТекстПараметрыОстаткиАвтомобилей = " И СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстПараметрыКомплектацияАвтомобилей = " И СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстПараметрыАвтомобилиОтданные = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыРеализованныеАвтомобили = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			//Отборы физических таблиц
			ТекстОтборыДоходыИРасходы = "	И ДоходыИРасходы.ПодразделениеКомпании = &ВыбПодразделение";
			ТекстОтборыДенежныеСредстваКомпании = "	И ДенежныеСредстваКомпании.СтруктурнаяЕдиница.Подразделение = &ВыбПодразделение";
			ТекстОтборыКассыККМ = "	И КассыККМ.КассаККМ.Подразделение = &ВыбПодразделение";
			ТекстОтборыВзаиморасчетыКомпании = "	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыПартииТоваровКомпании = "	И ПартииТоваровКомпании.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыПартииТоваровОтданные = "	И ПартииТоваровОтданныеКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыРеализованныеТовары = "	И РеализованныеТоварыКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыПрочиеАктивыВЭксплуатации = "	И ПрочиеАктивыВЭксплуатацииКомпании.ПодразделениеКомпании = &ВыбПодразделение";
			ТекстОтборыТоварыВПроизводстве = "	И ТоварыВПроизводстве.Цех.Подразделение = &ВыбПодразделение";
			ТекстОтборыОстаткиАвтомобилей = "	И ОстаткиАвтомобилей.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыКомплектацияАвтомобилей = "	И КомплектацияАвтомобилей.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыАвтомобилиОтданные = "	И АвтомобилиОтданные.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыРеализованныеАвтомобили = "	И РеализованныеАвтомобили.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
		КонецЕсли;
	ИначеЕсли пкФильтр = 3 Тогда
		Если ВыводитьОтчетыПоПодразделениям Тогда
			//Параметры виртуальных таблиц
			ТекстПараметрыДоходыИРасходы = "ПодразделениеКомпании = &ВыбПодразделение";
			ТекстПараметрыДенежныеСредстваКомпании = "СтруктурнаяЕдиница.Подразделение = &ВыбПодразделение";
			ТекстПараметрыКассыККМ = " И КассаККМ.Подразделение = &ВыбПодразделение";
			ТекстПараметрыВзаиморасчетыКомпании = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыПартииТоваровКомпании = " И СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстПараметрыПартииТоваровОтданные = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыРеализованныеТовары = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыПрочиеАктивыВЭксплуатации = "ПодразделениеКомпании = &ВыбПодразделение";
			ТекстПараметрыТоварыВПроизводстве =" И Цех.Подразделение = &ВыбПодразделение";
			ТекстПараметрыОстаткиАвтомобилей = " И СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстПараметрыКомплектацияАвтомобилей =  " И СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстПараметрыАвтомобилиОтданные = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстПараметрыРеализованныеАвтомобили = "ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			//Отборы физических таблиц
			ТекстОтборыДоходыИРасходы = "	И ДоходыИРасходы.Регистратор = &ВыбДокумент
			| И ДоходыИРасходы.ПодразделениеКомпании = &ВыбПодразделение";
			ТекстОтборыДенежныеСредстваКомпании = "	И ДенежныеСредстваКомпании.Регистратор = &ВыбДокумент
			| И ДенежныеСредстваКомпании.СтруктурнаяЕдиница.Подразделение = &ВыбПодразделение";
			ТекстОтборыКассыККМ = "	И КассыККМ.Регистратор = &ВыбДокумент
			| И КассыККМ.КассаККМ.Подразделение = &ВыбПодразделение";
			ТекстОтборыВзаиморасчетыКомпании = "	И ВзаиморасчетыКомпании.Регистратор = &ВыбДокумент
			| И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыПартииТоваровКомпании = "	И ПартииТоваровКомпании.Регистратор = &ВыбДокумент
			| И ПартииТоваровКомпании.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыПартииТоваровОтданные = "	И ПартииТоваровОтданныеКомпании.Регистратор = &ВыбДокумент
			| И ПартииТоваровОтданныеКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыРеализованныеТовары = "	И РеализованныеТоварыКомпании.Регистратор = &ВыбДокумент
			| И РеализованныеТоварыКомпании.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыПрочиеАктивыВЭксплуатации = "	И ПрочиеАктивыВЭксплуатацииКомпании.Регистратор = &ВыбДокумент
			| И ПрочиеАктивыВЭксплуатацииКомпании.ПодразделениеКомпании = &ВыбПодразделение";
			ТекстОтборыТоварыВПроизводстве = "	И ТоварыВПроизводстве.Регистратор = &ВыбДокумент
			| И ТоварыВПроизводстве.Цех.Подразделение = &ВыбПодразделение";
			ТекстОтборыОстаткиАвтомобилей = "	И ОстаткиАвтомобилей.Регистратор = &ВыбДокумент
			| И ОстаткиАвтомобилей.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыКомплектацияАвтомобилей = "	И КомплектацияАвтомобилей.Регистратор = &ВыбДокумент
			| И КомплектацияАвтомобилей.СкладКомпании.Подразделение = &ВыбПодразделение";
			ТекстОтборыАвтомобилиОтданные = "	И АвтомобилиОтданные.Регистратор = &ВыбДокумент
			| И АвтомобилиОтданные.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
			ТекстОтборыРеализованныеАвтомобили = "	И РеализованныеАвтомобили.Регистратор = &ВыбДокумент
			| И РеализованныеАвтомобили.ДоговорВзаиморасчетов.Подразделение = &ВыбПодразделение";
		Иначе
			//Отборы физических таблиц
			ТекстОтборыДоходыИРасходы = "	И ДоходыИРасходы.Регистратор = &ВыбДокумент";
			ТекстОтборыДенежныеСредстваКомпании = "	И ДенежныеСредстваКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыКассыККМ = "	И КассыККМ.Регистратор = &ВыбДокумент";
			ТекстОтборыВзаиморасчетыКомпании = "	И ВзаиморасчетыКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыПартииТоваровКомпании = "	И ПартииТоваровКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыПартииТоваровОтданные = "	И ПартииТоваровОтданныеКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыРеализованныеТовары = "	И РеализованныеТоварыКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыПрочиеАктивыВЭксплуатации = "	И ПрочиеАктивыВЭксплуатацииКомпании.Регистратор = &ВыбДокумент";
			ТекстОтборыТоварыВПроизводстве = "	И ТоварыВПроизводстве.Регистратор = &ВыбДокумент";
			ТекстОтборыОстаткиАвтомобилей = "	И ОстаткиАвтомобилей.Регистратор = &ВыбДокумент";
			ТекстОтборыКомплектацияАвтомобилей = "	И КомплектацияАвтомобилей.Регистратор = &ВыбДокумент";
			ТекстОтборыАвтомобилиОтданные = "	И АвтомобилиОтданные.Регистратор = &ВыбДокумент";
			ТекстОтборыРеализованныеАвтомобили = "	И РеализованныеАвтомобили.Регистратор = &ВыбДокумент";
		КонецЕсли;
	КонецЕсли;
	
	ЕстьОстатки = (пкФильтр<>3);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.УчетныйБлок КАК УчетныйБлок,";
	
	Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ВложенныйЗапрос.ТипОбъектаУчета КАК ТипОбъектаУчета,";
	КонецЕсли;
	Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ВложенныйЗапрос.ОбъектУчета КАК ОбъектУчета,
	|	ВложенныйЗапрос.ОбъектУчета.Наименование КАК ПредставлениеОбъекта,";
	КонецЕсли;
	Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ВложенныйЗапрос.Регистратор КАК Регистратор,
	|	ВложенныйЗапрос.Период КАК Период,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	ВложенныйЗапрос.АктивНачОст КАК АктивНачОст,
	|	ВложенныйЗапрос.ПассивНачОст КАК ПассивНачОст,
	|	ВложенныйЗапрос.Приход КАК Приход,
	|	ВложенныйЗапрос.Расход КАК Расход,
	|	ВложенныйЗапрос.АктивКонОст КАК АктивКонОст,
	|	ВложенныйЗапрос.ПассивКонОст КАК ПассивКонОст
	|
    |ИЗ
	|	(";
	// Доходы и расходы - Считаем что этот регистр есть всегда
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ ""Доходы и расходы"" КАК УчетныйБлок,";
	Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ЕСТЬNULL(ДоходыИРасходы.СтатьяДоходовИРасходов.ВидДоходаИРасхода, ЗНАЧЕНИЕ(Перечисление.ВидыДоходовИРасходов.ПустаяСсылка)) КАК ТипОбъектаУчета,";
	КонецЕсли;
	Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ДоходыИРасходы.СтатьяДоходовИРасходов КАК ОбъектУчета,";
	КонецЕсли;
	Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
	|	ДоходыИРасходы.Регистратор КАК Регистратор,
	|	ДоходыИРасходы.Период КАК Период,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|	ДоходыИРасходы.РасходУпрНачальныйОстаток КАК АктивНачОст,
	|	ДоходыИРасходы.ДоходУпрНачальныйОстаток КАК ПассивНачОст,
	|	ДоходыИРасходы.РасходУпрОборот КАК Приход,
	|	ДоходыИРасходы.ДоходУпрОборот КАК Расход,
	|	ДоходыИРасходы.РасходУпрКонечныйОстаток КАК АктивКонОст,
	|	ДоходыИРасходы.ДоходУпрКонечныйОстаток КАК ПассивКонОст
	|ИЗ 
	|(ВЫБРАТЬ
	|	ДоходыИРасходы.СтатьяДоходовИРасходов КАК СтатьяДоходовИРасходов,
	|	ДоходыИРасходы.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ДоходыИРасходы.Регистратор КАК Регистратор,
	|	ДоходыИРасходы.Период КАК Период,
	|	0 КАК РасходУпрНачальныйОстаток,
	|	0 КАК ДоходУпрНачальныйОстаток,
	|	0 КАК РасходУпрКонечныйОстаток,
	|	0 КАК ДоходУпрКонечныйОстаток,
	|	ВЫБОР
	|		КОГДА ДоходыИРасходы.ВидДвижения = &ВидДвижения
	|			ТОГДА ДоходыИРасходы.РасходУпр
	|		ИНАЧЕ -ДоходыИРасходы.РасходУпр
	|	КОНЕЦ КАК РасходУпрОборот,
	|	ВЫБОР
	|		КОГДА ДоходыИРасходы.ВидДвижения = &ВидДвижения
	|			ТОГДА ДоходыИРасходы.ДоходУпр
	|		ИНАЧЕ -ДоходыИРасходы.ДоходУпр
	|	КОНЕЦ КАК ДоходУпрОборот
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ДоходыИРасходы.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыДоходыИРасходы+?(ЕстьОстатки,"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыИРасходыНачальныеОстатки.СтатьяДоходовИРасходов,
	|	ДоходыИРасходыНачальныеОстатки.ПодразделениеКомпании,
	|	NULL,
	|	&ДатаНачала,
	|	ДоходыИРасходыНачальныеОстатки.РасходУпрОстаток,
	|	ДоходыИРасходыНачальныеОстатки.ДоходУпрОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Остатки(&ДатаНачала,"+ТекстПараметрыДоходыИРасходы+" ) КАК ДоходыИРасходыНачальныеОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоходыИРасходыКонечныеОстатки.СтатьяДоходовИРасходов,
	|	ДоходыИРасходыКонечныеОстатки.ПодразделениеКомпании,
	|	NULL,
	|	&ДатаКонца,
	|	0,
	|	0,
	|	ДоходыИРасходыКонечныеОстатки.РасходУпрОстаток,
	|	ДоходыИРасходыКонечныеОстатки.ДоходУпрОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Остатки(&ДатаКонцаВключая,"+ТекстПараметрыДоходыИРасходы+") КАК ДоходыИРасходыКонечныеОстатки","")+") КАК ДоходыИРасходы";
		
	// Денежные средства
	Если Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваКомпании")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Денежные средства"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБОР КОГДА ДенежныеСредства.СтруктурнаяЕдиница ССЫЛКА Справочник.КассыКомпании ТОГДА ""Касса""
		|		  КОГДА ДенежныеСредства.СтруктурнаяЕдиница ССЫЛКА Справочник.БанковскиеСчета ТОГДА ""Банк""
		|		  КОГДА ДенежныеСредства.СтруктурнаяЕдиница ССЫЛКА Справочник.ЦенныеБумаги ТОГДА ""Ценные бумаги""
		|		  ИНАЧЕ """" КОНЕЦ,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ДенежныеСредства.СтруктурнаяЕдиница,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ДенежныеСредства.Регистратор КАК Регистратор,
		|	ДенежныеСредства.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ДенежныеСредства.СуммаУпрНачальныйОстаток,
		|	0,
		|	ДенежныеСредства.СуммаУпрПриход,
		|	ДенежныеСредства.СуммаУпрРасход,
		|	ДенежныеСредства.СуммаУпрКонечныйОстаток,
		|	0
		|ИЗ 
		|	(ВЫБРАТЬ
		|	ДенежныеСредстваКомпании.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДенежныеСредстваКомпании.Регистратор КАК Регистратор,
		|	ДенежныеСредстваКомпании.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА ДенежныеСредстваКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА ДенежныеСредстваКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА ДенежныеСредстваКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
		|ГДЕ
		|	ДенежныеСредстваКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыДенежныеСредстваКомпании+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваКомпанииНачальныеОстатки.СтруктурнаяЕдиница,
		|	NULL,
		|	&ДатаНачала,
		|	ДенежныеСредстваКомпанииНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании.Остатки(&ДатаНачала, "+ТекстПараметрыДенежныеСредстваКомпании+") КАК ДенежныеСредстваКомпанииНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДенежныеСредстваКомпанииКонечныеОстатки.СтруктурнаяЕдиница,
		|	NULL,
		|	&ДатаНачала,
		|	0,
		|	ДенежныеСредстваКомпанииКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваКомпании.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыДенежныеСредстваКомпании+") КАК ДенежныеСредстваКомпанииКонечныеОстатки","")+"
		|) КАК ДенежныеСредства";
	КонецЕсли; 
	
	// КассыККМ
	Если Метаданные.РегистрыНакопления.Найти("КассыККМ")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Денежные средства в кассах ККМ"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	""Кассы ККМ"",";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РегистрНакопленияКассыККМ.КассаККМ,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РегистрНакопленияКассыККМ.Регистратор КАК Регистратор,
		|	РегистрНакопленияКассыККМ.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЕСТЬNULL(РегистрНакопленияКассыККМ.СуммаУпрНачальныйОстаток, 0),
		|	0,
		|	ЕСТЬNULL(РегистрНакопленияКассыККМ.СуммаУпрПриход, 0),
		|	ЕСТЬNULL(РегистрНакопленияКассыККМ.СуммаУпрРасход, 0),
		|	ЕСТЬNULL(РегистрНакопленияКассыККМ.СуммаУпрКонечныйОстаток, 0),
		|	0
		|ИЗ (ВЫБРАТЬ
		|	КассыККМ.КассаККМ КАК КассаККМ,
		|	КассыККМ.Регистратор КАК Регистратор,
		|	КассыККМ.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА КассыККМ.ВидДвижения = &ВидДвижения
		|			ТОГДА КассыККМ.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА КассыККМ.ВидДвижения <> &ВидДвижения
		|			ТОГДА КассыККМ.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И КассыККМ.СпособОплаты.Объект В(&СписокСпособовОплат)"+ТекстОтборыКассыККМ+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КассыККМНачальныеОстатки.КассаККМ,
		|	NULL,
		|	&ДатаНачала,
		|	КассыККМНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.КассыККМ.Остатки(&ДатаНачала,СпособОплаты.Объект В (&СписокСпособовОплат) "+ТекстПараметрыКассыККМ+") КАК КассыККМНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КассыККМКонечныеОстатки.КассаККМ,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	КассыККМКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.КассыККМ.Остатки(&ДатаКонцаВключая, СпособОплаты.Объект В (&СписокСпособовОплат) "+ТекстПараметрыКассыККМ+") КАК КассыККМКонечныеОстатки","")+") КАК РегистрНакопленияКассыККМ";
	КонецЕсли;

	// ВзаиморасчетыКомпании
	Если Метаданные.РегистрыНакопления.Найти("ВзаиморасчетыКомпании")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Взаиморасчеты с контрагентами"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	Взаиморасчеты.Контрагент.ВидКонтрагента,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	Взаиморасчеты.Контрагент,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	Взаиморасчеты.Регистратор КАК Регистратор,
		|	Взаиморасчеты.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ВЫБОР КОГДА Взаиморасчеты.СуммаУпрНачальныйОстаток > 0 ТОГДА Взаиморасчеты.СуммаУпрНачальныйОстаток
		|		  ИНАЧЕ 0 КОНЕЦ,
		|	ВЫБОР КОГДА Взаиморасчеты.СуммаУпрНачальныйОстаток < 0 ТОГДА -(Взаиморасчеты.СуммаУпрНачальныйОстаток)
		|		  ИНАЧЕ 0 КОНЕЦ,
		|	Взаиморасчеты.СуммаУпрПриход,
		|	Взаиморасчеты.СуммаУпрРасход,
		|	ВЫБОР КОГДА Взаиморасчеты.СуммаУпрКонечныйОстаток > 0 ТОГДА Взаиморасчеты.СуммаУпрКонечныйОстаток
		|		  ИНАЧЕ 0 КОНЕЦ,
		|	ВЫБОР КОГДА Взаиморасчеты.СуммаУпрКонечныйОстаток < 0 ТОГДА -(Взаиморасчеты.СуммаУпрКонечныйОстаток)
		|		  ИНАЧЕ 0 КОНЕЦ
		|ИЗ (ВЫБРАТЬ
		|	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
		|	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВзаиморасчетыКомпании.Регистратор КАК Регистратор,
		|	ВзаиморасчетыКомпании.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА ВзаиморасчетыКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА ВзаиморасчетыКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
		|ГДЕ
		|	ВзаиморасчетыКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыВзаиморасчетыКомпании+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииНачальныйОстатки.Контрагент,
		|	ВзаиморасчетыКомпанииНачальныйОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	ВзаиморасчетыКомпанииНачальныйОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаНачала, "+ТекстПараметрыВзаиморасчетыКомпании+" ) КАК ВзаиморасчетыКомпанииНачальныйОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВзаиморасчетыКомпанииКонечныйОстатки.Контрагент,
		|	ВзаиморасчетыКомпанииКонечныйОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	ВзаиморасчетыКомпанииКонечныйОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыВзаиморасчетыКомпании+") КАК ВзаиморасчетыКомпанииКонечныйОстатки","")+") КАК Взаиморасчеты";
	КонецЕсли;
	
	// ПартииТоваровКомпании
	Если Метаданные.РегистрыНакопления.Найти("ПартииТоваровКомпании")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
	    |
		|ОБЪЕДИНИТЬ ВСЕ
	    |
		|ВЫБРАТЬ ""Остатки товаров"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваров.Номенклатура.ТипНоменклатуры,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваров.Номенклатура,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваров.Регистратор КАК Регистратор,
		|	ПартииТоваров.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваров.СуммаУпрНачальныйОстаток,
		|	0,
		|	ПартииТоваров.СуммаУпрПриход,
		|	ПартииТоваров.СуммаУпрРасход,
		|	ПартииТоваров.СуммаУпрКонечныйОстаток,
		|	0
		|ИЗ 
		|(ВЫБРАТЬ
		|	ПартииТоваровКомпании.Номенклатура КАК Номенклатура,
		|	ПартииТоваровКомпании.СкладКомпании КАК СкладКомпании,
		|	ПартииТоваровКомпании.Регистратор КАК Регистратор,
		|	ПартииТоваровКомпании.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА ПартииТоваровКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА ПартииТоваровКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА ПартииТоваровКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	ПартииТоваровКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И ПартииТоваровКомпании.СтатусПартии = &ТоварКупленный"+ТекстОтборыПартииТоваровКомпании+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПартииТоваровКомпанииНачальныеОстатки.Номенклатура,
		|	ПартииТоваровКомпанииНачальныеОстатки.СкладКомпании,
		|	NULL,
		|	&ДатаНачала,
		|	ПартииТоваровКомпанииНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаНачала, СтатусПартии = &ТоварКупленный"+ТекстПараметрыПартииТоваровКомпании+") КАК ПартииТоваровКомпанииНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПартииТоваровКомпанииКонечныеОстатки.Номенклатура,
		|	ПартииТоваровКомпанииКонечныеОстатки.СкладКомпании КАК СкладКомпании,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	ПартииТоваровКомпанииКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонцаВключая, СтатусПартии = &ТоварКупленный"+ТекстПараметрыПартииТоваровКомпании+") КАК ПартииТоваровКомпанииКонечныеОстатки","")+") КАК ПартииТоваров";
	КонецЕсли;
	
	// ПартииТоваровОтданные
	Если Метаданные.РегистрыНакопления.Найти("ПартииТоваровОтданные")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Остатки товаров отданных"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваровОтданные.Номенклатура.ТипНоменклатуры,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваровОтданные.Номенклатура,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваровОтданные.Регистратор КАК Регистратор,
		|	ПартииТоваровОтданные.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ПартииТоваровОтданные.СуммаСебестоимостиУпрНачальныйОстаток,
		|	0,
		|	ПартииТоваровОтданные.СуммаСебестоимостиУпрПриход,
		|	ПартииТоваровОтданные.СуммаСебестоимостиУпрРасход,
		|	ПартииТоваровОтданные.СуммаСебестоимостиУпрКонечныйОстаток,
		|	0
		|ИЗ (ВЫБРАТЬ
		|	ПартииТоваровОтданныеКомпании.Номенклатура КАК Номенклатура,
		|	ПартииТоваровОтданныеКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ПартииТоваровОтданныеКомпании.Регистратор КАК Регистратор,
		|	ПартииТоваровОтданныеКомпании.Период КАК Период,
		|	0 КАК СуммаСебестоимостиУпрНачальныйОстаток,
		|	0 КАК СуммаСебестоимостиУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ПартииТоваровОтданныеКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА ПартииТоваровОтданныеКомпании.СуммаСебестоимостиУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСебестоимостиУпрПриход,
		|	ВЫБОР
		|		КОГДА ПартииТоваровОтданныеКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА ПартииТоваровОтданныеКомпании.СуммаСебестоимостиУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСебестоимостиУпрРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданныеКомпании
		|ГДЕ
		|	ПартииТоваровОтданныеКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыПартииТоваровОтданные+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПартииТоваровОтданныеНачальныеОстатки.Номенклатура,
		|	ПартииТоваровОтданныеНачальныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	ПартииТоваровОтданныеНачальныеОстатки.СуммаСебестоимостиУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные.Остатки(&ДатаНачала, "+ТекстПараметрыПартииТоваровОтданные+") КАК ПартииТоваровОтданныеНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПартииТоваровОтданныеКонечныеОстатки.Номенклатура,
		|	ПартииТоваровОтданныеКонечныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	0,
		|	ПартииТоваровОтданныеКонечныеОстатки.СуммаСебестоимостиУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыПартииТоваровОтданные+") КАК ПартииТоваровОтданныеКонечныеОстатки","")+") КАК ПартииТоваровОтданные";
	КонецЕсли;
	
	// РеализованныеТовары
	Если Метаданные.РегистрыНакопления.Найти("РеализованныеТовары")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Реализованные товары"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеТовары.Номенклатура.ТипНоменклатуры,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеТовары.Номенклатура,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеТовары.Регистратор КАК Регистратор,
		|	РеализованныеТовары.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	0,
		|	РеализованныеТовары.СуммаУпрНачальныйОстаток,
		|	РеализованныеТовары.СуммаУпрРасход,
		|	РеализованныеТовары.СуммаУпрПриход,
		|	0,
		|	РеализованныеТовары.СуммаУпрКонечныйОстаток
		|ИЗ (ВЫБРАТЬ
		|	РеализованныеТоварыКомпании.Номенклатура КАК Номенклатура,
		|	РеализованныеТоварыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	РеализованныеТоварыКомпании.Регистратор КАК Регистратор,
		|	РеализованныеТоварыКомпании.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА РеализованныеТоварыКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА РеализованныеТоварыКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА РеализованныеТоварыКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА РеализованныеТоварыКомпании.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТоварыКомпании
		|ГДЕ
		|	РеализованныеТоварыКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыРеализованныеТовары+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализованныеТоварыНачальныеОстатки.Номенклатура,
		|	РеализованныеТоварыНачальныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	РеализованныеТоварыНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.РеализованныеТовары.Остатки(&ДатаНачала, "+ТекстПараметрыРеализованныеТовары+") КАК РеализованныеТоварыНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализованныеТоварыКонечныеОстатки.Номенклатура,
		|	РеализованныеТоварыКонечныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	0,
		|	РеализованныеТоварыКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.РеализованныеТовары.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыРеализованныеТовары+") КАК РеализованныеТоварыКонечныеОстатки","")+") КАК РеализованныеТовары";
	КонецЕсли;
	
	// Прочие активы в эксплуатации
	Если Метаданные.РегистрыНакопления.Найти("ПрочиеАктивыВЭксплуатации")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Прочие активы в эксплуатации"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПрочиеАктивыВЭксплуатации.ПрочийАктив.ВидПрочегоАктива,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПрочиеАктивыВЭксплуатации.ПрочийАктив,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ПрочиеАктивыВЭксплуатации.Регистратор КАК Регистратор,
		|	ПрочиеАктивыВЭксплуатации.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ПрочиеАктивыВЭксплуатации.ОстаточнаяСтоимостьУпрНачальныйОстаток,
		|	0,
		|	ПрочиеАктивыВЭксплуатации.ОстаточнаяСтоимостьУпрПриход,
		|	ПрочиеАктивыВЭксплуатации.ОстаточнаяСтоимостьУпрРасход,
		|	ПрочиеАктивыВЭксплуатации.ОстаточнаяСтоимостьУпрКонечныйОстаток,
		|	0
		|ИЗ (ВЫБРАТЬ
		|	ПрочиеАктивыВЭксплуатацииКомпании.ПрочийАктив КАК ПрочийАктив,
		|	ПрочиеАктивыВЭксплуатацииКомпании.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ПрочиеАктивыВЭксплуатацииКомпании.Регистратор КАК Регистратор,
		|	ПрочиеАктивыВЭксплуатацииКомпании.Период КАК Период,
		|	0 КАК ОстаточнаяСтоимостьУпрНачальныйОстаток,
		|	0 КАК ОстаточнаяСтоимостьУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ПрочиеАктивыВЭксплуатацииКомпании.ВидДвижения = &ВидДвижения
		|			ТОГДА ПрочиеАктивыВЭксплуатацииКомпании.БалансоваяСтоимостьУпр-ПрочиеАктивыВЭксплуатацииКомпании.СуммаАмортизацииУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстаточнаяСтоимостьУпрПриход,
		|	ВЫБОР
		|		КОГДА ПрочиеАктивыВЭксплуатацииКомпании.ВидДвижения <> &ВидДвижения
		|			ТОГДА ПрочиеАктивыВЭксплуатацииКомпании.БалансоваяСтоимостьУпр-ПрочиеАктивыВЭксплуатацииКомпании.СуммаАмортизацииУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОстаточнаяСтоимостьУпрРасход
		|ИЗ
		|	РегистрНакопления.ПрочиеАктивыВЭксплуатации КАК ПрочиеАктивыВЭксплуатацииКомпании
		|ГДЕ
		|	ПрочиеАктивыВЭксплуатацииКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыПрочиеАктивыВЭксплуатации+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеАктивыВЭксплуатацииНачальныеОстатки.ПрочийАктив,
		|	ПрочиеАктивыВЭксплуатацииНачальныеОстатки.ПодразделениеКомпании,
		|	NULL,
		|	&ДатаНачала,
		|	ПрочиеАктивыВЭксплуатацииНачальныеОстатки.БалансоваяСтоимостьУпрОстаток-ПрочиеАктивыВЭксплуатацииНачальныеОстатки.СуммаАмортизацииУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки(&ДатаНачала, "+ТекстПараметрыПрочиеАктивыВЭксплуатации+") КАК ПрочиеАктивыВЭксплуатацииНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрочиеАктивыВЭксплуатацииКонечныеОстатки.ПрочийАктив,
		|	ПрочиеАктивыВЭксплуатацииКонечныеОстатки.ПодразделениеКомпании,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	ПрочиеАктивыВЭксплуатацииКонечныеОстатки.БалансоваяСтоимостьУпрОстаток-ПрочиеАктивыВЭксплуатацииКонечныеОстатки.СуммаАмортизацииУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыПрочиеАктивыВЭксплуатации+") КАК ПрочиеАктивыВЭксплуатацииКонечныеОстатки","")+") КАК ПрочиеАктивыВЭксплуатации";
	КонецЕсли;

	//Для Альфы	
	//ТоварыВПроизводстве
	Если Метаданные.РегистрыНакопления.Найти("ТоварыВПроизводстве")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Товары в производстве"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ТоварыВПроизводстве.Номенклатура.ТипНоменклатуры,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ТоварыВПроизводстве.Номенклатура,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ТоварыВПроизводстве.Регистратор КАК Регистратор,
		|	ТоварыВПроизводстве.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ТоварыВПроизводстве.СуммаУпрНачальныйОстаток,
		|	0,
		|	ТоварыВПроизводстве.СуммаУпрПриход,
		|	ТоварыВПроизводстве.СуммаУпрРасход,
		|	ТоварыВПроизводстве.СуммаУпрКонечныйОстаток,
		|	0
		|ИЗ 
		|(ВЫБРАТЬ
		|	ТоварыВПроизводстве.Номенклатура КАК Номенклатура,
		|	ТоварыВПроизводстве.Цех КАК СкладКомпании,
		|	ТоварыВПроизводстве.Регистратор КАК Регистратор,
		|	ТоварыВПроизводстве.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ТоварыВПроизводстве.ВидДвижения = &ВидДвижения
		|			ТОГДА ТоварыВПроизводстве.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА ТоварыВПроизводстве.ВидДвижения <> &ВидДвижения
		|			ТОГДА ТоварыВПроизводстве.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И ТоварыВПроизводстве.СтатусПартии = &ТоварКупленный"+ТекстОтборыТоварыВПроизводстве+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыВПроизводствеНачальныеОстатки.Номенклатура,
		|	ТоварыВПроизводствеНачальныеОстатки.Цех,
		|	NULL,
		|	&ДатаНачала,
		|	ТоварыВПроизводствеНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве.Остатки(&ДатаНачала, СтатусПартии = &ТоварКупленный"+ТекстПараметрыТоварыВПроизводстве+") КАК ТоварыВПроизводствеНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыВПроизводствеКонечныеОстатки.Номенклатура,
		|	ТоварыВПроизводствеКонечныеОстатки.Цех КАК СкладКомпании,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	ТоварыВПроизводствеКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве.Остатки(&ДатаКонцаВключая, СтатусПартии = &ТоварКупленный"+ТекстПараметрыТоварыВПроизводстве+") КАК ТоварыВПроизводствеКонечныеОстатки","")+") КАК ТоварыВПроизводстве";
	КонецЕсли;
	
	// ОстаткиАвтомобилей
	Если Метаданные.РегистрыНакопления.Найти("ОстаткиАвтомобилей")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Остатки автомобилей"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ОстаткиАвтомобилей.Автомобиль.Модель,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ОстаткиАвтомобилей.Автомобиль,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
		|	ОстаткиАвтомобилей.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ОстаткиАвтомобилей.СуммаУпрНачальныйОстаток,
		|	0,
		|	ОстаткиАвтомобилей.СуммаУпрПриход,
		|	ОстаткиАвтомобилей.СуммаУпрРасход,
		|	ОстаткиАвтомобилей.СуммаУпрКонечныйОстаток,
		|	0
		|ИЗ 
		|(ВЫБРАТЬ
		|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилей.СкладКомпании КАК СкладКомпании,
		|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
		|	ОстаткиАвтомобилей.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА ОстаткиАвтомобилей.ВидДвижения = &ВидДвижения
		|			ТОГДА ОстаткиАвтомобилей.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА ОстаткиАвтомобилей.ВидДвижения <> &ВидДвижения
		|			ТОГДА ОстаткиАвтомобилей.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|ГДЕ
		|	ОстаткиАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И ОстаткиАвтомобилей.СтатусПартии = &ТоварКупленный"+ТекстОтборыОстаткиАвтомобилей+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейНачальныеОстатки.Автомобиль,
		|	ОстаткиАвтомобилейНачальныеОстатки.СкладКомпании,
		|	NULL,
		|	&ДатаНачала,
		|	ОстаткиАвтомобилейНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаНачала, СтатусПартии = &ТоварКупленный"+ТекстПараметрыОстаткиАвтомобилей+") КАК ОстаткиАвтомобилейНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейКонечныеОстатки.Автомобиль,
		|	ОстаткиАвтомобилейКонечныеОстатки.СкладКомпании КАК СкладКомпании,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	ОстаткиАвтомобилейКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаКонцаВключая, СтатусПартии = &ТоварКупленный"+ТекстПараметрыОстаткиАвтомобилей+") КАК ОстаткиАвтомобилейКонечныеОстатки","")+") КАК ОстаткиАвтомобилей";
	КонецЕсли;
	
	// КомплектацияАвтомобилей
	Если Метаданные.РегистрыНакопления.Найти("КомплектацияАвтомобилей")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Комплектация автомобилей"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	КомплектацияАвтомобилей.Автомобиль.Модель,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	КомплектацияАвтомобилей.Автомобиль,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	КомплектацияАвтомобилей.Регистратор КАК Регистратор,
		|	КомплектацияАвтомобилей.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	КомплектацияАвтомобилей.СуммаУпрНачальныйОстаток,
		|	0,
		|	КомплектацияАвтомобилей.СуммаУпрПриход,
		|	КомплектацияАвтомобилей.СуммаУпрРасход,
		|	КомплектацияАвтомобилей.СуммаУпрКонечныйОстаток,
		|	0
		|ИЗ 
		|(ВЫБРАТЬ
		|	КомплектацияАвтомобилей.Автомобиль КАК Автомобиль,
		|	КомплектацияАвтомобилей.СкладКомпании КАК СкладКомпании,
		|	КомплектацияАвтомобилей.Регистратор КАК Регистратор,
		|	КомплектацияАвтомобилей.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА КомплектацияАвтомобилей.ВидДвижения = &ВидДвижения
		|			ТОГДА КомплектацияАвтомобилей.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА КомплектацияАвтомобилей.ВидДвижения <> &ВидДвижения
		|			ТОГДА КомплектацияАвтомобилей.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		|ГДЕ
		|	КомплектацияАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаКонца
		|	И КомплектацияАвтомобилей.СтатусПартии = &ТоварКупленный"+ТекстОтборыКомплектацияАвтомобилей+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомплектацияАвтомобилейНачальныеОстатки.Автомобиль,
		|	КомплектацияАвтомобилейНачальныеОстатки.СкладКомпании,
		|	NULL,
		|	&ДатаНачала,
		|	КомплектацияАвтомобилейНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.Остатки(&ДатаНачала, СтатусПартии = &ТоварКупленный"+ТекстПараметрыКомплектацияАвтомобилей+") КАК КомплектацияАвтомобилейНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомплектацияАвтомобилейКонечныеОстатки.Автомобиль,
		|	КомплектацияАвтомобилейКонечныеОстатки.СкладКомпании КАК СкладКомпании,
		|	NULL,
		|	&ДатаКонца,
		|	0,
		|	КомплектацияАвтомобилейКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей.Остатки(&ДатаКонцаВключая, СтатусПартии = &ТоварКупленный"+ТекстПараметрыКомплектацияАвтомобилей+") КАК КомплектацияАвтомобилейКонечныеОстатки","")+") КАК КомплектацияАвтомобилей";
	КонецЕсли;
	
	// АвтомобилиОтданные
	Если Метаданные.РегистрыНакопления.Найти("АвтомобилиОтданные")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Остатки автомобилей отданных"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	АвтомобилиОтданные.Автомобиль.Модель,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	АвтомобилиОтданные.Автомобиль,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	АвтомобилиОтданные.Регистратор КАК Регистратор,
		|	АвтомобилиОтданные.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	АвтомобилиОтданные.СуммаСебестоимостиУпрНачальныйОстаток,
		|	0,
		|	АвтомобилиОтданные.СуммаСебестоимостиУпрПриход,
		|	АвтомобилиОтданные.СуммаСебестоимостиУпрРасход,
		|	АвтомобилиОтданные.СуммаСебестоимостиУпрКонечныйОстаток,
		|	0
		|ИЗ (ВЫБРАТЬ
		|	АвтомобилиОтданные.Автомобиль КАК Автомобиль,
		|	АвтомобилиОтданные.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	АвтомобилиОтданные.Регистратор КАК Регистратор,
		|	АвтомобилиОтданные.Период КАК Период,
		|	0 КАК СуммаСебестоимостиУпрНачальныйОстаток,
		|	0 КАК СуммаСебестоимостиУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА АвтомобилиОтданные.ВидДвижения = &ВидДвижения
		|			ТОГДА АвтомобилиОтданные.СуммаСебестоимостиУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСебестоимостиУпрПриход,
		|	ВЫБОР
		|		КОГДА АвтомобилиОтданные.ВидДвижения <> &ВидДвижения
		|			ТОГДА АвтомобилиОтданные.СуммаСебестоимостиУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаСебестоимостиУпрРасход
		|ИЗ
		|	РегистрНакопления.АвтомобилиОтданные КАК АвтомобилиОтданные
		|ГДЕ
		|	АвтомобилиОтданные.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыАвтомобилиОтданные+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АвтомобилиОтданныеНачальныеОстатки.Автомобиль,
		|	АвтомобилиОтданныеНачальныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	АвтомобилиОтданныеНачальныеОстатки.СуммаСебестоимостиУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.АвтомобилиОтданные.Остатки(&ДатаНачала, "+ТекстПараметрыАвтомобилиОтданные+") КАК АвтомобилиОтданныеНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ 
		|
		|ВЫБРАТЬ
		|	АвтомобилиОтданныеКонечныеОстатки.Автомобиль,
		|	АвтомобилиОтданныеКонечныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	0,
		|	АвтомобилиОтданныеКонечныеОстатки.СуммаСебестоимостиУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.АвтомобилиОтданные.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыАвтомобилиОтданные+") КАК АвтомобилиОтданныеКонечныеОстатки","")+") КАК АвтомобилиОтданные";
	КонецЕсли;
	
	// РеализованныеАвтомобили
	Если Метаданные.РегистрыНакопления.Найти("РеализованныеАвтомобили")<>Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ""Реализованные автомобили"",";
		Если пкДетализация > 0 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеАвтомобили.Автомобиль.Модель,";
		КонецЕсли;
		Если пкДетализация > 1 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеАвтомобили.Автомобиль,";
		КонецЕсли;
		Если пкДетализация > 2 Тогда ТекстЗапроса = ТекстЗапроса + "
		|	РеализованныеАвтомобили.Регистратор КАК Регистратор,
		|	РеализованныеАвтомобили.Период,";
		КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	0,
		|	РеализованныеАвтомобили.СуммаУпрНачальныйОстаток,
		|	РеализованныеАвтомобили.СуммаУпрРасход,
		|	РеализованныеАвтомобили.СуммаУпрПриход,
		|	0,
		|	РеализованныеАвтомобили.СуммаУпрКонечныйОстаток
		|ИЗ (ВЫБРАТЬ
		|	РеализованныеАвтомобили.Автомобиль КАК Автомобиль,
		|	РеализованныеАвтомобили.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	РеализованныеАвтомобили.Регистратор КАК Регистратор,
		|	РеализованныеАвтомобили.Период КАК Период,
		|	0 КАК СуммаУпрНачальныйОстаток,
		|	0 КАК СуммаУпрКонечныйОстаток,
		|	ВЫБОР
		|		КОГДА РеализованныеАвтомобили.ВидДвижения = &ВидДвижения
		|			ТОГДА РеализованныеАвтомобили.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрПриход,
		|	ВЫБОР
		|		КОГДА РеализованныеАвтомобили.ВидДвижения <> &ВидДвижения
		|			ТОГДА РеализованныеАвтомобили.СуммаУпр
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаУпрРасход
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили КАК РеализованныеАвтомобили
		|ГДЕ
		|	РеализованныеАвтомобили.Период МЕЖДУ &ДатаНачала И &ДатаКонца"+ТекстОтборыРеализованныеАвтомобили+?(ЕстьОстатки,"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализованныеАвтомобилиНачальныеОстатки.Автомобиль,
		|	РеализованныеАвтомобилиНачальныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	РеализованныеАвтомобилиНачальныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили.Остатки(&ДатаНачала, "+ТекстПараметрыРеализованныеАвтомобили+") КАК РеализованныеАвтомобилиНачальныеОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализованныеАвтомобилиКонечныеОстатки.Автомобиль,
		|	РеализованныеАвтомобилиКонечныеОстатки.ДоговорВзаиморасчетов,
		|	NULL,
		|	&ДатаНачала,
		|	0,
		|	РеализованныеАвтомобилиКонечныеОстатки.СуммаУпрОстаток,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.РеализованныеАвтомобили.Остатки(&ДатаКонцаВключая, "+ТекстПараметрыРеализованныеАвтомобили+") КАК РеализованныеАвтомобилиКонечныеОстатки","")+") КАК РеализованныеАвтомобили";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " ) КАК ВложенныйЗапрос 
	|ГДЕ
	|	ВложенныйЗапрос.АктивНачОст <> 0 ИЛИ
	|	ВложенныйЗапрос.ПассивНачОст <> 0 ИЛИ
	|	ВложенныйЗапрос.Приход <> 0 ИЛИ
	|	ВложенныйЗапрос.Расход <> 0 ИЛИ
	|	ВложенныйЗапрос.АктивКонОст <> 0 ИЛИ
	|	ВложенныйЗапрос.ПассивКонОст <> 0
	|
	|УПОРЯДОЧИТЬ ПО УчетныйБлок "+?(пкДетализация > 0, ", ТипОбъектаУчета", "") + ?(пкДетализация > 1, ", ОбъектУчета.Наименование", "") + ?(пкДетализация > 2, ", Период", "")+"
    |
	|ИТОГИ
	|	СУММА(АктивНачОст),
	|	СУММА(ПассивНачОст),
	|	СУММА(Приход),
	|	СУММА(Расход),
	|	"+?(пкДетализация > 2, "МАКСИМУМ(Период),", "")+"
	|	СУММА(АктивКонОст),
	|	СУММА(ПассивКонОст)
	|ПО
	|	ОБЩИЕ,
	|	УчетныйБлок" + ?(пкДетализация > 0, ", ТипОбъектаУчета", "") + ?(пкДетализация > 1, ", ОбъектУчета", "")+?(пкДетализация > 2, ", Регистратор", "");
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

// Выводит выборку результата запроса в табличный документ
//
// Параметры
//  ДокРезультат - ТабличныйДокумент 
//  Выборка - Выборка
//
Процедура ВывестиГруппировки(ДокРезультат, Выборка)
	Пока Выборка.Следующий() Цикл
		Уровень = Выборка.Уровень();
		Если (Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке) Тогда
			
			ТекГруппировка = Выборка.Группировка();
			
			ОбластьСтроки = МакетОтчета.ПолучитьОбласть("Строка");
			ОбластьСтроки.Параметры.АктивНачОст  = Выборка.АктивНачОст;
			ОбластьСтроки.Параметры.ПассивНачОст = Выборка.ПассивНачОст;
			ОбластьСтроки.Параметры.Приход       = Выборка.Приход;
			ОбластьСтроки.Параметры.Расход       = Выборка.Расход;
			ОбластьСтроки.Параметры.АктивКонОст  = Выборка.АктивКонОст;
			ОбластьСтроки.Параметры.ПассивКонОст = Выборка.ПассивКонОст;
			
			// Нет ни периода, не регистратора, когда детализация не до документа
			Если ТекГруппировка = "Регистратор" Тогда
				Если Выборка.Регистратор = NULL Тогда Продолжить; КонецЕсли;
				
				// Если группировка документ, то начальные и конечные итоги смысла не имеют, 
				// поэтому их принудительно обнуляем.
				Если Выборка.Регистратор <> NULL Тогда
					ОбластьСтроки.Параметры.АктивНачОст  = 0;
					ОбластьСтроки.Параметры.ПассивНачОст = 0;
					ОбластьСтроки.Параметры.АктивКонОст  = 0;
					ОбластьСтроки.Параметры.ПассивКонОст = 0;
				КонецЕсли;
			КонецЕсли;
			
			ОбластьСтроки.Параметры.ЗначениеГруппировки = Выборка[ТекГруппировка];
			
			//заполним параметры расшифровки
			Если НЕ (Уровень > 3) И НЕ (пкФильтр = 3) Тогда 
			//если отчет построен не "по документу" , то для УчетныйБлок, ТипОбъектаУчета и ОбъектУчета - параметром 
			//расшифровки будет структура с данными
				Расшифровка = Новый Структура;
				Если НЕ (Уровень < 1) Тогда 
					Расшифровка.Вставить("УчБлок",Выборка.УчетныйБлок); 
				КонецЕсли;
				Если НЕ (Уровень < 2) Тогда 
					Расшифровка.Вставить("ТипОбУчета",Выборка.ТипОбъектаУчета); 
				КонецЕсли;
				Если НЕ (Уровень < 3) Тогда 
					Расшифровка.Вставить("ОбУчета",Выборка.ОбъектУчета); 
				КонецЕсли;
				ОбластьСтроки.Параметры.РасшифровкаГруппировки = Расшифровка; 
			Иначе
				//если отчет построен "по документу" или в других случаях для расшифровки Документа - по умолчанию
				ОбластьСтроки.Параметры.РасшифровкаГруппировки = ОбластьСтроки.Параметры.ЗначениеГруппировки;
			КонецЕсли;
			//конец заполнения параметров расшифровки
			
			ОбластьСтроки.Область(1, 1, 1, 7).Шрифт      = ОформлениеСтроки[Уровень+3-(пкДетализация-3)].Шрифт;
			ОбластьСтроки.Область(1, 1, 1, 7).ЦветТекста = ОформлениеСтроки[Уровень+3-(пкДетализация-3)].ЦветТекста;
			ОбластьСтроки.Область(1, 1, 1, 7).ЦветФона   = ОформлениеСтроки[Уровень+3-(пкДетализация-3)].ЦветФона;
			
			ДокРезультат.Вывести(ОбластьСтроки, Уровень);
		КонецЕсли;
		Если (Уровень-1)<=пкДетализация Тогда
			ВывестиГруппировки(ДокРезультат, Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ВывестиГруппировки()


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат - ТабличныйДокумент или ПолеТабличногоДокумента - передает ссылку на табличный документ 
//						или поле табличного документа
//
// Возвращаемое значение:
//  отчет в виде табличного документа 
//
Функция СформироватьТабличныйДокумент (ДокРезультат=Неопределено) Экспорт
	Если ТипЗнч(ДокРезультат) <> Тип("ПолеТабличногоДокумента") И ТипЗнч(ДокРезультат) <> Тип("ТабличныйДокумент") Тогда
		ДокРезультат = Новый ТабличныйДокумент();
	Иначе ДокРезультат.Очистить();
	КонецЕсли;
	
	// проверим корректность заполнения
	Если ДатаНачала > ДатаКонца И ДатаКонца <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		Возврат ДокРезультат;
	КонецЕсли;
	
	Если обПраво("ПредупреждатьОНарушенииПоследовательностей", глПрава) Тогда
		
		ОбработкаВосстановлениеПоследовательностей = Обработки.ВосстановлениеПоследовательностей.Создать();
		ПоследовательностиОтчета = Новый Структура();
		ПоследовательностиОтчета.Вставить("ГраницыПартий");
		ПоследовательностиОтчета.Вставить("ГраницыВзаиморасчетов");
		ПоследовательностиОтчета.Вставить("ГраницыАвтомобили");
		ПоследовательностиОтчета.Вставить("ГраницыКомплектация");
		ПоследовательностиОтчета.Вставить("ГраницыПроизводство");
		
		
		ТаблицаПоследовательностей = ОбработкаВосстановлениеПоследовательностей.ТаблицаПоследовательностей;
		КоличествоПоследовательностей = ТаблицаПоследовательностей.Количество()-1;
		
		Пока КоличествоПоследовательностей>=0 Цикл
			ТекПоследовательность = ТаблицаПоследовательностей[КоличествоПоследовательностей];
			Если Не ПоследовательностиОтчета.Свойство(ТекПоследовательность.ИмяГраницы) Тогда
				ТаблицаПоследовательностей.Удалить(ТекПоследовательность);
			КонецЕсли;
			КоличествоПоследовательностей = КоличествоПоследовательностей-1;
		КонецЦикла;
		
		Если ТаблицаПоследовательностей.Количество()>0 Тогда
			ТаблицаГраниц = ОбработкаВосстановлениеПоследовательностей.ПолучитьТаблицуНеактуальныхДокументов(ДатаКонца);
			ТекстПредупреждения = "";
			Для Каждого ТекПоследовательность Из ТаблицаПоследовательностей Цикл
				Граница = ТаблицаГраниц.Найти(ТекПоследовательность.ИмяГраницы,"ИмяПоследовательности");
				Если Граница <> Неопределено Тогда
					ТекстАктуальна = "";
					Если Граница.Граница=Неопределено Тогда
						ТекстАктуальна	= Формат(Граница.МоментВремени,"ДФ=dd.MM.yyyy");
					Иначе
						ТекстАктуальна	= Формат(Граница.Граница.Дата,"ДФ=dd.MM.yyyy")+" - "+Граница.Граница.Метаданные().Синоним+" № "+СокрЛП(Граница.Граница.Номер);
					КонецЕсли;
					ТекстПредупреждения = ТекстПредупреждения+"
					| Последовательность: <" + ТекПоследовательность.Представление + "> актуальна " + ТекстАктуальна;
				КонецЕсли;
			КонецЦикла;
			Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
				Предупреждение("Последовательности разрушены и возможны некорректные результаты отчетов!"+ТекстПредупреждения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// получим макеты для результата и оформления
	МакетОтчета = ПолучитьМакет("Макет");
	МакетОтчетаПараметров = ПолучитьОбщийМакет(ИмяМакетаОформленияТабличногоДокумента);
	
	// элементы оформления 
	ОформлениеСтроки = Новый Массив;
	ОбластьОформленияИзмерений = МакетОтчетаПараметров.ПолучитьОбласть("ОформлениеИзмерений");
	Для Сч = 1 По ОбластьОформленияИзмерений.ВысотаТаблицы Цикл
		ОформлениеСтроки.Добавить(ОбластьОформленияИзмерений.Область(Сч, 1));
	КонецЦикла;
	
	ОформлениеШапки = МакетОтчетаПараметров.ПолучитьОбласть("ОформлениеШапки").Область(1, 1);
	ОформлениеИтоги = МакетОтчетаПараметров.ПолучитьОбласть("ОформлениеИтоги").Область(1, 1);
	
	// Если баланс по подразделению соберем список подразделений
	Если (пкФильтр = 2) И (ВедетсяБалансПоПодразделению) Тогда
		СписокПодразделений = Новый Массив;
		ЗапросПоПодразделениям = Новый Запрос("ВЫБРАТЬ
		|	ПодразделенияКомпании.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
		|ГДЕ
		|	"+?(ВключатьБалансовыеПодразделения,"","(ПодразделенияКомпании.Балансовое = &Балансовое ИЛИ ПодразделенияКомпании.Ссылка = &Родитель) И")+"
		|	ПодразделенияКомпании.Ссылка В ИЕРАРХИИ(&Родитель)");	
		ЗапросПоПодразделениям.УстановитьПараметр("Балансовое",Ложь);
		ЗапросПоПодразделениям.УстановитьПараметр("Родитель",ВыбПодразделение);
		СписокПодразделений = ЗапросПоПодразделениям.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
		ТекстОтбора = "Отбор: ";
		Для Индекс = 0 по СписокПодразделений.ВГраница() Цикл
			ТекстОтбора = ТекстОтбора + СокрЛП(СписокПодразделений[Индекс]) + ", ";
		КонецЦикла;
		
		ТекстОтбора = Сред(ТекстОтбора,1,СтрДлина(ТекстОтбора)-2)+".";
	Иначе
		ТекстОтбора = "Отбор: " + ?(пкФильтр = 0, "Все", ?(пкФильтр = 1, ВыбОрганизация, ?(пкФильтр = 2, ВыбПодразделение, ВыбРегистратор)))
	КонецЕсли;
	
	//для отчета по документу получим список подразделений, по которым документ сделал корректирующие проводки
	ВыводитьОтчетыПоПодразделениям = Ложь;
	Если пкФильтр = 3 Тогда
		Если ВедетсяБалансПоПодразделению Тогда
			СписокПодразделений = ПолучитьСписокПодразделений(ВыбРегистратор);
			Если СписокПодразделений.Количество() = 0 Тогда
				ВыводитьОтчетыПоПодразделениям = Ложь;
			Иначе
				ВыводитьОтчетыПоПодразделениям = Истина;
			КонецЕсли;
		Иначе
			ВыводитьОтчетыПоПодразделениям = Ложь;
		КонецЕсли;
	КонецЕсли;	
	
	//сформируем список подразделений, подставляемых в качестве фильтров для отчетов - расшифровок
	СписокФильтровПодразделение = Новый СписокЗначений;
	Если СписокПодразделений = Неопределено Тогда
		Если НЕ ВедетсяБалансПоПодразделению И пкФильтр=2 Тогда
			СписокФильтровПодразделение.Добавить(ВыбПодразделение);
		КонецЕсли;	
	Иначе
		СписокФильтровПодразделение.ЗагрузитьЗначения(СписокПодразделений);
	КонецЕсли;	
	
	// ПОСТРОИМ ЗАГОЛОВОК
	КоличествоГруппировок = пкДетализация + 1;
	
	Запрос = Новый Запрос(ПолучитьТекстЗапроса());
	
	//для заказ-наряда дату получим через метод документа (возможно и для других документов тоже)
	Попытка
		ДатаДокумента = ВыбРегистратор.ПолучитьОбъект().ПолучитьДатуДокумента();
		ДатаНачала = ДатаДокумента;
		ДатаКонца = ДатаДокумента;
	Исключение
	КонецПопытки;
	
	Запрос.УстановитьПараметр("ДатаНачала",     НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонца",      КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("ТоварКупленный", Перечисления.СтатусыПартий.ТоварКупленный);
	Запрос.УстановитьПараметр("ВидДвижения",    ВидДвиженияНакопления.Приход);
	СписокСпособовОплат = Новый Массив();
	СписокСпособовОплат.Добавить(Перечисления.ТипыОплатыВРознице.Безналичные);
	СписокСпособовОплат.Добавить(Перечисления.ТипыОплатыВРознице.Наличные);
	Запрос.УстановитьПараметр("СписокСпособовОплат", СписокСпособовОплат);
	Запрос.УстановитьПараметр("ДатаНачалаИсключая",Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаНачалаВключая",Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаКонцаИсключая",Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаКонцаВключая",Новый Граница(КонецДня(ДатаКонца), ВидГраницы.Включая));
	
	Если пкФильтр = 1 Тогда Запрос.УстановитьПараметр("ВыбОрганизация",   ВыбОрганизация);   КонецЕсли;
	Если пкФильтр = 2 Тогда
		Если ВедетсяБалансПоПодразделению Тогда
			Запрос.УстановитьПараметр("СписокПодразделений", СписокПодразделений); 
		Иначе
			Запрос.УстановитьПараметр("ВыбПодразделение", ВыбПодразделение); 
		КонецЕсли;
	КонецЕсли;
	Если пкФильтр = 3 Тогда 
		Запрос.УстановитьПараметр("ВыбДокумент", ВыбРегистратор); 
	КонецЕсли;
	
	ТекстЗаголовка = "Активы и пассивы " + Символы.ПС + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(ДатаКонца, "ДФ=dd.MM.yyyy");
	
	
	Если ВыводитьОтчетыПоПодразделениям Тогда
		//Выводим в цикле отчеты для выбранного документа по каждому подразделению
		ТабДокПустой =  Истина;
		Для Каждого БалПодразделение Из СписокПодразделений Цикл
			Запрос.УстановитьПараметр("ВыбПодразделение", БалПодразделение);
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой()  Тогда	
				ТекстОтбора = ?(ТабДокПустой,ТекстОтбора + Символы.ПС,"") + "Подразделение компании: "+СокрЛП(БалПодразделение); 
				ВывестиОтчет(ДокРезультат, РезультатЗапроса, ТекстОтбора ,ТекстЗаголовка);	
				ТекстЗаголовка = "";	
				ТабДокПустой = Ложь;
			КонецЕсли;
		КонецЦикла;		
	Иначе 
		//стандартный вывод отчета без разделения на подразделения
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда Возврат ДокРезультат; КонецЕсли;
		ВывестиОтчет(ДокРезультат, РезультатЗапроса, ТекстОтбора, ТекстЗаголовка)	
	КонецЕсли;
	
	Возврат ДокРезультат;
КонецФункции // СформироватьТабличныйДокумент()

// Формирует табличный документ отчета
//Параметры:
//	ДокРезультат - документ результат
//	РезультатЗапроса - результат запроса отчета
//	ТекстОтбора - содержит применяемые к запросу отборы
//	ТекстЗаголовка - текст заголовка отчета
//
Процедура ВывестиОтчет(ДокРезультат, РезультатЗапроса=Неопределено, ТекстОтбора, ТекстЗаголовка)
	 	ОбластьЗаголовка = МакетОтчета.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовка.Параметры.ЗаголовокОтчета = ТекстЗаголовка; 
		ОбластьОтбора = МакетОтчета.ПолучитьОбласть("Отбор");
		ОбластьОтбора.Параметры.Отбор = ТекстОтбора;
		
		ДокРезультат.Вывести(ОбластьЗаголовка);
		ДокРезультат.НачатьГруппуСтрок("Заголовок",Истина);
		ДокРезультат.Вывести(ОбластьОтбора);	
		ДокРезультат.ЗакончитьГруппуСтрок();
		
		ОбластьШапки = МакетОтчета.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьШапки.Параметры.Измерения = "Учетный блок" + ?(пкДетализация > 0, " / Тип объекта учета", "") + ?(пкДетализация > 1, " / Объект учета", "") + ?(пкДетализация > 2, " / Документ", "");
		ОбластьШапки.Область(1, 1, 2, 7).Шрифт      = ОформлениеШапки.Шрифт;
		ОбластьШапки.Область(1, 1, 2, 7).ЦветТекста = ОформлениеШапки.ЦветТекста;
		ОбластьШапки.Область(1, 1, 2, 7).ЦветФона   = ОформлениеШапки.ЦветФона;
		ДокРезультат.Вывести(ОбластьШапки);
		
		Если РезультатЗапроса <> Неопределено Тогда
			//вывод результатов	
			Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ДокРезультат.НачатьАвтогруппировкуСтрок();
			ВывестиГруппировки(ДокРезультат, Выборка);
			ДокРезультат.ЗакончитьАвтогруппировкуСтрок();
			
			// Выводим итоги
			ОбластьИтогов = МакетОтчета.ПолучитьОбласть("Подвал");
			Выборка.Сбросить(); Выборка.Следующий();
			ОбластьИтогов.Параметры.Заполнить(Выборка);
			ОбластьИтогов.Область(1, 1, 1, 7).Шрифт      = ОформлениеИтоги.Шрифт;
			ОбластьИтогов.Область(1, 1, 1, 7).ЦветТекста = ОформлениеИтоги.ЦветТекста;
			ОбластьИтогов.Область(1, 1, 1, 7).ЦветФона   = ОформлениеИтоги.ЦветФона;
			ДокРезультат.Вывести(ОбластьИтогов);
			
			// Рассчитываем ИТОГО Свернутое и выводим следом за итогами.
			ОбластьИтоговСв = МакетОтчета.ПолучитьОбласть("ПодвалСвернутое");
			ОбластьИтоговСв.Параметры.АктивНачОстСв  = ?(Выборка.АктивНачОст > Выборка.ПассивНачОст, Выборка.АктивНачОст - Выборка.ПассивНачОст, 0);
			ОбластьИтоговСв.Параметры.ПассивНачОстСв = ?(Выборка.ПассивНачОст > Выборка.АктивНачОст, Выборка.АктивНачОст - Выборка.ПассивНачОст, 0);
			Если Выборка.Приход=NULL Тогда ВыборкаПриход='00010101';
			Иначе ВыборкаПриход=Выборка.Приход;
			КонецЕсли; 
			Если Выборка.Расход=NULL Тогда ВыборкаРасход='00010101';
			Иначе ВыборкаРасход=Выборка.Расход;
			КонецЕсли; 
			ОбластьИтоговСв.Параметры.ПриходСв       = ?(ВыборкаПриход > ВыборкаРасход, ВыборкаПриход - ВыборкаРасход, 0);
			ОбластьИтоговСв.Параметры.РасходСв       = ?(ВыборкаРасход > ВыборкаПриход, ВыборкаПриход - ВыборкаРасход, 0);
			ОбластьИтоговСв.Параметры.АктивКонОстСв  = ?(Выборка.АктивКонОст > Выборка.ПассивКонОст, Выборка.АктивКонОст - Выборка.ПассивКонОст, 0);
			ОбластьИтоговСв.Параметры.ПассивКонОстСв = ?(Выборка.ПассивКонОст > Выборка.АктивКонОст, Выборка.АктивКонОст - Выборка.ПассивКонОст, 0);
			ДокРезультат.Вывести(ОбластьИтоговСв);
			
		КонецЕсли;
		// установим параметры документа результата
		ДокРезультат.ТолькоПросмотр = обПраво("ЗащитаПечатныхФорм", глПрава);
		//ДокРезультат.ФиксацияСлева  = 1;
		ДокРезультат.ФиксацияСверху = 4;
		///вывод результатов	
КонецПроцедуры

// Обработчик расшифровки полей табличного документа отчета
Функция ТабличныйДокументОбработкаРасшифровки(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт 
	
	СтандартнаяОбработка=Ложь;
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		//создаем отчет - расшифровку
		ТабДокРасш = Новый ТабличныйДокумент;
		СтруктураОтборов = Новый Структура;
		СтруктураИспользуемыхПоказателей = Новый Структура;
		
		ИмяФормыНастроекРасш           = "НастройкиОстаткиИОбороты";
		ИмяМакетаТекстЗапросаРасш      = "ТекстЗапросаОстаткиИОбороты";
		ИмяПоляПодразделение           = "Подразделение";
		ИмяПоляОрганизация             = "Организация";
		ИмяВариантаКомпоновки          = "ОстаткиИОбороты";
		УстановитьОтборПоСтатусуПартии = Ложь;
		
		Если Расшифровка.УчБлок = "Взаиморасчеты с контрагентами" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("НамСуммаУпр");
			СтруктураИспользуемыхПоказателей.Вставить("МыСуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета","Контрагент.ВидКонтрагента");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","Контрагент");
			
			ОтчетРасш = Отчеты.Взаиморасчеты.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Денежные средства" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","СтруктурнаяЕдиница");
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыДенежныхСредствКомпании.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Остатки товаров" Тогда
			
			УстановитьОтборПоСтатусуПартии = Истина;
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета","Номенклатура.ТипНоменклатуры");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","Номенклатура");
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыПартийТоваров.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Доходы и расходы" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("ДоходУпр");
			СтруктураИспользуемыхПоказателей.Вставить("РасходУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "СтатьяДоходовИРасходов.ВидДоходаИРасхода");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","СтатьяДоходовИРасходов");
			
			ИмяПоляПодразделение = "ПодразделениеКомпании";
			
			ОтчетРасш = Отчеты.ДоходыИРасходы.Создать();
			
			ИмяВариантаКомпоновки = "ДоходыИРасходы";
			
		ИначеЕсли Расшифровка.УчБлок = "Прочие активы в эксплуатации" Тогда	
			
			СтруктураИспользуемыхПоказателей.Вставить("ОстаточнаяСтоимостьУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета","ПрочийАктив.ВидПрочегоАктива");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","ПрочийАктив");
			
			ИмяПоляПодразделение = "ПодразделениеКомпании";
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыАктивов.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Денежные средства в кассах ККМ" Тогда	
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","КассаККМ");
			
			ОтчетРасш = Отчеты.ДенежныеСредстваВКассахККМ.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Остатки товаров отданных" Тогда	
			
			СтруктураИспользуемыхПоказателей.Вставить("СебестоимостьУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета","Номенклатура.ТипНоменклатуры");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета","Номенклатура");
				
			ОтчетРасш = Отчеты.ОстаткиИОборотыТоваровОтданных.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Реализованные товары" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Номенклатура.ТипНоменклатуры");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Номенклатура");
			
			ОтчетРасш = Отчеты.ТоварыИРасчётыСКомитентами.Создать();
			
			ИмяВариантаКомпоновки = "Основной";
			ИмяПоляОрганизация    = "ДоговорВзаиморасчетов.Организация";
			ИмяПоляПодразделение  = "ДоговорВзаиморасчетов.Подразделение";
			
		ИначеЕсли Расшифровка.УчБлок = "Товары в производстве" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Номенклатура.ТипНоменклатуры");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Номенклатура");
			
			УстановитьОтборПоСтатусуПартии = Истина;
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыТоваровВПроизводстве.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Остатки автомобилей" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Модель");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Автомобиль");
			
			УстановитьОтборПоСтатусуПартии = Истина;
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыАвтомобилей.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Комплектация автомобилей" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Модель");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Автомобиль");
			
			УстановитьОтборПоСтатусуПартии = Истина;
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыАвтомобилей.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Остатки автомобилей отданных" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СебестоимостьУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Модель");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Автомобиль");
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыАвтомобилейОтданных.Создать();
			
		ИначеЕсли Расшифровка.УчБлок = "Реализованные автомобили" Тогда
			
			СтруктураИспользуемыхПоказателей.Вставить("СуммаУпр");
			
			СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета", "Модель");
			СтруктураОтборов.Вставить("ИмяОтбораОбУчета",    "Автомобиль");
			
			ОтчетРасш = Отчеты.ОстаткиИОборотыРеализованныхАвтомобилей.Создать();
			
		КонецЕсли;
		
		Если (НЕ ИмяВариантаКомпоновки = Неопределено) Тогда
			
			ОтчетРасш.ЗаполнитьНачальныеНастройки();
			
			МетаданныеОтчета  = ОтчетРасш.Метаданные();
			ВариантОтчета     = ОтчетРасш.СхемаКомпоновкиДанных.ВариантыНастроек[ИмяВариантаКомпоновки];
			НастройкиВарианта = ВариантОтчета.Настройки;
			//ВариантОтчета     = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантОтчета(МетаданныеОтчета.ПолноеИмя(), ИмяВариантаКомпоновки);
			ОтчетРасш.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
			НастройкиВарианта = ОтчетРасш.КомпоновщикНастроек.Настройки;
			
			Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    ДатаНачала);
			КонецЕсли;
			
			Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаКонца));
			КонецЕсли;
			
			Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончанияГраница") = Неопределено Тогда
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончанияГраница", КонецДня(ДатаКонца));
			КонецЕсли;
			
			// ТоварыИРасчетыСКомитентами настраиваем отдельно,  т. к. ТЧ ИзмеренияСтроки в нем заполняется автоматически 
			//в зависимости от значений реквизитов 
			Если Расшифровка.УчБлок = "Реализованные товары" Тогда
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ПоТоварам",    0);
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ВидРазвертки", 0);
				НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ПоДокументам", 1);
			КонецЕсли;
			
			ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
			
			Отбор           = НастройкиВарианта.Отбор;
			СтруктураОтчета = НастройкиВарианта.Структура;
			Показатели      = НастройкиВарианта.Выбор;
			
			Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
				Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
					Счетчик = 0;
					Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
						Попытка
							ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, СокрЛП(ТекПоказатель.Поле)+".", "");
							Если СтруктураИспользуемыхПоказателей.Свойство(ИмяПоказателя) Тогда
								Счетчик = Счетчик + 1;
								ТекВложенныйПоказатель.Использование = Истина;
							Иначе
								ТекВложенныйПоказатель.Использование = Ложь;
							КонецЕсли;
						Исключение
							ТекВложенныйПоказатель.Использование = Ложь;
						КонецПопытки;
					КонецЦикла;
					ТекПоказатель.Использование = (Счетчик>0);
				ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
					Попытка
						ТекПоказатель.Использование = СтруктураИспользуемыхПоказателей.Свойство(СокрЛП(ТекПоказатель.Поле));
					Исключение
						ТекПоказатель.Использование = Ложь;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
			
			Отбор.Элементы.Очистить();
			
			Если Расшифровка.УчБлок = "Денежные средства" Тогда
				
				//если для расшифровки выбран тип объекта учета, то нужно получить списки касс, банков или ценных бумаг
				//чтобы затем передать их в качестве параметров отбора отчета "Денежные средства"
				СписокФильтровСтрЕдиница = Новый СписокЗначений;
				
				Если Расшифровка.Свойство("ТипОбУчета") И НЕ Расшифровка.Свойство("ОбУчета") Тогда 
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("СписокФильтровПодразделение", СписокФильтровПодразделение);
					Запрос.УстановитьПараметр("Организация",                 ВыбОрганизация);
					
					//формируем текст запроса для получения списка структурных единиц
					Если Расшифровка.ТипОбУчета = "Касса" Тогда
						СтрокаУсловия = ?(СписокФильтровПодразделение.Количество() > 0, " ГДЕ КассыКомпании.Подразделение В(&СписокФильтровПодразделение) ", "");
						Если ВыбОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда
							Если ПустаяСтрока(СтрокаУсловия) Тогда
								СтрокаУсловия = "ГДЕ КассыКомпании.Организация = &Организация"
							Иначе
								СтрокаУсловия = СтрокаУсловия + " И КассыКомпании.Организация = &Организация ";
							КонецЕсли;
						КонецЕсли;	
						Запрос.Текст = "ВЫБРАТЬ
						|	КассыКомпании.Ссылка КАК СтрЕд
						|ИЗ
						|	Справочник.КассыКомпании КАК КассыКомпании " + СтрокаУсловия;
						
					ИначеЕсли Расшифровка.ТипОбУчета = "Банк" Тогда	
						СтрокаУсловия = ?(СписокФильтровПодразделение.Количество() > 0, " ГДЕ БанковскиеСчета.Подразделение В(&СписокФильтровПодразделение) ", "");			   
						Запрос.Текст = "ВЫБРАТЬ
						|	БанковскиеСчета.Ссылка КАК СтрЕд
						|ИЗ
						|	Справочник.БанковскиеСчета КАК БанковскиеСчета " + СтрокаУсловия;
						
					ИначеЕсли Расшифровка.ТипОбУчета = "Ценные бумаги" Тогда	
						СтрокаУсловия = ?(СписокФильтровПодразделение.Количество() > 0, " ГДЕ ЦенныеБумаги.Подразделение В(&СписокФильтровПодразделение) ", "");
						Если ВыбОрганизация <> Справочники.Организации.ПустаяСсылка() Тогда
							Если ПустаяСтрока(СтрокаУсловия) Тогда
								СтрокаУсловия = "ГДЕ ЦенныеБумаги.Организация = &Организация"
							Иначе
								СтрокаУсловия = СтрокаУсловия + " И ЦенныеБумаги.Организация = &Организация ";
							КонецЕсли;
						КонецЕсли;
						Запрос.Текст = "ВЫБРАТЬ
						|	ЦенныеБумаги.Ссылка КАК СтрЕд
						|ИЗ
						|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги " + СтрокаУсловия; 
					КонецЕсли;
					
					//выполняем запрос и получаем список
					СписокФильтровСтрЕдиница.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СтрЕд"));
					
				ИначеЕсли Расшифровка.Свойство("ОбУчета") Тогда
					СписокФильтровСтрЕдиница.Добавить(Расшифровка["ОбУчета"]);
				КонецЕсли;
				
			КонецЕсли;
				
			//отбор по организации
			Если (ВыбОрганизация <> Справочники.Организации.ПустаяСсылка()) И (пкФильтр = 1) Тогда
				СтруктураОтборов.Вставить("ИмяОтбораОрганизация", ИмяПоляОрганизация);
				
				ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ТекОтбор.Использование  = Истина;
				ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоляОрганизация);
				ТекОтбор.ПравоеЗначение = ВыбОрганизация;
				ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
			
			//отбор по подразделению
			Если (СписокФильтровПодразделение.Количество() > 0) И (пкФильтр = 2) Тогда
				СтруктураОтборов.Вставить("ИмяОтбораПодразделение", ИмяПоляПодразделение);
				
				ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ТекОтбор.Использование  = Истина;
				ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоляПодразделение);
				Если ВедетсяБалансПоПодразделению Тогда
					ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
					ТекОтбор.ПравоеЗначение = СписокФильтровПодразделение;
				Иначе
					ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
					ТекОтбор.ПравоеЗначение = ВыбПодразделение;
				КонецЕсли;
			КонецЕсли;
			
			//отбор по объекту учета
			Если Расшифровка.Свойство("ОбУчета") Тогда
				ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ТекОтбор.Использование  = Истина;
				ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(СтруктураОтборов.ИмяОтбораОбУчета);
				ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекОтбор.ПравоеЗначение = Расшифровка.ОбУчета;
			КонецЕсли;
			
			//отбор по типу объекта учета
			Если (Расшифровка.Свойство("ТипОбУчета")) Тогда
				//для отчета "Денежные средства" устанавливаем параметры по Объекту учета списком
				Если Расшифровка.УчБлок = "Денежные средства" Тогда
					ПолеОтбора = Новый ПолеКомпоновкиДанных(СтруктураОтборов.ИмяОтбораОбУчета);
					ТекОтбор = Неопределено;
					Для Каждого ТекСтрока Из Отбор.Элементы Цикл
						Если ТекСтрока.Поле = ПолеОтбора Тогда
							ТекОтбор = ТекСтрока;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ТекОтбор = Неопределено Тогда
						ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтруктураОтборов.ИмяОтбораОбУчета);
					КонецЕсли;
					ТекОтбор.Использование  = Истина;
					ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
					ТекОтбор.ПравоеЗначение = СписокФильтровСтрЕдиница;
					//для остальных отчетов (кроме КассыККМ) устанавливаем параметр по типу объекта учета	
				ИначеЕсли Расшифровка.УчБлок <> "Денежные средства в кассах ККМ" Тогда
					ПолеОтбора = Новый ПолеКомпоновкиДанных(СтруктураОтборов.ИмяОтбораТипОбУчета);
					ДоступноеПолеОтбора = Отбор.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора);
					
					ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ТекОтбор.ЛевоеЗначение  = ПолеОтбора;
					ТекОтбор.Использование  = Истина;
					Если ЗначениеЗаполнено(Расшифровка.ТипОбУчета) Тогда
						ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
						ТекОтбор.ПравоеЗначение = ДоступноеПолеОтбора.ТипЗначения.ПривестиЗначение(Расшифровка.ТипОбУчета);
					Иначе
						ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// установим отбор по статусу партии если он уместен для отчета расшифровки
			Если УстановитьОтборПоСтатусуПартии Тогда
				ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтатусПартии");
				ТекОтбор.Использование  = Истина;
				ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
				ТекОтбор.ПравоеЗначение = Перечисления.СтатусыПартий.ТоварКупленный;
			КонецЕсли;
			//закончили заполнение отборов для отчета 
			
			СтруктураОтчета.Очистить();
			
			ГруппировкаРодитель = Неопределено;
			
			ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
			
			//добавляем измерения строки
			//по объекту учета
			НоваяГруппировка = ТаблицаОтчета.Строки.Добавить();
			НоваяГруппировка.Использование = Истина;
			
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Использование = Истина;
			ПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных(СтруктураОтборов["ИмяОтбораОбУчета"]);
			Если СтруктураОтборов.ИмяОтбораОбУчета = "Номенклатура" Тогда
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
			Иначе
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
			КонецЕсли;
			
			ГруппировкаРодитель = НоваяГруппировка.Структура;
			
			НовоеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НовоеПоле.Использование = Истина;
			
			НовоеПоле = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			НовоеПоле.Использование = Истина;
			
			//по документу движения
			Если НастройкиВарианта.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных("ПериодРегистратор"))<>Неопределено Тогда
				НоваяГруппировка = ГруппировкаРодитель.Добавить();
				НоваяГруппировка.Использование = Истина;
				
				ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Использование  = Истина;
				ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("ПериодРегистратор");
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
				
				ГруппировкаРодитель = НоваяГруппировка.Структура;
				
				НовоеПоле = НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
				НовоеПоле.Использование = Истина;
				
				НовоеПоле = НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
				НовоеПоле.Использование = Истина;
				
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Вариант",               НастройкиВарианта);
			СтруктураПараметров.Вставить("ЗаполнитьНастроки",     Ложь);
			СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
			СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
			СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
			СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
			
			ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
			
		Иначе
			ФормаНастроекРасш = ОтчетРасш.ПолучитьФормуНастроек(ИмяФормыНастроекРасш);
			ОтчетРасш.ЗаполнитьНачальныеНастройки(ИмяМакетаТекстЗапросаРасш,);
			ОтчетРасш.ДатаНачала = ДатаНачала;
			ОтчетРасш.ДатаКонца = ДатаКонца;
			ОтчетРасш.ВидОтчета = Перечисления.ВидыОтчетов.ОстаткиИОбороты;
			Для Каждого ТекПоказатель Из ОтчетРасш.Показатели Цикл
				ТекПоказатель.Использование = СтруктураИспользуемыхПоказателей.Свойство(ТекПоказатель.Имя);
			КонецЦикла;
			Отбор = ОтчетРасш.ПостроительОтчета.Отбор;
			ДеревоДоступныхПолей = ОтчетРасш.ДеревоДоступныхПолей;
			ИзмеренияСтроки = ОтчетРасш.ИзмеренияСтроки;
			//измерения по умолчанию нам не нужны, заполним по-своему
			ИзмеренияСтроки.Очистить();
			
			//начинаем заполнение отборов для отчета
			Если Расшифровка.УчБлок = "Взаиморасчеты с контрагентами" Тогда
				СтруктураОтборов.Вставить("ИмяОтбораТипОбУчета","Контрагент.ВидКонтрагента");
				СтруктураОтборов.Вставить("ИмяОтбораОбУчета","Контрагент");
			КонецЕсли;
			
			//отбор по организации
			Если (ВыбОрганизация <> Справочники.Организации.ПустаяСсылка()) И (пкФильтр = 1) Тогда
				СтруктураОтборов.Вставить("ИмяОтбораОрганизация",ИмяПоляОрганизация);
				ИмяОтбора = СтрЗаменить(ИмяПоляОрганизация,".","");
				ТекОтбор = Отбор.Найти(ИмяОтбора);
				Если ТекОтбор = Неопределено Тогда
					ТекОтбор = Отбор.Добавить(ИмяПоляОрганизация, ИмяОтбора, ДеревоДоступныхПолей.Строки.Найти(ИмяПоляОрганизация, "ПутьКДанным", Истина).ПолноеПредставление);
				КонецЕсли;
				ТекОтбор.Использование = Истина;
				ТекОтбор.Значение = ВыбОрганизация;
				ТекОтбор.ВидСравнения = ВидСравнения.Равно;
			КонецЕсли;	
			
			//отбор по подразделению
			Если (СписокФильтровПодразделение.Количество() > 0) И (пкФильтр = 2) Тогда
				СтруктураОтборов.Вставить("ИмяОтбораПодразделение",ИмяПоляПодразделение);
				ИмяОтбора = СтрЗаменить(ИмяПоляПодразделение,".","");
				ТекОтбор = Отбор.Найти(ИмяОтбора);
				Если ТекОтбор = Неопределено Тогда
					ТекОтбор = Отбор.Добавить(ИмяПоляПодразделение, ИмяОтбора, ДеревоДоступныхПолей.Строки.Найти(ИмяПоляПодразделение, "ПутьКДанным", Истина).ПолноеПредставление);
				КонецЕсли;
				ТекОтбор.Использование = Истина;
				Если ВедетсяБалансПоПодразделению Тогда
					ТекОтбор.ВидСравнения = ВидСравнения.ВСписке;
					ТекОтбор.Значение = СписокФильтровПодразделение;
				Иначе
					ТекОтбор.ВидСравнения = ВидСравнения.Равно;
					ТекОтбор.Значение = ВыбПодразделение;
				КонецЕсли;
			КонецЕсли;
			
			ПредставлениеТипОбУчета = "";
			ПредставлениеОбУчета	= "";
			Если СтруктураОтборов.Свойство("ИмяОтбораТипОбУчета") Тогда
				ПредставлениеТипОбУчета = ДеревоДоступныхПолей.Строки.Найти(СтруктураОтборов.ИмяОтбораТипОбУчета, "ПутьКДанным", Истина).ПолноеПредставление;
			КонецЕсли;
			Если СтруктураОтборов.Свойство("ИмяОтбораОбУчета") Тогда
				ПредставлениеОбУчета = ДеревоДоступныхПолей.Строки.Найти(СтруктураОтборов.ИмяОтбораОбУчета, "ПутьКДанным", Истина).ПолноеПредставление;
			КонецЕсли;
			
			//отбор по объекту учета
			Если Расшифровка.Свойство("ОбУчета") Тогда
				ИмяОтбора = СтрЗаменить(СтруктураОтборов.ИмяОтбораОбУчета,".","");
				ТекОтбор = Отбор.Найти(ИмяОтбора);
				Если ТекОтбор = Неопределено Тогда
					ТекОтбор = Отбор.Добавить(СтруктураОтборов.ИмяОтбораОбУчета, ИмяОтбора, ПредставлениеОбУчета);
				КонецЕсли;
				ТекОтбор.Использование = Истина;
				ТекОтбор.ВидСравнения = ВидСравнения.Равно;
				ТекОтбор.Значение = Расшифровка.ОбУчета;
			КонецЕсли;
			
			//закончили заполнение отборов для отчета 
			//добавляем измерения строки
			//по объекту учета
			НоваяГруппировка = ИзмеренияСтроки.Добавить();
			НоваяГруппировка.Использование = Истина;
			НоваяГруппировка.ПутьКДанным = СтруктураОтборов["ИмяОтбораОбУчета"];
			НоваяГруппировка.Представление = ПредставлениеОбУчета; 
			НоваяГруппировка.ТипИзмерения = "Элементы";
			
			//для Взаиморасчетов - по договору
			Если Расшифровка.УчБлок = "Взаиморасчеты с контрагентами" Тогда
				НоваяГруппировка = ИзмеренияСтроки.Добавить();
				НоваяГруппировка.Использование = Истина;
				НоваяГруппировка.ПутьКДанным = "ДоговорВзаиморасчетов";
				НоваяГруппировка.Представление = ДеревоДоступныхПолей.Строки.Найти("ДоговорВзаиморасчетов","ПутьКДанным").ПолноеПредставление;
				НоваяГруппировка.ТипИзмерения = "Элементы";
			КонецЕсли;
			
			//по документу движения
			Если ДеревоДоступныхПолей.Строки.Найти("ПериодРегистратор","ПутьКДанным")<>Неопределено Тогда
				НоваяГруппировка = ИзмеренияСтроки.Добавить();
				НоваяГруппировка.Использование = Истина;
				НоваяГруппировка.ПутьКДанным = "ПериодРегистратор";
				НоваяГруппировка.Представление = ДеревоДоступныхПолей.Строки.Найти("ПериодРегистратор","ПутьКДанным").ПолноеПредставление;
				НоваяГруппировка.ТипИзмерения = "Элементы";
			КонецЕсли;
			
			//выводим отчет - расшифровку
			ФормаОтчета = ПолучитьОбщуюФорму("Отчет",,ФормаНастроекРасш);
			ФормаОтчета.ОтчетОбъект = ОтчетРасш;
			ФормаОтчета.Открыть();
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ВключатьБалансовыеПодразделения = Истина;
ВыводитьОтчетыПоПодразделениям = Ложь;
ВедетсяБалансПоПодразделению = Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению;
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
#КонецЕсли