
// Определяет возможен ли ввод корректировки на основании данного документа основания.
//
// Параметры:
//	Основание - документ поступление автомобилей или корректировки поступления автомобилей.
//
Функция КорректировкаНеДоступна(Основание) Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИСТИНА КАК ЕстьВозврат
	|ИЗ
	|	Документ.ВозвратПоставщикуАвтомобилей КАК ТаблицаОбъекта
	|ГДЕ
	|	ТаблицаОбъекта.ДокументОснование = &Основание
	|	И ТаблицаОбъекта.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	Документ.ВозвратПоставщикуАвтомобилей.Автомобили КАК ТаблицаОбъекта
	|ГДЕ
	|	ТаблицаОбъекта.Партия = &Основание
	|	И ТаблицаОбъекта.Ссылка.Проведен
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Основание", Основание);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // КорректировкаНеДоступна()

// Получение данных о прослеживаемых товаров
//
// Параметры:
//  Объект	 - ДокументОбъект.КорректировкаПоступленияАвтомобилей - Документ, на основании которого произошла операция с товаром
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Список прослеживаемых товаров
//
Функция ОперацииСПрослеживаемымиТоварами(Объект) Экспорт
	
	// TODO: На данный момент сделано только для формирования отчета об операциях
	
	// Получим таблицу для формирования данных по операции
	ТаблицаОперацииПрослеживаемости = ПрослеживаемостьТоваровСервер.ИнициализацияТаблицыОпераций();
	
	ДанныеКонтрагента = Объект.Контрагент.СтранаРегистрации.УчастникЕАЭС;
	
	// Для контрагентов из ЕАЭС другая форма отчетности
	Если ДанныеКонтрагента Тогда
		Возврат ТаблицаОперацииПрослеживаемости;
	КонецЕсли;
	
	ОсвобождентОтНДС = Объект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Объект.Организация.ОсвобожденОтНДС;
	
	// Проверим есть ли ставка НДС в документе
	ТаблицаНДС = Объект.Автомобили.Выгрузить();
	ТаблицаНДС.Свернуть("СтавкаНДС");
	ЕстьНДС = НЕ (ТаблицаНДС.Количество() = 1 И ТаблицаНДС[0].СтавкаНДС = Справочники.СтавкиНДС.БезНДС);
	
	// Операцию об отчете не выводим если есть ставка НДС в документе и организация плательщик НДС
	Если ЕстьНДС И НЕ ОсвобождентОтНДС Тогда
		Возврат ТаблицаОперацииПрослеживаемости;
	КонецЕсли;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.КорректировкаПоступленияАвтомобилейИсправлениеВПервичныхДокументах Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ДокументыОтображенияОпераций.ОтчетОбОперациях) КАК ОтчетностьОперации,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДокументов.УПД) КАК ВидДокумента,
		|	ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПоступлениеТоваров) КАК КодОперации,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
		|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.Количество) КАК КоличествоПрослеживаемости,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.ГТД КАК РНПТ,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсего - КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДС) КАК СуммаБезНДС
		|ИЗ
		|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
		|ГДЕ
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
		|	И КорректировкаПоступленияАвтомобилейАвтомобили.ГТД.РНПТ
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.ГТД,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС";
		Документ = Объект.Сделка;
		Если ЗначениеЗаполнено(Объект.Сделка) Тогда
				ДанныеПоступления = Новый Структура("ВхДокНомер,ВхДокДата,Дата,Номер,Контрагент",
                	Объект.Сделка.ВхДокНомер,
					Объект.Сделка.ВхДокДата,
					Объект.Сделка.Дата,
					Объект.Сделка.Номер,
					Объект.Сделка.Контрагент
				);
			ПериодОтчета = НачалоКвартала(ДанныеПоступления.Дата);
			НомерДокумента = ДанныеПоступления.ВхДокНомер;
			ДатаДокумента = ДанныеПоступления.ВхДокДата;
			КонтрагентОперации = ДанныеПоступления.Контрагент;
		Иначе
			ПериодОтчета = НачалоКвартала(Объект.Дата);
			КонтрагентОперации = Объект.Контрагент;
		КонецЕсли;
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ДокументыОтображенияОпераций.ОтчетОбОперациях) КАК ОтчетностьОперации,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДокументов.УКД) КАК ВидДокумента,
		|	ВЫБОР
		|		КОГДА КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница > 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПолученнаяКорректировочнаяСчетФактураУвеличение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПолученнаяКорректировочнаяСчетФактураУменьшение)
		|	КОНЕЦ КАК КодОперации,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
		|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоРазница * ВЫБОР
		|			КОГДА КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоРазница < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоПрослеживаемости,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.ГТД КАК РНПТ,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница * ВЫБОР
		|			КОГДА КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ - КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСРазница * ВЫБОР
		|			КОГДА КорректировкаПоступленияАвтомобилейАвтомобили.СуммаНДСРазница < 0
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК СуммаБезНДС
		|ИЗ
		|	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
		|ГДЕ
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка = &Ссылка
		|	И КорректировкаПоступленияАвтомобилейАвтомобили.ГТД.РНПТ
		|	И КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА КорректировкаПоступленияАвтомобилейАвтомобили.СуммаВсегоРазница > 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПолученнаяКорректировочнаяСчетФактураУвеличение)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КодыОперацийПрослеживаемости.ПолученнаяКорректировочнаяСчетФактураУменьшение)
		|	КОНЕЦ,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.Автомобиль,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.ГТД,
		|	КорректировкаПоступленияАвтомобилейАвтомобили.СтавкаНДС";
		Документ = Объект.Ссылка;
		ПериодОтчета = НачалоКвартала(Объект.Дата);
		НомерДокумента = Объект.ВхДокНомер;
		ДатаДокумента = Объект.ВхДокДата;
		КонтрагентОперации = Объект.Контрагент;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	// Проверим, что в документе есть РНПТ
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТаблицаОперацииПрослеживаемости;
	КонецЕсли;
	
	ТаблицаРНПТ = Запрос.Выполнить().Выгрузить();
	
	// Зафиксируем данные для заполнения
	Организация = Объект.Организация;
	
	// Для пересчета валюты в рубли
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса = обКурсДляВалюты(ВалютаРегл, Объект.Дата);
	КурсРегл = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаДокумента = Объект.ВалютаДокумента;
	КурсДокумента = Объект.КурсДокумента;
	ВалютаНеРегл = (ВалютаДокумента <> ВалютаРегл);
	
	// Сформируем таблицу
	Для Каждого ТекущаяСтрока Из ТаблицаРНПТ Цикл
		
		НоваяСтрока = ТаблицаОперацииПрослеживаемости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.ПериодОтчета = ПериодОтчета;
		НоваяСтрока.Документ = Документ;
		НоваяСтрока.НомерДокумента = НомерДокумента;
		НоваяСтрока.ДатаДокумента = ДатаДокумента;
		НоваяСтрока.Контрагент = КонтрагентОперации;
		
		Если ВалютаНеРегл Тогда
			НоваяСтрока.СуммаБезНДС = Окр(
				обПересчет(НоваяСтрока.СуммаБезНДС, ВалютаДокумента,
					КурсДокумента, ВалютаРегл, КурсРегл), 2);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОперацииПрослеживаемости;
	
КонецФункции

// возвращает стоимость автомобиля
Функция ПолучитьСтоимостьАвтомобиля(Автомобиль, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"";
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПоступлениеАвтомобилей", "Приходная накладная");
	
	СтруктураМакетов.Вставить("УКД", "Универсальный корректировочный документ");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти