#Если Клиент Тогда
// функция проверки авторизации платежа
//
// Возвращаемое значение;
//	Булево -	Прохождение авторизации
//
Функция АвторизацияПлатежа()	Экспорт
	// выполним проверки
	Если Сумма<=0 Тогда Возврат Ложь; КонецЕсли;
	Если НЕ РучнаяАвторизация Тогда	
		// проверим авторизатор
		Если Авторизатор=Справочники.Оборудование.ПустаяСсылка() Тогда
			Предупреждение("Не выбран авторизатор",15);
			Возврат Ложь;
		КонецЕсли;
		Если Авторизатор.КлассОборудования<>Перечисления.КлассыОборудования.Авторизатор Тогда
			Предупреждение("Устройство выбранное в качестве авторизатора, таковым не является",15);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	//DORA Для изменения здесь надо еще проверить права пользователя на работу с кредитками
	Если РучнаяАвторизация Тогда	
		Режим=4;
	Иначе	 
		GUID_Оборудования=Авторизатор.ИдентификаторОборудования;	
				
		Параметры=глРарус_Компонента.СоздатьПараметры(5,1);
		Параметры.SetValue(0,0,"VISA");								//Тип карты
		Параметры.SetValue(1,0,СокрЛП(НомерКарты));						//НомерКарты
		Параметры.SetValue(2,0,?(ПлатежИлиВозврат=Истина,0,1));	//Тип чека
		Параметры.SetValue(3,0,Сумма);							//Сумма оплаты/возврата
		Параметры.SetValue(4,0,"");								//Дата окончания срока действия платежной карты в формате "ггмм"
		
		НомОшибки=глРарус_Компонента.ЗаказатьВыполнениеДействияСинхронно(GUID_Оборудования,"Авторизовать",Параметры,30);
		
		Сообщить(глРарус_Компонента.ОписаниеОшибки);
	КонецЕсли;
	Возврат Истина;	
КонецФункции // АвторизацияПлатежа()
#КонецЕсли