Функция СуммаОплатПоПредТО(ПредТО) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕстьNULL(ВзаиморасчетыКомпанииОбороты.СуммаРасход,0) КАК СуммаРасход
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			ДоговорВзаиморасчетов = &Договор
	                      |				И Контрагент = &Контрагент) КАК ВзаиморасчетыКомпанииОбороты
	                      |ГДЕ
	                      |	ВзаиморасчетыКомпанииОбороты.Регистратор.ДокументОснование = &ДокументОснование");	
	Запрос.УстановитьПараметр("Контрагент", ПредТО.Контрагент);
	Запрос.УстановитьПараметр("Договор", ПредТО.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("ДокументОснование", ПредТО);  
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("СуммаРасход");
КонецФункции	

Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()
