// Формирование значения примечания (дефекта) в виде строки
//
// Параметры
//  СтараяСтрока - <Строка> - Старый список дефектов
//  НоваяСтрока  - <Дефекты.Ссылка>,<Массив> - Массив дефектов, которые надо добавить
//
// Возвращаемое значение:
//   <Строка>   - Новый вид примечания (дефекта)
//
Функция СформироватьДефект(СтараяСтрока="",НоваяСтрока) Экспорт
	Если ТипЗнч(НоваяСтрока)=Тип("СправочникСсылка.Дефекты") Тогда
		Массив=Новый Массив;
		Массив.Добавить(НоваяСтрока);
	ИначеЕсли ТипЗнч(НоваяСтрока)=Тип("Массив") Тогда
		Массив=НоваяСтрока;
	Иначе
		Возврат СтараяСтрока;
	КонецЕсли;
	Если Массив.Количество()=0 Тогда
		Возврат СтараяСтрока;
	КонецЕсли; 
	НоваяСтрока=СокрЛП(СтараяСтрока);
	Для Сч=0 По Массив.Количество()-1 Цикл
		ЗначениеЭлемента=Массив[Сч];
		Если НоваяСтрока <> "" Тогда 
			НоваяСтрока=НоваяСтрока+Символы.ВК;
		КонецЕсли;
		НоваяСтрока=НоваяСтрока+СокрЛП(ЗначениеЭлемента.Наименование);
	КонецЦикла;
	Возврат НоваяСтрока;
КонецФункции // СформироватьПричинуОбращения()

// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	Отказ = Ложь;
	спПроверкаПраваДоступа(Справочники.Дефекты.СоздатьЭлемент(), Отказ);
	Если Отказ Тогда
		Возврат
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Дефекты.Ссылка,
	               |	Дефекты.Наименование КАК Наименование,
	               |	Дефекты.Родитель
	               |ИЗ
	               |	Справочник.Дефекты КАК Дефекты
	               |ГДЕ
	               |	Дефекты.ЭтоГруппа = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	ТаблицаГруппВСправочнике = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Дефекты.Ссылка,
	               |	Дефекты.Наименование КАК Наименование,
	               |	Дефекты.Родитель,
	               |	Дефекты.Код
	               |ИЗ
	               |	Справочник.Дефекты КАК Дефекты
	               |ГДЕ
	               |	Дефекты.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	ТаблицаЭлементовВСправочнике = Запрос.Выполнить().Выгрузить();
	
	#Если Клиент Тогда
	//Состояние("Загружаются дефекты узлов автомобилей из макета в справочник...");
	#КонецЕсли		
	
	Макет = Справочники.Дефекты.ПолучитьМакет("Дефекты");
	Попытка
		ОбластьТаблицаДефектов = Макет.ПолучитьОбласть("Список|ТаблицаДефектов");
					
		// получим таблицу из макета
		ТаблицаДефектов = Новый ТаблицаЗначений;
		ТаблицаДефектов.Колонки.Добавить("Родитель");
		ТаблицаДефектов.Колонки.Добавить("Наименование");
		
		ВысотаТаблицы = Макет.ПолучитьОбласть("Список").ВысотаТаблицы;
		
		Для НомерСтроки = 1 По ВысотаТаблицы  Цикл
			
			// проверим заполнение текущей строки макета
			НомерПоПорядку = ОбластьТаблицаДефектов.Область(НомерСтроки, 1).Текст;	
			Если ПустаяСтрока(НомерПоПорядку) Тогда
				Прервать;
			КонецЕсли;
			СтрокаТаблицыДефектов 					= ТаблицаДефектов.Добавить();
			СтрокаТаблицыДефектов.Родитель 			= ОбластьТаблицаДефектов.Область(НомерСтроки, 2).Текст;
			СтрокаТаблицыДефектов.Наименование	 	= ОбластьТаблицаДефектов.Область(НомерСтроки, 3).Текст;
			
		КонецЦикла; 
		
		Если ТаблицаДефектов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицыДефектов Из ТаблицаДефектов Цикл
			СтрокаТаблицыГруппВСправочнике = Справочники.Дефекты[СтрокаТаблицыДефектов.Родитель];
			
			Если СтрокаТаблицыГруппВСправочнике = Неопределено Тогда
				ТекущийРодитель = Справочники.Дефекты.СоздатьГруппу();
				ТекущийРодитель.УстановитьНовыйКод("");
				ТекущийРодитель.Наименование = СокрЛП(СтрокаТаблицыДефектов.Родитель);
				ТекущийРодитель.Записать();
								
				СтрокаТаблицыГруппВСправочнике = ТаблицаГруппВСправочнике.Добавить();
				СтрокаТаблицыГруппВСправочнике.Ссылка = ТекущийРодитель.Ссылка;
				СтрокаТаблицыГруппВСправочнике.Наименование = ТекущийРодитель.Наименование;
			КонецЕсли;
			
			ТекущийРодитель = СтрокаТаблицыГруппВСправочнике.Ссылка;
			
			СтрокаТаблицыДефектовВСправочнике = ТаблицаЭлементовВСправочнике.Найти(СокрЛП(СтрокаТаблицыДефектов.Наименование), "Наименование");
			
			Если СтрокаТаблицыДефектовВСправочнике = Неопределено Тогда
				ТекущийЭлемент = Справочники.Дефекты.СоздатьЭлемент();
				ТекущийЭлемент.УстановитьНовыйКод("");
			Иначе
				ТекущийЭлемент = СтрокаТаблицыДефектовВСправочнике.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
			ТекущийЭлемент.Родитель = ТекущийРодитель;
			ТекущийЭлемент.Наименование = СокрЛП(СтрокаТаблицыДефектов.Наименование);
			
			Попытка
				ТекущийЭлемент.Записать();
			Исключение
				#Если Клиент Тогда
				//Сообщить("Не удалось записать элемент """ + СокрЛП(СтрокаТаблицыДефектов.Наименование) +  """");
				#КонецЕсли		
			КонецПопытки;
			
		КонецЦикла;	
		
	Исключение
		#Если Клиент Тогда
		//Предупреждение("Не удалось загрузить макет!");
		#КонецЕсли		
	КонецПопытки;	
	#Если Клиент Тогда
	//Сообщить("Загружено объектов в справочник: " + СчОбъектов);
	#КонецЕсли		
КонецПроцедуры // ЗагрузитьТребованияИзМакета() Экспорт	
 