
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Автор = ПараметрыСеанса.Пользователь;
		Объект.Период = НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		
		Объект.ДатыЗапрета.Очистить();
		
		Для Сч=1 по 12 Цикл
			
			Нов = Объект.ДатыЗапрета.Добавить();
			Нов.ЗапретРедактированияРасчета="";
			Нов.ЗапретРедактированияКорректировок="";
			Нов.Месяц=ДобавитьМесяц(Объект.Период,Сч-1);
			
		КонецЦикла;

	КонецЕсли;	
	
	ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
		НачГод=Год(ТекущаяДата())-3;
		КонГод=Год(ТекущаяДата())+3;
	Иначе
		НачГод=Год(Объект.Период)-3;
		КонГод=Год(Объект.Период)+3;
	КонецЕсли;
	
	СпГодов=Новый СписокЗначений;
	Для Сч=НачГод по КонГод Цикл
		СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
	КонецЦикла;
	
	Эл=ВыбратьИзМеню(СпГодов,Элемент);
	
	Если Не ПустаяСтрока(Эл) Тогда
		ДатаПланирования=Эл.Значение;
		Объект.Период=Дата("01.01."+ДатаПланирования+" 00:00:00");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Направление>0 Тогда
		Объект.Период=ДобавитьМесяц(Объект.Период,12);
	Иначе
		Объект.Период=ДобавитьМесяц(Объект.Период,-12);
	КонецЕсли;
	
	ДатаПланирования=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьПустыми(Команда)
	
	Объект.ДатыЗапрета.Очистить();
	
	Для Сч=1 по 12 Цикл
		
		Нов = Объект.ДатыЗапрета.Добавить();
		Нов.ЗапретРедактированияРасчета="";
		Нов.ЗапретРедактированияКорректировок="";
		Нов.Месяц=ДобавитьМесяц(Объект.Период,Сч-1);
		Нов.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(Нов.Месяц);
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.ДатыЗапрета.Количество()=12 ТОгда
		Отказ=истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекСтр=Элементы.ДатыЗапрета.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		ТекСтр.Месяц=ДобавитьМесяц(Объект.Период,ТекСтр.НомерСтроки-1);
		ТекСтр.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(ТекСтр.Месяц);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатыЗапретаМесяцПриИзменении(Элемент)
	
	ТекСтр=Элементы.ДатыЗапрета.ТекущиеДанные;
	
	Если НЕ ТекСтр = Неопределено Тогда
		
		ТекСтр.Месяц=ДобавитьМесяц(Объект.Период,ТекСтр.НомерСтроки-1);
		ТекСтр.МесяцСтрока=Мотивация.ДатаКакМесяцПредставление(ТекСтр.Месяц);
		
	КонецЕсли;

КонецПроцедуры
