// Программное открытие формы записи регистра
Процедура ОткрытьФормуЗаписи(ОбъектСсылка,Идентификатор,ФормаВладелец=Неопределено,БлокироватьИзменениеИдентификатора=Истина) Экспорт
	ЗаписьРегистра=РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Объект=ОбъектСсылка;
	ЗаписьРегистра.Идентификатор=Идентификатор;
	ЗаписьРегистра.Прочитать();
	ФормаЗаписи=ЗаписьРегистра.ПолучитьФорму(,ФормаВладелец);
	Если БлокироватьИзменениеИдентификатора Тогда
		ФормаЗаписи.ЭлементыФормы.Идентификатор.Доступность=Ложь;
	КонецЕсли; 
	Если НЕ ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Объект=ОбъектСсылка;
	КонецЕсли;
	ФормаЗаписи.Открыть();
	Если НЕ ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Идентификатор=Идентификатор;
	КонецЕсли; 
КонецПроцедуры
