////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

// По указанной записи регистра формирует Баннер напоминания
Процедура ПоказатьБаннер(МенеджерЗаписи)	Экспорт
	Если глРарус_Компонента<>Неопределено Тогда
		Тема = обОбрезатьСтроку(Формат(МенеджерЗаписи.РеальнаяДатаОповещения,"ДФ='дд.ММ.гг ЧЧ:мм'")+" "+МенеджерЗаписи.Тема, 62, "…");
		ТелоСообщения = обОбрезатьСтроку(МенеджерЗаписи.Описание,88,"…") + " <BR>";                        
		ТелоСообщения = ТелоСообщения + "От: <a href='1Справочники.Пользователи.НайтиПоКоду("""+МенеджерЗаписи.Автор.Код+""")'>"+обОбрезатьСтроку(МенеджерЗаписи.Автор.Наименование,?(обЗначениеНеЗаполнено(МенеджерЗаписи.Объект),33,12),"…")+"</a> ";
		
		Если НЕ обЗначениеНеЗаполнено(МенеджерЗаписи.Объект) Тогда
			ТелоСообщения = ТелоСообщения + " Объект: <a href='2"+ЗначениеВСтрокуВнутр(МенеджерЗаписи.Объект)+"'>"+обОбрезатьСтроку(МенеджерЗаписи.Объект,12,"…")+"</a>";
		КонецЕсли;

		глРарус_Компонента.ПоказатьБаннер("Новое сообщение", Тема, ТелоСообщения, 3, 0, Ложь, "Баннер", Истина);
	КонецЕсли; 
КонецПроцедуры

#КонецЕсли
