
Функция ПолучитьКодПризнакаПредметаРасчета(ПризнакПредметаРасчета) Экспорт
	
	Если ЗначениеЗаполнено(ПризнакПредметаРасчета) Тогда
		ПризнакПредметаРасчетаИндекс = Перечисления.ПризнакиПредметаРасчета.Индекс(ПризнакПредметаРасчета);
		КодПризнакаПредметаРасчета = Метаданные.Перечисления.ПризнакиПредметаРасчета.ЗначенияПеречисления[ПризнакПредметаРасчетаИндекс].Комментарий;
		КодПризнакаПредметаРасчета = Число(КодПризнакаПредметаРасчета);
	Иначе
		КодПризнакаПредметаРасчета = 13;
	КонецЕсли;
	Возврат КодПризнакаПредметаРасчета;
	
	//Если ПризнакПредметаРасчета = Товар Тогда
	//	Возврат 1;
	//ИначеЕсли ПризнакПредметаРасчета = ПодакцизныйТовар Тогда
	//	Возврат 2;
	//ИначеЕсли ПризнакПредметаРасчета = Работа Тогда
	//	Возврат 3;
	//ИначеЕсли ПризнакПредметаРасчета = Услуга Тогда
	//	Возврат 4;
	//ИначеЕсли ПризнакПредметаРасчета = СтавкаАзартнойИгры Тогда
	//	Возврат 5;
	//ИначеЕсли ПризнакПредметаРасчета = ВыигрышАзартнойИгры Тогда
	//	Возврат 6;
	//ИначеЕсли ПризнакПредметаРасчета = ЛотерейныйБилет Тогда
	//	Возврат 7;
	//ИначеЕсли ПризнакПредметаРасчета = ВыигрышЛотереи Тогда
	//	Возврат 8;
	//ИначеЕсли ПризнакПредметаРасчета = ПредоставлениеРИД Тогда
	//	Возврат 9;
	//ИначеЕсли ПризнакПредметаРасчета = ПлатежВыплата Тогда
	//	Возврат 10;
	//ИначеЕсли ПризнакПредметаРасчета = АгентскоеВознаграждение Тогда
	//	Возврат 11;
	//ИначеЕсли ПризнакПредметаРасчета = Выплата Тогда
	//	Возврат 12;
	//ИначеЕсли ПризнакПредметаРасчета = ИнойПредметРасчета Тогда
	//	Возврат 13;
	//Иначе
	//	Возврат 13;
	//КонецЕсли;
		
КонецФункции