
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Если Не Элемент.ТекущиеДанные = Неопределено Тогда
		СписокПослеУдаленияНаСервере(Элемент.ТекущиеДанные.ВидЗаявки, Элемент.ТекущиеДанные.Роль, Элемент.ТекущиеДанные.Согласующий);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПослеУдаленияНаСервере(ВидЗаявки, Роль, Согласующий);
	
	РегистрыСведений.АдресатыЗаявок.БТ_УдалитьПрежниеЗаписи(ВидЗаявки, Роль, Согласующий);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры
