Функция НастройкаСкладовДляВыгрузкиАвто() Экспорт
	
	Возврат Справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000001");	
КонецФункции 

Функция НастройкаСкладовДляВыгрузкиАвтоСПробегом() Экспорт
	
	Возврат Справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000010");
	
КонецФункции


Функция ДатаВыгрузкиАвто() Экспорт                                                 
	
	Попытка
		Возврат Дата(Справочники.CRM_НастройкаПодключения.CRM_ДатаВыгрузкиАвто.Значение);
	Исключение	
	КонецПопытки;	
	
КонецФункции	                                                                   

Функция СкладыДляВыгрузкиАвто() Экспорт 
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение КАК Подразделение
	//                      |ИЗ
	//                      |	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	//                      |ГДЕ
	//                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка = &Ссылка");
	//Запрос.УстановитьПараметр("Ссылка", НастройкаСкладовДляВыгрузкиАвто());
	//
	//Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СкладыКомпании.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.СкладыКомпании КАК СкладыКомпании
	                      |ГДЕ
	                      |	НЕ СкладыКомпании.ПометкаУдаления
	                      |	И СкладыКомпании.тт_КатегорияСклада = &Категория");
	Запрос.УстановитьПараметр("Категория", Справочники.тт_КатегорияСклада.НайтиПоКоду("000000009"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ДобавитьАвтоВВыгрузку(Авто) Экспорт
	
	//Обр = Обработки.БТ_црмОтправитьАвтомобильСПробегом.Создать();
	//Обр.Автомобиль = авто;
	//обр.ЗаполнитьАвто();
	Наб = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
	Наб.Отбор.Автомобиль.Установить(Авто);
	Наб.Прочитать();
	Если Наб.Количество() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Запись = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	
	Если 1 = 2 Тогда
		Авто = Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;	
	
	Запись.Автомобиль = Авто;
	Запись.Марка1С = Авто.БТ_МаркаАвто;
	Запись.Модель1С = Авто.Модель;
	Запись.Комплектация1С = Авто.ВариантКомплектации;
	Запись.Цвет1С = Авто.Цвет;
	Запись.Салон1С = Авто.ТипСалона;
	Запись.НеВыгружать = Истина;   
	
	Реквизиты = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.ОбязательныеРеквизиты();
	Для Каждого Реквизит Из Реквизиты Цикл
		Если ЗначениеЗаполнено(Авто[Реквизит+"_црм"]) Тогда
			Запись[Реквизит] = Авто[Реквизит+"_црм"];
		КонецЕсли;	
	КонецЦикла;	
	Запись.Записать();
		
КонецПроцедуры 

Функция ТребуетсяВыгрузкаПоступления(Документ) Экспорт
	
	ДатаВыгрузки = ДатаВыгрузкиАвто();
	
	Если Не ЗначениеЗаполнено(ДатаВыгрузки) Или Документ.Дата < ДатаВыгрузки Тогда
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	МассивСкладов = СкладыДляВыгрузкиАвто();
	
	Возврат МассивСкладов.Найти(Документ.СкладКомпании) <> Неопределено;
	
КонецФункции

Функция МаркаДляВыгрузкиАвто(Марка) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Марка КАК Марка
	                      |ИЗ
	                      |	Справочник.CRM_НастройкиПодключенияПоСалонам.Марки КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	                      |ГДЕ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка = &Ссылка
						  |	И CRM_НастройкиПодключенияПоСалонамПодразделения.Марка = &Марка");
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаСкладовДляВыгрузкиАвтоСПробегом());
	Запрос.УстановитьПараметр("Марка", Марка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции	

Функция ВыгрузкаВЦРМ() Экспорт
	ДатаВыгрузки = ДатаВыгрузкиАвто();
	
	Возврат ЗначениеЗаполнено(ДатаВыгрузки) и ДатаВыгрузки < ТекущаяДатаСеанса();
КонецФункции	