Процедура ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.Свойство("АдресФайла") Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДополнительныеСвойства.АдресФайла);
		ЗаписьРегистра = РегистрыСведений.ns_ПрисоединенныеФайлы.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.ПрисоединенныйФайл = Ссылка;
		ЗаписьРегистра.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		ЗаписьРегистра.Записать();
	КонецЕсли; 
	
	НадоЗаписать = Ложь;
	Если НЕ ЗначениеЗаполнено(УИД) Тогда
		УИД = Ссылка.УникальныйИдентификатор();	
		НадоЗаписать = Истина;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(СсылкаДляИзображения) Тогда
		СсылкаДляИзображения = Справочники.ns_ПрисоединенныеФайлы.ПолучитьНавигационнуюСсылкуФайла(Ссылка);
		НадоЗаписать = Истина;
	КонецЕсли; 
	Если НадоЗаписать = Истина Тогда
		Записать();
	КонецЕсли; 
КонецПроцедуры

