
Перем ПодразделениеКомпании Экспорт; // Ссылка на подразделение компании
Перем ДокументОбъект Экспорт;        // Документ объект выполняющий движения
Перем РежимПроведения Экспорт;		 // Режим проведения документа оперативный/неоперативный

// Функция выполняет приход на регистр
Функция Приход() Экспорт 	
	Результат=Истина;
	
	// Получим документ, по которому будем делать записи в регистр
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	БюджетЗакупокАвтомобилейАвтомобили.Ссылка.ПодразделениеКомпании,
	|	БюджетЗакупокАвтомобилейАвтомобили.Ссылка.СценарийПланирования,
	|	БюджетЗакупокАвтомобилейАвтомобили.Ссылка.ХозОперация,
	|	БюджетЗакупокАвтомобилейАвтомобили.Модель,
	|	БюджетЗакупокАвтомобилейАвтомобили.ВариантКомплектации,
	|	БюджетЗакупокАвтомобилейАвтомобили.Количество,
	|	БюджетЗакупокАвтомобилейАвтомобили.СуммаВсегоУпр КАК СуммаУпр,
	|	БюджетЗакупокАвтомобилейАвтомобили.СуммаВсегоУпр * &Коэффициент КАК СуммаРег,
	|	БюджетЗакупокАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
	|	БюджетЗакупокАвтомобилейАвтомобили.Ссылка.ДатаПланирования КАК Период
	|ИЗ
	|	Документ.БюджетЗакупокАвтомобилей.Автомобили КАК БюджетЗакупокАвтомобилейАвтомобили
	|ГДЕ                                                                      
	|	БюджетЗакупокАвтомобилейАвтомобили.Ссылка = &Ссылка";
	
	// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета
	УпрВал = обКурсДляВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДокументОбъект.Дата);
	РегВал = обКурсДляВалюты(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), ДокументОбъект.Дата);  	
	Коэффициент = (УпрВал.Курс/УпрВал.Кратность) / (РегВал.Курс/РегВал.Кратность);
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект);	
	Запрос.УстановитьПараметр("Коэффициент",Коэффициент);	

	Загрузить(Запрос.Выполнить().Выгрузить());
		
	ДокументОбъект=Неопределено;	
	Возврат Результат;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()

ПоБазовомуКоличеству=Ложь;