
Процедура КнопкаВыполнитьНажатие(Кнопка)
	// Вставить содержимое обработчика.
КонецПроцедуры

//работа с кодировками
Функция ПереобразоватьЮникод(Строка) Экспорт
    
    ГотововаяСтрока = "" ;
    
    МасРус = Новый Массив(68) ;
	
	МасРус[0]  = "А";	МасРус[1]  = "Б";	МасРус[2]  = "В";	МасРус[3]  = "Г";	МасРус[4]  = "Д";	МасРус[5]  = "Е";	МасРус[6]  = "Ё";
	МасРус[7]  = "Ж";	МасРус[8]  = "З";	МасРус[9]  = "И";	МасРус[10] = "Й";	МасРус[11] = "К";	МасРус[12] = "Л";	МасРус[13] = "М";
	МасРус[14] = "Н";	МасРус[15] = "О";	МасРус[16] = "П";	МасРус[17] = "Р";	МасРус[18] = "С";	МасРус[19] = "Т";	МасРус[20] = "У";
	МасРус[21] = "Ф";	МасРус[22] = "Х";	МасРус[23] = "Ц";	МасРус[24] = "Ч";	МасРус[25] = "Ш";	МасРус[26] = "Щ";	МасРус[27] = "Ъ";
	МасРус[28] = "Ы";	МасРус[29] = "Ь";	МасРус[30] = "Э";	МасРус[31] = "Ю";	МасРус[32] = "Я";
	
	МасРус[33] = "а";	МасРус[34] = "б";	МасРус[35] = "в";	МасРус[36] = "г";	МасРус[37] = "д";	МасРус[38] = "е";	МасРус[39] = "ё";
	МасРус[40] = "ж";	МасРус[41] = "з";	МасРус[42] = "и";	МасРус[43] = "й";	МасРус[44] = "к";	МасРус[45] = "л";	МасРус[46] = "м";
	МасРус[47] = "н";	МасРус[48] = "о";	МасРус[49] = "п";	МасРус[50] = "р";	МасРус[51] = "с";	МасРус[52] = "т";	МасРус[53] = "у";
	МасРус[54] = "ф";	МасРус[55] = "х";	МасРус[56] = "ц";	МасРус[57] = "ч";	МасРус[58] = "ш";	МасРус[59] = "щ";	МасРус[60] = "ъ";
	МасРус[61] = "ы";	МасРус[62] = "ь";	МасРус[63] = "э";	МасРус[64] = "ю";	МасРус[65] = "я";
	МасРус[66] = "»";	МасРус[67] = "«";
	
	МасКод = Новый Массив(68) ;
    
    МасКод[0] ="0410";	МасКод[1] ="0411";	МасКод[2] ="0412";	МасКод[3] ="0413";	МасКод[4] ="0414";	МасКод[5] ="0415";	МасКод[6] ="0401";
    МасКод[7] ="0416";	МасКод[8] ="0417";	МасКод[9] ="0418";	МасКод[10]="0419";	МасКод[11]="041A";	МасКод[12]="041B";	МасКод[13]="041C";
	МасКод[14]="041D";	МасКод[15]="041E";	МасКод[16]="041F";	МасКод[17]="0420";	МасКод[18]="0421";	МасКод[19]="0422";	МасКод[20]="0423";
	МасКод[21]="0424";	МасКод[22]="0425";	МасКод[23]="0426";	МасКод[24]="0427"; 	МасКод[25]="0428";	МасКод[26]="0429";	МасКод[27]="042A";
	МасКод[28]="042B";	МасКод[29]="042C";	МасКод[30]="042D";	МасКод[31]="042E";	МасКод[32]="042F";  

    МасКод[33]="0430";	МасКод[34]="0431";	МасКод[35]="0432";	МасКод[36]="0433";	МасКод[37]="0434";	МасКод[38]="0435";	МасКод[39]="0451";
	МасКод[40]="0436";	МасКод[41]="0437";	МасКод[42]="0438";	МасКод[43]="0439";	МасКод[44]="043A";	МасКод[45]="043B";	МасКод[46]="043C";
	МасКод[47]="043D";	МасКод[48]="043E";	МасКод[49]="043F";	МасКод[50]="0440";	МасКод[51]="0441";	МасКод[52]="0442";	МасКод[53]="0443";
	МасКод[54]="0444";	МасКод[55]="0445";	МасКод[56]="0446";	МасКод[57]="0447"; 	МасКод[58]="0448";	МасКод[59]="0449";	МасКод[60]="044A";
	МасКод[61]="044B";	МасКод[62]="044C";	МасКод[63]="044D"; 	МасКод[64]="044E";	МасКод[65]="044F";
	МасКод[66]="00BB";  МасКод[67]="00aB";
	
	//МасУкр = Новый Массив(66) ;
	//МасУкр[0]="А";   МасУкр[1]="Б";  МасУкр[2]="В";  МасУкр[3]="Г";  МасУкр[4]="Ґ";  МасУкр[5]="Д";
	//МасУкр[6]="Е";   МасУкр[7]="Є";  МасУкр[8]="Ж";  МасУкр[9]="З";  МасУкр[10]="И"; МасУкр[11]="І";
	//МасУкр[12]="Ї";  МасУкр[13]="Й"; МасУкр[14]="К"; МасУкр[15]="Л"; МасУкр[16]="М"; МасУкр[17]="Н";
	//МасУкр[18]="О";  МасУкр[19]="П"; МасУкр[20]="Р"; МасУкр[21]="С"; МасУкр[22]="Т"; МасУкр[23]="У";
	//МасУкр[24]="Ф";  МасУкр[25]="Х"; МасУкр[26]="Ц"; МасУкр[27]="Ч"; МасУкр[28]="Ш"; МасУкр[29]="Щ";
	//МасУкр[30]="Ь";  МасУкр[31]="Ю"; МасУкр[32]="Я";  

	//МасУкр[33]="а";  МасУкр[34]="б"; МасУкр[35]="в"; МасУкр[36]="г"; МасУкр[37]="ґ"; МасУкр[38]="д";
	//МасУкр[39]="е";  МасУкр[40]="є"; МасУкр[41]="ж"; МасУкр[42]="з"; МасУкр[43]="и"; МасУкр[44]="і";
	//МасУкр[45]="ї";  МасУкр[46]="й"; МасУкр[47]="к"; МасУкр[48]="л"; МасУкр[49]="м"; МасУкр[50]="н";
	//МасУкр[51]="о";  МасУкр[52]="п"; МасУкр[53]="р"; МасУкр[54]="с"; МасУкр[55]="т"; МасУкр[56]="у";
	//МасУкр[57]="ф";  МасУкр[58]="х"; МасУкр[59]="ц"; МасУкр[60]="ч"; МасУкр[61]="ш"; МасУкр[62]="щ";
	//МасУкр[63]="ь";  МасУкр[31]="ю"; МасУкр[65]="я";  
    
	//МасКод = Новый Массив(66) ;
	//
	//МасКод[0]="0410";   МасКод[1]="0411";  МасКод[2]="0412";  МасКод[3]="0413";  МасКод[4]="0490";  МасКод[5]="0414";
	//МасКод[6]="0415";   МасКод[7]="0404";  МасКод[8]="0416";  МасКод[9]="0417";  МасКод[10]="0418"; МасКод[11]="0406";
	//МасКод[12]="0407";  МасКод[13]="0419"; МасКод[14]="041A"; МасКод[15]="041B"; МасКод[16]="041C"; МасКод[17]="041D";
	//МасКод[18]="041E";  МасКод[19]="041F"; МасКод[20]="0420"; МасКод[21]="0421"; МасКод[22]="0422"; МасКод[23]="0423";
	//МасКод[24]="0424";  МасКод[25]="0425"; МасКод[26]="0426"; МасКод[27]="0427"; МасКод[28]="0428"; МасКод[29]="0429";
	//МасКод[30]="042C";  МасКод[31]="042E"; МасКод[32]="042F";  

	//МасКод[33]="0430";  МасКод[34]="0431"; МасКод[35]="0432"; МасКод[36]="0413"; МасКод[37]="0491"; МасКод[38]="0434";
	//МасКод[39]="0435";  МасКод[40]="0454"; МасКод[41]="0436"; МасКод[42]="0437"; МасКод[43]="0438"; МасКод[44]="0456";
	//МасКод[45]="0457";  МасКод[46]="0439"; МасКод[47]="043A"; МасКод[48]="043B"; МасКод[49]="043C"; МасКод[50]="043D";
	//МасКод[51]="043E";  МасКод[52]="043F"; МасКод[53]="0440"; МасКод[54]="0441"; МасКод[55]="0442"; МасКод[56]="0443";
	//МасКод[57]="0444";  МасКод[58]="0445"; МасКод[59]="0446"; МасКод[60]="0447"; МасКод[61]="0448"; МасКод[62]="0449";
	//МасКод[63]="044C";  МасКод[31]="044E"; МасКод[65]="044F";  
    
    
    тмпСтрока = "" ;
    Для Счетчик = 1 По СтрДлина(Строка) Цикл      
        Если Лев(Строка, 1) = "\" Тогда
            Если Лев(Строка, 2) = "\u" Тогда
                
                тмпСтрока = Прав(Лев(Строка, 6),4) ;
                Если МасКод.Найти(тмпСтрока) = Неопределено Тогда
                    СтрокаЗамены = Прав(тмпСтрока, 1) ;
                    тмпСтрока = СтрЗаменить(тмпСтрока,СтрокаЗамены,ТРег(СтрокаЗамены)); 
                    Если МасКод.Найти(тмпСтрока) = Неопределено Тогда
                        //Сообщить("CRM_ Код символа не найден: " + тмпСтрока) ;
                    Иначе                      
                        ГотововаяСтрока = ГотововаяСтрока + МасРус[МасКод.Найти(тмпСтрока)] ;                                   
                    КонецЕсли;
                Иначе
                    ГотововаяСтрока = ГотововаяСтрока + МасРус[МасКод.Найти(тмпСтрока)] ;               
                КонецЕсли;
                
                Строка = Прав(Строка, (СтрДлина(Строка)-6)) ; 
            Иначе  
                Строка = Прав(Строка, (СтрДлина(Строка)-2)) ;
            КонецЕсли;
        Иначе
            ГотововаяСтрока = ГотововаяСтрока + Лев(Строка, 1) ;
            Строка = Прав(Строка, (СтрДлина(Строка)-1)) ;     
        КонецЕсли;         
    КонецЦикла;   

    Возврат ГотововаяСтрока;
        
КонецФункции

Функция КодироватьСтрокуВBase64(ИсходнаяСтрока) Экспорт
	
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
    ЗаписьТекста 	   = Новый ЗаписьТекста(ИмяВременногоФайла);
    ЗаписьТекста.Записать(ИсходнаяСтрока);
    ЗаписьТекста.Закрыть();
    Результат = Base64Строка(Новый ДвоичныеДанные(ИмяВременногоФайла));
    Попытка 
    	УдалитьФайлы(ИмяВременногоФайла) ;
	Исключение 
		Сообщить("CRM_ Ошибка обработки пароля в base64!",СтатусСообщения.Внимание);
	КонецПопытки;
	Результат = СтрЗаменить(Результат,"77u/","");
    Возврат Результат;

конецфункции

Функция ПолучитьСтруктуруПараметров() Экспорт
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	ПараметрыПодключения = Новый Структура("Хост,Ресурс,Логин,Пароль,Токен,ПоказыватьРезультатЗапроса,ОбрабатыватьРезультатПодключения,ссл,СтрокаДляОтправки");
	Возврат ПараметрыПодключения;
КонецФункции

Процедура ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения) Экспорт
	//CRM V2
	ПараметрыПодключения.Хост						  	  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_Хост.Значение);
	Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) Тогда
		ПараметрыПодключения.Логин							  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_Логин.Значение);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
		ПараметрыПодключения.Пароль						  	  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_Пароль.Значение);
	КонецЕсли;
	ПараметрыПодключения.ПоказыватьРезультатЗапроса		  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_ПоказыватьРезультатЗапроса.ДопЗначение);
	ПараметрыПодключения.ОбрабатыватьРезультатПодключения = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_ОбрабатыватьРезультат.ДопЗначение);
КонецПроцедуры

Процедура ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения) Экспорт
	//CRM V1
		ПараметрыПодключения.Хост						  	  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_V1_Хост.Значение);
		ПараметрыПодключения.Логин							  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_V1_Логин.Значение);
		ПараметрыПодключения.Пароль						  	  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_V1_Пароль.Значение);
		ПараметрыПодключения.ПоказыватьРезультатЗапроса		  = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_ПоказыватьРезультатЗапроса.ДопЗначение);
		ПараметрыПодключения.ОбрабатыватьРезультатПодключения = СокрЛП(Справочники.CRM_НастройкаПодключения.CRM_ОбрабатыватьРезультат.ДопЗначение);
КонецПроцедуры

Процедура ПолучитьЛогинПароль(ПараметрыПодключения, Организация = неопределено, Подразделение = неопределено, ВидРемонта = неопределено) Экспорт
	
	//Логин, Пароль по подразделению и виду ремонта
	Если НЕ Подразделение = неопределено и не Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка() Тогда
		УсловиеВидРемонта = "";
		
		ЗапросПоПодразделению = Новый запрос();
		ЗапросПоПодразделению.УстановитьПараметр("ПарПодразделение",Подразделение);
		Если НЕ ВидРемонта = неопределено и не ВидРемонта = Справочники.ВидыРемонта.ПустаяСсылка() Тогда
			ЗапросПоПодразделению.УстановитьПараметр("ПарВидРемонта", ВидРемонта);
			УсловиеВидРемонта = "И CRM_НастройкиПодключенияПоСалонамПодразделения.ВидРемонта = &ПарВидРемонта";
		КонецЕсли;
		ЗапросПоПодразделению.Текст = "ВЫБРАТЬ
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка,
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.НомерСтроки,
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение,
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.ВидРемонта,
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.Логин,
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.Пароль
		|ИЗ
		|	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
		|ГДЕ
		|	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение = &ПарПодразделение
		|	"+УсловиеВидРемонта+"
		|";
		
		РезультатПоПодразделению = ЗапросПоПодразделению.Выполнить().Выбрать();
		Если РезультатПоПодразделению.Следующий() Тогда
			ПараметрыПодключения.Логин = СокрЛП(РезультатПоПодразделению.Логин);
			ПараметрыПодключения.Пароль = СокрЛП(РезультатПоПодразделению.Пароль);
		КонецЕсли;
	КонецЕсли;
	
	Если Не Организация = неопределено Тогда
		
		//Логин, пароль по организации
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	CRM_НастройкаПодключения.Значение
		|ИЗ
		|	Справочник.CRM_НастройкаПодключения КАК CRM_НастройкаПодключения
		|ГДЕ
		|	CRM_НастройкаПодключения.Наименование ПОДОБНО ""%"" + &парНаименование + ""%""
		|	И CRM_НастройкаПодключения.Организация = &парОрганизация";
		
		Запрос.УстановитьПараметр("парОрганизация", Организация);
		
		Запрос.УстановитьПараметр("парНаименование", "Логин_V2");
		РезультатЛогин = Запрос.Выполнить().Выбрать();
		Если РезультатЛогин.Следующий() Тогда
			ПараметрыПодключения.Логин = СокрЛП(РезультатЛогин.Значение);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("парНаименование", "Пароль_V2");
		РезультатПароль = Запрос.Выполнить().Выбрать();
		Если РезультатПароль.Следующий() Тогда
			ПараметрыПодключения.Пароль = СокрЛП(РезультатПароль.Значение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Процедуры работы с httpСоединением
Процедура ОбработатьРезультатПодключения(Результат);
	
	// Анализируем фатальные ошибки
	// В большинстве случаев нужно остановить работу и показать пользователю сообщение об ошибке,
	// включив в него HTTP-статус
	
	// Ошибки 4XX говорят о неправильном запросе - в широком смысле
	// Может быть неправильный адрес, ошибка аутентификации, плохой формат запроса
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4
	Если Результат.КодСостояния >= 400 и Результат.КодСостояния < 500  Тогда
		Сообщить("CRM_ Код статуса больше 4XX, ошибка запроса.  Код статуса: " + Результат.КодСостояния);
	КонецЕсли;
	
	// Ошибки 5XX говорят о проблемах на сервере (возможно, прокси-сервер)
	// Это может быть программная ошибка, нехватка памяти, ошибка конфигурации и т.д.
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5
	Если Результат.КодСостояния >= 500 и Результат.КодСостояния < 600  Тогда
		Сообщить("CRM_ Код статуса больше 5XX, ошибка сервера. Код статуса: " + Результат.КодСостояния);
	КонецЕсли;
	
	// Обрабатываем перенаправление
	Если Результат.КодСостояния >= 300 и Результат.КодСостояния < 400  Тогда
		Сообщить("CRM_ Код статуса больше 3XX, Перенаправление. Код статуса: " + Результат.КодСостояния);
		Если Результат.КодСостояния = 302 Тогда
			Сообщить("CRM_ Код статуса 302, Постоянное перенаправление.");
			АдресРесурса = Результат.Заголовки.Получить("Location");
			Если АдресРесурса <> Неопределено Тогда
				Сообщить("CRM_ Выполняю запрос по новому адресу " + АдресРесурса);
				//ВыполнитьHTTPЗапрос(АдресРесурса);
			Иначе
				Сообщить("CRM_ Сервер не сообщил адрес ресурса!");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Статусы 1XX и 2XX считаем хорошими
	Если Результат.КодСостояния < 300 Тогда
		Сообщить("CRM_ запрос выполнен!");	
		//Сообщить("CRM_ Код статуса: " + Результат.КодСостояния);
		
	КонецЕсли; 

КонецПроцедуры

//GET
Функция ВыполнитьHTTPЗапросПолучить(ПараметрыПодключения,НомерСтраницы = 1, Проект="CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;
	
	СтрРесурс                           = ПараметрыПодключения.Ресурс;
	СтрХост   							= ПараметрыПодключения.Хост;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	НастройкаТокен 						= ПараметрыПодключения.Токен;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 --
	ssl1								= ПараметрыПодключения.ссл;	
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	РезультатТекст = "";
	
	Попытка
		ЗаголовокGET = Новый Соответствие();
		    		
		//Если Проект = "CRM_V2" Тогда
			ЗаголовокGET.Вставить("Host", СтрХост);
			// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
			Если ЗначениеЗаполнено(НастройкаТокен) Тогда
				ЗаголовокGET.Вставить("Authorization", "Bearer " + НастройкаТокен);
			Иначе
				ЗаголовокGET.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			КонецЕсли;
			// БИЗТЕХ КОВАЛЬ 04.09.2025 --
			ЗаголовокGET.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокGET.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокGET.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокGET.Вставить("GET " + СтрХост + " HTTP/1.1");
		//	ЗаголовокGET.Вставить("Host", СтрХост);
		//	ЗаголовокGET.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокGET.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокGET.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;
		
		
		HTTPЗапрос     = Новый HTTPЗапрос(СтрРесурс,ЗаголовокGET);
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		Результат      = HTTPСоединение.Получить(HTTPЗапрос,ФайлРезультата);
		
		ФайлТекст = Новый ТекстовыйДокумент();
		ФайлТекст.Прочитать(ФайлРезультата,КодировкаТекста.UTF8);
		РезультатТекст = ФайлТекст.ПолучитьТекст();
		РезультатТекст = ПереобразоватьЮникод(РезультатТекст);
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
	Исключение
		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
		Сообщить("_ Произошла сетевая ошибка!");
		//ВызватьИсключение;
	КонецПопытки;
	
	Если ОбрабатыватьРезультатПодключения Тогда
		ОбработатьРезультатПодключения(Результат);
	КонецЕсли;
	
	Возврат РезультатТекст;
	
КонецФункции
//POST
Функция ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	НастройкаТокен						= ПараметрыПодключения.Токен;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 --
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			
			// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			Если ЗначениеЗаполнено(НастройкаТокен) Тогда
				ЗаголовокHTTP.Вставить("Authorization", "Bearer " + НастройкаТокен);
			Иначе
				ЗаголовокHTTP.Вставить("Authorization", "Basic " + КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			КонецЕсли;
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
			// БИЗТЕХ КОВАЛЬ 04.09.2025 --
			
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		
		Результат = HTTPСоединение.ОтправитьДляОбработки(ИмяФайлаОтправки, СтрРесурс, ФайлРезультата, ЗаголовокHTTP);
				
			
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		РезультатТекст = Ответ.ПолучитьТекст();
		РезультатТекст = ПереобразоватьЮникод(РезультатТекст);
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
		УдалитьФайлы(ФайлОтправки);
		УдалитьФайлы(ФайлРезультата);
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат РезультатТекст;
 
КонецФункции
//<<Павличенко 10.03.2020 устарели
//Процедуры работы с WinHTTP
//GET
//Функция ПослатьGETЗапрос(ПараметрыПодключения, НомерСтраницы = 1, Проект="CRM_V2") Экспорт
//	
//	Если Проект = "CRM_V2" Тогда
//		ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
//	иначе
//		ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
//	КонецЕсли;
//	
//	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
//	СтрХост   							= ПараметрыПодключения.Хост;
//	СтрРесурс 							= ПараметрыПодключения.Ресурс+"?page="+НомерСтраницы;
//	НастройкаЛогин  					= ПараметрыПодключения.Логин;
//	НастройкаПароль 					= ПараметрыПодключения.Пароль;
//	
//	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
//	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
//	
//	СтрУрл = "http://"+СтрХост+""+СтрРесурс;
//	
//	
//	HTTP = новый COMОбъект("WinHttp.WinHttpRequest.5.1");
//	HTTP.Option(4, 13056);
//	HTTP.Option(6, Истина);
//	HTTP.Option(12, Истина);
//	//HTTP.SetProxy(2, "tmg.corp.intra:8080", "");
//	
//	HTTP.Open("GET",СтрУрл,0);
//	
//	//Если Проект = "CRM_V2" Тогда
//		HTTP.SetRequestHeader("Authorization", "Basic " + КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
//		HTTP.SetRequestHeader("Accept", "application/json; charset=utf-8");
//		HTTP.SetRequestHeader("X-AUTOCRM-API", "1");
//		HTTP.SetRequestHeader("Content-Type", "charset=utf-8");
//	//Иначе
//	//	HTTP.SetRequestHeader("GET " + СтрХост + " HTTP/1.1");
//	//	HTTP.SetRequestHeader("Host", СтрХост);
//	//	HTTP.SetRequestHeader("X-User", НастройкаЛогин);
//	//	HTTP.SetRequestHeader("X-API-Key", НастройкаПароль);
//	//	HTTP.SetRequestHeader("Accept", "application/json; charset=utf-8");
//	//КонецЕсли;
//	
//	РезультатТекст = "";
//	
//	Попытка        
//		HTTP.Send();
//		РезультатТекст = HTTP.ResponseText;
//		
//		Если ПоказыватьРезультатЗапроса Тогда
//			Сообщить(РезультатТекст);
//		КонецЕсли;
//		
//	Исключение
//		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
//		// исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
//		Сообщить("_ Произошла сетевая ошибка!");
//	КонецПопытки;
//	
//	Возврат РезультатТекст;
//КонецФункции
//POST
//Функция ПослатьPOSTЗапрос(ПараметрыПодключения,Объект = неопределено, Проект="CRM_V2") Экспорт
//	
//	Если Проект = "CRM_V2" Тогда
//		ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
//	иначе
//		ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
//	КонецЕсли;
//	
//	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
//	СтрХост   							= ПараметрыПодключения.Хост;
//	СтрРесурс 							= ПараметрыПодключения.Ресурс;
//	НастройкаЛогин  					= ПараметрыПодключения.Логин;
//	НастройкаПароль 					= ПараметрыПодключения.Пароль;
//	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
//	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
//	
//	РезультатТекст = "";
//	
//	СтрУрл = "http://"+СтрХост+""+СтрРесурс;
//	
//	HTTP = новый COMОбъект("WinHttp.WinHttpRequest.5.1");
//	HTTP.Option(4, 13056);
//	HTTP.Option(6, Истина);
//	HTTP.Option(12, Истина);
//	
//	
//	HTTP.Open("POST",СтрУрл,False);
//	//Если Проект = "CRM_V2" Тогда
//		HTTP.SetRequestHeader("Authorization", "Basic " + КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
//		HTTP.SetRequestHeader("Accept", "application/json; charset=utf-8");
//		HTTP.SetRequestHeader("X-AUTOCRM-API", "1");
//		HTTP.SetRequestHeader("Content-Type", "charset=utf-8");
//	//Иначе
//	//	HTTP.SetRequestHeader("Host", СтрХост);
//	//	HTTP.SetRequestHeader("X-User", НастройкаЛогин);
//	//	HTTP.SetRequestHeader("X-API-Key", НастройкаПароль);
//	//	HTTP.SetRequestHeader("Accept", "application/json; charset=utf-8");
//	//КонецЕсли;
//	
//	
//	Попытка
//		HTTP.Send(СтрокаДляОтправки);
//		РезультатТекст = HTTP.ResponseText;
//		
//		Если ПоказыватьРезультатЗапроса Тогда
//			Сообщить(РезультатТекст);
//		КонецЕсли;
//	Исключение
//		
//	КонецПопытки;
//	
//	Возврат РезультатТекст;
//КонецФункции


//Процедуры работы с регистрами
Процедура ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, Знач ИмяРегистра) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	// записываем набор записей
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, ИмяРегистра) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];

	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();

	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл

		Если СтруктураЗаписи.Свойство(Измерение.Имя) Тогда
			НаборЗаписей.Отбор[Измерение.Имя].Установить(СтруктураЗаписи[Измерение.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НаборЗаписей;
КонецФункции

//функции для работы с json
Функция ПреобразоватьвСистему(Число10,система) Экспорт
 
    Если система > 36 или система < 2 тогда
        Сообщить("CRM_ Выбранная система исчисления не поддерживается");
        Возврат -1;
    КонецЕсли;
 
    СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
    СтрокаСистема = "";
    Пока Число10 > 0 цикл
        РезДеления = Число10/система;
        ЧислоСистема = цел(РезДеления);
        остатокОтДеления = Число10 - система*(ЧислоСистема);
        СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
        Число10 = ?(ЧислоСистема=0,0,РезДеления); 
    КонецЦикла;
 
    Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
    Если Нечётное тогда
        СтрокаСистема = "0"+СтрокаСистема;
    КонецЕсли;
 
    Возврат СтрокаСистема;
 
КонецФункции
 
Функция URLEncode(стр) Экспорт  
 
    Длина=СтрДлина(Стр);
    Итог="";
    Для Н=1 По Длина Цикл
        Знак=Сред(Стр,Н,1);
        Код=КодСимвола(Знак);
 
        если ((Знак>="a")и(Знак<="z")) или
             ((Знак>="A")и(Знак<="Z")) или
             ((Знак>="0")и(Знак<="9")) тогда
            Итог=Итог+Знак;
        Иначе
            Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
                Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
            ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
                Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
            ИначеЕсли (Знак="ё") Тогда
                Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
            ИначеЕсли (Знак="Ё") Тогда
                Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
            Иначе
                Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
    Возврат Итог;
 
КонецФункции


Функция СформироватьСтрокуJSONИзМассива(Объект)
 
    СтрокаJSON = "[";
 
    Для каждого Элемент Из Объект Цикл
 
        Если ТипЗнч(Элемент) = Тип("Строка") Тогда
            СтрокаJSON = СтрокаJSON + """" + Элемент + """";
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
            СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент), Символы.НПП, "");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
            СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
            // преобразование в unixtime
            СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
 
        Иначе
            СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
 
        КонецЕсли;
 
        СтрокаJSON = СтрокаJSON + ",";
    КонецЦикла;
 
    Если Прав(СтрокаJSON, 1) = "," Тогда
        СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
    КонецЕсли;
 
    Возврат СтрокаJSON + "]";
 
КонецФункции
 
Функция СформироватьСтрокуJSONИзСтруктуры(Объект) Экспорт
 
    СтрокаJSON = "{";
 
    Для каждого Элемент Из Объект Цикл
 
        Если Элемент.Значение = "" Тогда
            Продолжить;
        КонецЕсли;
 
        СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + """" + ":";
 
        Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
            СтрокаJSON = СтрокаJSON + """" + Элемент.Значение + """";
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
            СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, "");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
            СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
            // преобразование в unixtime
            СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
 
        Иначе
            СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
 
        КонецЕсли;
 
        СтрокаJSON = СтрокаJSON + ",";
 
    КонецЦикла;
 
    Если Прав(СтрокаJSON, 1) = "," Тогда
        СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
    КонецЕсли;
 
    Возврат СтрокаJSON + "}";
 
КонецФункции
 
Функция СформироватьСтрокуJSON(Объект) Экспорт
 
    СтрокаJSON = "";
 
    Если ТипЗнч(Объект) = Тип("Массив") Тогда
        СтрокаJSON = СформироватьСтрокуJSONИзМассива(Объект);
 
    ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
        СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Объект);
 
    ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
        // преобразуем таблицу значений в массив структур - работает дольше, но кода меньше
        // если нужна скорость, то нужно отдельно обработать таблицу значений
 
        СоставСтруктуры = "";
        Для каждого Колонка Из Объект.Колонки Цикл
            СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
        КонецЦикла;
 
        МассивСтрок = Новый Массив;
        Для каждого Строка Из Объект Цикл
            СтруктураКолонок = Новый Структура(СоставСтруктуры);
            ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
            МассивСтрок.Добавить(СтруктураКолонок);
        КонецЦикла;
 
        СтрокаJSON = СформироватьСтрокуJSONИзМассива(МассивСтрок);
 
    КонецЕсли;
 
    Возврат СтрокаJSON;
 
КонецФункции


Функция СформироватьСтрокуЭкранJSONИзМассива(Объект) Экспорт
 
    СтрокаJSON = "[";
	//СтрокаJSON = "";
 
    Для каждого Элемент Из Объект Цикл
 
        Если ТипЗнч(Элемент) = Тип("Строка") Тогда
            //СтрокаJSON = СтрокаJSON + """" + Элемент + """";
			СтрокаJSON = СтрокаJSON + "" + Элемент + "";
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
            СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент), Символы.НПП, "");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
            СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
            // преобразование в unixtime
            СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент);
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент);
 
        ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент);
 
        Иначе
            //СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
			СтрокаJSON = СтрокаJSON + "" + URLEncode(Строка(Элемент)) + "";
 
        КонецЕсли;
 
        СтрокаJSON = СтрокаJSON + ",";
		// СтрокаJSON = СтрокаJSON + ",\";
	  КонецЦикла;
 
    Если Прав(СтрокаJSON,2) = ",\" Тогда
        СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-2);
    КонецЕсли;
 
    Возврат СтрокаJSON + "]";
	//Возврат СтрокаJSON + "";
 
КонецФункции

Функция СформироватьСтрокуЭкранJSONИзСтруктуры(Объект) Экспорт
 
   //СтрокаJSON = "{";
   СтрокаJSON = "{\";
 
    Для каждого Элемент Из Объект Цикл
 
		//Если Элемент.Значение = "" Тогда
		//    Продолжить;
		//КонецЕсли;
		Если ТипЗнч(Элемент.Значение) = Тип("Число") или ТипЗнч(Элемент.Значение) = Тип("Массив") 
			 или ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений")  или ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + "\""" + ":";
		//иначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			
		иначе
			СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + "\""" + ":\";
		КонецЕсли;
		//СтрокаJSON = СтрокаJSON + "\""" + Элемент.Ключ + "\""" + ":";
 
        Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
            СтрокаJSON = СтрокаJSON + """" + Элемент.Значение + "\""";
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
            СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, "");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
            СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
            // преобразование в unixtime
            СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент.Значение);
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент.Значение);
 
        ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
           // СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
            СтрокаJSON = СтрокаJSON + СформироватьСтрокуЭкранJSON(Элемент.Значение);
        Иначе
            СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
 
        КонецЕсли;
 
        //СтрокаJSON = СтрокаJSON + ",";
		СтрокаJSON = СтрокаJSON + ",\";
 
    КонецЦикла;
 
    Если Прав(СтрокаJSON, 2) = ",\" Тогда
        СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-2);
    КонецЕсли;
 
    Возврат СтрокаJSON + "}";

КонецФункции

Функция СформироватьСтрокуЭкранJSON(Объект) Экспорт
 
    СтрокаJSON = "";
 
    Если ТипЗнч(Объект) = Тип("Массив") Тогда
        СтрокаJSON = СформироватьСтрокуЭкранJSONИзМассива(Объект);
 
    ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
        СтрокаJSON = СформироватьСтрокуЭкранJSONИзСтруктуры(Объект);
		
 
    ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
        // преобразуем таблицу значений в массив структур - работает дольше, но кода меньше
        // если нужна скорость, то нужно отдельно обработать таблицу значений
 
        СоставСтруктуры = "";
        Для каждого Колонка Из Объект.Колонки Цикл
            СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
        КонецЦикла;
 
        МассивСтрок = Новый Массив;
        Для каждого Строка Из Объект Цикл
            СтруктураКолонок = Новый Структура(СоставСтруктуры);
            ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
            МассивСтрок.Добавить(СтруктураКолонок);
        КонецЦикла;
 
       СтрокаJSON =СформироватьСтрокуЭкранJSONИзМассива(МассивСтрок);
	ИначеЕсли ТипЗнч(Объект) = Тип("СписокЗначений") Тогда
		
    КонецЕсли;
 
    Возврат СтрокаJSON;
 
КонецФункции

//  СЕРИАЛИЗАТОР добавить
// ─────────────────────────────────────────────────────────────────────────────
//  НАСТРОЙКИ

// Функция управляющая настройкой "АвтоматическоеПриведениеОбъектаКСтруктуре".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется автоматическое приведение объекта к структуре; 
//		- Ложь - автоматическое приведение объекта к структуре не выполняется, все объекты преобразуются в соответствие. 
//
// Примечание:
//  Автоматическое приведение к структуре выполняется только для объектов имена свойств которых могут быть 
//  использованы как ключи структуры, все остальные объекты преобразуются в соответствие.
//
Функция НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()
	
	Возврат Ложь;	// Измените для использования автоматического приведения объекта к структуре.
	
КонецФункции // НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()

// Функция управляющая настройкой "ПолноеМаскированиеСимволов".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется полное маскирование символов некорректно обрабатываемых JavaScript-ом; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаПолноеМаскированиеСимволов()
	
	Возврат Истина;	// Измените для неполного маскирования символов.
	
КонецФункции // НастройкаПолноеМаскированиеСимволов()

// Функция управляющая настройкой "МаскированиеКириллицы".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется маскирование кириллических символов; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаМаскированиеКириллицы()
	
	Возврат Ложь;	// Измените для маскирования кириллических символов.
	
КонецФункции // НастройкаМаскированиеКириллицы()

// Функция управляющая настройкой "НеявноеПриведениеПримитивныхЗначенийКлюча".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется неявное приведение примитивных типов значений ключей соответствий к их строковому представлению в формате 1С; 
//		- Ложь - неявное приведение примитивных типов значений ключей соответствий к строковому представлению не выполняется. 
//
// Примечание:
//	Неявно приводимые типы: Null, Булево, Число, Дата, Строка, УникальныйИдентификатор.
//
Функция НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()
	
	Возврат Ложь;	// Измените для использования неявного приведения примитивных значений ключей соответствий к строке.
	
КонецФункции // НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()

Функция jsonЗаписатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок) Экспорт 
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); КонецЕсли; 
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); КонецЕсли; 
	
	ВспомогательныеДанные = Новый Структура("ПримитивныеТипы,Массивы,Структуры,Соответсвия,Построители,КлиентскиеТипы,ТипДопустимыхКлючей", 
		Новый ОписаниеТипов("Null,Булево,Число,Дата,УникальныйИдентификатор"),									// ПримитивныеТипы.
		#Если ВебКлиент Или ТонкийКлиент Тогда
			Новый ОписаниеТипов("Массив,ФиксированныйМассив"),													// Массивы.
			Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура"),											// Структуры.
			Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие"),		// Соответсвия.
		#Иначе
			#Если НаСервере Тогда
				Новый ОписаниеТипов("Массив,ФиксированныйМассив,ФиксированнаяКоллекция"),						// Массивы.
				Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура"),										// Структуры.
				Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие"),	// Соответсвия.
			#Иначе
				Новый ОписаниеТипов("Массив,ФиксированныйМассив"),												// Массивы.
				Новый ОписаниеТипов("Структура"),																// Структуры.
				Новый ОписаниеТипов("Структура,Соответствие"),													// Соответсвия.
			#КонецЕсли
		#КонецЕсли
		#Если ВебКлиент Или ТонкийКлиент Тогда
			Неопределено,																						// Построители.
		#Иначе
			Новый ОписаниеТипов("ПостроительЗапроса,ПостроительОтчета"),										// Построители.
		#КонецЕсли
		#Если НаСервере Тогда
			Новый ОписаниеТипов("ДанныеФормыКоллекция,ДанныеФормыСтруктураСКоллекцией,ДанныеФормыДерево"),		// КлиентскиеТипы.
		#Иначе
			Неопределено,																						// КлиентскиеТипы.
		#КонецЕсли
		Новый ОписаниеТипов("Строка"));																			// ТипДопустимыхКлючей.
		
	// Типы допустимых ключей.
	Если (НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча() = Истина) Тогда ВспомогательныеДанные.ТипДопустимыхКлючей = Новый ОписаниеТипов("Null,Булево,Число,Дата,Строка,УникальныйИдентификатор"); КонецЕсли;
		
	// форматирование.
	Если Стандарт Тогда Смещение = ""; Отступ = " "; Табуляция = "    "; ПереносСтроки = Символы.ПС; Иначе Смещение = ""; Отступ = ""; Табуляция = ""; ПереносСтроки = ""; КонецЕсли;
	
	// Сериализация.
	Возврат jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, (НастройкаПолноеМаскированиеСимволов() = Истина), (НастройкаМаскированиеКириллицы() = Истина));
	
КонецФункции // jsonЗаписатьИнициализация()

Функция jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы) Экспорт
	
	// Определение типа.
	Тип = ТипЗнч(Значение);
		
	// Строка.
	Если (Тип = Тип("Строка")) Тогда Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Неопределено и примитивные типы.
	Если ВспомогательныеДанные.ПримитивныеТипы.СодержитТип(Тип) Тогда 
		#Если ВебКлиент Или ТонкийКлиент Тогда
		Если (Значение = Null) Или (Значение = Неопределено) Тогда Возврат "null"; ИначеЕсли (Тип = Тип("Дата")) Тогда Возврат """" + Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss; ДП=") + "Z""" ИначеЕсли (Тип = Тип("УникальныйИдентификатор")) Тогда Возврат """" + Значение + """"; Иначе Возврат Формат(Значение, "ЧРД=.; ЧН=; ЧГ=; БЛ=false; БИ=true"); КонецЕсли;
		#Иначе
		Если (Значение = Null) Или (Значение = Неопределено) Тогда Возврат "null"; ИначеЕсли (Тип = Тип("Дата")) Тогда Возврат """" + XMLСтрока(Значение) + "Z""" ИначеЕсли (Тип = Тип("УникальныйИдентификатор")) Тогда Возврат """" + XMLСтрока(Значение) + """"; Иначе Возврат XMLСтрока(Значение); КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	
	// Структуры и строка дерева значений (структурой).
	Если ВспомогательныеДанные.Структуры.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
	
			Если (Колонки = Неопределено) Тогда
			
				// Структуры.
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					
				Иначе
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;

			Иначе
			
				// Строка дерева значений (структурой).
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если (Элемент.Ключ = "Строки") Тогда Продолжить; КонецЕсли;
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				Иначе
					
					Первый = Истина; Для Каждого Элемент Из Значение Цикл
						Если (Элемент.Ключ = "Строки") Тогда Продолжить; КонецЕсли;
						Если Первый Тогда
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
					КонецЦикла;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				КонецЕсли;

		    КонецЕсли;
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустая структура.
			Возврат "{}";
		
		КонецЕсли;
	КонецЕсли;
	
	// Соответсвия.
	Если ВспомогательныеДанные.Соответсвия.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
	
			// Соответсвия.
			ТипДопустимыхКлючей = ВспомогательныеДанные.ТипДопустимыхКлючей;
			
			Если МаскированиеКириллицы Тогда
				
				Первый = Истина; Для Каждого Элемент Из Значение Цикл
					Ключ = Элемент.Ключ; Если ТипДопустимыхКлючей.СодержитТип(ТипЗнч(Ключ)) Тогда Ключ = jsonЗаписатьСтроку(Строка(Ключ), ПолноеМаскированиеСимволов, МаскированиеКириллицы); Иначе ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); КонецЕсли;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
			
				Первый = Истина; Для Каждого Элемент Из Значение Цикл
					Ключ = Элемент.Ключ; Тип = ТипЗнч(Ключ); Если (Тип = Тип("Строка")) Тогда Ключ = jsonЗаписатьСтроку(Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы); ИначеЕсли ТипДопустимыхКлючей.СодержитТип(Тип) Тогда Ключ = """" + Ключ + """"; Иначе ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); КонецЕсли;
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустое соответсвие.
			Возврат "{}";
		
		КонецЕсли;
	КонецЕсли;
	
	// Массивы.
	Если ВспомогательныеДанные.Массивы.СодержитТип(Тип) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;

			Первый = Истина; Для Каждого Элемент Из Значение Цикл
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
		
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
		
		Иначе
			
			// Пустой массив.
			Возврат "[]";
		
		КонецЕсли;
	КонецЕсли;
	
	// Список значений.
	Если (Тип = Тип("СписокЗначений")) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;

			Структура = Новый Структура("Значение,Представление,Пометка");
			Первый = Истина; Для Каждого Элемент Из Значение Цикл
				ЗаполнитьЗначенияСвойств(Структура, Элемент);
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
		
		Иначе
			
			// Пустой список значений.
			Возврат "[]";
		
		КонецЕсли;
	КонецЕсли;
	
	// Таблица значений.
	#Если ВебКлиент Или ТонкийКлиент Тогда
	#Иначе
	Если (Тип = Тип("ТаблицаЗначений")) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
	
			Структура = Новый Структура; НаборКолонок = Значение.Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
			
			Первый = Истина; Для Каждого Элемент Из Значение Цикл
				ЗаполнитьЗначенияСвойств(Структура, Элемент);
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
				
		Иначе
			
			// Пустая таблица значений.
			Возврат "[]";
		
		КонецЕсли;
	КонецЕсли;
	
	// Коллекция строк дерева значений.
	Если (Тип = Тип("КоллекцияСтрокДереваЗначений")) Тогда
		Если Значение.Количество() Тогда
						
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
	
			Структура = Колонки; Первый = Истина; Для Каждого Элемент Из Значение Цикл
				ЗаполнитьЗначенияСвойств(Структура, Элемент); Структура.Строки = Элемент.Строки;
				Если Первый Тогда
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Первый = Ложь;
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
			КонецЦикла;
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
		
		Иначе
			
			// Пустая коллекция строк.
			Возврат "[]";
		
		КонецЕсли;
	КонецЕсли;
	
	// Дерево значений.
	Если (Тип = Тип("ДеревоЗначений")) Тогда
		
		Структура = Новый Структура("Строки"); НаборКолонок = Значение.Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
		Возврат jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Структура, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		
	КонецЕсли;
	
	// Запрос.
	Если (Тип = Тип("Запрос")) Тогда Попытка Возврат jsonЗаписать(Значение.Выполнить().Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); Исключение ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); КонецПопытки; КонецЕсли;
	
	// Результат запроса.
	Если (Тип = Тип("РезультатЗапроса")) Тогда Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Выборка из результата запроса.
	Если (Тип = Тип("ВыборкаИзРезультатаЗапроса")) Тогда
		
		Структура = Новый Структура; НаборКолонок = Значение.Владелец().Колонки; Для Каждого Колонка Из НаборКолонок Цикл Структура.Вставить(Колонка.Имя); КонецЦикла;
		ЗаполнитьЗначенияСвойств(Структура, Значение);
		Возврат jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		
	КонецЕсли;
	
	// Построители.
	Если ВспомогательныеДанные.Построители.СодержитТип(Тип) Тогда Попытка Значение.Выполнить(); Исключение ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); КонецПопытки; Возврат jsonЗаписать(Значение.Результат, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Хранилище значения.
	Если (Тип = Тип("ХранилищеЗначения")) Тогда Возврат jsonЗаписать(Значение.Получить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	#КонецЕсли
	
	// Двоичные данные.
	Если (Тип = Тип("ДвоичныеДанные")) Тогда
		#Если ВебКлиент Или ТонкийКлиент Тогда
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(Base64Строка(Значение), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#Иначе
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#КонецЕсли
	КонецЕсли;
	
	// Картинка.
	Если (Тип = Тип("Картинка")) Тогда
		#Если ВебКлиент Или ТонкийКлиент Тогда
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(Base64Строка(Значение.ПолучитьДвоичныеДанные()), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#Иначе
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение.ПолучитьДвоичныеДанные()), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
		#КонецЕсли
	КонецЕсли;
	
	// Ключ и значение.
	Если (Тип = Тип("КлючИЗначение")) Тогда Возврат jsonЗаписать(Новый Структура("Ключ,Значение", Значение.Ключ, Значение.Значение), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Клиентские типы.
	#Если НаСервере Тогда
	Если ВспомогательныеДанные.КлиентскиеТипы.СодержитТип(Тип) Тогда
		Если (Тип = Тип("ДанныеФормыДерево")) Тогда
			Возврат jsonЗаписать(ДанныеФормыВЗначение(Значение, Тип("ДеревоЗначений")), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		Иначе
			Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	
	// COMSafeArray.
	#Если ВебКлиент Тогда
	#Иначе
	Если (Тип = Тип("COMSafeArray")) Тогда Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	#КонецЕсли
			
	// Ссылки.
	#Если ВебКлиент Или ТонкийКлиент Тогда
	#Иначе
	Перечисление = Перечисления.ТипВсеСсылки().СодержитТип(Тип);
	Если Перечисление Или
		 Справочники.ТипВсеСсылки().СодержитТип(Тип) Или
		 Документы.ТипВсеСсылки().СодержитТип(Тип) Или
		 ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Или
		 ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Или
		 ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Или
		 Задачи.ТипВсеСсылки().СодержитТип(Тип) Или
		 БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Или
		 БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип) Или
		 ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда 
		Возврат jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
	КонецЕсли;
	#КонецЕсли
	
	// Неподдерживаемые типы.
	Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы);

КонецФункции // jsonЗаписать()

Функция jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы) Экспорт
	
	// Маскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
						"\",			"\\"),			// x5c
						"/",			"\/"),			// x2f
						Символ(008),	"\b"),			// x08
						Символы.Таб,	"\t"), 			// x09
						Символы.ПС,		"\n"),			// x0a
						Символы.ПФ,		"\f"),			// x0c
						Символы.ВК,		"\r"),			// x0d
						"""",			"\""");			// x22

	// Маскирование специальных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						Символ(00),		"\u0000"),
						Символ(01),		"\u0001"),
						Символ(02),		"\u0002"),
						Символ(03),		"\u0003"),
						Символ(04),		"\u0004"),
						Символ(05),		"\u0005"),
						Символ(06),		"\u0006"),
						Символ(07),		"\u0007"),
						Символ(11),		"\u000b"),
						Символ(14),		"\u000e"),
						Символ(15),		"\u000f"),
						Символ(16),		"\u0010"),
						Символ(17),		"\u0011"),
						Символ(18),		"\u0012"),
						Символ(19),		"\u0013"),
						Символ(20),		"\u0014"),
						Символ(21),		"\u0015"),
						Символ(22),		"\u0016"),
						Символ(23),		"\u0017"),
						Символ(24),		"\u0018"),
						Символ(25),		"\u0019"),
						Символ(26),		"\u001a"),
						Символ(27),		"\u001b"),
						Символ(28),		"\u001c"),
						Символ(29),		"\u001d"),
						Символ(30),		"\u001e"),
						Символ(31),		"\u001f");
						
	Если ПолноеМаскированиеСимволов Тогда
							
		// Маскирование сиволов обрабатываемых JavaScript-ом не правильно.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						Символ(127),	"\u007f"),
						Символ(128),	"\u0080"),
						Символ(129),	"\u0081"),
						Символ(130),	"\u0082"),
						Символ(131),	"\u0083"),
						Символ(132),	"\u0084"),
						Символ(133),	"\u0085"),
						Символ(134),	"\u0086"),
						Символ(135),	"\u0087"),
						Символ(136),	"\u0088"),
						Символ(137),	"\u0089"),
						Символ(138),	"\u008a"),
						Символ(139),	"\u008b"),
						Символ(140),	"\u008c"),
						Символ(141),	"\u008d"),
						Символ(142),	"\u008e"),
						Символ(143),	"\u008f"),
						Символ(144),	"\u0090"),
						Символ(145),	"\u0091"),
						Символ(146),	"\u0092"),
						Символ(147),	"\u0093"),
						Символ(148),	"\u0094"),
						Символ(149),	"\u0095"),
						Символ(150),	"\u0096"),
						Символ(151),	"\u0097"),
						Символ(152),	"\u0098"),
						Символ(153),	"\u0099"),
						Символ(154),	"\u009a"),
						Символ(155),	"\u009b"),
						Символ(156),	"\u009c"),
						Символ(157),	"\u009d"),
						Символ(158),	"\u009e"),
						Символ(159),	"\u009f"),
						Символ(173),	"\u00ad");
						
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						Символ(1536),	"\u0600"),
						Символ(1537),	"\u0601"),
						Символ(1538),	"\u0602"),
						Символ(1539),	"\u0603"),
						Символ(1540),	"\u0604"),
						Символ(1807),	"\u070f"),
						Символ(6068),	"\u17b4"),
						Символ(6069),	"\u17b5"),
						Символ(8204),	"\u200c"),
						Символ(8205),	"\u200d"),
						Символ(8206),	"\u200e"),
						Символ(8207),	"\u200f"),
						Символ(8232),	"\u2028"),
						Символ(8233),	"\u2029"),
						Символ(8234),	"\u202a"),
						Символ(8235),	"\u202b"),
						Символ(8236),	"\u202c"),
						Символ(8237),	"\u202d"),
						Символ(8238),	"\u202e"),
						Символ(8239),	"\u202f"),
						Символ(8288),	"\u2060"),
						Символ(8289),	"\u2061"),
						Символ(8290),	"\u2062"),
						Символ(8291),	"\u2063"),
						Символ(8292),	"\u2064"),
						Символ(8293),	"\u2065"),
						Символ(8294),	"\u2066"),
						Символ(8295),	"\u2067");
						
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						Символ(8296),	"\u2068"),
						Символ(8297),	"\u2069"),
						Символ(8268),	"\u206a"),
						Символ(8299),	"\u206b"),
						Символ(8300),	"\u206c"),
						Символ(8301),	"\u206d"),
						Символ(8302),	"\u206e"),
						Символ(8303),	"\u206f"),
						Символ(65279),	"\ufeff"),
						Символ(65520),	"\ufff0"),
						Символ(65521),	"\ufff1"),
						Символ(65522),	"\ufff2"),
						Символ(65523),	"\ufff3"),
						Символ(65524),	"\ufff4"),
						Символ(65525),	"\ufff5"),
						Символ(65526),	"\ufff6"),
						Символ(65527),	"\ufff7"),
						Символ(65528),	"\ufff8"),
						Символ(65529),	"\ufff9"),
						Символ(65530),	"\ufffa"),
						Символ(65531),	"\ufffb"),
						Символ(65532),	"\ufffc"),
						Символ(65533),	"\ufffd"),
						Символ(65534),	"\ufffe"),
						Символ(65535),	"\uffff");
	
	КонецЕсли;
					
	Если МаскированиеКириллицы Тогда
		
		// Маскирование кириллических символов.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
                        "А",            "\u0410"),
                        "Б",            "\u0411"),
                        "В",            "\u0412"),
                        "Г",            "\u0413"),
                        "Д",            "\u0414"),
                        "Е",            "\u0415"),
                        "Ж",            "\u0416"),
                        "З",            "\u0417"),
                        "И",            "\u0418"),
                        "Й",            "\u0419"),
                        "К",            "\u041a"),
                        "Л",            "\u041b"),
                        "М",            "\u041c"),
                        "Н",            "\u041d"),
                        "О",            "\u041e"),
                        "П",            "\u041f"),
                        "Р",            "\u0420"),
                        "С",            "\u0421"),
                        "Т",            "\u0422"),
                        "У",            "\u0423"),
                        "Ф",            "\u0424"),
                        "Х",            "\u0425"),
                        "Ц",            "\u0426"),
                        "Ч",            "\u0427"),
                        "Ш",            "\u0428"),
                        "Щ",            "\u0429"),
                        "Ъ",            "\u042a"),
                        "Ы",            "\u042b"),
                        "Ь",            "\u042c"),
                        "Э",            "\u042d"),
                        "Ю",            "\u042e"),
                        "Я",            "\u042f");
						
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						"а",            "\u0430"),
						"б",            "\u0431"),
						"в",            "\u0432"),
						"г",            "\u0433"),
						"д",            "\u0434"),
						"е",            "\u0435"),
						"ж",            "\u0436"),
						"з",            "\u0437"),
						"и",            "\u0438"),
						"й",            "\u0439"),
						"к",            "\u043a"),
						"л",            "\u043b"),
						"м",            "\u043c"),
						"н",            "\u043d"),
						"о",            "\u043e"),
						"п",            "\u043f"),
						"р",            "\u0440"),
						"с",            "\u0441"),
						"т",            "\u0442"),
						"у",            "\u0443"),
						"ф",            "\u0444"),
						"х",            "\u0445"),
						"ц",            "\u0446"),
						"ч",            "\u0447"),
						"ш",            "\u0448"),
						"щ",            "\u0449"),
						"ъ",            "\u044a"),
						"ы",            "\u044b"),
						"ь",            "\u044c"),
						"э",            "\u044d"),
						"ю",            "\u044e"),
						"я",            "\u044f");
						
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
						"’",            "\u2019"),
						"Ґ",            "\u0490"),
						"Ђ",            "\u0402"),
						"Ѓ",            "\u0403"),
						"Ѐ",            "\u0400"),
						"Ё",            "\u0401"),
						"Є",            "\u0404"),
						"Ѕ",            "\u0405"),
						"Ѝ",            "\u040d"),
						"І",            "\u0406"),
						"Ї",            "\u0407"),
						"Ј",            "\u0408"),
						"Љ",            "\u0409"),
						"Њ",            "\u040a"),
						"Ћ",            "\u040b"),
						"Ќ",            "\u040c"),
						"Ў",            "\u040e"),
						"Џ",            "\u040f"),
						"ґ",            "\u0491"),
						"ђ",            "\u0452"),
						"ѓ",            "\u0453"),
						"ѐ",            "\u0450"),
						"ё",            "\u0451"),
						"є",            "\u0454"),
						"ѕ",            "\u0455"),
						"ѝ",            "\u045d"),
						"і",            "\u0456"),
						"ї",            "\u0457"),
						"ј",            "\u0458"),
						"љ",            "\u0459"),
						"њ",            "\u045a"),
						"ћ",            "\u045b"),
						"ќ",            "\u045c"),
						"ў",            "\u045e"),
						"џ",            "\u045f");						
						
	КонецЕсли;
	
	// Кавычки.
	Возврат """" + Результат + """";
	
КонецФункции // jsonЗаписатьСтроку()

Функция jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы) Экспорт
#Если ВебКлиент Или ТонкийКлиент Тогда
#Иначе
	
	// Идентификатор.
	Если Стандарт Тогда 
		Если Перечисление Тогда Идентификатор = Лев(Прав(ЗначениеВСтрокуВнутр(Значение), 33), 32); Идентификатор = Прав(Идентификатор, 8) + "-" + Сред(Идентификатор, 21, 4) + "-" + Сред(Идентификатор, 17, 4) + "-" + Лев(Идентификатор, 4) + "-" + Сред(Идентификатор, 5, 12); Иначе Идентификатор = XMLСтрока(Значение); КонецЕсли;
	Иначе 
		Идентификатор = ЗначениеВСтрокуВнутр(Значение); Идентификатор = "¦ref¦" + СтрЗаменить(СтрЗаменить(Сред(Идентификатор, 6, СтрДлина(Идентификатор) - 6), ":", "×"), ",", "÷") + "¦";
	КонецЕсли;
	
	// Включая представление ссылки.
	Если ПредставленияСсылок Тогда Возврат jsonЗаписать(Новый Структура("Ссылка,Представление", Идентификатор, Строка(Значение)), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); КонецЕсли;
	
	// Ссылка.
	Возврат """" + Идентификатор + """";
	
#КонецЕсли
КонецФункции // jsonЗаписатьСсылку()

Функция СформироватьСтрокуПоШаблону(Строка, Параметры)
	
	Результат = Строка;
		
	Для Каждого Параметр Из Параметры Цикл
		Результат = СтрЗаменить(Результат, "[" + Параметр.Ключ + "]", Строка(Параметр.Значение));
	КонецЦикла;

	Возврат Результат;
	
КонецФункции // СформироватьСтрокуПоШаблону()

Функция ИсключениеПустойПакетДанных()
	
	Возврат НСтр("ru = 'JSON: Пустой пакет данных.'; uk = 'JSON: Порожній пакет даних.'");

КонецФункции // ИсключениеНеожиданноеОкончаниеСтроки()

Функция ИсключениеНекорректныйПакетДанных(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный пакет данных в позиции [Индекс].'; uk = 'JSON: Некоректний пакет даних у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНекорректныйПакетДанных()

Функция ИсключениеНеожиданноеОкончаниеПакетаДанных()
	
	Возврат НСтр("ru = 'JSON: Неожиданное окончание пакета данных.'; uk = 'JSON: Несподіване закінчення пакета даних.'");

КонецФункции // ИсключениеНеожиданноеОкончаниеПакетаДанных()

Функция ИсключениеНеожиданноеОкончаниеМассива(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неожиданное окончание массива в позиции [Индекс].'; uk = 'JSON: Несподіване закінчення масиву у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНеожиданноеОкончаниеМассива()

Функция ИсключениеНеожиданноеОкончаниеОбъетка(Индекс)

	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неожиданное окончание объекта в позиции [Индекс].'; uk = 'JSON: Несподіване закінчення об''єкту у позиції [Индекс].'"),
	   Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНеожиданноеОкончаниеОбъетка()

Функция ИсключениеНекорректныйТипNull(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Null в позиции [Индекс].'; uk = 'JSON: Некоректний тип Null у позиції [Индекс].'"),
	   Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНекорректныйТипNull()

Функция ИсключениеНекорректныйТипБулево(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Булево в позиции [Индекс].'; uk = 'JSON: Некоректний тип Булево у позиції [Индекс].'"),
	   Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНекорректныйТипБулево()

Функция ИсключениеНекорректныйТипНеопределено(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Неопределено в позиции [Индекс].'; uk = 'JSON: Некоректний тип Невизначено у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНекорректныйТипНеопределено()

Функция ИсключениеНекорректныйФорматСтроки(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат строки в позиции [Индекс].'; uk = 'JSON: Некоректний формат рядка у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));

КонецФункции // ИсключениеНекорректныйФорматСтроки()

Функция ИсключениеНекорректныйФорматДаты(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат даты [Значение] в позиции [Индекс].'; uk = 'JSON: Некоректний формат дати [Значение] у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс, Символ(034) + Значение + Символ(034)));

КонецФункции // ИсключениеНекорректныйФорматДаты()

Функция ИсключениеНекорректныйФорматЧисла(Индекс, Значение)
	
	Если ПустаяСтрока(Значение) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неверный формат данных в позиции [Индекс].'; uk = 'JSON: Невірний формат даних у позиції [Индекс].'"),
			Новый Структура("Индекс", Индекс));

	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат числа [Значение] в позиции [Индекс].'; uk = 'JSON: Некоректний формат числа [Значение] у позиції [Индекс].'"),
			Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
					   
	КонецЕсли;
					   
КонецФункции // ИсключениеНекорректныйФорматЧисла()

Функция ИсключениеНедопустимыйСимвол(Индекс, Символ)
	
	Если (Символ = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый символ в позиции [Индекс].'; uk = 'JSON: Неприпустимий символ в позиції [Индекс].'"),
			Новый Структура("Индекс", Индекс));

	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый символ в позиции [Индекс], ожидается [Символ].'; uk = 'JSON: Неприпустимий символ в позиції [Индекс], очікується [Символ].'"),
			Новый Структура("Индекс,Символ", Индекс, Символ(034) + Символ + Символ(034)));

	КонецЕсли;
				   
КонецФункции // ИсключениеНедопустимыйСимвол()

Функция ИсключениеНеопознанныйТип(Индекс, Тип)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип [Тип] в позиции [Индекс].'; uk = 'JSON: Неприпустимий тип [Тип] у позиції [Индекс].'"),
		Новый Структура("Индекс,Тип", Индекс, Символ(034) + Тип + Символ(034)));

КонецФункции // ИсключениеНеопознанныйТип()

Функция ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Невозможно преобразовать значение [Значение] в позиции [Индекс].'; uk = 'JSON: Неможливо перетворити значення [Значение] у позиції [Индекс].'"),
		Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));

КонецФункции // ИсключениеНевозможноПреобразоватьЗначение()

Функция ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Невозможно на клиенте преобразовать значение [Значение] в позиции [Индекс].'; uk = 'JSON: Неможливо на клієнті перетворити значення [Значение] у позиції [Индекс].'"),
		Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));

КонецФункции // ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте()

Функция ИсключениеНекорректныйПараметр(Параметр)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимое значение параметра [Параметр].'; uk = 'JSON: Неприпустиме значення параметра [Параметр].'"),
		Новый Структура("Параметр", Символ(034) + Параметр + Символ(034)));

КонецФункции // ИсключениеНекорректныйПараметр()

Функция ИсключениеНедопустимыйТипКлюча(Индекс, Значение)
	
	Если (Индекс = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип значения ключа [Тип].'; uk = 'JSON: Неприпустимий тип значення ключа [Тип].'"),
			Новый Структура("Тип", ТипЗнч(Значение)));

	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип значения ключа [Тип] в позиции [Индекс].'; uk = 'JSON: Неприпустимий тип значення ключа [Тип] в позиції [Индекс].'"),
			Новый Структура("Индекс,Тип", Индекс, Символ(034) + ТипЗнч(Значение) + Символ(034)));

	КонецЕсли;

КонецФункции // ИсключениеНедопустимыйТипКлюча()

Функция ИсключениеНевозможноВыполнитьЗапрос(Описание)
	
	Позиция = Найти(Описание, "}: "); Если Позиция Тогда Позиция = Позиция + 3; Иначе Позиция = 1; КонецЕсли;
	Длина = Найти(Описание, Символы.ПС); Если Длина Тогда Длина = Длина - Позиция; Иначе Длина = СтрДлина(Описание); КонецЕсли;
	Возврат НСтр("ru = 'JSON: Невозможно выполнить запрос. '; uk = 'JSON: Неможливо виконати запит. '") + Сред(Описание, Позиция, Длина) + ".";

КонецФункции // ИсключениеНевозможноВыполнитьЗапрос()
//  СЕРИАЛИЗАТОР добавить

//  ПАРСЕР
Функция jsonПрочитатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок) Экспорт
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) И (Не Стандарт = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); КонецЕсли; 
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) И (Не ПредставленияСсылок = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); КонецЕсли; 
	
	// Использование более общего случая параметров.
	Альтернативный = (Стандарт = Неопределено) Или (Не Стандарт); Стандарт = (Стандарт = Неопределено) Или Стандарт; ПредставленияСсылок = (ПредставленияСсылок = Неопределено) Или ПредставленияСсылок;
	
	// Схема подстановок шестнадцатиричной системы.
	СхемаПодстановок = Новый Соответствие; ШестнадцатиричнаяСистема = "0123456789abcdef"; ДесятичноеЧисло = 0;
	Для ВторойРазряд = 1 По 16 Цикл Для ПервыйРазряд = 1 По 16 Цикл СхемаПодстановок.Вставить(Сред(ШестнадцатиричнаяСистема, ВторойРазряд, 1) + Сред(ШестнадцатиричнаяСистема, ПервыйРазряд, 1), ДесятичноеЧисло); ДесятичноеЧисло = ДесятичноеЧисло + 1; КонецЦикла; КонецЦикла;
	
	// Вспомогательные данные.
	ВспомогательныеДанные = Новый Структура("ТипСтроки,СхемаПодстановок,АвтоматическиПриводитьКСтруктуре",
		Тип("Строка"),
		СхемаПодстановок,
		Истина);
		
	// Стартовые значения.
	Индекс = 1; Длина = СтрДлина(Значение);
	
	// Форматирование (первый шаг парсера).
	Если Стандарт Тогда СимволыФорматирования = " " + Символы.ВК + Символы.ПС + Символы.Таб; jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли;
	Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеПустойПакетДанных(); КонецЕсли; 
	
	// Парсер.
	Возврат jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Истина);
	
КонецФункции // jsonПрочитатьИнициализация()

Функция jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, ПервыйУровень)
	
	Символ = Сред(Значение, Индекс, 1);
	Если (Символ = """") Или (Символ = "'") Тогда        																	// " , '
		
		// Строка.
		Подстрока = Сред(Значение, Индекс + 1); Начало = Индекс; Пока Истина Цикл
			Позиция = Найти(Подстрока, Символ);
			
			Если (Позиция > 0) Тогда
				Индекс = Индекс + Позиция; Откат = Позиция - 1; Маскировка = Ложь; Пока (Сред(Подстрока, Откат, 1) = "\") И Откат Цикл Маскировка = Не Маскировка; Откат = Откат - 1; КонецЦикла;
				Если Маскировка Тогда Подстрока = Сред(Подстрока, Позиция + 1); Иначе Прервать; КонецЕсли;
			Иначе
		  		ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных();
			КонецЕсли;
			
		КонецЦикла;
		
		// Строка.
		Результат = jsonПрочитатьСтроку(Сред(Значение, Начало + 1, Индекс - Начало - 1), Стандарт, Начало, ВспомогательныеДанные.СхемаПодстановок, (Символ = "'"));
		
		Если jsonПрочитатьОпределитьДату(Результат) Тогда
			// Дата.
			Результат = jsonПрочитатьДату(Результат, Начало);
		ИначеЕсли jsonПрочитатьОпределитьИдентификатор(Результат) Тогда
			// Идентификатор.
			Результат = jsonПрочитатьИдентификатор(Результат, Начало);
		Иначе
			Если Альтернативный И jsonПрочитатьОпределитьВнутреннийТип(Результат) Тогда
				// Внутренний тип.
				Результат = jsonПрочитатьВнутреннийТип(Результат, Начало);
			КонецЕсли;
		КонецЕсли;
		
		// Корректировка индекса.
		Индекс = Индекс + 1;
		
	ИначеЕсли (Символ = "[") Тогда																							// [
		
		// Массив.
		Результат = Новый Массив;
		
		Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
		Символ = Сред(Значение, Индекс, 1); Если (Символ = "]") Тогда														// ] 
			
			// Пустой массив.
			Индекс = Индекс + 1;
		
		Иначе
		
			Пока (Индекс <= Длина) Цикл
				
				// Значение.
				Результат.Добавить(jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь));
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = "]") Тогда																					// ]
					// Окончание массива.
					Индекс = Индекс + 1; Прервать;
				Иначе
					// Продолжение массива.
					Если (Символ = ",") Тогда																				// ,
						Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли (Символ = "{") Тогда																							// {
	
		// Объект.
		Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); КонецЕсли;
		Символ = Сред(Значение, Индекс, 1); Если (Символ = "}") Тогда														// } 
			
			// Пустой объект.
			Индекс = Индекс + 1;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда Результат = Новый Структура; Иначе Результат = Новый Соответствие; КонецЕсли; 
		
		Иначе
			
			Результат = Новый Соответствие;
			
			ТипСтроки = ВспомогательныеДанные.ТипСтроки; Пока (Индекс <= Длина) Цикл
				
				// Ключ.
				Начало = Индекс; КлючЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь); Если (Не ТипЗнч(КлючЭлемента) = ТипСтроки) Тогда ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Начало, КлючЭлемента); КонецЕсли;
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = ":") Тогда																					// :
					Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); КонецЕсли;
				Иначе
					ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ":");
				КонецЕсли;
				
				// Значение.
				ЗначениеЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь);
				
				// Коллекция.
				Результат.Вставить(КлючЭлемента, ЗначениеЭлемента);
				
				Символ = Сред(Значение, Индекс, 1);
				Если (Символ = "}") Тогда																					// }
					// Окончание объекта.
					Индекс = Индекс + 1; Прервать;
				Иначе
					// Продолжение объекта.
					Если (Символ = ",") Тогда																				// ,
						Индекс = Индекс + 1; Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если (Индекс >= Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); КонецЕсли;
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда
				
				РезультатСтруктура = Новый Структура; 
				Для Каждого Элемент Из Результат Цикл Попытка РезультатСтруктура.Вставить(Элемент.Ключ, Элемент.Значение); Исключение РезультатСтруктура = Результат; АвтоматическоеПриведениеНеВыполнено = Истина; Прервать; КонецПопытки; КонецЦикла;
				Результат = РезультатСтруктура;
				
				// Ссылка.
				Если ПредставленияСсылок Тогда Результат = jsonПрочитатьСсылку(Результат, (АвтоматическоеПриведениеНеВыполнено = Истина)); КонецЕсли;
				
			Иначе
				
				// Ссылка.
				Если ПредставленияСсылок Тогда Результат = jsonПрочитатьСсылку(Результат, Истина); КонецЕсли;
				
			КонецЕсли; 
		
		КонецЕсли;
		
	Иначе
	
		// Остальные примитивные типы.
		Если (Символ = "n") Тогда
			
			// Null.
			Если (Сред(Значение, Индекс, 4) = "null") Тогда Индекс = Индекс + 4; Результат = Null; Иначе ВызватьИсключение ИсключениеНекорректныйТипNull(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "t") Тогда
			
			// Истина.
			Если (Сред(Значение, Индекс, 4) = "true") Тогда Индекс = Индекс + 4; Результат = Истина; Иначе ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "f") Тогда
			
			// Ложь.
			Если (Сред(Значение, Индекс, 5) = "false") Тогда Индекс = Индекс + 5; Результат = Ложь; Иначе ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); КонецЕсли;
			
		ИначеЕсли (Символ = "u") Тогда
			
			// Неопределено.
			Если (Сред(Значение, Индекс, 9) = "undefined") Тогда Индекс = Индекс + 9; Результат = Неопределено; Иначе ВызватьИсключение ИсключениеНекорректныйТипНеопределено(Индекс); КонецЕсли;
			
		Иначе
			
			// Число.
			Начало = Индекс; Пока Найти("-+0123456789.", Символ) И (Индекс <= Длина) Цикл Индекс = Индекс + 1; Символ = Сред(Значение, Индекс, 1); КонецЦикла;
			
			// Преобразование числа.
			Попытка
				Результат = Число(Сред(Значение, Начало, Индекс - Начало));
			Исключение
				ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
			КонецПопытки;
			
			// Экспоненциальная часть.
			Если (Символ = "E") Или (Символ = "e") Тогда
				
				// Степень.
				Индекс = Индекс + 1; Позиция = Индекс; Символ = Сред(Значение, Индекс, 1); Пока Найти("-+0123456789", Символ) И (Индекс <= Длина) Цикл Индекс = Индекс + 1; Символ = Сред(Значение, Индекс, 1); КонецЦикла;
				
				// Преобразование степени.
				Попытка
					Степень = Число(Сред(Значение, Позиция, Индекс - Позиция));
				Исключение
					ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
				КонецПопытки;
				
				// Возвидение числа в степень.
				Результат = Результат * Pow(10, Степень);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Форматирование.
	Если Стандарт Тогда jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); КонецЕсли; Если ПервыйУровень Тогда Если (Индекс <= Длина) Тогда ВызватьИсключение ИсключениеНекорректныйПакетДанных(Индекс); КонецЕсли; Иначе Если (Индекс > Длина) Тогда ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных(); КонецЕсли; КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // jsonПрочитать()

Функция jsonПрочитатьОпределитьДату(Значение)

	// Проверка.
	Если (СтрДлина(Значение) = 20) Тогда
		Если (Сред(Значение, 05, 1) = "-") И				// -
			 (Сред(Значение, 08, 1) = "-") И				// -
			 (Сред(Значение, 11, 1) = "T") И				// T
			 (Сред(Значение, 14, 1) = ":") И				// :
			 (Сред(Значение, 17, 1) = ":") И				// :
			 (Сред(Значение, 20, 1) = "Z") Тогда			// Z
			// Год. 
			Если Найти("0123456789", Сред(Значение, 01, 1)) И
				 Найти("0123456789", Сред(Значение, 02, 1)) И
				 Найти("0123456789", Сред(Значение, 03, 1)) И
				 Найти("0123456789", Сред(Значение, 04, 1)) И
			// Месяц.
				 Найти("0123456789", Сред(Значение, 06, 1)) И
				 Найти("0123456789", Сред(Значение, 07, 1)) И
			// День.
				 Найти("0123456789", Сред(Значение, 09, 1)) И
				 Найти("0123456789", Сред(Значение, 10, 1)) И
			// Час.
				 Найти("0123456789", Сред(Значение, 12, 1)) И
				 Найти("0123456789", Сред(Значение, 13, 1)) И
			// Минута.
				 Найти("0123456789", Сред(Значение, 15, 1)) И
				 Найти("0123456789", Сред(Значение, 16, 1)) И
			// Секунда.
				 Найти("0123456789", Сред(Значение, 18, 1)) И
				 Найти("0123456789", Сред(Значение, 19, 1)) Тогда
				Возврат Истина; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьДату()

Функция jsonПрочитатьОпределитьИдентификатор(Значение)

	// Проверка.
	Если (СтрДлина(Значение) = 36) Тогда
		Если (Сред(Значение, 09, 1) = "-") И					// -
			 (Сред(Значение, 14, 1) = "-") И					// -
			 (Сред(Значение, 19, 1) = "-") И					// -
			 (Сред(Значение, 24, 1) = "-") Тогда				// -
			// Первая часть. 
			Для Индекс = 01 По 08 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Вторая часть. 
			Для Индекс = 10 По 13 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Третья часть. 
			Для Индекс = 15 По 18 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Четвертая часть. 
			Для Индекс = 20 По 23 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			// Пятая часть. 
			Для Индекс = 25 По 36 Цикл Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьИдентификатор()

Функция jsonПрочитатьОпределитьВнутреннийТип(Значение)
	
	// Поиск.
	Возврат (Лев(Значение, 1) = "¦") И (Сред(Значение, 5, 1) = "¦") И (Прав(Значение, 1) = "¦"); // ¦xxx¦ ... ¦
	
КонецФункции // jsonПрочитатьОпределитьВнутреннийТип()

Функция jsonПрочитатьСтроку(Значение, Стандарт, Индекс, СхемаПодстановок, ОдинарнаяКавычка)
	
	// Последоавтельность перемаскировки.
	ПоследоавтельностьПеремаскировки = "\" + Символ(65535);
	
	// Демаскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
						"\\",			ПоследоавтельностьПеремаскировки),		// Перемаскирование последовательности.
						"\/",			"/"),           // x2f
						"\b",			Символ(008)),	// x08
						"\t",			Символы.Таб),   // x09
						"\n",			Символы.ПС),    // x0a
						"\f",			Символы.ПФ),    // x0c
						"\r",			Символы.ВК),    // x0d
						"\""",			"""");          // x22
						
	// Демаскирование Юникод символов.
	Позиция = Найти(Результат, "\u"); Пока Позиция Цикл
		СтаршийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 2, 2))]; МладшийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 4, 2))]; Если (СтаршийБайт = Неопределено) Или (МладшийБайт = Неопределено) Тогда ВызватьИсключение ИсключениеНекорректныйФорматСтроки(Индекс); КонецЕсли;
		Результат = СтрЗаменить(Результат, Сред(Результат, Позиция, 6), Символ(256 * СтаршийБайт + МладшийБайт)); Позиция = Найти(Результат, "\u");
	КонецЦикла;
		
	// Одинарная кавычка.
	Если ОдинарнаяКавычка Тогда Результат = СтрЗаменить(Результат, "\'", "'"); КонецЕсли;
	
	// Демаскирование перемаскированой последовательности.
	Возврат СтрЗаменить(Результат, ПоследоавтельностьПеремаскировки, "\");				
						
КонецФункции // jsonПрочитатьСтроку()

Функция jsonПрочитатьДату(Значение, Индекс)
	
	// Поиск.
	Попытка
		Возврат Дата(Лев(Значение, 4) + Сред(Значение, 06, 2) + Сред(Значение, 09, 2) + 
					 Сред(Значение, 12, 2) + Сред(Значение, 15, 2) + Сред(Значение, 18, 2));
	Исключение
		ВызватьИсключение ИсключениеНекорректныйФорматДаты(Индекс, Значение);
	КонецПопытки;
	
КонецФункции // jsonПрочитатьДату()

Функция jsonПрочитатьСсылку(Значение, Соответствие)
	
	Перем Ссылка;
	
	// Ссылка.
	Если (Значение.Количество() = 2) Тогда 
		Если Соответствие Тогда
			Ссылка = Значение.Получить("Ссылка"); Если (Не Ссылка = Неопределено) И (Не Значение.Получить("Представление") = Неопределено) Тогда Возврат Ссылка; КонецЕсли;
		Иначе
			Если Значение.Свойство("Представление") И Значение.Свойство("Ссылка", Ссылка) Тогда Возврат Ссылка; КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции // jsonПрочитатьСсылку()

Функция jsonПрочитатьИдентификатор(Значение, Индекс)
	
	// Поиск.
	Возврат Новый УникальныйИдентификатор(Значение);
	
КонецФункции // jsonПрочитатьИдентификатор()

Функция jsonПрочитатьВнутреннийТип(Значение, Индекс)
#Если ВебКлиент Или ТонкийКлиент Тогда
	ВызватьИсключение ИсключениеНевозможноПреобразоватьЗначениеНаКлиенте(Индекс, Значение);
#Иначе
	
	// Поиск.
	Тип = Сред(Значение, 2, 3); Данные = Сред(Значение, 6, СтрДлина(Значение) - 6);
	
	Если (Тип = "ref") Тогда
		Попытка
			Возврат ЗначениеИзСтрокиВнутр("{""#""," + СтрЗаменить(СтрЗаменить(Данные, "×", ":"), "÷", ",") + "}");
		Исключение
			ВызватьИсключение ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение);
		КонецПопытки;
	КонецЕсли;
		
	ВызватьИсключение ИсключениеНеопознанныйТип(Индекс, Тип);
	
#КонецЕсли
КонецФункции // jsonПрочитатьВнутреннийТип()

Процедура jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования)
	
	// Пропуск форматирования.
	Пока (Индекс <= Длина) И Найти(СимволыФорматирования, Сред(Значение, Индекс, 1)) Цикл Индекс = Индекс + 1; КонецЦикла;
	// Пробел его не видно, \r, \n, \t .
	
КонецПроцедуры // jsonПрочитатьПропуститьФорматирование()
//  ПАРСЕР ─────────────────────────────────────────────────────────────────────────────

 
Процедура ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, ТипДанных) Экспорт
 
    ТекстJSON = СокрЛП(Сред(ТекстJSON, 2)); // удалим открывающий символ структуры(массива)
 
    НомерЗначения = 0;
 
    Пока ТекстJSON <> "" Цикл
 
        ПервыйСимвол = Лев(ТекстJSON, 1);
        Если ПервыйСимвол = "{" Тогда
            // вложенная структура
            Значение = Новый Структура;
            ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
 
            Если ТипДанных = "Структура" Тогда
                Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
                НомерЗначения = НомерЗначения + 1;
            ИначеЕсли ТипДанных = "Массив" Тогда
                Результат.Добавить(Значение);
            КонецЕсли;
 
        ИначеЕсли ПервыйСимвол = "[" Тогда
            // вложенный массив
            Значение = Новый Массив;
            ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
 
            Если ТипДанных = "Структура" Тогда
                Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
                НомерЗначения = НомерЗначения + 1;
            Иначе
                Результат.Добавить(Значение);
            КонецЕсли;
 
        ИначеЕсли ПервыйСимвол = "}" И ТипДанных = "Структура" Тогда
            // структура закончилась
            ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            Если Лев(ТекстJSON, 1) = "," Тогда
                ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            КонецЕсли;
 
            Возврат;
 
        ИначеЕсли ПервыйСимвол = "]" И ТипДанных = "Массив" Тогда
            // массив закончился
            ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            Если Лев(ТекстJSON, 1) = "," Тогда
                ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
            КонецЕсли;
 
            Возврат;
 
        Иначе
 
            Если ТипДанных = "Структура" Тогда
 
                Поз = Найти(ТекстJSON, ":");
                Если Поз = 0 Тогда
                    // неверный формат, прервемся
                    Прервать;
                КонецЕсли;
 
                ИмяЗначения = СокрЛП(Лев(ТекстJSON, Поз-1));
 
                ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз+1));
 
                Если Лев(ТекстJSON, 1) = "{" Тогда
                    // значение является структурой
                    Значение = Новый Структура;
                    ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
 
                ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
                    // значение является массивом
                    Значение = Новый Массив;
                    ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
 
                Иначе
                    // обычное значение
                    Поз = 0;
                    Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
                        Символ = Сред(ТекстJSON, Сч, 1);
                        Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
                            Поз = Сч;
                            Прервать;
                        КонецЕсли;
                    КонецЦикла;
 
                    Если Поз = 0 Тогда
                        Значение = ТекстJSON;
                        ТекстJSON = "";
 
                    Иначе
                        Значение = Лев(ТекстJSON, Поз-1);
                        ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
 
                    КонецЕсли;
 
                    Значение = СокрЛП(Значение);
                    //Если ОбщегоНазначения.ТолькоЦифрыВСтроке(Значение) Тогда
                    //  Значение = Число(Значение);
                    //КонецЕсли;
 
                КонецЕсли;
				
				ИмяЗначения = СтрЗаменить(ИмяЗначения,"""","");
				Если Строка(ТипЗнч(Значение)) = "Строка" Тогда
					Значение    = СтрЗаменить(Значение,"""","");
				КонецЕсли;
				Попытка
					Результат.Вставить(ИмяЗначения, Значение);
				Исключение
					//Сообщить("CRM_ Ошибка обработки результата запроса! Возможно нечитаемый символ! ТекстСообщения: "+ИмяЗначения,СтатусСообщения.Внимание);
				КонецПопытки;
 
            ИначеЕсли ТипДанных = "Массив" Тогда
 
                // обычное значение
                Поз = 0;
                Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
                    Символ = Сред(ТекстJSON, Сч, 1);
                    Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
                        Поз = Сч;
                        Прервать;
                    КонецЕсли;
                КонецЦикла;
 
                Если Поз = 0 Тогда
                    Значение = ТекстJSON;
                    ТекстJSON = "";
 
                Иначе
                    Значение = Лев(ТекстJSON, Поз-1);
                    ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
 
                КонецЕсли;
 
                Значение = СокрЛП(Значение);
 
                Результат.Добавить(Значение);
 
            КонецЕсли;
 
        КонецЕсли;
 
    КонецЦикла;
 
КонецПроцедуры
 
Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON) Экспорт
 
    Результат = Новый Структура;
 
   ТекстJSON = СтрЗаменить(ТекстJSON, "\""", """");    // заменим последовательность \" на "
   ТекстJSON = СтрЗаменить(ТекстJSON, "\/""", "/");

	
	//Сначала определим запятые в значениях
	ТекстJSON = СтрЗаменить(ТекстJSON, ",""", "##");   
	ТекстJSON = СтрЗаменить(ТекстJSON, "},", "}%");    
	ТекстJSON = СтрЗаменить(ТекстJSON, "],", "]&");    

	ТекстJSON = СтрЗаменить(ТекстJSON, ",", " ");  
	
	ТекстJSON = СтрЗаменить(ТекстJSON, "##",",""" ); 
	ТекстJSON = СтрЗаменить(ТекстJSON, "}%", "},");  
	ТекстJSON = СтрЗаменить(ТекстJSON, "]&", "],");  
	
	ТекстJSON = СтрЗаменить(ТекстJSON, """", ""); 
 
    Если Лев(ТекстJSON, 1) = "{" Тогда
        // начало структуры
        ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, "Структура");
 
    ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
        // начало массива
        МассивДанных = Новый Массив;
        ЗаполнитьДанныеИзОтветаJSON(МассивДанных, ТекстJSON, "Массив");
 
        Результат.Вставить("Значение", МассивДанных);
 
    КонецЕсли;
 
    Возврат Результат;
 
КонецФункции


Функция ЗаполнитьСтруктуруИзОбъектаЦРМ(Объект, ТипОбъекта) Экспорт
	
	Если ТипОбъекта = "Договоры взаиморасчетов" Тогда
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("client_id",Объект.idCRM);
		СтруктураОбъекта.Вставить("comment","Документ 1С "+Объект.Номер);
		СтруктураОбъекта.Вставить("date",Объект.ДоговорВзаиморасчетов.ДатаСоздания);
		Если ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов.НомерДоговора) Тогда
			СтруктураОбъекта.Вставить("number",Объект.ДоговорВзаиморасчетов.НомерДоговора);
		иначе
			СтруктураОбъекта.Вставить("number",""+Объект.Номер+"/"+Объект.idCRM);
		КонецЕсли;

	КонецЕсли;
	
	Возврат СформироватьСтрокуJSONИзСтруктуры(СтруктураОбъекта);
КонецФункции

Функция ПреобразоватьСтрокуВДату(ДатаСтрокой) Экспорт
	Если Не ДатаСтрокой = "null" Тогда
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ".","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "-","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":","");
		ДатаСтрокой = СтрЗаменить(ДатаСтрокой, " ","");
		Если Найти(ДатаСтрокой,"T") Тогда
			ПолученнаяДата  =Дата(Лев(ДатаСтрокой,НАйти(ДатаСтрокой,"T")-1));
			Возврат ПолученнаяДата;
			
		иначе
			Если СтрДлина(ДатаСтрокой)<14 Тогда
				//перекроить дату
				//переделать культурно для даты рождения
				Если СтрДлина(ДатаСтрокой)=6 Тогда
					//010180
					Год   = Прав(ДатаСтрокой,2);
					Месяц = Сред(ДатаСтрокой,3,2);
					День  = Лев(ДатаСтрокой,2);
					
					ДатаСтрокойНов = "19"+Год+""+Месяц+""+День;
					ПолученнаяДата = Дата(ДатаСтрокойНов);
				ИначеЕсли СтрДлина(ДатаСтрокой)=8 Тогда
					//1990-04-04
					ПолученнаяДата = Дата(ДатаСтрокой);  
				КонецЕсли;
			иначе
				ПолученнаяДата = Дата(ДатаСтрокой);
			КонецЕсли;
			Возврат ПолученнаяДата;
		КонецЕсли;
	иначе
		Возврат null
	КонецЕсли;
КонецФункции

Функция УбратьКавычки(ЭлементСтруктуры) Экспорт
	ЭлементСтруктуры        = СтрЗаменить(ЭлементСтруктуры,"""","");
	ЭлементСтруктуры        =?(Найти(ЭлементСтруктуры,"null"),"",ЭлементСтруктуры);
	
	Возврат ЭлементСтруктуры;	
КонецФункции

Функция ПолучитьТелефонЦифрами(СтрокаТелефон) Экспорт
	
	ТелефонЧислами = "";
	
	ДлинаТелефона = СтрДлина(СтрокаТелефон);
	Для НомерСимвола = 1 По ДлинаТелефона Цикл
		ТекСимвол = Сред(СтрокаТелефон,НомерСимвола,1);
		Если Найти("0123456789",ТекСимвол) > 0 Тогда
			ТелефонЧислами = ТелефонЧислами + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТелефонЧислами;
	
КонецФункции

Функция НайтиПоНомеруТелефона(НомерТелефона) Экспорт
	
	ТелефонДляПоиска = НомерТелефона;
	ТелефонДляПоиска = ПолучитьТелефонЦифрами(ТелефонДляПоиска);
	Если Лев(ТелефонДляПоиска,1) = "7" или Лев(ТелефонДляПоиска,1)="8" Тогда
		ТелефонДляПоиска = Сред(ТелефонДляПоиска,2);
	КонецЕсли;
	Контрагент    = Справочники.Контрагенты.ПустаяСсылка();	
	
	Запрос = новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	КИ.Объект,
	               |	КИ.Представление
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КИ
	               |ГДЕ
	               |	КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	И КИ.Объект ССЫЛКА Справочник.Контрагенты";
	
	Результат = запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НомерКонтрагента = СтрЗаменить(Результат.Представление,"+","");
		НомерКонтрагента = ПолучитьТелефонЦифрами(НомерКонтрагента);
		Если Лев(НомерКонтрагента,1) = "7" или Лев(НомерКонтрагента,1)="8" Тогда
			НомерКонтрагента = Сред(НомерКонтрагента,2);
		КонецЕсли;
		
	    Если НомерКонтрагента = ТелефонДляПоиска Тогда
			Контрагент = Результат.Объект;
			прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Контрагент;	
	
КонецФункции

Функция ИмяЗначенияПеречисления(Значение) Экспорт
      
      ОбъектМетаданных = Значение.Метаданные();
      
      ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
      
      Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Синоним;
      
КонецФункции

Функция ПолучитьКИ(ОбъектКлиент, ТипКИ, ВидКИ="")
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);
	Запрос.УстановитьПараметр("парТипКИ",ТипКИ);
	Запрос.УстановитьПараметр("парВидКИ",ВидКИ);
	
	Запрос.Текст = "Выбрать *
	|из РегистрСведений.КонтактнаяИнформация как КИ
	|Где Объект = &парКлиент
	|  и Тип    = &парТипКИ
	|  "+?(ЗначениеЗаполнено(ВидКИ),"и Вид = &парВидКИ","")+"
	|";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПаспортныеДанные(ОбъектКлиент)
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);
	Запрос.Текст = "Выбрать *
	|Из справочник.ПодтверждающиеДокументы
	|Где Владелец=&парКлиент
	|  и не ПометкаУдаления
	|  и ВидПодтверждающегоДокумента = Значение(Перечисление.ВидыДокументов.Паспорт)";
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьИнфоПоАвто(ОбъектАвто,ВидЗначения)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парДата",ТекущаяДата());
	Запрос.УстановитьПараметр("парВидЗначения",ВидЗначения);
	Запрос.УстановитьПараметр("парАвто",ОбъектАвто);
	Запрос.Текст = "выбрать *
    |из регистрСведений.Автомобили.СрезПоследних(&парДата,ВидЗначения = &парВидЗначения и Автомобиль=&парАвто)";
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ПолучитьКЛ(ОбъектКлиент)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);	
	Если Лев(Метаданные.Версия,3)="5.1" Тогда
		Запрос.Текст ="ВЫБРАТЬ
		              |	КЛ.Ведомый КАК КонтЛицо,
		              |	КЛ.Ведомый.Наименование КАК ФИОКЛ,
		              |	КИ.Представление КАК ТелефонКЛ
		              |ИЗ
		              |	РегистрСведений.КонтактныеЛицаКонтрагентов КАК КЛ
		              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ
		              |		ПО (КИ.Объект = КЛ.Ведомый)
		              |			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		              |ГДЕ
		              |	КЛ.ВидОтношений = ЗНАЧЕНИЕ(Справочник.ВидыВзаимоотношений.КонтактноеЛицо)
		              |	И КЛ.Ведущий = &парКлиент
		              |	И КЛ.Основной = ИСТИНА";
	Иначе
		Запрос.Текст ="ВЫБРАТЬ
		              |	КЛ.Ссылка КАК КонтЛицо,
		              |	КЛ.Ссылка.Наименование КАК ФИОКЛ,
		              |	КИ.Представление КАК ТелефонКЛ
		              |ИЗ
		              |	Справочник.Контрагенты КАК КЛ
		              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ
		              |		ПО (КИ.Объект = КЛ.Ссылка)
		              |			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		              |ГДЕ
		              |	КЛ.ВедушийКонтрагент = &парКлиент";
	КонецЕсли;
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ЗаписьЗначенияРегистраСведения(Значение,ВидЗначения,Автомобиль,НаДату=Неопределено,Объект) Экспорт
	Отказ=Ложь;
	
	Если НаДату=Неопределено или НаДату=Дата(1,1,1) Тогда
		НаДату=НачалоДня(ТекущаяДата());
	КонецЕсли; 
	ДатаЗаписи =  НаДату;
	Если ВидЗначения=Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег Тогда
		//При записи нового пробега
		//Получить последний пробег и следующий
		СтруктураОтбора=Новый Структура("Автомобиль,ВидЗначения",Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи-24*60*60,СтруктураОтбора);
		Попытка ПробегДо = Число(СтруктураСведений.Значение); Исключение ПробегДо = 0; КонецПопытки;
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПервое(ДатаЗаписи+24*60*60,СтруктураОтбора);
		Попытка ПробегПосле = Число(СтруктураСведений.Значение); Исключение ПробегПосле = 9999999999; КонецПопытки;
		Если Значение<ПробегДо Тогда
			Сообщить("Значение пробега автомобиля не может быть менее старого значения ("+СокрЛП(ПробегДо)+").");
			Отказ=Истина; Возврат Отказ;
		КонецЕсли; 
		Если Значение>ПробегПосле Тогда
			Сообщить("Значение пробега автомобиля не может быть более следующего значения ("+СокрЛП(ПробегПосле)+").");
			Отказ=Истина; Возврат Отказ;
		КонецЕсли; 
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		//Чтение старого значения регистра
		СтруктураОтбора   = Новый Структура("Автомобиль,ВидЗначения",Автомобиль,ВидЗначения);
		СтруктураСведений = РегистрыСведений.Автомобили.ПолучитьПоследнее(ДатаЗаписи,СтруктураОтбора);
		ЗначениеСтарое    = СтруктураСведений.Значение;
		Записывать = Ложь;
		//Введено значение, а старое отсутствует
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое=Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Значение стерто, а старое значение было введено
		Если обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда Записывать=Истина; КонецЕсли; 
		//Введено значение и было введено старое
		Если НЕ обЗначениеНеЗаполнено(Значение) И ЗначениеСтарое<>Неопределено Тогда
			//Значение изменилось
			Если Значение<>ЗначениеСтарое Тогда Записывать=Истина; КонецЕсли; 
		КонецЕсли; 
		Если Записывать Тогда
			//Значение параметра изменилось
			ЗаписьРегСведений=РегистрыСведений.Автомобили.СоздатьМенеджерЗаписи();
			ЗаписьРегСведений.Автомобиль=Автомобиль.Ссылка;
			ЗаписьРегСведений.ВидЗначения=ВидЗначения;
			ЗаписьРегСведений.Значение=Значение;
			ЗаписьРегСведений.Период=ДатаЗаписи;
			ЗаписьРегСведений.Записать();
			КонецЕсли; 
	КонецЕсли; 
	
	Возврат Отказ;
КонецФункции // ЗаписьЗначенияРегистраСведения()

//<<Павличенко 10.03.2020
Процедура ОбработатьДанныеЗаказНаряда(ДокЗаказНаряд, CRM_Имя_, Настройка) Экспорт
	
	Если 1=2 Тогда
		ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру();
	КонецЕсли;
	
	////<<БАА
	//Настройка = Справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000006");
	//Если Не Настройка.Подразделения.НайтиСтроки(Новый Структура("Подразделение, ВидРемонта", ДокЗаказНаряд.ПодразделениеКомпании, ДокЗаказНаряд.ВидРемонта)).Количество() Тогда
	//	Возврат;
	//КонецЕсли;	
	////>>БАа
	
	ДанныеДляПередачи = Новый Структура();
	
	//CRM_Имя = ?(ЗначениеЗаполнено(Справочники.CRM_НастройкаПодключения.ВыгружатьЗНВCRM.Значение),СокрЛП(Справочники.CRM_НастройкаПодключения.ВыгружатьЗНВCRM.Значение)+"_","");
	CRM_Имя = СокрЛП(CRM_Имя_)+"_";
	//>>Павличенко 10.03.2020
	
	Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		Если ДокЗаказНаряд.СоздатьЗапись_CRM и ЗначениеЗаполнено(ДокЗаказНаряд.id_Обращения_CRM) Тогда
			ДанныеДляПередачи.Вставить("comment","1С. Заявка на ремонт №"+ДокЗаказНаряд.Номер);
			
			СтрокаОтправки = jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
			
			
			ПараметрыПодключения = ПолучитьСтруктуруПараметров();
			
			ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
			
			Ресурс = Справочники.CRM_НастройкаПодключения.НайтиПоНаименованию("CRM ресурс preparedServiceCaseStage",Истина).Значение;
			Ресурс = Ресурс+"?case_id="+СокрЛП(ДокЗаказНаряд.id_Обращения_CRM)+"&type=30";
			
			//"/yii/api/preparedServiceCaseStage?case_id=532&type=30"
			
			Если НЕ ЗначениеЗаполнено(Ресурс) Тогда
				Возврат;
			КонецЕсли;
			ПараметрыПодключения.Ресурс = Ресурс; 
			//<<БАА
			ПараметрыПодключения.Логин = Настройка.Логин;
			ПараметрыПодключения.Пароль = Настройка.Пароль;
			ПараметрыПодключения.Токен = Настройка.Токен;
			//>>БАА
			//ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
			
			//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
			//	ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
			//КонецЕсли;
			
			//<<Павличенко 10.03.2020
			//Если Справочники.CRM_НастройкаПодключения.ИспользоватьWinHttp.ДопЗначение Тогда
			//	ПослатьPOSTЗапрос(ПараметрыПодключения)	
			//иначе
			ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения);
			//КонецЕсли;
			//>>Павличенко 10.03.2020
			Сообщить("Передано в CRM");	
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ДанныеДляПередачи = Новый Структура();
		ДанныеДляПередачиBody = новый Структура();
		
		ДанныеДляПередачиBody.Вставить("DataType", ДокЗаказНаряд.Метаданные().Синоним);
		ДанныеДляПередачиBody.Вставить("Id", CRM_Имя+""+ДокЗаказНаряд.Номер);
		
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ДанныеДляПередачиBody.Вставить("Id_CRM", ДокЗаказНаряд.id_Обращения_CRM);
		КонецЕсли;

		
		ДанныеДляПередачиBody.Вставить("Date", Формат(ДокЗаказНаряд.Дата,"ДФ=dd.MM.yyyy"));
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ДанныеДляПередачиBody.Вставить("DateRepair", Формат(ДокЗаказНаряд.ДатаНачала, "ДЛФ=DT"));
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДокЗаказНаряд.ПричинаОбращения) Тогда
			ДанныеДляПередачиBody.Вставить("ClientStatement", ДокЗаказНаряд.ПричинаОбращения);
		КонецЕсли;
		
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Если ЗначениеЗаполнено(ДокЗаказНаряд.Рекомендации) Тогда
				ДанныеДляПередачиBody.Вставить("Recommendations", ДокЗаказНаряд.Рекомендации);
			КонецЕсли;
			
			Если ТипЗнч(ДокЗаказНаряд.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
				ДанныеДляПередачиPrimaryServiceCase = Новый Структура("Id_Crm, Id, Date",ДокЗаказНаряд.ДокументОснование.id_Обращения_CRM, ДокЗаказНаряд.ДокументОснование.Номер, Формат(ДокЗаказНаряд.ДокументОснование.Дата,"ДФ=dd.MM.yyyy"));
				ДанныеДляПередачиBody.Вставить("PrimaryServiceCase",ДанныеДляПередачиPrimaryServiceCase);
			иначе
				ДанныеДляПередачиPrimaryServiceCase = Новый Структура("Id_Crm, Id, Date","", "", "");
				ДанныеДляПередачиBody.Вставить("PrimaryServiceCase",ДанныеДляПередачиPrimaryServiceCase);
				
			КонецЕсли;
			
		КонецЕсли;

		//
				
		
		ДанныеДляПередачиDepartment = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Цех.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Цех.Код,ДокЗаказНаряд.Цех.Наименование);
		
		Если ДанныеДляПередачиDepartment.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Department",ДанныеДляПередачиDepartment);
		КонецЕсли;
		
		//Список Пользователь
		ДанныеДляПередачиUser = Новый ТаблицаЗначений();
		ДанныеДляПередачиUser.Колонки.Добавить("DataType");
		ДанныеДляПередачиUser.Колонки.Добавить("Id");
		ДанныеДляПередачиUser.Колонки.Добавить("Name");
		ДанныеДляПередачиUser.Колонки.Добавить("Role");
		ДанныеДляПередачиUser.Колонки.Добавить("Email");

		
		// БИЗТЕХ КОВАЛЬ 10.06.2025 ++
		// Подмена ответственного менеджера на менеджера по подразделению
		Если ДокЗаказНаряд.ПодразделениеКомпании.Код = "ЦБ000386" Тогда
			ОтветственныйМенеджер = Справочники.Пользователи.НайтиПоКоду("Ахмедова М.И. (О2 Ритейл)                         ");
		ИначеЕсли ДокЗаказНаряд.ПодразделениеКомпании.Код = "ЦБ000393" Тогда
			ОтветственныйМенеджер = Справочники.Пользователи.НайтиПоКоду("Идрисов М.В.                                      ");
		ИначеЕсли ДокЗаказНаряд.ПодразделениеКомпании.Код = "ЦБ000407" Тогда
			ОтветственныйМенеджер = Справочники.Пользователи.НайтиПоКоду("Велигура А.В,                                     "); //Зубарева Алена Владимировна
		ИначеЕсли ДокЗаказНаряд.ПодразделениеКомпании.Код = "ЦБ000422" Тогда
			ОтветственныйМенеджер = Справочники.Пользователи.НайтиПоКоду("Слоев М.С.                                        ");
		Иначе
			ОтветственныйМенеджер = ДокЗаказНаряд.Автор;
		КонецЕсли;
		
		// БИЗТЕХ КОВАЛЬ 10.06.2025 --
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       =  CRM_Имя+""+СокрЛП(ОтветственныйМенеджер.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     =  СокрЛП(ОтветственныйМенеджер.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     =  "Ответственный";
		
		Email = ПолучитьКИ(ДокЗаказНаряд.Автор, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail="";
		Если Email.Количество()>0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       =  CRM_Имя+""+СокрЛП(ДокЗаказНаряд.Мастер.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     =  СокрЛП(ДокЗаказНаряд.Мастер.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     =  "Мастер";
		Email = ПолучитьКИ(ДокЗаказНаряд.Мастер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail="";
		Если Email.Количество()>0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;

		
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       =  CRM_Имя+""+СокрЛП(ДокЗаказНаряд.Диспетчер.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     =  СокрЛП(ДокЗаказНаряд.Диспетчер.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     =  "Диспетчер";
		Email = ПолучитьКИ(ДокЗаказНаряд.Диспетчер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail="";
		Если Email.Количество()>0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;
		
		Если ДанныеДляПередачиUser.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Employees", ДанныеДляПередачиUser);
		КонецЕсли;
		
		ДанныеДляПередачиRepairsType = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.ВидРемонта.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.ВидРемонта.Код,ДокЗаказНаряд.ВидРемонта.Наименование);
		
		Если ДанныеДляПередачиRepairsType.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("RepairType", ДанныеДляПередачиRepairsType);
		КонецЕсли;
		
		////СписокКлиент
		ДанныеДляПередачиClient = Новый Структура();
		
		ДанныеДляПередачиClient.Вставить("DataType",ДокЗаказНаряд.Заказчик.Метаданные().Синоним);
		ДанныеДляПередачиClient.Вставить("Id",CRM_Имя+""+СокрЛП(ДокЗаказНаряд.Заказчик.Код));
		
		Если ДокЗаказНаряд.Заказчик.ФормаСобственности =  Перечисления.ФормыСобственности.ЧастноеЛицо 
			Тогда
			
			ДанныеДляПередачиClient.Вставить("LastName",ДокЗаказНаряд.Заказчик.Фамилия);
			ДанныеДляПередачиClient.Вставить("Name",ДокЗаказНаряд.Заказчик.Имя);
			ДанныеДляПередачиClient.Вставить("MiddleName",ДокЗаказНаряд.Заказчик.Отчество);
			
			Если ЗначениеЗаполнено(ДокЗаказНаряд.Заказчик.Пол) Тогда
				ДанныеДляПередачиClient.Вставить("Gender", ИмяЗначенияПеречисления(ДокЗаказНаряд.Заказчик.Пол));
			иначе
				ДанныеДляПередачиClient.Вставить("Gender", "");
			КонецЕсли;
			
		иначе
			ДанныеДляПередачиClient.Вставить("LastName","");
			ДанныеДляПередачиClient.Вставить("Name",ДокЗаказНаряд.Заказчик.НаименованиеПолное);
			ДанныеДляПередачиClient.Вставить("MiddleName","");
		КонецЕсли;
		
		ДанныеДляПередачиClient.Вставить("Type",ИмяЗначенияПеречисления(ДокЗаказНаряд.Заказчик.ФормаСобственности));
		
		ДанныеДляПередачиClient.Вставить("Kpp",ДокЗаказНаряд.Заказчик.КПП);
		ДанныеДляПередачиClient.Вставить("Inn",ДокЗаказНаряд.Заказчик.ИНН);
		ДанныеДляПередачиClient.Вставить("Ogrn",ДокЗаказНаряд.Заказчик.КодПоОКПО);
		
		
		ДанныеДляПередачиClient.Вставить("Addresses", );
		ДанныеДляПередачиClient.Вставить("Contacts", );
		
		
		////Контактная информация - структура
		Email = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail="";
		Если Email.Количество()>0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		ДанныеДляПередачиClient.Вставить("Email",стрEmail);
		
		ДанныеДляПередачиAddr = Новый ТаблицаЗначений();
		
		ДанныеДляПередачиAddr.Колонки.Добавить("Addr");
		ДанныеДляПередачиAddr.Колонки.Добавить("DataType");
		ДанныеДляПередачиAddr.Колонки.Добавить("Type");
		ДанныеДляПередачиAddr.Колонки.Добавить("PostCode");
		ДанныеДляПередачиAddr.Колонки.Добавить("Region");
		ДанныеДляПередачиAddr.Колонки.Добавить("District");
		ДанныеДляПередачиAddr.Колонки.Добавить("City");
		ДанныеДляПередачиAddr.Колонки.Добавить("Street");
		ДанныеДляПередачиAddr.Колонки.Добавить("House");
		ДанныеДляПередачиAddr.Колонки.Добавить("Building");
		ДанныеДляПередачиAddr.Колонки.Добавить("Apartment");
		
		Адреса = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.Адрес);
		Если Адреса.Количество()>0 Тогда
			Пока Адреса.следующий() Цикл
				НоваяСтрокаДанныеДляПередачиAddr = ДанныеДляПередачиAddr.Добавить();
				НоваяСтрокаДанныеДляПередачиAddr.DataType = "Адреса";
				НоваяСтрокаДанныеДляПередачиAddr.Type     = Адреса.Вид.Наименование;
				НоваяСтрокаДанныеДляПередачиAddr.Addr     = Адреса.Представление;
				НоваяСтрокаДанныеДляПередачиAddr.PostCode = Адреса.Поле1;
				НоваяСтрокаДанныеДляПередачиAddr.Region   = Адреса.Поле2;
				НоваяСтрокаДанныеДляПередачиAddr.District = Адреса.Поле3;
				НоваяСтрокаДанныеДляПередачиAddr.City     = Адреса.Поле4;
				НоваяСтрокаДанныеДляПередачиAddr.Street   = Адреса.Поле6;
				НоваяСтрокаДанныеДляПередачиAddr.House    = Адреса.Поле7;
				НоваяСтрокаДанныеДляПередачиAddr.Building = Адреса.Поле8;
				НоваяСтрокаДанныеДляПередачиAddr.Apartment = Адреса.Поле9;
			КонецЦикла;
		иначе
			НоваяСтрокаДанныеДляПередачиAddr = ДанныеДляПередачиAddr.Добавить();
			НоваяСтрокаДанныеДляПередачиAddr.DataType = "Адреса";
			НоваяСтрокаДанныеДляПередачиAddr.Type     = "";
			НоваяСтрокаДанныеДляПередачиAddr.Addr     = "";
			НоваяСтрокаДанныеДляПередачиAddr.PostCode = "";
			НоваяСтрокаДанныеДляПередачиAddr.Region   = "";
			НоваяСтрокаДанныеДляПередачиAddr.District = "";
			НоваяСтрокаДанныеДляПередачиAddr.City     = "";
			НоваяСтрокаДанныеДляПередачиAddr.Street   = "";
			НоваяСтрокаДанныеДляПередачиAddr.House    = "";
			НоваяСтрокаДанныеДляПередачиAddr.Building = "";
			НоваяСтрокаДанныеДляПередачиAddr.Apartment = "";
		КонецЕсли;
		
		ДанныеДляПередачиClient.Вставить("Addresses", ДанныеДляПередачиAddr);
		
		
		Телефоны = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.Телефон);
		////
		ТелефоныКлиента = Новый ТаблицаЗначений();
		ТелефоныКлиента.Колонки.Добавить("DataType");
		ТелефоныКлиента.Колонки.Добавить("Type");
		ТелефоныКлиента.Колонки.Добавить("Number");
		Пока Телефоны.следующий() цикл
			НоваяСтрокаНомер =  ТелефоныКлиента.Добавить();
			НоваяСтрокаНомер.DataType = "Телефоны";
			Если ЗначениеЗаполнено(Телефоны.Вид) Тогда
				НоваяСтрокаНомер.Type     = Телефоны.Вид.Наименование;
			Иначе
				
			КонецЕсли;
			НоваяСтрокаНомер.Number   = Телефоны.Представление;
		КонецЦикла;
		
		ДанныеДляПередачиClient.Вставить("Phones", ТелефоныКлиента);
		//		
		ДанныеДляПередачиDocuments = Новый ТаблицаЗначений();
		ДанныеДляПередачиDocuments.Колонки.Добавить("DataType");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Type");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Serie");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Number");
		ДанныеДляПередачиDocuments.Колонки.Добавить("IssuedAt");
		ДанныеДляПередачиDocuments.Колонки.Добавить("IssuedBy");
		
		////Паспортные данные
		ПаспортныеДанные = ПолучитьПаспортныеДанные(ДокЗаказНаряд.Заказчик);
		ТипДокумента = "";
		ПаспСерия    = "";
		ПаспНомер    = "";
		ПаспортВыдан = "";
		ПаспортДатаВыдачи = "";
		
		Если ПаспортныеДанные.Количество()> 0 Тогда
			Если ПаспортныеДанные.Следующий() Тогда
				ТипДокумента = ИмяЗначенияПеречисления(ПаспортныеДанные.ВидПодтверждающегоДокумента);
				ПаспСерия    = ПаспортныеДанные.Серия;
				ПаспНомер    = ПаспортныеДанные.Номер;
				ПаспортВыдан = ПаспортныеДанные.КемВыдан;
				ПаспортДатаВыдачи = ПаспортныеДанные.ДатаВыдачи;
				
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрокаДанныеДляПередачиDocuments = ДанныеДляПередачиDocuments.Добавить();
		НоваяСтрокаДанныеДляПередачиDocuments.DataType = "Подтверждающие документы";
		НоваяСтрокаДанныеДляПередачиDocuments.Type = ТипДокумента;
		НоваяСтрокаДанныеДляПередачиDocuments.Serie = ПаспСерия;
		НоваяСтрокаДанныеДляПередачиDocuments.Number = ПаспНомер;
		НоваяСтрокаДанныеДляПередачиDocuments.IssuedAt = ПаспортДатаВыдачи;
		НоваяСтрокаДанныеДляПередачиDocuments.IssuedBy = ПаспортВыдан;
		
		ДанныеДляПередачиClient.Вставить("Documents",ДанныеДляПередачиDocuments);
		//
		//Контактные лица - структура
		//// 
		// КОВАЛЬ 14.03.2025 SDK 000000787 ++
		// Коваль 18.03.2025 SDK 000000787 ++   == Если в ЗН указано доверенное лицо через поле тогда использовать его в первую очередь
		Если ЗначениеЗаполнено(ДокЗаказНаряд.ДовЛицо) Тогда
			КонтактноеЛицоКонтрагента = ДокЗаказНаряд.ДовЛицо;
		Иначе
			ИнфоПоКЛ = ПолучитьКЛ(ДокЗаказНаряд.Заказчик);
			ИнфоПоКЛ.Следующий();      //Нам нужен только один контрагент
			КонтактноеЛицоКонтрагента = ИнфоПоКЛ.КонтЛицо;
		КонецЕсли;
		// Коваль 18.03.2025 SDK 000000787 ++
		
		ДанныеДляПередачиPrimaryContact = Новый Структура();
		Если ЗначениеЗаполнено(КонтактноеЛицоКонтрагента) Тогда
			ДанныеДляПередачиPrimaryContact.Вставить("DataType",	"Контактные лица");
			ДанныеДляПередачиPrimaryContact.Вставить("Id",			CRM_Имя+""+КонтактноеЛицоКонтрагента.Код);
			ДанныеДляПередачиPrimaryContact.Вставить("LastName",	КонтактноеЛицоКонтрагента.Фамилия);
			ДанныеДляПередачиPrimaryContact.Вставить("Name",		КонтактноеЛицоКонтрагента.Имя);
			ДанныеДляПередачиPrimaryContact.Вставить("MiddleName",	КонтактноеЛицоКонтрагента.Отчество);
            //ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformation",		?(КонтактноеЛицоКонтрагента.СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да,"1","0"));
            //ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformationDate",	Формат(КонтактноеЛицоКонтрагента.СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=dd.MM.yyyy"));
			//БИЗТЕХ КОВАЛЬ 26.03.2025 ++
			ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformation",		"1");
            ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformationDate",	Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy"));
			//БИЗТЕХ КОВАЛЬ 26.03.2025 -- 
			Если КонтактноеЛицоКонтрагента.БТ_ОтказОтКоммуникации = Истина Тогда
				ДанныеДляПередачиPrimaryContact.Вставить("consentObtainingSmsMailing",					"0");
				ДанныеДляПередачиPrimaryContact.Вставить("consentConductSurveys",						"0");	
			Иначе
				ДанныеДляПередачиPrimaryContact.Вставить("consentObtainingSmsMailing",					"1");
				ДанныеДляПередачиPrimaryContact.Вставить("consentConductSurveys",						"1");
			КонецЕсли;
			
						
			ТелефоныКЛ = ПолучитьКИ(КонтактноеЛицоКонтрагента, Перечисления.ТипыКонтактнойИнформации.Телефон);

			ТабТелефоныКЛ = Новый ТаблицаЗначений();
			ТабТелефоныКЛ.Колонки.Добавить("DataType");
			ТабТелефоныКЛ.Колонки.Добавить("id");
			ТабТелефоныКЛ.Колонки.Добавить("Type");
			ТабТелефоныКЛ.Колонки.Добавить("Number");
			Пока ТелефоныКЛ.следующий() цикл
				НоваяСтрокаНомер =  ТабТелефоныКЛ.Добавить();
				НоваяСтрокаНомер.DataType = "Телефоны";
				НоваяСтрокаНомер.id = CRM_Имя+""+КонтактноеЛицоКонтрагента.Код + "М";
				Если ЗначениеЗаполнено(ТелефоныКЛ.Вид) Тогда
					НоваяСтрокаНомер.Type     = ТелефоныКЛ.Вид.Наименование;
				Иначе
					
				КонецЕсли;
				НоваяСтрокаНомер.Number   = ТелефоныКЛ.Представление;
			КонецЦикла;
			ДанныеДляПередачиPrimaryContact.Вставить("Phones",		ТабТелефоныКЛ);
		Иначе
			// Если контактного лица нет то выгрузим самого контрагента
			ДанныеДляПередачиPrimaryContact.Вставить("DataType",	"Контактные лица");
			ДанныеДляПередачиPrimaryContact.Вставить("Id",			CRM_Имя+""+СокрЛП(ДокЗаказНаряд.Заказчик.Код));
			Если ДокЗаказНаряд.Заказчик.ФормаСобственности =  Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				ДанныеДляПередачиPrimaryContact.Вставить("LastName",	ДокЗаказНаряд.Заказчик.Фамилия);
				ДанныеДляПередачиPrimaryContact.Вставить("Name",		ДокЗаказНаряд.Заказчик.Имя);
				ДанныеДляПередачиPrimaryContact.Вставить("MiddleName",	ДокЗаказНаряд.Заказчик.Отчество);
			Иначе
				ДанныеДляПередачиPrimaryContact.Вставить("LastName",	"");
				ДанныеДляПередачиPrimaryContact.Вставить("Name",		ДокЗаказНаряд.Заказчик.НаименованиеПолное);
				ДанныеДляПередачиPrimaryContact.Вставить("MiddleName",	"");
			КонецЕсли;
			ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformation",		"1");
			ДанныеДляПередачиPrimaryContact.Вставить("consentProcessingPersonalInformationDate",	Формат(ТекущаяДатаСеанса(),"ДФ=dd.MM.yyyy"));
			Если ДокЗаказНаряд.Заказчик.БТ_ОтказОтКоммуникации = Истина Тогда
				ДанныеДляПередачиPrimaryContact.Вставить("consentObtainingSmsMailing",					"0");
				ДанныеДляПередачиPrimaryContact.Вставить("consentConductSurveys",						"0");	
			Иначе
				ДанныеДляПередачиPrimaryContact.Вставить("consentObtainingSmsMailing",					"1");
				ДанныеДляПередачиPrimaryContact.Вставить("consentConductSurveys",						"1");
			КонецЕсли;
			
			ДанныеДляПередачиPrimaryContact.Вставить("Phones",		ТелефоныКлиента);
		КонецЕсли;
		ДанныеДляПередачиClient.Вставить("PrimaryContact", ДанныеДляПередачиPrimaryContact);
		// КОВАЛЬ 14.03.2025 SDK 000000787 --
		
		////
		Если ДанныеДляПередачиClient.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Client",ДанныеДляПередачиClient);
		КонецЕсли;
		
		////Список Авто
		//ДанныеДляПередачиCar = Новый ТаблицаЗначений();
		ДанныеДляПередачиCar = Новый Структура();
		
		ДанныеДляПередачиCar.Вставить("DataType", ДокЗаказНаряд.Автомобиль.Метаданные().Синоним);
		ДанныеДляПередачиCar.Вставить("Id", CRM_Имя+""+ДокЗаказНаряд.Автомобиль.Код);
		ДанныеДляПередачиCar.Вставить("VIN",  ДокЗаказНаряд.Автомобиль.VIN);
		
		ДанныеДляПередачиModel = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.Модель.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Автомобиль.Модель.Код,ДокЗаказНаряд.Автомобиль.Модель.Наименование);
		
		ДанныеДляПередачиCar.Вставить("Model", ДанныеДляПередачиModel);
		
		стрГосНомер = "";
		ГосНомер = ПолучитьИнфоПоАвто(ДокЗаказНаряд.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если ГосНомер.Следующий() Тогда
			стрГосНомер = ГосНомер.Значение;
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("RegNum", стрГосНомер);
		
		стрПробег = "";
		Пробег = ПолучитьИнфоПоАвто(ДокЗаказНаряд.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		Если Пробег.Следующий() Тогда
			стрПробег = Пробег.Значение;
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("Mileage", стрПробег);
		////
		Если ЗначениеЗаполнено(ДокЗаказНаряд.Автомобиль.ГодВыпуска) Тогда
			ДанныеДляПередачиCar.Вставить("ProductionYear", Год(ДокЗаказНаряд.Автомобиль.ГодВыпуска));
		иначе
			ДанныеДляПередачиCar.Вставить("ProductionYear", "");
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("WarrantyStart",Формат(ДокЗаказНаряд.Автомобиль.ДатаНачалаГарантии,"ДФ=dd.MM.yyyy"));
		ДанныеДляПередачиCar.Вставить("WarrantyEnd",Формат(ДокЗаказНаряд.Автомобиль.ДатаОкончанияГарантии,"ДФ=dd.MM.yyyy"));
		
		////двигатель
		ДанныеДляПередачиcarEngine = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.ТипДвигателя.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Автомобиль.ТипДвигателя.Код,ДокЗаказНаряд.Автомобиль.ТипДвигателя.Наименование);
		ДанныеДляПередачиCar.Вставить("Engine", ДанныеДляПередачиcarEngine);
		
		
		//КПП
		ДанныеДляПередачиcarTransmission = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.ТипКПП.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Автомобиль.ТипКПП.Код,ДокЗаказНаряд.Автомобиль.ТипКПП.Наименование);
		
		ДанныеДляПередачиCar.Вставить("Transmission", ДанныеДляПередачиcarTransmission);
		
		//////Цвет
		ДанныеДляПередачиcarColor = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.Цвет.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Автомобиль.Цвет.Код,ДокЗаказНаряд.Автомобиль.Цвет.Наименование);
		
		ДанныеДляПередачиCar.Вставить("Color",  ДанныеДляПередачиcarColor);
		
		Если ДанныеДляПередачиCar.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Car",ДанныеДляПередачиCar);
		КонецЕсли;
		
		////Работы
		ДанныеДляПередачиWorkType = Новый ТаблицаЗначений();
		ДанныеДляПередачиWorkType.Колонки.Добавить("DataType");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Id");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Type");
		ДанныеДляПередачиWorkType.Колонки.Добавить("StandardTime");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Price");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Quantity");
		
		ДанныеДляПередачиWorkType.Колонки.Добавить("DiscountPercent");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Sum");
		
		
		Для Каждого СтрРаботы из ДокЗаказНаряд.Работы цикл
			НоваяСтрокаДанныеДляПередачиWorkType = ДанныеДляПередачиWorkType.Добавить();
			НоваяСтрокаДанныеДляПередачиWorkType.DataType = "Работы заказ-наряда";
			НоваяСтрокаДанныеДляПередачиWorkType.Id       = CRM_Имя+""+СтрРаботы.НомерСтроки;
			
			СтруктураWorkType = Новый Структура();
			СтруктураWorkType.Вставить("DataType",СтрРаботы.Работа.Метаданные().Синоним);
			СтруктураWorkType.Вставить("Id",CRM_Имя+""+СтрРаботы.Работа.Код);
			СтруктураWorkType.Вставить("Name",СтрРаботы.Работа.Наименование);
			СтруктураWorkType.Вставить("StandardTime",Формат(СтрРаботы.Работа.ВремяВыполнения,"ЧЦ=10; ЧДЦ=2"));
			СтруктураWorkType.Вставить("Code",СтрРаботы.Работа.Артикул);
			
			НоваяСтрокаДанныеДляПередачиWorkType.Type            = СтруктураWorkType;
			НоваяСтрокаДанныеДляПередачиWorkType.Quantity        = Формат(СтрРаботы.Количество,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.DiscountPercent = Формат(СтрРаботы.ПроцентСкидки,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.Sum             = Формат(СтрРаботы.СуммаВсего,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.StandardTime    = Формат(СтрРаботы.Коэффициент,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.Price           = Формат(СтрРаботы.Цена,"ЧЦ=10; ЧДЦ=2");
		КонецЦикла;
		
		Если ДанныеДляПередачиWorkType.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Works",ДанныеДляПередачиWorkType);
		КонецЕсли;
		
		ДанныеДляПередачиMaterials = Новый ТаблицаЗначений();
		ДанныеДляПередачиMaterials.Колонки.Добавить("DataType");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Id");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Type");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Price");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Quantity");
		ДанныеДляПередачиMaterials.Колонки.Добавить("DiscountPercent");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Sum");
		Если ДокЗаказНаряд.Товары.Количество()>0 Тогда
			Для Каждого СтрЗапЧасти из ДокЗаказНаряд.Товары цикл
				НоваяСтрокаДанныеДляПередачиMaterials = ДанныеДляПередачиMaterials.Добавить();
				НоваяСтрокаДанныеДляПередачиMaterials.DataType = "Материалы заказ-наряда";
				НоваяСтрокаДанныеДляПередачиMaterials.Id       = CRM_Имя+""+СтрЗапЧасти.НомерСтроки;
				
				СтруктураMaterialsType = Новый Структура();
				СтруктураMaterialsType.Вставить("DataType",СтрЗапЧасти.Номенклатура.Метаданные().Синоним);
				СтруктураMaterialsType.Вставить("Id",CRM_Имя+""+СтрЗапЧасти.Номенклатура.Код);
				СтруктураMaterialsType.Вставить("Name",СтрЗапЧасти.Номенклатура.Наименование);
				СтруктураMaterialsType.Вставить("Code",СтрЗапЧасти.Номенклатура.Артикул);
				
				//
				НоваяСтрокаДанныеДляПередачиMaterials.Type     = СтруктураMaterialsType;
				НоваяСтрокаДанныеДляПередачиMaterials.Quantity = Формат(СтрЗапЧасти.Количество,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.DiscountPercent =  Формат(СтрЗапЧасти.ПроцентСкидки,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.Sum      = Формат(СтрЗапЧасти.СуммаВсего,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.Price    = Формат(СтрЗапЧасти.Цена,"ЧЦ=10; ЧДЦ=2");
			КонецЦикла;
		иначе
		КонецЕсли;
		
		Если ДанныеДляПередачиMaterials.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Materials",ДанныеДляПередачиMaterials);
		КонецЕсли;
		
		////Этапы
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			
			ДанныеДляПередачиStage = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Состояние.Метаданные().Синоним,CRM_Имя+""+ДокЗаказНаряд.Состояние.Код,ДокЗаказНаряд.Состояние.Наименование);
		Иначе
			ДанныеДляПередачиStage = Новый Структура("DataType,Id,Name","Состояния заказ-нарядов","Заявка на ремонт","Заявка на ремонт");
		КонецЕсли;
		
		
		Если ДанныеДляПередачиStage.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Stage",ДанныеДляПередачиStage);
		КонецЕсли;
		
		
		
		
		ДанныеДляПередачиBodyСтрокой = jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
		
		ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
		
		
		СтрокаОтправки = jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
		
		ПараметрыПодключения = ПолучитьСтруктуруПараметров();
		
		ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
		
		ПараметрыПодключения.Ресурс            = Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
		
		//ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
		
		
		//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
		//	ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
		//КонецЕсли; 
		
		ПараметрыПодключения.Логин = Настройка.Логин;
		ПараметрыПодключения.Пароль = Настройка.Пароль;
		ПараметрыПодключения.Токен = Настройка.Токен;

		
		//<<Павличенко 10.03.2020
		//Если Справочники.CRM_НастройкаПодключения.ИспользоватьWinHttp.ДопЗначение Тогда
		//	ПослатьPOSTЗапрос(ПараметрыПодключения)	
		//иначе
		
		//БИЗТЕХ КОВАЛЬ ++ Создание контрагента перед выгружкой заказ-наряда
		ДанныеКонтрагента = новый Структура;
		Если ДокЗаказНаряд.Заказчик.ФормаСобственности =  Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			ДанныеКонтрагента.Вставить("firstName", ДокЗаказНаряд.Заказчик.Имя); 
		иначе
			ДанныеКонтрагента.Вставить("firstName",ДокЗаказНаряд.Заказчик.НаименованиеПолное);
		КонецЕсли;
		ДанныеКонтрагента.Вставить("email", стрEmail);
		ДанныеКонтрагента.Вставить("phones", ТелефоныКлиента);
		
		СтрокаОтправки = jsonЗаписатьИнициализация(ДанныеКонтрагента, Ложь, Ложь);
		ПараметрыПодключенияКонтрагент = ПолучитьСтруктуруПараметров();
		ПараметрыПодключенияКонтрагент.СтрокаДляОтправки = СтрокаОтправки;
		Если ДокЗаказНаряд.Заказчик.ФормаСобственности =  Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			ПараметрыПодключенияКонтрагент.Ресурс            = "/yii/api/client?type=individual"; 
		иначе
			ПараметрыПодключенияКонтрагент.Ресурс            = "/yii/api/client?type=business";
		КонецЕсли;
		Ответ = ВыполнитьHTTPЗапросОтправить(ПараметрыПодключенияКонтрагент);
		// --
		
		
		
		
		
			ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения);
		//КонецЕсли;
		//>>Павличенко 10.03.2020
		Сообщить("Передано в CRM");	
	исключение
		Сообщить("CRM_Заказ-наряд ошибка при обработке данных!!!");
	КонецПопытки;
	
	//БИЗТЕХ КОВАЛЬ 03.09.2024 ++
	//Обновление у контрагента данных о согласии на ОПД и согласие на проведение опросов.
	Попытка
		ОбновитьДанныеКонтрагента(Настройка,ДокЗаказНаряд.Заказчик)
	Исключение
	КонецПопытки;
	//БИЗТЕХ КОВАЛЬ 03.09.2024 --
		
	//КонецЕсли;
КонецПроцедуры	

//<<Павличенко 10.03.2020
//Процедура CRM_ПриЗаписиЗаказНарядаПриЗаписи(Источник, Отказ) Экспорт
//	Попытка
//		Если обПраво("АвтодилерВыгрузкаВCRM") Тогда
//			Если Справочники.CRM_НастройкаПодключения.ВыгружатьЗНВCRM.ДопЗначение Тогда
//				//по видам ремонта
//				
//				ЗапросВР = Новый запрос();
//				ЗапросВР.УстановитьПараметр("парВидРемонта",Источник.ВидРемонта);
//				ЗапросВР.Текст = "ВЫБРАТЬ
//				|	CRM_НастройкиПодключенияПоСалонамПодразделения.ВидРемонта
//				|ИЗ
//				|	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
//				|ГДЕ
//				|	CRM_НастройкиПодключенияПоСалонамПодразделения.ВидРемонта = &парВидРемонта
//				|	И НЕ CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.ПометкаУдаления";
//				
//				РезультатВР = ЗапросВР.Выполнить().Выбрать();
//				Если РезультатВР.Следующий() Тогда
//					//ОбработатьДанныеЗаказНаряда(Источник.Ссылка);
//					//
//				иначе
//					ЗапросВР = Новый запрос();
//					ЗапросВР.Текст = "ВЫБРАТЬ
//					|	CRM_НастройкиПодключенияПоСалонамПодразделения.ВидРемонта
//					|ИЗ
//					|	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
//					|ГДЕ
//					|	НЕ CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.ПометкаУдаления";
//					
//					РезультатВР = ЗапросВР.Выполнить().Выбрать();
//					Если РезультатВР.Количество()=0 Тогда
//						//ОбработатьДанныеЗаказНаряда(Источник.Ссылка);
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//	Исключение
//		Сообщить("_Произошла ошибка! Не удалось передать документ в CRM-систему!!!");
//	КонецПопытки;
//КонецПроцедуры
//>>Павличенко 10.03.2020

//Заполнение 01.05.2017
Функция ПолучитьКонтрагента(СтруктураКлиент, Тип)
	
	Если Найти(Тип, "individual")<>0 Тогда
		
		СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
		МассивТелефоны   =  СтруктураФизЛицо.phones;
		
		црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
		
		//по номеру телефона
		Для каждого Эл из МассивТелефоны Цикл
			//Учесть +,7,8
			Если ЗначениеЗаполнено(Эл.number) Тогда
				црмКонтрагент = црмРаботаСсоединением.НайтиПоНомеруТелефона(Эл.number);
				Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
					Сообщить("Найден контрагент по номеру телефона: "+црмКонтрагент);
					Контрагент = црмКонтрагент; 
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			
			НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			
			Фамилия     = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.lastName);
			Имя         = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.firstName);
			Отчество    = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.middleName);
			
			Пол         = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.gender);
			ДатаРожд    = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.birthday);
			
			НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
			НовКонтрагент.Наименование = Фамилия+" "+Имя+" "+Отчество;
			НовКонтрагент.НаименованиеПолное = Фамилия+" "+Имя+" "+Отчество;
			//Корректировка 01.06.2017
			НовКонтрагент.црмИД   = СтруктураФизЛицо.id;
			НовКонтрагент.Фамилия = Фамилия;
			НовКонтрагент.Имя     = Имя;
			НовКонтрагент.Отчество = Отчество;
			
			Если ЗначениеЗаполнено(Пол) Тогда
				НовКонтрагент.Пол = ?(Пол="M",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский);
			иначе
				Если Найти(нрег(Прав(Отчество,3)),"вич") Тогда
					НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
				иначеЕсли Найти(нрег(Прав(Отчество,3)),"вна") Тогда
					НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
				КонецЕсли;
			КонецЕсли;
			
			ДатаРождения = црмРаботаСсоединением.ПреобразоватьСтрокуВДату(ДатаРожд);
			
			НовКонтрагент.ДатаРождения = ДатаРождения; 
			НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 
			НовКонтрагент.УстановитьНовыйКод();
			НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных =  Перечисления.ВариантыОтветов.Спрашивать;
			НовКонтрагент.Записать();
			
			Контрагент = НовКонтрагент.Ссылка;
			
			email       = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.email);
			
			Если ЗначениеЗаполнено(email) Тогда
				СтруктураЗаписи = новый структура();
				СтруктураЗаписи.Вставить("Объект",Контрагент);
				СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
				СтруктураЗаписи.Вставить("Представление",email);
				црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
			КонецЕсли;
			
			Если СтруктураФизЛицо.Свойство("address") Тогда 
				СтруктураАдрес = СтруктураФизЛицо.address;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				
				СтруктураАдрес = СтруктураФизЛицо.address;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
				
				СтруктураАдрес = СтруктураФизЛицо.address;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
			КонецЕсли;
			
			
			//Вод.удостоверение
			ВодПраваНомер      = СтруктураФизЛицо.driverLicenseNumber;
			ВодПраваВыданы     = СтруктураФизЛицо.driverLicenseIssuedAt;
			ВодПраваДатаВыдачи = СтруктураФизЛицо.driverLicenseIssuedBy;
			
			//Паспорт
			//корректировка 11.08.2017

			Паспорт_Серия      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportSeries);
			Паспорт_Номер      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportNumber);
			Паспорт_ДатаВыдачи = ПреобразоватьСтрокуВДату(УбратьКавычки(СтруктураФизЛицо.passportIssuedAt));
			
			Паспорт_Выдан      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportIssuedBy);
			ПаспортКодПодразд  = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportDepartmentCode);
			
			Если ЗначениеЗаполнено(Паспорт_Серия) и ЗначениеЗаполнено(Паспорт_Номер)
				и ЗначениеЗаполнено(Паспорт_Выдан) и ЗначениеЗаполнено(Паспорт_ДатаВыдачи) Тогда
				НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
				//Корректировка 01.06.2017
				НовыйПодтверждающийДокумент.Владелец = Контрагент;
				НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
				НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
				НовыйПодтверждающийДокумент.Серия = Паспорт_Серия;
				НовыйПодтверждающийДокумент.Номер = Паспорт_Номер;
				НовыйПодтверждающийДокумент.ДатаВыдачи = Паспорт_ДатаВыдачи;
				НовыйПодтверждающийДокумент.КемВыдан =  Паспорт_Выдан;
				НовыйПодтверждающийДокумент.Текущий = Истина;
				НовыйПодтверждающийДокумент.Наименование = НовыйПодтверждающийДокумент.СформироватьНаименование();
				НовыйПодтверждающийДокумент.Записать();

			КонецЕсли;
			//корректировка 11.08.2017
						
			Для каждого Эл из МассивТелефоны Цикл
				СтруктураЗаписи = новый структура();
				
				ОсновнойТелефон = Эл.number;
				ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
				Если ТипТелефона = "1" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
				иначеЕсли ТипТелефона = "2" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
				иначеЕсли ТипТелефона = "3" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
				иначеЕсли ТипТелефона = "4" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
				КонецЕсли;
				
				СтруктураЗаписи.Вставить("Объект",Контрагент);
				СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
				
				СтруктураЗаписи.Вставить("Вид",ВидТелефона);
				СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
				
				
				КодСтраны = Лев(ОсновнойТелефон,1);
				СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
				
				КодГорода = Сред(ОсновнойТелефон,2,3);
				СтруктураЗаписи.Вставить("Поле2",КодГорода);
				
				НомерТелефона = Сред(ОсновнойТелефон,5);
				СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
				
				СтруктураЗаписи.Вставить("Представление","+"+КодСтраны+"("+КодГорода+")"+НомерТелефона);
				црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
				ОбКонтрагент = Контрагент.ПолучитьОбъект();
				ОбКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
				
				ОбКонтрагент.Записать();
			КонецЕсли;
		КонецЕсли;
	иначеЕсли Найти(Тип, "business")<>0 Тогда
		
		црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
		Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
		
		
		СтруктураОрганизация =  СтруктураКлиент.company;
		
		НаименованиеКомпании = СтруктураОрганизация.name;
		email  = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.email);
		ИНН    = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.inn);
		КПП    = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.kpp);
		ОКПО   = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.ogrn); 
		
		
		МассивТелефоны  = СтруктураОрганизация.phones;
		СписокКонтактов = СтруктураКлиент.persons;
		
		//1.Поискать по ОКПО
		Если ЗначениеЗаполнено(ОКПО) Тогда
			ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО",ОКПО);
		КонецЕсли;
		
		//2.Поискать по КПП
		Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() и 
			ЗначениеЗаполнено(КПП) Тогда
			ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КПП",КПП);
		КонецЕсли;
		
		//3.По номеру телефона
		Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			//Учесть +,7,8
			Для каждого Эл из МассивТелефоны Цикл
				Если ЗначениеЗаполнено(Эл.number) Тогда
					црмКонтрагент = црмРаботаСсоединением.НайтиПоНомеруТелефона(Эл.number);
					Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						Сообщить("Найден контрагент по номеру телефона: "+црмКонтрагент);
						Контрагент = црмКонтрагент; 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		иначе
			Контрагент = црмКонтрагент;
		КонецЕсли;
		
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
			//Создаем
			НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			//Корректировка 01.06.2017
			НовКонтрагент.црмИД   = СтруктураФизЛицо.id;
			НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			НовКонтрагент.Наименование       = НаименованиеКомпании;
			НовКонтрагент.НаименованиеПолное = НаименованиеКомпании;
			НовКонтрагент.КодПоОКПО          = ОКПО;
			НовКонтрагент.КПП                = КПП;
			НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
			
			НовКонтрагент.УстановитьНовыйКод();
			НовКонтрагент.Записать();
			
			Контрагент = НовКонтрагент.Ссылка;
			
			Если СтруктураОрганизация.Свойство("address") Тогда 
				СтруктураАдрес = СтруктураОрганизация.address;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				
				СтруктураАдрес = СтруктураОрганизация.address;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
				Если Не СтруктураОрганизация.Свойство("juridicalAddress") Тогда
					СтруктураАдрес = СтруктураОрганизация.address;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
				КонецЕсли;
			КонецЕсли;
			Если СтруктураОрганизация.Свойство("juridicalAddress") Тогда 
				СтруктураАдрес = СтруктураОрганизация.juridicalAddress;
				ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
			КонецЕсли;
			Для каждого Эл из МассивТелефоны Цикл
				СтруктураЗаписи = новый структура();
				
				ОсновнойТелефон = Эл.number;
				ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
				Если ТипТелефона = "1" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
				иначеЕсли ТипТелефона = "2" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
				иначеЕсли ТипТелефона = "3" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
				иначеЕсли ТипТелефона = "4" Тогда
					ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
				КонецЕсли;
				
				СтруктураЗаписи.Вставить("Объект",Контрагент);
				СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
				
				СтруктураЗаписи.Вставить("Вид",ВидТелефона);
				СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
				
				
				КодСтраны = Лев(ОсновнойТелефон,1);
				СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
				
				КодГорода = Сред(ОсновнойТелефон,2,3);
				СтруктураЗаписи.Вставить("Поле2",КодГорода);
				
				НомерТелефона = Сред(ОсновнойТелефон,5);
				СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
				
				СтруктураЗаписи.Вставить("Представление","+"+КодСтраны+"("+КодГорода+")"+НомерТелефона);
				црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
				ОбКонтрагент = Контрагент.ПолучитьОбъект();
				ОбКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
				ОбКонтрагент.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Контрагент;
КонецФункции

Функция ПолучитьАвтомобиль(СтруктураАвто, Контрагент, ОбДокумент)
		
	VIN           = ?(СтруктураАвто.Свойство("vin"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.vin),"");
	
	ГосНомер      = ?(СтруктураАвто.Свойство("reg_number"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.reg_number),"");
	
	ГодВыпуска    = ?(СтруктураАвто.Свойство("production_year"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.production_year),"");
	ГодВыпуска    = ?(СтруктураАвто.Свойство("productionYear"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.productionYear),"");
	Пробег        = ?(СтруктураАвто.Свойство("mileage"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.mileage),0);
	ИДАвтом       = ?(СтруктураАвто.Свойство("id"),црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.id),"");
	
	НовАвто = Справочники.Автомобили.СоздатьЭлемент();
	НовАвто.УстановитьНовыйКод();
	Если Не ЗначениеЗаполнено(VIN) Тогда
		Сообщить("В CRM системе у авто не заполнен VIN!!!");
	КонецЕсли;
	НовАвто.VIN = VIN;

	СтруктураМодель = ?(СтруктураАвто.Свойство("model"),СтруктураАвто.model,"");
	Если ЗначениеЗаполнено(СтруктураМодель) Тогда
		ИдМодели      = црмРаботаСсоединением.УбратьКавычки(СтруктураМодель.id);
		НаименованиеМодели      = црмРаботаСсоединением.УбратьКавычки(СтруктураМодель.name);
		ЭлМодель = Справочники.Модели.НайтиПоНаименованию(СокрЛП(НаименованиеМодели));
		Если ЭлМодель = Справочники.Модели.ПустаяСсылка() Тогда
			
			НовМодель = справочники.Модели.СоздатьЭлемент();
			
			НовМодель.Наименование       = НаименованиеМодели;
			НовМодель.НаименованиеПолное = НаименованиеМодели;
			НовМодель.ВалютаУчета        = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			Если Не ЗначениеЗаполнено(НовМодель.ВалютаУчета) Тогда
				НовМодель.ВалютаУчета        = Справочники.Валюты.НайтиПоНаименованию("1");	
			КонецЕсли;
			
			
			НовМодель.УстановитьНовыйКод();
			НовМодель.Записать();
			ЭлМодель = НовМодель.Ссылка;
			Сообщить("Внимание! При создании а/м была создана модель! Дополните информацию по модели!");
		Иначе
			ЭлМодель = Справочники.Модели.ПустаяСсылка();
		КонецЕсли;
		НовАвто.Модель = ЭлМодель.Ссылка;
	иначе
		НовАвто.Модель = Справочники.Модели.ПустаяСсылка();	
	КонецЕсли;
	
	НовАвто.ВалютаУчета = НовАвто.Модель.ВалютаУчета;
	
	Попытка
		Если ЗначениеЗаполнено(ГодВыпуска) Тогда
			НовАвто.ГодВыпуска         = Дата(ГодВыпуска+"0101");
		КонецЕсли;
	исключение
	КонецПопытки;
	Наименование = "";
	Если ЗначениеЗаполнено(НовАвто.Модель) Тогда
		Наименование=Наименование+СокрЛП(НовАвто.Модель.Наименование);
	КонецЕсли;
	Если ЗначениеЗаполнено(ГосНомер) Тогда
		Если НЕ ПустаяСтрока(Наименование) Тогда Наименование=Наименование+" "; КонецЕсли; 
		Наименование=Наименование+"№ "+СокрЛП(ГосНомер);
	КонецЕсли;
	Если ЗначениеЗаполнено(VIN) Тогда
		Если НЕ ПустаяСтрока(Наименование) Тогда Наименование=Наименование+" "; КонецЕсли;  
		Наименование=Наименование+"VIN "+СокрЛП(VIN);
	КонецЕсли;
	Если НЕ ПустаяСтрока(Наименование) Тогда НовАвто.Наименование=Наименование; КонецЕсли; 
	НовАвто.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
	НовАвто.Записать();
	НачалоТекущегоДня = НачалоДня(ТекущаяДата());
	
	ЗаписьЗначенияРегистраСведения(Контрагент,Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин,НовАвто,,ОбДокумент);
	Если ЗначениеЗаполнено(ГосНомер) Тогда
		ЗаписьЗначенияРегистраСведения(ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,НовАвто,,ОбДокумент);
	КонецЕсли;
	
	Возврат НовАвто;
	
КонецФункции

Процедура ЗаписатьАдрес(СтруктураАдрес, Контрагент, ВидКИ) 
	
	Адрес = "";
	zip_code =  УбратьКавычки(СтруктураАдрес.zipCode);
	address  =  УбратьКавычки(СтруктураАдрес.region);
	city     =  УбратьКавычки(СтруктураАдрес.city);
	street   =  УбратьКавычки(СтруктураАдрес.street);
	house    =  УбратьКавычки(СтруктураАдрес.house);
	building =  УбратьКавычки(СтруктураАдрес.building);
	apartment = УбратьКавычки(СтруктураАдрес.apartment); 
	
	Адрес = ?(НЕ ЗначениеЗаполнено(zip_code),"",zip_code);
	Адрес = ?(НЕ ЗначениеЗаполнено(address),", ",address);
	Адрес = ?(НЕ ЗначениеЗаполнено(city),Адрес,Адрес+", "+city);
	Адрес = ?(НЕ ЗначениеЗаполнено(street),Адрес,Адрес+", "+street);
	Адрес = ?(НЕ ЗначениеЗаполнено(house),Адрес,Адрес +", д."+house);
	Адрес = ?(НЕ ЗначениеЗаполнено(building),Адрес,Адрес +", крп."+building);
	Адрес = ?(НЕ ЗначениеЗаполнено(apartment),Адрес,Адрес +", кв."+apartment);
	
	Если адрес<>"" Тогда
		
		СтруктураЗаписи = новый структура();
		СтруктураЗаписи.Вставить("Объект",Контрагент);
		СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Адрес);
		СтруктураЗаписи.Вставить("Вид",ВидКИ);
		СтруктураЗаписи.Вставить("Представление",Адрес);
		СтруктураЗаписи.Вставить("Поле1",zip_code);
		СтруктураЗаписи.Вставить("Поле2",address);
		СтруктураЗаписи.Вставить("Поле4",city);
		СтруктураЗаписи.Вставить("Поле6",street);
		СтруктураЗаписи.Вставить("Поле7",house);
		СтруктураЗаписи.Вставить("Поле8",building);
		СтруктураЗаписи.Вставить("Поле9",apartment);
		
		ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтруктуруЗаполнитьРеквизиты(СтруктураРезультата, ОбДокумент,ОбДокументФорма) Экспорт
	
	
	ОбДокумент.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.Заказчик   = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	ОбДокумент.Работы.Очистить();
	
	
	НовДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если СтруктураРезультата.success Тогда
		
		
		црмРезультат = СтруктураРезультата.result;
		
		СтруктураКлиент = црмРезультат.generalClient;
		
		
		СтруктураАвто = црмРезультат.clientVehicle;
		VIN           = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.vin);
		ГосНомер      = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.reg_number);
		ГодВыпуска    = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.production_year);
		Пробег        = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.mileage);
		ИДАвтом       = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.id);
		
		СтруктураМодель = СтруктураАвто.model;
		ИдМодели      = црмРаботаСсоединением.УбратьКавычки(СтруктураМодель.id);
		НаименованиеМодели      = црмРаботаСсоединением.УбратьКавычки(СтруктураМодель.name);
		
		
		Авто = Справочники.Автомобили.ПустаяСсылка();
		Если ЗначениеЗаполнено(VIN) Тогда
			ЗапросАвто = новый Запрос();
			ЗапросАвто.УстановитьПараметр("парVin",СокрЛП(VIN));
			ЗапросАвто.Текст = "ВЫБРАТЬ
			                   |	Авто.Ссылка КАК Ссылка,
			                   |	Авто.VIN КАК VIN
			                   |ИЗ
			                   |	Справочник.Автомобили КАК Авто
			                   |ГДЕ
			                   |	НЕ Авто.ПометкаУдаления
			                   |	И НЕ Авто.ЭтоГруппа
			                   |	И Авто.VIN = &парVin";
			
			РезАвто = ЗапросАвто.Выполнить().Выбрать();
			Если РезАвто.Следующий() Тогда
				Авто = РезАвто.Ссылка;	
			КонецЕсли;
		КонецЕсли;
		
		Если Авто = Справочники.Автомобили.ПустаяСсылка() и ЗначениеЗаполнено(ГосНомер) Тогда
			ЗапросАвто = новый Запрос();
			ЗапросАвто.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
			ЗапросАвто.УстановитьПараметр("парГосНомер",ГосНомер);
			
			ЗапросАвто.Текст = "ВЫБРАТЬ
			                   |	Авто.Ссылка КАК Ссылка,
			                   |	Авто.VIN КАК VIN,
			                   |	РС.Значение КАК ГосНомер
			                   |ИЗ
			                   |	Справочник.Автомобили КАК Авто
			                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК РС
			                   |		ПО (РС.Автомобиль = Авто.Ссылка)
			                   |ГДЕ
			                   |	НЕ Авто.ПометкаУдаления
			                   |	И НЕ Авто.ЭтоГруппа
			                   |	И РС.Значение = &парГосНомер";
			
			
			РезАвто = ЗапросАвто.Выполнить().Выбрать();
			Если РезАвто.Следующий() Тогда
				Авто = РезАвто.Ссылка;	
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураКлиент = црмРезультат.generalClient;
		
		ИдКлиента = СтруктураКлиент.id;
		
		Тип             = црмРаботаСсоединением.УбратьКавычки(СтруктураКлиент.type);
		
		Если Найти(Тип, "individual")<>0 Тогда
			
			СтруктураФизЛицо =  СтруктураКлиент.primaryPerson;
			МассивТелефоны   =  СтруктураФизЛицо.phones;
			
			црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
			
			//по номеру телефона
			Для каждого Эл из МассивТелефоны Цикл
				//Учесть +,7,8
				Если ЗначениеЗаполнено(Эл.number) Тогда
					црмКонтрагент = црмРаботаСсоединением.НайтиПоНомеруТелефона(Эл.number);
					Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						Сообщить("Найден контрагент по номеру телефона: "+црмКонтрагент);
						Контрагент = црмКонтрагент; 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			//по авто
			
			Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				//Создадим нового
				
				НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				
				Фамилия     = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.lastName);
				Имя         = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.firstName);
				Отчество    = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.middleName);
				
				Пол         = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.gender);
				ДатаРожд    = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.birthday);
				
				НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
				НовКонтрагент.Наименование = Фамилия+" "+Имя+" "+Отчество;
				НовКонтрагент.НаименованиеПолное = Фамилия+" "+Имя+" "+Отчество;
				
				НовКонтрагент.Фамилия = Фамилия;
				НовКонтрагент.Имя     = Имя;
				НовКонтрагент.Отчество = Отчество;
				
				//НовКонтрагент.црмИД = ИдКлиента; 
				
				Если ЗначениеЗаполнено(Пол) Тогда
					НовКонтрагент.Пол = ?(Пол="M",Перечисления.ПолФизическихЛиц.Мужской,Перечисления.ПолФизическихЛиц.Женский);
				иначе
					Если Найти(нрег(Прав(Отчество,3)),"вич") Тогда
						НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
					иначеЕсли Найти(нрег(Прав(Отчество,3)),"вна") Тогда
						НовКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
					КонецЕсли;
				КонецЕсли;
				
				ДатаРождения = црмРаботаСсоединением.ПреобразоватьСтрокуВДату(ДатаРожд);
				
				НовКонтрагент.ДатаРождения = ДатаРождения; 
				НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель; 
				НовКонтрагент.СогласиеНаОбработкуПерсональныхДанных =  Перечисления.ВариантыОтветов.Спрашивать;
				НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.НайтиПоНаименованию("Клиент сервиса");
				НовКонтрагент.УстановитьНовыйКод();
				Если МассивТелефоны.Количество()<> 0 Тогда
					ОсновнойТелефон = МассивТелефоны[0].number;
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					КодГорода = Сред(ОсновнойТелефон,2,3);
					НомерТелефона = Сред(ОсновнойТелефон,5);
					
					НовКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
					
				КонецЕсли;
				
				НовКонтрагент.Записать();
				
				#Если Клиент Тогда
				//Договор
				Если Вопрос("Создан новый контрагент. Создать договор?",РежимДиалогаВопрос.ДаНет,15,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
					НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
					НовДоговор.Владелец      = НовКонтрагент.Ссылка;
					НовДоговор.Подразделение = ОбДокумент.ПодразделениеКомпании;
					НовДоговор.Автор         = ПараметрыСеанса.Пользователь;
					НовДоговор.ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
					НовДоговор.ВалютаВзаиморасчетов = обДокумент.ВалютаДокумента;
					НовДоговор.ВидОплаты     =  Перечисления.ВидыОплаты.ПроизвольнаяОплата;
					НовДоговор.ДатаНачала    = ТекущаяДата();
					НовДоговор.ДатаСоздания  = ТекущаяДата();
					НовДоговор.Организация   = Справочники.Организации.ОсновнаяОрганизация;
					НовДоговор.ДляАвтосервиса = Истина;
					НовДоговор.ТипДоговора   = Перечисления.ТипыДоговоров.Договор;
					НовДоговор.СформироватьНаименование();
					НовДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
					НовДоговор.Записать();
				КонецЕсли;
				#КонецЕсли
				
				
				Контрагент = НовКонтрагент.Ссылка;
				
				email       = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.email);
				
				Если ЗначениеЗаполнено(email) Тогда
					СтруктураЗаписи = новый структура();
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
					СтруктураЗаписи.Вставить("Представление",email);
					црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
				КонецЕсли;
				
				Если СтруктураФизЛицо.Свойство("address") Тогда 
					СтруктураАдрес = СтруктураФизЛицо.address;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				КонецЕсли;
						//Вод.удостоверение
				ВодПраваНомер      = СтруктураФизЛицо.driverLicenseNumber;
				ВодПраваВыданы     = СтруктураФизЛицо.driverLicenseIssuedAt;
				ВодПраваДатаВыдачи = СтруктураФизЛицо.driverLicenseIssuedBy;
				
				//Паспорт
				Паспорт_Серия      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportSeries);
				Паспорт_Номер      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportNumber);
				Паспорт_ДатаВыдачи = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportIssuedAt);
				Паспорт_Выдан      = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportIssuedBy);
				ПаспортКодПодразд  = црмРаботаСсоединением.УбратьКавычки(СтруктураФизЛицо.passportDepartmentCode);
				
				Если ЗначениеЗаполнено(Паспорт_Серия) и ЗначениеЗаполнено(Паспорт_Номер)
					и ЗначениеЗаполнено(Паспорт_Выдан) и ЗначениеЗаполнено(Паспорт_ДатаВыдачи) Тогда
					НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
					НовыйПодтверждающийДокумент.Владелец = Контрагент;
					НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
					НовыйПодтверждающийДокумент.Серия = Паспорт_Серия;
					НовыйПодтверждающийДокумент.Номер = Паспорт_Номер;
					НовыйПодтверждающийДокумент.ДатаВыдачи = Паспорт_ДатаВыдачи;
					НовыйПодтверждающийДокумент.КемВыдан =  Паспорт_Выдан;
					НовыйПодтверждающийДокумент.УстановитьНовыйКод();
					НовыйПодтверждающийДокумент.Записать();
				КонецЕсли;
				
				Для каждого Эл из МассивТелефоны Цикл
					СтруктураЗаписи = новый структура();
					
					ОсновнойТелефон = Эл.number;
					ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
					Если ТипТелефона = "1" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
					иначеЕсли ТипТелефона = "2" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
					иначеЕсли ТипТелефона = "3" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
					иначеЕсли ТипТелефона = "4" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
					КонецЕсли;
					
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
					
					СтруктураЗаписи.Вставить("Вид",ВидТелефона);
					СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
					
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
					
					КодГорода = Сред(ОсновнойТелефон,2,3);
					СтруктураЗаписи.Вставить("Поле2",КодГорода);
					
					НомерТелефона = Сред(ОсновнойТелефон,5);
					СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
					
					СтруктураЗаписи.Вставить("Представление","+"+КодСтраны+"("+КодГорода+")"+НомерТелефона);
					црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
					ОбКонтрагент = Контрагент.ПолучитьОбъект();
					ОбКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
					
					ОбКонтрагент.Записать();
				КонецЕсли;
			иначе
				//Контрагент был найден, возьмем авто
				Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
					Запрос = Новый Запрос();
					Запрос.УстановитьПараметр("ПарКлиент",Контрагент);
					Запрос.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
					Запрос.Текст = "ВЫБРАТЬ
					               |	АвтомобилиСрезПоследних.Период,
					               |	АвтомобилиСрезПоследних.Автомобиль,
					               |	АвтомобилиСрезПоследних.Значение
					               |ИЗ
					               |	РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
					               |ГДЕ
					               |	АвтомобилиСрезПоследних.Значение = &ПарКлиент";
					Результат = Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						Авто = Результат.Автомобиль;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		иначеЕсли Найти(Тип, "business")<>0 Тогда
			
			црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
			Контрагент    = Справочники.Контрагенты.ПустаяСсылка();
			
			
			СтруктураОрганизация =  СтруктураКлиент.company;
			
			НаименованиеКомпании = СтруктураОрганизация.name;
			email  = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.email);
			ИНН    = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.inn);
			КПП    = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.kpp);
			ОКПО   = црмРаботаСсоединением.УбратьКавычки(СтруктураОрганизация.ogrn); 
			
			
			МассивТелефоны  = СтруктураОрганизация.phones;
			СписокКонтактов = СтруктураКлиент.persons;
			
			//1.Поискать по ОКПО
			Если ЗначениеЗаполнено(ОКПО) Тогда
				ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоОКПО",ОКПО);
			КонецЕсли;
			
			//2.Поискать по КПП
			Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() и 
				ЗначениеЗаполнено(КПП) Тогда
				ЦрмКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КПП",КПП);
			КонецЕсли;
			
			//3.По номеру телефона
			Если ЦрмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				//Учесть +,7,8
				Для каждого Эл из МассивТелефоны Цикл
					Если ЗначениеЗаполнено(Эл.number) Тогда
						црмКонтрагент = црмРаботаСсоединением.НайтиПоНомеруТелефона(Эл.number);
						Если Не црмКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Сообщить("Найден контрагент по номеру телефона: "+црмКонтрагент);
							Контрагент = црмКонтрагент; 
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			иначе
				Контрагент = црмКонтрагент;
			КонецЕсли;
			
			Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				//Создаем
				НовКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
				НовКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
				НовКонтрагент.Наименование       = НаименованиеКомпании;
				НовКонтрагент.НаименованиеПолное = НаименованиеКомпании;
				НовКонтрагент.КодПоОКПО          = ОКПО;
				НовКонтрагент.КПП                = КПП;
				НовКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
				
				НовКонтрагент.УстановитьНовыйКод();
				НовКонтрагент.РекламныйИсточник = Справочники.ИсточникиИнформации.НайтиПоНаименованию("Клиент сервиса");
				
				Если МассивТелефоны.Количество()<> 0 Тогда
					ОсновнойТелефон = МассивТелефоны[0].number;
					
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					КодГорода = Сред(ОсновнойТелефон,2,3);
					НомерТелефона = Сред(ОсновнойТелефон,5);
					
					
					НовКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
					
				КонецЕсли;
				НовКонтрагент.Записать();
				
				#Если Клиент Тогда
				//Договор
				Если Вопрос("Создан новый контрагент. Создать договор?",РежимДиалогаВопрос.ДаНет,15,КодВозвратаДиалога.Да) = КодВозвратаДиалога.Да Тогда
					НовДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
					НовДоговор.Владелец      = НовКонтрагент.Ссылка;
					НовДоговор.Подразделение = ОбДокумент.ПодразделениеКомпании;
					НовДоговор.Автор         = ПараметрыСеанса.Пользователь;
					НовДоговор.ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
					НовДоговор.ВалютаВзаиморасчетов = обДокумент.ВалютаДокумента;
					НовДоговор.ВидОплаты     =  Перечисления.ВидыОплаты.ПроизвольнаяОплата;
					НовДоговор.ДатаНачала    = ТекущаяДата();
					НовДоговор.ДатаСоздания  = ТекущаяДата();
					НовДоговор.Организация   = Справочники.Организации.ОсновнаяОрганизация;
					НовДоговор.ДляАвтосервиса = Истина;
					НовДоговор.ТипДоговора   = Перечисления.ТипыДоговоров.Договор;
					НовДоговор.СформироватьНаименование();
					НовДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
					НовДоговор.Записать();
				КонецЕсли;
				#КонецЕсли
				
				Контрагент = НовКонтрагент.Ссылка;
				
				Если СтруктураОрганизация.Свойство("address") Тогда 
					СтруктураАдрес = СтруктураОрганизация.address;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
				КонецЕсли;
				Если СтруктураОрганизация.Свойство("juridicalAddress") Тогда 
					СтруктураАдрес = СтруктураОрганизация.juridicalAddress;
					ЗаписатьАдрес(СтруктураАдрес, Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
				КонецЕсли;
				Для каждого Эл из МассивТелефоны Цикл
					СтруктураЗаписи = новый структура();
					
					ОсновнойТелефон = Эл.number;
					ТипТелефона     = Эл.type; //1 - рабочий, 2 - мобильный, 3 - факс, 4 - домашний
					Если ТипТелефона = "1" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
					иначеЕсли ТипТелефона = "2" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
					иначеЕсли ТипТелефона = "3" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.Факс;
					иначеЕсли ТипТелефона = "4" Тогда
						ВидТелефона = Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
					КонецЕсли;
					
					СтруктураЗаписи.Вставить("Объект",Контрагент);
					СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
					
					СтруктураЗаписи.Вставить("Вид",ВидТелефона);
					СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
					
					
					КодСтраны = Лев(ОсновнойТелефон,1);
					СтруктураЗаписи.Вставить("Поле1","+"+КодСтраны);
					
					КодГорода = Сред(ОсновнойТелефон,2,3);
					СтруктураЗаписи.Вставить("Поле2",КодГорода);
					
					НомерТелефона = Сред(ОсновнойТелефон,5);
					СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
					
					СтруктураЗаписи.Вставить("Представление","+"+КодСтраны+"("+КодГорода+")"+НомерТелефона);
					црмРаботаСсоединением.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ОсновнойТелефон) Тогда
					ОбКонтрагент = Контрагент.ПолучитьОбъект();
					ОбКонтрагент.ОсновнойТелефон = "+"+КодСтраны+"("+КодГорода+")"+НомерТелефона;
					
					ОбКонтрагент.Записать();
				КонецЕсли;
			иначе
				//Контрагент был найден, возьмем авто
				Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
					Запрос = Новый Запрос();
					Запрос.УстановитьПараметр("ПарКлиент",Контрагент);
					Запрос.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
					Запрос.Текст = "ВЫБРАТЬ
					               |	АвтомобилиСрезПоследних.Период,
					               |	АвтомобилиСрезПоследних.Автомобиль,
					               |	АвтомобилиСрезПоследних.Значение
					               |ИЗ
					               |	РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Хозяин)) КАК АвтомобилиСрезПоследних
					               |ГДЕ
					               |	АвтомобилиСрезПоследних.Значение = &ПарКлиент";
					Результат = Запрос.Выполнить().Выбрать();
					Если Результат.Следующий() Тогда
						Авто = Результат.Автомобиль;
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
		КонецЕсли;
		//КонецЕсли;
		
		
		ОбДокумент.Заказчик = Контрагент;
		ОбДокумент.Контрагент = Контрагент;
		Если Не НовДоговор = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка() Тогда
			ОбДокумент.ДоговорВзаиморасчетов = НовДоговор.Ссылка; 	
		иначе
			//Договор с контрагентом
			ЗапросДоговор = новый запрос();
			ЗапросДоговор.УстановитьПараметр("парКонтрагент", Контрагент);
			ЗапросДоговор.Текст = "ВЫБРАТЬ
			                      |	ДоговорыВзаиморасчетов.Ссылка,
			                      |	ДоговорыВзаиморасчетов.Владелец
			                      |ИЗ
			                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			                      |ГДЕ
			                      |	ДоговорыВзаиморасчетов.Владелец = &парКонтрагент
			                      |	И ДоговорыВзаиморасчетов.ДляАвтосервиса
			                      |	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления";
			РезультатДог = ЗапросДоговор.Выполнить().Выбрать();
			Пока РезультатДог.Следующий() цикл
				ОбДокумент.ДоговорВзаиморасчетов = РезультатДог.Ссылка; 
			КонецЦикла;
		КонецЕсли;
		
		Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
			Если ЗначениеЗаполнено(VIN)
				Или ЗначениеЗаполнено(ГосНомер)
				Или ЗначениеЗаполнено(НаименованиеМодели) Тогда
				
				НовАвто = Справочники.Автомобили.СоздатьЭлемент();
				НовАвто.УстановитьНовыйКод();
				Если Не ЗначениеЗаполнено(VIN) Тогда
					Сообщить("В CRM системе у авто не заполнен VIN!!!");
					
				КонецЕсли;
				НовАвто.VIN = VIN;
				
				ЭлМодель = Справочники.Модели.НайтиПоНаименованию(СокрЛП(НаименованиеМодели));
				Если ЭлМодель = Справочники.Модели.ПустаяСсылка() Тогда
					ФормаМодели = Справочники.Модели.ПолучитьФормуВыбора();
					НовАвто.Модель = ФормаМодели.ОткрытьМодально();
				иначе
					НовАвто.Модель = ЭлМодель.Ссылка;	
				КонецЕсли;
				
				НовАвто.ВалютаУчета = НовАвто.Модель.ВалютаУчета;
				Если Не ЗначениеЗаполнено(НовАвто.ВалютаУчета) Тогда
					НовАвто.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
				КонецЕсли;
				Попытка
					Если ЗначениеЗаполнено(ГодВыпуска) Тогда
						НовАвто.ГодВыпуска         = Дата(ГодВыпуска+"0101");
					КонецЕсли;
				исключение
				КонецПопытки;
				Наименование = "";
				Если ЗначениеЗаполнено(НовАвто.Модель) Тогда
					Наименование=Наименование+СокрЛП(НовАвто.Модель.Наименование);
				КонецЕсли;
				Если ЗначениеЗаполнено(ГосНомер) Тогда
					Если НЕ ПустаяСтрока(Наименование) Тогда Наименование=Наименование+" "; КонецЕсли; 
					Наименование=Наименование+"№ "+СокрЛП(ГосНомер);
				КонецЕсли;
				Если ЗначениеЗаполнено(VIN) Тогда
					Если НЕ ПустаяСтрока(Наименование) Тогда Наименование=Наименование+" "; КонецЕсли;  
					Наименование=Наименование+"VIN "+СокрЛП(VIN);
				КонецЕсли;
				Если НЕ ПустаяСтрока(Наименование) Тогда НовАвто.Наименование=Наименование; КонецЕсли; 
				НовАвто.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
				НовАвто.Записать();
				НачалоТекущегоДня = НачалоДня(ТекущаяДата());
				
				ЗаписьЗначенияРегистраСведения(Контрагент,Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин,НовАвто,,ОбДокумент);
				Если ЗначениеЗаполнено(ГосНомер) Тогда
					ЗаписьЗначенияРегистраСведения(ГосНомер,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,НовАвто,,ОбДокумент);
				КонецЕсли;
				ОбДокумент.Автомобиль = НовАвто.Ссылка;
			КонецЕсли;
		иначе
			ОбДокумент.Автомобиль = Авто;
		КонецЕсли;
		
		ОбДокумент.ПричинаОбращения = црмРаботаСсоединением.УбратьКавычки(црмРезультат.service_client_statement);
		
		Если црмРезультат.Свойство("serviceRepairType") Тогда 
			ТипРемонта = црмРезультат.serviceRepairType.name;
			
			ЗапросВР = Новый запрос();
			
			ЗапросВР.Текст = "ВЫБРАТЬ
			|	ВидыРемонта.Ссылка,
			|	ВидыРемонта.ТипРемонта
			|ИЗ
			|	Справочник.ВидыРемонта КАК ВидыРемонта
			|ГДЕ
			|	НЕ ВидыРемонта.ПометкаУдаления
			|	И ВидыРемонта.Наименование ПОДОБНО ""%"" + &ПарНаименование + ""%""";
			ЗапросВР.УстановитьПараметр("ПарНаименование",ТипРемонта);
			
			РезВР = ЗапросВР.Выполнить().Выбрать();
			Если РезВР.Следующий() Тогда
				ОбДокумент.ВидРемонта = РезВР.Ссылка;
			КонецЕсли;
		КонецЕсли;
		//КонецЕсли;
		Если црмРезультат.Свойство("works") Тогда 
			МассивРаботы = црмРезультат.works;
			Для каждого ЭлРаботы из МассивРаботы Цикл
				СтруктураРаботы = ЭлРаботы.serviceWork;
				
				НаименованиеРаботы = СтруктураРаботы.name;
				КодРаботы          = СтруктураРаботы.code;
				ВремяВыполнения    = СтруктураРаботы.execution_time;
				НормаВремени       = СтруктураРаботы.standard_execution_time; 
				
				Работа = Справочники.Автоработы.НайтиПоКоду(СокрЛП(КодРаботы));
				
				Если Работа = Справочники.Автоработы.ПустаяСсылка() Тогда
					Сообщить("Внимание! Работа --"+НаименованиеРаботы+"-- не найдена по номеру каталога!");
				иначе
					НоваяСтрока = ОбДокумент.Работы.Добавить();
					НоваяСтрока.Работа = Работа;
					НоваяСтрока.Количество = 1;
					НоваяСтрока.ИдентификаторРаботы = новый УникальныйИдентификатор();
					НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
					ОбДокумент.ОбработкаРеквизита("Работы.Работа",НоваяСтрока,ОбДокументФорма);
					
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		
		ОбДокумент.ПерерасчетЦенАвторабот(Ложь,Новый Структура);
		#Если Клиент Тогда
		дкВывестиЗаголовокСуммаДокумента(ОбДокументФорма);
		#КонецЕсли	
		
		ФИОМастера = "";
		Если црмРезультат.Свойство("stages") Тогда
			МасЭтапы = црмРезультат.stages;
			Для каждого ЭлЭтапы из МасЭтапы Цикл
				Если ЭлЭтапы.Свойство("assignee") Тогда
					ФИОМастера = ЭлЭтапы.assignee.person;
				КонецЕсли;
			КонецЦикла;
			
			
			ЗапросСотр = новый запрос();
			ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОМастера));
			ЗапросСотр.Текст = "ВЫБРАТЬ
			|	Сотрудники.Ссылка,
			|	Сотрудники.Наименование,
			|	Сотрудники.Псевдоним,
			|	Сотрудники.Представление
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники
			|ГДЕ
			|	(Сотрудники.Наименование ПОДОБНО ""%"" + &парФИО + ""%""
			|			ИЛИ Сотрудники.Псевдоним ПОДОБНО ""%"" + &парФИО + ""%"")";
			
			РезультатСотр = ЗапросСотр.Выполнить().Выбрать();
			Если РезультатСотр.Следующий() Тогда
				ОбДокумент.Мастер = РезультатСотр.Ссылка;
			КонецЕсли;
			
			//Диспетчер
			СписокДиспетчер = црмРезультат.author;
			ФИОДиспетчера = СписокДиспетчер.person;
			ЗапросСотр.УстановитьПараметр("парФИО",СокрЛП(ФИОДиспетчера));
			РезультатДиспетчер = ЗапросСотр.Выполнить().Выбрать();
			Если РезультатДиспетчер.Следующий() Тогда
				ОбДокумент.Диспетчер = РезультатДиспетчер.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		стрПробег = 0;
		РезПробег = ПолучитьИнфоПоАвто(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
		Если РезПробег.Следующий() Тогда
			стрПробег = РезПробег.Значение;
		КонецЕсли;
		Если ЗначениеЗаполнено(Пробег) Тогда
			Если Число(Пробег)>стрПробег Тогда
				
				ЗаписьЗначенияРегистраСведения(Число(Пробег),Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ОбДокумент.Автомобиль,ОбДокумент.Дата,ОбДокумент.Автомобиль);
			КонецЕсли;
		КонецЕсли;	
		
		
		Если ТипЗнч(ОбДокумент) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
			ОбДокумент.ПредставлениеТелефона = ОбДокумент.Заказчик.ОсновнойТелефон;
			
			Email = ПолучитьКИ(ОбДокумент.Заказчик, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			стрEmail="";
			Если Email.Количество()>0 Тогда
				Если Email.следующий() Тогда
					стрEmail = Email.Представление;
				КонецЕсли;
			КонецЕсли;
			ОбДокумент.АдресЭлектронойПочты = стрEmail;
			
			стрГосНомер = "";
			ГосНомер = ПолучитьИнфоПоАвто(ОбДокумент.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			Если ГосНомер.Следующий() Тогда
				стрГосНомер = ГосНомер.Значение;
			КонецЕсли;
			ОбДокумент.ГосНомер              = стрГосНомер; 
			ОбДокумент.VIN    = ОбДокумент.Автомобиль.VIN;
			ОбДокумент.СоздатьЗапись_CRM = Истина;
		КонецЕсли;
		
	иначе
		Сообщить("Внимание!!! Не выполнен запрос в ЦРМ!!! Проверьте настройки подключения!", СтатусСообщения.Важное);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработатьСтруктуруЗаполнитьРеквизитыКонтрагент(СтруктураРезультата, ОбКонтрагент, ОбФорма) Экспорт
	
	Если СтруктураРезультата.success Тогда
		
		СтруктураРезультата = СтруктураРезультата.result;
		
		црмИД    = СтруктураРезультата.id;
		ФормаСобственностиЦРМ =  СтруктураРезультата.type;
		
		//2.Проверить по номеру телефона
		СтруктураКлиент = СтруктураРезультата.primaryPerson;
		
		СпТелефоны  = СтруктураКлиент.phones;
		Для каждого ЭлСпТелефон из СпТелефоны Цикл
			Телефон = ЭлСпТелефон.number;
			Контрагент = НайтиПоНомеруТелефона(Телефон);
			Если Не Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				Сообщить("Клиент с номером телефона: "+Телефон+" уже существует в базе. ФИО: "+Контрагент);
				Возврат;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Фамилия  = УбратьКавычки(СтруктураКлиент.lastname);
		Имя      = УбратьКавычки(СтруктураКлиент.firstname);
		Отчество = УбратьКавычки(СтруктураКлиент.middlename);
		Пол      = УбратьКавычки(СтруктураКлиент.gender);
		ДатаРождения = ПреобразоватьСтрокуВДату(СтруктураКлиент.birthday);
		
		email    = УбратьКавычки(СтруктураКлиент.email);
		
		
		Если ФормаСобственностиЦРМ = "individual" Тогда
			ОбКонтрагент.Фамилия = Фамилия;
			ОбКонтрагент.Имя = Имя;
			ОбКонтрагент.Отчество = Отчество;
			ОбКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
			ОбКонтрагент.НаименованиеПолное = ""+Фамилия+" "+Имя+" "+Отчество;
			ОбКонтрагент.Наименование       = ""+Фамилия+" "+Имя+" "+Отчество;
			
			//Корректировка 11.08.2017
			ОбКонтрагент.ДатаРождения       = ДатаРождения;
			//Корректировка 11.08.2017

			Если ЗначениеЗаполнено(Пол) Тогда
				Если Пол = "M" Тогда
					ОбКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
				иначе
					ОбКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
				КонецЕсли;
			иначе
				Если Найти(нрег(Прав(Отчество,3)),"вич") Тогда
					ОбКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
				иначеЕсли Найти(нрег(Прав(Отчество,3)),"вна") Тогда
					ОбКонтрагент.Пол = Перечисления.ПолФизическихЛиц.Женский;
				КонецЕсли;
			КонецЕсли;
		иначе
			ОбКонтрагент.ФормаСобственности   = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			НаименованиеКомпании = УбратьКавычки(СтруктураРезультата.company);
			ОбКонтрагент.НаименованиеПолное = НаименованиеКомпании;
			ОбКонтрагент.Наименование       = НаименованиеКомпании;
		КонецЕсли;
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
		Для каждого ЭлСпТелефон из СпТелефоны Цикл
			Телефон = ЭлСпТелефон.number;
			
			//Основной телефон
			ОбКонтрагент.ОсновнойТелефон = "+"+Лев(Телефон,1)+"("+Сред(Телефон,2,3)+")"+Сред(Телефон,5);
		КонецЦикла;
		
		ОбКонтрагент.Записать();
		
		Если ОбКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			
			Паспорт_Серия = УбратьКавычки(СтруктураКлиент.passportSeries);
			Паспорт_Номер = УбратьКавычки(СтруктураКлиент.passportNumber);
			Паспорт_Выдан = УбратьКавычки(СтруктураКлиент.passportIssuedBy);
			Паспорт_ДатаВыдачи = ПреобразоватьСтрокуВДату(УбратьКавычки(СтруктураКлиент.passportIssuedAt));
			
			Если ЗначениеЗаполнено(Паспорт_Серия) или ЗначениеЗаполнено(Паспорт_Номер)
				или ЗначениеЗаполнено(Паспорт_Выдан) или ЗначениеЗаполнено(Паспорт_ДатаВыдачи) Тогда
				НовыйПодтверждающийДокумент = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
				НовыйПодтверждающийДокумент.УстановитьНовыйКод();
				НовыйПодтверждающийДокумент.Владелец = ОбКонтрагент.Ссылка;
				НовыйПодтверждающийДокумент.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
				НовыйПодтверждающийДокумент.Серия = Паспорт_Серия;
				НовыйПодтверждающийДокумент.Номер = Паспорт_Номер;
				НовыйПодтверждающийДокумент.ДатаВыдачи = Паспорт_ДатаВыдачи;
				НовыйПодтверждающийДокумент.КемВыдан =  Паспорт_Выдан;
				НовыйПодтверждающийДокумент.Текущий = Истина;
				НовыйПодтверждающийДокумент.Наименование = НовыйПодтверждающийДокумент.СформироватьНаименование();
				НовыйПодтверждающийДокумент.Записать();
			КонецЕсли;
		КонецЕсли;
		
		Для каждого ЭлСпТелефон из СпТелефоны Цикл
			Телефон = ЭлСпТелефон.number;
			
			СтруктураЗаписи = новый структура();
			СтруктураЗаписи.Вставить("Объект",ОбКонтрагент.Ссылка);
			СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.Телефон);
			
			СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
			СтруктураЗаписи.Вставить("ЗначениеПоУмолчанию",Истина);
			
			ОсновнойТелефон = "+"+Лев(Телефон,1)+"("+Сред(Телефон,2,3)+")"+Сред(Телефон,5);
			
			КодСтраны = Лев(Телефон,1);
			СтруктураЗаписи.Вставить("Поле1",КодСтраны);
			
			КодГорода = Сред(Телефон,2,3);
			СтруктураЗаписи.Вставить("Поле2",КодГорода);
			
			НомерТелефона = Сред(Телефон,5);
			СтруктураЗаписи.Вставить("Поле3",НомерТелефона);
			
			СтруктураЗаписи.Вставить("Представление",ОсновнойТелефон);
			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
		КонецЦикла;
		
		Если ЗначениеЗаполнено(email) Тогда
			СтруктураЗаписи = новый структура();
			СтруктураЗаписи.Вставить("Объект",ОбКонтрагент.Ссылка);
			СтруктураЗаписи.Вставить("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
			СтруктураЗаписи.Вставить("Вид",Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
			СтруктураЗаписи.Вставить("Представление",email);
			ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "КонтактнаяИнформация");
			//<<Павличенко 08.12.17	
		Иначе
			сообщить("Запрещено создавать контрагентов без введенного email! " + ОбКонтрагент + " введен с ошибками! ");
			//>>Павличенко 08.12.17	
		КонецЕсли;
		
		//Корректировка 11.08.2017
		Если СтруктураКлиент.Свойство("address") Тогда 
			СтруктураАдрес = СтруктураКлиент.address;
			ЗаписатьАдрес(СтруктураАдрес, ОбКонтрагент.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресФактический);
			
			СтруктураАдрес = СтруктураКлиент.address;
			ЗаписатьАдрес(СтруктураАдрес, ОбКонтрагент.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
			Если Не СтруктураКлиент.Свойство("juridicalAddress") Тогда
				СтруктураАдрес = СтруктураКлиент.address;
				ЗаписатьАдрес(СтруктураАдрес, ОбКонтрагент.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
			КонецЕсли;
		КонецЕсли;
		Если СтруктураКлиент.Свойство("juridicalAddress") Тогда 
			СтруктураАдрес = СтруктураКлиент.juridicalAddress;
			ЗаписатьАдрес(СтруктураАдрес, ОбКонтрагент.Ссылка, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонецЕсли;
		//Корректировка 11.08.2017

	КонецЕсли;
	
	#Если Клиент Тогда
		ОбФорма.НаборКонтактнойИнформации = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		киПрочитатьКонтактнуюИнформацию(ОбФорма.НаборКонтактнойИнформации, ОбКонтрагент.Ссылка);
	#КонецЕсли
КонецПроцедуры

Процедура ОбработатьСтруктуруЗаполнитьРеквизитыРабочийЛистОП(СтруктураРезультата, ОбДокумент,ОбДокументФорма) Экспорт
	
	ОбДокумент.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.Заказчик   = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.Автомобиль = Справочники.Автомобили.ПустаяСсылка();
	ОбДокумент.Модель     = Справочники.Модели.ПустаяСсылка();
	ОбДокумент.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	СтруктураКлиент = СтруктураРезультата.result.generalClient;
	idКонтрагент = СтруктураКлиент.id;
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("црмИД",СокрЛП(idКонтрагент));
	
	Если СтруктураРезультата.success Тогда
		црмРезультат = СтруктураРезультата.result;
		
		СтруктураКлиент = црмРезультат.generalClient;
		
		Тип             = црмРаботаСсоединением.УбратьКавычки(СтруктураКлиент.type);
		
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда 
			Контрагент = ПолучитьКонтрагента(СтруктураКлиент, Тип);
		КонецЕсли;
		
		ОбДокумент.Контрагент = Контрагент;
		ОбДокумент.Заказчик   = Контрагент;
		
		Если црмРезультат.Свойство("needs") Тогда
			МассивПотребностей  = црмРезультат.needs;
			Для каждого СтруктураАвто из МассивПотребностей Цикл 
				
				Если СтруктураАвто.isMain = "1" ТОгда
					
				
				VIN           = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.vin);
				
				Авто = Справочники.Автомобили.ПустаяСсылка();
				
				ЗапросАвто = новый Запрос();
				ЗапросАвто.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
				ЗапросАвто.УстановитьПараметр("парVIN",VIN);
				ЗапросАвто.Текст = "ВЫБРАТЬ
				                   |	Авто.Ссылка КАК Ссылка,
				                   |	Авто.VIN КАК VIN
				                   |ИЗ
				                   |	Справочник.Автомобили КАК Авто
				                   |ГДЕ
				                   |	НЕ Авто.ПометкаУдаления
				                   |	И НЕ Авто.ЭтоГруппа
				                   |	И Авто.VIN = &парVIN";
				
				
				РезАвто = ЗапросАвто.Выполнить().Выбрать();
				Пока РезАвто.Следующий() Цикл
					Авто = РезАвто.Ссылка;
				КонецЦикла;
				
				Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
					Авто = ПолучитьАвтомобиль(СтруктураАвто, Контрагент, ОбДокумент).ссылка;
				КонецЕсли;
				ОбДокумент.Автомобиль = Авто.Ссылка;
				ОбДокумент.Модель = Авто.Модель;
				ОбДокумент.ВариантКомплектации = Авто.ВариантКомплектации;
				ОбДокумент.Цвет       = Авто.Цвет;
				ОбДокумент.ТипСалона  = Авто.ТипСалона;
			КонецЕсли;
		КонецЦикла;	
		КонецЕсли;
		//<<Павличенко 04.12.17
		//согласно письма Ульянова
		//Срок поставки 30.11.2017
		Если црмРезультат.свойство("stages") Тогда
			МассивЭтап   = СтруктураРезультата.result.stages;
			Для каждого ЭлМассива из МассивЭтап Цикл
				Если ЭлМассива.type = "12" Тогда
					 ОбДокумент.СрокПоставки = ПреобразоватьСтрокуВДату(ЭлМассива.scheduledFor);
				 КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		//Срок поставки 30.11.2017
		//>>Павличенко 04.12.17
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьСтруктуруЗаполнитьРеквизитыРабочийЛистТрейдИн(СтруктураРезультата, ОбДокумент,ОбДокументФорма) Экспорт
	
	ОбДокумент.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ОбДокумент.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	
	СтруктураКлиент = СтруктураРезультата.result.generalClient;
	idКонтрагент = СтруктураКлиент.id;
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("црмИД",СокрЛП(idКонтрагент));
	
	Если СтруктураРезультата.success Тогда
		црмРезультат = СтруктураРезультата.result;
		
		СтруктураКлиент = црмРезультат.generalClient;
		
		Тип             = црмРаботаСсоединением.УбратьКавычки(СтруктураКлиент.type);
		
		Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда 
			Контрагент = ПолучитьКонтрагента(СтруктураКлиент, Тип);
		КонецЕсли;
		
		ОбДокумент.Контрагент = Контрагент;
		ОбДокумент.Заказчик   = Контрагент;
		
		Если црмРезультат.Свойство("vehicle") Тогда
			СтруктураАвто  = црмРезультат.vehicle;
			
			
			VIN           = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.vin);
			ИДАвтом       = црмРаботаСсоединением.УбратьКавычки(СтруктураАвто.id);
			
			Авто = Справочники.Автомобили.ПустаяСсылка();
			
			ЗапросАвто = новый Запрос();
			ЗапросАвто.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
			ЗапросАвто.УстановитьПараметр("парVIN",VIN);
			ЗапросАвто.Текст = "ВЫБРАТЬ
			|	Авто.Ссылка КАК Ссылка,
			|	Авто.VIN КАК VIN
			|ИЗ
			|	Справочник.Автомобили КАК Авто
			|ГДЕ
			|	НЕ Авто.ПометкаУдаления
			|	И НЕ Авто.ЭтоГруппа
			|	И Авто.VIN = &парVIN";
			
			
			РезАвто = ЗапросАвто.Выполнить().Выбрать();
			Пока РезАвто.Следующий() Цикл
				Авто = РезАвто.Ссылка;
			КонецЦикла;
			
			Если Авто = Справочники.Автомобили.ПустаяСсылка() Тогда
			 Авто = ПолучитьАвтомобиль(СтруктураАвто, Контрагент, ОбДокумент).ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//<<БАА 15.11.2023
Функция ПодразделениеЦРМ(Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.ТЕкст = "ВЫБРАТЬ
	|	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	|ГДЕ
	|	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.Код = &Код
	|	И CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Код", "000000009");
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Не ЗАпрос.Выполнить().Пустой();
КонецФункции	

Функция ПодразделенияЦРМ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.ТЕкст = "ВЫБРАТЬ
	|	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение КАК Подразделение
	|ИЗ
	|	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	|ГДЕ
	|	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", "000000009");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
КонецФункции	


Функция ВидРемонтаДоукоплектация() Экспорт
	
	ВидыРемонта = Новый СписокЗначений;
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидыРемонта.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование);
	
	Возврат ВидыРемонта;
	
КонецФункции

Функция ДатаНачалаВыгрузкиДопов() Экспорт
	
	Попытка
		Возврат Дата(Справочники.CRM_НастройкаПодключения.НайтиПоКоду("000000024").Значение);
	Исключение
	КонецПопытки;	
	
КонецФункции	  

Функция СостояниеЗНДоукоплектация() Экспорт
	
	Состояния = Новый Массив;
	
	Состояния.Добавить(Справочники.ВидыСостоянийЗаказНарядов.ВРаботе);
	Состояния.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Выполнен);
	Состояния.Добавить(Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
 	Возврат Состояния;
КонецФункции	

//>>БАА 15.11.2023 


//БИЗТЕХ КОВАЛЬ 03.09.2024 ++
//Обновление у контрагента данных о согласии на ОПД и согласие на проведение опросов.
#Область ОбновитьДанныеКонтрагента
Функция ОбновитьДанныеКонтрагента(Настройка, Контрагент)
	КодКонтрагента = Контрагент.Код;
	ДанныеКонтрагента = НайтиКонтрагентавСРМ(Настройка,,"_"+КодКонтрагента);
	Если ДанныеКонтрагента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	idКонтрагента = ДанныеКонтрагента.id;
	idПерсоны = ДанныеКонтрагента.primaryPerson.id;
	idСогласия = ПолучитьIDСогласия(Настройка,,idПерсоны);
	idСогласия = СтрЗаменить(idСогласия," ","");
	Если idСогласия = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Ошибка = истина;
	
	//Данные из CRM
	CRM_СОПД 				= ?(ДанныеКонтрагента.primaryPerson.consentProcessingPersonalInformation = "0",Ложь,Истина);
	CRM_СОПДДата 			= ?(ДанныеКонтрагента.primaryPerson.consentProcessingPersonalInformation = "0","",ДанныеКонтрагента.primaryPerson.consent_processing_personal_information_date) ;
	CRM_СоглНаПРоведОпросов = ?(ДанныеКонтрагента.primaryPerson.consent_conduct_surveys = "0",Ложь,Истина);
	CRM_ПланироватьПоздрСДР = ?(ДанныеКонтрагента.primaryPerson.trackingBirthday = "0",Ложь,Истина);
	
	//Данные из 1с
	СОПД 				= ?(Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да,Истина,Ложь);
	СОПДДата 			= ?(Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да,Формат(Контрагент.СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=yyyy-MM-dd"),"");
	//БИЗТЕХ КОВАЛЬ 26.03.2025 ++
	СОПД = ИСТИНА;
	Если НЕ ЗначениеЗаполнено(СОПДДата) Тогда
		СОПДДата = Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-dd");
	КонецЕсли;
	
	//БИЗТЕХ КОВАЛЬ 26.03.2025 --
	
	
	СоглНаПРоведОпросов = ?(Контрагент.БТ_ОтказОтКоммуникации = Истина,Ложь,Истина);
	ПланироватьПоздрСДР = ?(Контрагент.БТ_ОтказОтКоммуникации = Истина,Ложь,Истина);
	
	//Требуется ли обновление
	Если CRM_СОПД <> СОПД ИЛИ CRM_СоглНаПРоведОпросов <> СоглНаПРоведОпросов Тогда
		
		//тело запроса
		ДанныеДляОтправки = Новый Структура;
		ДанныеДляОтправки.Вставить("tracking_birthday", ПланироватьПоздрСДР); 
		ДанныеДляОтправки.Вставить("processing_personal_information", СОПД);
		Если СОПД = Истина Тогда
			ДанныеДляОтправки.Вставить("processing_personal_information_date",СОПДДата);
		КонецЕсли;
		ДанныеДляОтправки.Вставить("conduct_surveys",СоглНаПРоведОпросов);
		
		
		ДанныеДляПередачи = Новый Структура;
		ДанныеДляПередачи.Вставить("body", ДанныеДляОтправки);
	    СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляОтправки);
		
		ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
		ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
		ПараметрыПодключения.Ресурс            = "/yii/api/personConsent/" + idСогласия;
		
		ПараметрыПодключения.Логин = Настройка.Логин;
		ПараметрыПодключения.Пароль = Настройка.Пароль;
		ПараметрыПодключения.Токен = Настройка.Токен;
		
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
		
		СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
		СтрХост   							= ПараметрыПодключения.Хост;
		СтрРесурс 							= ПараметрыПодключения.Ресурс;
		НастройкаЛогин  					= ПараметрыПодключения.Логин;
		НастройкаПароль 					= ПараметрыПодключения.Пароль;
		// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
		НастройкаТокен 						= ПараметрыПодключения.Токен;
		// БИЗТЕХ КОВАЛЬ 04.09.2025 --
		ssl1								= ПараметрыПодключения.ссл;
		ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
		ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
		
		SSL = Новый ЗащищенноеСоединениеOpenSSL;
		HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
		
		Попытка
			ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
			ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
			ФайлОтправки.Закрыть();
			ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
			ФайлОтправки.Записать(СтрокаДляОтправки);
			ФайлОтправки.Закрыть();
			ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
			РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
			ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
			ЗаголовокHTTP = Новый Соответствие();
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
			Если ЗначениеЗаполнено(НастройкаТокен) Тогда
				ЗаголовокHTTP.Вставить("Authorization", "Bearer " + НастройкаТокен);
			Иначе
				ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			КонецЕсли;
			// БИЗТЕХ КОВАЛЬ 04.09.2025 --
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
			
			HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
			HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
			
			Результат = HTTPСоединение.Записать(HTTPЗапрос); 
			
			КодСостояния = Результат.КодСостояния;
			
			Результат = Результат.ПолучитьТелоКакСтроку();
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(Результат);	
			
			//Результат = ПрочитатьJSON(ЧтениеJson);
			
			Ошибка = Ложь;
					
		Исключение
			Сообщить("_ Произошла сетевая ошибка!");
			Сообщить(ОписаниеОшибки());
			Ошибка = Истина;
			Результат = ОписаниеОшибки();	
		КонецПопытки;     		
	КонецЕсли;

КонецФункции
Функция НайтиКонтрагентавСРМ(Настройка, ПараметрПоиска = "foreignCode", ЗначениеДляПоиска)
	
	СтрокаЗапроса = "/yii/api/client?"+ПараметрПоиска+"=" + ЗначениеДляПоиска;
	
	ПараметрыПодключения = ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.Хост = "volvocarkuban.autocrm.ru";
	ПараметрыПодключения.Ресурс = СтрокаЗапроса;
	ПараметрыПодключения.Логин = Настройка.Логин;
	ПараметрыПодключения.Пароль = Настройка.Пароль;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	ПараметрыПодключения.Токен = Настройка.Токен;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 --
	
	Данные = ВыполнитьHTTPЗапросПолучить(ПараметрыПодключения);
	
	//Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Возврат Элемент;	
	
		КонецЦикла;	
	
	КонецЕсли;  
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьIDСогласия(Настройка, ПараметрПоиска = "personId", ЗначениеДляПоиска)
	
	СтрокаЗапроса = "/yii/api/personConsent?"+ПараметрПоиска+"=" + СтрЗаменить(Строка(ЗначениеДляПоиска)," ","");
	
	ПараметрыПодключения = ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.Хост = "volvocarkuban.autocrm.ru";
	ПараметрыПодключения.Ресурс = СтрокаЗапроса;
	ПараметрыПодключения.Логин = Настройка.Логин;
	ПараметрыПодключения.Пароль = Настройка.Пароль;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	ПараметрыПодключения.Токен = Настройка.Токен;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 --
	
	Данные = ВыполнитьHTTPЗапросПолучить(ПараметрыПодключения);
	
	//Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Возврат Элемент.id;	
	
		КонецЦикла;	
	
	КонецЕсли;  
	
	Возврат Неопределено;
	
КонецФункции
Функция ПростаяЗаписьJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();  
	
КонецФункции
#КонецОбласти 
//БИЗТЕХ КОВАЛЬ 03.09.2024 --

//БИЗТЕХ КОВАЛЬ 11.04.2025 ++
#Область ПолучениеЗаказНаряда
Функция СуществуетЛиЗаказНаряд(Настройка, НомерЗаказНаряда) Экспорт
	СтрокаЗапроса = "/yii/api/purchase?number=_"+НомерЗаказНаряда;
	
	ПараметрыПодключения = ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.Хост = "volvocarkuban.autocrm.ru";
	ПараметрыПодключения.Ресурс = СтрокаЗапроса;
	ПараметрыПодключения.Логин = Настройка.Логин;
	ПараметрыПодключения.Пароль = Настройка.Пароль;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 ++ Добавил авторизацию по токену
	ПараметрыПодключения.Токен = Настройка.Токен;
	// БИЗТЕХ КОВАЛЬ 04.09.2025 --
	
	Данные = ВыполнитьHTTPЗапросПолучить(ПараметрыПодключения);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Возврат Истина;	
	
		КонецЦикла;	
		
		Возврат Ложь;
	
	КонецЕсли;  
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти
//БИЗТЕХ КОВАЛЬ 11.04.2025 ++

