#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем ПодразделениеПоУмолчанию Экспорт;                // подразделение по умолчанию
Перем ВалютаПоУмолчанию Экспорт;                       // хранит валюту отчета по умолчанию
Перем ТаблицаПараметровТипаЦен;                        // таблица параметров типа цен
Перем ВыводитьЦеныХарактеристикНоменклатуры;           // выводить цены характеристик номенклатуры
Перем ЕстьОтборПоХарактеристикам;                      // флаг отбора по характеристикам
Перем ВыводитьЦеныЕдиниц;                              // выводить цены единиц номенклатуры
Перем ЕстьОтборПоЕдиницам;                             // флаг отбора по единицам


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Ищет контрагента в группировках. Если поиск удачен - возвращает "истина", иначе - "ложь"
//
// Без параметров
//
Функция НайтиПоляВГруппировкахИОтборах()
	
	ВыводитьЦеныХарактеристикНоменклатуры = Ложь;
	ЕстьОтборПоХарактеристикам = Ложь;
	ВыводитьЦеныЕдиниц = Ложь;
	ЕстьОтборПоЕдиницам = Ложь;
	
	Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
		Если НЕ ТекСтрока.Использование Тогда Продолжить; КонецЕсли;
		Если ТекСтрока.ПутьКДанным = "ХарактеристикаНоменклатуры" Тогда
			ВыводитьЦеныХарактеристикНоменклатуры = Истина;
		КонецЕсли;
		Если ТекСтрока.ПутьКДанным = "ЕдиницаИзмерения" Тогда
			ВыводитьЦеныЕдиниц = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекКолонка Из ИзмеренияКолонки Цикл
		Если НЕ ТекКолонка.Использование Тогда Продолжить; КонецЕсли;
		Если ТекКолонка.ПутьКДанным = "ХарактеристикаНоменклатуры" Тогда
			ВыводитьЦеныХарактеристикНоменклатуры = Истина;
		КонецЕсли;
		Если ТекКолонка.ПутьКДанным = "ЕдиницаИзмерения" Тогда
			ВыводитьЦеныЕдиниц = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекОтбор Из ПостроительОтчета.Отбор Цикл
		Если НЕ ТекОтбор.Использование ИЛИ ТекОтбор.ВидСравнения<>ВидСравнения.Равно Тогда Продолжить; КонецЕсли;
		Если ТекОтбор.ПутьКДанным = "ХарактеристикаНоменклатуры" Тогда
			ЕстьОтборПоХарактеристикам = Истина;
		КонецЕсли;
		Если ТекОтбор.ПутьКДанным = "ЕдиницаИзмерения" Тогда
			ЕстьОтборПоЕдиницам = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // НайтиПоляВГруппировкахИОтборах()

// проверяет настройки отчета на корректность заполнения, возвращает "истина", если корректно, "ложь" - если нет
//
// без параметров
// 
Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
	
	Если обЗначениеНеЗаполнено(ПодразделениеЦены) Тогда
		КоличествоИспользуемыхПоказателей = Показатели.НайтиСтроки(Новый Структура("Использование", Истина)).Количество();
		
		СчетчикПоказателейПартий = 0;
		Если Показатели.Найти("Количество").Использование Тогда
			СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
		КонецЕсли;
		
		Если Показатели.Найти("Себестоимость").Использование Тогда
			СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
		КонецЕсли;
		
		Если Показатели.Найти("СебестоимостьБезНДС").Использование Тогда
			СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
		КонецЕсли;
		
		Если (КоличествоИспользуемыхПоказателей > СчетчикПоказателейПартий) Тогда
			Предупреждение("Не указано <Подразделение цены>!", 10);
			ПродолжитьФормирование = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ВалютаОтчета) Тогда
		Предупреждение("Не указана <Валюта отчета>!", 10);
		ПродолжитьФормирование = Ложь;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции // КорректностьЗаполнения()

// Устанавливает параметры "КурсВалютыОтчета" и "Компания" в построителе отчета ПостроительОтчета
//
// Без параметров
//
Процедура УстановитьОсновныеПараметры()
	
	//Заполним параметры
	КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКонца, Новый Структура("Валюта", ВалютаОтчета));
	КурсВалютыОтчета = КурсВалюты.Курс/?(КурсВалюты.Кратность=0,1,КурсВалюты.Кратность);
	КурсВалютыОтчета = ?(КурсВалютыОтчета = 0, 1, КурсВалютыОтчета);
	
	КурсРеглВалюты = 1;
	Если НЕ ВалютаПоУмолчанию = ВалютаОтчета Тогда
		КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКонца, Новый Структура("Валюта", ВалютаПоУмолчанию));
		КурсРеглВалюты = КурсВалюты.Курс/?(КурсВалюты.Кратность=0, 1, КурсВалюты.Кратность);
		КурсРеглВалюты = ?(КурсРеглВалюты = 0, 1, КурсРеглВалюты)/КурсВалютыОтчета;
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("КурсВалютыОтчета", КурсВалютыОтчета);
	ПостроительОтчета.Параметры.Вставить("КурсРеглВалюты", КурсРеглВалюты);
	ПостроительОтчета.Параметры.Вставить("Контрагент", Контрагент);
	
КонецПроцедуры // УстановитьОсновныеПараметры()

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	// Дополним текст запроса
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТипыЦен.Ссылка КАК ТипЦен,
	|	ТипыЦен.Наименование КАК Наименование,
	|	ТипыЦен.ВключатьВПрайсЛист
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТипыЦен.ДляТоваров = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦен.Наименование УБЫВ");
	
	ПодразделениеПоУмолчанию = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	ВалютаПоУмолчанию = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	ТаблицаПараметровТипаЦен = Новый ТаблицаЗначений;
	ТаблицаПараметровТипаЦен.Колонки.Добавить("Имя");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ИмяБазовогоТипаЦен");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ТипЦен");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("Шаблон");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("АлгоритмПолученияЦены");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ТекстСоединений");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		РабочийТипЦен = Выборка.ТипЦен;
		ШаблонЦена = "ТаблицаЦен.Цена";
		// Если расчетная цена получим базовую цену
		ТекстСоединенийПроцентыСкидкиНаценки = "";
		Пока РабочийТипЦен.Рассчитывается Цикл
			
			Если РабочийТипЦен.ПроцентыСкидкиНаценки.Количество()>0 Тогда
				
				ИмяТаблицы = "ПроцентыСкидкиНаценки" + Строка(Счетчик);
				ТекстСоединенийПроцентыСкидкиНаценки = ТекстСоединенийПроцентыСкидкиНаценки + "
				|ЛЕВОЕ СОЕДИНЕНИЕ
				|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК " + ИмяТаблицы + "
				|ПО
				|	" + ИмяТаблицы + ".Ссылка = &ТипЦены" + Строка(Счетчик) + " И 
				|	ТаблицаЦен.Номенклатура.ТипНоменклатуры = " + ИмяТаблицы + ".ТипНоменклатуры";
				
				ШаблонЦена = "("+ШаблонЦена + "+" + ШаблонЦена + "*ЕСТЬNULL(" + ИмяТаблицы + ".ПроцентСкидкиНаценки/100, " + Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100,"ЧРД=.; ЧН=0")+"))";
				
				ПостроительОтчета.Параметры.Вставить("ТипЦены" + Строка(Счетчик), РабочийТипЦен);
				
				Счетчик = Счетчик + 1;
				
			ИначеЕсли РабочийТипЦен.ПроцентСкидкиНаценки <> 0 Тогда
				
				ШаблонЦена = "("+ШаблонЦена+"+"+ШаблонЦена+"*"+Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100, "ЧРД=.")+")";
				
			КонецЕсли;
			
			РабочийТипЦен = РабочийТипЦен.БазовыйТипЦен;
			
		КонецЦикла;
		
		ИмяПоля				= "Цена"+СтрЗаменить(Выборка.ТипЦен.УникальныйИдентификатор(),"-","_");
		ПредставлениеПоля	= Выборка.Наименование;
		
		отДобавитьФункциюПоказатель(Показатели, ИмяПоля, ПредставлениеПоля, Выборка.ВключатьВПрайсЛист, "ЧЦ=15; ЧДЦ=2", 15);

		ПараметрыТипа = ТаблицаПараметровТипаЦен.Найти(РабочийТипЦен,"ТипЦен");
		Если ПараметрыТипа = Неопределено Тогда
			ИмяБазовогоТипаЦен = "ТипЦен" + СтрЗаменить(РабочийТипЦен.УникальныйИдентификатор(),"-","_");
			ПостроительОтчета.Параметры.Вставить(ИмяБазовогоТипаЦен, РабочийТипЦен);
			Если НЕ РабочийТипЦен.ВВалютеУчета Тогда
				ПостроительОтчета.Параметры.Вставить("Валюта"+ИмяБазовогоТипаЦен, РабочийТипЦен.ВалютаЦены);
			КонецЕсли;
		Иначе
			ИмяБазовогоТипаЦен = ПараметрыТипа.ИмяБазовогоТипаЦен;
		КонецЕсли;
		
		НовыйПараметр = ТаблицаПараметровТипаЦен.Добавить();
		НовыйПараметр.Имя                   = ИмяПоля;
		НовыйПараметр.ИмяБазовогоТипаЦен    = ИмяБазовогоТипаЦен;
		НовыйПараметр.ТипЦен                = РабочийТипЦен;
		НовыйПараметр.Шаблон                = ШаблонЦена;
		НовыйПараметр.АлгоритмПолученияЦены = Выборка.ТипЦен.АлгоритмПолученияЦены;
		НовыйПараметр.ТекстСоединений       = ТекстСоединенийПроцентыСкидкиНаценки;
	КонецЦикла;
	
	ВалютаОтчета      = ВалютаПоУмолчанию;
	ПодразделениеЦены = ПодразделениеПоУмолчанию;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// получить текст запроса общей таблицы цен
Функция ПолучитьТекстЗапросаОбщейТаблицыЦен(ТипЦен, ОдинТипЦен)
	
	ОтборПоДополнениям = ?(ВыводитьЦеныЕдиниц ИЛИ ЕстьОтборПоЕдиницам,"", Символы.ПС+" И 
	|	((ТаблицаЦен.ЕдиницаИзмерения = ТаблицаЦен.Номенклатура.ОсновнаяЕдиницаИзмерения) ИЛИ
	|	(ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) И 
	|	 НЕ ТаблицаЦен.Номенклатура.ТипНоменклатуры.УчетЦенТолькоВРазрезеДопПараметров))");
	ОтборПоДополнениям = ОтборПоДополнениям + ?(ВыводитьЦеныХарактеристикНоменклатуры ИЛИ ЕстьОтборПоХарактеристикам,"",Символы.ПС+" И 
	|	(ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	НЕ ТаблицаЦен.Номенклатура.ТипНоменклатуры.УчетЦенТолькоВРазрезеДопПараметров)");
	
	Уровень = 0;
	ТекстОбъединенияУровней="";
	ТекРодитель = ПодразделениеЦены;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		
		ТекстУровень = Формат(Уровень, "ЧН=; ЧГ=");
		ПостроительОтчета.Параметры.Вставить("Подразделение"+Уровень, ТекРодитель);
		ТекстОбъединенияУровней = ТекстОбъединенияУровней+"
		|ОБЪЕДИНИТЬ ВСЕ 
		|ВЫБРАТЬ
		|	&Подразделение"+Уровень+",
		|	"+ТекстУровень;
		Уровень = Уровень + 1;
		
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	Если ОдинТипЦен Тогда
		ТекстСоединенияКурса = ?(ТипЦен.ВВалютеУчета, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
		|ПО
		|	ОптимальнаяТаблицаЦен.Номенклатура.ВалютаУчета = КурсыВалютСрезПоследних.Валюта","ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта=&ВалютаЦены) КАК КурсыВалютСрезПоследних
		|ПО
		|	ИСТИНА");
	Иначе
		ТекстСоединенияКурса = "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
		|ПО
		|	(ОптимальнаяТаблицаЦен.ТипЦен.ВВалютеУчета И ОптимальнаяТаблицаЦен.Номенклатура.ВалютаУчета = КурсыВалютСрезПоследних.Валюта) ИЛИ
		|	((НЕ ОптимальнаяТаблицаЦен.ТипЦен.ВВалютеУчета) И ОптимальнаяТаблицаЦен.ТипЦен.ВалютаЦены = КурсыВалютСрезПоследних.Валюта)";
	КонецЕсли;
	
	ТекстРезультат = "ВЫБРАТЬ
	|	ТаблицаПодразделений.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ТаблицаПодразделений.Уровень КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаПодразделений
	|ИЗ (
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка) КАК ПодразделениеКомпании,
	|	"+Уровень+" КАК Уровень
	|"+ТекстОбъединенияУровней+") КАК ТаблицаПодразделений
	|ИНДЕКСИРОВАТЬ ПО
	|	ПодразделениеКомпании
	|;
	|
	|ВЫБРАТЬ
	|	"+?(ОдинТипЦен,"","ТаблицаЦен.ТипЦен КАК ТипЦен,")+"
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Номенклатура.ОсновнаяЕдиницаИзмерения
	|		ИНАЧЕ
	|			ТаблицаЦен.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
	|		ИНАЧЕ
	|			ТаблицаЦен.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоОбщаяЦенаЕдиницы,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.ЕдиницаИзмерения = ТаблицаЦен.Номенклатура.ОсновнаяЕдиницаИзмерения ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЭтоБазоваяЦенаЕдиницы,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаПодразделений.Уровень КАК Уровень,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	ТаблицаПодразделений КАК ТаблицаПодразделений
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК ТаблицаЦен
	|ПО
	|	ТаблицаПодразделений.ПодразделениеКомпании = ТаблицаЦен.ПодразделениеКомпании
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	Справочник.ЕдиницыИзмерения КАК спрЕдиницыИзмерения
	//|ПО
	//|	спрЕдиницыИзмерения.Коэффициент=1 И 
	//|	ТаблицаЦен.Номенклатура.БазоваяЕдиницаИзмерения = спрЕдиницыИзмерения.ЕдиницаПоКлассификатору И 
	//|	(ТаблицаЦен.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 И 
	//|	ТаблицаЦен.Номенклатура.ТипНоменклатуры = спрЕдиницыИзмерения.Владелец ИЛИ 
	//|	ТаблицаЦен.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 2 И 
	//|	ТаблицаЦен.Номенклатура = спрЕдиницыИзмерения.Владелец)
	|ГДЕ
	|	ТаблицаЦен.Период <= &ДатаКон И 
	|	Контрагент = &Контрагент
	|	"+ОтборПоДополнениям+" И 
	|	"+?(ОдинТипЦен, "ТипЦен = &ТипЦен", "ТипЦен В (&ТипЦен)")+"
	|{ГДЕ
	|	(Номенклатура).* КАК Номенклатура,
	|	(ЕдиницаИзмерения).* КАК ЕдиницаИзмерения,
	|	(ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры}
	|ИНДЕКСИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТипЦен,")+"
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПодразделений
	|;
	|
	|ВЫБРАТЬ
	|	"+?(ОдинТипЦен,"","ТаблицаЦен.ТипЦен КАК ТипЦен,")+"
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезОптимальных
	|ИЗ 
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТаблицаЦен.ТипЦен,")+"
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения
	|ИНДЕКСИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТипЦен,")+"
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	"+?(ОдинТипЦен,"","ОптимальнаяТаблицаЦен.ТипЦен КАК ТипЦен,")+"
	|	ОптимальнаяТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ОптимальнаяТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень КАК Уровень,
	|	МАКСИМУМ(ТаблицаЦен.Коэффициент) КАК Коэффициент,
	|	МАКСИМУМ(ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы) КАК ЭтоОбщаяЦенаЕдиницы,
	|	МАКСИМУМ(ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы) КАК ЭтоБазоваяЦенаЕдиницы,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенПодразделений
	|ИЗ
	|	СрезОптимальных КАК ОптимальнаяТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	"+?(ОдинТипЦен,"","ОптимальнаяТаблицаЦен.ТипЦен	 = ТаблицаЦен.ТипЦен И ")+"
	|	ОптимальнаяТаблицаЦен.Номенклатура				 = ТаблицаЦен.Номенклатура И 
	|	ОптимальнаяТаблицаЦен.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры И 
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения			 = ТаблицаЦен.ЕдиницаИзмерения И 
	|	ОптимальнаяТаблицаЦен.Период 					 = ТаблицаЦен.Период
	|ГДЕ
	|	НЕ ТаблицаЦен.Цена = 0
	|СГРУППИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ОптимальнаяТаблицаЦен.ТипЦен,")+"
	|	ОптимальнаяТаблицаЦен.Номенклатура,
	|	ОптимальнаяТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень
	|ИНДЕКСИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТипЦен,")+"
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезОптимальных
	|;
	|
	|ВЫБРАТЬ
	|	"+?(ОдинТипЦен,"","ТаблицаЦен.ТипЦен КАК ТипЦен,")+"
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(ТаблицаЦен.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	СрезОптимальных
	|ИЗ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТаблицаЦен.ТипЦен,")+"
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ХарактеристикаНоменклатуры,
	|	ТаблицаЦен.ЕдиницаИзмерения
	|ИНДЕКСИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТипЦен,")+"
	|	Номенклатура
	|;
	|
	|
	|ВЫБРАТЬ
	|	"+?(ОдинТипЦен,"","ОптимальнаяТаблицаЦен.ТипЦен КАК ТипЦен,")+"
	|	ОптимальнаяТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ОптимальнаяТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Коэффициент КАК Коэффициент,
	|	ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы КАК ЭтоОбщаяЦенаЕдиницы,
	|	ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы КАК ЭтоБазоваяЦенаЕдиницы,
	|	ТаблицаЦен.Цена*((КурсыВалютСрезПоследних.Курс/ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1)/&КурсВалютыОтчета)) КАК Цена
	|ПОМЕСТИТЬ
	|	ОбщаяТаблицаЦен
	|ИЗ
	|	СрезОптимальных КАК ОптимальнаяТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦен
	|ПО
	|	"+?(ОдинТипЦен,"","ОптимальнаяТаблицаЦен.ТипЦен	 = ТаблицаЦен.ТипЦен И ")+"
	|	ОптимальнаяТаблицаЦен.Номенклатура				 = ТаблицаЦен.Номенклатура И 
	|	ОптимальнаяТаблицаЦен.ХарактеристикаНоменклатуры = ТаблицаЦен.ХарактеристикаНоменклатуры И 
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения			 = ТаблицаЦен.ЕдиницаИзмерения И 
	|	ОптимальнаяТаблицаЦен.Уровень 					 = ТаблицаЦен.Уровень
	|"+ТекстСоединенияКурса+"
	|ИНДЕКСИРОВАТЬ ПО
	|	"+?(ОдинТипЦен,"","ТипЦен,")+"
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦенПодразделений
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезОптимальных
	|;
	|";
	
	Возврат ТекстРезультат;
	
КонецФункции

// получить текст запроса объединенной таблицы цен
Функция ПолучитьТекстЗапросаОбъединеннойТаблицыЦен(СписокТиповЦен, ОдинТипЦен, ТаблицаЦен)
	
	ОтборДляАлгоритмаПоХарактеристикам = "
	|	" + ?(ОдинТипЦен,""," И ")+" ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы = ИСТИНА И
	|	ТаблицаЦен.ХарактеристикаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	
	ОтборДляАлгоритмаПоХарактеристикам2 = "
	|	" + ?(ОдинТипЦен,""," И ")+" ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы = ИСТИНА И
	|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	
	ОтборДляАлгоритмаПоЕдиницам = "
	|	" + ?(ОдинТипЦен,""," И ")+" ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы = ЛОЖЬ И ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы = ЛОЖЬ И 
	|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	
	//ОтборДляАлгоритмаПоЕдиницам2 = "
	//|	" + ?(ОдинТипЦен, "", " И ")+" 
	//|	ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы = ИСТИНА И ТаблицаЦен2.ЭтоОбщаяЦенаЕдиницы = ИСТИНА И 
	//|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	
	//ОтборДляАлгоритмаПоЕдиницам3 = "
	//|	" + ?(ОдинТипЦен,""," И ")+" 
	//|	ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы = ИСТИНА И 
	//|	ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)";
	
	ОтборДляАлгоритмаПоНоменклатуре = "
	|	" + ?(ОдинТипЦен,""," И ")+" ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
	|	ТаблицаЦен.ЭтоОбщаяЦенаЕдиницы = ИСТИНА";
	
	СчетчикБазовыхТипов = 0;
	ТекстТаблицЦенБазовыхТиповЦен = "";
	Для Каждого ТекТип Из СписокТиповЦен Цикл
		
		БазовыйТипЦен = ТекТип.Значение;
		ИмяБазовогоТипаЦен = ТекТип.Представление;
		АлгоритмПолученияЦены = БазовыйТипЦен.АлгоритмПолученияЦены;
		Если АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике Тогда
			ТекстЦен = "";
			ТекстЦенДоп = "";
			ТекстСоединений    = "";
			ТекстСоединенийДоп = "";
			Для Каждого ЦеновойПоказатель Из ТаблицаЦен Цикл
				ИмяПоля = ЦеновойПоказатель.Имя;
				Если БазовыйТипЦен = ЦеновойПоказатель.ТипЦен Тогда
					ТекстЦен = ТекстЦен+",
					|	"+ЦеновойПоказатель.Шаблон+" КАК "+ИмяПоля;
					ТекстСоединений = "
					|	"+ТекстСоединений + ЦеновойПоказатель.ТекстСоединений;
					Если АлгоритмПолученияЦены=ЦеновойПоказатель.АлгоритмПолученияЦены Тогда
						ТекстЦенДоп = ТекстЦенДоп+",
						|	"+ЦеновойПоказатель.Шаблон+" КАК "+ИмяПоля;
						ТекстСоединенийДоп = "
						|	"+ТекстСоединенийДоп + ЦеновойПоказатель.ТекстСоединений;
					Иначе
						ТекстЦенДоп = ТекстЦенДоп+",
						|	0 КАК "+ИмяПоля;
					КонецЕсли;
				Иначе
					ТекстЦен = ТекстЦен+",
					|	0 КАК "+ИмяПоля;
					ТекстЦенДоп = ТекстЦенДоп+",
					|	0 КАК "+ИмяПоля;
				КонецЕсли;
			КонецЦикла;
			ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+?(СчетчикБазовыхТипов=0,"",Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ")+"
			|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
			|ВЫБРАТЬ
			|	ТаблицаЦен.Номенклатура КАК Номенклатура,
			|	3 КАК Приоритет,
			|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
			|	"+ТекстЦен+"
			|//КОМЕНТАРИЙ
			|ИЗ
			|	ОбщаяТаблицаЦен КАК ТаблицаЦен
			|" + ТекстСоединений + "
			|ГДЕ
			|	"+?(ОдинТипЦен, "","ТаблицаЦен.ТипЦен = &"+ИмяБазовогоТипаЦен)+"
			|	"+ОтборДляАлгоритмаПоХарактеристикам2;
			
			Если ВыводитьЦеныХарактеристикНоменклатуры Тогда
				ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+"
				| ОБЪЕДИНИТЬ ВСЕ
				|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
				|ВЫБРАТЬ
				|	ТаблицаЦен.Номенклатура КАК Номенклатура,
				|	1 КАК Приоритет,
				|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
				|	"+ТекстЦенДоп+"
				|
				|ИЗ
				|	ОбщаяТаблицаЦен КАК ТаблицаЦен
				|" + ТекстСоединенийДоп + "
				|ГДЕ
				|	"+?(ОдинТипЦен, "","ТаблицаЦен.ТипЦен = &"+ИмяБазовогоТипаЦен)+"
				|	"+ОтборДляАлгоритмаПоХарактеристикам;
				СчетчикБазовыхТипов=СчетчикБазовыхТипов+1;
			КонецЕсли;
			
		ИначеЕсли АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
			
			ТекстЦен = "";
			ТекстЦенДоп = "";
			ТекстСоединений = "";
			ТекстСоединенийДоп = "";
			Для Каждого ЦеновойПоказатель Из ТаблицаЦен Цикл
				ИмяПоля = ЦеновойПоказатель.Имя;
				Если БазовыйТипЦен = ЦеновойПоказатель.ТипЦен Тогда
					//ТекстЦен = ТекстЦен+",
					//|	ЕСТЬNULL("+ЦеновойПоказатель.Шаблон+", "+СтрЗаменить(ЦеновойПоказатель.Шаблон,
					//|	"ТаблицаЦен.","ТаблицаЦен2.")+") КАК "+ИмяПоля;
					//
					ТекстЦен = ТекстЦен+",
					|	"+ЦеновойПоказатель.Шаблон+" КАК "+ИмяПоля;
					ТекстСоединений = "
					|	"+ТекстСоединений + ЦеновойПоказатель.ТекстСоединений;
					Если АлгоритмПолученияЦены = ЦеновойПоказатель.АлгоритмПолученияЦены Тогда
						ТекстЦенДоп = ТекстЦенДоп+",
						|	"+ЦеновойПоказатель.Шаблон+" КАК "+ИмяПоля;
						ТекстСоединенийДоп = "
						|	"+ТекстСоединенийДоп + ЦеновойПоказатель.ТекстСоединений;
					Иначе
						ТекстЦенДоп = ТекстЦенДоп+",
						|	0 КАК "+ИмяПоля;
					КонецЕсли;
					
				Иначе
					ТекстЦен = ТекстЦен+",
					|	0 КАК "+ИмяПоля;
					ТекстЦенДоп = ТекстЦенДоп+",
					|	0 КАК "+ИмяПоля;
				КонецЕсли;
			КонецЦикла;
			
			//ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+?(СчетчикБазовыхТипов=0,"",
			//Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ")+"
			//|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
			//|ВЫБРАТЬ
			//|	ТаблицаЦен.Номенклатура КАК Номенклатура,
			//|	3 КАК Приоритет,
			//|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			//|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
			//|	"+ТекстЦен+"
			//|//КОМЕНТАРИЙ
			//|ИЗ
			//|	ОбщаяТаблицаЦен КАК ТаблицаЦен
			//|ГДЕ
			//|	"+?(ОдинТипЦен, "","ТаблицаЦен.ТипЦен = &"+ИмяБазовогоТипаЦен)+"
			//|	"+ОтборДляАлгоритмаПоЕдиницам3;
			
			ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+?(СчетчикБазовыхТипов=0,"",Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ")+"
			|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
			|ВЫБРАТЬ
			|	ТаблицаЦен.Номенклатура КАК Номенклатура,
			|	3 КАК Приоритет,
			|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
			|	"+ТекстЦен+"
			|//КОМЕНТАРИЙ
			|ИЗ
			|	ОбщаяТаблицаЦен КАК ТаблицаЦен
			|ПОЛНОЕ СОЕДИНЕНИЕ
			|	ОбщаяТаблицаЦен КАК ТаблицаЦен2
			|ПО
			|	ТаблицаЦен.Номенклатура = ТаблицаЦен2.Номенклатура" + ?(ОдинТипЦен, "", " И 
			|	ТаблицаЦен.ТипЦен = &"  + ИмяБазовогоТипаЦен  + " И ТаблицаЦен2.ТипЦен = &" + ИмяБазовогоТипаЦен) + " И 
			|	ТаблицаЦен.ХарактеристикаНоменклатуры  = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
			|	ТаблицаЦен2.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
			|	ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы = ИСТИНА И ТаблицаЦен2.ЭтоОбщаяЦенаЕдиницы = ИСТИНА
			|" + ТекстСоединений + "
			|ГДЕ
			|	"+?(ОдинТипЦен, "","ЕСТЬNULL(ТаблицаЦен.ТипЦен, ТаблицаЦен2.ТипЦен) = &"+ИмяБазовогоТипаЦен+" И ") + "
			|	ЕСТЬNULL(ТаблицаЦен.ХарактеристикаНоменклатуры, ТаблицаЦен2.ХарактеристикаНоменклатуры) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И 
			|	ЕСТЬNULL(ТаблицаЦен.ЭтоБазоваяЦенаЕдиницы, ТаблицаЦен2.ЭтоОбщаяЦенаЕдиницы) = ИСТИНА";
			
			СчетчикБазовыхТипов=СчетчикБазовыхТипов+1;
			
			Если ВыводитьЦеныЕдиниц Тогда
				
				ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+"
				| ОБЪЕДИНИТЬ ВСЕ
				|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
				|ВЫБРАТЬ
				|	ТаблицаЦен.Номенклатура КАК Номенклатура,
				|	2 КАК Приоритет,
				|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				|	ТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
				|	"+ТекстЦенДоп+"
				|
				|ИЗ
				|	ОбщаяТаблицаЦен КАК ТаблицаЦен
				|" + ТекстСоединенийДоп + "
				|ГДЕ
				|	"+?(ОдинТипЦен, "","ТаблицаЦен.ТипЦен = &" + ИмяБазовогоТипаЦен)+"
				|	"+ОтборДляАлгоритмаПоЕдиницам;
				
				СчетчикБазовыхТипов=СчетчикБазовыхТипов + 1;
				
			КонецЕсли;
			
			//ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+?(СчетчикБазовыхТипов=0,"",
			//Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ")+"
			//|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
			//|ВЫБРАТЬ
			//|	ЕСТЬNULL(ТаблицаЦен.Номенклатура, ТаблицаЦен2.Номенклатура) КАК Номенклатура,
			//|	3 КАК Приоритет,
			//|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
			//|	"+ТекстЦен+"
			//|//КОМЕНТАРИЙ
			//|ИЗ
			//|  ОбщаяТаблицаЦен КАК ТаблицаЦен
			//|ПОЛНОЕ СОЕДИНЕНИЕ ОбщаяТаблицаЦен КАК ТаблицаЦен2
			//|ПО ТаблицаЦен.Номенклатура = ТаблицаЦен2.Номенклатура
			//|ГДЕ
			//|	"+?(ОдинТипЦен, "","ЕСТЬNULL(ТаблицаЦен.ТипЦен, ТаблицаЦен2.ТипЦен) = &"+ИмяБазовогоТипаЦен+" И ")+"
			//|	ЕСТЬNULL(ТаблицаЦен.ХарактеристикаНоменклатуры, ТаблицаЦен2.ХарактеристикаНоменклатуры)
			//|	= ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) И
			//|	(ТаблицаЦен2.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) И 
			//|	(ТаблицаЦен.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))";
			
		Иначе
			ТекстЦен = "";
			ТекстСоединений = "";
			Для Каждого ЦеновойПоказатель Из ТаблицаЦен Цикл
				ИмяПоля = ЦеновойПоказатель.Имя;
				Если БазовыйТипЦен = ЦеновойПоказатель.ТипЦен Тогда
					ТекстЦен = ТекстЦен+",
					|	"+ЦеновойПоказатель.Шаблон+" КАК "+ИмяПоля;
					ТекстСоединений = "
					|	"+ТекстСоединений + ЦеновойПоказатель.ТекстСоединений;
				Иначе
					ТекстЦен = ТекстЦен+",
					|	0 КАК "+ИмяПоля;
				КонецЕсли;
			КонецЦикла;
			ТекстТаблицЦенБазовыхТиповЦен = ТекстТаблицЦенБазовыхТиповЦен+?(СчетчикБазовыхТипов=0,"",Символы.ПС+"ОБЪЕДИНИТЬ ВСЕ")+"
			|//ТАБЛИЦА ЦЕН "+ИмяБазовогоТипаЦен+"
			|ВЫБРАТЬ
			|	ТаблицаЦен.Номенклатура КАК Номенклатура,
			|	3 КАК Приоритет,
			|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
			|	"+ТекстЦен+"
			|//КОМЕНТАРИЙ
			|ИЗ
			|	ОбщаяТаблицаЦен КАК ТаблицаЦен
			|" + ТекстСоединений + "
			|ГДЕ
			|	"+?(ОдинТипЦен, "","ТаблицаЦен.ТипЦен=&"+ИмяБазовогоТипаЦен)+"
			|	"+ОтборДляАлгоритмаПоНоменклатуре;
		КонецЕсли;
		СчетчикБазовыхТипов = СчетчикБазовыхТипов+1;
	КонецЦикла;
	
	Если СчетчикБазовыхТипов=1 Тогда
		Результат = СтрЗаменить(ТекстТаблицЦенБазовыхТиповЦен,"//КОМЕНТАРИЙ","ПОМЕСТИТЬ ОбъединеннаяТаблицаЦен");
	Иначе
		ТекстЦен = "";
		Для Каждого ЦеновойПоказатель Из ТаблицаЦен Цикл
			ИмяПоля = ЦеновойПоказатель.Имя;
			ТекстЦен = ТекстЦен+",
			|	ОбъединеннаяТаблицаЦен."+ИмяПоля+" КАК "+ИмяПоля;
		КонецЦикла;
		Результат = "//ОБЪЕДИНЕННАЯ ТАБЛИЦА ЦЕН
		|ВЫБРАТЬ
		|	ОбъединеннаяТаблицаЦен.Номенклатура КАК Номенклатура,
		|	ОбъединеннаяТаблицаЦен.Приоритет КАК Приоритет,
		|	ОбъединеннаяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОбъединеннаяТаблицаЦен.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры"+ТекстЦен+"
		|ПОМЕСТИТЬ
		|	ОбъединеннаяТаблицаЦен
		|ИЗ ("+ТекстТаблицЦенБазовыхТиповЦен+") КАК ОбъединеннаяТаблицаЦен";
	КонецЕсли;
	
	ТекстЦен = "";
	Для Каждого ЦеновойПоказатель Из ТаблицаЦен Цикл
		ИмяПоля = ЦеновойПоказатель.Имя;
		ТекстЦен = ТекстЦен+",
		|	СУММА(ТаблицаЦен."+ИмяПоля+") КАК "+ИмяПоля;
	КонецЦикла;
	
	Результат = Результат+"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|УНИЧТОЖИТЬ ОбщаяТаблицаЦен
	|;
	|";
	
	Возврат Результат;
	
КонецФункции

// возвращает текст запроса
Функция ПолучитьТекстЗапроса() Экспорт
	
	ТекстЗапросаРезультат = "";
	ТекстВыборки = "";
	ТекстВыборки2 = "";
	ТекстИтогов = "";
	ТаблицаЦен = ТаблицаПараметровТипаЦен.СкопироватьКолонки();
	СписокТиповЦен = Новый СписокЗначений;
	Для Каждого ТекПоказатель Из Показатели Цикл
		Если НЕ ТекПоказатель.Использование Тогда Продолжить; КонецЕсли;
		ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ТекПоказатель.Имя, "Имя");
		Если ЦеновойПоказатель = Неопределено Тогда Продолжить; КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТаблицаЦен.Добавить(), ЦеновойПоказатель);
		// Параметры полей цены
		ИмяПоля = ЦеновойПоказатель.Имя;
		// Параметры типов цен
		БазовыйТипЦен = ЦеновойПоказатель.ТипЦен;
		ИмяБазовогоТипаЦен = ЦеновойПоказатель.ИмяБазовогоТипаЦен;
		Если ВыводитьЦеныХарактеристикНоменклатуры И ЦеновойПоказатель.АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике Тогда
			ТекстВыборки = ТекстВыборки+",
			|	СУММА(ВЫБОР
			|		КОГДА ЕСТЬNULL(ЦеныДополнительныхРазрезов."+ИмяПоля+", 0)=0 ТОГДА
			|			ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+",0)
			|		ИНАЧЕ
			|			ЦеныДополнительныхРазрезов."+ИмяПоля+"
			|	КОНЕЦ*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля+",
			|	СУММА(ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0)*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля+"Номенклатура";
			
			ТекстВыборки2 = ТекстВыборки2 + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+"/ПодсчетЕдиниц.КоличествоЕдиниц) КАК " + ИмяПоля + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+"Номенклатура/ПодсчетЕдиниц.КоличествоЕдиниц) КАК " + ИмяПоля + "Номенклатура";
		
			ТекстИтогов = ТекстИтогов+",
			|	ВЫБОР 
			|		КОГДА СУММА("+ИмяПоля+")=0 ТОГДА
			|			СУММА("+ИмяПоля+"Номенклатура) 
			|		ИНАЧЕ
			|			СУММА("+ИмяПоля+") 
			|	КОНЕЦ КАК "+ИмяПоля;
		ИначеЕсли ВыводитьЦеныЕдиниц И ЦеновойПоказатель.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
			ТекстВыборки = ТекстВыборки+",
			|	СУММА(ВЫБОР
			|		КОГДА ЕСТЬNULL(ЦеныДополнительныхРазрезовЕдиниц."+ИмяПоля+", 0) = 0 ТОГДА
			|			ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0) * ТаблицаОстатков.КоличествоОстаток
			|		КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL ИЛИ ЕдиницыИзмерения.Коэффициент = 1 ТОГДА
			|			ЦеныДополнительныхРазрезовЕдиниц."+ИмяПоля+" * ТаблицаОстатков.КоличествоОстаток
			|		ИНАЧЕ
			|			ЦеныДополнительныхРазрезовЕдиниц."+ИмяПоля+" * (ТаблицаОстатков.КоличествоОстаток/ЕдиницыИзмерения.Коэффициент)
			|	КОНЕЦ) КАК "+ИмяПоля+",
			|	СУММА(ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0)*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля+"Номенклатура";
			
			ТекстВыборки2 = ТекстВыборки2 + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+") КАК " + ИмяПоля + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+"Номенклатура/ПодсчетЕдиниц.КоличествоЕдиниц) КАК " + ИмяПоля + "Номенклатура";
		
			ТекстИтогов = ТекстИтогов+",
			|	ВЫБОР 
			|		КОГДА ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
			|			СУММА("+ИмяПоля+"Номенклатура)
			|		ИНАЧЕ
			|			СУММА("+ИмяПоля+") 
			|	КОНЕЦ КАК "+ИмяПоля;
		ИначеЕсли ВыводитьЦеныЕдиниц Тогда
			ТекстВыборки = ТекстВыборки+",
			|СУММА(ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0)*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля;
			
			ТекстВыборки2 = ТекстВыборки2 + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+") КАК " + ИмяПоля + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+"/ПодсчетЕдиниц.КоличествоЕдиниц) КАК " + ИмяПоля + "Номенклатура";
			
			ТекстИтогов = ТекстИтогов+",
			|	ВЫБОР 
			|		КОГДА ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
			|			СУММА("+ИмяПоля+"Номенклатура)
			|		ИНАЧЕ
			|			СУММА("+ИмяПоля+") 
			|	КОНЕЦ КАК "+ИмяПоля;
		Иначе
			ТекстВыборки = ТекстВыборки+",
			|СУММА(ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0)*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля;
			
			ТекстВыборки2 = ТекстВыборки2 + ",
			|	СУММА(ТаблицаОстатков."+ИмяПоля+"/ПодсчетЕдиниц.КоличествоЕдиниц) КАК " + ИмяПоля + "";
			
			//ТекстВыборки = ТекстВыборки+",
			//|СУММА(ВЫБОР 
			//|	КОГДА НЕ ЕСТЬNULL(ЦеныДополнительныхРазрезов."+ИмяПоля+", 0)=0 ТОГДА
			//|		ЦеныДополнительныхРазрезов."+ИмяПоля+"
			//|	ИНАЧЕ
			//|		ЕСТЬNULL(ОбщиеЦеныДополнительныхРазрезов."+ИмяПоля+", 0)
			//|КОНЕЦ*ТаблицаОстатков.КоличествоОстаток) КАК "+ИмяПоля;
			ТекстИтогов = ТекстИтогов+",
			|	СУММА("+ИмяПоля+")";
		КонецЕсли;
		Если СписокТиповЦен.НайтиПоЗначению(БазовыйТипЦен)=Неопределено Тогда
			СписокТиповЦен.Добавить(БазовыйТипЦен, ИмяБазовогоТипаЦен);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокТиповЦен.Количество()>0 Тогда
		ОдинТипЦен = СписокТиповЦен.Количество()=1;
		ТипЦен = Неопределено;
		Если ОдинТипЦен Тогда
			ТипЦен = СписокТиповЦен[0].Значение;
			ПостроительОтчета.Параметры.Вставить("ТипЦен", ТипЦен);
			ПостроительОтчета.Параметры.Вставить("ВалютаЦены", ТипЦен.ВалютаЦены);
		Иначе
			ПостроительОтчета.Параметры.Вставить("ТипЦен", СписокТиповЦен.ВыгрузитьЗначения());
		КонецЕсли;
		ТекстЗапросаРезультат = ПолучитьТекстЗапросаОбщейТаблицыЦен(ТипЦен, ОдинТипЦен);
		ТекстЗапросаРезультат = ТекстЗапросаРезультат + "
		|"+ПолучитьТекстЗапросаОбъединеннойТаблицыЦен(СписокТиповЦен, ОдинТипЦен, ТаблицаЦен);
	Иначе
		Возврат ТекстЗапроса;
	КонецЕсли;	
	
	СтрЗапросаСвойств      = "";
	СтрПсевдонимСвойств    = "";
	СтрЗапросаИтогиСвойств = "";
	СтрОтборСвойств        = "";
	СтрСоединенийСвойств   = "";
	СтрГруппировкиСвойств  = "";
	
	ОписанияПолейВЗапросе = Новый Структура;
	ОписанияПолейВЗапросе.Вставить("Организация",                "СкладКомпании.Организация");
	ОписанияПолейВЗапросе.Вставить("Подразделение",              "СкладКомпании.Подразделение");
	ОписанияПолейВЗапросе.Вставить("СкладКомпании",              "СкладКомпании");
	ОписанияПолейВЗапросе.Вставить("Номенклатура",               "Номенклатура");
	ОписанияПолейВЗапросе.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");

	Для Каждого ТекСвойство Из СтруктураСвязиСвойств Цикл
		ИмяСвойства = СтрЗаменить(ТекСвойство.Ключ, "Значение", "");
		НаименованиеСвойства = ТекСвойство.Значение.Представление;
		ИмяПараметра = ТекСвойство.Значение.ИмяПараметра;
		ПутьКДаннымПоля = "ТаблицаОстатков." + ОписанияПолейВЗапросе[ТекСвойство.Значение.ИмяИзмерения];
		ПостроительОтчета.Параметры.Вставить(ИмяПараметра, ТекСвойство.Значение.Свойство);
			
		ЗапросСвойстваПоля 		 = ","+Символы.ПС+"ВЫБОР КОГДА " + ИмяСвойства + ".Значение ЕСТЬ NULL ТОГДА """ + НаименованиеСвойства + ": <Пусто>"" ИНАЧЕ " + ИмяСвойства + ".Значение КОНЕЦ КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваГруппы	 = ","+Символы.ПС+"ВЫБОР КОГДА " + ИмяСвойства + ".Значение ЕСТЬ NULL ТОГДА """ + НаименованиеСвойства + ": <Пусто>"" ИНАЧЕ " + ИмяСвойства + ".Значение КОНЕЦ";
		ЗапросСвойстваПсевдоним  = ","+Символы.ПС+ИмяСвойства+"Значение КАК "+ИмяСвойства+"Значение";
		ЗапросСвойстваИтоги 	 = ","+Символы.ПС+"МАКСИМУМ(" + ИмяСвойства + "Значение)";
		ЗапросСвойстваОтборы 	 = ","+Символы.ПС+ИмяСвойства + ".Значение КАК " + ИмяСвойства + "Значение";
		ЗапросСвойстваСоединение = "{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК " + ИмяСвойства + " ПО " + ИмяСвойства + ".Объект = " + ПутьКДаннымПоля + " И " + ИмяСвойства + ".Свойство = &" + ИмяПараметра + "}" + Символы.ПС;
		
		СтрГруппировкиСвойств	= СтрГруппировкиСвойств	 + ЗапросСвойстваГруппы;
		СтрЗапросаСвойств     	= СтрЗапросаСвойств      + ЗапросСвойстваПоля;
		СтрПсевдонимСвойств   	= СтрПсевдонимСвойств    + ЗапросСвойстваПсевдоним;
		СтрЗапросаИтогиСвойств	= СтрЗапросаИтогиСвойств + ЗапросСвойстваИтоги;
		СтрОтборСвойств 		= СтрОтборСвойств		 + ЗапросСвойстваОтборы;
		СтрСоединенийСвойств  	= СтрСоединенийСвойств   + ЗапросСвойстваСоединение;
	КонецЦикла;
	
	Если ВыводитьЦеныЕдиниц Тогда
		
		ТекстЗапросаРезультат = ТекстЗапросаРезультат+"
		|ВЫБРАТЬ
		|	ТаблицаОстатков.СкладКомпании КАК СкладКомпании,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА ЕдиницыИзмерения.Коэффициент ЕСТЬ NULL ИЛИ ЕдиницыИзмерения.Коэффициент = 0 ТОГДА
		|			ТаблицаОстатков.КоличествоОстаток
		|		ИНАЧЕ
		|			ТаблицаОстатков.КоличествоОстаток/ЕдиницыИзмерения.Коэффициент
		|	КОНЕЦ) КАК КоличествоЕдиниц,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ТаблицаОстатков.СуммаОстаток)*&КурсРеглВалюты КАК Себестоимость,
		|	МАКСИМУМ(ТаблицаОстатков.СуммаОстаток - ТаблицаОстатков.СуммаНДСОстаток)*&КурсРеглВалюты КАК СебестоимостьБезНДС,
		|	МАКСИМУМ(ТаблицаОстатков.КоличествоОстаток) КАК Количество"+ТекстВыборки+"
		|ПОМЕСТИТЬ
		|	ВременнаяТаблицаРезультата
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКон, {
		|		СкладКомпании.Организация.* КАК Организация,
		|		СкладКомпании.Подразделение.* КАК Подразделение,
		|		СкладКомпании.* КАК СкладКомпании,
		|		Номенклатура.* КАК Номенклатура,
		|		ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры}) КАК ТаблицаОстатков
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ПО
		|	(ТаблицаОстатков.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 И 
		|	 ТаблицаОстатков.Номенклатура.ТипНоменклатуры = ЕдиницыИзмерения.Владелец ИЛИ 
		|	 ТаблицаОстатков.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 2 И 
		|	 ТаблицаОстатков.Номенклатура = ЕдиницыИзмерения.Владелец)" + ?(ВыводитьЦеныХарактеристикНоменклатуры, "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ОбъединеннаяТаблицаЦен КАК ЦеныДополнительныхРазрезов
		|ПО
		|	ЦеныДополнительныхРазрезов.Приоритет = 1 И 
		|	ТаблицаОстатков.Номенклатура = ЦеныДополнительныхРазрезов.Номенклатура И 
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры = ЦеныДополнительныхРазрезов.ХарактеристикаНоменклатуры", "") + "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ОбъединеннаяТаблицаЦен КАК ЦеныДополнительныхРазрезовЕдиниц
		|ПО
		|	ЦеныДополнительныхРазрезовЕдиниц.Приоритет = 2 И 
		|	ТаблицаОстатков.Номенклатура = ЦеныДополнительныхРазрезовЕдиниц.Номенклатура И 
		|	ЕдиницыИзмерения.Ссылка = ЦеныДополнительныхРазрезовЕдиниц.ЕдиницаИзмерения
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ОбъединеннаяТаблицаЦен КАК ОбщиеЦеныДополнительныхРазрезов
		|ПО 
		|	ТаблицаОстатков.Номенклатура = ОбщиеЦеныДополнительныхРазрезов.Номенклатура И 
		|	ОбщиеЦеныДополнительныхРазрезов.Приоритет = 3
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.СкладКомпании,
		|	ТаблицаОстатков.Номенклатура,
		|	ЕдиницыИзмерения.Ссылка,
		|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)),
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры
		|;
		|
		|УНИЧТОЖИТЬ
		|	ОбъединеннаяТаблицаЦен
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаОстатков.СкладКомпании КАК СкладКомпании,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаОстатков.ЕдиницаИзмерения) КАК КоличествоЕдиниц
		|ПОМЕСТИТЬ
		|	ПодсчетЕдиниц
		|ИЗ
		|	ВременнаяТаблицаРезультата КАК ТаблицаОстатков
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.СкладКомпании,
		|	ТаблицаОстатков.Номенклатура,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОстатков.СкладКомпании.Организация КАК Организация,
		|	ТаблицаОстатков.СкладКомпании.Подразделение КАК Подразделение,
		|	ТаблицаОстатков.СкладКомпании КАК СкладКомпании,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ТаблицаОстатков.КоличествоЕдиниц) КАК КоличествоЕдиниц,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СУММА(ТаблицаОстатков.Себестоимость/ПодсчетЕдиниц.КоличествоЕдиниц) КАК Себестоимость,
		|	СУММА(ТаблицаОстатков.Себестоимость) КАК СебестоимостьЕдиниц,
		|	СУММА(ТаблицаОстатков.Себестоимость/ПодсчетЕдиниц.КоличествоЕдиниц) КАК СебестоимостьБезНДС,
		|	СУММА(ТаблицаОстатков.Себестоимость) КАК СебестоимостьБезНДСЕдиниц,
		|	СУММА(ТаблицаОстатков.Количество/ПодсчетЕдиниц.КоличествоЕдиниц) КАК Количество"+ТекстВыборки2+СтрЗапросаСвойств+"
		|
		|{ВЫБРАТЬ
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|ИЗ
		|	ВременнаяТаблицаРезультата КАК ТаблицаОстатков
		|ЛЕВОЕ СОЕДИНЕНИЕ 
		|	ПодсчетЕдиниц КАК ПодсчетЕдиниц
		|ПО
		|	ТаблицаОстатков.СкладКомпании = ПодсчетЕдиниц.СкладКомпании И 
		|	ТаблицаОстатков.Номенклатура = ПодсчетЕдиниц.Номенклатура И 
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры = ПодсчетЕдиниц.ХарактеристикаНоменклатуры
		|	"+СтрСоединенийСвойств+"
		|{ГДЕ
		|	ТаблицаОстатков.Номенклатура.* КАК Номенклатура
		|	"+СтрОтборСвойств+"
		|}
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.СкладКомпании,
		|	ТаблицаОстатков.Номенклатура,
		|	ТаблицаОстатков.ЕдиницаИзмерения,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры"+СтрГруппировкиСвойств+"
		|{УПОРЯДОЧИТЬ ПО
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|{ИТОГИ ПО
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ЕдиницаИзмерения.* КАК ЕдиницаИзмерения,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|ИТОГИ
		|	ВЫБОР
		|		КОГДА ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
		|			СУММА(Себестоимость)
		|		ИНАЧЕ
		|			СУММА(СебестоимостьЕдиниц)
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
		|			СУММА(СебестоимостьБезНДС)
		|		ИНАЧЕ
		|			СУММА(СебестоимостьБезНДСЕдиниц)
		|	КОНЕЦ КАК СебестоимостьБезНДС,
		|	ВЫБОР
		|		КОГДА ЕдиницаИзмерения ЕСТЬ NULL ТОГДА
		|			СУММА(Количество)
		|		ИНАЧЕ
		|			СУММА(КоличествоЕдиниц)
		|	КОНЕЦ КАК Количество" + ТекстИтогов + СтрЗапросаИтогиСвойств + "
		|ПО ОБЩИЕ,
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры,
		|	ЕдиницаИзмерения";
		
	Иначе
		ТекстЗапросаРезультат = ТекстЗапросаРезультат+"
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОстатков.СкладКомпании.Организация КАК Организация,
		|	ТаблицаОстатков.СкладКомпании.Подразделение КАК Подразделение,
		|	ТаблицаОстатков.СкладКомпании КАК СкладКомпании,
		|	ТаблицаОстатков.Номенклатура КАК Номенклатура,
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	МАКСИМУМ(ТаблицаОстатков.СуммаОстаток)*&КурсРеглВалюты КАК Себестоимость,
		|	МАКСИМУМ(ТаблицаОстатков.СуммаОстаток - ТаблицаОстатков.СуммаНДСОстаток)*&КурсРеглВалюты КАК СебестоимостьБезНДС,
		|	МАКСИМУМ(ТаблицаОстатков.КоличествоОстаток) КАК Количество"+ТекстВыборки+СтрЗапросаСвойств+"
		|
		|{ВЫБРАТЬ
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКон, {
		|		СкладКомпании.Организация.* КАК Организация,
		|		СкладКомпании.Подразделение.* КАК Подразделение,
		|		СкладКомпании.* КАК СкладКомпании,
		|		Номенклатура.* КАК Номенклатура,
		|		ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры}) КАК ТаблицаОстатков
		|"+?(ВыводитьЦеныЕдиниц, "ЛЕВОЕ СОЕДИНЕНИЕ 
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ПО
		|	(ТаблицаОстатков.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 И 
		|	 ТаблицаОстатков.Номенклатура.ТипНоменклатуры = ЕдиницыИзмерения.Владелец ИЛИ 
		|	 ТаблицаОстатков.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 2 И 
		|	 ТаблицаОстатков.Номенклатура = ЕдиницыИзмерения.Владелец)","") + ?(ВыводитьЦеныХарактеристикНоменклатуры, "
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ОбъединеннаяТаблицаЦен КАК ЦеныДополнительныхРазрезов
		|ПО
		|	ЦеныДополнительныхРазрезов.Приоритет = 1 И 
		|	ТаблицаОстатков.Номенклатура = ЦеныДополнительныхРазрезов.Номенклатура И 
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры = ЦеныДополнительныхРазрезов.ХарактеристикаНоменклатуры", "")+"
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	ОбъединеннаяТаблицаЦен КАК ОбщиеЦеныДополнительныхРазрезов
		|ПО 
		|	ТаблицаОстатков.Номенклатура = ОбщиеЦеныДополнительныхРазрезов.Номенклатура И 
		|	ОбщиеЦеныДополнительныхРазрезов.Приоритет = 3
		|	"+СтрСоединенийСвойств+"
		|{ГДЕ
		|	ТаблицаОстатков.Номенклатура.* КАК Номенклатура
		|	"+СтрОтборСвойств+"
		|}
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОстатков.СкладКомпании,
		|	ТаблицаОстатков.Номенклатура" + ?(ВыводитьЦеныЕдиниц,",
		|	ЕдиницыИзмерения.Ссылка,
		|	ЕСТЬNULL(ЕдиницыИзмерения.Ссылка, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))", ",
		|	ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)") +",
		|	ТаблицаОстатков.ХарактеристикаНоменклатуры"+СтрГруппировкиСвойств+"
		|{УПОРЯДОЧИТЬ ПО
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|{ИТОГИ ПО
		|	Организация.* КАК Организация,
		|	Подразделение.* КАК Подразделение,
		|	СкладКомпании.* КАК СкладКомпании,
		|	Номенклатура.* КАК Номенклатура,
		|	ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры"+СтрПсевдонимСвойств+"}
		|ИТОГИ
		|	СУММА(Себестоимость),
		|	СУММА(СебестоимостьБезНДС),
		|	СУММА(Количество)" + ТекстИтогов + СтрЗапросаИтогиСвойств + "
		|ПО ОБЩИЕ,
		|	Номенклатура,
		|	ХарактеристикаНоменклатуры
		|	";
	КонецЕсли;
	
	Возврат ТекстЗапросаРезультат;
 	
КонецФункции // ПолучитьТекстЗапроса()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
 	УстановитьОсновныеПараметры();
	НайтиПоляВГруппировкахИОтборах();
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	Возврат Результат;
	
КонецФункции // ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

// корректировка таблицы заголовка
Процедура ОбработкаТаблицыЗаголовка(ТаблицаЗаголовка) Экспорт
	
	КоличествоИспользуемыхПоказателей = Показатели.НайтиСтроки(Новый Структура("Использование", Истина)).Количество();
	
	СчетчикПоказателейПартий = 0;
	Если Показатели.Найти("Количество").Использование Тогда
		СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
	КонецЕсли;
	
	Если Показатели.Найти("Себестоимость").Использование Тогда
		СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
	КонецЕсли;
	
	Если Показатели.Найти("СебестоимостьБезНДС").Использование Тогда
		СчетчикПоказателейПартий = СчетчикПоказателейПартий + 1;
	КонецЕсли;
	
	Если КоличествоИспользуемыхПоказателей = СчетчикПоказателейПартий Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаОтбора = ТаблицаЗаголовка.Найти("Отбор", "ИмяСтроки");
	ИндексВставки = ТаблицаЗаголовка.Индекс(СтрокаОтбора);
	// отбор по контрагенту
	НоваяСтрока = ТаблицаЗаголовка.Вставить(ИндексВставки);
	НоваяСтрока.ИмяСтроки	= "Контрагент";
	НоваяСтрока.Текст		= "Контрагент: " + ?(ЗначениеЗаполнено(Контрагент), СокрЛП(Контрагент), "Цены компании");
	НоваяСтрока.ЦветТекста	= СтрокаОтбора.ЦветТекста;
	НоваяСтрока.Шрифт		= Новый Шрифт(СтрокаОтбора.Шрифт);
	// отбор по подразделению
	НоваяСтрока = ТаблицаЗаголовка.Вставить(ИндексВставки);
	НоваяСтрока.ИмяСтроки	= "Подразделение";
	НоваяСтрока.Текст		= "Подразделение цены: " + СокрЛП(ПодразделениеЦены);
	НоваяСтрока.ЦветТекста	= СтрокаОтбора.ЦветТекста;
	НоваяСтрока.Шрифт		= Новый Шрифт(СтрокаОтбора.Шрифт);

КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли