
// Устанавливает реквизиты элемента ПВХ "ВопросыДляАнкетирования"
//
Процедура УстановитьРеквизитыВопроса(Вопрос, ПолнаяФормулировка, ТипОтветаНаВопросАнкеты, БолееОдногоОтвета = Ложь, КоличествоСтрок = 0, ВидКонтактнойИнформации = 0, ТипЗначения = Неопределено, Длина = 0)	
	Объект = Вопрос.ПолучитьОбъект();
	
	Объект.ПолнаяФормулировка			= ПолнаяФормулировка;
	Объект.ТипОтветаНаВопрос			= ТипОтветаНаВопросАнкеты;
	Объект.КоличествоСтрокТаблицы		= КоличествоСтрок;
	Объект.ВидКонтактнойИнформации		= ВидКонтактнойИнформации;
	Объект.Длина						= Длина;
	
	Попытка
		Объект.Записать();
	Исключение КонецПопытки;	
КонецПроцедуры

// Заполняет пустые предопределенные элементы   
//
// Без параметров
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	Менеджер		= ПланыВидовХарактеристик.ВопросыДляАнкетирования;
	ВВидеЧисла		= Перечисления.ТипыОтветаНаВопросАнкеты.Число;
	ВВидеСтроки		= Перечисления.ТипыОтветаНаВопросАнкеты.Строка;
	ВВидеДаты		= Перечисления.ТипыОтветаНаВопросАнкеты.Дата;
	ТабличныйВопрос	= Перечисления.ТипыОтветаНаВопросАнкеты.Табличный;
	ВВидеБулево		= Перечисления.ТипыОтветаНаВопросАнкеты.Булево;
	ВВидеКИ			= Перечисления.ТипыОтветаНаВопросАнкеты.КонтактнаяИнформация;
	ВВидеСсылки		= Перечисления.ТипыОтветаНаВопросАнкеты.Ссылка;
	
	// Описание типов
	КЧ = Новый КвалификаторыЧисла(15, 2);
	КС = Новый КвалификаторыСтроки(1000);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	
	ОписаниеТиповЧисло		= Новый ОписаниеТипов("Число", КЧ);
	ОписаниеТиповСтрока		= Новый ОписаниеТипов("Строка", , КС);
	ОписаниеТиповДата		= Новый ОписаниеТипов("Дата", , , КД);
	ОписаниеТиповБулево		= Новый ОписаниеТипов("Булево");
	ОписаниеТиповВОТ		= Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовОпросов");
	ОписаниеТиповДолжности	= Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовОпросов");
	ОписаниеТиповВидыВзаимоотношений	= Новый ОписаниеТипов("СправочникСсылка.ВидыВзаимоотношений");
	ОписаниеТиповФормаСобственности		= Новый ОписаниеТипов("ПеречислениеСсылка.ФормыСобственности");
	
	МассивТипов	= Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ВариантыОтветовОпросов"));
	ОписаниеТиповКонтрагента	= Новый ОписаниеТипов(МассивТипов);
	
	// Общие вопросы
	УстановитьРеквизитыВопроса(Менеджер.Имя,			"Имя",			ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.Отчество,		"Отчество",		ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.Фамилия,		"Фамилия",		ВВидеСтроки,,,,	ОписаниеТиповСтрока, 50);
	УстановитьРеквизитыВопроса(Менеджер.ДатаРождения,	"Дата рождения",ВВидеДаты,,,,	ОписаниеТиповДата);
	УстановитьРеквизитыВопроса(Менеджер.Фамилия,		"ИНН",			ВВидеСтроки,,,, ОписаниеТиповСтрока, 12);

	// Контактное лицо
	УстановитьРеквизитыВопроса(Менеджер.Должность,		"Должность",	ВВидеСсылки,,,, ОписаниеТиповДолжности);
	УстановитьРеквизитыВопроса(Менеджер.Роль,			"Роль",			ВВидеСсылки,,,, ОписаниеТиповВидыВзаимоотношений, 100);

	// Контрагент
	УстановитьРеквизитыВопроса(Менеджер.ВидДеятельностиКонтрагента,	"Вид деятельности",			ВВидеСсылки,,,, ОписаниеТиповКонтрагента);
	УстановитьРеквизитыВопроса(Менеджер.НаименованиеКонтрагента,	"Наименование",				ВВидеСтроки,,,, ОписаниеТиповСтрока, 100);
	УстановитьРеквизитыВопроса(Менеджер.ТипКонтрагента,				"Тип",						ВВидеСсылки,,,,	ОписаниеТиповФормаСобственности);
	УстановитьРеквизитыВопроса(Менеджер.ИННГоловногоКонтрагента,	"ИНН головной организации",	ВВидеСтроки,,,, ОписаниеТиповСтрока, 12);
	УстановитьРеквизитыВопроса(Менеджер.ТВидыДеятельностиКонтрагента,"Вид деятельности",		ВВидеСсылки,,,, ОписаниеТиповКонтрагента);
	
	// табличные вопросы
	УстановитьРеквизитыВопроса(Менеджер.ТВидыДеятельностиКонтрагента,	"Виды деятельности контрагента",	ТабличныйВопрос,, 4,, ОписаниеТиповСтрока, 200);
	
	Если ЗаполнятьВсе Тогда
		// табличный вопрос трудовая деятельность
		ОбъектПВХВопросыДляАнкетирования = ПланыВидовХарактеристик.ВопросыДляАнкетирования.ТВидыДеятельностиКонтрагента.ПолучитьОбъект();
		НоваяКолонка = ОбъектПВХВопросыДляАнкетирования.КолонкиТаблицы.Добавить();
		НоваяКолонка.КолонкаТаблицы = ПланыВидовХарактеристик.ВопросыДляАнкетирования.ВидДеятельностиКонтрагента;
		ОбъектПВХВопросыДляАнкетирования.КоличествоСтрокТаблицы = 4;
		ОбъектПВХВопросыДляАнкетирования.Записать();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
