// Заполняет предопределенные элементы(если они не существуют - создает новые(не предопределенные!))
// при обновлении релиза
// Флаг ЗаполнятьВсе=Истина - перезаполняет уже существующие элементы(строгое заполнение)
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	// Заполним реквизиты предопределенный элемент Локальная_сеть [C:\]
	НастройкаДоставкиОбъект = Справочники.НастройкиДоставкиСообщений.ЛокальнаяСеть.ПолучитьОбъект();
	НеобходимоСохранить = Ложь;
	Если НастройкаДоставкиОбъект.СпособОбмена <> 0 Тогда
	   НастройкаДоставкиОбъект.СпособОбмена = 0; // лок сеть
	   НеобходимоСохранить = Истина;
   	КонецЕсли; 
	Если ПустаяСтрока(НастройкаДоставкиОбъект.КаталогОбменов)
	ИЛИ (Прав(НастройкаДоставкиОбъект.КаталогОбменов,1) <> "\")
	ИЛИ (Сред(НастройкаДоставкиОбъект.КаталогОбменов,2,1) <> ":")
	Тогда
	   НастройкаДоставкиОбъект.КаталогОбменов = "C:\RBD\"; // Будет попытка создать этот каталог, если нет такого
	   НеобходимоСохранить = Истина;
   	КонецЕсли;
	Если НеобходимоСохранить Тогда
		Попытка
			НастройкаДоставкиОбъект.Записать();
			Сообщить("Справочник ""Настройки доставки сообщений"". Обновлен элемент """ + НастройкаДоставкиОбъект.Наименование + """");
		Исключение
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
