#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ВозвратОтПокупателя" , "Возврат от покупателя");
	СтруктураМакетов.Вставить("ЭтикетокИЦенников"   , "Печать этикеток и ценников");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра "Операции прослеживаемых товаров"
//
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГТДПартийТоваровКомпании.Регистратор КАК Регистратор,
	|	ГТДПартийТоваровКомпании.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
	|ГДЕ
	|	ГТДПартийТоваровКомпании.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ГТДПартийТоваровКомпании.ГТД.РНПТ
	|	И ГТДПартийТоваровКомпании.Регистратор ССЫЛКА Документ.ВозвратОтПокупателя";
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти