Процедура ЗаполнитьТекВозмещение(Стр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_ОстаткиВозмещенийОстатки.СуммаОстаток,
		|	ТТ_ОстаткиВозмещенийОстатки.СуммаНДСОстаток
		|ИЗ
		|	РегистрНакопления.ТТ_ОстаткиВозмещений.Остатки(&Дата1, ) КАК ТТ_ОстаткиВозмещенийОстатки
		|ГДЕ
		|	ТТ_ОстаткиВозмещенийОстатки.Автомобиль = &Автомобиль
		|	И ТТ_ОстаткиВозмещенийОстатки.ТипСкидки = &ТипСкидки";
	
	Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
	Запрос.УстановитьПараметр("Дата1", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаОстаток;
		Стр.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДСОстаток;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ХозОперация=Справочники.ХозОперации.ОтветПоставщикаНаВозмещение;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыСведений.тт_Возмещения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	//БизТех Горковенко П.А 27.10.25 ++   
	
	// проверка суммы документа план и факт
    ИсходныйДок = ЭтотОбъект.ДокументОснование; // отчет дистрибьютора 
	
	// проверка проведения исходного документа
	Если Не ИсходныйДок.Проведен Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ факта не найден. Проверьте данные!";     
		Сообщение.Сообщить();    
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// Проверка наличия основания - не должно быть такого		
	Если ИсходныйДок = Неопределено Тогда
        Сообщить("Не указан документ‑основание!", СтатусСообщения.Важное);
        Отказ = Истина;
        Возврат;
	КонецЕсли; 
	
	//сумма исходного документа (отчет дистрибьютора)
	ЗапросОснование = Новый Запрос;
	ЗапросОснование.Текст = 
		"ВЫБРАТЬ
		|	СУММА(СкидкиПлан.СуммаВозмещения) КАК СуммаПлан
		|ИЗ
		|	Документ.ОтчетДистрибьютораОПродажеАвтомобилей.Скидки КАК СкидкиПлан
		|ГДЕ
		|	СкидкиПлан.Ссылка = &Документ";
	
	ЗапросОснование.УстановитьПараметр("Документ", ИсходныйДок);
	РезультатОснования = ЗапросОснование.Выполнить();   
	ВыборкаОснования = РезультатОснования.Выбрать();

	СуммаОснования = 0;
	Если ВыборкаОснования.Следующий() Тогда
	    СуммаОснования = ?(ВыборкаОснования.СуммаПлан = NULL, 0, ВыборкаОснования.СуммаПлан);
	КонецЕсли;
		
	//сумма текущего документа (ответ поставщика)
	ЗапросТекущего = Новый Запрос;
	ЗапросТекущего.Текст = 
		"ВЫБРАТЬ
		|	СУММА(СкидкиФакт.СуммаВозмещения) КАК СуммаФакт
		|ИЗ
		|	Документ.ОтветПоставщикаПоВозмещениям.Скидки КАК СкидкиФакт
		|ГДЕ
		|	СкидкиФакт.Ссылка = &Документ";
	
	ЗапросТекущего.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
	РезультатТекущего = ЗапросТекущего.Выполнить();
	ВыборкаТекущего = РезультатТекущего.Выбрать();

	СуммаТекущего = 0;
	Если ВыборкаТекущего.Следующий() Тогда
	    СуммаТекущего = ?(ВыборкаТекущего.СуммаФакт = NULL, 0, ВыборкаТекущего.СуммаФакт);
	КонецЕсли;	
	
	//сравниваем суммы
	Если СуммаТекущего > СуммаОснования Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Фактическая сумма в размере " + СуммаТекущего +" единиц превышает плановое значение в размере " + СуммаОснования + 
		" единиц. Проверьте данные!";      
		Сообщение.Сообщить();
	    Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//БизТех Горковенко П.А 27.10.25 --

	Для каждого Стр из Скидки Цикл
		
		Если обЗначениеНеЗаполнено(Стр.Автомобиль) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Автомобиль! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Стр.Скидка) Тогда
			Сообщить("В строке № "+Стр.НомерСтроки+" не заполнен Тип скидки! Запись прервана.");
			Отказ=Истина;
		КонецЕсли;
		
		Если Стр.Скидка.Организация <> Организация Тогда
			
			Сообщить("Организация документа не соответствует Организации программы возмещения "+Стр.Скидка+". Автомобиль "+Стр.Автомобиль);
			
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ=Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		//Проверка, на наличие сумм
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	СУММА(ТТ_ОстаткиВозмещенийОстатки.СуммаОстаток) КАК СуммаОстаток
		//|ИЗ
		//|	РегистрНакопления.ТТ_ОстаткиВозмещений.Остатки(
		//|			&Момент,
		//|			Автомобиль = &Автомобиль
		//|				И ТипСкидки = &ТипСкидки) КАК ТТ_ОстаткиВозмещенийОстатки";
		//
		//Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		//Запрос.УстановитьПараметр("Момент", Новый Граница(ЭтотОбъект.Дата, ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
		
		// проверка существования факта на данный автомобиль
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТТ_ОстаткиВозмещенийОбороты.Автомобиль КАК Автомобиль,
			|	ТТ_ОстаткиВозмещенийОбороты.ТипСкидки КАК ТипСкидки,
			|	ТТ_ОстаткиВозмещенийОбороты.СуммаОборот КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ТТ_ОстаткиВозмещений.Обороты КАК ТТ_ОстаткиВозмещенийОбороты
			|ГДЕ
			|	ТТ_ОстаткиВозмещенийОбороты.Автомобиль = &Автомобиль
			|	И ТТ_ОстаткиВозмещенийОбороты.ТипСкидки = &ТипСкидки";
		
		Запрос.УстановитьПараметр("Автомобиль", Стр.Автомобиль);
		Запрос.УстановитьПараметр("ТипСкидки", Стр.Скидка);
				
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() 
			ИЛИ РезультатЗапроса.Выгрузить()[0].СуммаОстаток = 0 
			Тогда
			Сообщить("Нет остатков сумм возмещения по программе "+Стр.Скидка+". Автомобиль: "+Стр.Автомобиль);
			Отказ=Истина;
			Продолжить;
		КонецЕсли;
		
		Движения.ТТ_ОстаткиВозмещений.Записывать=Истина;
		//Бизтех Горковенко П.А. 12.11.25++
		
		//Движ=Движения.ТТ_ОстаткиВозмещений.Добавить();
		//Движ.Период=ЭтотОбъект.Дата;
		//дВиж.ВидДвижения=ВидДвиженияНакопления.Приход;
		//Движ.Автомобиль=Стр.Автомобиль;
		//Движ.Поставщик = Стр.Скидка.Контрагент;
		//Движ.ТипСкидки=Стр.Скидка;
		//Движ.Сумма=Стр.СуммаВозмещения;
		//Движ.СуммаНДС=Стр.СуммаНДС;
		
		//Бизтех Горковенко П.А. 12.11.25--
		
		Движ=Движения.ТТ_ОстаткиВозмещений.Добавить();
		Движ.Период=ЭтотОбъект.Дата;
		дВиж.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движ.Автомобиль=Стр.Автомобиль;
		Движ.Поставщик = Стр.Скидка.Контрагент;
		Движ.ТипСкидки=Стр.Скидка;
		Движ.СуммаКПодтверждению=Стр.СуммаВозмещения;
		Движ.СуммаНДСКПодтверждению=Стр.СуммаНДС;  
		
		//Бизтех Горковенко П.А. 12.11.25++
		//Оплаты возмещений
		Движения.ТТ_ОстаткиОплатВозмещений.Записывать=Истина;
		Движ=Движения.ТТ_ОстаткиОплатВозмещений.Добавить();
		Движ.Период=ЭтотОбъект.Дата; 
		дВиж.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движ.Автомобиль=Стр.Автомобиль;
		Движ.ТипСкидки=Стр.Скидка;
		Движ.Сумма=Стр.СуммаВозмещения;
		Движ.СуммаНДС=Стр.СуммаНДС; 
		//Бизтех Горковенко П.А. 12.11.25--

		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Автомобиль = Стр.Автомобиль;
		НоваяЗапись.СтатусВозмещения = Справочники.ТТ_СтатусыВозмещений.Ответ;
		НоваяЗапись.Скидка = Стр.Скидка;
		НоваяЗапись.Период = Ссылка.Дата;
		НоваяЗапись.СуммаВозмещения = Стр.СуммаВозмещения;
		НоваяЗапись.СуммаНДС = Стр.СуммаНДС;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(ИСТИНА);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Дата=ТекущаяДата();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетДистрибьютораОПродажеАвтомобилей") Тогда
		Скидки.Очистить();
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		ПодразделениеКомпании = ДанныеЗаполнения.ПодразделениеКомпании;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		//ПрограммаВозмещения = ДанныеЗаполнения.ПрограммаВозмещения; 
		СписокПрограмм = ДанныеЗаполнения.СписокПрограмм;//БизТех Горковенко П.А. 30.11.25++
		
		Для Каждого ТекСтрокаСкидки Из ДанныеЗаполнения.Скидки Цикл
			НоваяСтрока = Скидки.Добавить();
			НоваяСтрока.Автомобиль = ТекСтрокаСкидки.Автомобиль;
			НоваяСтрока.Скидка = ТекСтрокаСкидки.Скидка;
			НоваяСтрока.СтавкаНДС = ТекСтрокаСкидки.СтавкаНДС; 
			НоваяСтрока.СуммаВозмещения = ТекСтрокаСкидки.СуммаВозмещения;
			НоваяСтрока.СуммаНДС = ТекСтрокаСкидки.СуммаНДС;
			ЗаполнитьТекВозмещение(НоваяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	Автор=ПараметрыСеанса.Пользователь;
	
КонецПроцедуры

