
Функция РазобратьСтроку(СтрокаДляРазбора) Экспорт
	ТаблицаБлоков=Новый ТаблицаЗначений;
	ТаблицаБлоков.Колонки.Добавить("ТекстБлока");
	ТаблицаБлоков.Колонки.Добавить("Параметр");
	ТаблицаБлоков.Колонки.Добавить("ВидСравнения");
	ТаблицаБлоков.Колонки.Добавить("Условие");
	ТаблицаБлоков.Колонки.Добавить("ВнутренняяТаблица");
	ТаблицаБлоков.Колонки.Добавить("НачалоБлока");
	ТаблицаБлоков.Колонки.Добавить("КонецБлока");
	ТаблицаСкобок=ПолучитьМассивСкобок(СтрокаДляРазбора);
	СчетчикОткрытыхСкобок=0;
	Для Каждого СтрокаСкобки Из ТаблицаСкобок Цикл
		Если СчетчикОткрытыхСкобок = 0 Тогда
			НоваяСтрокаБлока = ТаблицаБлоков.Добавить();
			НоваяСтрокаБлока.НачалоБлока = СтрокаСкобки.НомерСимвола;
		КонецЕсли;
		Если СтрокаСкобки.Скобка = "(" Тогда
			СчетчикОткрытыхСкобок = СчетчикОткрытыхСкобок + 1;
		ИначеЕсли СтрокаСкобки.Скобка = ")" Тогда
			СчетчикОткрытыхСкобок = СчетчикОткрытыхСкобок - 1;
		КонецЕсли;
		Если СчетчикОткрытыхСкобок = 0 Тогда
			НоваяСтрокаБлока.КонецБлока = СтрокаСкобки.НомерСимвола;
			НоваяСтрокаБлока.ТекстБлока = Сред(СтрокаДляРазбора, НоваяСтрокаБлока.НачалоБлока+1, НоваяСтрокаБлока.КонецБлока - НоваяСтрокаБлока.НачалоБлока-1);
			НоваяСтрокаБлока.ВнутренняяТаблица = РазобратьСтроку(НоваяСтрокаБлока.ТекстБлока);
			НоваяСтрокаБлока.Условие = Сред(СтрокаДляРазбора, НоваяСтрокаБлока.КонецБлока + 1, 5);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаБлоков;
КонецФункции

Процедура СформироватьДеревоПоТаблицеБлоков(ДеревоУсловийВнутр, ТаблицаБлоков, ТекстБлока = "") Экспорт
	ДеревоУсловийЛок = ДеревоУсловийВнутр;
	Если ТаблицаБлоков.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	Если Найти(ТаблицаБлоков[0].Условие,"ИЛИ")>0 Тогда
		НоваяСтрока=ДеревоУсловийЛок.Строки.Добавить();
		НоваяСтрока.Параметр = "Группа ИЛИ";
		ДеревоУсловийЛок = НоваяСтрока;
	ИначеЕсли Найти(ТаблицаБлоков[0].Условие,"И ")>0 Тогда
		НоваяСтрока=ДеревоУсловийЛок.Строки.Добавить();
		НоваяСтрока.Параметр = "Группа И";
		ДеревоУсловийЛок = НоваяСтрока;
	КонецЕсли;	
	Для Каждого СтрокаБлоков Из ТаблицаБлоков Цикл 
		Если Не СтрокаБлоков.ВнутренняяТаблица=Неопределено И СтрокаБлоков.ВнутренняяТаблица.Количество()>0 Тогда
			СформироватьДеревоПоТаблицеБлоков(ДеревоУсловийЛок, СтрокаБлоков.ВнутренняяТаблица, СтрокаБлоков.ТекстБлока);	
		Иначе
			НоваяСтрока=ДеревоУсловийЛок.Строки.Добавить();
			СформироватьСтрокуДерева(НоваяСтрока, СтрокаБлоков.ТекстБлока);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСтрокуДерева(Строка, Текст)
	НачалоПеременной=Найти(Текст, "@@");
	Если НачалоПеременной>0 Тогда  
		ПодстрокаДляПоиска=Сред(Текст, НачалоПеременной+2);
		КонецПеременной=Найти(ПодстрокаДляПоиска, "/@@");
		Если КонецПеременной=0 Тогда
			Переменная=ПодстрокаДляПоиска;
		Иначе
			Переменная=Лев(ПодстрокаДляПоиска, КонецПеременной-1);
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Переменная) Тогда
		Возврат;
	КонецЕсли;
	Если Переменная="Организация" Тогда
		Строка.Параметр="Организация";
	ИначеЕсли Переменная="Пользователь" Тогда
		Строка.Параметр="Пользователь";
	Иначе
		Строка.Параметр=ПредопределенноеЗначение("ПланВидовХарактеристик.РеквизитыЗаявокПользователей."+Переменная);
	КонецЕсли;		
	ВидСравненияУсловия = Найти(Текст, "НайтиПоНаименованию");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+20);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки-1);
		Строка.ВидСравнения = "Найти по наименованию";
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "НЕ ОбъектВИерархии");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+19);
		НачалоУсловия = Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки);
		Строка.ВидСравнения = "Не в иерархии";
		Вывод=Неопределено;
		Выполнить("Вывод="+СтрокаУсловия);		
		Строка.Условие = Вывод;	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "ОбъектВИерархии");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+16);
		НачалоУсловия = Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки);
		Строка.ВидСравнения = "В иерархии";
		Вывод=Неопределено;
		Выполнить("Вывод="+СтрокаУсловия);		
		Строка.Условие = Вывод;	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "НЕ ОбъектРавен");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+15);
		НачалоУсловия = Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки);
		Строка.ВидСравнения = "<>";
		Вывод=Неопределено;
		Выполнить("Вывод="+СтрокаУсловия);		
		Строка.Условие = Вывод;	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "ОбъектРавен");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+12);
		НачалоУсловия = Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки);
		Строка.ВидСравнения = "=";
		Вывод=Неопределено;
		Выполнить("Вывод="+СтрокаУсловия);		
		Строка.Условие = Вывод;	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "НайтиПоКоду");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+12);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки-1);
		Строка.ВидСравнения = "Найти по коду";
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");	
		Перейти ~Преобразование;
	КонецЕсли;
	ВидСравненияУсловия = Найти(Текст, "Найти");
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+6);
		НачалоУсловия=Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КоличествоОткрытыхСкобок = 1;
		Для Ц = 1 По СтрДлина(СтрокаУсловия) Цикл
			СимволЦ=Сред(СтрокаУсловия, Ц,1);	
			Если СимволЦ="(" Тогда
				КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок + 1;
			КонецЕсли;
			Если СимволЦ=")" Тогда
				КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок - 1;
				Если КоличествоОткрытыхСкобок=0 Тогда
					КонецСтроки=Ц;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки-1);
		Если Найти(Текст, ".Наименование") > 0 Тогда
			Строка.ВидСравнения = "Наименование содержит";
		ИначеЕсли Найти(Текст, ".Код") > 0 Тогда
			Строка.ВидСравнения = "Код содержит";
		Иначе
			Строка.ВидСравнения = "Содержит";
		КонецЕсли;
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");	
		Перейти ~Преобразование;
	КонецЕсли;
	Если ВидСравненияУсловия>0 Тогда
		СтрокаУсловия=Сред(Текст, ВидСравненияУсловия+6);
		НачалоУсловия=Найти(СтрокаУсловия,",");
		СтрокаУсловия=Сред(СтрокаУсловия, НачалоУсловия+1);
		КонецСтроки=Найти(СтрокаУсловия,")");
		СтрокаУсловия=Лев(СтрокаУсловия, КонецСтроки-1);
		Если Найти(Текст, ".Наименование") > 0 Тогда
			Строка.ВидСравнения = "Наименование содержит";
		ИначеЕсли Найти(Текст, ".Код") > 0 Тогда
			Строка.ВидСравнения = "Код содержит";
		Иначе
			Строка.ВидСравнения = "Содержит";
		КонецЕсли;
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");	
		Перейти ~Преобразование;
	КонецЕсли;
	НачалоУсловия = КонецПеременной+5;
	ОдносимвольноеУсловие = Сред(Текст, НачалоУсловия,1);
	ДвухсимвольноеУсловие = Сред(Текст, НачалоУсловия,2);
	Если ДвухсимвольноеУсловие="<>" ИЛИ ОдносимвольноеУсловие=">=" ИЛИ ОдносимвольноеУсловие="<=" Тогда
		Строка.ВидСравнения = ДвухсимвольноеУсловие;
		СтрокаУсловия = Сред(Текст, НачалоУсловия+2);
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");
		Если Найти(СтрокаУсловия, "Перечисления")>0 Тогда
			Строка.Условие=ПредопределенноеЗначение(СтрЗаменить(СтрокаУсловия, "Перечисления", "Перечисление"));
		КонецЕсли;
		Перейти ~Преобразование;
	КонецЕсли;	
	Если ОдносимвольноеУсловие="=" ИЛИ ОдносимвольноеУсловие=">" ИЛИ ОдносимвольноеУсловие="<" Тогда
		Строка.ВидСравнения = ОдносимвольноеУсловие;
		СтрокаУсловия = Сред(Текст, НачалоУсловия+1);;
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """""", "{}");		
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, """", "");		
		Строка.Условие = СтрЗаменить(СтрокаУсловия, "{}", """");
		Если Найти(СтрокаУсловия, "Перечисления")>0 Тогда
			Строка.Условие=ПредопределенноеЗначение(СтрЗаменить(СтрокаУсловия, "Перечисления", "Перечисление"));
		КонецЕсли;
		Перейти ~Преобразование;
	КонецЕсли;
~Преобразование:
	Если Строка.ВидСравнения = "Найти по наименованию" ИЛИ Строка.ВидСравнения = "Найти по коду" 
		ИЛИ Строка.ВидСравнения = "Наименование содержит" ИЛИ Строка.ВидСравнения = "Код содержит" Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
		Строка.Условие=ОписаниеТипа.ПривестиЗначение(Строка.Условие);
	Иначе
		Строка.Условие=Строка.Параметр.ТипЗначения.ПривестиЗначение(Строка.Условие);			
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьМассивСкобок(СтрокаДляРазбора)
	ТаблицаСкобок=Новый ТаблицаЗначений;
	ТаблицаСкобок.Колонки.Добавить("Скобка");
	ТаблицаСкобок.Колонки.Добавить("НомерСимвола");	
	Для Ц=1 По СтрДлина(СтрокаДляРазбора) Цикл
		СимволЦ=Сред(СтрокаДляРазбора, Ц,1);	
		Если СимволЦ="(" ИЛИ СимволЦ=")" Тогда
			Попытка
				ШаблонНайтиПоКоду=Сред(СтрокаДляРазбора, Ц-15, 15);
				Если ШаблонНайтиПоКоду="ОбъектВИерархии" Тогда
					Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
						СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
						Если СимволЦ=")" Тогда
							Ц=Й;
							Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
								СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
								Если СимволЦ=")" Тогда
									Ц=Й;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Продолжить;
				КонецЕсли;
				ШаблонНайтиПоКоду=Сред(СтрокаДляРазбора, Ц-11, 11);
				Если ШаблонНайтиПоКоду="ОбъектРавен" Тогда
					Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
						СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
						Если СимволЦ=")" Тогда
							Ц=Й;
							Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
								СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
								Если СимволЦ=")" Тогда
									Ц=Й;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Продолжить;
				КонецЕсли;
				ШаблонНайтиПоКоду=Сред(СтрокаДляРазбора, Ц-11, 11);
				Если ШаблонНайтиПоКоду="НайтиПоКоду" Тогда
					Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
						СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
						Если СимволЦ=")" Тогда
							Ц=Й;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Продолжить;
				КонецЕсли;	
				ШаблонНайтиПоНаименованию=Сред(СтрокаДляРазбора, Ц-19, 19);
				Если ШаблонНайтиПоНаименованию="НайтиПоНаименованию" Тогда
					КоличествоОткрытыхСкобок = 1;
					Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
						СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
						Если СимволЦ="(" Тогда
							КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок + 1;
						КонецЕсли;
						Если СимволЦ=")" Тогда
							КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок - 1;
							Если КоличествоОткрытыхСкобок=0 Тогда
								Ц=Й;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Продолжить;
				КонецЕсли;	
				ШаблонНайти=Сред(СтрокаДляРазбора, Ц-5, 5);
				Если ШаблонНайти="Найти" Тогда
					КоличествоОткрытыхСкобок = 1;
					Для Й=Ц+1 ПО СтрДлина(СтрокаДляРазбора) Цикл
						СимволЦ=Сред(СтрокаДляРазбора, Й,1);	
						Если СимволЦ="(" Тогда
							КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок + 1;
						КонецЕсли;
						Если СимволЦ=")" Тогда
							КоличествоОткрытыхСкобок = КоличествоОткрытыхСкобок - 1;
							Если КоличествоОткрытыхСкобок=0 Тогда
								Ц=Й;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Продолжить;
				КонецЕсли;		
			Исключение
			КонецПопытки;
			НоваяСтрокаТаблицыБлоков=ТаблицаСкобок.Добавить();
			НоваяСтрокаТаблицыБлоков.Скобка = СимволЦ;
			НоваяСтрокаТаблицыБлоков.НомерСимвола = Ц;
		КонецЕсли;
	КонецЦикла;
	Возврат ТаблицаСкобок;
КонецФункции


Процедура УдалитьПрежниеЗаписи(	ВидЗаявки,
								Роль,
								Согласующий) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Заместители.КтоЗамещает,
	//	|	Заместители.НачалоПериода,
	//	|	ВЫБОР
	//	|		КОГДА Заместители.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	//	|			ТОГДА ДАТАВРЕМЯ(2032, 1, 1)
	//	|		ИНАЧЕ Заместители.КонецПериода
	//	|	КОНЕЦ КАК КонецПериода
	//	|ПОМЕСТИТЬ ВТ
	//	|ИЗ
	//	|	РегистрСведений.Заместители КАК Заместители
	//	|ГДЕ
	//	|	Заместители.ВидЗаместителя = &ВидЗаместителя
	//	|	И Заместители.КогоЗамещает = &Согласующий
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс,
	//	|	""Заместитель"" КАК Согласование,
	//	|	NULL КАК Заместитель,
	//	|	ВТ.КтоЗамещает КАК КтоЗамещает
	//	|ИЗ
	//	|РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	//	|	ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	//	|		ПО ЗадачиОбработкиЗаявокПользователя.Дата >= ВТ.НачалоПериода
	//	|			И ЗадачиОбработкиЗаявокПользователя.Дата <= ВТ.КонецПериода
	//	|	ПО ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".Основание", "") +"
	//	|ГДЕ
	//	|	ОтветственныеПоЗаявкамПользователей.Роль = &Роль
	//	|	И ОтветственныеПоЗаявкамПользователей.Согласующий = &Согласующий
	//	|	И НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс,
	//	|	""Ответственный"",
	//	|	ЗаместителиОтветственных.Заместитель,
	//	|	NULL
	//	|ИЗ
	//	|РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	//	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаместителиОтветственных КАК ЗаместителиОтветственных
	//	|	ПО (ИСТИНА)
	//	|	ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//	|	ПО ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".Основание", "") + "
	//	|ГДЕ
	//	|	НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//	|	И ОтветственныеПоЗаявкамПользователей.Роль = &Роль
	//	|	И ОтветственныеПоЗаявкамПользователей.Согласующий = &Согласующий
	//	|	И ЗаместителиОтветственных.Роль = &Роль
	//	|	И ЗаместителиОтветственных.Ответственный = &Согласующий
	//	|	И ЗаместителиОтветственных.ВидЗаявки = &ВидЗаявки";
	//	
	//Запрос.УстановитьПараметр("ВидЗаместителя", Перечисления.ВидыЗаместителей.ОтветственныйПоЗаявкам);
	//Запрос.УстановитьПараметр("Роль", Роль);
	//Запрос.УстановитьПараметр("Согласующий", Согласующий);
	//Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаявки);

	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//	НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//	НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//	НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Согласующий);
	//	НаборПрежнихЗаписей.Записать();
	//	Если ЗначениеЗаполнено(Выборка.Заместитель) Тогда
	//		НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//		НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//		НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//		НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Выборка.Заместитель);
	//		НаборПрежнихЗаписей.Записать();
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Выборка.КтоЗамещает) Тогда
	//		НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//		НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//		НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//		НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Выборка.КтоЗамещает);
	//		НаборПрежнихЗаписей.Записать();
	//	КонецЕсли;
	//КонецЦикла;
	
КонецПроцедуры	

#Область ПересчетАдресатов

Процедура ВыполнитьПересчетПриСохраненииАдресатовЗаявки(Пользователь, Роль, ВидЗаявки) Экспорт
		
	//Согласующий = Пользователь;
	//ВидЗаявкиПеречисление = ВидЗаявки;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	АдресатыЗаявок.Роль КАК Роль,
	//	|	АдресатыЗаявок.ВидЗаявки КАК ВидЗаявки,
	//	|	АдресатыЗаявок.Согласующий КАК Согласующий,
	//	|	АдресатыЗаявок.УсловиеОтбораКомпановка КАК УсловиеОтбораКомпановка
	//	|ИЗ
	//	|	РегистрСведений.АдресатыЗаявок КАК АдресатыЗаявок
	//	|ГДЕ
	//	|	АдресатыЗаявок.Роль = &Роль
	//	|	И АдресатыЗаявок.ВидЗаявки = &ВидЗаявки
	//	|	И АдресатыЗаявок.Согласующий = &Согласующий";
	//
	//Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаявкиПеречисление);
	//Запрос.УстановитьПараметр("Роль", Роль);
	//Запрос.УстановитьПараметр("Согласующий", Согласующий);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	УсловиеОтбораКомпановка = ВыборкаДетальныеЗаписи.УсловиеОтбораКомпановка;
	//Иначе
	//	Возврат;
	//КонецЕсли;
	//
	//// Удалим прежние записи и получим список затронутых заявок
	//ТЗУдаленныхЗаявок = УдалитьПрежниеЗаписиАдресата(ВидЗаявки, Роль, Согласующий);
	//
	//// Получим все заявки, по которым необходимо сделать пересчет
	//ОтобранныеЗаявки = ПоискЗаявокДляСогласованияАдресата(ВидЗаявки, Роль, Согласующий, УсловиеОтбораКомпановка);
	//
	//// Осуществим пересчет ответственных и задач по заявкам
	//Заявки = ДобавлениеНовыхЗаписейАдресата(ОтобранныеЗаявки, ВидЗаявки, Роль, Согласующий);
	
	
КонецПроцедуры

Функция УдалитьПрежниеЗаписиАдресата (ВидЗаявки, Роль, Согласующий) Экспорт
		
	//// Сначала очищаем все незавершенные заявки, где есть наш адресат
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Заместители.КтоЗамещает,
	//|	Заместители.НачалоПериода,
	//|	ВЫБОР
	//|		КОГДА Заместители.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ДАТАВРЕМЯ(2032, 1, 1)
	//|		ИНАЧЕ Заместители.КонецПериода
	//|	КОНЕЦ КАК КонецПериода
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	РегистрСведений.Заместители КАК Заместители
	//|ГДЕ
	//|	Заместители.ВидЗаместителя = &ВидЗаместителя
	//|	И Заместители.КогоЗамещает = &Согласующий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс,
	//|	""Заместитель"" КАК Согласование,
	//|	NULL КАК Заместитель,
	//|	ВТ.КтоЗамещает КАК КтоЗамещает
	//|ИЗ
	//|РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	//|		ПО ЗадачиОбработкиЗаявокПользователя.Дата >= ВТ.НачалоПериода
	//|			И ЗадачиОбработкиЗаявокПользователя.Дата <= ВТ.КонецПериода
	//|	ПО ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".Основание", "") +"
	//|ГДЕ
	//|	ОтветственныеПоЗаявкамПользователей.Роль = &Роль
	//|	И ОтветственныеПоЗаявкамПользователей.Согласующий = &Согласующий
	//|	И НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс,
	//|	""Ответственный"",
	//|	ЗаместителиОтветственных.Заместитель,
	//|	NULL
	//|ИЗ
	//|РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗаместителиОтветственных КАК ЗаместителиОтветственных
	//|	ПО (ИСТИНА)
	//|	ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//|	ПО ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".Основание", "") + "
	//|ГДЕ
	//|	НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//|	И ОтветственныеПоЗаявкамПользователей.Роль = &Роль
	//|	И ОтветственныеПоЗаявкамПользователей.Согласующий = &Согласующий
	//|	И ЗаместителиОтветственных.Роль = &Роль
	//|	И ЗаместителиОтветственных.Ответственный = &Согласующий
	//|	И ЗаместителиОтветственных.ВидЗаявки = &ВидЗаявки";
	//
	//Запрос.УстановитьПараметр("ВидЗаместителя", Перечисления.ВидыЗаместителей.ОтветственныйПоЗаявкам);
	//Запрос.УстановитьПараметр("Роль", Роль);
	//Запрос.УстановитьПараметр("Согласующий", Согласующий);
	//Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаявки);
	//
	//Результат = Запрос.Выполнить();
	//ТЗ = Результат.Выгрузить();
	//ТЗ.Свернуть("Заместитель, КтоЗамещает", "");
	//МассивЗамов = Новый Массив;
	//Для Каждого ТекСтр Из ТЗ Цикл
	//	Если ЗначениеЗаполнено(ТекСтр.Заместитель) Тогда
	//		МассивЗамов.Добавить(ТекСтр.Заместитель);
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(ТекСтр.КтоЗамещает) Тогда
	//		МассивЗамов.Добавить(ТекСтр.КтоЗамещает);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// Получим все затронутые заявки для дальнейшей обработки
	//ТЗУдаленныхЗаявок = Результат.Выгрузить();
	//ТЗУдаленныхЗаявок.Свернуть("БизнесПроцесс", "");	
	//
	//// Очищаем адресата и его заместителей в регистре ответственных
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//	НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//	НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//	НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Согласующий);
	//	НаборПрежнихЗаписей.Записать();
	//	Если ЗначениеЗаполнено(Выборка.Заместитель) Тогда
	//		НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//		НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//		НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//		НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Выборка.Заместитель);
	//		НаборПрежнихЗаписей.Записать();
	//	КонецЕсли;
	//	Если ЗначениеЗаполнено(Выборка.КтоЗамещает) Тогда
	//		НаборПрежнихЗаписей = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//		НаборПрежнихЗаписей.Отбор.ЗаявкаПользователя.Установить(Выборка.БизнесПроцесс);
	//		НаборПрежнихЗаписей.Отбор.Роль.Установить(Роль);
	//		НаборПрежнихЗаписей.Отбор.Согласующий.Установить(Выборка.КтоЗамещает);
	//		НаборПрежнихЗаписей.Записать();
	//	КонецЕсли;
	//КонецЦикла;

	//Возврат ТЗУдаленныхЗаявок;
	
КонецФункции	

Функция ПоискЗаявокДляСогласованияАдресата(ВидЗаявки, Роль, Согласующий, УсловиеОтбораКомпановка, РассчитатьВыполненныеЗадачи = Истина, ПроверяемаяЗаявка = Неопределено) Экспорт
	
	//ОтобранныеЗаявки		= Новый СписокЗначений;
	//ВидЗаявкиПеречисление	= ВидЗаявки;
	//МассивЗаявок			= Новый СписокЗначений;
	//
	//Если ВидЗаявки = Перечисления.ВидыЗаявок.АктуализацияДанных Тогда
	//	Возврат ОтобранныеЗаявки;
	//КонецЕсли;
	//
	//ВидЗаявкиСтрока = СтрЗаменить(ВидЗаявки, " ", "");
	//Если ВидЗаявкиПеречисление = Перечисления.ВидыЗаявок.ЗаявкаФД Тогда
	//	ВидЗаявкиСтрока = "ЗаявкиФинансовогоДепартамента";
	//ИначеЕсли ВидЗаявкиПеречисление = Перечисления.ВидыЗаявок.ЗаявкаНаЗакупкуПОДляВнутреннихНуждНовая Тогда
	//	ВидЗаявкиСтрока = "ЗаявкаНаЗакупкуПОДляВнутреннихНужд";
	//ИначеЕсли ВидЗаявкиПеречисление = Перечисления.ВидыЗаявок.ЗаявкаНаМТО Тогда
	//	ВидЗаявкиСтрока = "СогласованиеСтрокТЧ";
	//ИначеЕсли ВидЗаявкиПеречисление = Перечисления.ВидыЗаявок.ЗаявкаНаИзменениеПлановогоСрокаЗакрытияСметы Тогда
	//	ВидЗаявкиСтрока = "ЗаявкаНаИзменениеПлановогоСрокаСметы";
	//КонецЕсли;
	//	
	//Если ПроверяемаяЗаявка <> Неопределено Тогда
	//	
	//	МассивЗаявок.Добавить(ПроверяемаяЗаявка);
	//	
	//Иначе
	//	
	//	Запрос = Новый Запрос;
	//	Если Роль = Перечисления.РолиАдресатовЗаявок.Контролёр Тогда
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	"+ВидЗаявкиСтрока+".Ссылка
	//		|ИЗ
	//		|	БизнесПроцесс."+ВидЗаявкиСтрока+" КАК "+ВидЗаявкиСтрока+"
	//		|ГДЕ
	//		|	НЕ "+ВидЗаявкиСтрока+".Завершен
	//		|	И НЕ "+ВидЗаявкиСтрока+".Отменен
	//		|	И НЕ "+ВидЗаявкиСтрока+".ПометкаУдаления
	//		|	И "+ВидЗаявкиСтрока+".Дата >= &АктуальнаяДата";
	//		Запрос.УстановитьПараметр("АктуальнаяДата", ТекущаяДата() - 60*60*24*60);
	//	Иначе
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//		|	"+ВидЗаявкиСтрока+""+?(ВидЗаявкиСтрока="СогласованиеСтрокТЧ", ".УникальныйИдентификаторСтроки", ".Ссылка")+" КАК Ссылка
	//		|ИЗ
	//		|	БизнесПроцесс."+ВидЗаявкиСтрока+" КАК "+ВидЗаявкиСтрока+"
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//		|		ПО "+ВидЗаявкиСтрока+".Ссылка = ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЗаявокПоСтрокам.СрезПоследних(, ) КАК СтатусыЗаявокПоСтрокамСрезПоследних
	//		|		ПО "+ВидЗаявкиСтрока+".Ссылка = СтатусыЗаявокПоСтрокамСрезПоследних.ЗаявкаПользователя
	//		|ГДЕ
	//		|	ЗадачиОбработкиЗаявокПользователя.ВидЗаявки = &ВидЗаявкиПеречисление
	//		|	И ЗадачиОбработкиЗаявокПользователя.Роль = &Роль
	//		|	И НЕ "+ВидЗаявкиСтрока+".Завершен
	//		|	И НЕ ЗадачиОбработкиЗаявокПользователя.Отменена
	//		|	И НЕ "+ВидЗаявкиСтрока+".Отменен
	//		|	И НЕ "+ВидЗаявкиСтрока+".ПометкаУдаления
	//		|	И НЕ ЗадачиОбработкиЗаявокПользователя.ПометкаУдаления";
	//		Если ВидЗаявкиСтрока = "СогласованиеСтрокТЧ" Тогда
	//			Запрос.Текст = Запрос.Текст + 
	//			" И НЕ "+ВидЗаявкиСтрока+".Основание.Завершен
	//			|	И НЕ "+ВидЗаявкиСтрока+".Основание.Отменен
	//			|	И НЕ "+ВидЗаявкиСтрока+".Основание.ПометкаУдаления";
	//		КонецЕсли;
	//		Запрос.Текст = Запрос.Текст + 
	//		" И ВЫБОР
	//		|			КОГДА &РассчитатьВыполненныеЗадачи = ЛОЖЬ
	//		|				ТОГДА НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//		|			ИНАЧЕ ИСТИНА
	//		|		КОНЕЦ";
	//	КонецЕсли;
	//	
	//	Запрос.УстановитьПараметр("ВидЗаявкиСтрока", ВидЗаявкиСтрока);
	//	Запрос.УстановитьПараметр("ВидЗаявкиПеречисление", ВидЗаявкиПеречисление);
	//	Запрос.УстановитьПараметр("РассчитатьВыполненныеЗадачи", РассчитатьВыполненныеЗадачи);
	//	Запрос.УстановитьПараметр("Роль", Роль);
	//	
	//	Результат = Запрос.Выполнить();
	//	
	//	МассивЗаявок.ЗагрузитьЗначения(Результат.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	//	
	//КонецЕсли;

	//Если ВидЗаявкиПеречисление			= Перечисления.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС Тогда
	//	СКД = РегистрыСведений.АдресатыЗаявок.ПолучитьМакет("ЗаявкаНаСогласованиеЗаявокДДС");
	//КонецЕсли;
	//
	//НастройкиАдресата				= УсловиеОтбораКомпановка.Получить();  
	//
	//КомпоновщикНастроек				= Новый КомпоновщикНастроекКомпоновкиДанных;
	//АдресВременногоХранилищаСхемы	= ПоместитьВоВременноеХранилище(СКД);
	//КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилищаСхемы));
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиАдресата);
	//КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);	
	//Настройки						= КомпоновщикНастроек.ПолучитьНастройки();
	//ЗаявкаПараметр					= Настройки.ПараметрыДанных.Элементы.Найти("Заявка");
	//СКД.Параметры.Заявка.Значение	= МассивЗаявок;
	//
	//ЗаявкаПараметр.Значение			= МассивЗаявок;
	//ЗаявкаПараметр.Использование	= Истина;     
	//КомпоновщикМакета				= Новый КомпоновщикМакетаКомпоновкиДанных;
	//МакетКомпоновки					= КомпоновщикМакета.Выполнить(СКД, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//ПроцессорКомпоновкиДанных		= Новый ПроцессорКомпоновкиДанных;
	//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	//
	//ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	//Пока ЭлементРезультата <> Неопределено Цикл
	//	КоличествоПараметров		= ЭлементРезультата.ЗначенияПараметров.Количество();
	//	Если КоличествоПараметров > 0 Тогда
	//		Если КоличествоПараметров = 1 И ВидЗаявки <> "СогласованиеСтрокТЧ" Тогда
	//			Структура			= Новый Структура;
	//			Структура.Вставить("Заявка", ЭлементРезультата.ЗначенияПараметров[0].Значение);
	//			Структура.Вставить("НомерСтроки", 0);
	//			ОтобранныеЗаявки.Добавить(Структура);
	//		КонецЕсли;
	//		Для н=1 по КоличествоПараметров-1 Цикл
	//			Структура			= Новый Структура;
	//			Если ВидЗаявки <> "СогласованиеСтрокТЧ" Тогда 
	//				Структура.Вставить("Заявка", ЭлементРезультата.ЗначенияПараметров[0].Значение);
	//				Если ЗначениеЗаполнено(ЭлементРезультата.ЗначенияПараметров[н].Значение) Тогда
	//					Структура.Вставить("НомерСтроки", ЭлементРезультата.ЗначенияПараметров[н].Значение);
	//				Иначе
	//					Структура.Вставить("НомерСтроки", 0);
	//				КонецЕсли;
	//				ОтобранныеЗаявки.Добавить(Структура);
	//			Иначе
	//				Если н=2 И ЗначениеЗаполнено(ЭлементРезультата.ЗначенияПараметров[н].Значение) Тогда
	//					Структура.Вставить("Заявка", ЭлементРезультата.ЗначенияПараметров[0].Значение);
	//					Структура.Вставить("НомерСтроки", ЭлементРезультата.ЗначенияПараметров[н].Значение);
	//					ОтобранныеЗаявки.Добавить(Структура);
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//	ЭлементРезультата			= ПроцессорКомпоновкиДанных.Следующий();
	//КонецЦикла;
	//Если ВидЗаявки <> "СогласованиеСтрокТЧ" Тогда
	//	и1=0;
	//	ВсегоЭлементов = ОтобранныеЗаявки.Количество();
	//	Пока и1 < ВсегоЭлементов Цикл
	//		и2 = и1+1;
	//		Пока и2 < ВсегоЭлементов Цикл
	//			Если ОтобранныеЗаявки[и1].Значение.Заявка = ОтобранныеЗаявки[и2].Значение.Заявка и ОтобранныеЗаявки[и1].Значение.НомерСтроки = 0 Тогда
	//				ОтобранныеЗаявки.Удалить(и1);
	//				ВсегоЭлементов = ВсегоЭлементов - 1;
	//			КонецЕсли;
	//			и2 = и2+1;
	//		КонецЦикла;
	//		и1 = и1+1;
	//	КонецЦикла;
	//КонецЕсли;	
	//
	//Возврат ОтобранныеЗаявки;
	
КонецФункции
	
Функция ДобавлениеНовыхЗаписейАдресата(ОтобранныеЗаявки, ВидЗаявки, Роль, Согласующий) Экспорт
	
	//Заявки = Новый Массив;
	//
	//Для Каждого ЭлементМассива Из ОтобранныеЗаявки Цикл
	//	Если Заявки.Найти(ЭлементМассива.Значение.Заявка) = Неопределено Тогда
	//		Если ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО Тогда
	//			Заявки.Добавить(ЭлементМассива.Значение.НомерСтроки);
	//		Иначе
	//			Заявки.Добавить(ЭлементМассива.Значение.Заявка);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	Заместители.КтоЗамещает,
	//|	Заместители.НачалоПериода,
	//|	ВЫБОР
	//|		КОГДА Заместители.КонецПериода = ДАТАВРЕМЯ(1, 1, 1)
	//|			ТОГДА ДАТАВРЕМЯ(2032, 1, 1)
	//|		ИНАЧЕ Заместители.КонецПериода
	//|	КОНЕЦ КАК КонецПериода
	//|ПОМЕСТИТЬ ВТ
	//|ИЗ
	//|	РегистрСведений.Заместители КАК Заместители
	//|ГДЕ
	//|	Заместители.ВидЗаместителя = &ВидЗаместителя
	//|	И Заместители.КогоЗамещает = &Согласующий
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаместителиОтветственных.Заместитель
	//|ПОМЕСТИТЬ ВТЗам
	//|ИЗ
	//|	РегистрСведений.ЗаместителиОтветственных КАК ЗаместителиОтветственных
	//|ГДЕ
	//|	ЗаместителиОтветственных.Ответственный = &Согласующий
	//|	И ЗаместителиОтветственных.ВидЗаявки = &ВидЗаявки
	//|	И ЗаместителиОтветственных.Роль = &Роль
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗадачиУтверждения.Ссылка КАК ЗадачаУтверждения,
	//|	УтвержденияЗаявок.Ссылка КАК БПУтверждения,
	//|	ЗадачиОбработкиЗаявокПользователя.Ссылка КАК ЗадачаОбработки,
	//|	ВТ.КтоЗамещает КАК КтоЗамещает,
	//|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".Основание", "") + " КАК Заявка,
	//|	ВТЗам.Заместитель
	//|ИЗ
	//|	Задача.ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	//|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.УтвержденияЗаявок КАК УтвержденияЗаявок
	//|			ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачиУтверждения КАК ЗадачиУтверждения
	//|			ПО УтвержденияЗаявок.Ссылка = ЗадачиУтверждения.БизнесПроцесс
	//|		ПО ЗадачиОбработкиЗаявокПользователя.Ссылка = УтвержденияЗаявок.ВедущаяЗадача
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	//|		ПО ЗадачиОбработкиЗаявокПользователя.Дата >= ВТ.НачалоПериода
	//|			И ЗадачиОбработкиЗаявокПользователя.Дата <= ВТ.КонецПериода
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗам КАК ВТЗам
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс" + ?(ВидЗаявки = Перечисления.ВидыЗаявок.ЗаявкаНаМТО, ".УникальныйИдентификаторСтроки", "") + " В(&Заявки)
	//|	И НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	//|	И ЗадачиУтверждения.Роль = &Роль  
	//|УПОРЯДОЧИТЬ ПО
	//|	ЗадачаОбработки,
	//|	ВТЗам.Заместитель,
	//|	КтоЗамещает
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Запрос.УстановитьПараметр("Заявки", Заявки);
	//Запрос.УстановитьПараметр("ВидЗаместителя", Перечисления.ВидыЗаместителей.ОтветственныйПоЗаявкам);
	//Запрос.УстановитьПараметр("Роль", Роль);
	//Запрос.УстановитьПараметр("Согласующий", Согласующий);
	//Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаявки);
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//Если Роль = Перечисления.РолиАдресатовЗаявок.Контролёр Тогда
	//	ТЗ.Свернуть("Заявка","");
	//	ТЗ.Колонки.Добавить("Заместитель");
	//	ТЗ.Колонки.Добавить("КтоЗамещает");
	//КонецЕсли;
	//
	//Для Каждого ЭлементМассива из ОтобранныеЗаявки Цикл
	//	ЗаписьОтветственного = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьМенеджерЗаписи();
	//	ЗаписьОтветственного.ЗаявкаПользователя = ЭлементМассива.Значение.Заявка;
	//	ЗаписьОтветственного.Роль = Роль;
	//	ЗаписьОтветственного.Согласующий = Согласующий;
	//	ЗаписьОтветственного.НомерСтрокиТЧ = ЭлементМассива.Значение.НомерСтроки;
	//	ЗаписьОтветственного.Записать();
	//	Для Каждого СтрокаТаблицы из ТЗ Цикл
	//		Если ЭлементМассива.Значение.Заявка = СтрокаТаблицы.Заявка Тогда
	//			Если ЗначениеЗаполнено(СтрокаТаблицы.Заместитель) Тогда
	//				ЗаписьОтветственного = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьМенеджерЗаписи();
	//				ЗаписьОтветственного.ЗаявкаПользователя = СтрокаТаблицы.Заявка;
	//				ЗаписьОтветственного.НомерСтрокиТЧ = ЭлементМассива.Значение.НомерСтроки;
	//				ЗаписьОтветственного.Роль = Роль;
	//				ЗаписьОтветственного.Согласующий = СтрокаТаблицы.Заместитель;
	//				ЗаписьОтветственного.Записать();
	//			КонецЕсли;
	//			Если ЗначениеЗаполнено(СтрокаТаблицы.КтоЗамещает) Тогда
	//				ЗаписьОтветственного = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьМенеджерЗаписи();
	//				ЗаписьОтветственного.ЗаявкаПользователя = СтрокаТаблицы.Заявка;
	//				ЗаписьОтветственного.НомерСтрокиТЧ = ЭлементМассива.Значение.НомерСтроки;
	//				ЗаписьОтветственного.Роль = Роль;
	//				ЗаписьОтветственного.Согласующий = СтрокаТаблицы.КтоЗамещает;
	//				ЗаписьОтветственного.Записать();
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
	//
	//Возврат Заявки;
	
КонецФункции

#КонецОбласти
