Перем Выборка Экспорт;      // данные таблиц
Перем НомерТаблицы Экспорт; // 1 - приемка, 2 - выдача, 3 - невыданные, 4 - в работе
Перем ИмяОбработки Экспорт; // для сохранения настроек

Перем ФИОСервисныйКонсультант;


#Если Клиент Тогда
	
//Возвращает строку для заполнения в ячейку HTML таблицы
Функция ПодготовитьСтроку(Строка) 
	Если обЗначениеНеЗаполнено(Строка) Тогда
		Возврат "&nbsp";
	Иначе
		Возврат Строка;
	КонецЕсли;
КонецФункции //	ПодготовитьСтроку()

//Возвращает в виде текста стиль css в зависимости от цветовой схемы 
Функция ПолучитьМакетСSS(НомерЦветовойСхемы) 
	Если НомерЦветовойСхемы = 1 Тогда
		МакетCSS = ПолучитьМакет("CSSBlue");
	ИначеЕсли НомерЦветовойСхемы = 2 Тогда
		МакетCSS = ПолучитьМакет("CSSGreen");
	ИначеЕсли НомерЦветовойСхемы = 3 Тогда
		МакетCSS = ПолучитьМакет("CSSPurple");
	Иначе
		МакетCSS = ПолучитьМакет("CSSGrey");
 	КонецЕсли;
	Возврат МакетCSS.ПолучитьТекст();	
КонецФункции //	ПолучитьМакетCSS()

//Восстановление сохраненных настроек
Функция ВосстановитьНастройки() Экспорт
	Настройка = ВосстановитьЗначение("Настройка_" + ИмяОбработки);
	Если ТипЗнч(Настройка) = Тип("Соответствие") Тогда
		Для Каждого ТекЗначение Из Настройка Цикл
			Если ТекЗначение.Ключ = "ДатаОтчета" Тогда
				Продолжить;
			КонецЕсли;
			Попытка
				ЭтотОбъект[ТекЗначение.Ключ] = ТекЗначение.Значение;
			Исключение
			КонецПопытки;
		КонецЦикла;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

//Сохранение настроек
Процедура СохранитьНастройки() Экспорт
	Настройка = Новый Соответствие();
	Для Каждого ТекРекв Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		Настройка.Вставить(ТекРекв.Имя, ЭтотОбъект[ТекРекв.Имя]);
	КонецЦикла;
	СохранитьЗначение("Настройка_" + ИмяОбработки, Настройка);
КонецПроцедуры

//Заполняет начальные настройки
//
//Без параметров
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
		ПоказыватьПриемку = Истина;
		
		ПоказыватьВыдачу = Ложь;
		ПоказыватьНевыданные = Ложь;
		ПоказыватьВРаботе = Ложь;
	
	
	Если ПериодСменыСтраниц = 0 Тогда
		ПериодСменыСтраниц = 60;
	КонецЕсли;
	Если СтрокНаСтраницу = 0 Тогда
		СтрокНаСтраницу = 12;
	КонецЕсли;
	Если РазмерШрифта = 0 Тогда
		РазмерШрифта = 18;	
	КонецЕсли;
	Если ЦветоваяСхема = 0 Тогда
		ЦветоваяСхема = 4;	
	КонецЕсли;

	// фильтры
	ДоступныеПоляОтбора.Очистить();
	ПолеНастройки=ДоступныеПоляОтбора.Добавить("Организация","Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПолеНастройки.Отбор=Истина;
	ПолеНастройки=ДоступныеПоляОтбора.Добавить("Подразделение","Подразделение",Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ПолеНастройки.Отбор=Истина;
	ФильтрыОтчета.УстановитьДоступныеПоля(ДоступныеПоляОтбора);
	Если ФильтрыОтчета.Найти("Организация")= Неопределено Тогда
		ФильтрыОтчета.Добавить("Организация","Организация","Организация");
		ФильтрыОтчета.Организация.Значение = ПараметрыСеанса.Пользователь.Организация;
		ФильтрыОтчета.Организация.Использование = Истина;
	КонецЕсли;
	Если ФильтрыОтчета.Найти("Подразделение")= Неопределено Тогда
		ФильтрыОтчета.Добавить("Подразделение","Подразделение","Подразделение");
		ФильтрыОтчета.Подразделение.Значение = ПараметрыСеанса.Пользователь.Подразделение;
		ФильтрыОтчета.Подразделение.Использование = Истина;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьНачальныеНастройки()




//===============--------------->ЗДЕСЬ ОТСЮДА<---------------===============//

Функция ПолучитьМастера()
	//Запрос = Новый Запрос();
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ГрафикРаботКалендарный.График,
	//               |	ГрафикРаботКалендарный.ВидДня
	//               |ИЗ
	//               |	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
	//               |ГДЕ
	//               |	ГрафикРаботКалендарный.Дата Между &ДатаС И &ДатаПо
	//			   |		И ГрафикРаботКалендарный.ВидДня = &ВидДня";
	//
	//
	//ДатаС=НачалоДня(ТекущаяДата());
	//Запрос.УстановитьПараметр("ДатаС", ДатаС);
	//
	//ДатаПо=КонецДня(ТекущаяДата());
	//Запрос.УстановитьПараметр("ДатаПо", ДатаС);
	//
	//
	//ВидДня = Перечисления.ВидДня.Рабочий;
	//запрос.УстановитьПараметр("ВидДня",ВидДня);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Легкоконец = Ложь;
	//Суворов = Ложь;
	//Гомонов = Ложь;
	//Меркулов = Ложь;
	//
	//Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015001").СписокПараметров Цикл
	//	ПутьКФайлу = Стр.ЗначениеПараметра;
	//КонецЦикла;
	//
	//
	//
	//
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	ус = ВыборкаДетальныеЗаписи.График.Наименование;
	//	сус = строка(ус);
	//	
	//	Если сус = "Приемщик Суворов (Шовиков)" Тогда
	//		Суворов = Истина;
	//		ФИОСервисныйКонсультант = "Роман Суворов";
	//		Возврат Строка(ПутьКФайлу) + "\Суворов.JPG"
	//	ИначеЕсли сус = "Приемщик Легкоконец (Шовиков)" Тогда
	//		ФИОСервисныйКонсультант = "Александр Легкоконец";
	//		Легкоконец = Истина;
	//	    Возврат Строка(ПутьКФайлу) + "\Легкоконец.JPG"
	//	ИначеЕсли сус = "Приемщик Гомонов (Шовиков)" Тогда
	//		ФИОСервисныйКонсультант = "Олег Гомонов";
	//		Гомонов = Истина;
	//	    Возврат Строка(ПутьКФайлу) + "\Гомонов.JPG"
	//	ИначеЕсли сус = "Приемщик Меркулов (Шовиков)" Тогда
	//		ФИОСервисныйКонсультант = "Андрей Меркулов";
	//		Гомонов = Истина;
	//	    Возврат Строка(ПутьКФайлу) + "\МеркуловВАЗ.JPG"
	//	Иначе
	//		Возврат Строка(ПутьКФайлу) + "\Empt.JPG"
	//	
	//	КонецЕсли;
	//	
	//	//Сообщить (сус);
	//КонецЦикла;	
КонецФункции

Функция ГрафикМастеров()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Сотрудники.Ссылка КАК Мастер
|ИЗ
|	Справочник.Сотрудники КАК Сотрудники
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
|		ПО Сотрудники.ГрафикРаботы = ГрафикРаботКалендарный.График
|ГДЕ
|	Сотрудники.ФлагУволен = ЛОЖЬ
|	И Сотрудники.ПометкаУдаления = ЛОЖЬ
|	И Сотрудники.Должность = &Должность
|	И ГрафикРаботКалендарный.ВидДня = &ВидДня
|	И Сотрудники.Подразделение = &Подразделение
|
|УПОРЯДОЧИТЬ ПО
|	Сотрудники.Наименование");	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	
	Должность = Справочники.Должности.НайтиПоНаименованию("Мастер-приемщик");
	Запрос.УстановитьПараметр("Должность",Должность);
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидДня.Рабочий);
	Подразделение = Справочники.ПодразделенияКомпании.НайтиПоНаименованию("Сервис ТАС");
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура СформироватьОтчетПриемка(ПолеHTMLДокумента) Экспорт
	 	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРемонт.ДатаНачала КАК ДатаНачала,
		|	ЗаявкаНаРемонт.ПометкаУдаления КАК УдаленЗР,
		|	ЗаявкаНаРемонт.Заказчик,
		|	ЗаявкаНаРемонт.Автомобиль,
		|	ЗаявкаНаРемонт.ГосНомер,
		|	ЗаказНаряд.Состояние КАК Состояние,
		|	ЗаказНаряд.ПлановаяДатаВыдачи Как ДатаОкончания,
		|	ЗаявкаНаРемонт.Ссылка,
		|	ЗаказНаряд.Ссылка КАК Ссылка1,
		|	ЗаказНаряд.Заказчик КАК Заказчик1,
		|	ЗаказНаряд.Автомобиль КАК Автомобиль1,
		|	ЗаказНаряд.ПометкаУдаления КАК УдаленЗН
		|ИЗ
		|	Документ.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт
		|		Левое СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ПО ЗаявкаНаРемонт.Ссылка = ЗаказНаряд.ДокументОснование
		|ГДЕ
		|	ЗаявкаНаРемонт.ДатаНачала МЕЖДУ &ДатаС И &ДатаПо
		|	И ЗаявкаНаРемонт.ПодразделениеКомпании = &ПодразделениеКомпании 
		|	
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаС", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Справочники.ПодразделенияКомпании.НайтиПоНаименованию("Сервис ТАС"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
//подготовка строки

	Макет = ПолучитьМакет("МакетHTMLТТ");//allgk
	Текст = Макет.ПолучитьТекст();
	
	ТекстCSS = ПолучитьМакетСSS(ЦветоваяСхема);
	Текст = СтрЗаменить(Текст, "<!--style-->", ТекстCSS);
	
	Текст = СтрЗаменить(Текст, "font-size:16px;", "font-size:"+РазмерШрифта+"px;");
	
	Текст = СтрЗаменить(Текст, "</body></html>", "");
	//Текст = Текст + "<DIV class=PageHeader><span>Автомобили записанные на сегодня</span></DIV>";

	Исполнители = ГрафикМастеров();
	КолМастеров = Исполнители.Количество();
	Для Каждого СтрокаТаблицы ИЗ Исполнители Цикл
		МастерФото = "";
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КартинкиИФайлы.ИмяФайла
		|ИЗ
		|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
		|ГДЕ
		|	КартинкиИФайлы.Объект = &Объект");
		Запрос.УстановитьПараметр("Объект", СтрокаТаблицы.Мастер);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			МастерФото = Результат[0].ИмяФайла;
		КонецЕсли;
		МастерФото = ?(ПустаяСтрока(МастерФОто),"empt.jpg",МастерФото);
	КонецЦикла;
	
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015001").СписокПараметров Цикл
		ПутьКФайлу = Стр.ЗначениеПараметра;
		КонецЦикла;
	Консультант = СокрЛП(СтрокаТаблицы.Мастер.Псевдоним); 
	
	Текст = Текст + "</BR><div class=""TableBox"">
		|<TABLE border=0 width=""100%"">
		|<tbody>
		|<TR><TD valign=""top"" align=""left"" class=""nowrap"">
		|<TABLE  ><TR>
		//|<TD class=""nowrap"" style=""width: 23%"" align=""center"" ><Font size=""14"">LADA </font></TD>
		//|<TD style=""width: 23%"" align=""center"" 
		|</table></div>
		|<div class=""lada"" align=""right"">LADA  </div>
		|</TD>
		|<TD class=""nowrap"" style=""width: 65%"" align=""center"" ><Font size=""6"">ДОБРО ПОЖАЛОВАТЬ <br /> Спасибо что приехали во время </font></TD>
		
		|<TD class=""nowrap"" align=""center"" > <Font size=""5"">
		|<div class=""DateBox"">
		|<table class=""DateBoxTable"" cellspacing=""0"" cellpadding=""0"" border=""0"">
		|<tbody>
		|<tr><td scope=""col"" align=""center""><span id=""DateBoxDay"">понедельник</span></td>
		|</tr><tr><td scope=""col"" align=""center""><span id=""DateBoxDate"">29 мая 2017 г. </span></td></tr>
		|<tr><td scope=""col"" align=""center""><span id=""DateBoxTime"">17:03:55</span></td></tr>
		|</tbody>
		|</table></div>
		|</TD>
		|</TR>
		|<tbody>
		|</TABLE>		

		|<TABLE border=0 width=""100%"">
		|<TR><TD valign=""top"" align=""center"" class=""nowrap"">
		|<TABLE  ><TR>
		//|<TD class=""li""  align=""center"" ><Font size=""16"">LADA </font></TD>
		//|<TD class=""li"" align=""center"" ><Font size=""14"">Сервис</font></TD>
		|</TR>
		|</TABLE>
		|
		|<TABLE>
		//|<TR><TH class=""nowrap""></BR>Сервисный </BR>консультант</TH></TR>
		|<TR><TD class=""nowrap"" align=""center""><img src="+ПутьКФайлу+"\"+МастерФото+" width=""300"" hight=""300""></img></TD></TR>
		//|<TR><TD class=""nowrap"" align=""center""><img src=""\\files\Public\TT\ФотоДляМонитора\Empt.jpg"" width=""300"" hight=""300""></img></TD></TR>
		|<TR><TD class=""nowrap"" align=""center"">" + Консультант + "</TD></TR>
		|<TR><TH class=""nowrap""></BR>Сервисный </BR>консультант</TH></TR>
		|</TABLE>
		|
		|</TD>
		|<TD valign=""top"" class=""nowrap""> <TABLE border=2 cellSpacing=0 cellPadding=5 width=""100%"">
		|<TBODY>
		|<TR>
		|<TH scope=col>Время</TH>
		|<TH scope=col>Модель</TH>
		|<TH scope=col>Гос.номер</TH>
		|<TH scope=col>Клиент</TH>
		|<TH scope=col>Состояние</TH>
		|<TH scope=col>Время выдачи</TH>
		|</TR>
		|</TR>";
	
Пока Выборка.Следующий() Цикл

	Если Выборка.Состояние = Null Тогда  //из заявки на ремонт
		Если Выборка.УдаленЗР = Ложь Тогда
			если Не Строка(Выборка.Состояние) = "Закрыт" и НЕ Строка(Выборка.Состояние) = "Отказ от ремонта" тогда
				// ЗДЕСЬ УСЛОВИЕ НА =====ЗАКРЫТ ИЛИ ОТКАЗ ОТ РЕМОНТА=========== СМОТРИМ ПОЛЕ Состояние     И НЕ ПОКАЗЫВАЕМ
		 
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Формат(Выборка.ДатаНачала,"ДФ=ЧЧ:мм:сс")) + "</TD>";

				Если ТипЗнч(Выборка.Автомобиль) = ТипЗнч(Справочники.Автомобили.ПустаяСсылка()) Тогда
					ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
					Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Автомобиль.Модель) + "</TD>";
					Текст = Текст + "<TD >" + ПодготовитьСтроку(ГосНомер) + "</TD>";
				Иначе
					Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Автомобиль) + "</TD>";
					Текст = Текст + "<TD > &nbsp </TD>";
				КонецЕсли;
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Заказчик) + "</TD>";
			
				Если Выборка.Состояние = Null Тогда
					Текст = Текст + "<TD >" + "Ожидание клиента" + "</TD>";
				Иначе
					Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Состояние) + "</TD>";
				КонецЕсли;
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Формат(Выборка.ДатаОкончания,"ДФ=ЧЧ:мм:сс")) + "</TD>";
		
				Текст = Текст + "</TR>";
				// ЗДЕСЬ КОНЕЦ УСЛОВИЯ НА ЗАКРЫТ ИЛИ ОТКАЗ ОТ РЕМОНТА СМОТРИМ ПОЛЕ Состояние
			КонецЕсли;
		КонецЕсли;
	
Иначе   //из заказнаряда
	 Если   Выборка.УдаленЗН = Ложь Тогда
		 
		 если Не Строка(Выборка.Состояние) = "Закрыт" и НЕ Строка(Выборка.Состояние) = "Отказ от ремонта" тогда
			 // ЗДЕСЬ УСЛОВИЕ НА =====ЗАКРЫТ ИЛИ ОТКАЗ ОТ РЕМОНТА=========== СМОТРИМ ПОЛЕ Состояние     И НЕ ПОКАЗЫВАЕМ
		 	Текст = Текст + "<TD >" + ПодготовитьСтроку(Формат(Выборка.ДатаНачала,"ДФ=ЧЧ:мм:сс")) + "</TD>";

			Если ТипЗнч(Выборка.Автомобиль1) = ТипЗнч(Справочники.Автомобили.ПустаяСсылка()) Тогда
				ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Выборка.Автомобиль1, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,ТекущаяДата());
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Автомобиль1.Модель) + "</TD>";
				Текст = Текст + "<TD >" + ПодготовитьСтроку(ГосНомер) + "</TD>";
			Иначе
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Автомобиль1) + "</TD>";
				Текст = Текст + "<TD > &nbsp </TD>";
			КонецЕсли;
			
			Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Заказчик1) + "</TD>";
			
			Если Выборка.Состояние = Null Тогда
				Текст = Текст + "<TD >" + "Ожидание клиента" + "</TD>";
			Иначе
				Текст = Текст + "<TD >" + ПодготовитьСтроку(Выборка.Состояние) + "</TD>";
			КонецЕсли;
			
			Текст = Текст + "<TD >" + ПодготовитьСтроку(Формат(Выборка.ДатаОкончания,"ДФ=ЧЧ:мм:сс")) + "</TD>";
		 	Текст = Текст + "</TR>";
			// ЗДЕСЬ КОНЕЦ УСЛОВИЯ НА ЗАКРЫТ ИЛИ ОТКАЗ ОТ РЕМОНТА СМОТРИМ ПОЛЕ Состояние
		КонецЕсли;
		
	КонецЕсли;
КонецЕсли;
	
КонецЦикла;

//КаталогСохраненияЭкрана = "\\krd-bic1c\EkranKIA";
//	ТекстовыйДокумент = Новый ТекстовыйДокумент;
//	ИмяФайлаСтраницы = СтрЗаменить (КаталогСохраненияЭкрана, "\","/") + "/mainTT.html" ;
//	ТекстовыйДокумент.УстановитьТекст(Текст);
//Попытка
//		ТекстовыйДокумент.Записать(ИмяФайлаСтраницы);
//	Исключение
//		Сообщить("Не удалось записать файл ЗАГОЛОВКА, путь:" +КаталогСохраненияЭкрана + ИмяФайлаСтраницы + ", "+ТекущаяДата());
//	КонецПопытки;


Текст = Текст + "</TABLE></TD></TR></TABLE></DIV></BODY></HTML>";	

ПолеHTMLДокумента.УстановитьТекст(Текст);

	
КонецПроцедуры


//===============--------------->ЗДЕСЬ ДО СЮДА<---------------===============//


#КонецЕсли

ИмяОбработки = ЭтотОбъект.Метаданные().ПолноеИмя();
ДатаОтчета=ТекущаяДата();