Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоГруппа Тогда
		Title = ns_ШаблонизаторВызовСервера.ОчиститьXML(Title);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОбязательныеПоля = ns_ДляДомаИДачиВалидация.ПолучитьОбязательныеПоля();
	Для каждого ИмяПоля Из ОбязательныеПоля Цикл
		ПроверяемыеРеквизиты.Добавить(ИмяПоля);
	КонецЦикла; 
	
	ДополнительныеОбязательныеПоля = ns_ДляДомаИДачиВалидация.ПолучитьДополнительныеОбязательныеПоля(Category, GoodsType);
	Для каждого ИмяПоля Из ДополнительныеОбязательныеПоля Цикл
		ПроверяемыеРеквизиты.Добавить(ИмяПоля);
	КонецЦикла; 
	
КонецПроцедуры
