// Модуль документа Рабочий лист кредитного отдела

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/атрикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем СписокСтатусов Экспорт;					// Список статусов рабочего листа
Перем МассивТребований Экспорт;					// Массив требований

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
//{{MRG[ <-> ]
	ОбязательныеРеквизиты.Вставить("Организация",1);
	//Misha
	//ОбязательныеРеквизиты.Вставить("МенеджерКредитногоОтдела",1);
	//ОбязательныеРеквизиты.Вставить("Клиент",1);
	//ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
	//ОбязательныеРеквизиты.Вставить("Банк",1);
	//ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	//ОбязательныеРеквизиты.Вставить("СтоимостьАвтомобиля",1);
	//ОбязательныеРеквизиты.Вставить("ПервоначальныйВзнос",1);
	//ОбязательныеРеквизиты.Вставить("СуммаКредита",1);
	//ОбязательныеРеквизиты.Вставить("СрокКредита",1);
	//ОбязательныеРеквизиты.Вставить("ПроцентнаяСтавка",1);
	//ОбязательныеРеквизиты.Вставить("ЗаявленныйДоход",1);
	//ОбязательныеРеквизиты.Вставить("ВалютаЗаявленногоДохода",1);
	//ОбязательныеРеквизиты.Вставить("ТребованиеКПодтверждениюДохода",1);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	ОбязательныеРеквизиты.Вставить("Организация",1);	
//	ОбязательныеРеквизиты.Вставить("МенеджерКредитногоОтдела",1);
//	ОбязательныеРеквизиты.Вставить("Клиент",1);
//	ОбязательныеРеквизиты.Вставить("ПредставлениеТелефона",1);
//	ОбязательныеРеквизиты.Вставить("Банк",1);
//	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
//	ОбязательныеРеквизиты.Вставить("СтоимостьАвтомобиля",1);
//	ОбязательныеРеквизиты.Вставить("ПервоначальныйВзнос",1);
//	ОбязательныеРеквизиты.Вставить("СуммаКредита",1);
//	ОбязательныеРеквизиты.Вставить("СрокКредита",1);
//	ОбязательныеРеквизиты.Вставить("ПроцентнаяСтавка",1);
//	ОбязательныеРеквизиты.Вставить("ЗаявленныйДоход",1);
//	ОбязательныеРеквизиты.Вставить("ВалютаЗаявленногоДохода",1);
//	ОбязательныеРеквизиты.Вставить("ТребованиеКПодтверждениюДохода",1);
//	ОбязательныеРеквизиты.Вставить("Статус",1);
//}}MRG[ <-> ]
	//ОбязательныеРеквизиты.Вставить("Статус",1);
	//Misha
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Возврат Результат;	
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Вовращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;               
	СписокХозОпераций.Добавить("РабочийЛистКредитногоОтдела","Рабочий лист кредитного отдела",Истина);

	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Тавары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено, производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Стркутура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	Если Имя="Клиент" Тогда
		Результат	= дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		#Если Клиент Тогда
		КодРегиона = "";
		КодГорода = "";
		НомерТелефона = "";
		ВнутреннийНомер = "";
		ПредставлениеТелефона = "";
		ВидТелефона = Неопределено;
		Если ЗначениеЗаполнено(Клиент) Тогда
			Телефоны = киПолучитьСписокТелефоновОбъекта(Клиент);
			Если Телефоны<>Неопределено И Телефоны.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект,Телефоны[0].Значение);
			КонецЕсли;
		КонецЕсли; 
		#КонецЕсли
		
		Возврат Результат;
		
	ИначеЕсли Имя="КредитнаяПрограмма" Тогда
		Если НЕ обЗначениеНеЗаполнено(КредитнаяПрограмма) Тогда
			Банк				= КредитнаяПрограмма.Банк;
			ПроцентнаяСтавка	= КредитнаяПрограмма.ГодоваяСтавка;
			СрокКредита			= 12;
		КонецЕсли;
	ИначеЕсли Имя="Банк" Тогда
		Если НЕ обЗначениеНеЗаполнено(Банк) И
			НЕ обЗначениеНеЗаполнено(КредитнаяПрограмма) И
			Банк<>КредитнаяПрограмма.Банк Тогда
			КредитнаяПрограмма	= Справочники.КредитныеПрограммы.ПустаяСсылка();
		КонецЕсли;
	Иначе	
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Функция возвращает сотрудника на основании переданного пользователя
//
Функция ПолучитьСотрудникаПоПользователю(ТекущийПользователь) Экспорт
	ТекущийСотрудник	= Справочники.Сотрудники.ПустаяСсылка();
	
	Если НЕ обЗначениеНеЗаполнено(ТекущийПользователь) И НЕ ПустаяСтрока(ТекущийПользователь.Наименование) Тогда
		Если обЗначениеНеЗаполнено(ТекущийПользователь.Сотрудник) Тогда
			ТекущийСотрудник	= Справочники.Сотрудники.НайтиПоНаименованию(ТекущийПользователь.Наименование, Истина);
			Если обЗначениеНеЗаполнено(ТекущийСотрудник) Тогда
				// Создадим нового сотрудника
				СотрудникОбъект	= Справочники.Сотрудники.СоздатьЭлемент();
				СотрудникОбъект.УстановитьНовыйКод();
				СотрудникОбъект.Наименование	= ТекущийПользователь.Наименование;
				СотрудникОбъект.Организация= ПараметрыСеанса.Организация;
				СотрудникОбъект.Подразделение	= ПараметрыСеанса.ПодразделениеКомпании;
				СотрудникОбъект.Должность		= Справочники.Должности.Неопределена;
				Попытка
					СотрудникОбъект.Записать();
					ТекущийСотрудник	= СотрудникОбъект.Ссылка;
				Исключение КонецПопытки;
			КонецЕсли;
		Иначе
			ТекущийСотрудник	= ТекущийПользователь.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходмое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события при установке новго номера
//
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Обработчик события заполнения
//
Процедура ОбработкаЗаполнения(Основание)
	
	ХозОперация	= Справочники.ХозОперации.РабочийЛистКредитногоОтдела;	
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	 
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.РабочийЛист") Тогда
		ДокументОснование			= Основание;
		Статус						= Основание.Статус;
		ВалютаДокумента				= Основание.ВалютаДокумента;
		ДатаСделки					= Основание.Дата;
		Клиент						= Основание.Контрагент;
		
		ВидТелефона 				= Основание.ВидТелефона;
		КодРегиона					= Основание.КодРегиона;
		КодГорода					= Основание.КодГорода;	
		НомерТелефона				= Основание.НомерТелефона;
		ВнутреннийНомер				= Основание.ВнутреннийНомер;
		ПредставлениеТелефона		= Основание.ПредставлениеТелефона;	
		
		МенеджерКредитногоОтдела	= Основание.Менеджер;
		СтоимостьАвтомобиля			= Основание.СуммаПродажи;
		ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.СмежныйОтдел;
	ИначеЕсли ТипЗнч(Основание)=Тип("ДокументСсылка.Событие") Тогда 	
		Если Основание.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда
			ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.Телефон;
		ИначеЕсли Основание.ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
			ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.ЛичнаяВстреча;
		ИначеЕсли Основание.ВидСобытия = Перечисления.ВидыСобытий.ЭлектронноеПисьмо ИЛИ Основание.ВидСобытия = Перечисления.ВидыСобытий.ИнтернетЗапрос Тогда
			ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.ИнтернетЗапрос;
		КонецЕсли;
//{{MRG[ <-> ]
//		Клиент = Основание.Контрагент;
//}}MRG[ <-> ]
	КонецЕсли;
		
КонецПроцедуры // ОбработкаЗаполнения()

// Обработчик события при копировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Обработчик события перед записью
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//->Diginova _Акт сверки кред,страх_ 07.12.2021
	Записи = РегистрыСведений.DN_АВ_КредитноСтраховыеСделки.СоздатьНаборЗаписей();
	Записи.Отбор.Регистратор.Установить(Ссылка);
	Записи.Прочитать();
	Если Записи.Количество() тогда
		Для Каждого СтрокаЗаписи из Записи цикл
			Если ЗначениеЗаполнено(СтрокаЗаписи.АктСверки) тогда
				Сообщить("Для модификации документа, распроведите " + СтрокаЗаписи.АктСверки + " в котором содержится данный кредитный лист");
				Отказ = Истина; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//<-Diginova _FlaiM_

	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередЗаписью()

// Обработчик события при записи
//
Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

// Обработчик события перед удалением
//
Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Обработчик события удаления проведения
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события проведения
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Bizteh++ 14.10.2022 убираем обмен с Оптима МК, т.к. с 01.10.2022 КСО в базе ФКДД
	//->Diginova _Настройка базы_ 05.01.2022
	//Если Не Отказ и Константы.DN_ЗапуститьОбмен.Получить() тогда
	//	УИД = Ссылка.УникальныйИдентификатор();
	//	Отправлен = DN_HTTP_Обмен.ОтправитьОбъект(Ссылка,УИД);
	//КонецЕсли;
	//<-Diginova _FlaiM_
	//Bizteh--
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// Проведение по регистру сведений Журнал событий
	Если НЕ Отказ Тогда
		Если НЕ орЖурналСостояний(Ссылка, Статус) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
	//->Diginova _Акт сверки кред,страх_ 30.11.2021
	Если НЕ Отказ тогда
		
		Движения.DN_АВ_КредитноСтраховыеСделки.Записывать = Истина;
		Движения.DN_АВ_КредитноСтраховыеСделки.Очистить();
		
		Запись = Движения.DN_АВ_КредитноСтраховыеСделки.Добавить();	
		Запись.Период = Дата;
		Запись.Статус = Статус;
		Запись.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный;
		Запись.Организация = Организация;
		Запись.Программа = КредитнаяПрограмма;
		Запись.ПодразделенияКомпании = ПодразделениеКомпании;
		Запись.Контрагент = КредитнаяПрограмма.БанкКонтрагент;
		Запись.ДоговорыВзаиморасчетов = КредитнаяПрограмма.DN_ДоговорВзаиморсчетов;
		Запись.АВЛиста = ОбщаяСуммаАВ;
		
	КонецЕсли;
	//<-Diginova _FlaiM_
		
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права                 = Неопределено;
#Если Клиент Тогда
Права = глПрава;

// Список статусов рабочего листа
СписокСтатусов	= Новый СписокЗначений;
ЗапросСтатусов		= Новый Запрос();
ЗапросСтатусов.Текст= "ВЫБРАТЬ
                      |	СтатусыРабочегоЛиста.Ссылка КАК Ссылка,
                      |	СтатусыРабочегоЛиста.Наименование КАК Наименование
                      |ИЗ
                      |	Справочник.СтатусыРабочегоЛиста КАК СтатусыРабочегоЛиста
                      |ГДЕ
                      |	СтатусыРабочегоЛиста.ИспользоватьВРабочемЛистеКредитногоОтдела
                      |	И НЕ СтатусыРабочегоЛиста.ПометкаУдаления
                      |
                      |УПОРЯДОЧИТЬ ПО
                      |	СтатусыРабочегоЛиста.ПорядокВОтчете УБЫВ";
ВыборкаСтатусов	= ЗапросСтатусов.Выполнить().Выбрать();
Пока ВыборкаСтатусов.Следующий() Цикл
	СписокСтатусов.Добавить(ВыборкаСтатусов.Ссылка);	
КонецЦикла;

МассивТребований	= Новый Массив();
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода._2НДФЛНаВесьДоход);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода._2НДФЛНаОфициальнуюЧасть);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.БезПодтверждения);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.ЗаявлениеЗаемщика);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.Прочее);
МассивТребований.Добавить(Перечисления.ТребованияКПодтверждениюДохода.СвободнаяФорма);

#КонецЕсли
