
// Найти узел создания объекта
Функция НайтиУзелСозданияОбъекта() Экспорт
	ПредставлениеОтправителя = Неопределено;
	Попытка
		ТекущийОбъект = ОбъектСсылка.ПолучитьОбъект();
		Отправитель = ТекущийОбъект.ОбменДанными.Отправитель;
		Если (Отправитель = Неопределено)Или (Отправитель.Пустая())Тогда
			Отправитель = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Ссылка;
		КонецЕсли;
		ПредставлениеОтправителя = "Узел создания объекта: " + Отправитель.ПодразделениеКомпании + " [" + Отправитель.Наименование + "]";
	Исключение
	КонецПопытки;
	Возврат ПредставлениеОтправителя;
КонецФункции// НайтиУзелСозданияОбъекта()

#Если Клиент Тогда
// Формирует журнал регистрации
Процедура СформироватьЖурналРегистрации(ЖурналРегистрации = Неопределено) Экспорт
	ФормаОтчета = ЭтотОбъект.ПолучитьФорму("Форма");
	Если ЖурналРегистрации = Неопределено Тогда
		ЖурналРегистрации = ФормаОтчета.ЭлементыФормы["ЖурналРегистрации"].Значение;		
	КонецЕсли;
	ЖурналРегистрации.Очистить();  
	
	ФильтрЖурнала = Новый Структура;
	Если (НЕ ОбъектСсылка = Неопределено) И (НЕ ОбъектСсылка.Пустая()) Тогда
		ФильтрЖурнала.Вставить("Данные",ОбъектСсылка);
	Иначе
		Предупреждение("Выберите объект!");
		Возврат;
	КонецЕсли;	
	ЖурналРегистрации.Очистить();  
	
	// получим таблицу
	СобытияЖурнала = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(СобытияЖурнала,ФильтрЖурнала,,,);
	
	Для Каждого стрСобытие Из СобытияЖурнала Цикл
		НовоеСобытие = ЖурналРегистрации.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеСобытие,стрСобытие);
	КонецЦикла;
	
	ФормаОтчета.ЭлементыФормы.ГиперссылкаНаОтправителя.Заголовок = НайтиУзелСозданияОбъекта();
	Если НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;
КонецПроцедуры// СформироватьЖурналРегистрации() Экспорт
#КонецЕсли