Перем ДокументОбъект Экспорт; // документ объект
Перем СтатьяДоходовИРасходов Экспорт; // Статья ДДС
Перем Подразделение Экспорт; // если неопределено, то берется из ДокументОбъект
Перем ВУпрВалюте Экспорт; // если Истина, то суммы переданы в валюте упр. учета и пересчитывать их не надо
Перем Доход Экспорт; // доход
Перем Расход Экспорт; // расход
//<<Павличенко 12.01.18
Перем ДоходБезНДС Экспорт; // доход без НДС
Перем РасходБезНДС Экспорт; // расход без НДС
//>>Павличенко 12.01.18
Перем ШапкаДокумента Экспорт; 			// Выборка или строка таблицы значений, в которой содержаться необходимые данные о шапке документа
Перем РежимПроведения Экспорт;		// Режим проведения документа оперативный/неоперативный
Перем ХозОперация Экспорт; // Хозяйственная операция. Если пустое, то берется из документа.
Перем СтатьяДиРИсточник Экспорт; // Статья доходов и расходов, с которой произошло распределение.
								 // Используется в документе "Закрытие периода".

// фиксируем доходы/расходы
Функция Приход() Экспорт
	Если ШапкаДокумента=Неопределено Тогда ШапкаДокумента=ДокументОбъект; КонецЕсли;
	Доход=?(Доход=Неопределено ИЛИ Доход=NULL,0,Доход);
	Расход=?(Расход=Неопределено ИЛИ Расход=NULL,0,Расход);
	//<<Павличенко 12.01.18
	ДоходБезНДС=?(ДоходБезНДС=Неопределено ИЛИ ДоходБезНДС=NULL,0,ДоходБезНДС);
	РасходБезНДС=?(РасходБезНДС=Неопределено ИЛИ РасходБезНДС=NULL,0,РасходБезНДС);
	//>>Павличенко 12.01.18
	// проверим
	Если Доход=0 И Расход=0 Тогда 
		// убиваем циклическую ссылку
		ДокументОбъект=Неопределено;
		ШапкаДокумента=Неопределено;
		Возврат Истина; 
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Подразделение) Тогда
		Подразделение = ШапкаДокумента.ПодразделениеКомпании;
	КонецЕсли;
	
	ВУпрВалюте=?(ВУпрВалюте=Неопределено,Ложь,ВУпрВалюте);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	// движения
	НоваяЗапись=Добавить();
	НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=Подразделение;
	НоваяЗапись.СтатьяДоходовИРасходов=СтатьяДоходовИРасходов;
	Если ВУпрВалюте Тогда
		НоваяЗапись.ДоходУпр=Окр(Доход,2);
		НоваяЗапись.РасходУпр=Окр(Расход,2);
		//<<Павличенко 12.01.18
		НоваяЗапись.ДоходУпрБезНДС=Окр(ДоходБезНДС,2);
		НоваяЗапись.РасходУпрБезНДС=Окр(РасходБезНДС,2);
		//>>Павличенко 12.01.18
	Иначе
		НоваяЗапись.ДоходУпр=Окр(обПересчет(Доход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпр=Окр(обПересчет(Расход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		//<<Павличенко 12.01.18
		НоваяЗапись.ДоходУпрБезНДС=Окр(обПересчет(ДоходБезНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпрБезНДС=Окр(обПересчет(РасходБезНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		//>>Павличенко 12.01.18

	КонецЕсли;
	// Хоз. операция
	Если ХозОперация=Неопределено Тогда
		ХозОперация = ШапкаДокумента.ХозОперация;
	КонецЕсли;  	
	НоваяЗапись.ХозОперация = ХозОперация;
	
	// Распределяемая статья.
	Если СтатьяДиРИсточник<>Неопределено Тогда
		НоваяЗапись.СтатьяРаспределения = СтатьяДиРИсточник;			
	КонецЕсли;   	
	
	// обнуляем переменные
	Подразделение = Неопределено;
	Доход=0; Расход=0; ВУпрВалюте=Ложь;
	//<<Павличенко 12.01.18
	ДоходБезНДС=0; РасходБезНДС=0;
	//>>Павличенко 12.01.18
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	
	Возврат Истина;
КонецФункции

// фиксируем доходы/расходы
Функция Расход() Экспорт
	Если ШапкаДокумента=Неопределено Тогда ШапкаДокумента=ДокументОбъект; КонецЕсли;
	Доход=?(Доход=Неопределено ИЛИ Доход=NULL,0,Доход);
	Расход=?(Расход=Неопределено ИЛИ Расход=NULL,0,Расход);
	//<<Павличенко 12.01.18
	ДоходБезНДС=?(ДоходБезНДС=Неопределено ИЛИ ДоходБезНДС=NULL,0,ДоходБезНДС);
	РасходБезНДС=?(РасходБезНДС=Неопределено ИЛИ РасходБезНДС=NULL,0,РасходБезНДС);
	//>>Павличенко 12.01.18
	// проверим
	Если Доход=0 И Расход=0 Тогда 
		// убиваем циклическую ссылку
		ДокументОбъект=Неопределено;
		ШапкаДокумента=Неопределено;
		Возврат Истина; 
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Подразделение) Тогда
		Подразделение = ШапкаДокумента.ПодразделениеКомпании;
	КонецЕсли;
	
	ВУпрВалюте=?(ВУпрВалюте=Неопределено,Ложь,ВУпрВалюте);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	// движения
	НоваяЗапись=Добавить();
	НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=Подразделение;
	НоваяЗапись.СтатьяДоходовИРасходов=СтатьяДоходовИРасходов;
	Если ВУпрВалюте Тогда
		НоваяЗапись.ДоходУпр=Окр(Доход,2);
		НоваяЗапись.РасходУпр=Окр(Расход,2);
		//<<Павличенко 12.01.18
		НоваяЗапись.ДоходУпрБезНДС=Окр(ДоходБезНДС,2);
		НоваяЗапись.РасходУпрБезНДС=Окр(РасходБезНДС,2);
		//>>Павличенко 12.01.18
	Иначе
		НоваяЗапись.ДоходУпр=Окр(обПересчет(Доход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпр=Окр(обПересчет(Расход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		//<<Павличенко 12.01.18
		НоваяЗапись.ДоходУпр=Окр(обПересчет(ДоходБезНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпр=Окр(обПересчет(РасходБезНДС,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		//>>Павличенко 12.01.18
	КонецЕсли;
	// Хоз. операция
	Если ХозОперация=Неопределено Тогда
		ХозОперация = ШапкаДокумента.ХозОперация;
	КонецЕсли;  	
	НоваяЗапись.ХозОперация = ХозОперация;
		
	// обнуляем переменные
	Подразделение = Неопределено;
	Доход=0; Расход=0; ВУпрВалюте=Ложь;
	//<<Павличенко 12.01.18
	ДоходБезНДС=0; РасходБезНДС=0;
	//>>Павличенко 12.01.18
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	
	Возврат Истина;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()
