#Если Клиент Тогда

Перем Права Экспорт; 							// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

///////////////////////////////////////////////////////////////////////////////
//	ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция возвращает контекст переданного источника
//
Функция ПолучитьКонтекст(ЭтаФорма, Источник="") Экспорт
	
	СтруктураКонтекста	= Новый Структура("Пусто, Ссылка", Истина, Неопределено);
	
	Если ТипЗнч(ЭтаФорма)=Тип("Форма") Тогда
		НайденныйЭлемент	= ЭтаФорма.ЭлементыФормы.Найти(Источник);
		Если ТипЗнч(НайденныйЭлемент)=Тип("ТабличноеПоле") И
			ТипЗнч(НайденныйЭлемент.Значение)=Тип("ДокументСписок.РабочийЛист") Тогда
			СтрокаЭлемента	= НайденныйЭлемент.ТекущиеДанные;
			Если СтрокаЭлемента<>Неопределено Тогда
				Для Каждого ТекКолонка Из НайденныйЭлемент.Значение.Колонки Цикл
					СтруктураКонтекста.Вставить(ТекКолонка.Имя, СтрокаЭлемента[ТекКолонка.Имя]);
					Если СтруктураКонтекста.Пусто Тогда
						СтруктураКонтекста.Вставить("Пусто",		Ложь);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(НайденныйЭлемент)=Тип("ТабличноеПоле") И
			НайденныйЭлемент.Имя="СписокНайденныеАвтомобили" Тогда	
			СтрокаЭлемента	= НайденныйЭлемент.ТекущиеДанные;
			Если СтрокаЭлемента<>Неопределено Тогда
				Для Каждого ТекКолонка Из НайденныйЭлемент.Значение.ВыгрузитьКолонки().Колонки Цикл
					СтруктураКонтекста.Вставить(ТекКолонка.Имя, СтрокаЭлемента[ТекКолонка.Имя]);
					Если СтруктураКонтекста.Пусто Тогда
						СтруктураКонтекста.Вставить("Пусто",		Ложь);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
		
	СтруктураКонтекста.Вставить("АРМИсточник",	"АРМАвтосалон");
	
	Возврат СтруктураКонтекста;
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

Права = глПрава;
Права[ПланыВидовХарактеристик.ПраваИНастройки.АвтоСохранениеДокументов]=Ложь;

#КонецЕсли

 