

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Активность = Истина;
		Объект.Категория = Перечисления.КатегорияKPI.СмартЗадача;
		Объект.СпособРасчета = Перечисления.ВидРасчетаKPI.Автоматический;
		Объект.Периодичность = Перечисления.Периодичность.Месяц;
		Объект.Размерность = Перечисления.Размерность.Число;
		
	КонецЕсли;

	ТекстФормулы = Объект.Формула;
	Для Каждого ТекущаяСтрока из Объект.ПоказателиДляРасчета Цикл
		
		Если ТипЗнч(ТекущаяСтрока.Показатель) = ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"["+ТекущаяСтрока.Показатель.Код+"]",СокрЛП(ТекущаяСтрока.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Показатель) = ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"{"+ТекущаяСтрока.Показатель.Код+"}",СокрЛП(ТекущаяСтрока.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрока.Показатель) = ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"ͼ"+ТекущаяСтрока.Показатель.Код+"ͽ",СокрЛП(ТекущаяСтрока.Переменная));
		КонецЕсли;
		
	КонецЦикла;	  
	
	ФормулаДляРачетаЗначений = ТекстФормулы;
	
	//прем
    ТекстФормулы = Объект.ФормулаДляРасчетаПремии;
	Для Каждого ТекущаяСтрокаПрем из Объект.ПоказателиДляРасчета Цикл
		
		Если ТипЗнч(ТекущаяСтрокаПрем.Показатель) = ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"["+ТекущаяСтрокаПрем.Показатель.Код+"]",СокрЛП(ТекущаяСтрокаПрем.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаПрем.Показатель) = ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"{"+ТекущаяСтрокаПрем.Показатель.Код+"}",СокрЛП(ТекущаяСтрокаПрем.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаПрем.Показатель) = ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"ͼ"+ТекущаяСтрокаПрем.Показатель.Код+"ͽ",СокрЛП(ТекущаяСтрокаПрем.Переменная));
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстФормулы = СтрЗаменить(ТекстФормулы,"[Факт/План]","K");

	ФормулаДляРачетаЗначенийПремии = ТекстФормулы;
	
	//прем план
    ТекстФормулы = Объект.ФормулаДляРасчетаПлановойПремии;
	Для Каждого ТекущаяСтрокаПрем2 из Объект.ПоказателиДляРасчета Цикл
		
		Если ТипЗнч(ТекущаяСтрокаПрем2.Показатель) = ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"["+ТекущаяСтрокаПрем2.Показатель.Код+"]",СокрЛП(ТекущаяСтрокаПрем2.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаПрем2.Показатель) = ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"{"+ТекущаяСтрокаПрем2.Показатель.Код+"}",СокрЛП(ТекущаяСтрокаПрем2.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаПрем2.Показатель) = ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулы = СтрЗаменить(ТекстФормулы,"ͼ"+ТекущаяСтрокаПрем2.Показатель.Код+"ͽ",СокрЛП(ТекущаяСтрокаПрем2.Переменная));
		КонецЕсли;
		
	КонецЦикла;
	
   	ТекстФормулы = СтрЗаменить(ТекстФормулы,"[Факт/План]","K");

	ФормулаДляРачетаПлановыхЗначенийПремии = ТекстФормулы;
	
	//Обработки
	ТекстФормулыПост = СтрЗаменить(Объект.ФормулаПостобработки,"[Факт/План]","K");

	Для Каждого ТекущаяСтрокаОбработки из Объект.ПоказателиДляРасчета Цикл
		Если ТипЗнч(ТекущаяСтрокаОбработки.Показатель) = ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулыПост = СтрЗаменить(ТекстФормулыПост,"["+ТекущаяСтрокаОбработки.Показатель.Код+"]",СокрЛП(ТекущаяСтрокаОбработки.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаОбработки.Показатель) = ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулыПост = СтрЗаменить(ТекстФормулыПост,"{"+ТекущаяСтрокаОбработки.Показатель.Код+"}",СокрЛП(ТекущаяСтрокаОбработки.Переменная));
		ИначеЕсли ТипЗнч(ТекущаяСтрокаОбработки.Показатель) = ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулыПост = СтрЗаменить(ТекстФормулыПост,"ͼ"+ТекущаяСтрокаОбработки.Показатель.Код+"ͽ",СокрЛП(ТекущаяСтрокаОбработки.Переменная));
		КонецЕсли;
	КонецЦикла;	

	ФормулаОбработки = ТекстФормулыПост;
	
	
	
	СписокЗн=Новый Массив;
	СписокЗн.Добавить(Перечисления.Периодичность.Месяц);
	СписокЗн.Добавить(Перечисления.Периодичность.Квартал);
	СписокЗн.Добавить(Перечисления.Периодичность.Год);
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗн);
	
	Если Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество()=0 Тогда
		Элементы.ФормулаОбработки.Доступность=истина;
	Иначе
		Элементы.ФормулаОбработки.Доступность=ложь;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Если Не РольДоступна("РуководительПодразделения") и Не РольДоступна("Администратор") и НЕ РольДоступна("РасчетчикПремийГл") и Не РольДоступна("АдминистраторСистемыKPI") и НЕ РольДоступна("АдминистраторКомпетенций") и НЕ РольДоступна("KPI_Диспонент") 
	//	и НЕ РольДоступна("АдминистраторКумулятивнойМаржи") //++ Чумадин Р. А. 26.10.2020 ТЗ 17008 //--
	//	Тогда
	//	ЭтаФорма.ТолькоПросмотр=истина;
	//КонецЕсли;
	
	//Если НЕ РольДоступна("Администратор") и Не РольДоступна("АдминистраторСистемыKPI") и НЕ РольДоступна("АдминистраторКомпетенций") или Не ОбПраво("ФЭС") Тогда     //НК 17112015 без права ФЭС только периодическое описание
	//	Если Не ЭтаФорма.ТолькоПросмотр Тогда
	//		Для Каждого ТекЭл из ЭлементыФормы Цикл
	//			Если Не ТекЭл.Имя="КоманднаяПанель3" и Не ТекЭл.Имя="Панель1" и Не ТекЭл.Имя="ОсновныеДействияФормы" и Не  ТекЭл.Имя="ПОписание" и Не ТекЭл.Имя="ИмеетПериодическоеОписание" Тогда
	//				ТекЭл.Доступность=ложь;
	//			КонецЕсли;
	//		КонецЦикла;
	//		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОК.Доступность=истина;
	//	КонецЕсли;
	//КонецЕсли;

	//Если ЭтаФорма.ТолькоПросмотр Тогда
	//	Для Каждого ТекЭл из ЭлементыФормы Цикл
	//		Если Не ТекЭл.Имя="ОсновныеДействияФормы"  Тогда
	//			ТекЭл.Доступность=ложь;
	//		КонецЕсли;
	//	КонецЦикла;
	//	ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОК.Доступность=ложь;
	//КонецЕсли;
	КатегорияПриИзменении("");
	
	СпособРасчетаПриИзменении("");
	
	ВидимостьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	
	//Если НЕ ПроверитьПодразделениеДляНастройкиKPI(Объект.ПодразделениеКомпании) Тогда
	//	Сообщить("Нет прав для изменения настроек KPI по подразделению "+Объект.ПодразделениеКомпании+"!");
	//	Объект.ПодразделениеКомпании=БылоПодразделение;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	//БылоПодразделение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	Если Объект.Категория=ПредопределенноеЗначение("Перечисление.КатегорияKPI.ЦелевойПоказатель") Тогда    //БазоваяЧасть
		
		Элементы.ОтдельнаяЧасть.Видимость=Истина;
		Элементы.ВыгружатьПоСдельнымНарядам.Видимость=Истина;
		Элементы.СтраницаКоэфициентыБазовойЧасти.Видимость=Истина;
		
		//Элементы.Порог.Видимость = Истина;
		//Элементы.ПорогЗначение.Видимость = Истина;
		Элементы.ФормулаОбработки.Доступность=Истина;
		Элементы.КоэффициентыБазовойЧастиОтВыполненияПлана.Доступность=Истина;
		
	Иначе
		
		Элементы.ОтдельнаяЧасть.Видимость=Ложь;
		Элементы.ВыгружатьПоСдельнымНарядам.Видимость=Ложь;
		Элементы.СтраницаКоэфициентыБазовойЧасти.Видимость=Ложь;
		
		//Элементы.Порог.Видимость = Ложь;
		//Элементы.ПорогЗначение.Видимость = Ложь;
		
		Если Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество()<>0 Тогда
			Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество()=0 Тогда
		Элементы.ФормулаОбработки.Доступность=Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаПриИзменении(Элемент)
	
	Если Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.ВидРасчетаKPI.РучнойВвод") Тогда
		Элементы.СтраницаФормулаРасчета.Видимость=Ложь;
	Иначе
		Элементы.СтраницаФормулаРасчета.Видимость=Истина;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.СреднееЗаКвартал.Видимость = Истина;
		Объект.СреднееЗаКвартал = Истина;
	Иначе
		Объект.СреднееЗаКвартал = Ложь;
		Элементы.СреднееЗаКвартал.Видимость=Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

	Если Объект.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.СреднееЗаКвартал.Видимость = Истина;
		Объект.СреднееЗаКвартал = Истина;
	Иначе
		Объект.СреднееЗаКвартал = Ложь;
		Элементы.СреднееЗаКвартал.Видимость=Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтдельнаяЧастьПриИзменении(Элемент)
	
	Элементы.ДоляОтдельнойЧасти.Видимость = Объект.ОтдельнаяЧасть;
	Элементы.Обратный.Видимость = НЕ Объект.ОтдельнаяЧасть;
	Если НЕ Объект.ОтдельнаяЧасть Тогда
		Если Объект.ДоляОтдельнойЧасти<>0 Тогда
			Объект.ДоляОтдельнойЧасти=0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьПоСдельнымНарядамПриИзменении(Элемент)
	
	Если Объект.ВыгружатьПоСдельнымНарядам Тогда
		Объект.ОтдельнаяЧасть = Истина;
		Объект.ДоляОтдельнойЧасти = 100;
		Элементы.ОтдельнаяЧасть.Доступность = Ложь;
		Элементы.ДоляОтдельнойЧасти.Доступность = ложь;
	Иначе
		Элементы.ОтдельнаяЧасть.Доступность = Истина;
		Элементы.ДоляОтдельнойЧасти.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмеетПереодическоеОписаниеПриИзменении(Элемент)
	ВидимостьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьРеквизитов()
	
	Элементы.Категория.Видимость = Истина;
	Элементы.Периодичность.Видимость = Истина;
    КатегорияПриИзменении("");

    ОтдельнаяЧастьПриИзменении("");
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Элементы.СреднееЗаКвартал.Видимость = Истина;
	Иначе
		Элементы.СреднееЗаКвартал.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстФормулы=ОбновитьФормулу(ФормулаДляРачетаЗначений);
	Объект.Формула=ТекстФормулы;
	
	ТекстФормулы = ОбновитьФормулу(ФормулаДляРачетаЗначенийПремии);
	Объект.ФормулаДляРасчетаПремии = ТекстФормулы;
	
	//прем
	ТекстФормулы = ОбновитьФормулу(ФормулаДляРачетаПлановыхЗначенийПремии);
	Объект.ФормулаДляРасчетаПлановойПремии = ТекстФормулы;

    ТекстФормулыПост=ОбновитьФормулуПост(ФормулаОбработки);
	Объект.ФормулаПостобработки=ТекстФормулыПост;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекстФормулы = ОбновитьФормулу(ФормулаДляРачетаЗначений);
	Если Объект.Формула <> ТекстФормулы Тогда
		Объект.Формула = ТекстФормулы;
	КонецЕсли;
	
	//прем
	ТекстФормулы = ОбновитьФормулу(ФормулаДляРачетаЗначенийПремии);
	Если Объект.ФормулаДляРасчетаПремии <> ТекстФормулы Тогда
		Объект.ФормулаДляРасчетаПремии = ТекстФормулы;
	КонецЕсли;
	
	//прем
	ТекстФормулы = ОбновитьФормулу(ФормулаДляРачетаПлановыхЗначенийПремии);
	Если Объект.ФормулаДляРасчетаПлановойПремии <> ТекстФормулы Тогда
		Объект.ФормулаДляРасчетаПлановойПремии = ТекстФормулы;
	КонецЕсли;
	
	ТекстФормулыПост = ОбновитьФормулуПост(ФормулаОбработки);
	Если Объект.ФормулаПостобработки<>ТекстФормулыПост Тогда
		Объект.ФормулаПостобработки=ТекстФормулыПост;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Если Вопрос("Сохранить изменения?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			Попытка
				Если Не Отказ Тогда
					Записать();
				КонецЕсли;
			Исключение
				Отказ=истина;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ОбновитьФормулу(ТекФормула)
	
	ТекстФормулы=ТекФормула;
	Для Каждого ТекСтр из Объект.ПоказателиДляРасчета Цикл
		Если ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"["+ТекСтр.Показатель.Код+"]");
		ИначеЕсли ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"{"+ТекСтр.Показатель.Код+"}");
		ИначеЕсли ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"ͼ"+ТекСтр.Показатель.Код+"ͽ");
		КонецЕсли;
	КонецЦикла;	
	
    ТекстФормулы=СтрЗаменить(ТекстФормулы,"K","[Факт/План]");
	
	Возврат ТекстФормулы;
	
КонецФункции 

&НаСервере
Функция ОбновитьФормулуПост(ТекФормула)
	
	ТекстФормулы=ТекФормула;
	Для Каждого ТекСтр из Объект.ПоказателиДляРасчета Цикл
		Если ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"["+ТекСтр.Показатель.Код+"]");
		ИначеЕсли ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"{"+ТекСтр.Показатель.Код+"}");
		ИначеЕсли ТипЗнч(ТекСтр.Показатель)=ТипЗнч(Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()) Тогда
			ТекстФормулы=СтрЗаменить(ТекстФормулы,СокрЛП(ТекСтр.Переменная),"ͼ"+ТекСтр.Показатель.Код+"ͽ");
		КонецЕсли;
	КонецЦикла;
	
	ТекстФормулы=СтрЗаменить(ТекстФормулы,"K","[Факт/План]");
	
	Возврат ТекстФормулы;
	
КонецФункции 

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВидимостьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДляРасчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Стр="ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	Если НоваяСтрока Тогда
		Для Сч=1 по СтрДлина(Стр) Цикл
			СимволТек=Сред(Стр,Сч,1);
			
			 
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Переменная", СимволТек);
            ПоказателиДляРасчета = Объект.ПоказателиДляРасчета.НайтиСтроки(ПараметрыОтбора);
			
			Если ПоказателиДляРасчета.Количество() = 0 Тогда
				Элемент.ТекущиеДанные.Переменная = СимволТек;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДляРасчетаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	СтрБук="ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	Стр="ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890";
	Сим=Элемент.ТекущиеДанные.Переменная;
	ПерБук=Лев(Сим,1);
	
	Если Не стрНайти(СтрБук, ПерБук)>0 Тогда
		Сообщить("Имя переменной должно начинаться с латинской буквы");
		Отказ=истина;					
		Возврат;	
	КонецЕсли;
	
	Для Сч=1 по СтрДлина(Сим) Цикл
		ТекБук=Сред(Сим,Сч,1);
		Если Не стрНайти(Стр,ТекБук)>0 Тогда
			Сообщить("Имя переменной может содержать латинские буквы или цифры");
			Отказ=истина;					
			Возврат;	
		КонецЕсли;
	КонецЦикла;
	
	МС=Объект.ПоказателиДляРасчета.НайтиСтроки(Новый Структура("Переменная",Сим));
	Если МС.Количество()>1 Тогда
		Предупреждение("Уже есть переменная с таким именем");
		Отказ=истина;					
		Возврат;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДляРасчетаПеременнаяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПоказателиДляРасчета.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда 
		ТекущаяСтрока.Переменная=ВРег(ТекущаяСтрока.Переменная);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказателиДляРасчетаПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеВыбора)=ТипЗнч(Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()) Тогда
		
		Ф=Справочники.ПоказателиДляРасчетаМотивации.ПолучитьФормуВыбора();
		Ф.РежимВыбора=Истина;
		Ф.ВладелецФормы=Элемент;
		Ф.Открыть();
		Ф.ЭлементыФормы.СправочникСписок.ТекущаяСтрока=Элемент.Значение;
		СтандартнаяОбработка=ложь;
		
	ИначеЕсли ТипЗнч(ДанныеВыбора)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
		
		Нельзя=Новый СписокЗначений;
		Нельзя.Добавить(ЭтотОбъект.Ссылка);
		
		Ф=Справочники.KPI.ПолучитьФормуВыбора();
		Ф.РежимВыбора=Истина;
		Ф.ВладелецФормы=Элемент;
		Ф.Отбор.Ссылка.ВидСравнения=ВидСравнения.НеВСписке;
		Ф.Отбор.Ссылка.Значение=Нельзя;
		Ф.Отбор.Ссылка.Использование=истина;
		СтандартнаяОбработка=ложь;
		Ф.ЭлементыФормы.СправочникСписок.ТекущаяСтрока=Элемент.Значение;
		
		Ф.Открыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыБазовойЧастиОтВыполненияПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество()=0 Тогда
		
		Отв=Вопрос("При заполнении таблицы коэффициентов формула постобработки будет стерта и расчет кохэффициентов базовой части будет браться из таблицы",РежимДиалогаВопрос.ДаНет);
		
		Если Отв=КодВозвратаДиалога.Да Тогда
			ФормулаОбработки="";
			Элементы.ФормулаОбработки.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыБазовойЧастиОтВыполненияПланаПослеУдаления(Элемент)
	
	Если Объект.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество()=0 Тогда
		Элементы.ФормулаОбработки.Доступность=истина;
	КонецЕсли;

КонецПроцедуры

//Проверка формул
&НаКлиенте
Процедура Проверить(Команда)
	
	ТекстФормулы=ОбновитьФормулу(ФормулаДляРачетаЗначений);
	Объект.Формула=ТекстФормулы;

	ОткрытьФормуПРоверки("Расчет");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПремия(Команда)
	
	ТекстФормулы=ОбновитьФормулу(ФормулаДляРачетаЗначенийПремии);
	Объект.ФормулаДляРасчетаПремии=ТекстФормулы;
	
	ОткрытьФормуПРоверки("Премия");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПлановаяПремия(Команда)
	
	ТекстФормулы=ОбновитьФормулу(ФормулаДляРачетаЗначенийПремии);
	Объект.ФормулаДляРасчетаПремии=ТекстФормулы;
	
	ОткрытьФормуПРоверки("ПлановаяПремия");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПостОбработка(Команда)
	
	ТекстФормулыПост=ОбновитьФормулуПост(ФормулаОбработки);
	Объект.ФормулаПостОбработки=ФормулаОбработки;

	ОткрытьФормуПРоверки("ПостОбработка");
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуПРоверки(ИмяКоманды)
	
  ПараметрыФормы = Новый Структура();
  ПараметрыФормы.Вставить("ИмяКоманды", ИмяКоманды);
  ПараметрыФормы.Вставить("ТекущийKPI", Объект.Ссылка);
  
  Если ИмяКоманды = "ПлановаяПремия" Тогда
	  
	  ПараметрыФормы.Вставить("Плановая", Истина);
	  
  Иначе
	  
	  ПараметрыФормы.Вставить("Плановая", Ложь);
	  
  КонецЕсли;

  Результат = ОткрытьФорму("Справочник.KPI.Форма.ФормаПроверкаФормулы", ПараметрыФормы,ЭтаФорма, ЭтотОбъект);
  
КонецФункции	

//Проверка формул


