
Функция URLPOST(Запрос)      
		
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтруктураДанных	= Новый Структура;	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json="));
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
	
	перИмяМетода = Запрос.ПараметрыURL["ИмяМетода"];
	
	СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		
	СтруктураОтвет = DN_HTTP_Обмен.ОбработкаМетодовPOST(СтруктураДанных,перИмяМетода);
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета);
		Если СтруктураОтвет.Отработало Тогда 
		    Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ДанныеОтвета,КодировкаТекста.UTF8);
		Иначе
			Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.ТекстОшибки,КодировкаТекста.UTF8);
		КонецЕсли;
		
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
	
КонецФункции

Функция URLGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ; 
	
КонецФункции
