
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ПериодРаботы = НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Объект.Автор = ПараметрыСеанса.Пользователь;
		
	КонецЕсли;	
	
	Если Объект.Проведен Тогда
		Элементы.Табель.ПодчиненныеЭлементы.ТабельКоличествоДнейПлан.ТолькоПросмотр = Истина;	
	Иначе
		Элементы.Табель.ПодчиненныеЭлементы.ТабельКоличествоДнейПлан.ТолькоПросмотр = Ложь;	
	КонецЕсли;
	
	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма,Объект.Дата,Объект.Организация, Объект.ПодразделениеКомпании);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("КомандаСотрудникиЗаполнитьЗавершение", ЭтотОбъект), "Таблица будет перезаполнена! Продолжить?",РежимДиалогаВопрос.ДаНетОтмена);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоСотрудникам();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСотрудникам()

	Если НЕ Объект.ПериодРаботы=Дата('00010101') Тогда
		НачПериода=НачалоМесяца(Объект.ПериодРаботы);
		КонПериода=КонецМесяца(Объект.ПериодРаботы);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	Объект.Табель.Очистить();
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И (Сотрудники.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (НЕ Сотрудники.ДатаУвольнения < &Период
	|			ИЛИ Сотрудники.ДатаУвольнения = &Пусто)
	|	И Сотрудники.ДатаПриема < &ДатаПриема
	|	И Сотрудники.ДатаПриема <> &Пусто");
	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВсеПодразделения", Объект.ПодразделениеКомпании.Пустая());
	Запрос.УстановитьПараметр("Период", НачПериода);
	Запрос.УстановитьПараметр("ДатаПриема", КонПериода);
	Запрос.УстановитьПараметр("Пусто", Дата("01.01.01 00:00:00"));
	
	Результат=Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		НоваяСтрока= Объект.Табель.Добавить();
		НоваяСтрока.Сотрудник=Результат.Сотрудник;
		НоваяСтрока.Должность = Результат.Сотрудник.Должность;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРаботыПриИзменении(Элемент)
	
	Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.ПериодРаботы);
	ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРаботыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРаботыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРаботыРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодРаботы = ДобавитьМесяц(Объект.ПериодРаботы, Направление);
	ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.ПериодРаботы = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере(Отказ);	

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюНаСервере(Отказ)
	
	Если НЕ Объект.ПериодРаботы=Дата('00010101') Тогда
		НачПериода=НачалоМесяца(Объект.ПериодРаботы);
		КонПериода=КонецМесяца(Объект.ПериодРаботы);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;

	Для  Каждого Строка из Объект.Табель цикл
		Если Строка.Сотрудник.ДатаУвольнения < НачПериода и ЗначениеЗаполнено(Строка.Сотрудник.ДатаУвольнения) тогда
			Сообщить("Сотрудник "+Строка.Сотрудник+" уволен раньше начала периода табеля, его необходимо удалить из документа", СтатусСообщения.Важное);
			
			Отказ = истина;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодРаботыПриИзменении(Элементы.ПериодРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ТабельСотрудникПриИзменении(Элемент)
	
	ТабельСотрудникПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ТабельСотрудникПриИзмененииСервер()
	
	ТекущаяСтрока = Элементы.Табель.ТекущиеДанные; 
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда 
		  ТекущаяСтрока.Должность = ТекущаяСтрока.Сотрудник.Должность;
	КонецЕсли;	
	
КонецПроцедуры
