// Модуль документа ИзвлечениеТоваровИзПроизводства

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем тКэшСуммСписания Экспорт;		// Переменная для кэширования результатов вычисления суммы списания

Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	Если обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
		ОбязательныеТовары.Вставить("Партия",2);
		ОбязательныеТовары.Вставить("ГТД",2);
	КонецЕсли;
	
	// Обязательные поля таблицы "Коды маркировки"
	ОбязательныеКодыМаркировки = Новый Структура();
	ОбязательныеКодыМаркировки.Вставить("КодМаркировки",3);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	ОбязательныеРеквизиты.Вставить("Цех",1);
	
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	ОбязательныеРеквизиты.Вставить("КодыМаркировки", ОбязательныеКодыМаркировки);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);
		
		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
		
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			КонтролируемыеРеквизитыШапки.Вставить("Цех",КонтрольПоПодразделению);
			КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании",КонтрольПоПодразделению);
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;	
	КонецЕсли;	
	
	Результат = Результат И дкПроверитьКорректностьМаркировки(ЭтотОбъект,,, Ошибки);
	
	дкПроверитьКорректностьРНПТ(ЭтотОбъект);
	
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ИзвлечениеТоваровИзПроизводства","Извлечение товаров из производства",Истина);

	Возврат СписокХозОпераций;
КонецФункции

//Заполнение табличной части документа остатками из заказ-наряда
Процедура ЗаполнитьТоваромВПроизводствеПоЗаказНаряду() Экспорт
	
	Товары.Очистить();
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТоварыВПроизводствеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ТоварыВПроизводстве.Остатки("+?(Ссылка.Пустая(),"","&НаМомент")+",
	|		ЗаказНаряд = &ЗаказНаряд
	|		    И Цех = &Цех) КАК ТоварыВПроизводствеОстатки");
		
	Запрос.УстановитьПараметр("ЗаказНаряд", ДокументОснование);
	Запрос.УстановитьПараметр("Цех", Цех);
	Запрос.УстановитьПараметр("НаМомент", МоментВремени());
	
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаТоваров=Товары.Добавить();
		НоваяСтрокаТоваров.Номенклатура=Выборка.Номенклатура;
		НоваяСтрокаТоваров.ХарактеристикаНоменклатуры=Выборка.ХарактеристикаНоменклатуры;
		ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрокаТоваров);
		НоваяСтрокаТоваров.Количество=Выборка.Количество/НоваяСтрокаТоваров.Коэффициент;
		ОбработкаРеквизита("Товары.Количество", НоваяСтрокаТоваров);
	КонецЦикла;

КонецПроцедуры
//БИЗТЕХ КОВАЛЬ 14.07.2025 ++
Процедура ЗаполнитьСкладПоТоварамВПроизводстве() Экспорт
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ТоварыВПроизводстве.Номенклатура КАК Номенклатура,
	             |	ТоварыВПроизводстве.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	СУММА(ВЫБОР
	             |			КОГДА ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	             |				ТОГДА -ТоварыВПроизводстве.Количество
	             |			ИНАЧЕ ТоварыВПроизводстве.Количество
	             |		КОНЕЦ) КАК Количество,
	             |	ТоварыВПроизводстве.Регистратор.СкладКомпании КАК Склад
	             |ПОМЕСТИТЬ ВРТАБЛ
	             |ИЗ
	             |	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
	             |ГДЕ
	             |	ТоварыВПроизводстве.ЗаказНаряд = &ЗаказНаряд
	             |	И ТоварыВПроизводстве.Цех = &Цех
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ТоварыВПроизводстве.Номенклатура,
	             |	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
	             |	ТоварыВПроизводстве.Регистратор.СкладКомпании
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВРТАБЛ.Номенклатура КАК Номенклатура,
	             |	ВРТАБЛ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	ВРТАБЛ.Количество КАК Количество,
	             |	ВРТАБЛ.Склад КАК Склад
	             |ПОМЕСТИТЬ ВР2
	             |ИЗ
	             |	ВРТАБЛ КАК ВРТАБЛ
	             |ГДЕ
	             |	ВРТАБЛ.Количество <> 0
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВР2.Склад КАК Склад
	             |ИЗ
	             |	ВР2 КАК ВР2";
	Запрос.УстановитьПараметр("ЗаказНаряд",ДокументОснование);
	Запрос.УстановитьПараметр("Цех",Цех);
	ВыборкаСкладов=Запрос.Выполнить().Выбрать();
	Пока ВыборкаСкладов.Следующий() Цикл
		СкладКомпании = ВыборкаСкладов.Склад;
		Прервать;
	КонецЦикла;
	
КонецПроцедуры
//БИЗТЕХ КОВАЛЬ 14.07.2025 --


//Получение строкового представления о ремонтируемом автомобиле
Функция ОтобразитьИнформациюОбАвтомобиле() Экспорт
	ИнформацияОбАвтомобиле="";
	Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказНаряд") И (НЕ обЗначениеНеЗаполнено(ДокументОснование)) Тогда
		Попытка
			ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокументОснование.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер, ДокументОснование.Дата);
		Исключение
			ГосНомер = "";
		КонецПопытки;
		Если обЗначениеНеЗаполнено(ГосНомер) Тогда
			ГосНомер="";
		Иначе
			ГосНомер="; гос № "+ГосНомер;
		КонецЕсли; 
		Попытка
			ИнформацияОбАвтомобиле=СокрЛП(ДокументОснование.Автомобиль.Модель)+"; VIN "+ДокументОснование.Автомобиль.VIN+ГосНомер;
		Исключение
			#Если Клиент Тогда
				Сообщить("При получении информации о автомобиле произошли ошибки:
				|	" + ОписаниеОшибки(),СтатусСообщения.Внимание);
			#КонецЕсли
			ИнформацияОбАвтомобиле="";
		КонецПопытки;
	КонецЕсли;
	Возврат ИнформацияОбАвтомобиле;
КонецФункции 

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.Цех КАК Цех,
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Цех.Подразделение КАК ПодразделениеОтправителя,
	|	Док.СкладКомпании.Подразделение КАК ПодразделениеПолучателя, 
	|	Док.ДокументОснование КАК ДокументОснование,
	|	Док.ДокументОснование КАК ДокументПродажи
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// формирует движения документа по партионным регистрам
// Режим - режим проведения (оперативный/неоперативный)
// ДокументСсылка - ссылка на документ который надо допровести по партиям
// Возвращает Истина - все хорошо, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	//Очистим возможные движения по производственному регистру, 
	//если было отложенное проведение по партиям
	НаборЗаписейТоварыВПроизводстве=РегистрыНакопления.ТоварыВПроизводстве.СоздатьНаборЗаписей();
	НаборЗаписейТоварыВПроизводстве.Отбор.Регистратор.Значение=ШапкаДокумента.Ссылка;
	НаборЗаписейТоварыВПроизводстве.Отбор.Регистратор.Использование=Истина;
	НаборЗаписейТоварыВПроизводстве.Записать();
	
	// проверим, если подразделение проводиться по партиям "отложенно", то дальше не идем
	НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	//Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
	//	Возврат НЕ Отказ;
	//КонецЕсли;
	
	// БАЛАНС: Если происходит перемещение товаров между складами подразделений, принадлежащих
	// различным балансовым "веткам", то возможен разрыв баланса.
	СпособВеденияБаланса		  = Константы.СпособВеденияБаланса.Получить(); 
	ДобавлятьКорректирующиеЗаписи = (СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	ПодразделениеОтправителя      = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ПодразделениеОтправителя);
	ПодразделениеПолучатель       = обПолучитьБалансовоеПодразделение(ШапкаДокумента.ПодразделениеПолучателя);
    ДобавлятьКорректирующиеЗаписи = ДобавлятьКорректирующиеЗаписи И (ПодразделениеОтправителя<>ПодразделениеПолучатель);
	
	Если НЕ обЗначениеНеЗаполнено(СкладКомпании.СтратегияСписанияПартийТоваровПоДатам) Тогда
		// сначала попробуем взять стратегию со склада
		СтратегияСписанияПартийТоваровПоДатам = СкладКомпании.СтратегияСписанияПартийТоваровПоДатам;
	Иначе
		// если не получилось берем из константы	
		СтратегияСписанияПартийТоваровПоДатам = Константы.СтратегияСписанияПартийТоваровПоДатам.Получить();
	КонецЕсли;	
	Если СтратегияСписанияПартийТоваровПоДатам = Перечисления.СтратегияСписанияПартийТоваровПоДатам.ЛИФО Тогда
		ПорядокСписанияПартий="Убыв"; 
	Иначе
		ПорядокСписанияПартий="Возр";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВПроизводствеОстатки.Цех КАК Цех,
	               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТоварыВПроизводствеОстатки.СтатусПартии КАК СтатусПартии,
	               |	ТоварыВПроизводствеОстатки.Партия КАК Партия,
				   |	ТоварыВПроизводствеОстатки.Партия.Дата КАК ПартияДата,
	               |	ТоварыВПроизводствеОстатки.ГТД КАК ГТД,
	               |	ЕСТЬNULL(ТоварыВПроизводствеОстатки.КоличествоОстаток,0) КАК Количество,
	               |	ЕСТЬNULL(ТоварыВПроизводствеОстатки.СуммаОстаток,0) КАК Сумма,
	               |	ЕСТЬNULL(ТоварыВПроизводствеОстатки.СуммаНДСОстаток,0) КАК СуммаНДС,
	               |	ЕСТЬNULL(ТоварыВПроизводствеОстатки.СуммаУпрОстаток,0) КАК СуммаУпр
	               |ИЗ
	               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(
	               |			&НаМомент,
	               |			ЗаказНаряд = &ЗаказНаряд
	               |				И Цех = &Цех) КАК ТоварыВПроизводствеОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТоварыВПроизводствеОстатки.ХарактеристикаНоменклатуры Убыв,
	               |	ТоварыВПроизводствеОстатки.Партия.Дата "+ПорядокСписанияПартий+",
				   |	ТоварыВПроизводствеОстатки.ГТД Убыв
				   |
				   |ИТОГИ СУММА(Количество) КАК Количество, СУММА(СуммаНДС) КАК СуммаНДС, СУММА(Сумма) КАК Сумма, СУММА(СуммаУпр) КАК СуммаУпр
				   |ПО ТоварыВПроизводствеОстатки.Номенклатура
				   |
				   |";
	Запрос.УстановитьПараметр("НаМомент",ШапкаДокумента.МоментВремени);
	Запрос.УстановитьПараметр("ЗаказНаряд",ШапкаДокумента.ДокументОснование.Ссылка);
	Запрос.УстановитьПараметр("Цех",ШапкаДокумента.Цех);
	ТабВПроизводстве = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//Извлечение товаров из производства
	НаборЗаписейТоварыВПроизводстве=Движения.ТоварыВПроизводстве;
	ВремТовары=ШапкаДокумента.Ссылка.Товары.Выгрузить();
	ВремТовары.Сортировать("Партия Убыв, ГТД Убыв");
	
	// получим таблицу номенклатуры с ручным списанием характеристик
	ТаблицаРучныхХарактеристик=дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(ШапкаДокумента.Ссылка);
	
	Для каждого СтрокаТоваров Из ВремТовары Цикл
		НадоСписать=Окр(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент,3);
		// инициализируем переменные для расчета усредненной цены списанных партий
		ОбщаяСумма = 0; ОбщаяСуммаУпр=0; ОбщаяСуммаНДС = 0; ОбщееКоличество = 0;
		// получим строки таблицы партий с нашим товаром
		СтрокаПартийНоменклатуры=ТабВПроизводстве.Строки.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		Если СтрокаПартийНоменклатуры<>Неопределено Тогда
			СтруктураОтбора=Новый Структура("Номенклатура",СтрокаТоваров.Номенклатура);
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) ИЛИ (ТаблицаРучныхХарактеристик<>Неопределено И ТаблицаРучныхХарактеристик.Найти(СтрокаТоваров.Номенклатура,"Номенклатура")<>Неопределено) Тогда 
				СтруктураОтбора.Вставить("ХарактеристикаНоменклатуры",СтрокаТоваров.ХарактеристикаНоменклатуры);
			КонецЕсли;
			МассивНайденныхСтрок=СтрокаПартийНоменклатуры.Строки.НайтиСтроки(СтруктураОтбора);
			// теперь идем по партиям товаров и списываем в соответствии с выбранной стратегией
			Для Сч=0 По МассивНайденныхСтрок.ВГраница() Цикл
				ТекСтрока=МассивНайденныхСтрок[Сч];
				// проверки на нулевую партию или партию отрицательных остатков
				Если ТекСтрока.Количество=NULL ИЛИ ТекСтрока.Количество=0 Тогда Продолжить; КонецЕсли;
				
				// если указаны партии, то пропустим все партии не наши
				Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.Партия) И ТекСтрока.Партия<>СтрокаТоваров.Партия Тогда
					Продолжить;
				КонецЕсли;
				// если указаны ГТД, то пропустим все ГТД не наши
				Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ГТД) И ТекСтрока.ГТД<>СтрокаТоваров.ГТД Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяЗапись=НаборЗаписейТоварыВПроизводстве.Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
				НоваяЗапись.Период=ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.ЗаказНаряд=ШапкаДокумента.ДокументОснование.Ссылка;
				НоваяЗапись.Цех=ШапкаДокумента.Цех;
				НоваяЗапись.Номенклатура=ТекСтрока.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры=ТекСтрока.ХарактеристикаНоменклатуры;
				Партия=ТекСтрока.Партия;
				НоваяЗапись.Партия = Партия;
				НоваяЗапись.СтатусПартии=ТекСтрока.СтатусПартии;
				ГТД=ТекСтрока.ГТД;
				НоваяЗапись.ГТД = ГТД;
				// определяемся с хоз. операцией
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;

				Если ТекСтрока.Количество > НадоСписать И ТекСтрока.Количество>0 Тогда
					КоличествоСписания	= НадоСписать;
					СуммаСписания	 	= Окр(ТекСтрока.Сумма/ТекСтрока.Количество*НадоСписать, 2);
					СуммаУпрСписания 	= Окр(ТекСтрока.СуммаУпр/ТекСтрока.Количество*НадоСписать, 2);
					СуммаНДССписания	= Окр(ТекСтрока.СуммаНДС/ТекСтрока.Количество*НадоСписать, 2);
				Иначе
					КоличествоСписания	= ТекСтрока.Количество;
					СуммаСписания	 	= Окр(ТекСтрока.Сумма, 2);
					СуммаУпрСписания 	= Окр(ТекСтрока.СуммаУпр, 2);
					СуммаНДССписания	= Окр(ТекСтрока.СуммаНДС, 2);
				КонецЕсли;
				НоваяЗапись.Количество	= КоличествоСписания;
				НоваяЗапись.Сумма		= СуммаСписания;
				НоваяЗапись.СуммаУпр	= СуммаУпрСписания;
				НоваяЗапись.СуммаНДС	= СуммаНДССписания;
				
				// запомним удельные значения списания для отрицательной партии товаров
				ОбщаяСумма = ОбщаяСумма + СуммаСписания;
				ОбщаяСуммаУпр = ОбщаяСуммаУпр + СуммаУпрСписания;
				ОбщаяСуммаНДС = ОбщаяСуммаНДС + СуммаНДССписания;
				ОбщееКоличество = ОбщееКоличество + КоличествоСписания;
							
				// уменьшим ресурсы для остатка текущей партии
				Если КоличествоСписания >= ТекСтрока.Количество Тогда
					СтрокаПартийНоменклатуры.Строки.Удалить(ТекСтрока);
				Иначе
					ТекСтрока.Количество = ТекСтрока.Количество	- КоличествоСписания;
					ТекСтрока.Сумма		 = ТекСтрока.Сумма		- СуммаСписания;
					ТекСтрока.СуммаУпр	 = ТекСтрока.СуммаУпр	- СуммаУпрСписания;
					ТекСтрока.СуммаНДС	 = ТекСтрока.СуммаНДС	- СуммаНДССписания;
				КонецЕсли;
				// уменьшаем количество которое надо списать (или увеличиваем если это коррекция отрицательной партии)
				НадоСписать=НадоСписать - КоличествоСписания;
				Если НадоСписать<=0 Тогда Прервать; КонецЕсли;
			КонецЦикла;
			
			// уменьшим ресурсы для остатка по номенклатуре
			Если ОбщееКоличество >= СтрокаПартийНоменклатуры.Количество Тогда
				ТабВПроизводстве.Строки.Удалить(СтрокаПартийНоменклатуры);
			Иначе
				СтрокаПартийНоменклатуры.Количество	 = СтрокаПартийНоменклатуры.Количество	- ОбщееКоличество;
			КонецЕсли;
		КонецЕсли;
		Если НадоСписать>0 Тогда
			//Попытка перемещения более чем есть в цехе
			Сообщение="Товар """+СокрЛП(СтрокаТоваров.Номенклатура);
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ХарактеристикаНоменклатуры) Тогда
				Сообщение=Сообщение+""" с характеристикой """+СокрЛП(СтрокаТоваров.ХарактеристикаНоменклатуры)+"""";
			КонецЕсли;
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.Партия) Тогда
				Сообщение=Сообщение+" (Партия <"+СтрокаТоваров.Партия+">)";
			КонецЕсли; 
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ГТД) Тогда
				Сообщение=Сообщение+" (ГТД <"+СокрЛП(СтрокаТоваров.ГТД)+">)";
			КонецЕсли; 
			Сообщение=Сообщение+". Извлекается из производства "+СокрЛП(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент)+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". Помещено в производство "+СокрЛП(ОбщееКоличество)+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения)+". ";
			Сообщение=Сообщение+"Превышение на "+СокрЛП(НадоСписать)+" "+СокрЛП(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения);
			дкСообщитьРезультат(Сообщение,СтатусСообщения="Важное",ЭтотОбъект);
			Отказ=Истина;
		КонецЕсли; 
	КонецЦикла; 
	Если НЕ Отказ Тогда НаборЗаписейТоварыВПроизводстве.Записать(); КонецЕсли; 
	
	Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
		// Доходы и расходы на себестоимость не оприходованных партий
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК СуммаУпр
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Регистратор = &Регистратор
		|	И ТоварыВПроизводстве.ВидДвижения = &ВидДвижения
		|	И ТоварыВПроизводстве.СтатусПартии = &СтатусПартии";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Запрос.УстановитьПараметр("ВидДвижения",ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварКупленный);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаВсего=Выборка.СуммаУпр;
			Если СуммаВсего<>0 Тогда
				НаборЗаписейДоходыИРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыИРасходы.ДокументОбъект=ЭтотОбъект;
				НаборЗаписейДоходыИРасходы.ШапкаДокумента=ШапкаДокумента;
				НаборЗаписейДоходыИРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий;
				НаборЗаписейДоходыИРасходы.ВУпрВалюте = Истина;
				НаборЗаписейДоходыИРасходы.Расход = СуммаВсего;
				НаборЗаписейДоходыИРасходы.Приход();
			КонецЕсли; 
		КонецЕсли; 
	Иначе
		// проведем партии товаров
		НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
		НаборЗаписейГТД=Движения.ГТДПартийТоваровКомпании;
		Для каждого СтрокаИзПроизводства Из НаборЗаписейТоварыВПроизводстве Цикл
			НоваяЗапись=НаборЗаписейПартии.Добавить();
			НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период=ШапкаДокумента.Дата;
			НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
			НоваяЗапись.СкладКомпании=ШапкаДокумента.СкладКомпании;
			НоваяЗапись.Номенклатура=СтрокаИзПроизводства.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаИзПроизводства.ХарактеристикаНоменклатуры;
			НоваяЗапись.СтатусПартии=СтрокаИзПроизводства.СтатусПартии;
			НоваяЗапись.Партия=СтрокаИзПроизводства.Партия;
			НоваяЗапись.Количество=СтрокаИзПроизводства.Количество;
			НоваяЗапись.Сумма=Окр(СтрокаИзПроизводства.Сумма,2);
			НоваяЗапись.СуммаУпр=Окр(СтрокаИзПроизводства.СуммаУпр,2);
			НоваяЗапись.СуммаНДС=Окр(СтрокаИзПроизводства.СуммаНДС,2);
			НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
			НоваяЗапись.СтавкаНДС=СтрокаИзПроизводства.СтавкаНДС;
			Если НЕ обЗначениеНеЗаполнено(СтрокаИзПроизводства.ГТД) Тогда
				//Запишем ГТД перемещаемых партий
				НоваяЗапись=НаборЗаписейГТД.Добавить();
				НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
				НоваяЗапись.Период=ШапкаДокумента.Дата;
				НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
				НоваяЗапись.СкладКомпании=ШапкаДокумента.СкладКомпании;
				НоваяЗапись.Номенклатура=СтрокаИзПроизводства.Номенклатура;
				НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаИзПроизводства.ХарактеристикаНоменклатуры;
				НоваяЗапись.Партия=СтрокаИзПроизводства.Партия;
				НоваяЗапись.ГТД=СтрокаИзПроизводства.ГТД;
				НоваяЗапись.Количество=СтрокаИзПроизводства.Количество;
				НоваяЗапись.ХозОперация=ШапкаДокумента.ХозОперация;
			КонецЕсли; 
		КонецЦикла; 
		Если НЕ Отказ Тогда НаборЗаписейПартии.Записать(); КонецЕсли; 
	КонецЕсли;
	
	// Переместим в производство маркируемый товар
	НаборЗаписейМаркировкаТоваровВПроизводстве=Движения.МаркировкаТоваровВПроизводстве;
	НаборЗаписейМаркировкаТоваровВПроизводстве.РежимПроведения=Режим;
	НаборЗаписейМаркировкаТоваровВПроизводстве.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейМаркировкаТоваровВПроизводстве.РезультатЗапросаПоТоварам=Неопределено;
	НаборЗаписейМаркировкаТоваровВПроизводстве.ДокументЗаказНаряд=ШапкаДокумента.ДокументОснование.Ссылка;
	НаборЗаписейМаркировкаТоваровВПроизводстве.Цех=ШапкаДокумента.Цех;
	НаборЗаписейМаркировкаТоваровВПроизводстве.ШапкаДокумента=ШапкаДокумента;
	Отказ=НЕ НаборЗаписейМаркировкаТоваровВПроизводстве.Расход() ИЛИ Отказ;
	
	// Доходы и расходы
	Если ДобавлятьКорректирующиеЗаписи Тогда
		// У подразделения цеха-отправителя возникает расход.
		НаборЗаписейТоварыВПроизводстве=Движения.ТоварыВПроизводстве;
		ТаблицаПартий = НаборЗаписейТоварыВПроизводстве.Выгрузить();
		ТаблицаПартий.Свернуть("СтатусПартии","СуммаУпр");
		Для каждого ТекСтрокаДвижения Из ТаблицаПартий Цикл  	
			Если ТекСтрокаДвижения.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
				Продолжить;
			КонецЕсли;
			СуммаДиР = ТекСтрокаДвижения.СуммаУпр;
			Если СуммаДиР<>0 Тогда
				НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
				// Если способ ведения баланса не по подразделению то подразделение должно быть как у документа
				Если СпособВеденияБаланса = Перечисления.СпособВеденияБаланса.ПоПодразделению Тогда
					НаборЗаписейДоходыРасходы.Подразделение = ШапкаДокумента.ПодразделениеОтправителя;
				Иначе
					НаборЗаписейДоходыРасходы.Подразделение = Неопределено;
				КонецЕсли;
				НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
				НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.Себестоимость;
				НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
				НаборЗаписейДоходыРасходы.Расход         = СуммаДиР;
				Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
			КонецЕсли;			
		КонецЦикла;			
		// У подразделения склада-получателя - доход.
		НаборЗаписейПартии=Движения.ПартииТоваровКомпании;
		ТаблицаПартий = НаборЗаписейПартии.Выгрузить();
		ТаблицаПартий.Свернуть("СтатусПартии","СуммаУпр");
		Для каждого ТекСтрокаДвижения Из ТаблицаПартий Цикл  	
			Если ТекСтрокаДвижения.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия Тогда
				Продолжить;
			КонецЕсли;
			СуммаДиР = ТекСтрокаДвижения.СуммаУпр;
			Если СуммаДиР<>0 Тогда
				НаборЗаписейДоходыРасходы=Движения.ДоходыИРасходы;
				НаборЗаписейДоходыРасходы.ДокументОбъект = ЭтотОбъект;
				НаборЗаписейДоходыРасходы.Подразделение  = ШапкаДокумента.ПодразделениеПолучателя;
				НаборЗаписейДоходыРасходы.ВУпрВалюте     = Истина;
				НаборЗаписейДоходыРасходы.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КорректировкаБалансаПоПодразделениям;
				НаборЗаписейДоходыРасходы.ШапкаДокумента = ШапкаДокумента;
				НаборЗаписейДоходыРасходы.Доход          = СуммаДиР;
				Отказ = НЕ НаборЗаписейДоходыРасходы.Приход() ИЛИ Отказ;
			КонецЕсли;			
		КонецЦикла;			
	КонецЕсли; 	
	
	// двигаем границу последовательности партий
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.СкладКомпанииБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); СкладКомпанииБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл",СкладКомпанииБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		
		НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыПартий.СкладКомпании		= ШапкаДокумента.СкладКомпании;
			НаборЗаписейГраницыПартий.МоментВремени		= ШапкаДокумента.Дата;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПартий.СкладКомпании		= ДополнительныеСвойства.СкладКомпанииБыл;
			НаборЗаписейГраницыПартий.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПартий.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыПартий.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПартий.ДокументСсылка	= ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПартий.ИзменитьГраницу();
	КонецЕсли;
	
	// двигаем границу последовательности производства
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказНарядБыл) Тогда
		// если идет допроведение, то надо получить те значения которые были раньше
		Если Ссылка<>ДокументСсылка Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаряд ИЗ РегистрНакопления.ТоварыВПроизводстве ГДЕ Регистратор=&Ссылка");
			Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
			Результат = Запрос.Выполнить(); ЗаказНарядБыл=Неопределено;
			Если НЕ Результат.Пустой() Тогда
				СкладКомпанииБыл = Результат.Выгрузить().ВыгрузитьКолонку("ЗаказНаряд");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("ЗаказНарядБыл",ЗаказНарядБыл);
			ДополнительныеСвойства.МоментВремениБыл = ДокументСсылка.МоментВремени();
		КонецЕсли;
		
		НаборЗаписейГраницыПроизводство = РегистрыСведений.ГраницыПроизводство.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			НаборЗаписейГраницыПроизводство.ЗаказНаряд       = ШапкаДокумента.ДокументОснование;
			НаборЗаписейГраницыПроизводство.МоментВремени    = ШапкаДокумента.Дата;
			НаборЗаписейГраницыПроизводство.ЗаказНарядБыл	 = ДополнительныеСвойства.ЗаказНарядБыл;
			НаборЗаписейГраницыПроизводство.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыПроизводство.ЗаказНаряд       = ДополнительныеСвойства.ЗаказНарядБыл;
			НаборЗаписейГраницыПроизводство.МоментВремени    = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыПроизводство.ЗаказНарядБыл	 = Неопределено;
			НаборЗаписейГраницыПроизводство.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыПроизводство.ДокументСсылка = ШапкаДокумента.Ссылка;
		НаборЗаписейГраницыПроизводство.ИзменитьГраницу();
	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего()Экспорт
	Возврат дкПолучитьСуммуСписания(ЭтотОбъект, "ТоварыВПроизводстве", тКэшСуммСписания);
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
	Если Имя="Товары.Номенклатура" Тогда
		// глобально
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обДопустимаяСтрока(ТекСтрока) Тогда Возврат Рез; КонецЕсли; //Это если это был набор и мы удалили эту строку
		Рез=ОбработкаРеквизита("УстановитьРозничнуюЦену",ТекСтрока,ЭтаФорма) И Рез;
		
		Если ПустаяСтрока(ТекСтрока.ИдентификаторТовара) Тогда
			ТекСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="Товары.Количество" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.ЕдиницаИзмерения" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
		
	ИначеЕсли Имя="Товары.ЦенаРозничная" Тогда
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Товары.СуммаРозничная" Тогда
		Если (ТекСтрока.Количество*ТекСтрока.Коэффициент=0) Тогда
			ТекСтрока.ЦенаРозничная=0;
		Иначе
			ТекСтрока.ЦенаРозничная=ТекСтрока.СуммаРозничная/(ТекСтрока.Количество*ТекСтрока.Коэффициент);
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Товары.Ячейка" Тогда
		Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) Тогда
			ТекСтрока.Ячейка=Справочники.ЯчейкиХранения.ПустаяСсылка();
			Возврат Истина;
		КонецЕсли;
		ЯчейкаСсылка=Справочники.Номенклатура.ПолучитьЯчейкуХранения(ТекСтрока.Номенклатура,СкладКомпании);
		ТекСтрока.Ячейка=ЯчейкаСсылка;
		Возврат Истина;
		
	ИначеЕсли Имя="УстановитьРозничнуюЦену" Тогда
		//Заполним розничную цену (для розничного склада)
		Если (НЕ обЗначениеНеЗаполнено(СкладКомпании)) И (СкладКомпании.Розничный) Тогда
			Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура)) И (ТекСтрока.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга) Тогда
				ТекСтрока.ЦенаРозничная=обПолучитьЦену(СкладКомпании.ТипЦенРозничнойТорговли,ТекСтрока.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,,ТекСтрока.ХарактеристикаНоменклатуры,ТекСтрока.ЕдиницаИзмерения,СкладКомпании.Подразделение);
			КонецЕсли;
		КонецЕсли; 
		Возврат ОбработкаРеквизита("УстановитьРозничнуюСумму",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="УстановитьРозничнуюСумму" Тогда
		//Заполним розничную сумму (для розничного склада)
		ТекСтрока.СуммаРозничная=ТекСтрока.ЦенаРозничная*ТекСтрока.Количество*ТекСтрока.Коэффициент;
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	СтруктураПараметров=Неопределено;
	Если НЕ обЗначениеНеЗаполнено(СкладКомпании) И СкладКомпании.Розничный Тогда
		СтруктураПараметров=Новый Структура("ИмяРеквизитаЦена,ТипЦен","ЦенаРозничная",СкладКомпании.ТипЦенРозничнойТорговли);
	КонецЕсли;
	дкПечатьЭтикетокИЦенников(ЭтотОбъект,СтруктураПараметров);
КонецФункции

// Формирует печатную форму "ИзвлечениеТоваровИзПроизводства"
// Возвращает сформированный табличный документ:
Функция ПечатьИзвлечениеТоваровИзПроизводства(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ИзвлечениеТоваровИзПроизводства");
	ВыборкаТабличнойЧасти = ЭтотОбъект.Товары;
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	//Настроим макет отчёта
	//Удаляем колонку "ЯчейкаХранения", если ни в одной из номенклатур этот реквизит не заполнен
	//Увеличиваем за её счёт колонку "Товар"
	ЕстьЯчейкиХранения = Ложь;
	Для Каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
		Если НЕ обЗначениеНеЗаполнено(СтрокаТЧ.Ячейка) Тогда
			ЕстьЯчейкиХранения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьЯчейкиХранения Тогда
		ОбластьТовар = Макет.Область("Товар");
		ОбластьЯчейкаХранения = Макет.Область("ЯчейкаХранения");
		ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьЯчейкаХранения.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьЯчейкаХранения,ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;	
	
	//Настроим макет
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
	ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(Организация, , ДополнительныеПараметры);
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьНаименование(ЭтотОбъект.СкладКомпании);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьМакета.Параметры.ЗаказНарядПредставление=дкПолучитьПредставление(ЭтотОбъект.ДокументОснование);
	ОбластьМакета.Параметры.АвтомобильПредставление=ОтобразитьИнформациюОбАвтомобиле();

	ОбластьМакета.Параметры.ПредставлениеПолучателя = спПолучитьНаименование(ЭтотОбъект.Цех);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	
	ТабДокумент.Вывести(ОбластьМакета);

	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура();
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	//перебор строк
	Для каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		//В возвращаемой структуре нет ключа "Ячейка", создадим его
		СтруктураСтроки.Вставить("Ячейка");
		//Если ЯчейкаХранения не определена для данной номенклатуры, то печатаем пробел
		ЯчейкаДляПечати = СокрЛП(СтрокаТабличнойЧасти.Ячейка.Код);
		СтруктураСтроки.Ячейка 	= ?(обЗначениеНеЗаполнено(ЯчейкаДляПечати)," ",ЯчейкаДляПечати);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//доп. области
		мсвДопОбластиПодвала = Неопределено;
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;		
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура();
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
		
	КонецЦикла;
	
	//Итогов по странице на этой печатной форме нет, но выводим для прорисовки завершающей чёрной линии снизу страницы
	дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	
	
	//Подвал
	//Выводим общее количество деталей
	ВсегоНаименований 	= Формат(ВыборкаТабличнойЧасти.Количество(), ФорматВыводаКоличества);
	ОбщееКоличество 	= Формат(ВыборкаТабличнойЧасти.Итог("Количество"), ФорматВыводаКоличества);
	ОбластьПодвал.Параметры.Итого = "Всего наименований " + ВсегоНаименований + " в количестве " + ОбщееКоличество;
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	ОбластьПодвал.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции //ПечатьИзвлечениеТоваровИзПроизводства()

// Формирует печатную форму "ТОРГ13"
// Возвращает сформированный табличный документ:
Функция ПечатьТОРГ13(ТабДокумент) Экспорт
	Макет = ПолучитьОбщийМакет("ТОРГ13");
	
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	СтруктураПредставления=Новый Структура(
		"Наименование,ИНН,АдресЮридический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
		"","ИНН ","","тел.: ","р/с ","в банке ","БИК ","к/с "
	);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.Номер = НомерДляПечати;
	ОбластьМакета.Параметры.Дата = Формат(Дата, "ДФ = дд.ММ.гггг");
	ОбластьМакета.Параметры.ОрганизацияПредставление	= спПолучитьПредставление(ЭтотОбъект.Организация,СтруктураПредставления);
	ОбластьМакета.Параметры.ОрганизацияПоОКПО			= ЭтотОбъект.Организация.КодПоОКПО;
	ОбластьМакета.Параметры.ОтправительПодразделение	= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Цех);
	ОбластьМакета.Параметры.ПолучательПодразделение		= обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.СкладКомпании);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ВалютаТек			= ЭтотОбъект.ВалютаДокумента;
	КурсТек				= ЭтотОбъект.КурсДокумента;
	Розничный			= ЭтотОбъект.СкладКомпании.Розничный;
	ВалютаРегл			= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	СтруктураКурса		= обКурсДляВалюты(ВалютаРегл, ЭтотОбъект.Дата);
	КурсРегл			= СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	ВалютаУпр			= Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	Если обЗначениеНеЗаполнено(ЭтотОбъект.КурсВалютыУпр) Тогда
		СтруктураКурса = обКурсДляВалюты(ВалютаУпр,ЭтотОбъект.Дата);
		КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	Иначе
		КурсУпр = ЭтотОбъект.КурсВалютыУпр; 
	КонецЕсли; 
	
	СтрокНаСтранице = 25;
	СтрокШапки      = 12;
	СтрокПодвала    = 5;
	НомерСтраницы   = 1;

	// Выводим заголовок таблицы
	ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
	ЗаголовокТаблицы.Параметры.Валюта = ВалютаРегл;
	ТабДокумент.Вывести(ЗаголовокТаблицы);

	СтрокаКолонокСвертки = "Количество, КоличествоБазовое";
	Если Розничный Тогда
		ЕстьПартии = Ложь;
		ИмяРегистра = "ОстаткиТоваровКомпании";
		ИспользуемыеРесурсы = Новый Структура("СуммаРозн");
		СтрокаКолонокСвертки = СтрокаКолонокСвертки+",СуммаРозн";
	Иначе
		ЕстьПартии = Истина;
		ИмяРегистра = "ПартииТоваровКомпании";
		ИспользуемыеРесурсы = Новый Структура("Сумма"+?(ВалютаТек=ВалютаУпр,"Упр",""));
		СтрокаКолонокСвертки = СтрокаКолонокСвертки+",Сумма"+?(ВалютаТек=ВалютаУпр,"Упр","");
	КонецЕсли;
	ТаблицаСуммСписания = дкПолучитьТаблицуСуммСписания(Ссылка, ЕстьПартии, ИмяРегистра, ИспользуемыеРесурсы, ВидДвиженияНакопления.Приход);
	ТаблицаСуммСписания.Свернуть("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры", СтрокаКолонокСвертки);
	
	КоличествоСтрок = ТаблицаСуммСписания.Количество();
    Если КоличествоСтрок = 1 Тогда
		ПереноситьПоследнююСтроку	= 0;
	Иначе
		ЦелыхСтраницСПодвалом		= Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		ЦелыхСтраницБезПодвала		= Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		ПереноситьПоследнююСтроку	= ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
	КонецЕсли;

	// Определим, что показывать в колонке кода - код или артикул
	ИмяКолонкиКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ЭтотОбъект).Имя;
	
	// инициализация итогов по странице
	ИтогКоличествоМестПоСтранице = 0;
	ИтогМассаБруттоПоСтранице    = 0;
	ИтогМассыНеттоПоСтранице     = 0;
	ИтогСуммыПоСтранице          = 0;

	// инициализация итогов по документу
	ИтогоКоличество  = 0;
	ИтогоМассаБрутто = 0;
	ИтогоМассаНетто  = 0;
	ИтогоСумма       = 0;
    Ном = 0;

	// Выводим многострочную часть документа
	ОбластьИтоговПоСтранице	= Макет.ПолучитьОбласть("ИтогиПоСтранице");
	ОбластьМакета			= Макет.ПолучитьОбласть("Строка");
	
	Для Каждого ТекСтрока Из ТаблицаСуммСписания Цикл
		Ном = Ном + 1;
		ЦелаяСтраница	= (СтрокШапки + Ном - 1) / СтрокНаСтранице;
		Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
			или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
			ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

			// инициализация итогов по странице
			ИтогКоличествоМестПоСтранице = 0;
			ИтогМассаБруттоПоСтранице    = 0;
			ИтогМассаНеттоПоСтранице     = 0;
			ИтогСуммыПоСтранице          = 0;

			НомерСтраницы = НомерСтраницы + 1;
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
			ТабДокумент.Вывести(ЗаголовокТаблицы);
		КонецЕсли;

		Если Розничный Тогда
			Сумма = ТекСтрока.СуммаРозн;
		Иначе
			Сумма = ТекСтрока.Сумма;
		КонецЕсли;
        // Измерения
		ОбластьМакета.Параметры.Заполнить(ТекСтрока);
		Характеристика										= Строка(ТекСтрока.ХарактеристикаНоменклатуры);
		ОбластьМакета.Параметры.ТоварНаименование			= спПолучитьНаименование(ТекСтрока.Номенклатура) + ?(Характеристика = "", "",", " + Характеристика);
		ОбластьМакета.Параметры.ТоварКод					= дкПолучитьЗначениеКолонкиКода(ТекСтрока.Номенклатура,ИмяКолонкиКода,ЭтотОбъект);
		ОбластьМакета.Параметры.ЕдиницаИзмерения			= ТекСтрока.ЕдиницаИзмерения;
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПоОКЕИ	= ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
		ОбластьМакета.Параметры.КоличествоВОдномМесте		= Формат(ТекСтрока.ЕдиницаИзмерения.Коэффициент,ФорматВыводаКоличества);
		// Суммовые показатели
		ОбластьМакета.Параметры.КоличествоМест				= Формат(ТекСтрока.Количество,ФорматВыводаКоличества);
		МассаБрутто 										= ТекСтрока.Количество * Справочники.Номенклатура.ПолучитьВесНоменклатуры(ТекСтрока.Номенклатура, ТекСтрока.ЕдиницаИзмерения);
		ОбластьМакета.Параметры.МассаБрутто					= МассаБрутто;
		ОбластьМакета.Параметры.Цена						= Формат(Сумма/ТекСтрока.Количество,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.Сумма						= Формат(Сумма,ФорматВыводаСуммы);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Обновим итоги по странице
		ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ТекСтрока.Количество;
		ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + МассаБрутто;
		ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + 0;
		ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;

		// Обновим итоги по документу
		ИтогоКоличество  = ИтогоКоличество  + ТекСтрока.Количество;
		ИтогоМассаБрутто = ИтогоМассаБрутто + МассаБрутто;
		ИтогоМассаНетто  = ИтогоМассаНетто  + 0;
		ИтогоСумма       = ИтогоСумма       + Сумма;
	КонецЦикла;

	ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = Формат(ИтогКоличествоМестПоСтранице,ФорматВыводаКоличества);
	ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
	ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = Формат(ИтогСуммыПоСтранице,ФорматВыводаСуммы);
    ТабДокумент.Вывести(ОбластьИтоговПоСтранице);

	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.ИтогоКоличествоМест = Формат(ИтогоКоличество,ФорматВыводаКоличества);
	ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
	ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
	ОбластьМакета.Параметры.ИтогоСумма          = Формат(ИтогоСумма,ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьМакета);

	// Выводим подвал документа
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ОбластьМакета.Параметры.ИтогоСуммаПрописью = обЧислоПрописью(ИтогоСумма,ВалютаРегл);

	Отпустил = обПолучитьЗначениеСвойства(ЭтотОбъект,"Отпустил",Цех.Мастер);
	ОбластьМакета.Параметры.Отпустил=Отпустил;
	ОбластьМакета.Параметры.ОтпустилДолжность=Отпустил.Должность;
	ОбластьМакета.Параметры.ОтпустилПредставление=Отпустил.Наименование;
	
	Получил = обПолучитьЗначениеСвойства(ЭтотОбъект,"Получил",СкладКомпании.МОЛ);
	ОбластьМакета.Параметры.Получил=Получил;
	ОбластьМакета.Параметры.ПолучилДолжность=Получил.Должность;
	ОбластьМакета.Параметры.ПолучилПредставление=Получил.Наименование;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 15;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;

	Возврат ТабДокумент;
КонецФункции // ПечатьТОРГ13()

// Формирует печатную форму Т-1 "Товарно-транспортная накладная"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьТ1(ТабДокумент) Экспорт
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", Права,,ЭтотОбъект);
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", Права,,ЭтотОбъект);
	
	// Получим валюту регламентированного учета для перерасчета цены и суммы
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("ТТН");
	
	НомерДляПечати=дкПолучитьНомерДляПечати(ЭтотОбъект);
	
	//дальше заполнить Шапку
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	
	СтруктураПредставления2=Новый Структура(
	"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
	"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.НомерДокумента                = НомерДляПечати;
	ОбластьМакета.Параметры.ДатаДокумента                 = Формат(Дата,"ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.Грузоотправитель			  = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.Цех);
	ОбластьМакета.Параметры.Грузополучатель				  = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.СкладКомпании);
	
	Если ТипЗнч(ОбластьМакета.Параметры.Грузоотправитель) = Тип("СправочникСсылка.Цеха") Тогда
		ОбластьМакета.Параметры.ГрузоотправительПредставление = спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель.Организация,СтруктураПредставления2);
		ОбластьМакета.Параметры.ГрузополучательПоОКПО		  = ОбластьМакета.Параметры.Грузополучатель.Организация.КодПоОКПО;
	Иначе
		ОбластьМакета.Параметры.ГрузоотправительПредставление = ОбластьМакета.Параметры.Грузоотправитель.Наименование;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьМакета.Параметры.Грузополучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		ОбластьМакета.Параметры.ГрузополучательПредставление  = спПолучитьПредставление(ОбластьМакета.Параметры.Грузополучатель.Организация,СтруктураПредставления2);
		ОбластьМакета.Параметры.ГрузоотправительПоОКПО		  = ОбластьМакета.Параметры.Грузоотправитель.Организация.КодПоОКПО;
	Иначе
		ОбластьМакета.Параметры.ГрузополучательПредставление  = ОбластьМакета.Параметры.Грузополучатель.Наименование;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Выводим заголовок таблицы
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьЗаголовокТаблицы.Параметры.Валюта=ВалютаРегл;
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;	
	
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
	ОбластьВсего	= Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	
	// инициализация итогов по странице
	СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
	ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Товарно-транспортная накладная товарный раздел";
	
	Розничный = ЭтотОбъект.СкладКомпании.Розничный;
	
	СтрокаКолонокСвертки = "Количество, КоличествоБазовое";
	Если Розничный Тогда
		ЕстьПартии = Ложь;
		ИмяРегистра = "ОстаткиТоваровКомпании";
		ИспользуемыеРесурсы = Новый Структура("СуммаРозн");
		СтрокаКолонокСвертки = СтрокаКолонокСвертки+",СуммаРозн";
	Иначе
		ЕстьПартии = Истина;
		ИмяРегистра = "ПартииТоваровКомпании";
		ИспользуемыеРесурсы = Новый Структура("Сумма");
		СтрокаКолонокСвертки = СтрокаКолонокСвертки+",Сумма";
	КонецЕсли;
	ТаблицаСуммСписания = дкПолучитьТаблицуСуммСписания(Ссылка, ЕстьПартии, ИмяРегистра, ИспользуемыеРесурсы, ВидДвиженияНакопления.Приход);
	ТаблицаСуммСписания.Свернуть("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры", СтрокаКолонокСвертки);
	
	// инициализация итогов по документу
	Ном             = 0;
	ИтогоМест       = 0;
	ИтогоКоличество = 0;
	ИтогоВес        = 0;
	ИтогоСумма      = 0;
	
	КоличествоСтрок = ТаблицаСуммСписания.Количество();
	
	//доп. области
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьВсего);
	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
	
	Для Каждого ТекСтрока Из ТаблицаСуммСписания Цикл
		//заполняем данные строки
		Ном = Ном + 1;
		ТоварНаименование = спПолучитьНаименование(ТекСтрока.Номенклатура);
		Характеристика = ТекСтрока.ХарактеристикаНоменклатуры;
		//характеристику выводим в строке с наименованием
		ТоварНаименование = ТоварНаименование + ?(НЕ обЗначениеНеЗаполнено(Характеристика),", " + спПолучитьНаименование(Характеристика),"");
		
		ОбластьСтрока.Параметры.КодПродукции				= ТекСтрока.Номенклатура.Код;
		ОбластьСтрока.Параметры.Артикул 					= ТекСтрока.Номенклатура.Артикул;
		ОбластьСтрока.Параметры.Количество					= Формат(ТекСтрока.КоличествоБазовое, ФорматВыводаКоличества);
		Сумма = ?(Розничный, ТекСтрока.СуммаРозн, ТекСтрока.Сумма);
		МассаБрутто = ТекСтрока.Количество * Справочники.Номенклатура.ПолучитьВесНоменклатуры(ТекСтрока.Номенклатура, ТекСтрока.ЕдиницаИзмерения);
		ОбластьСтрока.Параметры.Цена						= Формат(Сумма/ТекСтрока.КоличествоБазовое, ФорматВыводаСуммы);
		ОбластьСтрока.Параметры.ТоварНаименование			= ТоварНаименование;
		ОбластьСтрока.Параметры.Номенклатура				= ТекСтрока.Номенклатура;
		ОбластьСтрока.Параметры.БазоваяЕдиницаНаименование	= спПолучитьНаименование(ТекСтрока.ЕдиницаИзмерения);
		ОбластьСтрока.Параметры.ВидУпаковки					= ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
		ОбластьСтрока.Параметры.КоличествоМест				= Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.Масса						= Формат(МассаБрутто / 1000, ФорматВыводаКоличества);
		ОбластьСтрока.Параметры.СуммаВсего					= Формат(Сумма, ФорматВыводаСуммы);
		//ОбластьСтрока.Параметры.НомерЗаписиВКартотеке		= 
				
		ИтогоМест		= ИтогоМест + ТекСтрока.Количество;
		ИтогоВес		= ИтогоВес + МассаБрутто;
		ИтогоКоличество	= ИтогоКоличество + ТекСтрока.КоличествоБазовое;
		ИтогоСумма		= ИтогоСумма + Сумма;
		
		//выводим строку, делая проверку попадания на лист		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, ОбластьИтоги, НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(Ном=КоличествоСтрок,мсвДопОбластиПодвала,Неопределено));
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("Количество, СуммаВсего",0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		//обновим итоги по странице
		СтруктураИтоговПоСтранице.Количество = СтруктураИтоговПоСтранице.Количество + ТекСтрока.КоличествоБазовое;
		СтруктураИтоговПоСтранице.СуммаВсего = СтруктураИтоговПоСтранице.СуммаВсего + Сумма;
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьИтоги,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	// Выводим итоги по документу в целом
	ОбластьВсего.Параметры.Количество = Формат(ИтогоКоличество, ФорматВыводаКоличества);
	ОбластьВсего.Параметры.СуммаВсего = Формат(ИтогоСумма, ФорматВыводаСуммы);
	
	ТабДокумент.Вывести(ОбластьВсего);
	
	// Выводим подвал документа
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	ОбластьПодвал.Параметры.Заполнить(Руководитель);
	ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	ОбластьПодвал.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	ОбластьПодвал.Параметры.Заполнить(Получил);
	ОбластьПодвал.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
	ОбластьПодвал.Параметры.КоличествоСтрок         = КоличествоСтрок;
	ОбластьПодвал.Параметры.МассаГрузаБрутто		= ЧислоПрописью(ИтогоВес,,",,,,,,,,0") + "кг";
	ОбластьПодвал.Параметры.МассаВсего				= Формат(ИтогоВес / 1000, ФорматВыводаКоличества);
	ОбластьПодвал.Параметры.ОтпущеноНаСуммуПрописью = обЧислоПрописью(ИтогоСумма, ВалютаРегл);
	ОбластьПодвал.Параметры.ВсегоКОплате			 = Формат(ИтогоСумма, ФорматВыводаСуммы);
	ОбластьПодвал.Параметры.ВсегоМестПрописью       = ЧислоПрописью(ИтогоМест,,",,,,,,,,0");
	ОбластьПодвал.Параметры.ВсегоНаименований       = ЧислоПрописью(КоличествоСтрок,,",,,,,,,,0");
	
	ТабДокумент.Вывести(ОбластьПодвал);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета   = Макет.ПолучитьОбласть("ТранспортныйРаздел");
	
	ЛицензионнаяКарточка 		= обПолучитьЗначениеСвойства(ЭтотОбъект, "ЛицензионнаяКарточка");
	СрокДоставки 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "СрокДоставки");
	Перевозчик 					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияПеревозчик");
	МаркаАвтомобиля     	    = обПолучитьЗначениеСвойства(ЭтотОбъект, "МаркаАвтомобиля");
	ГосНомерАвтомобиля	        = обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерАвтомобиля");
	Заказчик	 				= обПолучитьЗначениеСвойства(ЭтотОбъект, "ОрганизацияЗаказчик");
	Водитель					= обПолучитьЗначениеСвойства(ЭтотОбъект, "ФИОВодителя");
	ВодительскоеУдостоверение	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ВодительскоеУдостоверение");
	ВидПеревозки	            = обПолучитьЗначениеСвойства(ЭтотОбъект, "ВидПеревозки");
	ПунктПогрузки             	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктПогрузки");
	ПунктРазгрузки            	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ПунктРазгрузки");
	МаркаПрицепа 			  	= обПолучитьЗначениеСвойства(ЭтотОбъект, "Прицеп");
	ГосНомерПрицепа	           	= обПолучитьЗначениеСвойства(ЭтотОбъект, "ГосНомерПрицепа");
	
	Если ТипЗнч(ЛицензионнаяКарточка) = Тип("Булево") Тогда
		ШрифтСтандарт   = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , НЕ ЛицензионнаяКарточка);
		ШрифтОграничено = Новый Шрифт(ОбластьМакета.Области.Стандарт.Шрифт, , , , , , ЛицензионнаяКарточка);
		ОбластьМакета.Области.Стандарт.Шрифт   = ШрифтСтандарт;
		ОбластьМакета.Области.Ограничено.Шрифт = ШрифтОграничено;
	КонецЕсли;
	
	ОбластьМакета.Параметры.СрокДоставки              = СрокДоставки;
	ОбластьМакета.Параметры.Номер                     = НомерДляПечати;
	ОбластьМакета.Параметры.ОрганизацияПеревозчик     = Перевозчик;
	ОбластьМакета.Параметры.МаркаАвтомобиля           = МаркаАвтомобиля;
	ОбластьМакета.Параметры.ГосНомерАвтомобиля        = ГосНомерАвтомобиля;
	ОбластьМакета.Параметры.ОрганизацияЗаказчик       = Заказчик;
	ОбластьМакета.Параметры.ФИОВодителя               = Водитель;
	ОбластьМакета.Параметры.ВодительскоеУдостоверение = ВодительскоеУдостоверение;
	ОбластьМакета.Параметры.ВидПеревозки              = ВидПеревозки;
	ОбластьМакета.Параметры.ПунктПогрузки             = ПунктПогрузки;
	ОбластьМакета.Параметры.ПунктРазгрузки            = ПунктРазгрузки;
	ОбластьМакета.Параметры.Прицеп                    = МаркаПрицепа;
	ОбластьМакета.Параметры.ГосНомерПрицепа           = ГосНомерПрицепа;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СведенияОГрузе");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("ПрочиеСведения");
	ОбластьМакета.Параметры.валюта=ВалютаРегл;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
КонецФункции // ПечатьТ1()

// Формирует печатную форму Приложение №4 "Транспортная накладная"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьПриложение4(ТабДокумент) Экспорт
	ТабДокумент = дкПечатьНовойТТН(ЭтотОбъект,ТабДокумент);
	Возврат ТабДокумент;
КонецФункции // ПечатьПриложение4()

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		//Если документ вводится на основании заказ-наряда
		ЗаполнитьТоваромВПроизводствеПоЗаказНаряду();
		//БИЗТЕХ КОВАЛЬ 14.07.2025 ++
		ЗаполнитьСкладПоТоварамВПроизводстве();
		//БИЗТЕХ КОВАЛЬ 14.07.2025 --
	Иначе
		Цех=обПраво("ОсновнойЦех",Права,,ЭтотОбъект);
	КонецЕсли;
	Если (НЕ обЗначениеНеЗаполнено(СкладКомпании)) И (СкладКомпании.Розничный)  Тогда
		ТипЦен = СкладКомпании.ТипЦенРозничнойТорговли;
		ВалютаДокумента = обВалютаТипаЦены(Неопределено,ТипЦен,Ложь);
		СтруктураКурса = обКурсДляВалюты(ВалютаДокумента,Дата);
		КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Для Каждого СтрТовар Из Товары Цикл
			СтрТовар.ЦенаРозничная = обПолучитьЦену(ТипЦен,СтрТовар.Номенклатура,?(Ссылка.Пустая(),Дата,МоментВремени()),,,,СтрТовар.ХарактеристикаНоменклатуры,СтрТовар.ЕдиницаИзмерения,СкладКомпании.Подразделение);
			ОбработкаРеквизита("Товары.ЦенаРозничная",СтрТовар);
		КонецЦикла;
	КонецЕсли;
	
	// Заполним доп. поля для товарной строки
	Для Каждого СтрокаТовар Из Товары Цикл
		Если ПустаяСтрока(СтрокаТовар.ИдентификаторТовара) Тогда
			СтрокаТовар.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	КодыМаркировки.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЗаказНарядБыл");
	ДополнительныеСвойства.Вставить("СкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Если ДокументОснование.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ
			 ДокументОснование.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			 
			 //БИЗТЕХ КОВАЛЬ 11.09.2024
			//Игнорирование для пользователя БИЗТЕХ
			Если СтрНайти(ПараметрыСеанса.Пользователь.Код,"БизТех") = 1 Тогда
				Сообщить("Отключена проверка состояния заказ-наряда для пользователя БИЗТЕХ !!");
			Иначе
				Если НЕ ЭтотОбъект.Проведен Тогда
					Сообщить("Заказ-наряд выполнен или закрыт. Извлечение из производства запрещено.");
					Отказ=Истина;
					дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	// отработаем право "Запись раньше документа-основания"
	Если (Дата < ДокументОснование.ДатаСоздания) Тогда
		ЗН="Заказ-наряд № "+СокрЛП(ДокументОснование.Номер)+" от "+Формат(ДокументОснование.ДатаСоздания,"ДФ='dd.MM.yyyy ЧЧ:мм:сс'");
		Если обПраво("ЗаписьРаньшеДокументаОснования",Права,,ЭтотОбъект) Тогда
			Если обПраво("ВыводитьСообщенияПроверкиПравДоступа",Права,,ЭтотОбъект) Тогда
				Сообщить("Внимание! Документ <"+Строка(ЭтотОбъект)+"> записывается раньше создания своего документа-основания: <"+ЗН+">",СтатусСообщения.Внимание);
			КонецЕсли;
		Иначе
			Сообщить("Нет прав на запись раньше создания чем документ-основание: <"+ЗН+">");
			Отказ = Истина;
			дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			Возврат;
		КонецЕсли;
	ИначеЕсли (ДокументОснование.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт) И (Дата > ДокументОснование.ДатаОкончания) Тогда
		ЗН="Заказ-наряд № "+СокрЛП(ДокументОснование.Номер)+" от "+Формат(ДокументОснование.ДатаОкончания,"ДФ='dd.MM.yyyy ЧЧ:мм:сс'");
		Если обПраво("ЗаписьРаньшеДокументаОснования",Права,,ЭтотОбъект) Тогда
			Если обПраво("ВыводитьСообщенияПроверкиПравДоступа",Права,,ЭтотОбъект) Тогда
				Сообщить("Внимание! Документ <"+Строка(ЭтотОбъект)+"> записывается позже окончания своего документа-основания: <"+ЗН+">",СтатусСообщения.Внимание);
			КонецЕсли;
		Иначе
			Сообщить("Нет прав на запись позже окончания чем документ-основание: <"+ЗН+">");
			Отказ = Истина;
			дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ обПраво("ПеремещениеДеталейВПроизводство",Права,,ЭтотОбъект) Тогда
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение ИЛИ РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
			Сообщить("Нет прав на извлечение деталей из производства!
			|Обратитесь к администратор системы.",СтатусСообщения.Важное);
			Отказ=Истина;
			дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если (НЕ Отказ) И (РежимЗаписи<>РежимЗаписиДокумента.Проведение) Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = 0;
	КонецЕсли;	
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// товары в производстве
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаряд ИЗ РегистрНакопления.ТоварыВПроизводстве ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказНарядБыл", Результат.Выгрузить().ВыгрузитьКолонку("ЗаказНаряд"));
		КонецЕсли;
		
		// партии
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("СкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
	//БИЗТЕХ МАМОНОВ 05.12.2025 ++
	//Заполняем товары идентификаторами
	Для Каждого СтрокаТовара Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.ИдентификаторТовара) Тогда
			СтрокаТовара.ИдентификаторТовара = Новый УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	//БИЗТЕХ МАМОНОВ 05.12.2025 --
	
	//++СнимченкоАА_бизтех++
	флОтказ = Ложь;
	Если НЕ Отказ и РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		Для каждого тс Из Товары Цикл
			ТипНоменклатуры = тс.Номенклатура.ТипНоменклатуры;	
			Если ТипНоменклатуры.ДатаВведенияМаркировки<=Дата и ТипНоменклатуры.ВключенКонтрольОстатковКодовМаркировки и ТипНоменклатуры.МаркировкаОбязательная Тогда
				
				Кол = 0;
				Отбор = Новый Структура();
				Отбор.Вставить("ИдентификаторТовара", тс.ИдентификаторТовара);
				НайденноеЗначение = КодыМаркировки.НайтиСтроки(Отбор); 	
				Для каждого СтрокаТаблицы Из НайденноеЗначение Цикл
					Кол = Кол + СтрокаТаблицы.Количество;	
				КонецЦикла;   
				
				Если Кол <> тс.Количество Тогда   
					Сообщить("По номенклатуре "+тс.Номенклатура+" в строке "+тс.НомерСтроки+" количество по кодам маркировки не равно количеству по документу!");
					флОтказ = Истина; 
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;   
		Отказ = (Отказ или флОтказ)
	КонецЕсли;
	
	//--СнимченкоАА_бизтех--
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	//БИЗТЕХ КОВАЛЬ 11.09.2024
	//Игнорирование для пользователя БИЗТЕХ
	Если СтрНайти(ПараметрыСеанса.Пользователь.Код,"БизТех") = 1 Тогда
		Сообщить("Отключена проверка состояния заказ-наряда для пользователя БИЗТЕХ !!");
	Иначе
		Если ДокументОснование.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ
			 ДокументОснование.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			Сообщить("Заказ-наряд выполнен или закрыт. Отмена извлечения из производства запрещена.");
			Отказ=Истина; 
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	//Перемещение товаров на склад
	НаборЗаписейОстатки=Движения.ОстаткиТоваровКомпании;
	НаборЗаписейОстатки.РежимПроведения=Режим;
	НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
	НаборЗаписейОстатки.РезультатЗапросаПоТоварам=Неопределено;
	НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
	НаборЗаписейОстатки.Приходовать=Истина;
	НаборЗаписейОстатки.Резервировать=Ложь;
	НаборЗаписейОстатки.ДвиженияПоРознице = СкладКомпании.Розничный;
	Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
	
	// проведем партии товаров
	Отказ = НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	// если перемещение товаров в розницу, то установим розничные цены
	Если (НЕ Отказ) И (СкладКомпании.Розничный) Тогда
		Если ПодразделениеКомпании.УстановкаЦенДокументамиПоступления И НЕ СкладКомпании.ТипЦенРозничнойТорговли.Рассчитывается Тогда
			НаборЗаписейЦены = Движения.Цены;
			НаборЗаписейЦены.ДокументОбъект = ЭтотОбъект;
			НаборЗаписейЦены.Контрагент     = Неопределено;  			
			НаборЗаписейЦены.ТипЦен         = СкладКомпании.ТипЦенРозничнойТорговли;
			НаборЗаписейЦены.ПодразделениеКомпании     = СкладКомпании.Подразделение;			
			НаборЗаписейЦены.РезультатЗапросаПоТоварам = Неопределено;        			
			Отказ = НЕ НаборЗаписейЦены.УстановитьЦены() ИЛИ Отказ;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		тКэшСуммСписания = Неопределено;
		СуммаДокумента = РассчитатьСуммуВсего();
		ЭтотОбъект.ОбменДанными.Загрузка=Истина;
		Записать(РежимЗаписиДокумента.Запись);
		ЭтотОбъект.ОбменДанными.Загрузка=Ложь;
	КонецЕсли;	
	
//++СнимченкоАА_бизтех++
	Для каждого тс Из Товары Цикл
		ТипНоменклатуры = тс.Номенклатура.ТипНоменклатуры;	
		Если ТипНоменклатуры.ДатаВведенияМаркировки<=Дата и ТипНоменклатуры.ВключенКонтрольОстатковКодовМаркировки Тогда
			
			ОбъектШК = Обработки.ШтрихКоды.Создать();
			
			Отбор = Новый Структура();
			Отбор.Вставить("ИдентификаторТовара", тс.ИдентификаторТовара);
			НайденноеЗначение = КодыМаркировки.НайтиСтроки(Отбор); 	
			Для каждого СтрокаТаблицы Из НайденноеЗначение Цикл  
				
				//КодыМаркировки
				Движения.КодыМаркировки.Записывать = Истина;
				Движение = Движения.КодыМаркировки.Добавить(); 
				Движение.Период = Дата;
				Движение.Организация = Организация;  
				Движение.Склад = СкладКомпании;
				Движение.Номенклатура = тс.Номенклатура; 
				Движение.КодМаркировки = СтрокаТаблицы.КодМаркировки; 
				
				СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(СтрокаТаблицы.КодМаркировки);
				
				Движение.GTIN = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
				Движение.СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Количество = тс.Количество; 
				
				//КодыМаркировкиВПроизводстве
				Движения.КодыМаркировкиВПроизводстве.Записывать = Истина;
				Движение = Движения.КодыМаркировкиВПроизводстве.Добавить(); 
				Движение.Период = Дата;
				Движение.Организация = Организация;  
				Движение.Цех = Цех; 
				Движение.ЗаказНаряд = ДокументОснование; 
				Движение.Номенклатура = тс.Номенклатура; 
				Движение.КодМаркировки = СтрокаТаблицы.КодМаркировки; 
				
				СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(СтрокаТаблицы.КодМаркировки);
				
				Движение.GTIN = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
				Движение.СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
				
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Количество = тс.Количество;  
				
			КонецЦикла;   
		КонецЕсли;
	КонецЦикла; 
	//--СнимченкоАА_бизтех--
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
