Процедура ПриЗаписи(Отказ)
	//НаборЗаписей = РегистрыСведений.ТТ_План_TradeIn.СоздатьНаборЗаписей();
	//
	//НаборЗаписей.Отбор.Бренд.Установить(Бренд); 
	//НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(Дата));

	//
	//Для Каждого Стр Из Сотрудники Цикл 
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить(); 
	//	
	//	НоваяЗапись.Период = НачалоМесяца(Дата); 
	//	НоваяЗапись.Сотрудник = Стр.Сотрудник; 
	//	НоваяЗапись.Бренд = Бренд; 
	//	НоваяЗапись.ПланНовые = Стр.ПланНовые; 
	//	НоваяЗапись.ПланНовыеСумма = Стр.ПланНовыеСумма; 
	//	НоваяЗапись.План = Стр.ПланТрейдИн; 
	//	НоваяЗапись.ПланФинПродукт = Стр.ПланФин; 
	//	НоваяЗапись.ПланДоп = Стр.ПланДоп; 
	//	
	//	
	//КонецЦикла; 
	//
	//НаборЗаписей.Записать(Истина); 	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборЗаписей = РегистрыСведений.ТТ_ПланыЗПМенеджер.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка); 
	
	Для каждого Стр из Сотрудники Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Штуки; 
		НоваяЗапись.План = Стр.Штуки; 
		НоваяЗапись.Процент = Стр.ШтукиП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Кредиты; 
		НоваяЗапись.План = Стр.Кредиты; 
		НоваяЗапись.Процент = Стр.КредитыП; 
		
		НаборЗаписей.Записать(Ложь); 	
		

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.УдельныйДОП; 
		НоваяЗапись.План = Стр.УдельныйДоп; 
		НоваяЗапись.Процент = Стр.УдельныйДОПП; 
		
		НаборЗаписей.Записать(Ложь); 
		
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.TradeIn; 
		НоваяЗапись.План = Стр.ТрейдИн; 
		НоваяЗапись.Процент = Стр.ТрейдИнП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.КАСКО; 
		НоваяЗапись.План = Стр.КАСКО; 
		НоваяЗапись.Процент = Стр.КАСКОП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Маржа; 
		НоваяЗапись.План = Стр.Маржа; 
		НоваяЗапись.Процент = Стр.МаржаП; 
		
		НаборЗаписей.Записать(Ложь);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.ОСАГО; 
		НоваяЗапись.План = Стр.ОСАГО; 
		НоваяЗапись.Процент = Стр.ОСАГОП; 
		
		НаборЗаписей.Записать(Ложь); 	

		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Параметр = Перечисления.ТТ_Параметры_ЗП.Неликвид; 
		НоваяЗапись.План = Стр.Неликвид; 
		НоваяЗапись.Процент = Стр.НеликвидП; 
		
		НаборЗаписей.Записать(Ложь); 	
		
	КонецЦикла;
КонецПроцедуры
