
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Показатель = Неопределено;
	
	Если Параметры.Свойство("Показатель", Показатель) Тогда
		
		НоваяСтрока = Объект.показатели.Добавить();
		НоваяСтрока.флаг = Истина;
		НоваяСтрока.Показатель = Показатель;
		
	КонецЕсли;	

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИСТИНА КАК Флаг,
	                      |	ПодразделенияКомпании.БТ_НазваниеДляССП КАК Подразделение
	                      |ИЗ
	                      |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |ГДЕ
	                      |	ПодразделенияКомпании.БТ_НазваниеДляССП <> """"
	                      |	И НЕ ПодразделенияКомпании.ПометкаУдаления");
	
	Объект.Подразделения.Загрузить(Запрос.Выполнить().Выгрузить());
	Новстр = объект.Подразделения.Добавить();
	новстр.Подразделение = "Select Астрахань";
	новстр.флаг = истина;
	
	Новстр = объект.Подразделения.Добавить();
	новстр.Подразделение = "Optima Select";
	новстр.флаг = истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
					|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация,
					|	Истина КАК Флаг
					|ИЗ
					|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
					|ГДЕ
					|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""");
	Объект.Организации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Объект.Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.Сформировать();
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Флажки(Таблица, Флаг)
	Для Каждого строка из Таблица цикл
		Строка.флаг = флаг;
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ВыделитьВсеПоказатели(Команда)
	Флажки(Объект.Показатели, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПоказатели(Команда)
	Флажки(Объект.Показатели, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеОрганизации(Команда)
	Флажки(ОБъект.Организации, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОрганизации(Команда)
	Флажки(ОБъект.Организации, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсеПодразделения(Команда)
	Флажки(ОБъект.Подразделения, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПодразделения(Команда)
	Флажки(ОБъект.Подразделения, Ложь);
КонецПроцедуры
