&НаКлиенте
Перем ИзнТипОплатыПредоплата;
&НаКлиенте
Перем ИзнТипОплатыКредит;
&НаКлиенте
Перем ИзнТипОплатыВстречноеПредоставление;
&НаКлиенте
Перем ЧастоИспользуемаяФР;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
&НаКлиенте
Процедура ПересчитатьСуммуНДС()
	
	Если НЕ СтавкаНДС.Пустая() Тогда
		СуммаНДС = Окр((СуммаДляОплаты * СтавкаНДС.Ставка)/(100 + СтавкаНДС.Ставка),2);
	Иначе
		СуммаНДС = ?(СуммаПоСделке = 0, 0, Окр(СуммаНДСПоСделке * СуммаДляОплаты / СуммаПоСделке, 2));
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьСуммуНДС()

#Область ПоискОплат
&НаСервере
Функция ПоискСуммыТрейдИн(РеализацияАвтомобиля) Экспорт
	
	ЗапросТрейд = Новый Запрос("ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Поступление,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
	|	СУММА(ЕСТЬNULL(ПоступлениеАвтомобилейАвтомобили.СуммаВсего, 0)) КАК СуммаВсего
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|		ПО ЗначенияСвойствОбъектов.Объект = ПоступлениеАвтомобилейАвтомобили.Ссылка
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение = &Значение
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияСвойствОбъектов.Объект,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль");
	ЗапросТрейд.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	ЗапросТрейд.УстановитьПараметр("Значение",РеализацияАвтомобиля.ДокументОснование);
	РезультатТрейд=ЗапросТрейд.Выполнить().Выгрузить();
	ВрСуммаТрейдИн=0;
	Если РезультатТрейд.Количество() тогда
		ВрСуммаТрейдИн = РезультатТрейд.Итог("СуммаВсего");   
	иначе
		ВрСуммаТрейдИн = 0;
	КонецЕсли;
	
	ЗаписатьВФайлЛога("Выполнен поиск суммы ТрейдИн по документу основанию: " + РеализацияАвтомобиля.ДокументОснование);
	Возврат ВрСуммаТрейдИн;
	
КонецФункции
&НаСервере
Функция ПоискСуммыКредита(РеализацияАвтомобиля, Автомобиль) Экспорт
	
	ЗапросКредит = Новый Запрос( "ВЫБРАТЬ
	|	РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка,
	|	СУММА(РабочийЛистКредитногоОтдела.СуммаКредита) КАК СуммаКредита
	|ИЗ
	|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
	|ГДЕ
	|	РабочийЛистКредитногоОтдела.Автомобиль = &Автомобиль
	|	И РабочийЛистКредитногоОтдела.ДокументОснование = &ДокументОснование
	|	И РабочийЛистКредитногоОтдела.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочийЛистКредитногоОтдела.Ссылка");
	
	ЗапросКредит.УстановитьПараметр("ДокументОснование",РеализацияАвтомобиля.ДокументОснование); 
	ЗапросКредит.УстановитьПараметр("Автомобиль",Автомобиль);
	
	РезультатКредит=ЗапросКредит.Выполнить().Выгрузить();  
	ВрСуммаКредит=0;
	Если РезультатКредит.Количество() тогда
		ВрСуммаКредит = РезультатКредит.Итог("СуммаКредита");
	иначе
		ВрСуммаКредит = 0;
	КонецЕсли;
	
	ЗаписатьВФайлЛога("Выполнен поиск суммы Кредита по документу РабочийЛистКредитногоОтдела на основании: " + РеализацияАвтомобиля.ДокументОснование);
	Возврат ВрСуммаКредит;
	
КонецФункции
&НаСервере
Функция ПоискОплатБезнал(Контрагент, Договор, Сделка=Неопределено) Экспорт
	
	ЗапросБезнал = Новый Запрос( "ВЫБРАТЬ
	                             |	ВзаиморасчетыКомпании.ХозОперация КАК ХозОперация,
	                             |	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
	                             |	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                             |	ВзаиморасчетыКомпании.Сумма КАК Сумма
	                             |ИЗ
	                             |	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	                             |ГДЕ
	                             |	ВзаиморасчетыКомпании.Контрагент = &Контрагент
	                             |	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	                             |	И ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
	                             |	И ВзаиморасчетыКомпании.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЧекНаОплату)
	                             |	И ВзаиморасчетыКомпании.Сделка = &Сделка");
	
	ЗапросБезнал.УстановитьПараметр("Контрагент",Контрагент);
	ЗапросБезнал.УстановитьПараметр("ДоговорВзаиморасчетов", Договор);
	
	Если Сделка = Неопределено Тогда
		ЗапросБезнал.Текст = СтрЗаменить(ЗапросБезнал.Текст, "И ВзаиморасчетыКомпании.Сделка = &Сделка","");
	Иначе
		ЗапросБезнал.УстановитьПараметр("Сделка", Сделка);
	КонецЕсли;
	
	РезультатБезнал = ЗапросБезнал.Выполнить().Выгрузить();
	Если РезультатБезнал.Количество() тогда
		Возврат РезультатБезнал.Итог("Сумма");
	иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция ПоискОплатНаличные(Контрагент, Договор, Сделка=Неопределено) Экспорт
	
	ЗапросНаличные = Новый Запрос( "ВЫБРАТЬ
	                               |	ВзаиморасчетыКомпании.ХозОперация КАК ХозОперация,
	                               |	ВзаиморасчетыКомпании.Контрагент КАК Контрагент,
	                               |	ВзаиморасчетыКомпании.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	                               |	ВзаиморасчетыКомпании.Сумма КАК Сумма
	                               |ИЗ
	                               |	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	                               |ГДЕ
	                               |	ВзаиморасчетыКомпании.Контрагент = &Контрагент
	                               |	И ВзаиморасчетыКомпании.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
	                               |	И ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
	                               |	И ВзаиморасчетыКомпании.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПриходныйКассовыйОрдер)
	                               |	И ВзаиморасчетыКомпании.Сделка = &Сделка");
	
	ЗапросНаличные.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросНаличные.УстановитьПараметр("ДоговорВзаиморасчетов", Договор);
	
	Если Сделка = Неопределено Тогда
		ЗапросНаличные.Текст = СтрЗаменить(ЗапросНаличные.Текст, "И ВзаиморасчетыКомпании.Сделка = &Сделка","");
	Иначе
		ЗапросНаличные.УстановитьПараметр("Сделка", Сделка);
	КонецЕсли;
	
	РезультатНаличные = ЗапросНаличные.Выполнить().Выгрузить();
	Если РезультатНаличные.Количество() тогда
		Возврат РезультатНаличные.Итог("Сумма");  
	иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
#КонецОбласти


&НаКлиенте
Функция СоздатьВзаимозачетыTradeIn(СсылкаРеализацияАвто, СуммаВзаимозачета) Экспорт
	
	ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Запуск");
	
	Если Типзнч(СсылкаРеализацияАвто) = Тип("ДокументСсылка.РеализацияАвтомобилей") И
		 ТипЗнч(СсылкаРеализацияАвто.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ЗапросТрейд = Новый Запрос("ВЫБРАТЬ
		                           |	ЗначенияСвойствОбъектов.Объект КАК Поступление
		                           |ИЗ
		                           |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		                           |ГДЕ
		                           |	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		                           |	И ЗначенияСвойствОбъектов.Свойство = &Свойство
		                           |	И ЗначенияСвойствОбъектов.Значение = &Значение
		                           |
		                           |СГРУППИРОВАТЬ ПО
		                           |	ЗначенияСвойствОбъектов.Объект");
		ЗапросТрейд.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		ЗапросТрейд.УстановитьПараметр("Значение",СсылкаРеализацияАвто.ДокументОснование);
		ПоступленияТрейдТабл=ЗапросТрейд.Выполнить().Выгрузить();
		Если ПоступленияТрейдТабл.Количество() Тогда
			
			Для Каждого ПоступлениеТрейд из ПоступленияТрейдТабл Цикл
				
				ПоступлениеСсылка = ПоступлениеТрейд.Поступление;
				
				Если НЕ ЗначениеЗаполнено(СуммаВзаимозачета) Тогда
					СуммаВзаимозачета = ПоступлениеСсылка.СуммаДокумента;
				КонецЕсли;
				
				Если ТипЗнч(поступлениеСсылка) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") Тогда
					
					ОрганизацияПоступления = ПоступлениеСсылка.Организация;
					ПодразделениеПоступления = ПоступлениеСсылка.ПодразделениеКомпании;
					КонтрагентПоступления = ПолучитьКонтрагентаОрганизации(ОрганизацияПоступления);
					АгентскийДоговорПоступления = ПолучитьАгентскийДоговорДляТрейдИнОрганизации(ОрганизацияПоступления);
					
					ОрганизацияРеализации = СсылкаРеализацияАвто.Организация;
					ПодразделениеРеализации = СсылкаРеализацияАвто.ПодразделениеКомпании;
					КонтрагентРеализации = ПолучитьКонтрагентаОрганизации(ОрганизацияРеализации);
					АгентскийДоговорРеализации = ПолучитьАгентскийДоговорДляТрейдИнОрганизации(ОрганизацияРеализации);
					
					Если НЕ ЗначениеЗаполнено(КонтрагентПоступления) ИЛИ НЕ ЗначениеЗаполнено(КонтрагентРеализации) Тогда
						ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Не определены контрагенты взаимозачетов");
						Возврат Ложь;
					КонецЕсли;
					
					Контрагент = ПоступлениеСсылка.Контрагент;
					Контрагент2 = СсылкаРеализацияАвто.Контрагент;
					КонтрагентДоговорПоступления = ПоступлениеСсылка.ДоговорВзаиморасчетов;
					КонтрагентДоговорРеализации = СсылкаРеализацияАвто.ДоговорВзаиморасчетов;
					
					НовыйВзаимозачет1 = Документы.Взаимозачет.СоздатьДокумент();
					НовыйВзаимозачет1.Дата = ТекущаяДатаСеанса();
					НовыйВзаимозачет1.ХозОперация = Справочники.ХозОперации.Взаимозачет;
					НовыйВзаимозачет1.Организация = ОрганизацияПоступления;
					НовыйВзаимозачет1.ПодразделениеКомпании = ПодразделениеПоступления;
					НовыйВзаимозачет1.Автор = ПараметрыСеанса.Пользователь;
					НовыйВзаимозачет1.ДокументОснование = СсылкаРеализацияАвто.ДокументОснование;
					НовыйВзаимозачет1.Дебитор = КонтрагентРеализации;
					НовыйВзаимозачет1.Кредитор = Контрагент;
					НовыйВзаимозачет1.ВалютаДокумента = СсылкаРеализацияАвто.ВалютаДокумента;
					НовыйВзаимозачет1.КурсДокумента = 1;
					НоваяСтрокаВзаимозачет1 = НовыйВзаимозачет1.Состав.Добавить();
					НоваяСтрокаВзаимозачет1.ДоговорВзаиморасчетовДебитор = АгентскийДоговорРеализации;
					НоваяСтрокаВзаимозачет1.ДоговорВзаиморасчетовКредитор = КонтрагентДоговорПоступления;
					НоваяСтрокаВзаимозачет1.СделкаКредитор = ПоступлениеСсылка;
					НоваяСтрокаВзаимозачет1.Сумма = СуммаВзаимозачета;
					НовыйВзаимозачет1.Комментарий = "Создан автоматически после проведения оплаты по документу " + СсылкаРеализацияАвто;
					
					
					НовыйВзаимозачет2 = Документы.Взаимозачет.СоздатьДокумент();
					НовыйВзаимозачет2.Дата = ТекущаяДатаСеанса();
					НовыйВзаимозачет2.ХозОперация = Справочники.ХозОперации.Взаимозачет;
					НовыйВзаимозачет2.Организация = ОрганизацияРеализации;
					НовыйВзаимозачет2.ПодразделениеКомпании = ПодразделениеРеализации;
					НовыйВзаимозачет2.Автор = ПараметрыСеанса.Пользователь;
					НовыйВзаимозачет2.ДокументОснование = СсылкаРеализацияАвто.ДокументОснование;
					НовыйВзаимозачет2.Дебитор = Контрагент2;
					НовыйВзаимозачет2.Кредитор = КонтрагентПоступления;
					НовыйВзаимозачет2.ВалютаДокумента = СсылкаРеализацияАвто.ВалютаДокумента;
					НовыйВзаимозачет2.КурсДокумента = 1;
					НоваяСтрокаВзаимозачет2 = НовыйВзаимозачет2.Состав.Добавить();
					НоваяСтрокаВзаимозачет2.ДоговорВзаиморасчетовДебитор = КонтрагентДоговорРеализации;
					НоваяСтрокаВзаимозачет2.ДоговорВзаиморасчетовКредитор = АгентскийДоговорПоступления;
					НоваяСтрокаВзаимозачет2.СделкаДебитор = СсылкаРеализацияАвто;
					НоваяСтрокаВзаимозачет2.Сумма = СуммаВзаимозачета;
					НовыйВзаимозачет2.Комментарий = "Создан автоматически после проведения оплаты по документу " + СсылкаРеализацияАвто;
					
					
					НачатьТранзакцию();
					
					Попытка
						//НовыйВзаимозачет1.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Оперативный);
						НовыйВзаимозачет1.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
						//НовыйВзаимозачет2.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Оперативный);
						НовыйВзаимозачет2.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
						
						Сообщить("Созданы и проведены взаимозачеты по Trade In на основании <"+СсылкаРеализацияАвто.ДокументОснование+">!");
						Сообщить("Взаимозачет №1 - <"+НовыйВзаимозачет1.Ссылка+">");
						Сообщить("Взаимозачет №2 - <"+НовыйВзаимозачет2.Ссылка+">");
						ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Созданы и проведены взаимозачеты по Trade In на основании <"+СсылкаРеализацияАвто.ДокументОснование+">!");
						ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Взаимозачет №1 - <"+НовыйВзаимозачет1.Ссылка+">");
						ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Взаимозачет №2 - <"+НовыйВзаимозачет2.Ссылка+">");
						
						ЗафиксироватьТранзакцию();
					Исключение
						
						ТекстОшибки = ОписаниеОшибки();
						Сообщить("Произошла ошибка при создании взаимозачетов по Trade In: " + ТекстОшибки);
						Сообщить("Транзакция отменена!");
						ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Ошибка,"Создание взаимозачетов Trade In",,"Ошибка транзакции - " + ТекстОшибки);
						
						ОтменитьТранзакцию();
					КонецПопытки;
					Возврат Истина;
				Иначе
					ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Не соблюдается тип документа");
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Не найден Trade In");
			Возврат Ложь;
		КонецЕсли;
	Иначе
		ЗаписьЖурналаРегистрации("Создание взаимозачетов Trade In",УровеньЖурналаРегистрации.Информация,"Создание взаимозачетов Trade In",,"Условия не соблюдены - 1");
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьКонтрагентаОрганизации(Организация) Экспорт 
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Контрагент-организация");
	Если НЕ ЗначениеЗаполнено(Свойство) Тогда
		Сообщить("Отсутствует свойство объектов <Контрагент-организация>!");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Организация
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьАгентскийДоговорДляТрейдИнОрганизации(Организация) Экспорт 
	
	Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("КодАгентскийДоговорДляТрейдИн");
	Если НЕ ЗначениеЗаполнено(Свойство) Тогда
		Сообщить("Отсутствует свойство объектов <Контрагент-организация>!");
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Организация
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) Тогда
			Договор = Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду(ВыборкаДетальныеЗаписи.Значение);
			Если ЗначениеЗаполнено(Договор) Тогда
				Возврат Договор;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция НайтиЧастоИспользуемуюФР(Пользователь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 10
	                |	ЧекНаОплату.ФР КАК ФР,
	                |	ЧекНаОплату.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ ПоследФР
	                |ИЗ
	                |	Документ.ЧекНаОплату КАК ЧекНаОплату
	                |ГДЕ
	                |	ЧекНаОплату.Автор.Ссылка = &Автор
	                |	И ЧекНаОплату.Дата > &Дата
	                |	И ЧекНаОплату.Проведен
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЧекНаОплату.Дата УБЫВ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПоследФР.ФР КАК ФР,
	                |	СУММА(1) КАК Поле1
	                |ПОМЕСТИТЬ ЧастоИспользФР
	                |ИЗ
	                |	ПоследФР КАК ПоследФР
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПоследФР.ФР
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ЧастоИспользФР.ФР КАК ФР
	                |ИЗ
	                |	ЧастоИспользФР КАК ЧастоИспользФР
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ЧастоИспользФР.Поле1 УБЫВ";
	Запрос.УстановитьПараметр("Автор", Пользователь);
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ТекущаяДатаСеанса(),-12));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		ЧастоИспользуемаяКасса = ВыборкаЗапроса.ФР;
		Возврат ЧастоИспользуемаяКасса;         
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ ДОКУМЕНТА
&НаКлиенте
Процедура кнПринятьНажатие(Элемент)
	Принять(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Принять(Элемент)
	
	Если НЕ ОплатаПоТоварам = 0 И СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ПустаяСсылка") Тогда
		Предупреждение("Ставка НДС должна быть заполнена!");
	Иначе
		
		ТекстДляЛогов = "Нажата кнопка ПРИНЯТЬ со следующими суммами" + Символы.ПС +
		"СуммаПоСделке: " + Строка(СуммаПоСделке) + Символы.ПС +
		"ОстатокПоСделке: " + Строка(ОстатокПоСделке) + Символы.ПС +
		"СуммаДляОплаты: " + Строка(СуммаДляОплаты) + Символы.ПС +
		"НаличныеБезналичные: " + Строка(ТипОплатыНаличныеБезналичные) + Символы.ПС +
		"Аванс: " + Строка(ТипОплатыПредоплата) + Символы.ПС +
		"Кредит: " + Строка(ТипОплатыКредит) + Символы.ПС +
		"ТрейдИн: " + Строка(ТипОплатыВстречноеПредоставление);
		
		ЗаписатьВФайлЛога(ТекстДляЛогов);
		
		//Если Это оплата наличными то создадим ПКО и передадим параметр для ФронтаМенеджера
		Если ВыборНаличныеБезналичные = 0 Тогда
			ЗаписатьВФайлЛога("Создаем новый ПКО так как оплата указана как Наличные");
			НовыйПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
			НовыйПКО.Заполнить(Сделка);
			НовыйПКО.СуммаДокумента = ТипОплатыНаличныеБезналичные;
			НовыйПКО.ТипСпособаРасчетаККТ = ТипСпособаРасчета;
			НовыйПКО.ДляПробитияНаФР = Истина;
			НовыйПКО.СкладКомпании = Неопределено;
			Попытка
				НовыйПКО.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Оперативный);
				ЗаписатьВФайлЛога("Записан новый ПКО: " + НовыйПКО.Ссылка);
				ПробитиеПКО = НовыйПКО.Ссылка;
			Исключение
				Ошибка = ОписаниеОшибки();
				ЗаписатьВФайлЛога("Ошибка записи ПКО: " + Ошибка,1);
				Сообщить("Ошибка при формировании ПКО для оплаты наличными - " + Ошибка);
				Закрыть();
			КонецПопытки;
			
		КонецЕсли;
		
		// Если пробиваем Передачу по выполненному ЗН - то закроем его
		Если ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") И ТипЗнч(Сделка) = тип("ДокументСсылка.ЗаказНаряд") И 
			Сделка.состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
			
		ЗакрытьЗаказНарядПослеОплаты = Истина;
		
		КонецЕсли;
		
		Закрыть(ИСТИНА);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаДляОплатыПриИзменении(Элемент)
	
	ПересчитатьСуммуНДС();
	
КонецПроцедуры
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммуНДС();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Функция ПроверкаНаСуществующийЧекПередачи(Сделка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекНаОплату.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЧекНаОплату КАК ЧекНаОплату
		|ГДЕ
		|	ЧекНаОплату.ДокументОснование = &ДокументОснование
		|	И ЧекНаОплату.НомерЧека <> -1
		|	И ЧекНаОплату.НомерДокумента <> -1
		|	И ЧекНаОплату.НомерСмены <> -1
		|	И ЧекНаОплату.Проведен
		|	И ЧекНаОплату.ТипСпособаРасчетаККТ = &ТипСпособаРасчетаККТ";
	
	Запрос.УстановитьПараметр("ДокументОснование", Сделка);
	Запрос.УстановитьПараметр("ТипСпособаРасчетаККТ", Перечисления.ТипыСпособаРасчетаККТ.Передача);
	
	Если Запрос.Выполнить().Выгрузить().Количество() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриОткрытииСервер(Отказ, СтандартнаяОбработка)
	
	ЗаписатьВФайлЛога("Запущена форма корректировки с документом " + Сделка);
	
	СписокДоступныхСпособовРасчетаККТ = ПроцедурыОбщегоНазначенияКлиентСервер.СписокДоступныхСпособовРасчетаККТ(Сделка);
	
	// ЗАПОЛНЕНИЕ ТИП СПОСОБА РАСЧЕТА
	
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЧекНаОплату") ИЛИ ТипЗнч(Сделка) = Тип("ДокументОбъект.ЧекНаОплату") Тогда
		ТипСпособаРасчета = Сделка.ТипСпособаРасчетаККТ;
	ИначеЕсли ТипЗнч(Сделка) = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипЗнч(Сделка) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили")
		ИЛИ ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		ТипСпособаРасчета = Перечисления.ТипыСпособаРасчетаККТ.Предоплата;		
	ИначеЕсли (ТипЗнч(Сделка)=Тип("ДокументСсылка.ВозвратОтПокупателяАвтомобилей")
		ИЛИ ТипЗнч(Сделка)=Тип("ДокументСсылка.ВозвратОтПокупателя") 
		ИЛИ ТипЗнч(Сделка)=Тип("ДокументСсылка.ВозвратПоставщику")
		ИЛИ ТипЗнч(Сделка)=Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей"))
		И СуммаПоСделке > ОстатокПоСделке Тогда
		ТипСпособаРасчета = Перечисления.ТипыСпособаРасчетаККТ.Предоплата;
	Иначе
		ТипСпособаРасчета = Перечисления.ТипыСпособаРасчетаККТ.Передача;
	КонецЕсли;
	
	// ТОЛЬКО ЗАПОЛНЕНИЕ СУММ И КОНТРОЛЬ УСЛОВИЙ
	
	//Заполним типы оплат по реализации автомобиля
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		Если Сделка.Автомобили.Количество() И ЗначениеЗаполнено(Сделка.Контрагент) И ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			Автомобиль = Сделка.Автомобили[0].Автомобиль;
			Контрагент = Сделка.Контрагент;
			Договор = Сделка.ДоговорВзаиморасчетов;
			
			ТипОплатыКредит =  ПоискСуммыКредита(Сделка, Автомобиль);
			// Поиск Предоплаты выполняется в разрезе договора
			ТипОплатыПредоплата = ПоискОплатБезнал(Контрагент, Договор) + ПоискОплатНаличные(Контрагент, Договор);
			// Логика ТрейдИн
			СуммаТрейдИнПоПоступлению = ПоискСуммыТрейдИн(Сделка);
			ЗаписатьВФайлЛога("Сумма TradeIn по документу поступление автомобиля = " + Строка(СуммаТрейдИнПоПоступлению));
			Если СуммаТрейдИнПоПоступлению <> 0 Тогда
				ПредварительнаяСуммаТрейдИн = СуммаПоСделке - (ТипОплатыКредит + ТипОплатыПредоплата);
				ЗаписатьВФайлЛога("Раcчитанная сумма TradeIn = " + Строка(ПредварительнаяСуммаТрейдИн));
				Если ПредварительнаяСуммаТрейдИн <= СуммаТрейдИнПоПоступлению Тогда
					ТипОплатыВстречноеПредоставление = ПредварительнаяСуммаТрейдИн;
				Иначе
					ТипОплатыВстречноеПредоставление = СуммаТрейдИнПоПоступлению;
				КонецЕсли;
				СуммаВзаимозачетаТрейдИн = ТипОплатыВстречноеПредоставление;
			КонецЕсли;
			
			ОстатокПоСделке = ОстатокПоСделке - (ТипОплатыВстречноеПредоставление + ТипОплатыКредит);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Сделка.Контрагент) И НЕ ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение Контрагента и Договора.";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		ИначеЕсли НЕ Сделка.Автомобили.Количество() Тогда
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение табличной части ""Автомобили""";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		Иначе
			ТекстОшибки = "Оплата невозможна по документу!";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Заказ-наряд
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Если ЗначениеЗаполнено(Сделка.Контрагент) И ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			
			Контрагент = Сделка.Контрагент;
			Договор = Сделка.ДоговорВзаиморасчетов;
			
			ТипОплатыКредит =  0;
			ТипОплатыВстречноеПредоставление = 0;
			ТипОплатыПредоплата = ПоискОплатБезнал(Контрагент, Договор, Сделка) + ПоискОплатНаличные(Контрагент, Договор, Сделка);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Сделка.Контрагент) И НЕ ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение Контрагента и Договора.";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		//ИначеЕсли НЕ Сделка.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		//	ТекстОшибки = "Оплата невозможна по документу! Оплата заказ-наряда выполняется только в состоянии <Выполнен>";
		//	ЗаписатьВФайлЛога(ТекстОшибки);
		//	Сообщить(ТекстОшибки);
		//	Отказ = Истина;
		Иначе
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение Контрагента или Договора.";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	//Заказ на автомобиль
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		Если ЗначениеЗаполнено(Сделка.Контрагент) И ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			
			Контрагент = Сделка.Контрагент;
			Договор = Сделка.ДоговорВзаиморасчетов;
			
			ТипОплатыКредит =  0;
			ТипОплатыВстречноеПредоставление = 0;
			ТипОплатыПредоплата = 0;
			ТипОплатыНаличныеБезналичные = ОстатокПоСделке;
			
			
		ИначеЕсли НЕ ЗначениеЗаполнено(Сделка.Контрагент) И НЕ ЗначениеЗаполнено(Сделка.ДоговорВзаиморасчетов) Тогда
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение Контрагента и Договора.";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		Иначе
			ТекстОшибки = "Оплата невозможна по документу! Проверьте заполнение Контрагента или Договора.";
			ЗаписатьВФайлЛога(ТекстОшибки);
			Сообщить(ТекстОшибки);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СуммаНДСПоСделке = СуммаНДС;
	
	ТекстДляЛогов = "СуммаПоСделке: " + Строка(СуммаПоСделке) + Символы.ПС +
	"ОстатокПоСделке: " + Строка(ОстатокПоСделке) + Символы.ПС +
	"СуммаДляОплаты: " + Строка(СуммаДляОплаты) + Символы.ПС +
	"НаличныеБезналичные: " + Строка(ТипОплатыНаличныеБезналичные) + Символы.ПС +
	"Аванс: " + Строка(ТипОплатыПредоплата) + Символы.ПС +
	"Кредит: " + Строка(ТипОплатыКредит) + Символы.ПС +
	"ТрейдИн: " + Строка(ТипОплатыВстречноеПредоставление);
	
	ЗаписатьВФайлЛога(ТекстДляЛогов);
	
	// Почта контрагента 
	Попытка
		КонтрагентДляПочты = Сделка.Контрагент;
	Исключение
		КонтрагентДляПочты = Неопределено;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(КонтрагентДляПочты) И ТипЗнч(КонтрагентДляПочты)=Тип("СправочникСсылка.Контрагенты") Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтактнаяИнформация.Представление КАК ПредставлениеПочты,
		               |	КонтактнаяИнформация.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Контрагент
		               |	И КонтактнаяИнформация.Тип = &Тип
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КонтактнаяИнформация.ЗначениеПоУмолчанию УБЫВ";
		Запрос.УстановитьПараметр("Тип",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("Контрагент",КонтрагентДляПочты);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Элементы.ПочтаКонтрагентаДляОтправки.СписокВыбора.Добавить(Выборка.ПредставлениеПочты,Выборка.ПредставлениеПочты,,БиблиотекаКартинок.ЭлектронноеПисьмо);
			Если Выборка.ЗначениеПоУмолчанию = Истина Тогда
				ПочтаКонтрагентаДляОтправки = Выборка.ПредставлениеПочты;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//
	
	//Проверка на существующий чек передачи
	Элементы.ДекорацияУведомлениеУжеЕстьПробитыйПередача.Видимость = ПроверкаНаСуществующийЧекПередачи(Сделка.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииСервер(Отказ,Истина);
	
	//Сохраним на клиенте типы платежей
	ИзнТипОплатыПредоплата = ТипОплатыПредоплата;
	ИзнТипОплатыКредит = ТипОплатыКредит;
	ИзнТипОплатыВстречноеПредоставление = ТипОплатыВстречноеПредоставление;
	
	//Вычислим сумму всех типов оплат
	ОбновитьСуммуВсехОплат();
	
	// По умолчанию Безналичные
	ВыборНаличныеБезналичные = 1;
	ВыборНаличныеБезналичныеПриИзменении();
	УправлениеДиалогом(Ложь, Истина);
	
	// По умолчанию Автопробитие чека при нажатии кнопки ПРИНЯТЬ
	АвтопробитиеЧека = Истина; 
	
	// По умолчанию закрывать фронт менеджера
	ЗакрытьФронтМенеджера = Истина;
	
	// По умолчанию закрывать заказ-наряд если он в состоянии "Выполнен"
	ЗакрытьЗаказНарядПослеОплаты = Ложь;
	
	// По умолчанию создавать взаиморасчеты по TRADEIN
	СоздатьВзаимозачетыПоТрейдИн = Ложь;
	
	// Заполним 
	ЧастоИспользуемаяФР = НайтиЧастоИспользуемуюФР(ПараметрыСеанса.Пользователь);
	Если ЧастоИспользуемаяФР <> ТекущийФР И ЧастоИспользуемаяФР <> Неопределено Тогда
		Элементы.ДекорацияФРНеЧастоИспользуемый.Заголовок = СтрЗаменить(Элементы.ДекорацияФРНеЧастоИспользуемый.Заголовок,"<>","<"+Строка(ЧастоИспользуемаяФР)+">");
		//Элементы.ДекорацияФРНеЧастоИспользуемый.Видимость = Истина;
	Иначе
		//Элементы.ДекорацияФРНеЧастоИспользуемый.Видимость = Ложь;
	КонецЕсли;
	
	ОплатаПоТоварам = 0;
	УправлениеДиалогом();
	
	// Обновим элементы с почтой
	ОтправитьЧекПоПочтеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоТоварамСделкеПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
&НаКлиенте
Процедура УправлениеДиалогом(ИзмененВыборНаличныеБезналичные = Ложь, ИзменениеСпособаРасчета = Ложь)
	
	// Типовая логика
	Если ИзменениеСпособаРасчета Тогда
		Если ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
			Элементы.СуммаДляОплаты.Доступность = Ложь;
			ОплатаПоТоварам = 0;
			Элементы.ОплатаПоТоварамСделке.Доступность = Ложь;
			Элементы.СтавкаНДС.Доступность = Ложь;
			Элементы.СуммаНДС.Доступность = Ложь;
			СуммаДляОплаты = СуммаПоСделке;
		ИначеЕсли ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата") Тогда
			Элементы.СуммаДляОплаты.Доступность = Истина;
			Элементы.ОплатаПоТоварамСделке.Доступность = Истина;
			Элементы.СтавкаНДС.Доступность = Истина;
			Элементы.СуммаНДС.Доступность = Истина;
			СуммаДляОплаты = ОстатокПоСделке;
		ИначеЕсли ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Постоплата") Тогда
			Элементы.СуммаДляОплаты.Доступность = Истина;
			Элементы.ОплатаПоТоварамСделке.Доступность = Истина;
			Элементы.СтавкаНДС.Доступность = Истина;
			Элементы.СуммаНДС.Доступность = Истина;
			СуммаДляОплаты = ОстатокПоСделке;
		КонецЕсли;
	КонецЕсли;
	
	// Типовая логика
	Если ОплатаПоТоварам = 0 Тогда
		Элементы.СтавкаНДС.Доступность = Ложь;
		Элементы.СуммаНДС.Доступность = Ложь;
		ПечататьТабличнуюЧастьТоваров = Истина;
	Иначе
		Элементы.СтавкаНДС.Доступность = Истина;
		Элементы.СуммаНДС.Доступность = Истина;
		ПечататьТабличнуюЧастьТоваров = Ложь;
	КонецЕсли;
	
	//Не будем выполнять дважды выполняемый код
	Если ИзменениеСпособаРасчета Тогда
		Возврат;
	КонецЕсли;
	
	
	// ЛОГИКА ОПЛАТЫ

	// РеализацияАвтомобилей
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
			// Переключим на Передачу
			ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача");
			УправлениеДиалогом(Ложь, Истина);
		КонецЕсли;
		Элементы.ПРИНЯТЬАльтернатива.Доступность = Ложь;
		ВыборНаличныеБезналичные = 1; // Безнал
		Элементы.ВыборНаличныеБезналичные.Доступность = Ложь;
		Элементы.ТипОплатыНаличныеБезналичные.ТолькоПросмотр = Истина;
		
		// Если Сумма всех оплат равна сумме сделки то можно пробить только чек на оплату
		ОбновитьСуммуВсехОплат();
		Если ТипОплатыСуммаОплат = СуммаПоСделке Тогда
			Элементы.ПРИНЯТЬ.Доступность = Истина;
		Иначе
			Элементы.ПРИНЯТЬ.Доступность = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	// Заказ на автомобиль
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата") Тогда
			// Переключим на Передачу
			ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата");
			УправлениеДиалогом(Ложь, Истина);
		КонецЕсли;
		
		Элементы.ТипОплатыПредоплата.ТолькоПросмотр = Истина;
		Элементы.ТипОплатыКредит.ТолькоПросмотр = Истина;
		Элементы.ТипОплатыВстречноеПредоставление.ТолькоПросмотр = Истина;
		ТипОплатыПредоплата = 0;
		ТипОплатыКредит = 0;
		ТипОплатыВстречноеПредоставление = 0;
		
	КонецЕсли;
	
	// Заказ-наряд
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда

		// Если предоплата равна сумме сделки то можно пробить только чек на оплату
		Если ТипОплатыПредоплата = СуммаПоСделке Тогда
			ВыборНаличныеБезналичные = 1; // Безнал
			Элементы.ВыборНаличныеБезналичные.Доступность = Ложь;
			Элементы.ТипОплатыНаличныеБезналичные.ТолькоПросмотр = Истина;
		КонецЕсли;

		// ЕСЛИ ВЫБРАНЫ НАЛИЧНЫЕ
		Если ВыборНаличныеБезналичные = 0 Тогда
			// Если есть какая либо предоплата
			Если ИзнТипОплатыПредоплата > 0 Тогда
				// Если Переключили тип оплаты
				Если ИзмененВыборНаличныеБезналичные Тогда
					// Переключим на предоплату
					Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата") Тогда
						ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата");
						УправлениеДиалогом(Ложь, Истина);
					КонецЕсли;
					// Скрываем неиспользуемые типы оплат и обнуляем их
					Элементы.ТипОплатыПредоплата.ТолькоПросмотр = Истина;
					Элементы.ТипОплатыКредит.ТолькоПросмотр = Истина;
					Элементы.ТипОплатыВстречноеПредоставление.ТолькоПросмотр = Истина;
					ТипОплатыПредоплата = 0;
					ТипОплатыКредит = 0;
					ТипОплатыВстречноеПредоставление = 0;
					ТипОплатыНаличныеБезналичные = ОстатокПоСделке;
				КонецЕсли;
			КонецЕсли;
			
			ОбновитьСуммуВсехОплат();
			Если ТипОплатыСуммаОплат = СуммаПоСделке Тогда
				Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
					// Переключим на Передачу
					ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача");
					УправлениеДиалогом(Ложь, Истина);
				КонецЕсли;
			Иначе
				Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата") Тогда
					// Переключим на Предоплата
					ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата");
					УправлениеДиалогом(Ложь, Истина);
				КонецЕсли;
				ТипОплатыПредоплата = 0;
				ТипОплатыКредит = 0;
				ТипОплатыВстречноеПредоставление = 0;
				Элементы.ТипОплатыПредоплата.ТолькоПросмотр = Истина;
				Элементы.ТипОплатыКредит.ТолькоПросмотр = Истина;
				Элементы.ТипОплатыВстречноеПредоставление.ТолькоПросмотр = Истина;
			КонецЕсли;

		// ЕСЛИ ВЫБРАНЫ БЕЗНАЛИЧНЫЕ
		ИначеЕсли ВыборНаличныеБезналичные = 1 Тогда
			
			// Если Переключили тип оплаты
			Если ИзмененВыборНаличныеБезналичные Тогда
				// Восстанавливаем типы оплат и показываем их
				Элементы.ТипОплатыПредоплата.ТолькоПросмотр = Ложь;
				Элементы.ТипОплатыКредит.ТолькоПросмотр = Ложь;
				Элементы.ТипОплатыВстречноеПредоставление.ТолькоПросмотр = Ложь;
				ТипОплатыПредоплата = ИзнТипОплатыПредоплата;
				ТипОплатыКредит = ИзнТипОплатыКредит;
				ТипОплатыВстречноеПредоставление = ИзнТипОплатыВстречноеПредоставление;
				ТипОплатыНаличныеБезналичные = ОстатокПоСделке;
			КонецЕсли;
			
			ОбновитьСуммуВсехОплат();
			Если ТипОплатыСуммаОплат = СуммаПоСделке Тогда
				Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача") Тогда
					// Переключим на Передачу
					ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Передача");
					УправлениеДиалогом(Ложь, Истина);
				КонецЕсли;
			Иначе
				Если ТипСпособаРасчета <> ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата") Тогда
					// Переключим на Предоплата
					ТипСпособаРасчета = ПредопределенноеЗначение("Перечисление.ТипыСпособаРасчетаККТ.Предоплата");
					УправлениеДиалогом(Ложь, Истина);
				КонецЕсли;
				ТипОплатыПредоплата = 0;
				ТипОплатыКредит = 0;
				ТипОплатыВстречноеПредоставление = 0;
				Элементы.ТипОплатыПредоплата.ТолькоПросмотр = Истина;
				Элементы.ТипОплатыКредит.ТолькоПросмотр = Истина;
				Элементы.ТипОплатыВстречноеПредоставление.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	
	
	// ОБЩАЯ ЛОГИКА
	ОбновитьСуммуВсехОплат();
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗаписатьВФайлЛога("Нажата кнопка ОТМЕНА");
	АвтопробитиеЧека = Ложь;
	ЗакрытьФронтМенеджера = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ТипОплатыБезналичныеПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ТипОплатыПредоплатаПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ТипОплатыКредитПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ТипОплатыВстречноеПредоставлениеПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ТипОплатыНаличныеПриИзменении(Элемент)
	УправлениеДиалогом(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСуммуВсехОплат()
	
	ТипОплатыСуммаОплат = ТипОплатыНаличныеБезналичные + ТипОплатыПредоплата + ТипОплатыКредит + ТипОплатыВстречноеПредоставление;
	СуммаДляОплаты = ТипОплатыСуммаОплат; 
	Если ТипОплатыСуммаОплат = СуммаПоСделке Тогда
		Элементы.ТипОплатыСуммаОплат.ЦветТекста = Новый Цвет(0,100,0);
		ЗаписатьВФайлЛога("Сумма оплат: Зеленая");
	Иначе
		Элементы.ТипОплатыСуммаОплат.ЦветТекста = Новый Цвет(100,0,0);
		ЗаписатьВФайлЛога("Сумма оплат: Красная");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ВыборНаличныеБезналичныеПриИзменении(Элемент=Неопределено)
	Если ВыборНаличныеБезналичные = 0 Тогда
		Элементы.ТипОплатыНаличныеБезналичные.Заголовок = "Наличные";
		Элементы.ПРИНЯТЬАльтернатива.Заголовок = "ПРИНЯТЬ ПО АЛЬФАБАНК";
		ЗаписатьВФайлЛога("Тип оплаты изменен на Наличные");
		
		УправлениеДиалогом(Истина,Ложь);
		
	ИначеЕсли ВыборНаличныеБезналичные = 1 Тогда
		Элементы.ТипОплатыНаличныеБезналичные.Заголовок = "Безналичные";
		Элементы.ПРИНЯТЬАльтернатива.Заголовок = "ПРИНЯТЬ ПО QR";
		ЗаписатьВФайлЛога("Тип оплаты изменен на Безналичные");
		
		УправлениеДиалогом(Истина,Ложь);
		
	Иначе
		ВыборНаличныеБезналичные = 0;
		ВыборНаличныеБезналичныеПриИзменении();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВФайлЛога(Описание = "", ТипСообщения = 0) Экспорт 
	
	ЖурналДействийКассира = РегистрыСведений.ЖурналРегистрацииДействийКассира.СоздатьМенеджерЗаписи();
	
	ЖурналДействийКассира.Пользователь 	= ПараметрыСеанса.Пользователь;
	ЖурналДействийКассира.Оборудование 	= ПараметрыСеанса.Компьютер.ФР;
	ЖурналДействийКассира.Источник 		= ПараметрыСеанса.Компьютер;
	ЖурналДействийКассира.GUID 			= ПараметрыСеанса.Компьютер.ФР.ИдентификаторОборудования;
	ЖурналДействийКассира.Дата 			= ТекущаяДата();
	ЖурналДействийКассира.Действие 		= "ФормаКорректировки";
	ЖурналДействийКассира.Код 			= 0;
	ЖурналДействийКассира.Описание 		= Строка(Описание);
	ЖурналДействийКассира.Объект 		= Неопределено;
	ЖурналДействийКассира.Тип 			= ТипСообщения;
	
	ЖурналДействийКассира.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	ЗаписатьВФайлЛога("Форма корректировки закрыта");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПРИНЯТЬАльтернатива(Команда)

	ЗаписатьВФайлЛога("Нажата кнопка ПРИНЯТЬПОQR");
	АвтопробитиеЧека = Ложь;
	
	Если ВыборНаличныеБезналичные = 0 Тогда
		ЗаписатьВФайлЛога("Используем Оплату по АльфаБанк. Создаем новый ПКО.");
		
		НовыйПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
		НовыйПКО.Заполнить(Сделка);
		НовыйПКО.СуммаДокумента = ТипОплатыНаличныеБезналичные;
		НовыйПКО.КурсДокумента = 1;
		НовыйПКО.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
		НовыйПКО.ТипСпособаРасчетаККТ = ТипСпособаРасчета;
		НовыйПКО.ДляПробитияНаФР = Истина;
		Попытка
			НовыйПКО.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Оперативный);
			ЗаписатьВФайлЛога("Записан новый ПКО: " + НовыйПКО.Ссылка);
			Закрыть();
			ОткрытьЗначение(НовыйПКО.Ссылка);
			
		Исключение
			Ошибка = ОписаниеОшибки();
			ЗаписатьВФайлЛога("Ошибка записи ПКО: " + Ошибка,1);
			Сообщить("Ошибка при формировании ПКО для оплаты через АльфаБанк - " + Ошибка);
			Закрыть();
		КонецПопытки;
		
		
	ИначеЕсли ВыборНаличныеБезналичные = 1 Тогда
		ЗаписатьВФайлЛога("Используем Оплату по QR");
		О2_QR_ОбщийМодуль.ПередачаПоQRНажатие(ЭтаФорма);
	КонецЕсли; 
	
	//О2_QR_ОбщийМодуль.ПередачаПоQRНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийФРПриИзменении(Элемент)
	Если ЧастоИспользуемаяФР <> ТекущийФР И ЧастоИспользуемаяФР <> Неопределено Тогда
		Элементы.ДекорацияФРНеЧастоИспользуемый.Заголовок = СтрЗаменить(Элементы.ДекорацияФРНеЧастоИспользуемый.Заголовок,"<>","<"+Строка(ЧастоИспользуемаяФР)+">");
		//Элементы.ДекорацияФРНеЧастоИспользуемый.Видимость = Истина;
	Иначе
		//Элементы.ДекорацияФРНеЧастоИспользуемый.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПочтаКонтрагентаДляОтправкиПриИзменении(Элемент=Неопределено)
	Если ОтправитьЧекПоПочте = Истина Тогда
		Если СтрПодобнаПоРегулярномуВыражению(ПочтаКонтрагентаДляОтправки,"^[a-zA-Z0-9](?:[a-zA-Z0-9._%+-]*[a-zA-Z0-9])?@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$") Тогда
			Элементы.ДекорацияПредупреждениеОНекорректнойПочте.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияПредупреждениеОНекорректнойПочте.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧекПоПочтеПриИзменении(Элемент=Неопределено)
	Если ОтправитьЧекПоПочте = Истина Тогда
		Элементы.ПочтаКонтрагентаДляОтправки.Доступность = Истина;
	Иначе
		Элементы.ПочтаКонтрагентаДляОтправки.Доступность = Ложь;
	КонецЕсли;
	ПочтаКонтрагентаДляОтправкиПриИзменении();
КонецПроцедуры
