#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета
Перем ТаблицаПараметровТипаЦен;                        // Таблица параметров типа цена
Перем СтруктураПараметров;                             // Структура параметров отчета
Перем ГруппировкиСтрок Экспорт;						   // Групировки строк
Перем ГруппировкиКолонок Экспорт;					   // Группировки колонок

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

//Находит необходимую группировку
Функция НайтиГруппировку(ПолеПоиска) Экспорт
	
	Результат = Неопределено;
	
	Для Каждого ТекГруппировка Из ГруппировкиСтрок.ПоляГруппировки.Элементы Цикл
		Если ТекГруппировка.Поле = ПолеПоиска Тогда
			Возврат ТекГруппировка;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекГруппировка Из ГруппировкиКолонок.ПоляГруппировки.Элементы Цикл
		Если ТекГруппировка.Поле = ПолеПоиска Тогда
			Возврат ТекГруппировка;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьГруппировки(СтруктураГруппировок, Группировка)
	
	Элементы = Группировка.ПоляГруппировки.Элементы;
	Для Каждого ТекГруппировка Из Элементы Цикл
		
		Если НЕ НайтиГруппировку(ТекГруппировка.Поле) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыбранныеПоля = Новый ТаблицаЗначений();
		ВыбранныеПоля.Колонки.Добавить("Имя");
		ВыбранныеПоля.Колонки.Добавить("ПутьКДанным");
		ВыбранныеПоля.Колонки.Добавить("Представление");
		ПредставлениеПолей = "";
		Для Каждого ТекПоле Из Группировка.Выбор.Элементы Цикл
			
			Если НЕ ТекПоле.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ТекПоле) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
				
				ИмяПоля = Строка(ТекПоле.Поле);
				НоваяСтрока = ВыбранныеПоля.Добавить();
				НоваяСтрока.Имя           = СтрЗаменить(ИмяПоля, ".", "");
				НоваяСтрока.ПутьКДанным   = ИмяПоля;
				ПолеДерева = ДеревоДоступныхПолей.Строки.Найти(ИмяПоля, "ПутьКДанным", Истина);
				Если ПолеДерева = Неопределено Тогда
					НоваяСтрока.Представление = СтрЗаменить(ТекПоле.Поле, Строка(ТекГруппировка.Поле)+".", "");
				Иначе
					НоваяСтрока.Представление = ПолеДерева.Представление;
				КонецЕсли;
				ПредставлениеПолей = ПредставлениеПолей + ?(ПредставлениеПолей = "", "", ", ") + НоваяСтрока.Представление;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыИзмеренийСтрок.Вставить(ТекГруппировка.Поле, Новый Структура("ДопПоля, ПредставлениеПолей", ВыбранныеПоля, ПредставлениеПолей));
		
		ПоляПорядка = Новый ТаблицаЗначений();
		ПоляПорядка.Колонки.Добавить("ПутьКДанным");
		ПоляПорядка.Колонки.Добавить("Представление");
		ПоляПорядка.Колонки.Добавить("Убывание", Новый ОписаниеТипов("Булево"));
		
		ПредставлениеПорядка = "";
		Для Каждого ТекПоле Из Группировка.Порядок.Элементы Цикл
			
			Если НЕ ТекПоле.Использование Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ТекПоле) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
				ИмяПоля = Строка(ТекПоле.Поле);
				НоваяСтрока = ПоляПорядка.Добавить();
				НоваяСтрока.ПутьКДанным   = ИмяПоля;
				ПолеДерева = ДеревоДоступныхПолей.Строки.Найти(ИмяПоля, "ПутьКДанным", Истина);
				Если ПолеДерева = Неопределено Тогда
					НоваяСтрока.Представление = СтрЗаменить(ТекПоле.Поле, Строка(ТекГруппировка.Поле)+".", "");
				Иначе
					НоваяСтрока.Представление = ПолеДерева.Представление;
				КонецЕсли;
				Если ТекПоле.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда
					ПредставлениеПорядка = ПредставлениеПорядка + ?(ПредставлениеПорядка = "", "", ", ") + НоваяСтрока.Представление + " (Возр.)";
				Иначе
					НоваяСтрока.Убывание = Истина;
					ПредставлениеПорядка = ПредставлениеПорядка + ?(ПредставлениеПорядка = "", "", ", ") + НоваяСтрока.Представление + " (Убыв.)";
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ПараметрыИзмеренийСтрок[ТекГруппировка.Поле].Вставить("Порядок", ПоляПорядка);
		ПараметрыИзмеренийСтрок[ТекГруппировка.Поле].Вставить("ПредставлениеПорядка", ПредставлениеПорядка);
		
		ПолеГруппировки = СтруктураГруппировок.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование  = ТекГруппировка.Использование;
		ПолеГруппировки.Поле           = ТекГруппировка.Поле;
		ПолеГруппировки.ТипГруппировки = ТекГруппировка.ТипГруппировки;
	КонецЦикла;
	СоздатьИзмеренияОтчета(Группировка.Структура);
	
КонецПроцедуры

Процедура СоздатьИзмеренияОтчета(СтруктураОтчета)
	
	ТипСтруктурыТаблицы		= Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы	= Тип("ДиаграммаКомпоновкиДанных");
	Для Каждого ТекЭлемент Из СтруктураОтчета Цикл
		Если Не ТекЭлемент.Использование Тогда
			Продолжить;
		КонецЕсли;
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ТипЭлемента = ТипСтруктурыТаблицы Тогда
			Для Каждого Строка Из ТекЭлемент.Строки Цикл
				Если Не Строка.Использование Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьГруппировки(ГруппировкиСтрок.ПоляГруппировки, Строка);
			КонецЦикла;
			Для Каждого Колонка Из ТекЭлемент.Колонки Цикл
				Если Не Колонка.Использование Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьГруппировки(ГруппировкиКолонок.ПоляГруппировки, Колонка);
			КонецЦикла;
		ИначеЕсли ТипЭлемента = ТипСтруктурыДиаграммы Тогда
			Для Каждого Серия Из ТекЭлемент.Серии Цикл
				Если Не Серия.Использование Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьГруппировки(ГруппировкиСтрок.ПоляГруппировки, Серия);
			КонецЦикла;
			Для Каждого Точка Из ТекЭлемент.Точки Цикл
				Если Не Точка.Использование Тогда
					Продолжить;
				КонецЕсли;
				ЗаполнитьГруппировки(ГруппировкиКолонок.ПоляГруппировки, Точка);
			КонецЦикла;
		Иначе
			ЗаполнитьГруппировки(ГруппировкиСтрок.ПоляГруппировки, ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// В пользовательские настройки компоновщика копируем настройки из схемы компоновки данных
Процедура ИнициализироватьКомпоновщикНастроек(ЭтаФорма) Экспорт
	
	ИзмеренияСтроки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ИзмеренияКолонки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	
	Если ИзмеренияСтроки.Настройки.Структура.Количество() = 0 И ИзмеренияКолонки.Настройки.Структура.Количество() = 0 Тогда
		ГруппировкиСтрок   = ИзмеренияСтроки.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГруппировкиКолонок = ИзмеренияКолонки.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		СтруктураОтчета    = КомпоновщикНастроек.Настройки.Структура;
		СоздатьИзмеренияОтчета(СтруктураОтчета);
	Иначе
		ГруппировкиСтрок   = ИзмеренияСтроки.Настройки.Структура[0];
		ГруппировкиКолонок = ИзмеренияКолонки.Настройки.Структура[0];
	КонецЕсли;
	
	ЭтаФорма.ЭлементыФормы.СкрытаяНастройкаСтрок.ТекущаяСтрока   = ГруппировкиСтрок;
	ЭтаФорма.ЭлементыФормы.СкрытаяНастройкаКолонок.ТекущаяСтрока = ГруппировкиКолонок;
	
КонецПроцедуры

//Формирует дополнительные поля доступных таблиц
Процедура СформироватьДополнительныеПоляДоступныхТаблиц(ТекДеревоДоступныхПолей, ДеревоДоступныхПолейПриемник, ЭлементыДоступныхПолейКомпоновщика) Экспорт
	
	Если ТекДеревоДоступныхПолей=Неопределено Тогда
		Для Каждого ТекЭлемент Из ЭлементыДоступныхПолейКомпоновщика Цикл
			НовоеВложенноеДоступноеПоле = ДеревоДоступныхПолейПриемник.Строки.Добавить();
			НовоеВложенноеДоступноеПоле.Заголовок = ТекЭлемент.Заголовок;
			НовоеВложенноеДоступноеПоле.Представление = ТекЭлемент.Заголовок;
			НовоеВложенноеДоступноеПоле.ПутьКДанным = Строка(ТекЭлемент.Поле);
			НовоеВложенноеДоступноеПоле.Папка = ТекЭлемент.Папка;
			НовоеВложенноеДоступноеПоле.Поле = ТекЭлемент.Поле;
			НовоеВложенноеДоступноеПоле.Ресурс = ТекЭлемент.Ресурс;
			СформироватьДополнительныеПоляДоступныхТаблиц(Неопределено, НовоеВложенноеДоступноеПоле, ТекЭлемент.Элементы);
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрока Из ТекДеревоДоступныхПолей.Строки Цикл
			ТекЭлемент = ЭлементыДоступныхПолейКомпоновщика.Найти(ТекСтрока.ПутьКДанным);
			Если ТекЭлемент = Неопределено Тогда Продолжить; КонецЕсли;
			НовоеВложенноеДоступноеПоле = ДеревоДоступныхПолейПриемник.Строки.Добавить();
			НовоеВложенноеДоступноеПоле.Заголовок = ТекЭлемент.Заголовок;
			
			Представление = ТекЭлемент.Заголовок;
			ПозицияТочки = Найти(Представление, ".");
			Пока ПозицияТочки>0 Цикл
				Представление = Сред(Представление, ПозицияТочки+1);
				ПозицияТочки = Найти(Представление, ".");
			КонецЦикла;
			
			НовоеВложенноеДоступноеПоле.Представление = Представление;
			НовоеВложенноеДоступноеПоле.ПутьКДанным = ТекСтрока.ПутьКДанным;
			НовоеВложенноеДоступноеПоле.Папка = ТекЭлемент.Папка;
			НовоеВложенноеДоступноеПоле.Поле = ТекЭлемент.Поле;
			НовоеВложенноеДоступноеПоле.Ресурс = ТекЭлемент.Ресурс;
			СформироватьДополнительныеПоляДоступныхТаблиц(ТекСтрока, НовоеВложенноеДоступноеПоле, ТекЭлемент.Элементы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьНомерКолонкиПоказателя(Элементы, НомерСтроки, НомерКолонки, ТаблицаПоказателей, ЕстьЭлементы, СчитатьНомерСтроки = Ложь, СчитатьНомерКолонки = Ложь, СчитатьНомерВКолонке = Ложь)
	
	НомерВКолонке = 0;
	ДобавлялиЭлементы = Ложь;
	Для Каждого Элемент Из Элементы Цикл 
		Если Не Элемент.Использование Тогда Продолжить; КонецЕсли;
		Если ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СчитатьНомераСтрок     = Элемент.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально;
			СчитатьНомераКолонок   = ((Не Элемент.Расположение = РасположениеПоляКомпоновкиДанных.Вертикально) И (Не Элемент.Расположение = РасположениеПоляКомпоновкиДанных.Вместе));
			СчитатьНомераВКолонках = Элемент.Расположение = РасположениеПоляКомпоновкиДанных.Вместе;
			
			Если СчитатьНомерСтроки Тогда
				ТекНомерКолонки = НомерКолонки;
				ПолучитьНомерКолонкиПоказателя(Элемент.Элементы, НомерСтроки, ТекНомерКолонки, ТаблицаПоказателей, ДобавлялиЭлементы, СчитатьНомераСтрок, СчитатьНомераКолонок, СчитатьНомераВКолонках);
			Иначе
				ПолучитьНомерКолонкиПоказателя(Элемент.Элементы, НомерСтроки, НомерКолонки, ТаблицаПоказателей, ДобавлялиЭлементы, СчитатьНомераСтрок, СчитатьНомераКолонок, СчитатьНомераВКолонках);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			
			ИмяПоля = СокрЛП(Элемент.Поле);
			Если ТаблицаПоказателей.Найти(ИмяПоля, "Имя") = Неопределено Тогда
				НоваяСтрока = ТаблицаПоказателей.Добавить();
				НоваяСтрока.Имя           = ИмяПоля;
				НоваяСтрока.НомерСтроки   = НомерСтроки + ?(ДобавлялиЭлементы И СчитатьНомерСтроки, 1, 0);
				НоваяСтрока.НомерКолонки  = НомерКолонки;
				НоваяСтрока.НомерВКолонке = НомерВКолонке;
				
				Если СчитатьНомерСтроки Тогда
					НомерСтроки       = НомерСтроки + 1;
				КонецЕсли;
				
				НомерКолонки  = НомерКолонки + 1;
				
				Если СчитатьНомерВКолонке Тогда
					НомерВКолонке = НомерВКолонке + 1;
				КонецЕсли;
				
				ЕстьЭлементы = Истина;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьМассивМакетов(Группировки, МассивМакетов, Добавить = Ложь);
	
	Для Каждого ТекГруппировка Из Группировки Цикл
		Если ТипЗнч(ТекГруппировка)=Тип("МакетГруппировкиТаблицыМакетаКомпоновкиДанных") И Добавить Тогда
			Попытка
				Для Каждого ТекМакетРесурсов Из ТекГруппировка.МакетРесурсов Цикл
					МассивМакетов.Добавить(ТекМакетРесурсов.Макет);
				КонецЦикла;
			Исключение
				МассивМакетов.Добавить(ТекГруппировка.Макет);
			КонецПопытки;
		ИначеЕсли ТипЗнч(ТекГруппировка)=Тип("ГруппировкаТаблицыМакетаКомпоновкиДанных") Тогда
			Если ТекГруппировка.Группировка[0].ИмяПоля = "Авторабота" Тогда
				ПолучитьМассивМакетов(ТекГруппировка.ТелоИерархии, МассивМакетов, Истина);
			Иначе
				ПолучитьМассивМакетов(ТекГруппировка.Тело, МассивМакетов, Ложь);
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекГруппировка)=Тип("МакетОбластиМакетаКомпоновкиДанных") И Добавить Тогда
			МассивМакетов.Добавить(ТекГруппировка.Макет);
		ИначеЕсли ТипЗнч(ТекГруппировка)=Тип("ИерархическаяГруппировкаТаблицыМакетаКомпоновкиДанных") Тогда
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// проверяет на корректность заполнения, возвращает "истина", если корректно, "ложь" - если нет
//
// Без параметров
// 
Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
	
	Возврат Истина;
	
КонецФункции // КорректностьЗаполнения()

Процедура ДобавитьГруппировки(МассивГруппировок, Группировка, ИндексРаботы, ГруппировкаРаботы)
	
	Элементы = Группировка.ПоляГруппировки.Элементы;
	Если Элементы.Количество()=0 Тогда
	ИначеЕсли Элементы.Количество()=1 Тогда
		ТекГруппировка = Элементы[0];
		Если ТекГруппировка.Использование Тогда
			ИмяПоля = СокрЛП(ТекГруппировка.Поле);
			Если ИмяПоля = "" Тогда
				Возврат;
			КонецЕсли;
			Если ИмяПоля = "Авторабота" Тогда
				ИндексРаботы = МассивГруппировок.Количество();
				ГруппировкаРаботы = Группировка;
			КонецЕсли;
			МассивГруппировок.Добавить(ТекГруппировка);
			НовыйОтбор = Неопределено;
			Для Каждого ТекОтбор Из Группировка.Отбор.Элементы Цикл
				Если ТекОтбор.ЛевоеЗначение = ТекГруппировка.Поле И 
					ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено Тогда
					НовыйОтбор = ТекОтбор;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НовыйОтбор = Неопределено Тогда 
				НовыйОтбор = Группировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = ТекГруппировка.Поле;
				НовыйОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;
			КонецЕсли;
			НовыйОтбор.Использование = Истина;
			НовыйОтбор.Применение    = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
			ПараметрОтображения = Группировка.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор");
			Если Не ПараметрОтображения = Неопределено Тогда
				ПараметрОтображения.Значение      = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
				ПараметрОтображения.Использование = Истина;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		ДобавитьГруппуОтборов = Истина;
		ГруппаОтборов         = Неопределено;
		Для Каждого ТекГруппировка Из Элементы Цикл
			Если Не ТекГруппировка.Использование Тогда
				Продолжить;
			КонецЕсли;
			ИмяПоля = СокрЛП(ТекГруппировка.Поле);
			Если ИмяПоля = "" Тогда
				Продолжить;
			КонецЕсли;
			ЕстьГруппировки = Истина;
			Если ИмяПоля = "Авторабота" Тогда
				ИндексРаботы = МассивГруппировок.Количество();
				ГруппировкаРаботы = Группировка;
			КонецЕсли;
			МассивГруппировок.Добавить(ТекГруппировка);
			
			Если ДобавитьГруппуОтборов Тогда
				
				ГруппаОтборов = Неопределено;
				Для Каждого ТекОтбор Из Группировка.Отбор.Элементы Цикл
					Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") И 
						ТекОтбор.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
						ГруппаОтборов = ТекОтбор;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ГруппаОтборов = Неопределено Тогда 
					ГруппаОтборов = Группировка.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
				КонецЕсли;
				
				ГруппаОтборов = Группировка.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных "));
				ГруппаОтборов.Использование = Истина;
				ГруппаОтборов.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
				
				ПараметрОтображения = Группировка.ПараметрыВывода.Элементы.Найти("ВыводитьОтбор");
				Если Не ПараметрОтображения = Неопределено Тогда
					ПараметрОтображения.Значение      = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
					ПараметрОтображения.Использование = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			НовыйОтбор = Неопределено;
			Для Каждого ТекОтбор Из ГруппаОтборов.Элементы Цикл
				Если ТекОтбор.ЛевоеЗначение = ТекГруппировка.Поле И 
					ТекОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено Тогда
					НовыйОтбор = ТекОтбор;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НовыйОтбор = Неопределено Тогда
				НовыйОтбор = ГруппаОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйОтбор.ЛевоеЗначение = ТекГруппировка.Поле;
				НовыйОтбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Заполнено;
			КонецЕсли;
			
			НовыйОтбор.Использование = Истина;
			НовыйОтбор.Применение    = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ПолучитьМассивГруппировок(МассивГруппировок, Группировка.Структура, ИндексРаботы, ГруппировкаРаботы);
	
КонецПроцедуры

Процедура ДобавитьПолеВПоследнююГруппировку(Структура, ПолеДобавления)
	
	ТипСтруктурыТаблицы   = Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы = Тип("ДиаграммаКомпоновкиДанных");
	Для Каждого ТекЭлемент Из Структура Цикл
		Если Не ТекЭлемент.Использование Тогда
			Продолжить;
		КонецЕсли;
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ТипЭлемента = ТипСтруктурыТаблицы Тогда
			
			ПоследняяСтрока = Неопределено;
			Для Каждого Строка Из ТекЭлемент.Строки Цикл
				Если Не Строка.Использование Тогда
					Продолжить;
				КонецЕсли;
				ПоследняяСтрока = Строка;
			КонецЦикла;
			
			Если НЕ ПоследняяСтрока = Неопределено Тогда
				ДобавитьПолеВПоследнююГруппировку(ПоследняяСтрока.Структура, ПолеДобавления);
			КонецЕсли;
			
		ИначеЕсли ТипЭлемента = ТипСтруктурыДиаграммы Тогда
		Иначе
			Если Структура.Количество() = 0 Тогда
				
				НоваяГруппировка = Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
				НоваяГруппировка.Использование = Истина;
				
				ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
				ПолеГруппировки.Использование  = Истина;
				ПолеГруппировки.Поле           = ПолеДобавления;
				ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
				
			Иначе
				ДобавитьПолеВПоследнююГруппировку(Структура[0].Структура, ПолеДобавления);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПолеВНаборДанныхКомпоновщика(СхемаКомпоновкиДанныхОтчета, ИмяНабора, ИмяПоля, ПутьКДанным = Неопределено)
	
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = ИмяПоля;
	КонецЕсли;
	
	НаборДанных = СхемаКомпоновкиДанныхОтчета.НаборыДанных.Найти(ИмяНабора);
	
	Если Не НаборДанных = Неопределено Тогда
		
		ТекПоле = НаборДанных.Поля.Найти(ИмяПоля);
		Если ТекПоле = Неопределено Тогда
			ТекПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		КонецЕсли;
		ТекПоле.Заголовок                            = ИмяПоля;
		ТекПоле.Поле                                 = ИмяПоля;
		ТекПоле.ПутьКДанным                          = ПутьКДанным;
		ТекПоле.ОграничениеИспользования.Группировка = Истина;
		ТекПоле.ОграничениеИспользования.Поле        = Ложь;
		ТекПоле.ОграничениеИспользования.Порядок     = Истина;
		ТекПоле.ОграничениеИспользования.Условие     = Истина;
		ТекПоле.ТипЗначения                          = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискВГруппировке(ПолеПоиска, Группировка)
	
	Элементы = Группировка.ПоляГруппировки.Элементы;
	Для Каждого ТекГруппировка Из Элементы Цикл
		Если Не ТекГруппировка.Использование Тогда Продолжить; КонецЕсли;
		Если ТекГруппировка.Поле = ПолеПоиска Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Результат = ПоискГруппировки(ПолеПоиска, Группировка.Структура);
	
	Возврат Результат;
	
КонецФункции

Функция ПоискГруппировки(ПолеПоиска, Структура)
	
	Результат = Ложь;
	ТипСтруктурыТаблицы		= Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы	= Тип("ДиаграммаКомпоновкиДанных");
	Для Каждого ТекЭлемент Из Структура Цикл
		Если Не ТекЭлемент.Использование Тогда Продолжить; КонецЕсли;
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ТипЭлемента = ТипСтруктурыТаблицы Тогда
			Для Каждого Строка Из ТекЭлемент.Строки Цикл
				Если Не Строка.Использование Тогда Продолжить; КонецЕсли;
				Если ПоискВГруппировке(ПолеПоиска, Строка) Тогда Возврат Истина; КонецЕсли;
			КонецЦикла;
			Для Каждого Колонка Из ТекЭлемент.Колонки Цикл
				Если Не Колонка.Использование Тогда Продолжить; КонецЕсли;
				Если ПоискВГруппировке(ПолеПоиска, Колонка) Тогда Возврат Истина; КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЭлемента = ТипСтруктурыДиаграммы Тогда
			Для Каждого Серия Из ТекЭлемент.Серии Цикл
				Если Не Серия.Использование Тогда Продолжить; КонецЕсли;
				Если ПоискВГруппировке(ПолеПоиска, Серия)  Тогда Возврат Истина; КонецЕсли;
			КонецЦикла;
			Для Каждого Точка Из ТекЭлемент.Точки Цикл
				Если Не Точка.Использование Тогда Продолжить; КонецЕсли;
				Если ПоискВГруппировке(ПолеПоиска, Точка)  Тогда Возврат Истина; КонецЕсли;
			КонецЦикла;
		Иначе
			Если ПоискВГруппировке(ПолеПоиска, ТекЭлемент)  Тогда Возврат Истина; КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоОтборов(ПолеПоиска, ОтборКомпоновщика, ТипГруппы = Неопределено)
	
	Счетчик = 0;
	Для Каждого ТекОтбор Из ОтборКомпоновщика.Элементы Цикл
		Если Не ТекОтбор.Использование Тогда Продолжить; КонецЕсли;
		Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Счетчик = Счетчик + КоличествоОтборов(ПолеПоиска, ТекОтбор, ТекОтбор.ТипГруппы);
		ИначеЕсли ТекОтбор.ЛевоеЗначение = ПолеПоиска Тогда
			Если ТипГруппы = Неопределено И ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
				Счетчик = Счетчик + 1;
			Иначе
				Счетчик = Счетчик + 2;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Счетчик;
	
КонецФункции

Функция ПолучитьТекстУсловияПроверкиЗаполнения(ТипыУсловия, ПутьКДанным, Заполнено = Истина)
	
	ТекстУсловия = "";
	Для Каждого ТекущийТип Из ТипыУсловия Цикл
		
		ПустоеЗначение = """";
		Если ТекущийТип      = Тип("Строка") Тогда
			ПустоеЗначение = """";
		ИначеЕсли ТекущийТип = Тип("Число") Тогда
			ПустоеЗначение = "0";
		ИначеЕсли ТекущийТип = Тип("Дата") Тогда
			ПустоеЗначение = "ДАТАВРЕМЯ(1,1,1)";
		ИначеЕсли ТекущийТип = Тип("Булево") Тогда
			ПустоеЗначение = "ЛОЖЬ";
		Иначе
			ПустоеЗначение = "ЗНАЧЕНИЕ(" + Метаданные.НайтиПоТипу(ТекущийТип).ПолноеИмя() + ".ПустаяСсылка)";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = "", "", " ИЛИ " + Символы.ПС) + ПутьКДанным + " = " + ПустоеЗначение;
		
	КонецЦикла;
	
	Если ТипыУсловия.Количество() > 1 Тогда
		ТекстУсловия = ТекстУсловия + " ИЛИ " + Символы.ПС + ПутьКДанным + " = Неопределено";
	КонецЕсли;
	
	Если Заполнено Тогда
		ТекстУсловия = "НЕ ("+ТекстУсловия + ?(ТекстУсловия = "", "", " ИЛИ " + Символы.ПС) + ПутьКДанным + " ЕСТЬ NULL)";
	Иначе
		ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = "", "", " ИЛИ " + Символы.ПС) + ПутьКДанным + " ЕСТЬ NULL";
	КонецЕсли;
	
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТекстСравнения(ТекОтбор, Параметры, ПутьКДанным)
	
	ИмяПараметра = "Параметр" + Параметры.Количество();
	ТипПараметра = 1;
	ТекстУсловия = "";
	
	Если ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
		ТекстУсловия = ПутьКДанным+">&"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
		ТекстУсловия = ПутьКДанным+">=&"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Тогда
		ТекстУсловия = ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+")";	
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
		ТекстУсловия = ПутьКДанным+" В (&"+ИмяПараметра+")";
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		ТекстУсловия = ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+")";
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		ДоступноеПолеОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекОтбор.ЛевоеЗначение);
		ТекстУсловия = ПолучитьТекстУсловияПроверкиЗаполнения(ДоступноеПолеОтбора.ТипЗначения.Типы(), ПутьКДанным, Истина);
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
		ТекстУсловия = ПутьКДанным+"<&"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
		ТекстУсловия = ПутьКДанным+"<=&"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		ТекстУсловия = "(НЕ "+ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+"))";
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
		ТекстУсловия = "(НЕ "+ПутьКДанным+" В (&"+ИмяПараметра+"))";
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		ТекстУсловия = "(НЕ "+ПутьКДанным+" В ИЕРАРХИИ (&"+ИмяПараметра+"))";
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		ДоступноеПолеОтбора = КомпоновщикНастроек.Настройки.Отбор.ДоступныеПоляОтбора.НайтиПоле(ТекОтбор.ЛевоеЗначение);
		ТекстУсловия = ПолучитьТекстУсловияПроверкиЗаполнения(ДоступноеПолеОтбора.ТипЗначения.Типы(), ПутьКДанным, Ложь);
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
		ТекстУсловия = ПутьКДанным+" <> &"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
		ТекстУсловия = "(НЕ "+ПутьКДанным+" ПОДОБНО &"+ИмяПараметра+")";
		ТипПараметра  = 2;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
		ТекстУсловия = ПутьКДанным+" = &"+ИмяПараметра;
	ИначеЕсли ТекОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
		ТекстУсловия = ПутьКДанным+" ПОДОБНО &"+ИмяПараметра;
		ТипПараметра  = 2;
	КонецЕсли;
	
	Если ТипПараметра=1 Тогда
		Параметры.Вставить(ИмяПараметра, ТекОтбор.ПравоеЗначение);
	ИначеЕсли ТипПараметра=2 Тогда
		Параметры.Вставить(ИмяПараметра, "%"+ТекОтбор.ПравоеЗначение+"%");
	КонецЕсли;
	
	Возврат ТекстУсловия;
	
КонецФункции

Функция ПолучитьТаблицыГрупп(Запрос, Уровень=0)

	Запрос.Текст = "ВЫБРАТЬ
	|	Автоработы.Элемент КАК Элемент,
	|	ВЫРАЗИТЬ(Автоработы.Группа КАК Справочник.Автоработы).Родитель КАК Группа,
	|	Автоработы.ВремяВыполнения КАК ВремяВыполнения,
	|	Автоработы.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ
	|	Уровень"+Уровень+"
	|ИЗ
	|	Уровень"+Строка(Уровень-1)+" КАК Автоработы
	|ГДЕ
	|	(НЕ ВЫРАЗИТЬ(Автоработы.Группа КАК Справочник.Автоработы).Родитель = ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка))";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = Уровень-1;
	Иначе
		КоличествоУровней = ПолучитьТаблицыГрупп(Запрос, Уровень+1);
	КонецЕсли;
	
	Возврат КоличествоУровней;
	
КонецФункции

Функция ПолучитьТекстТаблицыАвторабот(Запрос, КоличествоУровней, ТекстОтбора="")
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Автоработы.Ссылка КАК Элемент,
	|	Автоработы.Ссылка КАК Группа,
	|	Автоработы.ВремяВыполнения КАК ВремяВыполнения,
	|	Автоработы.ЭтоГруппа КАК ЭтоГруппа
	|ПОМЕСТИТЬ
	|	Уровень0
	|ИЗ
	|	Справочник.Автоработы КАК Автоработы
	|ГДЕ
	|	ИСТИНА "+ТекстОтбора;
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = 0;
	Иначе
		КоличествоУровней = ПолучитьТаблицыГрупп(Запрос, 1);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Элемент КАК Справочник.Автоработы) КАК Элемент,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Группа КАК Справочник.Автоработы) КАК Группа,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.ВремяВыполнения КАК Число(15, 3)) КАК ВремяВыполнения,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.ЭтоГруппа КАК Булево) КАК ЭтоГруппа,
	|	ОбъединенныйЗапрос.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ ТаблицаПриоритетов
	|ИЗ 
	| (ВЫБРАТЬ
	|	Автоработы.Элемент КАК Элемент,
	|	Автоработы.Группа КАК Группа,
	|	Автоработы.ВремяВыполнения КАК ВремяВыполнения,
	|	Автоработы.ЭтоГруппа КАК ЭтоГруппа,
	|	0 КАК Приоритет
	| ИЗ Уровень0 КАК Автоработы";
	
	ТекстЗапросаУдаленияТаблиц = "";
	Для Итерация = 1 По КоличествоУровней Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Автоработы.Элемент КАК Элемент,
		|	Автоработы.Группа КАК Группа,
		|	Автоработы.ВремяВыполнения КАК ВремяВыполнения,
		|	Автоработы.ЭтоГруппа КАК ЭтоГруппа,
		|	" + Строка(Итерация) + " КАК Приоритет
		|ИЗ
		|	Уровень" + Строка(Итерация) + " КАК Автоработы";
		
		ТекстЗапросаУдаленияТаблиц = ТекстЗапросаУдаленияТаблиц + "
		|УНИЧТОЖИТЬ
		|	Уровень" + Строка(Итерация)+"
		|;
		|";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ") КАК ОбъединенныйЗапрос
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	Уровень0
	|;
	|"+ТекстЗапросаУдаленияТаблиц;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТаблицуГруппВремениВыполнения(Запрос, Уровень=0)

	Запрос.Текст = "ВЫБРАТЬ
	|	НормыВремени.Авторабота КАК Авторабота,
	|	НормыВремени.Модель КАК Модель,
	|	НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
	|	ВЫРАЗИТЬ(НормыВремени.Группа КАК Справочник.Модели).Родитель КАК Группа,
	|	НормыВремени.ВремяВыполнения КАК ВремяВыполнения
	|ПОМЕСТИТЬ
	|	ТаблицаУровень"+Уровень+"
	|ИЗ
	|	ТаблицаУровень"+Строка(Уровень-1)+" КАК НормыВремени
	|ГДЕ
	|	(НЕ ВЫРАЗИТЬ(НормыВремени.Группа КАК Справочник.Модели).Родитель ЕСТЬ NULL)";
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = Уровень-1;
	Иначе
		КоличествоУровней = ПолучитьТаблицуГруппВремениВыполнения(Запрос, Уровень+1);
	КонецЕсли;
	
	Возврат КоличествоУровней;
	
КонецФункции

Функция ПолучитьТекстТаблицыВремениВыполнения(Запрос, Знач ТекстОтбора = "")
	
	ТекстОтбора=СтрЗаменить(ТекстОтбора,"Автоработы.","Автоработы.Ссылка.");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Автоработы.Ссылка КАК Авторабота,
	|	Автоработы.Модель КАК Группа,
	|	Автоработы.Модель КАК Модель,
	|	Автоработы.ВариантКомплектации КАК ВариантКомплектации,
	|	Автоработы.ВремяВыполнения КАК ВремяВыполнения
	|ПОМЕСТИТЬ
	|	ТаблицаУровень0
	|ИЗ
	|	Справочник.Автоработы.НормыВремени КАК Автоработы
	|ГДЕ
	|	Автоработы.ВремяВыполнения > 0 "+ТекстОтбора;
	
	Если Запрос.Выполнить().Выгрузить()[0].Количество=0 Тогда
		КоличествоУровней = 0;
	Иначе
		КоличествоУровней = ПолучитьТаблицуГруппВремениВыполнения(Запрос, 1);
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбъединенныйЗапрос.Модель КАК Модель,
	|	ОбъединенныйЗапрос.ВариантКомплектации КАК ВариантКомплектации,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Авторабота КАК Справочник.Автоработы) КАК Авторабота,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.Группа КАК Справочник.Модели) КАК Группа,
	|	ВЫРАЗИТЬ(ОбъединенныйЗапрос.ВремяВыполнения КАК Число(15, 2)) КАК ВремяВыполнения,
	|	ОбъединенныйЗапрос.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ
	|	НормыВремениТаблицаПриоритетов
	|ИЗ
	|	(ВЫБРАТЬ
	|		НормыВремени.Авторабота КАК Авторабота,
	|		НормыВремени.Модель КАК Модель,
	|		НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
	|		НормыВремени.Группа КАК Группа,
	|		НормыВремени.ВремяВыполнения КАК ВремяВыполнения,
	|		0 КАК Приоритет
	|	ИЗ
	|		ТаблицаУровень0 КАК НормыВремени";
	
	ТекстЗапросаУдаленияТаблиц = "";
	Для Итерация = 1 По КоличествоУровней Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		НормыВремени.Авторабота КАК Авторабота,
		|		НормыВремени.Модель КАК Модель,
		|		НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
		|		НормыВремени.Группа КАК Группа,
		|		НормыВремени.ВремяВыполнения КАК ВремяВыполнения,
		|		" + Строка(Итерация) + " КАК Приоритет
		|	ИЗ
		|		ТаблицаУровень" + Строка(Итерация) + " КАК НормыВремени";
		
		ТекстЗапросаУдаленияТаблиц = ТекстЗапросаУдаленияТаблиц + "
		|УНИЧТОЖИТЬ
		|	ТаблицаУровень" + Строка(Итерация)+"
		|;
		|";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + ") КАК ОбъединенныйЗапрос
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаУровень0
	|;
	|"+ТекстЗапросаУдаленияТаблиц;
	
	Возврат ТекстЗапроса;
		
КонецФункции

Процедура ПолучитьМассивГруппировок(МассивГруппировок, Структура, ИндексРаботы, ГруппировкаРаботы)
	
	ТипСтруктурыТаблицы		= Тип("ТаблицаКомпоновкиДанных");
	ТипСтруктурыДиаграммы	= Тип("ДиаграммаКомпоновкиДанных");
	Для Каждого ТекЭлемент Из Структура Цикл
		Если Не ТекЭлемент.Использование Тогда Продолжить; КонецЕсли;
		ТипЭлемента = ТипЗнч(ТекЭлемент);
		Если ТипЭлемента = ТипСтруктурыТаблицы Тогда
			Для Каждого Строка Из ТекЭлемент.Строки Цикл
				Если Не Строка.Использование Тогда Продолжить; КонецЕсли;
				ДобавитьГруппировки(МассивГруппировок, Строка, ИндексРаботы,  ГруппировкаРаботы);
			КонецЦикла;
			Для Каждого Колонка Из ТекЭлемент.Колонки Цикл
				Если Не Колонка.Использование Тогда Продолжить; КонецЕсли;
				ДобавитьГруппировки(МассивГруппировок, Колонка, ИндексРаботы, ГруппировкаРаботы);
			КонецЦикла;
		ИначеЕсли ТипЭлемента = ТипСтруктурыДиаграммы Тогда
			Для Каждого Серия Из ТекЭлемент.Серии Цикл
				Если Не Серия.Использование Тогда Продолжить; КонецЕсли;
				ДобавитьГруппировки(МассивГруппировок, Серия, ИндексРаботы,   ГруппировкаРаботы);
			КонецЦикла;
			Для Каждого Точка Из ТекЭлемент.Точки Цикл
				Если Не Точка.Использование Тогда Продолжить; КонецЕсли;
				ДобавитьГруппировки(МассивГруппировок, Точка, ИндексРаботы,   ГруппировкаРаботы);
			КонецЦикла;
		Иначе
			ДобавитьГруппировки(МассивГруппировок, ТекЭлемент, ИндексРаботы,  ГруппировкаРаботы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстОтбора(ОтборКомпоновщика, Параметры, Союз = Неопределено)
	
	Если Союз = Неопределено Тогда
		Союз = " И ";
	КонецЕсли;
	
	ТекстОтбора = "";
	Для Каждого ТекОтбор Из ОтборКомпоновщика.Элементы Цикл
		
		Если НЕ ТекОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			//Если ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
			//	ТекстОтбора = ТекстОтбора + "(" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " И ") + ")";
			//ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
			//	ТекстОтбора = ТекстОтбора + "(" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " ИЛИ ") + ")";
			//ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			//	ТекстОтбора = ТекстОтбора + "НЕ (" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " И ") + ")";
			//КонецЕсли;
			ПредварительныйТекстОтбора = "";
			Если ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
				ПредварительныйТекстОтбора = "(" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " И ") + ")";
			ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
				ПредварительныйТекстОтбора = "(" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " ИЛИ ") + ")";
			ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
				ПредварительныйТекстОтбора = "НЕ (" + ПолучитьТекстОтбора(ТекОтбор, Параметры, " И ") + ")";
			КонецЕсли;
			
			Если Найти(ПредварительныйТекстОтбора, "ТаблицаЦен.")>0 Тогда
				Если НЕ ТекстОтбора = "" Тогда
					ТекстОтбора = ТекстОтбора + Союз + Символы.ПС;
				КонецЕсли;
				ТекстОтбора = ТекстОтбора + ПредварительныйТекстОтбора;
			КонецЕсли;
			
		Иначе
			
			ИмяОтбора = СокрЛП(ТекОтбор.ЛевоеЗначение);
			Если (ИмяОтбора = "") ИЛИ (ТипЗнч(ТекОтбор.ПравоеЗначение) = Тип("СписокЗначений") И ТекОтбор.ПравоеЗначение.Количество()=0) Тогда
				ТекОтбор.Использование = Ложь;
			Иначе
				Если НЕ ТекстОтбора = "" Тогда
					ТекстОтбора = ТекстОтбора + Союз + Символы.ПС;
				КонецЕсли;
				ПутьКДанным  = "ТаблицаЦен."+СокрЛП(ТекОтбор.ЛевоеЗначение);
				ТекстОтбора = ТекстОтбора + ПолучитьТекстСравнения(ТекОтбор, Параметры, ПутьКДанным);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекстОтбора;
	
КонецФункции

Функция ПолучитьТекстОтбораДляАвторабот(ОтборКомпоновщика, Параметры, Союз = Неопределено, ГруппаИ = Истина)
	
	Если Союз = Неопределено Тогда
		Союз = " И ";
	КонецЕсли;
	
	ТекстОтбора = "";
	Для Каждого ТекОтбор Из ОтборКомпоновщика.Элементы Цикл
		
		Если НЕ ТекОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			
			Если ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Тогда
				ВложенныйТекстОтбора = ПолучитьТекстОтбораДляАвторабот(ТекОтбор, Параметры, " И ", Истина);
				Если НЕ ВложенныйТекстОтбора = "" Тогда
					ВложенныйТекстОтбора = "(" + ВложенныйТекстОтбора + ")";
				КонецЕсли;
			ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
				ВложенныйТекстОтбора = ПолучитьТекстОтбораДляАвторабот(ТекОтбор, Параметры, " ИЛИ ", Ложь);
				Если НЕ ВложенныйТекстОтбора = "" Тогда
					ВложенныйТекстОтбора = "(" + ВложенныйТекстОтбора + ")";
				КонецЕсли;
			ИначеЕсли ТекОтбор.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
				ВложенныйТекстОтбора = ПолучитьТекстОтбораДляАвторабот(ТекОтбор, Параметры, " И ", Ложь);
				Если НЕ ВложенныйТекстОтбора = "" Тогда
					ВложенныйТекстОтбора = "НЕ (" + ВложенныйТекстОтбора + ")";
				КонецЕсли;
			КонецЕсли;
			
			Если ВложенныйТекстОтбора = "" Тогда
				Если ГруппаИ Тогда
					Продолжить;
				Иначе
					Возврат "";
				КонецЕсли;
			Иначе
				Если НЕ ТекстОтбора = "" Тогда
					ТекстОтбора = ТекстОтбора + Союз + Символы.ПС;
				КонецЕсли;
				ТекстОтбора = ТекстОтбора + ВложенныйТекстОтбора;
			КонецЕсли;
			
		Иначе
			
			ПутьКДанным = СокрЛП(ТекОтбор.ЛевоеЗначение);
			Если Найти(ПутьКДанным, "Авторабота")>0 Тогда
				Если Найти(ПутьКДанным, ".") = 0 Тогда
					ПутьКДанным = "Автоработы.Ссылка";
				Иначе
					ПутьКДанным = "Автоработы." + СтрЗаменить(ПутьКДанным, "Авторабота.", "");
				КонецЕсли;
			ИначеЕсли ГруппаИ Тогда
				Продолжить;
			Иначе
				Возврат "";
			КонецЕсли;
			
			Если НЕ ТекстОтбора = "" Тогда
				ТекстОтбора = ТекстОтбора + Союз + Символы.ПС;
			КонецЕсли;
			ТекстОтбора = ТекстОтбора + ПолучитьТекстСравнения(ТекОтбор, Параметры, ПутьКДанным);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТекстОтбора;
	
КонецФункции

Функция ПолучитьЗапросИерархия(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок)
	
	КоличествоУровней = 0;
	ТекстЗапроса = ПолучитьТекстТаблицыАвторабот(Запрос, КоличествоУровней, ТекстОтбораАвторабот);
	
	ЕстьМодель                = СтруктураГруппировок.Модель;
	ЕстьЦех                   = СтруктураГруппировок.Цех;
	ЕстьВидРемонта            = СтруктураГруппировок.ВидРемонта;
	ЕстьДоговорВзаиморасчетов = СтруктураГруппировок.ДоговорВзаиморасчетов;
	ЕстьВариантКомплектации   = СтруктураГруппировок.ВариантКомплектации;
	
	МассивИспользуемыхТипов   = Новый Массив;
	СтруктураБазовыхТипов     = Новый Структура;
	Показатели = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	ЕстьНеЗависемыеПоказатели = Ложь;
	Для Каждого ТекГруппа Из Показатели Цикл
		
		Если НЕ ТекГруппа.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекГруппа) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ЕстьНеЗависемыеПоказатели = Истина;
			Продолжить;
		Иначе
			Для Каждого ТекПоказатель Из ТекГруппа.Элементы Цикл
				Если ТекПоказатель.Использование Тогда
					ИмяТаблицы = Строка(ТекГруппа.Поле);
					ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТаблицы, "Имя");
					Если СтруктураБазовыхТипов.Свойство(ЦеновойПоказатель.ИмяБазовогоТипаЦен) = Ложь Тогда
						СтруктураБазовыхТипов.Вставить(ЦеновойПоказатель.ИмяБазовогоТипаЦен, ЦеновойПоказатель.ТипЦен);
					КонецЕсли;
					МассивИспользуемыхТипов.Добавить(ИмяТаблицы);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивТиповЦен = Новый Массив;
	ИтоговыйТекстЗапроса       = "";
	Для Каждого ТекБазовыйТип Из СтруктураБазовыхТипов Цикл
		
		ИмяБазовогоТипаЦен = ТекБазовыйТип.Ключ;
		ИтогТекстВыборкиЦен        = "";
		Для Каждого ИмяТипаЦен Из МассивИспользуемыхТипов Цикл
			
			ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТипаЦен, "Имя");
			Если ИмяБазовогоТипаЦен = ЦеновойПоказатель.ИмяБазовогоТипаЦен Тогда
				
				ИтоговоеВыражениеЦены      = "";
				ИтоговоеВыражениеВалюты    = "";
				ИтоговоеВыражениеНормочаса = "";
				
				Для Итерация = 0 По КоличествоУровней-1 Цикл
					
					ИмяИтерации = Строка(Итерация);
					
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Валюта",   ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Валюта");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Нормочас", ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Нормочас");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Цена",     ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Цена");
					
					СтрокаЦены = СтрЗаменить(ЦеновойПоказатель.ШаблонРасчетаЦены, "*ВыражениеЦены*", "ИтоговаяТаблица.ЦенаАвторабота" + Строка(Итерация));
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ИтоговаяТаблица.ВалютаАвторабота"   + Строка(Итерация) + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Валюта,
					|	ИтоговаяТаблица.НормочасАвторабота" + Строка(Итерация) + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Нормочас,
					|	" + СтрокаЦены + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Цена";
					
					ИтоговоеВыражениеЦены = ИтоговоеВыражениеЦены + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Цена)";
					
					ИтоговоеВыражениеВалюты = ИтоговоеВыражениеВалюты + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Валюта)";
					
					ИтоговоеВыражениеНормочаса = ИтоговоеВыражениеНормочаса + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Цена)";
					
				КонецЦикла;
				
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Цена",     ИмяТипаЦен + "." + ИмяГруппировки + "Цена");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Валюта",   ИмяТипаЦен + "." + ИмяГруппировки + "Валюта");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Нормочас", ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас");
					
					Если НЕ ИмяГруппировки = "Авторабота" Тогда
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Цена";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Цена)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
						
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Валюта";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Валюта)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
						
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Нормочас";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
					КонецЕсли;
					
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ИтоговаяТаблица.Цена"            + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ИтоговаяТаблица.Валюта"          + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					//|	ИтоговаяТаблица.ВремяВыполнения" + ИмяГруппировки + " КАК " + ИмяГруппировки + "ВремяВыполнения,
					|	ИтоговаяТаблица.Нормочас"        + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
					
				КонецЦикла;
			
				ИтоговоеВыражениеЦены = " ВЫБОР 
				|	"+ ИтоговоеВыражениеЦены + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				ИтоговоеВыражениеВалюты = " ВЫБОР 
				|	" + ИтоговоеВыражениеВалюты + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				ИтоговоеВыражениеНормочаса = " ВЫБОР 
				|	" + ИтоговоеВыражениеНормочаса + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Цена";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаЦена)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Цена";
				НовоеПоле.Выражение   = ИтоговоеВыражениеЦены;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Валюта";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаВалюта)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Валюта";
				НовоеПоле.Выражение   = ИтоговоеВыражениеВалюты;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Нормочас";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаНормочас)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Нормочас";
				НовоеПоле.Выражение   = ИтоговоеВыражениеНормочаса;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
			Иначе
					
				Для Итерация = 0 По КоличествоУровней-1 Цикл
					ИмяИтерации = Строка(Итерация);
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК "    + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Валюта,
					|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК " + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Нормочас,
					|	0 КАК "                                           + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Цена";
				КонецЦикла;
				
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	0 КАК "                                           + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)  КАК "   + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					//|	0 КАК "                                           + ИмяГруппировки + "ВремяВыполнения,
					|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
			
			ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
			ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
			
			ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
			|	ИтоговаяТаблица.ВремяВыполнения" + ИмяГруппировки + " КАК " + ИмяГруппировки + "ВремяВыполнения";
			
		КонецЦикла;
			
		ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ?(ИтоговыйТекстЗапроса = "", "", "
		|ОБЪЕДИНИТЬ ВСЕ") + "
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Авторабота КАК Авторабота,
		|	" + ?(СтруктураГруппировок.Модель,                "ИтоговаяТаблица.Модель",                 СтруктураПустыхГруппировок.Модель) + " КАК Модель,
		|	" + ?(ЕстьВариантКомплектации,                    "ИтоговаяТаблица.ВариантКомплектации",    "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
		|	" + ?(СтруктураГруппировок.Цех,                   "ИтоговаяТаблица.Цех",                    СтруктураПустыхГруппировок.Цех) + " КАК Цех,
		|	" + ?(СтруктураГруппировок.ВидРемонта,            "ИтоговаяТаблица.ВидРемонта",             СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
		|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "ИтоговаяТаблица.ДоговорВзаиморасчетов",  СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов,
		|	ИтоговаяТаблица.ЭтоГруппа КАК ЭтоГруппа" + ИтогТекстВыборкиЦен + "
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ИтоговаяТаблица.ТипЦен = &ТипЦен"+ИмяБазовогоТипаЦен;
		Запрос.Параметры.Вставить("ТипЦен"+ИмяБазовогоТипаЦен, ТекБазовыйТип.Значение);
		МассивТиповЦен.Добавить(ТекБазовыйТип.Значение);
		
	КонецЦикла;
	
	Запрос.Параметры.Вставить("МассивТиповЦен", МассивТиповЦен);
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаПриоритетов.Группа КАК Группа,
	|	МАКСИМУМ(ТаблицаПриоритетов.Элемент) КАК Элемент,
	|	МАКСИМУМ(ТаблицаПриоритетов.Приоритет) КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаИерархии
	|ИЗ
	|	ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ГДЕ
	|	НЕ ТаблицаПриоритетов.ЭтоГруппа
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриоритетов.Группа
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Группа КАК Авторабота,
	|	ТаблицаИерархии.Элемент КАК Элемент,
	|	ТаблицаПриоритетов.Группа КАК Группа,
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаПриоритетов.Приоритет КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаПриоритетовИерархии
	|ИЗ
	|	ТаблицаИерархии КАК ТаблицаИерархии
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ПО
	|	ТаблицаПриоритетов.ЭтоГруппа И 
	|	ТаблицаИерархии.Группа = ТаблицаПриоритетов.Элемент
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаИерархии
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаИерархии.Авторабота КАК Авторабота,
	|	МАКСИМУМ(ТаблицаИерархии.Элемент) КАК Элемент,
	|	МАКСИМУМ(ТаблицаИерархии.Приоритет) КАК Уровень
	|ПОМЕСТИТЬ
	|	ПоляИерархии
	|ИЗ
	|	ТаблицаПриоритетовИерархии КАК ТаблицаИерархии
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИерархии.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПриоритетов.Авторабота КАК Авторабота,
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ТаблицаЦен.Валюта КАК Валюта,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенИерархии
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаПриоритетовИерархии КАК ТаблицаПриоритетов
	|ПО 
	|	ТаблицаЦен.Период <= &ДатаЦен И 
	|	ТаблицаЦен.Модель                = " + СтруктураПустыхГруппировок.Модель + " И 
	|	ТаблицаЦен.Цех                   = " + СтруктураПустыхГруппировок.Цех + " И 
	|	ТаблицаЦен.ВидРемонта            = " + СтруктураПустыхГруппировок.ВидРемонта + " И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = " + СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + " И 
	|	ТаблицаЦен.Авторабота            = ТаблицаПриоритетов.Группа
	|ГДЕ
	|	ТаблицаЦен.Период <= &ДатаЦен И 
	|	ТаблицаЦен.Модель                = " + СтруктураПустыхГруппировок.Модель + " И 
	|	ТаблицаЦен.Цех                   = " + СтруктураПустыхГруппировок.Цех + " И 
	|	ТаблицаЦен.ВидРемонта            = " + СтруктураПустыхГруппировок.ВидРемонта + " И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = " + СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + ?( МассивТиповЦен.Количество()=0, "", " И 
	|	ТаблицаЦен.ТипЦен В (&МассивТиповЦен)") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетовИерархии
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Авторабота КАК Авторабота,
	|	ТаблицаЦен.Приоритет КАК Приоритет,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ВремСрезПоследнихИерархии
	|ИЗ
	|	ТаблицаЦенИерархии КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.ТипЦен,
	|	ТаблицаЦен.Авторабота,
	|	ТаблицаЦен.Приоритет
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	МИНИМУМ(СрезПоследних.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезПоследнихИерархии
	|ИЗ
	|	ВремСрезПоследнихИерархии КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенИерархии КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Период     = ТаблицаЦен.Период И 
	|	СрезПоследних.ТипЦен     = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота И 
	|	СрезПоследних.Приоритет  = ТаблицаЦен.Приоритет
	|ГДЕ
	|	(НЕ (ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) И 
	|	ТаблицаЦен.Цена = 0))
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследних.ТипЦен,
	|	СрезПоследних.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремСрезПоследнихИерархии
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаПриоритетов.Элемент КАК Авторабота,
	|	ТаблицаПриоритетов.ВремяВыполнения КАК ВремяВыполнения,
	|	" + ?(ЕстьМодель,                "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,                   "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта,            "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов, "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ТаблицаЦен.Валюта КАК Валюта,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ПО
	|	ТаблицаПриоритетов.ЭтоГруппа = ЛОЖЬ И 
	|	ТаблицаЦен.Авторабота = ТаблицаПриоритетов.Группа
	|ГДЕ
	|	ТаблицаПриоритетов.ЭтоГруппа = ЛОЖЬ И 
	|	ТаблицаЦен.Период <= &ДатаЦен" + СтрЗаменить(ТекстОтбора, "ТаблицаЦен.Авторабота", "ТаблицаПриоритетов.Элемент") + ?(МассивТиповЦен.Количество() = 0, "", " И 
	|	ТаблицаЦен.ТипЦен В (&МассивТиповЦен)") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетов
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ВремСрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаЦен.ТипЦен,
	|	ТаблицаЦен.Приоритет,
	|	ТаблицаЦен.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МИНИМУМ(СрезПоследних.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ВремСрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Период = ТаблицаЦен.Период И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота И 
	|	СрезПоследних.Приоритет = ТаблицаЦен.Приоритет " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|ГДЕ
	|	(НЕ (ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) И 
	|	ТаблицаЦен.Цена = 0))
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов,", "") + "
	|	СрезПоследних.ТипЦен,
	|	СрезПоследних.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремСрезПоследних
	|;
	|";
	
	Если ЕстьМодель Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ПолучитьТекстТаблицыВремениВыполнения(Запрос, ТекстОтбораАвторабот);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	НормыВремени.Авторабота,
		|	НормыВремени.Модель КАК Модель,
		|	НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
		|	СрезПоследних.Модель КАК МодельВЦенах,
		|	НормыВремени.ВремяВыполнения КАК ВремяВыполнения,
		|	СрезПоследних.ТипЦен КАК ТипЦен,
		|	" + ?(ЕстьЦех,                   "СрезПоследних.Цех КАК Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет КАК ПриоритетНорм,
		|	СрезПоследних.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ
		|	ТаблицаНормВремени
		|ИЗ
		|	НормыВремениТаблицаПриоритетов КАК НормыВремени
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	СрезПоследних КАК СрезПоследних
		|ПО
		|	НормыВремени.Авторабота = СрезПоследних.Авторабота И 
		|	НормыВремени.Группа     = СрезПоследних.Модель
		|;
		|
		|ВЫБРАТЬ
		|	НормыВремени.Авторабота КАК Авторабота,
		|	НормыВремени.Модель КАК Модель,
		|	НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
		|	НормыВремени.ТипЦен КАК ТипЦен,
		|	" + ?(ЕстьЦех,                   "НормыВремени.Цех КАК Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "НормыВремени.ВидРемонта КАК ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "НормыВремени.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет КАК Приоритет,
		|	МИНИМУМ(НормыВремени.ПриоритетНорм) КАК ПриоритетНорм
		|ПОМЕСТИТЬ
		|	СрезПоследнихПоНормам
		|ИЗ
		|	ТаблицаНормВремени КАК НормыВремени
		|СГРУППИРОВАТЬ ПО
		|	НормыВремени.Авторабота,
		|	НормыВремени.Модель,
		|	НормыВремени.ВариантКомплектации,
		|	НормыВремени.ТипЦен,
		|	" + ?(ЕстьЦех,                   "НормыВремени.Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "НормыВремени.ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "НормыВремени.ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет
		|;
		|";
	КонецЕсли;
	
	ИтоговоеВыражениеВремяВыполнения = "";
	
	ТекстВыборкиЦеныГрупп              = "";
	ТекстВыборкиЦеныГруппОбъединение   = "";
	ТекстВыборкиЦеныГруппСинхронизация = "";
	Для Итерация = 0 По КоличествоУровней-1 Цикл
		
		ТекстВыборкиЦеныГрупп = ТекстВыборкиЦеныГрупп + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
		|			ТаблицаЦен.Валюта
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас.Валюта
		|	КОНЕЦ КАК ВалютаАвторабота" + Строка(Итерация) + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас
		|	КОНЕЦ КАК НормочасАвторабота" + Строка(Итерация) + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			0
		|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
		|			ТаблицаЦен.Цена
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас.Цена
		|	КОНЕЦ КАК ЦенаАвторабота" + Строка(Итерация);
		
		ТекстВыборкиЦеныГруппСинхронизация = ТекстВыборкиЦеныГруппСинхронизация + ",
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаАвторабота" + Строка(Итерация) + ",
		|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК НормочасАвторабота" + Строка(Итерация) + ",
		|	0 КАК ЦенаАвторабота" + Строка(Итерация);
		
		ТекстВыборкиЦеныГруппОбъединение = ТекстВыборкиЦеныГруппОбъединение + ",
		|	ТаблицаЦенАвторабот.ВалютаАвторабота"   + Строка(Итерация) + " КАК ВалютаАвторабота" + Строка(Итерация) + ",
		|	ТаблицаЦенАвторабот.НормочасАвторабота" + Строка(Итерация) + " КАК НормочасАвторабота" + Строка(Итерация) + ",
		|	ТаблицаЦенАвторабот.ЦенаАвторабота"     + Строка(Итерация) + " КАК ЦенаАвторабота" + Строка(Итерация);
		
	КонецЦикла;
	
	ИтоговоеВыражениеВремяВыполнения = " ВЫБОР 
	|	КОГДА МАКСИМУМ(ЭтоГруппа) = ЛОЖЬ ТОГДА МАКСИМУМ(АвтоработаВремяВыполнения)" + ИтоговоеВыражениеВремяВыполнения;
	
	НовоеПоле = ТекСхема.ПоляИтога.Добавить();
	НовоеПоле.ПутьКДанным = "ВремяВыполнения";
	НовоеПоле.Выражение   = ИтоговоеВыражениеВремяВыполнения + "
	|	ИНАЧЕ 0
	|КОНЕЦ";
	НовоеПоле.Группировки.Добавить("Авторабота");
	
	ТекстВыборкиЦены = "";
	ЕстьНеЗависемыеПоказатели = (ЕстьНеЗависемыеПоказатели И ИтоговыйТекстЗапроса="");
	Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
		
		ТекГуппировка  = МассивГруппировок[ИндексГруппировки];
		ИмяГруппировки = СокрЛП(ТекГуппировка.Поле);
		
		ТекстЦеныГруппировки = "";
		Для Инд = ИндексГруппировки+1 По МассивГруппировок.Количество()-1 Цикл
			ВложеннаяГруппировка = СокрЛП(МассивГруппировок[Инд].Поле);
			ТекстЦеныГруппировки = ТекстЦеныГруппировки + " И 
			|			ТаблицаЦенАвторабот." + ВложеннаяГруппировка + " = " + СтруктураПустыхГруппировок[ВложеннаяГруппировка];
		КонецЦикла;
		
		ПрефиксУсловия = ?(Найти(СтруктураПустыхГруппировок[ИмяГруппировки], "&")=0,"НЕ ", "");
		
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Цена
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК Цена" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Валюта
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК Валюта" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Нормочас
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
		|	КОНЕЦ КАК Нормочас" + ИмяГруппировки;
		
		Если ЕстьНеЗависемыеПоказатели Тогда
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	ВЫБОР
			|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.ВремяВыполнения
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ КАК " + ИмяГруппировки + "ВремяВыполнения";
		Иначе
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	ВЫБОР
			|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.ВремяВыполнения
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ КАК ВремяВыполнения" + ИмяГруппировки;
		КонецЕсли;
		
		ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяГруппировки + "ВремяВыполнения", ИмяГруппировки + "ВремяВыполнения");
		
		Если НЕ ИмяГруппировки = "Авторабота" Тогда
			НовоеПоле = ТекСхема.ПоляИтога.Добавить();
			НовоеПоле.ПутьКДанным = "ВремяВыполнения";
			НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяГруппировки + "ВремяВыполнения)";
			НовоеПоле.Группировки.Добавить(ИмяГруппировки);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаЦенАвторабот.Авторабота КАК Авторабота,
	|	ТаблицаЦенАвторабот.ТипЦен КАК ТипЦен,
	|	" + ?(СтруктураГруппировок.Модель,                "ТаблицаЦенАвторабот.Модель",              СтруктураПустыхГруппировок.Модель) + " КАК Модель,
	|	" + ?(ЕстьВариантКомплектации,                    "ТаблицаЦенАвторабот.ВариантКомплектации", "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
	|	" + ?(СтруктураГруппировок.Цех,                   "ТаблицаЦенАвторабот.Цех",               СтруктураПустыхГруппировок.Цех) + " КАК Цех,
	|	" + ?(СтруктураГруппировок.ВидРемонта,            "ТаблицаЦенАвторабот.ВидРемонта",          СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "ТаблицаЦенАвторабот.ДоговорВзаиморасчетов",  СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦенАвторабот.ЭтоГруппа КАК ЭтоГруппа,
	|	ТаблицаЦенАвторабот.Валюта КАК Валюта,
	|	ТаблицаЦенАвторабот.ВремяВыполнения КАК ВремяВыполнения,
	|	ТаблицаЦенАвторабот.Нормочас КАК Нормочас,
	|	ТаблицаЦенАвторабот.Цена КАК Цена" + ТекстВыборкиЦены + ТекстВыборкиЦеныГруппОбъединение + ?(ИтоговыйТекстЗапроса = "", "", "
	|ПОМЕСТИТЬ
	|	ИтоговаяТаблица") + "
	|ИЗ(ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,                "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьВариантКомплектации,                    "ЕСТЬNULL(НормыВремени.ВариантКомплектации, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)) КАК ВариантКомплектации,", "") + "
	|	" + ?(СтруктураГруппировок.Цех,                   "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта,            "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ЛОЖЬ КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Валюта
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Валюта
	|	КОНЕЦ КАК Валюта,
	|	" + ?(ЕстьВариантКомплектации, "
	|	ВЫБОР
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА
	|			ТаблицаЦен.ВремяВыполнения
	|		ИНАЧЕ
	|			НормыВремени.ВремяВыполнения
	|	КОНЕЦ КАК ВремяВыполнения,","
	|	ТаблицаЦен.ВремяВыполнения КАК ВремяВыполнения,")+"
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Цена" + ?(ЕстьВариантКомплектации, "
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ТаблицаЦен.ВремяВыполнения = 0 ТОГДА
	|			ТаблицаЦен.Нормочас.Цена
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА
	|			ТаблицаЦен.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	|		ИНАЧЕ
	|			НормыВремени.ВремяВыполнения * ТаблицаЦен.Нормочас.Цена", "
	|		КОГДА ТаблицаЦен.ВремяВыполнения = 0 ТОГДА
	|			ТаблицаЦен.Нормочас.Цена
	|		ИНАЧЕ
	|			ТаблицаЦен.ВремяВыполнения * ТаблицаЦен.Нормочас.Цена")+"
	|	КОНЕЦ КАК Цена"+ТекстВыборкиЦеныГруппСинхронизация+"
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен  = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Приоритет = ТаблицаЦен.Приоритет И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|	" + ?(ЕстьВариантКомплектации, "
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.Автоработы.НормыВремени КАК НормыВремени
	|ПО
	|	СрезПоследних.Авторабота = НормыВремени.Ссылка" + ?(ЕстьМодель, " И 
	|	СрезПоследних.Модель     = НормыВремени.Модель", ""), "") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ " + ?(ЕстьВариантКомплектации И ЕстьМодель, "
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	СрезПоследних.Модель КАК Модель,
	|	СрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	" + ?(СтруктураГруппировок.Цех,              "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта,         "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ЛОЖЬ КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Валюта
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ТаблицаНормВремени.ВремяВыполнения КАК ВремяВыполнения,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Цена
	|		ИНАЧЕ
	|			ТаблицаНормВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	|	КОНЕЦ КАК Цена"+ТекстВыборкиЦеныГруппСинхронизация+"
	|ИЗ
	|	СрезПоследнихПоНормам КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНормВремени КАК ТаблицаНормВремени
	|ПО
	|	СрезПоследних.ТипЦен = ТаблицаНормВремени.ТипЦен И 
	|	СрезПоследних.Авторабота = ТаблицаНормВремени.Авторабота И 
	|	СрезПоследних.ВариантКомплектации = ТаблицаНормВремени.ВариантКомплектации И 
	|	СрезПоследних.Модель = ТаблицаНормВремени.Модель И 
	|	СрезПоследних.Приоритет = ТаблицаНормВремени.Приоритет И 
	|	СрезПоследних.ПриоритетНорм = ТаблицаНормВремени.ПриоритетНорм" + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаНормВремени.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаНормВремени.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаНормВремени.ДоговорВзаиморасчетов", "") + "
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО 
	|	ТаблицаНормВремени.ТипЦен              = ТаблицаЦен.ТипЦен И 
	|	ТаблицаНормВремени.Авторабота          = ТаблицаЦен.Авторабота И 
	|	ТаблицаНормВремени.МодельВЦенах        = ТаблицаЦен.Модель И 
	|	ТаблицаНормВремени.Приоритет           = ТаблицаЦен.Приоритет" + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта               = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов    = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|ГДЕ
	|	НЕ ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ", "") + "
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ПоляИерархии.Элемент КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,             СтруктураПустыхГруппировок.Модель + ",", "") + "
	|	" + ?(ЕстьВариантКомплектации,                 "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка) КАК ВариантКомплектации,", "") + "
	|	" + ?(СтруктураГруппировок.Цех,              СтруктураПустыхГруппировок.Цех + ",", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта,         СтруктураПустыхГруппировок.ВидРемонта + ",", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + ",", "") + "
	|	ИСТИНА КАК ЭтоГруппа,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
	|	0 КАК ВремяВыполнения,
	|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК Нормочас,
	|	0" + ТекстВыборкиЦеныГрупп + "
	|ИЗ
	|	СрезПоследнихИерархии КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦенИерархии КАК ТаблицаЦен
	|ПО 
	|	СрезПоследних.ТипЦен     = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Приоритет  = ТаблицаЦен.Приоритет И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота 
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ПоляИерархии КАК ПоляИерархии
	|ПО
	|	СрезПоследних.Авторабота = ПоляИерархии.Авторабота) КАК ТаблицаЦенАвторабот" + ?(ИтоговыйТекстЗапроса = "", "", "
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|" + ?(ЕстьВариантКомплектации И ЕстьМодель, "
	|УНИЧТОЖИТЬ
	|	СрезПоследнихПоНормам
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаНормВремени
	|;
	|", "") + "
	|УНИЧТОЖИТЬ
	|	СрезПоследнихИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦенИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ПоляИерархии
	|;
	|" + ИтоговыйТекстЗапроса);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросТолькоИерархия(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок)
	
	КоличествоУровней    = 0;
	ТекстОтбораАвторабот = ТекстОтбораАвторабот + " И 
	|	Автоработы.ЭтоГруппа = ИСТИНА";
	
	ТекстЗапроса = ПолучитьТекстТаблицыАвторабот(Запрос, КоличествоУровней, ТекстОтбораАвторабот);
	
	ГруппировкаАвторабот = МассивГруппировок[ИндексРаботы];
	
	ЕстьМодель                = СтруктураГруппировок.Модель;
	ЕстьЦех                   = СтруктураГруппировок.Цех;
	ЕстьВидРемонта            = СтруктураГруппировок.ВидРемонта;
	ЕстьДоговорВзаиморасчетов = СтруктураГруппировок.ДоговорВзаиморасчетов;
	ЕстьВариантКомплектации   = СтруктураГруппировок.ВариантКомплектации;
	
	МассивИспользуемыхТипов = Новый Массив;
	СтруктураБазовыхТипов   = Новый Структура;
	Показатели = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	Для Каждого ТекГруппа Из Показатели Цикл
		
		Если НЕ ТекГруппа.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекГруппа) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			Продолжить;
		Иначе
			Для Каждого ТекПоказатель Из ТекГруппа.Элементы Цикл
				Если ТекПоказатель.Использование Тогда
					ИмяТаблицы = Строка(ТекГруппа.Поле);
					ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТаблицы, "Имя");
					Если СтруктураБазовыхТипов.Свойство(ЦеновойПоказатель.ИмяБазовогоТипаЦен) = Ложь Тогда
						СтруктураБазовыхТипов.Вставить(ЦеновойПоказатель.ИмяБазовогоТипаЦен, ЦеновойПоказатель.ТипЦен);
					КонецЕсли;
					МассивИспользуемыхТипов.Добавить(ИмяТаблицы);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивТиповЦен = Новый Массив;
	ИтоговыйТекстЗапроса       = "";
	Для Каждого ТекБазовыйТип Из СтруктураБазовыхТипов Цикл
		
		ИмяБазовогоТипаЦен = ТекБазовыйТип.Ключ;
		ИтогТекстВыборкиЦен        = "";
		
		Для Каждого ИмяТипаЦен Из МассивИспользуемыхТипов Цикл
			
			ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТипаЦен, "Имя");
			Если ИмяБазовогоТипаЦен = ЦеновойПоказатель.ИмяБазовогоТипаЦен Тогда
				
				ИтоговоеВыражениеЦены      = "";
				ИтоговоеВыражениеВалюты    = "";
				ИтоговоеВыражениеНормочаса = "";
				
				Для Итерация = 0 По КоличествоУровней-1 Цикл
					
					ИмяИтерации = Строка(Итерация);
					
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Валюта",   ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Валюта");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Нормочас", ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Нормочас");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Цена",     ИмяТипаЦен+".Авторабота"+ИмяИтерации+"Цена");
					
					СтрокаЦены = СтрЗаменить(ЦеновойПоказатель.ШаблонРасчетаЦены, "*ВыражениеЦены*", "ИтоговаяТаблица.ЦенаАвторабота" + Строка(Итерация));
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ИтоговаяТаблица.ВалютаАвторабота"   + Строка(Итерация) + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Валюта,
					|	ИтоговаяТаблица.НормочасАвторабота" + Строка(Итерация) + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Нормочас,
					|	" + СтрокаЦены + " КАК " + ИмяТипаЦен + "Авторабота"+ИмяИтерации+"Цена";
					
					ИтоговоеВыражениеЦены = ИтоговоеВыражениеЦены + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Цена)";
					
					ИтоговоеВыражениеВалюты = ИтоговоеВыражениеВалюты + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Валюта)";
					
					ИтоговоеВыражениеНормочаса = ИтоговоеВыражениеНормочаса + "
					|	КОГДА УровеньВГруппировке()="+Строка(Итерация)+" ТОГДА МАКСИМУМ(" + ИмяТипаЦен + ".Авторабота"+ИмяИтерации+"Цена)";
					
				КонецЦикла;
				
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Цена",     ИмяТипаЦен + "." + ИмяГруппировки + "Цена");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Валюта",   ИмяТипаЦен + "." + ИмяГруппировки + "Валюта");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Нормочас", ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас");
					
					Если НЕ ИмяГруппировки = "Авторабота" Тогда
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Цена";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Цена)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
						
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Валюта";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Валюта)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
						
						НовоеПоле = ТекСхема.ПоляИтога.Добавить();
						НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Нормочас";
						НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас)";
						НовоеПоле.Группировки.Добавить(ИмяГруппировки);
					КонецЕсли;
					
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ИтоговаяТаблица.Цена"            + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ИтоговаяТаблица.Валюта"          + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					|	ИтоговаяТаблица.Нормочас"        + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
					
				КонецЦикла;
				
				ИтоговоеВыражениеЦены = " ВЫБОР 
				|	"+ ИтоговоеВыражениеЦены + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				ИтоговоеВыражениеВалюты = " ВЫБОР 
				|	" + ИтоговоеВыражениеВалюты + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				ИтоговоеВыражениеНормочаса = " ВЫБОР 
				|	" + ИтоговоеВыражениеНормочаса + "
				|	ИНАЧЕ 0
				|КОНЕЦ";
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Цена";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаЦена)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Цена";
				НовоеПоле.Выражение   = ИтоговоеВыражениеЦены;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Валюта";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаВалюта)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Валюта";
				НовоеПоле.Выражение   = ИтоговоеВыражениеВалюты;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Нормочас";
				НовоеПоле.Выражение   = "МАКСИМУМ("+ИмяТипаЦен+".АвтоработаНормочас)";
				НовоеПоле.Группировки.Добавить("Авторабота");
				
				НовоеПоле = ТекСхема.ПоляИтога.Добавить();
				НовоеПоле.ПутьКДанным = ИмяТипаЦен+".Нормочас";
				НовоеПоле.Выражение   = ИтоговоеВыражениеНормочаса;
				НовоеПоле.Группировки.Добавить("Авторабота Иерархия");
				
			Иначе
				
				Для Итерация = 0 По КоличествоУровней-1 Цикл
					ИмяИтерации = Строка(Итерация);
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК "    + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Валюта,
					|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК " + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Нормочас,
					|	0 КАК "                                           + ИмяТипаЦен + "Авторабота" + ИмяИтерации + "Цена";
				КонецЦикла;
				
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	0 КАК "                                           + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)  КАК "   + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ?(ИтоговыйТекстЗапроса = "", "", "
		|ОБЪЕДИНИТЬ ВСЕ") + "
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Авторабота КАК Авторабота,
		|	" + ?(СтруктураГруппировок.Модель,                "ИтоговаяТаблица.Модель",                 СтруктураПустыхГруппировок.Модель) + " КАК Модель,
		|	" + ?(ЕстьВариантКомплектации,                    "ИтоговаяТаблица.ВариантКомплектации",    "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
		|	" + ?(СтруктураГруппировок.Цех,                   "ИтоговаяТаблица.Цех",                    СтруктураПустыхГруппировок.Цех) + " КАК Цех,
		|	" + ?(СтруктураГруппировок.ВидРемонта,            "ИтоговаяТаблица.ВидРемонта",             СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
		|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "ИтоговаяТаблица.ДоговорВзаиморасчетов",  СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов" + ИтогТекстВыборкиЦен + "
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ИтоговаяТаблица.ТипЦен = &ТипЦен"+ИмяБазовогоТипаЦен;
		Запрос.Параметры.Вставить("ТипЦен"+ИмяБазовогоТипаЦен, ТекБазовыйТип.Значение);
		МассивТиповЦен.Добавить(ТекБазовыйТип.Значение);
		
	КонецЦикла;
	
	Запрос.Параметры.Вставить("МассивТиповЦен", МассивТиповЦен);
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаПриоритетов.Группа КАК Элемент
	|ПОМЕСТИТЬ
	|	ОтборПервогоУровня
	|ИЗ
	|	ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПриоритетов.Группа
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) = 1
	|ИНДЕКСИРОВАТЬ ПО
	|	Элемент
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПриоритетов.Элемент КАК Элемент,
	|	ТаблицаПриоритетов.Группа КАК Группа,
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаПриоритетов.Приоритет КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаПриоритетовИерархии
	|ИЗ
	|	ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ГДЕ
	|	(НЕ ТаблицаПриоритетов.Элемент В (ВЫБРАТЬ ОтборПервогоУровня.Элемент ИЗ ОтборПервогоУровня КАК ОтборПервогоУровня))
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаПриоритетов.Группа
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаПриоритетов.Элемент КАК Элемент,
	|	ТаблицаПриоритетов.Группа КАК Группа,
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ
	|	ТаблицаПриоритетовПервыйУровень
	|ИЗ
	|	ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ГДЕ
	|	ТаблицаПриоритетов.Элемент В (ВЫБРАТЬ ОтборПервогоУровня.Элемент ИЗ ОтборПервогоУровня КАК ОтборПервогоУровня)
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаПриоритетов.Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетов
	|;
	|
	|УНИЧТОЖИТЬ
	|	ОтборПервогоУровня
	|;
	|
	|ВЫБРАТЬ
	|	ОбъединенныйЗапрос.Группа КАК Группа,
	|	МАКСИМУМ(ОбъединенныйЗапрос.Авторабота) КАК Авторабота,
	|	МАКСИМУМ(ОбъединенныйЗапрос.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	ПоляИерархии
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПриоритетов.Элемент КАК Группа,
	|		ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка) КАК Авторабота,
	|		МАКСИМУМ(ТаблицаПриоритетов.Уровень) КАК Уровень
	|	ИЗ
	|		ТаблицаПриоритетовИерархии КАК ТаблицаПриоритетов
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПриоритетов.Элемент
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаПриоритетов.Группа,
	|		МАКСИМУМ(ТаблицаПриоритетов.Элемент),
	|		0
	|	ИЗ
	|		ТаблицаПриоритетовПервыйУровень КАК ТаблицаПриоритетов
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПриоритетов.Группа) КАК ОбъединенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ОбъединенныйЗапрос.Группа
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаПриоритетов.Элемент КАК Авторабота,
	|	ТаблицаПриоритетов.Уровень КАК Уровень,
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ТаблицаЦен.Валюта КАК Валюта,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенИерархии
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаПриоритетовИерархии КАК ТаблицаПриоритетов
	|ПО
	|	ТаблицаЦен.Период<=&ДатаЦен И 
	|	ТаблицаЦен.Модель = "             + СтруктураПустыхГруппировок.Модель + " И 
	|	ТаблицаЦен.Цех = "              + СтруктураПустыхГруппировок.Цех + " И 
	|	ТаблицаЦен.ВидРемонта = "         + СтруктураПустыхГруппировок.ВидРемонта + " И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = " + СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + " И 
	|	ТаблицаЦен.Авторабота = ТаблицаПриоритетов.Группа
	|ГДЕ
	|	ТаблицаЦен.Период<=&ДатаЦен И
	|	ТаблицаЦен.Модель = "             + СтруктураПустыхГруппировок.Модель + " И 
	|	ТаблицаЦен.Цех = "              + СтруктураПустыхГруппировок.Цех + " И 
	|	ТаблицаЦен.ВидРемонта = "         + СтруктураПустыхГруппировок.ВидРемонта + " И 
	|	ТаблицаЦен.ДоговорВзаиморасчетов = " + СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + ?( МассивТиповЦен.Количество()=0, "", " И 
	|	ТаблицаЦен.ТипЦен В (&МассивТиповЦен)") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетовИерархии
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Авторабота КАК Авторабота,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ВремСрезПоследнихИерархии
	|ИЗ
	|	ТаблицаЦенИерархии КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.ТипЦен,
	|	ТаблицаЦен.Авторабота,
	|	ТаблицаЦен.Приоритет
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	МИНИМУМ(СрезПоследних.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезПоследнихИерархии
	|ИЗ
	|	ВремСрезПоследнихИерархии КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенИерархии КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.Период     = ТаблицаЦен.Период И 
	|	СрезПоследних.ТипЦен     = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота И 
	|	СрезПоследних.Приоритет  = ТаблицаЦен.Приоритет
	|ГДЕ
	|	(НЕ (ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) И 
	|	ТаблицаЦен.Цена = 0))
	|СГРУППИРОВАТЬ ПО
	|	СрезПоследних.ТипЦен,
	|	СрезПоследних.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремСрезПоследнихИерархии
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаПриоритетов.Элемент КАК Авторабота,
	|	" + ?(ЕстьМодель,                "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,                   "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта,            "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов, "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ТаблицаЦен.Валюта КАК Валюта,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетовПервыйУровень КАК ТаблицаПриоритетов
	|ПО
	|	ТаблицаЦен.Авторабота = ТаблицаПриоритетов.Группа
	|ГДЕ
	|	ТаблицаЦен.Период<=&ДатаЦен" + СтрЗаменить(ТекстОтбора, "ТаблицаЦен.Авторабота", "ТаблицаПриоритетов.Элемент") + ?( МассивТиповЦен.Количество()=0, "", " И 
	|	ТаблицаЦен.ТипЦен В (&МассивТиповЦен)") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетовПервыйУровень
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ВремСрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаЦен.ТипЦен,
	|	ТаблицаЦен.Приоритет,
	|	ТаблицаЦен.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель,",
	|	Модель","") + "
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МИНИМУМ(СрезПоследних.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ВремСрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Период = ТаблицаЦен.Период И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота И 
	|	СрезПоследних.Приоритет = ТаблицаЦен.Приоритет " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|ГДЕ
	|	(НЕ (ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) И 
	|	ТаблицаЦен.Цена = 0))
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов,", "") + "
	|	СрезПоследних.ТипЦен,
	|	СрезПоследних.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремСрезПоследних
	|;
	|";
	
	ИтоговоеВыражениеЦены = "";
	ИтоговоеВыражениеВалюты = "";
	ИтоговоеВыражениеНормочаса = "";
	
	ТекстВыборкиЦеныГрупп              = "";
	ТекстВыборкиЦеныГруппСинхронизация = "";
	ТекстВыборкиЦеныГруппОбъединение   = "";
	Для Итерация = 0 По КоличествоУровней-1 Цикл
		
		ТекстВыборкиЦеныГрупп = ТекстВыборкиЦеныГрупп + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
		|			ТаблицаЦен.Валюта
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас.Валюта
		|	КОНЕЦ КАК ВалютаАвторабота" + Строка(Итерация) + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас
		|	КОНЕЦ КАК НормочасАвторабота" + Строка(Итерация) + ",
		|	ВЫБОР
		|		КОГДА НЕ ПоляИерархии.Уровень = " + Строка(Итерация) + " ТОГДА
		|			0
		|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
		|			ТаблицаЦен.Цена
		|		ИНАЧЕ
		|			ТаблицаЦен.Нормочас.Цена
		|	КОНЕЦ КАК ЦенаАвторабота" + Строка(Итерация);
		
		Если Итерация>0 Тогда
			ТекстВыборкиЦеныГруппСинхронизация = ТекстВыборкиЦеныГруппСинхронизация + ",
			|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаАвторабота" + Строка(Итерация) + ",
			|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК НормочасАвторабота" + Строка(Итерация) + ",
			|	0 КАК ЦенаАвторабота" + Строка(Итерация);
		КонецЕсли;
		
		ТекстВыборкиЦеныГруппОбъединение = ТекстВыборкиЦеныГруппОбъединение + ",
		|	ТаблицаЦенАвторабот.ВалютаАвторабота"   + Строка(Итерация) + " КАК ВалютаАвторабота" + Строка(Итерация) + ",
		|	ТаблицаЦенАвторабот.НормочасАвторабота" + Строка(Итерация) + " КАК НормочасАвторабота" + Строка(Итерация) + ",
		|	ТаблицаЦенАвторабот.ЦенаАвторабота"     + Строка(Итерация) + " КАК ЦенаАвторабота" + Строка(Итерация);
		
	КонецЦикла;
	
	НовоеПоле = ТекСхема.ПоляИтога.Добавить();
	НовоеПоле.ПутьКДанным = "ВремяВыполнения";
	НовоеПоле.Выражение   = "0";
	НовоеПоле.Группировки.Добавить("Авторабота");
	
	ТекстВыборкиЦены = "";
	
	Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
		
		ТекГуппировка = МассивГруппировок[ИндексГруппировки];
		ИмяГруппировки = СокрЛП(ТекГуппировка.Поле);
		
		ТекстЦеныГруппировки = "";
		Для Инд = ИндексГруппировки+1 По МассивГруппировок.Количество()-1 Цикл
			
			ВложеннаяГруппировка = СокрЛП(МассивГруппировок[Инд].Поле);
			Если ВложеннаяГруппировка = "ВариантКомплектации" Тогда
				Продолжить;
			КонецЕсли;
			ТекстЦеныГруппировки = ТекстЦеныГруппировки + " И 
			|			ТаблицаЦенАвторабот." + ВложеннаяГруппировка + " = " + СтруктураПустыхГруппировок[ВложеннаяГруппировка];
		КонецЦикла;
		
		ПрефиксУсловия = ?(Найти(СтруктураПустыхГруппировок[ИмяГруппировки], "&")=0,"НЕ ", "");
		
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Цена
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК Цена" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Валюта
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК Валюта" + ИмяГруппировки + ",
		//|	0 КАК ВремяВыполнения" + ИмяГруппировки + ",
		//|	ВЫБОР
		//|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.ВремяВыполнения
		//|		ИНАЧЕ
		//|			0
		//|	КОНЕЦ КАК ВремяВыполнения" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Нормочас
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
		|	КОНЕЦ КАК Нормочас" + ИмяГруппировки;
		
		//ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", "Цена" + ИмяГруппировки);
		//ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", "Валюта" + ИмяГруппировки);
		//ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", "ВремяВыполнения" + ИмяГруппировки);
		//ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", "Нормочас" + ИмяГруппировки);
		
		Если ИмяГруппировки = "Авторабота" Тогда
			Если КоличествоУровней>0 Тогда
				ТекстВыборкиЦеныГруппСинхронизация = ТекстВыборкиЦеныГруппСинхронизация + ",
				|	ВЫБОР
				|		КОГДА (НЕ СрезПоследних.Авторабота = " + СтруктураПустыхГруппировок["Авторабота"] + СтрЗаменить(ТекстЦеныГруппировки, "ТаблицаЦенАвторабот.", "СрезПоследних.") + ") ТОГДА 
				|			ТаблицаЦен.Валюта
				|		ИНАЧЕ
				|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
				|	КОНЕЦ КАК ВалютаАвторабота0,
				|	ВЫБОР
				|		КОГДА (НЕ СрезПоследних.Авторабота = " + СтруктураПустыхГруппировок["Авторабота"] + СтрЗаменить(ТекстЦеныГруппировки, "ТаблицаЦенАвторабот.", "СрезПоследних.") + ") ТОГДА ТаблицаЦен.Нормочас
				|		ИНАЧЕ
				|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
				|	КОНЕЦ КАК НормочасАвторабота0,
				|	ВЫБОР
				|		КОГДА (НЕ СрезПоследних.Авторабота = " + СтруктураПустыхГруппировок["Авторабота"] + СтрЗаменить(ТекстЦеныГруппировки, "ТаблицаЦенАвторабот.", "СрезПоследних.") + ") ТОГДА
				|			ТаблицаЦен.Цена
				|		ИНАЧЕ
				|			0
				|	КОНЕЦ КАК ЦенаАвторабота0";
			КонецЕсли;
		Иначе
			//НовоеПоле = ТекСхема.ПоляИтога.Добавить();
			//НовоеПоле.ПутьКДанным = "Цена";
			//НовоеПоле.Выражение   = "МАКСИМУМ(Цена" + ИмяГруппировки + ")";
			//НовоеПоле.Группировки.Добавить(ИмяГруппировки);
			//НовоеПоле = ТекСхема.ПоляИтога.Добавить();
			//НовоеПоле.ПутьКДанным = "Валюта";
			//НовоеПоле.Выражение   = "МАКСИМУМ(Валюта" + ИмяГруппировки + ")";
			//НовоеПоле.Группировки.Добавить(ИмяГруппировки);
			НовоеПоле = ТекСхема.ПоляИтога.Добавить();
			НовоеПоле.ПутьКДанным = "ВремяВыполнения";
			//НовоеПоле.Выражение   = "МАКСИМУМ(ВремяВыполнения" + ИмяГруппировки + ")";
			НовоеПоле.Выражение   = "0";
			НовоеПоле.Группировки.Добавить(ИмяГруппировки);
			//НовоеПоле = ТекСхема.ПоляИтога.Добавить();
			//НовоеПоле.ПутьКДанным = "Нормочас";
			//НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяГруппировки + "Нормочас)";
			//НовоеПоле.Группировки.Добавить(ИмяГруппировки);
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаЦенАвторабот.ТипЦен КАК ТипЦен,
	|	ТаблицаЦенАвторабот.Авторабота КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,             "ТаблицаЦенАвторабот.Модель",             СтруктураПустыхГруппировок.Модель) + " КАК Модель,
	|	" + ?(ЕстьВариантКомплектации,                 "ТаблицаЦенАвторабот.ВариантКомплектации", "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
	|	" + ?(СтруктураГруппировок.Цех,              "ТаблицаЦенАвторабот.Цех",                СтруктураПустыхГруппировок.Цех) + " КАК Цех,
	|	" + ?(СтруктураГруппировок.ВидРемонта,         "ТаблицаЦенАвторабот.ВидРемонта",         СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "ТаблицаЦенАвторабот.ДоговорВзаиморасчетов", СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦенАвторабот.Валюта КАК Валюта,
	//|	ТаблицаЦенАвторабот.ВремяВыполнения КАК ВремяВыполнения,
	|	0 КАК ВремяВыполнения,
	|	ТаблицаЦенАвторабот.Нормочас КАК Нормочас,
	|	ТаблицаЦенАвторабот.Цена КАК Цена" + ТекстВыборкиЦены + ТекстВыборкиЦеныГруппОбъединение + ?(ИтоговыйТекстЗапроса = "", "", "
	|ПОМЕСТИТЬ
	|	ИтоговаяТаблица") + "
	|ИЗ(ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,                "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьВариантКомплектации,                    "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка) КАК ВариантКомплектации,", "") + "
	|	" + ?(СтруктураГруппировок.Цех,                   "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта,            "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Валюта
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Валюта
	|	КОНЕЦ КАК Валюта,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА 0" + ?(СтруктураГруппировок.Модель, "
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.ВремяВыполнения
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения","
	//|		ИНАЧЕ ТаблицаЦен.ВремяВыполнения")+"
	//|	КОНЕЦ КАК ВремяВыполнения,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА 0" + ?(СтруктураГруппировок.Модель, "
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ОбщиеНормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА 0
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ОбщиеНормыВремени.ВремяВыполнения
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения","
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА 0
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения")+"
	//|	КОНЕЦ КАК ВремяВыполнения,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА ТаблицаЦен.Цена" + ?(СтруктураГруппировок.Модель, "
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ОбщиеНормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.Нормочас.Цена
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ОбщиеНормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена","
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.Нормочас.Цена
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена")+"
	//|	КОНЕЦ КАК Цена"+ТекстВыборкиЦеныГруппСинхронизация+"
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Цена
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Цена
	|	КОНЕЦ КАК Цена"+ТекстВыборкиЦеныГруппСинхронизация+"
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен     = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Приоритет  = ТаблицаЦен.Приоритет И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель     = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех        = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	ЕСТЬNULL(ПоляИерархии.Авторабота,      СрезПоследних.Авторабота) КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,     СтруктураПустыхГруппировок.Модель + ",", "") + "
	|	" + ?(ЕстьВариантКомплектации,         "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка) КАК ВариантКомплектации,", "") + "
	|	" + ?(СтруктураГруппировок.Цех,        СтруктураПустыхГруппировок.Цех + ",", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта, СтруктураПустыхГруппировок.ВидРемонта + ",", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов,    СтруктураПустыхГруппировок.ДоговорВзаиморасчетов + ",", "") + "
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
	|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК Нормочас,
	|	0" + ТекстВыборкиЦеныГрупп + "
	|ИЗ
	|	СрезПоследнихИерархии КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦенИерархии КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен     = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Приоритет  = ТаблицаЦен.Приоритет И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота 
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ПоляИерархии КАК ПоляИерархии
	|ПО
	|	ТаблицаЦен.Авторабота = ПоляИерархии.Группа) КАК ТаблицаЦенАвторабот
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследнихИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦенИерархии
	|;
	|
	|УНИЧТОЖИТЬ
	|	ПоляИерархии
	|;
	|" + ИтоговыйТекстЗапроса;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросЭлементы(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок)
	
	КоличествоУровней = 0;
	ТекстОтбораНормы = ТекстОтбораАвторабот;
	ТекстОтбораАвторабот = ТекстОтбораАвторабот + " И 
	|	Автоработы.ЭтоГруппа = ЛОЖЬ";
	
	ТекстЗапроса = ПолучитьТекстТаблицыАвторабот(Запрос, КоличествоУровней, ТекстОтбораАвторабот);
	
	ГруппировкаАвторабот = МассивГруппировок[ИндексРаботы];
	
	ЕстьМодель                = СтруктураГруппировок.Модель;
	ЕстьЦех                   = СтруктураГруппировок.Цех;
	ЕстьВидРемонта            = СтруктураГруппировок.ВидРемонта;
	ЕстьДоговорВзаиморасчетов = СтруктураГруппировок.ДоговорВзаиморасчетов;
	ЕстьВариантКомплектации   = СтруктураГруппировок.ВариантКомплектации;
	
	МассивИспользуемыхТипов = Новый Массив;
	СтруктураБазовыхТипов   = Новый Структура;
	//ИмяБазовогоТипаЦен = ЦеновойПоказатель.ИмяБазовогоТипаЦен;
	Показатели = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	ЕстьНеЗависемыеПоказатели = Ложь;
	Для Каждого ТекГруппа Из Показатели Цикл
		
		Если НЕ ТекГруппа.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекГруппа) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
			ЕстьНеЗависемыеПоказатели = Истина;
			Продолжить;
		Иначе
			Для Каждого ТекПоказатель Из ТекГруппа.Элементы Цикл
				Если ТекПоказатель.Использование Тогда
					ИмяТаблицы = Строка(ТекГруппа.Поле);
					ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТаблицы, "Имя");
					Если СтруктураБазовыхТипов.Свойство(ЦеновойПоказатель.ИмяБазовогоТипаЦен) = Ложь Тогда
						СтруктураБазовыхТипов.Вставить(ЦеновойПоказатель.ИмяБазовогоТипаЦен, ЦеновойПоказатель.ТипЦен);
					КонецЕсли;
					МассивИспользуемыхТипов.Добавить(ИмяТаблицы);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивТиповЦен = Новый Массив;
	ИтоговыйТекстЗапроса       = "";
	Для Каждого ТекБазовыйТип Из СтруктураБазовыхТипов Цикл
		
		ИмяБазовогоТипаЦен = ТекБазовыйТип.Ключ;
		ИтогТекстВыборкиЦен        = "";
		
		Для Каждого ИмяТипаЦен Из МассивИспользуемыхТипов Цикл
			
			ЦеновойПоказатель = ТаблицаПараметровТипаЦен.Найти(ИмяТипаЦен, "Имя");
			Если ИмяБазовогоТипаЦен = ЦеновойПоказатель.ИмяБазовогоТипаЦен Тогда
				
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Цена",     ИмяТипаЦен + "." + ИмяГруппировки + "Цена");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Валюта",   ИмяТипаЦен + "." + ИмяГруппировки + "Валюта");
					ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяТипаЦен + ИмяГруппировки + "Нормочас", ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас");
					
					
					НовоеПоле = ТекСхема.ПоляИтога.Добавить();
					НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Цена";
					НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Цена)";
					НовоеПоле.Группировки.Добавить(ИмяГруппировки);
					
					НовоеПоле = ТекСхема.ПоляИтога.Добавить();
					НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Валюта";
					НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Валюта)";
					НовоеПоле.Группировки.Добавить(ИмяГруппировки);
					
					НовоеПоле = ТекСхема.ПоляИтога.Добавить();
					НовоеПоле.ПутьКДанным = ИмяТипаЦен + ".Нормочас";
					НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяТипаЦен + "." + ИмяГруппировки + "Нормочас)";
					НовоеПоле.Группировки.Добавить(ИмяГруппировки);
					
					
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	ИтоговаяТаблица.Цена"            + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ИтоговаяТаблица.Валюта"          + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					//|	ИтоговаяТаблица.ВремяВыполнения" + ИмяГруппировки + " КАК " + ИмяГруппировки + "ВремяВыполнения,
					|	ИтоговаяТаблица.Нормочас"        + ИмяГруппировки + " КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
					
				КонецЦикла;
				
			Иначе
				Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
					
					ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
					ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
					ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
					|	0 КАК "                                           + ИмяТипаЦен + ИмяГруппировки + "Цена,
					|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)  КАК "   + ИмяТипаЦен + ИмяГруппировки + "Валюта,
					|	ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) КАК " + ИмяТипаЦен + ИмяГруппировки + "Нормочас";
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
			
			ТекГуппировка     = МассивГруппировок[ИндексГруппировки];
			ИмяГруппировки    = СокрЛП(ТекГуппировка.Поле);
			
			ИтогТекстВыборкиЦен = ИтогТекстВыборкиЦен + ",
			|	ИтоговаяТаблица.ВремяВыполнения" + ИмяГруппировки + " КАК " + ИмяГруппировки + "ВремяВыполнения";
			
		КонецЦикла;
		
		ИтоговыйТекстЗапроса = ИтоговыйТекстЗапроса + ?(ИтоговыйТекстЗапроса = "", "", "
		|ОБЪЕДИНИТЬ ВСЕ") + "
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Авторабота КАК Авторабота,
		|	" + ?(СтруктураГруппировок.Модель,                "ИтоговаяТаблица.Модель",                 СтруктураПустыхГруппировок.Модель) + " КАК Модель,
		|	" + ?(ЕстьВариантКомплектации,                    "ИтоговаяТаблица.ВариантКомплектации",    "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
		|	" + ?(СтруктураГруппировок.Цех,                   "ИтоговаяТаблица.Цех",                    СтруктураПустыхГруппировок.Цех) + " КАК Цех,
		|	" + ?(СтруктураГруппировок.ВидРемонта,            "ИтоговаяТаблица.ВидРемонта",             СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
		|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "ИтоговаяТаблица.ДоговорВзаиморасчетов",  СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов" + ИтогТекстВыборкиЦен + "
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ИтоговаяТаблица.ТипЦен = &ТипЦен"+ИмяБазовогоТипаЦен;
		Запрос.Параметры.Вставить("ТипЦен"+ИмяБазовогоТипаЦен, ТекБазовыйТип.Значение);
		МассивТиповЦен.Добавить(ТекБазовыйТип.Значение);
		
	КонецЦикла;
	
	Запрос.Параметры.Вставить("МассивТиповЦен", МассивТиповЦен);
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаПриоритетов.Элемент КАК Авторабота,
	|	ТаблицаПриоритетов.ВремяВыполнения КАК ВремяВыполнения,
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаПриоритетов.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ТаблицаЦен.Валюта КАК Валюта,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	РегистрСведений.ЦеныАвторабот КАК ТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПриоритетов КАК ТаблицаПриоритетов
	|ПО
	|	ТаблицаЦен.Авторабота = ТаблицаПриоритетов.Группа
	|ГДЕ
	|	ТаблицаЦен.Период<=&ДатаЦен" + СтрЗаменить(ТекстОтбора, "ТаблицаЦен.Авторабота", "ТаблицаПриоритетов.Элемент") +  ?( МассивТиповЦен.Количество()=0, "", " И 
	|	ТаблицаЦен.ТипЦен В (&МассивТиповЦен)") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПриоритетов
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаЦен.ТипЦен КАК ТипЦен,
	|	ТаблицаЦен.Приоритет КАК Приоритет,
	|	ТаблицаЦен.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	ВремСрезПоследних
	|ИЗ
	|	ТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "ТаблицаЦен.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "ТаблицаЦен.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "ТаблицаЦен.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "ТаблицаЦен.ДоговорВзаиморасчетов,", "") + "
	|	ТаблицаЦен.ТипЦен,
	|	ТаблицаЦен.Приоритет,
	|	ТаблицаЦен.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель,",
	|	Модель","") + "
	|;
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	МИНИМУМ(СрезПоследних.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ВремСрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	СрезПоследних.ТипЦен = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Период = ТаблицаЦен.Период И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота И 
	|	СрезПоследних.Приоритет = ТаблицаЦен.Приоритет " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|ГДЕ
	|	(НЕ (ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) И 
	|	ТаблицаЦен.Цена = 0))
	|СГРУППИРОВАТЬ ПО
	|	" + ?(ЕстьМодель,     "СрезПоследних.Модель,", "") + "
	|	" + ?(ЕстьЦех,        "СрезПоследних.Цех,", "") + "
	|	" + ?(ЕстьВидРемонта, "СрезПоследних.ВидРемонта,", "") + "
	|	" + ?(ЕстьДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов,", "") + "
	|	СрезПоследних.ТипЦен,
	|	СрезПоследних.Авторабота
	|ИНДЕКСИРОВАТЬ ПО
	|	Авторабота" + ?(ЕстьМодель, ",
	|	Модель", "") + "
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремСрезПоследних
	|;
	|";
	
	
	Если ЕстьМодель Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|" + ПолучитьТекстТаблицыВремениВыполнения(Запрос, ТекстОтбораНормы);
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	НормыВремени.Авторабота,
		|	НормыВремени.Модель КАК Модель,
		|	НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
		|	СрезПоследних.Модель КАК МодельВЦенах,
		|	НормыВремени.ВремяВыполнения КАК ВремяВыполнения,
		|	СрезПоследних.ТипЦен КАК ТипЦен,
		|	" + ?(ЕстьЦех,                   "СрезПоследних.Цех КАК Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет КАК ПриоритетНорм,
		|	СрезПоследних.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ
		|	ТаблицаНормВремени
		|ИЗ
		|	НормыВремениТаблицаПриоритетов КАК НормыВремени
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|	СрезПоследних КАК СрезПоследних
		|ПО
		|	НормыВремени.Авторабота = СрезПоследних.Авторабота И 
		|	НормыВремени.Группа     = СрезПоследних.Модель
		|;
		|
		|ВЫБРАТЬ
		|	НормыВремени.Авторабота КАК Авторабота,
		|	НормыВремени.Модель КАК Модель,
		|	НормыВремени.ВариантКомплектации КАК ВариантКомплектации,
		|	НормыВремени.ТипЦен КАК ТипЦен,
		|	" + ?(ЕстьЦех,                   "НормыВремени.Цех КАК Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "НормыВремени.ВидРемонта КАК ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "НормыВремени.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет КАК Приоритет,
		|	МИНИМУМ(НормыВремени.ПриоритетНорм) КАК ПриоритетНорм
		|ПОМЕСТИТЬ
		|	СрезПоследнихПоНормам
		|ИЗ
		|	ТаблицаНормВремени КАК НормыВремени
		|СГРУППИРОВАТЬ ПО
		|	НормыВремени.Авторабота,
		|	НормыВремени.Модель,
		|	НормыВремени.ВариантКомплектации,
		|	НормыВремени.ТипЦен,
		|	" + ?(ЕстьЦех,                   "НормыВремени.Цех,", "") + "
		|	" + ?(ЕстьВидРемонта,            "НормыВремени.ВидРемонта,", "") + "
		|	" + ?(ЕстьДоговорВзаиморасчетов, "НормыВремени.ДоговорВзаиморасчетов,", "") + "
		|	НормыВремени.Приоритет
		|;
		|";
	КонецЕсли;
	
	ТекстВыборкиЦены = "";
	ЕстьНеЗависемыеПоказатели = (ЕстьНеЗависемыеПоказатели И ИтоговыйТекстЗапроса="");
	Для ИндексГруппировки = ИндексРаботы По МассивГруппировок.Количество()-1 Цикл
		
		ТекГуппировка = МассивГруппировок[ИндексГруппировки];
		ИмяГруппировки = СокрЛП(ТекГуппировка.Поле);
		
		ТекстЦеныГруппировки = "";
		Для Инд = ИндексГруппировки+1 По МассивГруппировок.Количество()-1 Цикл
			
			ВложеннаяГруппировка = СокрЛП(МассивГруппировок[Инд].Поле);
			ТекстЦеныГруппировки = ТекстЦеныГруппировки + " И 
			|			ТаблицаЦенАвторабот." + ВложеннаяГруппировка + " = " + СтруктураПустыхГруппировок[ВложеннаяГруппировка];
		КонецЦикла;
		
		ПрефиксУсловия = ?(Найти(СтруктураПустыхГруппировок[ИмяГруппировки], "&")=0,"НЕ ", "");
		
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Цена
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ КАК Цена" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Валюта
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	КОНЕЦ КАК Валюта" + ИмяГруппировки + ",
		|	ВЫБОР
		|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.Нормочас
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
		|	КОНЕЦ КАК Нормочас" + ИмяГруппировки;
		
		Если ЕстьНеЗависемыеПоказатели Тогда
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	ВЫБОР
			|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.ВремяВыполнения
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ КАК " + ИмяГруппировки + "ВремяВыполнения";
		Иначе
			ТекстВыборкиЦены = ТекстВыборкиЦены + ",
			|	ВЫБОР
			|		КОГДА (" + ПрефиксУсловия + "ТаблицаЦенАвторабот." + ИмяГруппировки + " = " + СтруктураПустыхГруппировок[ИмяГруппировки] + ТекстЦеныГруппировки + ") ТОГДА ТаблицаЦенАвторабот.ВремяВыполнения
			|		ИНАЧЕ
			|			0
			|	КОНЕЦ КАК ВремяВыполнения" + ИмяГруппировки;
		КонецЕсли;
		
		ДобавитьПолеВНаборДанныхКомпоновщика(ТекСхема, "ЦеныАвторабот", ИмяГруппировки + "ВремяВыполнения");
		
		НовоеПоле = ТекСхема.ПоляИтога.Добавить();
		НовоеПоле.ПутьКДанным = "ВремяВыполнения";
		НовоеПоле.Выражение   = "МАКСИМУМ(" + ИмяГруппировки + "ВремяВыполнения)";
		НовоеПоле.Группировки.Добавить(ИмяГруппировки);
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	ТаблицаЦенАвторабот.Авторабота КАК Авторабота,
	|	ТаблицаЦенАвторабот.ТипЦен КАК ТипЦен,
	|	" + ?(СтруктураГруппировок.Модель,     "ТаблицаЦенАвторабот.Модель",     СтруктураПустыхГруппировок.Модель) + " КАК Модель,
	|	" + ?(ЕстьВариантКомплектации,         "ТаблицаЦенАвторабот.ВариантКомплектации", "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)") + " КАК ВариантКомплектации,
	|	" + ?(СтруктураГруппировок.Цех,        "ТаблицаЦенАвторабот.Цех",        СтруктураПустыхГруппировок.Цех) + " КАК Цех,
	|	" + ?(СтруктураГруппировок.ВидРемонта, "ТаблицаЦенАвторабот.ВидРемонта", СтруктураПустыхГруппировок.ВидРемонта) + " КАК ВидРемонта,
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов,    "ТаблицаЦенАвторабот.ДоговорВзаиморасчетов",    СтруктураПустыхГруппировок.ДоговорВзаиморасчетов) + " КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦенАвторабот.Валюта КАК Валюта,
	|	ТаблицаЦенАвторабот.ВремяВыполнения КАК ВремяВыполнения,
	|	ТаблицаЦенАвторабот.Нормочас КАК Нормочас,
	|	ТаблицаЦенАвторабот.Цена КАК Цена" + ТекстВыборкиЦены + ?(ИтоговыйТекстЗапроса = "", "", "
	|ПОМЕСТИТЬ
	|	ИтоговаяТаблица") + "
	|ИЗ(ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	" + ?(СтруктураГруппировок.Модель,          "СрезПоследних.Модель КАК Модель,", "") + "
	|	" + ?(ЕстьВариантКомплектации,              "ЕСТЬNULL(НормыВремени.ВариантКомплектации, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)) КАК ВариантКомплектации,", "") + "
	|	" + ?(СтруктураГруппировок.Цех,        "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта, "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов,    "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Валюта
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА 0" + ?(ЕстьВариантКомплектации, "
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.ВремяВыполнения
	|		ИНАЧЕ НормыВремени.ВремяВыполнения", "
	|		ИНАЧЕ ТаблицаЦен.ВремяВыполнения") + "
	|	КОНЕЦ КАК ВремяВыполнения,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА 0" + ?(СтруктураГруппировок.Модель, "
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ОбщиеНормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА 0
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ОбщиеНормыВремени.ВремяВыполнения
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения","
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА 0
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения")+"
	//|	КОНЕЦ КАК ВремяВыполнения,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА ТаблицаЦен.Цена" + ?(СтруктураГруппировок.Модель, "
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ОбщиеНормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.Нормочас.Цена
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ОбщиеНормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена","
	//|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.Нормочас.Цена
	//|		ИНАЧЕ НормыВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена")+"
	//|	КОНЕЦ КАК Цена
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА ТаблицаЦен.Цена" + ?(ЕстьВариантКомплектации, "
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL И ТаблицаЦен.ВремяВыполнения = 0 ТОГДА ТаблицаЦен.Нормочас.Цена
	|		КОГДА НормыВремени.ВремяВыполнения ЕСТЬ NULL ТОГДА ТаблицаЦен.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	|		ИНАЧЕ НормыВремени.ВремяВыполнения * ТаблицаЦен.Нормочас.Цена", "
	|		КОГДА ТаблицаЦен.ВремяВыполнения = 0 ТОГДА ТаблицаЦен.Нормочас.Цена
	|		ИНАЧЕ ТаблицаЦен.ВремяВыполнения * ТаблицаЦен.Нормочас.Цена")+"
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
	|ПО 
	|	СрезПоследних.ТипЦен  = ТаблицаЦен.ТипЦен И 
	|	СрезПоследних.Приоритет = ТаблицаЦен.Приоритет И 
	|	СрезПоследних.Авторабота = ТаблицаЦен.Авторабота " + ?(СтруктураГруппировок.Модель, " И 
	|	СрезПоследних.Модель = ТаблицаЦен.Модель", "") + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|	" + ?(ЕстьВариантКомплектации, "
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Автоработы.НормыВремени КАК НормыВремени
	|ПО
	|	СрезПоследних.Авторабота = НормыВремени.Ссылка" + ?(ЕстьМодель, " И 
	|	СрезПоследних.Модель = НормыВремени.Модель", ""), "") + ?(ЕстьВариантКомплектации И ЕстьМодель, "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СрезПоследних.ТипЦен КАК ТипЦен,
	|	СрезПоследних.Авторабота КАК Авторабота,
	|	СрезПоследних.Модель КАК Модель,
	|	СрезПоследних.ВариантКомплектации КАК ВариантКомплектации,
	|	" + ?(СтруктураГруппировок.Цех,              "СрезПоследних.Цех КАК Цех,", "") + "
	|	" + ?(СтруктураГруппировок.ВидРемонта,         "СрезПоследних.ВидРемонта КАК ВидРемонта,", "") + "
	|	" + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, "СрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,", "") + "
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Валюта
	|		ИНАЧЕ
	|			ТаблицаЦен.Нормочас.Валюта
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			0
	|		ИНАЧЕ
	|			ТаблицаНормВремени.ВремяВыполнения
	|	КОНЕЦ КАК ВремяВыполнения,
	|	ТаблицаЦен.Нормочас КАК Нормочас,
	|	ВЫБОР
	|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА
	|			ТаблицаЦен.Цена
	|		ИНАЧЕ
	|			ТаблицаНормВремени.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	|	КОНЕЦ КАК Цена
	//|	ВЫБОР
	//|		КОГДА ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка) ТОГДА ТаблицаЦен.Цена
	//|		ИНАЧЕ СрезПоследних.ВремяВыполнения*ТаблицаЦен.Нормочас.Цена
	//|	КОНЕЦ КАК Цена
	|ИЗ
	|	СрезПоследнихПоНормам КАК СрезПоследних
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаНормВремени КАК ТаблицаНормВремени
	|ПО
	|	СрезПоследних.ТипЦен = ТаблицаНормВремени.ТипЦен И 
	|	СрезПоследних.Авторабота = ТаблицаНормВремени.Авторабота И 
	|	СрезПоследних.ВариантКомплектации = ТаблицаНормВремени.ВариантКомплектации И 
	|	СрезПоследних.Модель = ТаблицаНормВремени.Модель И 
	|	СрезПоследних.Приоритет = ТаблицаНормВремени.Приоритет И 
	|	СрезПоследних.ПриоритетНорм = ТаблицаНормВремени.ПриоритетНорм" + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаНормВремени.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаНормВремени.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаНормВремени.ДоговорВзаиморасчетов", "") + "
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	ТаблицаНормВремени.ТипЦен              = ТаблицаЦен.ТипЦен И 
	|	ТаблицаНормВремени.Авторабота          = ТаблицаЦен.Авторабота И 
	|	ТаблицаНормВремени.МодельВЦенах        = ТаблицаЦен.Модель И 
	|	ТаблицаНормВремени.Приоритет           = ТаблицаЦен.Приоритет" + ?(СтруктураГруппировок.Цех, " И 
	|	СрезПоследних.Цех = ТаблицаЦен.Цех", "") + ?(СтруктураГруппировок.ВидРемонта, " И 
	|	СрезПоследних.ВидРемонта = ТаблицаЦен.ВидРемонта", "") + ?(СтруктураГруппировок.ДоговорВзаиморасчетов, " И 
	|	СрезПоследних.ДоговорВзаиморасчетов = ТаблицаЦен.ДоговорВзаиморасчетов", "") + "
	|ГДЕ
	|	НЕ ТаблицаЦен.Нормочас = ЗНАЧЕНИЕ(Справочник.Нормочасы.ПустаяСсылка)
	|", "") + ") КАК ТаблицаЦенАвторабот
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦен
	|;
	|" + ?(ЕстьВариантКомплектации И ЕстьМодель, "
	|УНИЧТОЖИТЬ
	|	СрезПоследнихПоНормам
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаНормВремени
	|;
	|", "") + "
	|" + ИтоговыйТекстЗапроса;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапрос(ТекНастройка, ТекСхема, ИндексРаботы, МассивГруппировок)
	
	ПолеАвторабота            = Новый ПолеКомпоновкиДанных("Авторабота");
	ПолеМодель                = Новый ПолеКомпоновкиДанных("Модель");
	ПолеЦех                   = Новый ПолеКомпоновкиДанных("Цех");
	ПолеВидРемонта            = Новый ПолеКомпоновкиДанных("ВидРемонта");
	ПолеДоговорВзаиморасчетов = Новый ПолеКомпоновкиДанных("ДоговорВзаиморасчетов");
	ПолеВариантКомплектации   = Новый ПолеКомпоновкиДанных("ВариантКомплектации");
	
	Структура = ТекНастройка.Настройки.Структура;
	СтруктураГруппировок = Новый Структура();
	СтруктураГруппировок.Вставить("Модель",                ПоискГруппировки(ПолеМодель,     Структура));
	СтруктураГруппировок.Вставить("Цех",                   ПоискГруппировки(ПолеЦех,        Структура));
	СтруктураГруппировок.Вставить("ВидРемонта",            ПоискГруппировки(ПолеВидРемонта, Структура));
	СтруктураГруппировок.Вставить("ДоговорВзаиморасчетов", ПоискГруппировки(ПолеДоговорВзаиморасчетов,    Структура));
	СтруктураГруппировок.Вставить("ВариантКомплектации",   ПоискГруппировки(ПолеВариантКомплектации,    Структура));
	
	ОтборКомпоновщика = ТекНастройка.Настройки.Отбор;
	МассивОдиночныхОтборов = Новый Массив;
	
	СчетчикОтборов = КоличествоОтборов(ПолеМодель, ОтборКомпоновщика);
	Если НЕ СтруктураГруппировок.Модель И СчетчикОтборов > 1 Тогда
		ДобавитьПолеВПоследнююГруппировку(Структура, ПолеМодель);
		СтруктураГруппировок.Вставить("Модель", Истина);
	КонецЕсли;
	
	Если СчетчикОтборов = 1 Тогда
		МассивОдиночныхОтборов.Добавить(ПолеМодель);
		СтруктураГруппировок.Вставить("Модель", Истина);
	КонецЕсли;
	
	СчетчикОтборов = КоличествоОтборов(ПолеЦех, ОтборКомпоновщика);
	Если НЕ СтруктураГруппировок.Цех И СчетчикОтборов > 1 Тогда
		ДобавитьПолеВПоследнююГруппировку(Структура, ПолеЦех);
		СтруктураГруппировок.Вставить("Цех", Истина);
	КонецЕсли;
	
	Если СчетчикОтборов = 1 Тогда
		СтруктураГруппировок.Вставить("Цех", Истина);
		МассивОдиночныхОтборов.Добавить(ПолеЦех);
	КонецЕсли;
	
	СчетчикОтборов = КоличествоОтборов(ПолеВидРемонта, ОтборКомпоновщика);
	Если НЕ СтруктураГруппировок.ВидРемонта И СчетчикОтборов > 1 Тогда
		ДобавитьПолеВПоследнююГруппировку(Структура, ПолеВидРемонта);
		СтруктураГруппировок.Вставить("ВидРемонта", Истина);
	КонецЕсли;
	
	Если СчетчикОтборов = 1 Тогда
		МассивОдиночныхОтборов.Добавить(ПолеВидРемонта);
		СтруктураГруппировок.Вставить("ВидРемонта", Истина);
	КонецЕсли;
	
	СчетчикОтборов = КоличествоОтборов(ПолеДоговорВзаиморасчетов, ОтборКомпоновщика);
	Если НЕ СтруктураГруппировок.ДоговорВзаиморасчетов И СчетчикОтборов > 1 Тогда
		ДобавитьПолеВПоследнююГруппировку(Структура, ПолеДоговорВзаиморасчетов);
		СтруктураГруппировок.Вставить("ДоговорВзаиморасчетов", Истина);
	КонецЕсли;
	
	Если СчетчикОтборов = 1 Тогда
		МассивОдиночныхОтборов.Добавить(ПолеДоговорВзаиморасчетов);
		СтруктураГруппировок.Вставить("ДоговорВзаиморасчетов", Истина);
	КонецЕсли;
	
	СчетчикОтборов = КоличествоОтборов(ПолеВариантКомплектации, ОтборКомпоновщика);
	Если НЕ СтруктураГруппировок.ВариантКомплектации И СчетчикОтборов > 1 Тогда
		ДобавитьПолеВПоследнююГруппировку(Структура, ПолеВариантКомплектации);
		СтруктураГруппировок.Вставить("ВариантКомплектации", Истина);
	КонецЕсли;
	
	Если СчетчикОтборов = 1 Тогда
		МассивОдиночныхОтборов.Добавить(ПолеВариантКомплектации);
		СтруктураГруппировок.Вставить("ВариантКомплектации", Истина);
	КонецЕсли;
	
	Если КоличествоОтборов(ПолеАвторабота, ОтборКомпоновщика) = 1 Тогда
		МассивОдиночныхОтборов.Добавить(ПолеАвторабота);
	КонецЕсли;
	
	НастройкаПериода = ТекНастройка.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	НастройкаПериода.Значение      = КонецДня(ДатаКонца);
	НастройкаПериода.Использование = Истина;
	
	СтруктураПустыхГруппировок = Новый Структура();
	СтруктураПустыхГруппировок.Вставить("Авторабота",            "ЗНАЧЕНИЕ(Справочник.Автоработы.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("Модель",                "ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("Цех",                   "ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("ВидРемонта",            "ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("ДоговорВзаиморасчетов", "ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("Валюта",                "ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)");
	СтруктураПустыхГруппировок.Вставить("ВариантКомплектации",   "ЗНАЧЕНИЕ(Справочник.ВариантыКомплектации.ПустаяСсылка)");
	
	Запрос = Новый Запрос;
	ТекстОтбора          = ПолучитьТекстОтбора(ОтборКомпоновщика, Запрос.Параметры);
	ТекстОтбораАвторабот = ПолучитьТекстОтбораДляАвторабот(ОтборКомпоновщика, Запрос.Параметры);
	
	Если НЕ ТекстОтбора = "" Тогда
		ТекстОтбора = " И 
		|	" + ТекстОтбора;
	КонецЕсли;
	
	Если НЕ ТекстОтбораАвторабот = "" Тогда
		ТекстОтбораАвторабот = " И 
		|	" + ТекстОтбораАвторабот;
	КонецЕсли;
	
	Если МассивОдиночныхОтборов.Количество()>1 Тогда
		НоваяГруппа = ОтборКомпоновщика.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		НоваяГруппа.Использование = Истина;
		НоваяГруппа.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	КонецЕсли;
	
	// Перемещаем определенные одиночные отборы в группу И
	// иначе отчет не заработает из-за странности в поведении компоновщика
	Для Каждого ТекОтбор Из ОтборКомпоновщика.Элементы Цикл
		
		Если ТекОтбор.Использование Тогда
			
			Если ТипЗнч(ТекОтбор) = Тип("ЭлементОтбораКомпоновкиДанных") И 
				(НЕ ПустаяСтрока(СокрЛП(ТекОтбор.ЛевоеЗначение))) И 
				(НЕ МассивОдиночныхОтборов.Найти(ТекОтбор.ЛевоеЗначение) = Неопределено) Тогда
				
				Если МассивОдиночныхОтборов.Количество()>1 Тогда
					НовыйОтбор = НоваяГруппа.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					НовыйОтбор.Использование  = Истина;
					НовыйОтбор.ЛевоеЗначение  = ТекОтбор.ЛевоеЗначение;
					НовыйОтбор.ВидСравнения   = ТекОтбор.ВидСравнения;
					НовыйОтбор.ПравоеЗначение = ТекОтбор.ПравоеЗначение;
					
					ТекОтбор.Использование = Ложь;
				КонецЕсли;
				
				ИмяПоля = СокрЛП(ТекОтбор.ЛевоеЗначение);
				Запрос.УстановитьПараметр("Иерархия"+ИмяПоля, ТекОтбор.ПравоеЗначение);
				СтруктураПустыхГруппировок.Вставить(ИмяПоля, "&Иерархия"+ИмяПоля);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ГруппировкаАвторабот = МассивГруппировок[ИндексРаботы];
	
	Если ГруппировкаАвторабот.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы Тогда
		
		ТекстЗапроса = ПолучитьЗапросЭлементы(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок);
		
	ИначеЕсли ГруппировкаАвторабот.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
		
		ТекстЗапроса = ПолучитьЗапросТолькоИерархия(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок);
		
	ИначеЕсли ГруппировкаАвторабот.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия Тогда
		
		ТекстЗапроса = ПолучитьЗапросИерархия(Запрос, ТекСхема, ИндексРаботы, МассивГруппировок, СтруктураГруппировок, ТекстОтбора, ТекстОтбораАвторабот, СтруктураПустыхГруппировок);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаЦен", КонецДня(ДатаКонца));
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции // УстановитьТекстЗапроса()

Функция ПолучитьСхемуКомпоновки()
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, СхемаКомпоновкиДанных, "dataCompositionScheme", "http://v8.1c.ru/8.1/data-composition-system/scheme");
	ТекстЗапроса = ЗаписьXML.Закрыть();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ТекстЗапроса);
	НоваяСхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	
	НоваяСхемаКомпоновкиДанных.ПоляИтога.Очистить();
	//ПолеПоиска = НоваяСхемаКомпоновкиДанных.ПоляИтога.Найти("Цена");
	//Если НЕ ПолеПоиска = Неопределено Тогда
	//	НоваяСхемаКомпоновкиДанных.ПоляИтога.Удалить(ПолеПоиска);
	//КонецЕсли;
	//
	//ПолеПоиска = НоваяСхемаКомпоновкиДанных.ПоляИтога.Найти("Валюта");
	//Если НЕ ПолеПоиска = Неопределено Тогда
	//	НоваяСхемаКомпоновкиДанных.ПоляИтога.Удалить(ПолеПоиска);
	//КонецЕсли;
	//
	//ПолеПоиска = НоваяСхемаКомпоновкиДанных.ПоляИтога.Найти("Нормочас");
	//Если НЕ ПолеПоиска = Неопределено Тогда
	//	НоваяСхемаКомпоновкиДанных.ПоляИтога.Удалить(ПолеПоиска);
	//КонецЕсли;
	//
	//ПолеПоиска = НоваяСхемаКомпоновкиДанных.ПоляИтога.Найти("ВремяВыполнения");
	//Если НЕ ПолеПоиска = Неопределено Тогда
	//	НоваяСхемаКомпоновкиДанных.ПоляИтога.Удалить(ПолеПоиска);
	//КонецЕсли;
	
	Возврат НоваяСхемаКомпоновкиДанных;
	
КонецФункции

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета = "", ИмяМакетаПараметров="Параметры") Экспорт
	
	ПараметрыИзмеренийСтрок = Новый Соответствие;
	МакетПараметры = ПолучитьМакет(ИмяМакетаПараметров);
	
	ДеревоДоступныхПолей = Новый ДеревоЗначений();
	ДеревоДоступныхПолей.Колонки.Добавить("Имя");
	ДеревоДоступныхПолей.Колонки.Добавить("ПутьКДанным");
	ДеревоДоступныхПолей.Колонки.Добавить("Представление");
	
	СтруктураПараметров = Новый Структура;
	
	//СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ДоступныеПоляВыбора.
	ПредставлениеРодителя = "";
	ОбластьИзмерений = МакетПараметры.ПолучитьОбласть("Измерения");
	Для к = 1 по ОбластьИзмерений.ВысотаТаблицы Цикл
		ОбластьПоля = ОбластьИзмерений.ПолучитьОбласть("R" + к);
		ПутьКДанным   = ОбластьПоля.Область(1, 1).Текст;
		Если ОбластьПоля.Область(1, 1).Автоотступ = 0 и ОбластьПоля.Область(1, 1).Отступ = 0 Тогда
			// Новое измерение
			ИмяИзмерения = ПутьКДанным;
			НоваяСтрока = ДеревоДоступныхПолей.Строки.Добавить();
			НоваяСтрока.Имя = ИмяИзмерения;
			НоваяСтрока.ПутьКДанным = ИмяИзмерения;
			ТекПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(НоваяСтрока.ПутьКДанным));
			Если ТекПоле = Неопределено Тогда
				ДеревоДоступныхПолей.Строки.Удалить(НоваяСтрока);
			Иначе
				НоваяСтрока.Представление = ТекПоле.Заголовок;
				ПредставлениеРодителя = ТекПоле.Заголовок+".";
			КонецЕсли;
		Иначе
			РодительПолей = ДеревоДоступныхПолей.Строки.Найти(ИмяИзмерения, "Имя");
			ТекПутьКДанным = ИмяИзмерения;
			Если РодительПолей=Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьКДаннымПоля = ПутьКДанным;
			Для Итерация=1 по СтрЧислоВхождений(ПутьКДаннымПоля, ".") Цикл
				ПозРазделителя = Найти(ПутьКДаннымПоля, ".");
				Идентификатор = Лев(ПутьКДанным, ПозРазделителя - 1);
				
				ТекСтрока = РодительПолей.Строки.Найти(Идентификатор, "Имя");
				Если ТекСтрока = Неопределено Тогда
					ТекСтрока = РодительПолей.Строки.Добавить();
					ТекСтрока.Имя = Идентификатор;
				КонецЕсли;
				РодительПолей = ТекСтрока;
				ПутьКДаннымПоля = Сред(ПутьКДаннымПоля, ПозРазделителя + 1);
			КонецЦикла;
			НоваяСтрока = РодительПолей.Строки.Найти(ИмяИзмерения+"."+ПутьКДанным, "ПутьКДанным");
			Если НоваяСтрока = Неопределено Тогда
				НоваяСтрока = РодительПолей.Строки.Добавить();
			КонецЕсли;
			НоваяСтрока.Имя = ПутьКДаннымПоля;
			НоваяСтрока.ПутьКДанным		= ИмяИзмерения+"."+ПутьКДанным;
			ТекПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных(НоваяСтрока.ПутьКДанным));
			Если ТекПоле = Неопределено Тогда
				РодительПолей.Строки.Удалить(НоваяСтрока);
			Иначе
				НоваяСтрока.Представление = СтрЗаменить(ТекПоле.Заголовок, ПредставлениеРодителя, "");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполним показатели согласно типам цен
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТипыЦен.Ссылка КАК ТипЦен,
	|	ТипыЦен.Наименование КАК Наименование,
	|	ТипыЦен.ВключатьВПрайсЛист
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТипыЦен.ДляРабот = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦен.Наименование УБЫВ");
	
	ТаблицаПараметровТипаЦен = Новый ТаблицаЗначений;
	ТаблицаПараметровТипаЦен.Колонки.Добавить("Имя");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ШаблонРасчетаЦены");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ИмяБазовогоТипаЦен");
	ТаблицаПараметровТипаЦен.Колонки.Добавить("ТипЦен");
	
	ПоляЦен   = СхемаКомпоновкиДанных.НаборыДанных.ЦеныАвторабот.Поля;
	ПоляИтога = СхемаКомпоновкиДанных.ПоляИтога;
	ЭлементыВыборки = КомпоновщикНастроек.Настройки.Выбор.Элементы;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Счетчик = 1;
	Пока Выборка.Следующий() Цикл
		РабочийТипЦен = Выборка.ТипЦен;
		ШаблонЦена = "*ВыражениеЦены*";
		// Если расчетная цена получим базовую цену
		Пока РабочийТипЦен.Рассчитывается Цикл
			
			Если РабочийТипЦен.ПроцентСкидкиНаценки <> 0 Тогда
				
				ШаблонЦена = "("+ШаблонЦена+"+"+ШаблонЦена+"*"+Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100, "ЧРД=.")+")";
				
			КонецЕсли;
			
			РабочийТипЦен = РабочийТипЦен.БазовыйТипЦен;
			
		КонецЦикла;
		
		ИмяПоля				= "_" + СтрЗаменить(Выборка.ТипЦен.УникальныйИдентификатор(),"-","_");
		ПредставлениеПоля	= Выборка.Наименование;
		
		НовоеПоле = ПоляЦен.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Заголовок = ПредставлениеПоля;
		НовоеПоле.ОграничениеИспользования.Группировка = Истина;
		НовоеПоле.ОграничениеИспользования.Порядок = Истина;
		НовоеПоле.ОграничениеИспользования.Условие = Истина;
		НовоеПоле.ПутьКДанным = ИмяПоля;
		
		НоваяГруппа = ЭлементыВыборки.Добавить(Тип("ГруппаВыбранныхПолейКомпоновкиДанных"));
		НоваяГруппа.Использование = Выборка.ВключатьВПрайсЛист;
		НоваяГруппа.Заголовок     = ПредставлениеПоля;
		НоваяГруппа.Поле          = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
		//отДобавитьФункциюПоказатель(Показатели, ИмяПоля, ПредставлениеПоля, Выборка.ВключатьВПрайсЛист, "ЧЦ=15; ЧДЦ=2", 20);
		НовоеПоле = ПоляЦен.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		//НовоеПоле.Заголовок = "Цена ("+ПредставлениеПоля+")";
		НовоеПоле.Заголовок = "Цена";
		НовоеПоле.ОграничениеИспользования.Группировка = Истина;
		НовоеПоле.ОграничениеИспользования.Порядок = Истина;
		НовоеПоле.ОграничениеИспользования.Условие = Истина;
		НовоеПоле.Оформление.Элементы[12].Значение = "ЧЦ=15; ЧДЦ=2";
		НовоеПоле.Оформление.Элементы[12].Использование = Истина;
		НовоеПоле.Поле = ИмяПоля+"Цена";
		НовоеПоле.ПутьКДанным = ИмяПоля + ".Цена";
		НовоеПоле.ТипЗначения = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
		
		ПолеИтога = ПоляИтога.Добавить();
		ПолеИтога.Выражение   = "Максимум("+ИмяПоля+"Цена)";
		ПолеИтога.ПутьКДанным = ИмяПоля + ".Цена";
		
		ПолеВыборки = НоваяГруппа.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыборки.Использование = Истина;
		ПолеВыборки.Поле          = Новый ПолеКомпоновкиДанных(ИмяПоля + ".Цена");
		
		НовоеПоле = ПоляЦен.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		//НовоеПоле.Заголовок = "Валюта ("+ПредставлениеПоля+")";
		НовоеПоле.Заголовок = "Валюта";
		НовоеПоле.ОграничениеИспользования.Группировка = Истина;
		НовоеПоле.ОграничениеИспользования.Порядок = Истина;
		НовоеПоле.ОграничениеИспользования.Условие = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Условие = Истина;
		НовоеПоле.Поле = ИмяПоля + "Валюта";
		НовоеПоле.ПутьКДанным = ИмяПоля + ".Валюта";
		НовоеПоле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Валюты");
		
		ПолеИтога = ПоляИтога.Добавить();
		ПолеИтога.Выражение   = "Максимум("+ИмяПоля+"Валюта)";
		ПолеИтога.ПутьКДанным = ИмяПоля + ".Валюта";
		
		ПолеВыборки = НоваяГруппа.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыборки.Использование = Истина;
		ПолеВыборки.Поле          = Новый ПолеКомпоновкиДанных(ИмяПоля + ".Валюта");
		
		НовоеПоле = ПоляЦен.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		//НовоеПоле.Заголовок = "Нормочас ("+ПредставлениеПоля+")";
		НовоеПоле.Заголовок = "Нормочас";
		НовоеПоле.ОграничениеИспользования.Группировка = Истина;
		НовоеПоле.ОграничениеИспользования.Порядок = Истина;
		НовоеПоле.ОграничениеИспользования.Условие = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Группировка = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		НовоеПоле.ОграничениеИспользованияРеквизитов.Условие = Истина;
		НовоеПоле.Поле = ИмяПоля + "Нормочас";
		НовоеПоле.ПутьКДанным = ИмяПоля + ".Нормочас";
		НовоеПоле.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Нормочасы");
		
		ПолеИтога = ПоляИтога.Добавить();
		ПолеИтога.Выражение   = "Максимум("+ИмяПоля+"Нормочас)";
		ПолеИтога.ПутьКДанным = ИмяПоля + ".Нормочас";
		
		ПолеВыборки = НоваяГруппа.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеВыборки.Использование = Истина;
		ПолеВыборки.Поле          = Новый ПолеКомпоновкиДанных(ИмяПоля + ".Нормочас");
		
		//Цена
		//Валюта
		//Нормочас

		ПараметрыТипа = ТаблицаПараметровТипаЦен.Найти(РабочийТипЦен,"ТипЦен");
		Если ПараметрыТипа = Неопределено Тогда
			ИмяБазовогоТипаЦен = "ТипЦен" + СтрЗаменить(РабочийТипЦен.УникальныйИдентификатор(),"-","_");
			//СтруктураПараметров.Вставить(ИмяБазовогоТипаЦен, РабочийТипЦен);
			//СтруктураПараметров.Вставить("Валюта"+ИмяБазовогоТипаЦен, РабочийТипЦен.ВалютаЦены);
		Иначе
			ИмяБазовогоТипаЦен = ПараметрыТипа.ИмяБазовогоТипаЦен;
		КонецЕсли;
		
		НовыйПараметр = ТаблицаПараметровТипаЦен.Добавить();
		НовыйПараметр.Имя = ИмяПоля;
		НовыйПараметр.ШаблонРасчетаЦены  = ШаблонЦена;
		НовыйПараметр.ИмяБазовогоТипаЦен = ИмяБазовогоТипаЦен;
		НовыйПараметр.ТипЦен             = РабочийТипЦен;
		//НовыйПараметр.ТекстСоединений    = ТекстСоединенийПроцентыСкидкиНаценки;
		
	КонецЦикла;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.Восстановить();
	
КонецПроцедуры //ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	//УстановитьОсновныеПараметры();
	ДокументРезультат.Очистить();
	
	Счетчик = 0;
	Структура = КомпоновщикНастроек.Настройки.Структура;
	Для Каждого ТекСтруктура ИЗ Структура Цикл
		Если ТекСтруктура.Использование Тогда
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Счетчик = 0 Тогда
		#Если Клиент Тогда
			Предупреждение("Не задана структура отчета!");
		#Иначе
			Сообщить("Не задана структура отчета!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат ДокументРезультат;
	ИначеЕсли Счетчик > 1 Тогда
		#Если Клиент Тогда
			Предупреждение("Отчет можно формировать только с одной структурой!");
		#Иначе
			Сообщить("Отчет можно формировать только с одной структурой!", СтатусСообщения.Важное);
		#КонецЕсли
		Возврат ДокументРезультат;
	КонецЕсли;
	
	
	НоваяСхемаКомпоновкиДанных = ПолучитьСхемуКомпоновки();
	
	НовыйКомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	НовыйКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(НоваяСхемаКомпоновкиДанных));
	НовыйКомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	НовыйКомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Структура = НовыйКомпоновщикНастроек.Настройки.Структура;
	
	ИндексРаботы      = 0;
	ГруппировкаРаботы = Неопределено;
	//ГруппировкиРабот  = Новый Массив;
	МассивГруппировок = Новый Массив;
	ПолучитьМассивГруппировок(МассивГруппировок, Структура, ИндексРаботы, ГруппировкаРаботы);
	
	ТаблицаПрайсЛиста = ПолучитьЗапрос(НовыйКомпоновщикНастроек, НоваяСхемаКомпоновкиДанных, ИндексРаботы, МассивГруппировок);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаПрайсЛиста", ТаблицаПрайсЛиста);
	
	ПолеАвтоработы = МассивГруппировок[ИндексРаботы];
	ПолеРаботы = Новый ПолеКомпоновкиДанных("Авторабота");
	Если ПолеАвтоработы.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.ТолькоИерархия Тогда
		Для Каждого ТекПоле Из ГруппировкаРаботы.ПоляГруппировки.Элементы Цикл
			Если ТекПоле.Использование И ТекПоле.Поле = ПолеРаботы Тогда
				ТекПоле.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеРасшифровки = Неопределено;
	
	//Сгенерируем макет компоновки данных при помощи компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Попытка
		МакетКомпоновки   = КомпоновщикМакета.Выполнить(НоваяСхемаКомпоновкиДанных, НовыйКомпоновщикНастроек.Настройки, ДанныеРасшифровки);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат ДокументРезультат;
	КонецПопытки;
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	//Создадим и инициализируем процессор вывода результата
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	//Обозначим начало вывода
	ПроцессорВывода.НачатьВывод();
	#Если Клиент тогда
		Состояние(НСТР("ru='Если хотите прервать вывод отчета, нажмите Ctrl+Break'"));
	#КонецЕсли
	
	ТаблицаЗафиксирована = Ложь;
	
	ДокументРезультат.ФиксацияСверху = 0;
	//Основной цикл вывода отчета
	Пока Истина Цикл
		
		#Если Клиент тогда
			ОбработкаПрерыванияПользователя();
		#КонецЕсли
		//Получим следующий элемент результата компоновки
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		
		Если ЭлементРезультата = Неопределено Тогда
			//Следующий элемент не получен - заканчиваем цикл вывода
			Прервать;
		Иначе
			// Зафиксируем шапку
			Если (НЕ ТаблицаЗафиксирована) И ЭлементРезультата.ЗначенияПараметров.Количество() > 0 Тогда
				ТаблицаЗафиксирована = Истина;
				ДокументРезультат.ФиксацияСверху = ДокументРезультат.ВысотаТаблицы;
			КонецЕсли;
			
			//Элемент получен - выведем его при помощи процессора вывода
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Обозначем завершение вывода
	ПроцессорВывода.ЗакончитьВывод();
	
	Возврат ДокументРезультат;
	
КонецФункции // СформироватьТабличныйДокумент

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//ИмяРегистра = "ОстаткиТоваровКомпании";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли