Функция ПолучитьТелефоны() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Телефоны");
КонецФункции

Функция ПолучитьТелефоныАксессуары() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Телефоны/Аксессуары");
КонецФункции

Функция ПолучитьНастольныеКомпьютеры() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Настольные компьютеры");
КонецФункции

Функция ПолучитьАудиоИВидео() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Аудио и видео");
КонецФункции

Функция ПолучитьGoodsType_ТелевизорыИПроекторы() Экспорт
	Возврат Справочники.ns_GoodsType_БытоваяЭлектроника.НайтиПоНаименованию("Телевизоры и проекторы");
КонецФункции

Функция ПолучитьСписокКатегорий() Экспорт
	СписокКатегорий = Новый Массив;
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Телефоны"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Телефоны/Аксессуары"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Аудио и видео"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Товары для компьютера"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Товары для компьютера/Комплектующие"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Фототехника"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Игры, приставки и программы"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Оргтехника и расходники"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Оргтехника и расходники/Расходные материалы"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Планшеты и электронные книги"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Планшеты и электронные книги/Аксессуары"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Ноутбуки"));
	СписокКатегорий.Добавить(Справочники.ns_Category.НайтиПоНаименованию("Настольные компьютеры"));
	
	Возврат СписокКатегорий;
КонецФункции

Функция ПолучитьСписокПодкатегорий(Категория) Экспорт
	СписокПодкатегорий = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Категория) Тогда
		Возврат СписокПодкатегорий;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GoodsType.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_GoodsType_БытоваяЭлектроника КАК GoodsType
	|ГДЕ
	|	GoodsType.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Категория);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокПодкатегорий;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПодкатегорий.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат СписокПодкатегорий;
КонецФункции
