Функция ДокументУникален()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_ЗаработнаяПлатаПоФормеП4.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.БТ_ЗаработнаяПлатаПоФормеП4 КАК БТ_ЗаработнаяПлатаПоФормеП4
	|ГДЕ
	|	БТ_ЗаработнаяПлатаПоФормеП4.Ссылка <> &Ссылка
	|	И БТ_ЗаработнаяПлатаПоФормеП4.Подразделение = &Подразделение
	|	И БТ_ЗаработнаяПлатаПоФормеП4.ПериодЗП = &ПериодЗП
	|	И БТ_ЗаработнаяПлатаПоФормеП4.Проведен";
	
	Запрос.УстановитьПараметр("ПериодЗП", ПериодЗП);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Ложь;
	КонецЦикла;
	Возврат Истина;
КонецФункции
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если Проведен и НЕ ДокументУникален() Тогда       
		Сообщить("По подразделению " + Подразделение + " за период " + МесяцСтрокойЗаглавная(ПериодЗП,КонецМесяца(ПериодЗП)) + " документ уже заведен.");
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры
Функция МесяцСтрокойЗаглавная(НачДата,КонДата)Экспорт
	Если НачалоДня(НачДата)=НачалоМесяца(НачДата) и
		КонецДня(КонДата)=КонецМесяца(КонДата) Тогда
		МесяцСтрока=Формат(НачДата,"ДЛФ=DD");
		МесяцСтрока=Сред(МесяцСтрока,3);
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"мая","май");
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"я ","ь ");
		МесяцСтрока=СтрЗаменить(МесяцСтрока,"а "," ");
		Возврат СтрЗаменить(Трег(СокрЛП(МесяцСтрока)),"Г.","г.");
	Иначе
		Возврат Формат(НачДата,"ДФ=dd.MM.yy")+"-"+Формат(КонДата,"ДФ=dd.MM.yy");
	КонецЕсли;
КонецФункции

