Процедура ПриЗаписи(Отказ)
	НаборЗаписей = РегистрыСведений.ТТ_План_TradeIn.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Бренд.Установить(Бренд); 
	НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(Дата));

	
	Для Каждого Стр Из Сотрудники Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Период = НачалоМесяца(Дата); 
		НоваяЗапись.Сотрудник = Стр.Сотрудник; 
		НоваяЗапись.Бренд = Бренд; 
		НоваяЗапись.БазоваяПремия = БазоваяПремия; 
		НоваяЗапись.ПланНовые = Стр.ПланНовые; 
		НоваяЗапись.ПланНовыеСумма = Стр.ПланНовыеСумма; 
		НоваяЗапись.План = Стр.ПланТрейдИн; 
		НоваяЗапись.ПланФинПродукт = Стр.ПланФин; 
		НоваяЗапись.ПланДоп = Стр.ПланДоп; 
		
		
	КонецЦикла; 
	
	НаборЗаписей.Записать(Истина); 	
КонецПроцедуры
