
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработкаКомандыНаСервере(ПараметрКоманды);
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(СсылкаНаНоменклатуру)
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьЗапчастиИАксессуары() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_ЗапчастиИАксессуары");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьБытоваяЭлектроника() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_БытоваяЭлектроника");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьДляБизнеса() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_ДляБизнеса");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьДляДомаИДачи() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_ДляДомаИДачи");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьХоббиИОтдых() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_ХоббиИОтдых");
	КонецЕсли; 
	Если ns_ОбщегоНазначенияПовтИсп.ИспользоватьМотоциклыИМототехника() Тогда
		ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, "ns_МотоциклыИМототехника");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ОтправитьВАвитоНаСервере(СсылкаНаНоменклатуру, ИмяСправочника)
	ВыделенныеСтроки = ПолучитьСсылкуАвито(СсылкаНаНоменклатуру, ИмяСправочника);
	Если ВыделенныеСтроки.Количество() > 0 Тогда
		ns_ОбщегоНазначенияВызовСервера.УстановитьВыгружатьНаСервере(ВыделенныеСтроки, Истина, ИмяСправочника);
	КонецЕсли; 
КонецПроцедуры
 
&НаСервере
Функция ПолучитьСсылкуАвито(СсылкаНаНоменклатуру, ИмяСправочника)
	ВыделенныеСтроки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.Номенклатура = &Номенклатура";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ns_ЗапчастиИАксессуары", ИмяСправочника);
	Запрос.УстановитьПараметр("Номенклатура", СсылкаНаНоменклатуру);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ВыделенныеСтроки;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыделенныеСтроки.Добавить(Выборка.Ссылка);		
	КонецЦикла;
	
	Возврат ВыделенныеСтроки;
КонецФункции
 
 
