// Модуль ПВХ ПраваИНастройки

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
//
// Параметры
//	ДляГруппы - Булево
//	ДляЭлемента - Булево
//
// Возвращаемое значение:
//	ОбязательныеРеквизиты - Структура
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",3);
	
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("Назначение",1);
	КонецЕсли;
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры
//	Ошибки - Строка
// 	ДопРеквизиты - структура
//  Заполнение - Булево
//  Уникальность - Булево
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Для этой ПВХ доступны только признак Право/Настройка и Значение по умолчанию
	БлокироватьРеквизиты = Новый Структура();
	БлокироватьРеквизиты.Вставить("Код",1);
	БлокироватьРеквизиты.Вставить("Наименование",1);
	БлокироватьРеквизиты.Вставить("Назначение",1);
	Возврат Ложь;
КонецФункции // ДоступностьИзменения()

#Если Клиент Тогда
// Заполняет ПВХ ПраваИНастройки значениями по умолчанию
// из макета "НастройкиПоУмолчанию"
// Уровень настройки также берется из этого макета, поэтому там все
// элементы должны быть прописаны. Причем если тип значения является
// каким-либо перечислением также необходимо указать значение по
// умолчанию (указанием идентификатора конкретного значения)
// !!! Для элементов-групп ПВХ в первой колонке макета имя не указывать!
// Процедура не использует окружение этого объекта (и его модуля) и может
// быть перенесена в любое место конфигурации
//
// Без параметров
//
Процедура ИнициализироватьПраваИНастройки() Экспорт
	ЧислоОшибок = 0; // счетчик ошибок при загрузке прав и настроек
	ВсеПеречисления = Перечисления.ТипВсеСсылки();	// Описание типов для проверки перечислений
	ВсеСправочники  = Справочники.ТипВсеСсылки();   // Описание типов для проверки значений-справочников
	
	// Получим макет настроек по умолчанию
	ИмяМакета = "НастройкиПоУмолчанию";
	Макет = ПланыВидовХарактеристик.ПраваИНастройки.ПолучитьМакет(ИмяМакета); 
	Если Макет=Неопределено Тогда
		Сообщение = "Не обнаружен макет """+ИмяМакета+""" с правами и настройками пользователя по умолчанию.
		|Права не могут быть загружены. Обратитесь к администратору базы данных.";
		Сообщить(Сообщение,СтатусСообщения.ОченьВажное); 
		Возврат;
	КонецЕсли;
	
	// По всем строкам макета
	Для НомерСтроки=1 По Макет.ВысотаТаблицы Цикл
		
		// Считаем из макета Имя, Наименование, Код, ФлагЭтоНастройка, Назначение и значение по умолчанию
		ИмяЭлемПВХ =		СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование =	СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод =			СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрНазначение =		СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрЭтоНастройка =	СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрПоУмолчанию =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		
		Состояние ("Настройка прав: "+Наименование);
		Если ПустаяСтрока(ИмяЭлемПВХ) Тогда
			// ДЛЯ ИЗМЕНЕНИЯ пока платформа не позволяет обратиться к предопределенной группе по имени
			// поэтому в макете для групп имя не заполняем и при загрузке такие строки с пустым именем пропускам
			Продолжить;
		КонецЕсли;
		
		// попытаемся найти и получить ссылку на элемент ПВХ
		СсылкаПВХправ = обПолучитьСсылкуПВХПравИНастроек(ИмяЭлемПВХ);
		// проверим что нашли
		Если обЗначениеНеЗаполнено(СсылкаПВХправ) Тогда 
			ЧислоОшибок = ЧислоОшибок + 1;
			Сообщить("Ошибка при загрузке прав: в строке "+НомерСтроки+" макета <"+ИмяМакета+"> указан элемент отсутствующий в ПВХ ""Права и настройки""",СтатусСообщения.Важное);
			Продолжить; 
		ИначеЕсли СсылкаПВХправ.ЭтоГруппа Тогда
			Продолжить; // группы только для удобства отображения, хотя пока они все равно игнорируются
		КонецЕсли;
		
		// Проведем необходимые преобразования типов полученных значений
		// Получим признак настройки
		СтрЭтоНастройка =	Булево(СтрЭтоНастройка);
		// Определим назначение
		Попытка		СтрНазначение = Перечисления.НазначениеПравИНастроек[СтрНазначение];
		Исключение	СтрНазначение = Перечисления.НазначениеПравИНастроек.Пользователь;
		КонецПопытки;
		// Определим значение по умолчанию
		ОписаниеТипов =	СсылкаПВХправ.ТипЗначения;	// получим описание доступных типов для текущего права/настройки
		ТипЗнач = ОписаниеТипов.Типы().Получить(0);	// получим первый (и единственный) попавшийся из типов доступных для элемента
		// Сначала постараемся преобразовать к нужному типу, а особые типы (перечисления/справочники) обработаем ниже
		ЗнчПоУмолчанию = ОписаниеТипов.ПривестиЗначение(СтрПоУмолчанию);
		// если тип принадлежит к классу перечислений то...
		Если ВсеПеречисления.СодержитТип(ТипЗнач) Тогда
			//то попробуем получить конкретный элемент перечисления
			Перечисление = Новый (ТипЗнач);
			ИмяПеречисления = Перечисление.Метаданные().Имя;
			Попытка	
				Если ПустаяСтрока(СтрПоУмолчанию) Тогда
					ЗнчПоУмолчанию = Перечисления[ИмяПеречисления].ПустаяСсылка();
				Иначе
					ЗнчПоУмолчанию = Перечисления[ИмяПеречисления][СтрПоУмолчанию];
				КонецЕсли; 
			Исключение	// заполнили в макете некорректно, установим пустышку и поругаемся
				ЧислоОшибок = ЧислоОшибок + 1;
				Сообщить("Ошибка при загрузке права <"+СсылкаПВХправ+"> в строке "+НомерСтроки+" макета <"+ИмяМакета+"> некорректное значение по умолчанию <"+СтрПоУмолчанию+">",СтатусСообщения.Важное);
				ЗнчПоУмолчанию = СсылкаПВХправ.ЗначениеПоУмолчанию;
			КонецПопытки;
		// если тип принадлежит к справочникам
		ИначеЕсли ВсеСправочники.СодержитТип(ТипЗнач) Тогда
			//то попробуем найти и получить значение справочника-ссылки
			ЗнчПоУмолчанию=СокрЛП(СтрПоУмолчанию);
			Если СтрДлина(ЗнчПоУмолчанию)>0 Тогда
				СПР = Новый(ТипЗнач);
				СпрМетаданные  = СПР.Метаданные();
				ИмяСправочника = СпрМетаданные.Имя;
				Попытка
					СпрМенеджер=Справочники[ИмяСправочника];
				Исключение
					СпрМенеджер=НЕОПРЕДЕЛЕНО;
				КонецПопытки; 
				// 
				Если СпрМенеджер=НЕОПРЕДЕЛЕНО Тогда
					СпрЭлемент=НЕОПРЕДЕЛЕНО
				Иначе
					Попытка // поиск в предопределенных элементах
					  СпрЭлемент = СпрМенеджер[ЗнчПоУмолчанию];
				  	Исключение
					  СпрЭлемент = НЕОПРЕДЕЛЕНО;
				  	КонецПопытки;
				  
					Если СпрЭлемент=НЕОПРЕДЕЛЕНО ИЛИ СпрЭлемент.Пустая() Тогда
						Попытка // попробуем найти по именованию
						  СпрЭлемент = СпрМенеджер.НайтиПоНаименованию(ЗнчПоУмолчанию,Истина);
					  	Исключение
						  СпрЭлемент = НЕОПРЕДЕЛЕНО;
					  	КонецПопытки;
					КонецЕсли;
					Если (СпрЭлемент=НЕОПРЕДЕЛЕНО ИЛИ СпрЭлемент.Пустая()) И (СпрМетаданные.ДлинаКода > 0) Тогда
						Попытка // последняя попытка поиска (по коду)
							Если Найти(ЗнчПоУмолчанию,"/") > 0 Тогда // полный код
								СпрЭлемент = СпрМенеджер.НайтиПоКоду(ЗнчПоУмолчанию,Истина);
							Иначе
								// проверим на тип кода
								ТипКода = Тип(СПР.Метаданные().ТипКода);
								Если ТипКода = Тип("Строка") Тогда
									// если строковый то нужно "подогнать" его длину
									Если СтрДлина(ЗнчПоУмолчанию) > СпрМетаданные.ДлинаКода Тогда
										ЗнчПоУмолчанию = Прав(ЗнчПоУмолчанию,СпрМетаданные.ДлинаКода);
									Иначе
										Пока СтрДлина(ЗнчПоУмолчанию) < СпрМетаданные.ДлинаКода Цикл
											ЗнчПоУмолчанию = "0"+ЗнчПоУмолчанию;	
										КонецЦикла;
									КонецЕсли;
								Иначе // а если тип не строка то преобразуем 
									ЗнчПоУмолчанию=ТипКода.ПривестиЗначение(ЗнчПоУмолчанию);
								КонецЕсли;
								// теперь еще раз попробуем найти элемент
								СпрЭлемент = СпрМенеджер.НайтиПоКоду(ЗнчПоУмолчанию,Ложь);
							КонецЕсли;
					  	Исключение
						  СпрЭлемент = НЕОПРЕДЕЛЕНО;
						КонецПопытки;
					КонецЕсли;			
				КонецЕсли;
				// проверим получилось ли найти элемент по умолчанию
				Если СпрЭлемент=НЕОПРЕДЕЛЕНО ИЛИ СпрЭлемент.Пустая() Тогда
					Сообщить("Ошибка при загрузке права <"+СсылкаПВХправ+"> в строке "+НомерСтроки+" макета <"+ИмяМакета+"> некорректное значение по умолчанию <"+СтрПоУмолчанию+">",СтатусСообщения.Важное);
					ЗнчПоУмолчанию = СсылкаПВХправ.ЗначениеПоУмолчанию;
				Иначе
					ЗнчПоУмолчанию = СпрЭлемент.Ссылка;
				КонецЕсли;
			Иначе
				ЗнчПоУмолчанию = СсылкаПВХправ.ЗначениеПоУмолчанию;
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ЗнчПоУмолчанию) Тогда
				Попытка
					ЗнчПоУмолчанию=ОписаниеТипов.ПривестиЗначение(СтрПоУмолчанию);
				Исключение
				КонецПопытки; 
			КонецЕсли; 
		КонецЕсли;
		
		// Проверим все ли реквизиты в ПВХ установлены как и в макете		
		Если (СсылкаПВХправ.Назначение <> СтрНазначение) ИЛИ
		     (СсылкаПВХправ.ЭтоНастройка <> СтрЭтоНастройка) ИЛИ
		     (СсылкаПВХправ.ЗначениеПоУмолчанию <> ЗнчПоУмолчанию) ИЛИ
		     (СсылкаПВХправ.Наименование <> СтрНаименование) ИЛИ
		     (СокрЛП(СсылкаПВХправ.Код) <> СтрКод) Тогда
			// Переустановим значения реквизитов в ПВХ согласно значениям в макете
			Сообщение="";
			ОбъектПВХправ = СсылкаПВХправ.ПолучитьОбъект(); 
			
			Если НЕ ПустаяСтрока(СтрКод) Тогда	
				ОбъектПВХправ.Код =	СтрКод;	
			КонецЕсли;
			ОбъектПВХправ.Наименование =		СтрНаименование;
			ОбъектПВХправ.Назначение =			СтрНазначение;
			ОбъектПВХправ.ЭтоНастройка = 		СтрЭтоНастройка;
			ОбъектПВХправ.ЗначениеПоУмолчанию =	ЗнчПоУмолчанию;
			
			// попытаемся сохранить изменения реквизитов элемента ПВХ				
			Попытка
				// при обновлении конфигурации возможна ситуация дублирования наименования с предопределенным элементом
				// постараемся ее отработать путем поиска и переименования устаревшего элемента
				СтарыйЭлемент = ПланыВидовХарактеристик.ПраваИНастройки.НайтиПоНаименованию(СтрНаименование,Истина);
				Если (НЕ СтарыйЭлемент.Пустая()) И (СтарыйЭлемент.Ссылка <> ОбъектПВХправ.Ссылка) Тогда
					СтарыйОбъект = СтарыйЭлемент.ПолучитьОбъект();
					СтарыйОбъект.Наименование = "УСТАРЕЛ "+СтарыйОбъект.Наименование;
					СтарыйОбъект.ОбменДанными.Загрузка = ИСТИНА;
					СтарыйОбъект.Записать();
					Сообщить("Необходима проверка настроек права <"+СтрНаименование+">",СтатусСообщения.Важное);
				КонецЕсли;
				// теперь попробуем записать 
				ОбъектПВХправ.ОбменДанными.Загрузка = ИСТИНА;
				ОбъектПВХправ.Записать();
				Сообщить("Обновлено право <"+СсылкаПВХправ+">",СтатусСообщения.Информация);
			Исключение
				Сообщить("Право <"+СсылкаПВХправ+"> для строки "+НомерСтроки+" макета <"+ИмяМакета+"> не обновлено.
						 |Ошибка: "+ОписаниеОшибки(),СтатусСообщения.Внимание); 
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла; // по строкам макета
	
	//Проверим соответствие назначений прав и записи регистра прав
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПВХПраваИНастройки.Назначение,
	             |	РСПраваИНастройки.Объект,
	             |	РСПраваИНастройки.ПравоНастройка,
	             |	РСПраваИНастройки.Значение
	             |ИЗ
	             |	РегистрСведений.ПраваИНастройки КАК РСПраваИНастройки
	             |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ПраваИНастройки КАК ПВХПраваИНастройки
	             |		ПО РСПраваИНастройки.ПравоНастройка = ПВХПраваИНастройки.Ссылка
	             |ГДЕ
	             |	(ПВХПраваИНастройки.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Компания)
	             |				И НЕ РСПраваИНастройки.Объект = НЕОПРЕДЕЛЕНО
	             |			ИЛИ ПВХПраваИНастройки.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Организация)
	             |				И НЕ РСПраваИНастройки.Объект ССЫЛКА Справочник.Организации
	             |			ИЛИ ПВХПраваИНастройки.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Подразделение)
	             |				И НЕ РСПраваИНастройки.Объект ССЫЛКА Справочник.ПодразделенияКомпании
	             |			ИЛИ ПВХПраваИНастройки.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Пользователь)
	             |				И НЕ РСПраваИНастройки.Объект ССЫЛКА Справочник.Пользователи)";
	тзОшибочныеПрава=Запрос.Выполнить().Выгрузить();
	Для каждого ОшибочноеПраво Из тзОшибочныеПрава Цикл
		
		// Если право "переехало" с компании на организацию
		Если ОшибочноеПраво.Объект = Неопределено И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Организация Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	Организации.Ссылка
				|ИЗ
				|	Справочник.Организации КАК Организации";
			ПеренестиС  = "Компании";
			ПеренестиНа = "Организации";
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа);
			
		// Если право "переехало" с компании на подразделение
		ИначеЕсли ОшибочноеПраво.Объект = Неопределено И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Подразделение Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	ПодразделенияКомпании.Ссылка
				|ИЗ
				|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании";
			ПеренестиС  = "Компании";
			ПеренестиНа = "Подразделения";
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа);
			
		// Если право "переехало" с компании на пользователя
		ИначеЕсли ОшибочноеПраво.Объект = Неопределено И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Пользователь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи";
			ПеренестиС  = "Компании";
			ПеренестиНа = "Пользователей";
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа);
			
		// Если право "переехало" с организации на подразделение
		ИначеЕсли ТипЗнч(ОшибочноеПраво.Объект) = Тип("СправочникСсылка.Организации") И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Подразделение Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	ПодразделенияКомпании.Ссылка
				|ИЗ
				|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
				|ГДЕ
				|	ПодразделенияКомпании.Организация = &Организация";
			ПеренестиС  = "Организации";
			ПеренестиНа = "Подразделения";
			Параметр    = "Организация";
			ЗначениеПараметра = ОшибочноеПраво.Объект;
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа, Параметр, ЗначениеПараметра);
			
		// Если право "переехало" с организации на пользователя
		ИначеЕсли ТипЗнч(ОшибочноеПраво.Объект) = Тип("СправочникСсылка.Организации") И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Пользователь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Организация = &Организация";
			ПеренестиС  = "Организации";
			ПеренестиНа = "Пользователей";
			Параметр    = "Организация";
			ЗначениеПараметра = ОшибочноеПраво.Объект;
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа, Параметр, ЗначениеПараметра);
			
		// Если право "переехало" с подразделение на пользователя
		ИначеЕсли ТипЗнч(ОшибочноеПраво.Объект) = Тип("СправочникСсылка.ПодразделенияКомпании") И ОшибочноеПраво.Назначение = Перечисления.НазначениеПравИНастроек.Пользователь Тогда
			
			ТекстЗапроса = "ВЫБРАТЬ
				|	Пользователи.Ссылка
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.Подразделение = &Подразделение";
			ПеренестиС  = "Подразделения";
			ПеренестиНа = "Пользователей";
			Параметр    = "Подразделение";
			ЗначениеПараметра = ОшибочноеПраво.Объект;
			ВыполнитьПереносПрава(ОшибочноеПраво.Объект, ОшибочноеПраво.Значение, ОшибочноеПраво.ПравоНастройка, ТекстЗапроса, ПеренестиС, ПеренестиНа, Параметр, ЗначениеПараметра);
			
		// Если право было некорректным или "переехало" вверх по иерархии
		Иначе
			НаборДляУдаления=РегистрыСведений.ПраваИНастройки.СоздатьНаборЗаписей();
			НаборДляУдаления.Отбор.Объект.Значение=ОшибочноеПраво.Объект;
			НаборДляУдаления.Отбор.Объект.Использование=Истина;
			НаборДляУдаления.Отбор.ПравоНастройка.Значение=ОшибочноеПраво.ПравоНастройка;
			НаборДляУдаления.Отбор.ПравоНастройка.Использование=Истина;
			НаборДляУдаления.Прочитать();
			НаборДляУдаления.Очистить();
			Попытка
				НаборДляУдаления.Записать();
				Сообщить("Удалена настройка права <"+ОшибочноеПраво.ПравоНастройка+"> для <"+ОшибочноеПраво.Объект+">.");
			Исключение
				Сообщить("Ошибка удаления настройки права <"+ОшибочноеПраво.ПравоНастройка+"> для <"+ОшибочноеПраво.Объект+">: "+ОписаниеОшибки(),СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ИнициализироватьПраваИНастройки()
#КонецЕсли

// Процедура выполняет перенос права с более высокого уровня объекта права на подчиненные более низкие
//
Процедура ВыполнитьПереносПрава(ОшибочноеПравоОбъект, 
								ОшибочноеПравоЗначение,
								ОшибочноеПравоПравоНастройка,
								ТекстЗапроса,
								ПеренестиС,
								ПеренестиНа,
								Параметр=Неопределено,
								ЗначениеПараметра=Неопределено)
	
	НаборДляУдаления = РегистрыСведений.ПраваИНастройки.СоздатьНаборЗаписей();
	НаборДляУдаления.Отбор.Объект.Значение = ОшибочноеПравоОбъект;
	НаборДляУдаления.Отбор.Объект.Использование = Истина;
	НаборДляУдаления.Отбор.ПравоНастройка.Значение = ОшибочноеПравоПравоНастройка;
	НаборДляУдаления.Отбор.ПравоНастройка.Использование = Истина;
	НаборДляУдаления.Прочитать();
	НаборДляУдаления.Очистить();
	Если НЕ ОшибочноеПравоОбъект = Неопределено Тогда
		ПеренестиСОшибочногоПраваОбъект = ">=<"+Строка(ОшибочноеПравоОбъект);
	Иначе
		ПеренестиСОшибочногоПраваОбъект = "";
	КонецЕсли;
	Попытка
		НаборДляУдаления.Записать();
		Сообщить("Выполняется перенос настройки права <"+ОшибочноеПравоПравоНастройка+"> с <"+ПеренестиС+ПеренестиСОшибочногоПраваОбъект+"> на "+
			?(ОшибочноеПравоПравоНастройка.Назначение=Перечисления.НазначениеПравИНастроек.Пользователь, "подчиненных ", "подчиненные ")+"<"+ПеренестиНа+">.");
	Исключение
		Сообщить("Ошибка переноса настройки права <"+ОшибочноеПравоПравоНастройка+"> с <"+ПеренестиС+">=<"+ОшибочноеПравоОбъект+"> на <"+ПеренестиНа+">: "+ОписаниеОшибки(),СтатусСообщения.Важное);
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если НЕ Параметр = Неопределено И НЕ ЗначениеПараметра = Неопределено Тогда
		Запрос.УстановитьПараметр(Параметр, ЗначениеПараметра);
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	НаборПрав = РегистрыСведений.ПраваИНастройки.СоздатьНаборЗаписей();
	НаборПрав.Прочитать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовоеПраво = НаборПрав.Добавить();
		НовоеПраво.Объект = ВыборкаДетальныеЗаписи.Ссылка;
		НовоеПраво.ПравоНастройка = ОшибочноеПравоПравоНастройка;
		НовоеПраво.Значение = ОшибочноеПравоЗначение;
	КонецЦикла;
	
	Попытка
		НаборПрав.Записать();
		Сообщить("Настройка права <"+ОшибочноеПравоПравоНастройка+"> перенесена с <"+ПеренестиС+ПеренестиСОшибочногоПраваОбъект+"> на "+
			?(ОшибочноеПравоПравоНастройка.Назначение=Перечисления.НазначениеПравИНастроек.Пользователь, "подчиненных ", "подчиненные ")+"<"+ПеренестиНа+">.");
	Исключение
		Сообщить("Ошибка переноса настройки права <"+ОшибочноеПравоПравоНастройка+"> с <"+ПеренестиС+">=<"+ОшибочноеПравоОбъект+"> на <"+ПеренестиНа+">: "+ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
	Сообщить("-------------------------------------------------------------");
	
КонецПроцедуры

// Процедура проверяет существование правил префиксации
// для каждого вида объекта справочников и документов.
// В случае, если значение по умолчанию не найдено, создает новое
//
// Без параметров
//
Процедура ПроверитьПравилаПрефиксации() Экспорт
	
	// Правила префиксации проверяются только в центральной ИБ
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Проверка правил префиксации объектов ...");
	#КонецЕсли
	
	ЕстьУРБД = НЕ Метаданные.ПланыОбмена.Найти("УдаленныеПодразделения") = Неопределено;
	Если ЕстьУРБД Тогда
		СоставПланаОбмена = Метаданные.ПланыОбмена["УдаленныеПодразделения"].Состав;
	КонецЕсли;
	
	Менеджер = ПланыВидовХарактеристик.ПраваИНастройки;
	
	//ПРОВЕРКА ПРЕФИКСАЦИИ СПРАВОЧНИКОВ
	
	ГруппаРодительСправочники = Менеджер.ПрефиксацияСправочников.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительСправочники);
	СправочникиЗаполнены = Выборка.Следующий();
	ПрефиксКода = Лев(ГруппаРодительСправочники.Код, 2);
	
	СтараяГруппа = ГруппаРодительСправочники;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Справочники.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ПРЕФИКСАЦИЯ СПРАВОЧНИКОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СправочникиЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		СправочникиЗаполнены = Выборка.Следующий();
	КонецЕсли;
	ИскатьСтарые = ?(ГруппаРодительСправочники = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Справочники Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		Если Имя = "КлассификаторСтранМира" ИЛИ
			 Имя = "КлассификаторЕдиницИзмерения" ИЛИ
			 Имя = "КлассификаторТНВЭД" ИЛИ 
			 Имя = "Компьютеры" ИЛИ
			 Имя = "Оборудование" ИЛИ
			 Имя = "ГруппыТоваровОборудования" ИЛИ
			 Имя = "Валюты" ИЛИ
			 Имя = "Банки" ИЛИ
			 Имя = "ХозОперации" ИЛИ
			 Имя = "Пользователи" ИЛИ
			 Имя = "СтавкиНДС" ИЛИ 
			 Имя = "ЯчейкиХранения"  ИЛИ
			 Имя = "КлассификаторОКПД2" ИЛИ
			 Имя = "КодыОперацийПрослеживаемости" Тогда
		
			 Префиксация = "";
			 
		Иначе
			Префиксация = ""; 
			Если ЕстьУРБД Тогда
				// Проверку корректности объекта осуществляем только для включенных в состав плана обмена
				Если СоставПланаОбмена.Содержит(ТекСтрока) Тогда
					СтрСообщения = "";
					Если Строка(ТекСтрока.ТипКода) = "Число" Тогда
						СтрСообщения = СтрСообщения + "
									   |	- установлен неверный тип кода";
					
					ИначеЕсли ТекСтрока.ДлинаКода < 8 Тогда
						СтрСообщения = СтрСообщения + "
									   |	- установлена неверная длина кода";
					КонецЕсли;
					
					Если НЕ ТекСтрока.АвтоНумерация Тогда
						СтрСообщения = СтрСообщения + "
									   |	- отключена автонумерация кода";
					КонецЕсли;
					Если НЕ ТекСтрока.КонтрольУникальности Тогда
						СтрСообщения = СтрСообщения + "
									   |	- отключен контроль уникальности кода";
					конецЕсли;
					
					Если НЕ ПустаяСтрока(СтрСообщения) Тогда
						Сообщить("ВНИМАНИЕ! Для справочника """ + ТекСтрока.Имя + """ обнаружены следующие несоответствия:" + СтрСообщения + "
						         |Установка режима префиксации для данного объекта невозможна!", СтатусСообщения.Важное);
						
						Продолжить;
					КонецЕсли;
					
					Префиксация = "[У]";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим префиксации " + Имя, Истина, ГруппаРодительСправочники);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим префиксации " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		МассивТипов = Новый Массив(1);
		МассивТипов[0] = ТипЗнч(Префиксация);
		ОписаниеТипаПрефикса = Новый ОписаниеТипов(МассивТипов);
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Режим префиксации " + Имя;
			ТекОбъект.ТипЗначения  = ОписаниеТипаПрефикса;
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Компания;
			ТекОбъект.ЭтоНастройка = Истина;
			ЕстьИзменения = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если ТекОбъект.ТипЗначения <> ОписаниеТипаПрефикса Тогда
				ТекОбъект.ТипЗначения = ОписаниеТипаПрефикса;
				ЕстьИзменения = Истина;
			КонецЕсли; 
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительСправочники или
			 ТекОбъект.ЗначениеПоУмолчанию <> Префиксация Тогда
			ТекОбъект.Родитель            = ГруппаРодительСправочники;
			ТекОбъект.ЗначениеПоУмолчанию = Префиксация;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
			ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
		Если ТекОбъект.ЭтоНовый() и СправочникиЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать правила префиксации и миграции
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;	
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих справочников
	УдалитьПраваНесуществующихОбъектов(Метаданные.Справочники,ГруппаРодительСправочники,"Режим префиксации ");
	
	//ПРОВЕРКА ПРЕФИКСАЦИИ ДОКУМЕНТОВ
	
	// Теперь заполним префиксацию по умолчанию для документов
	ГруппаРодительДокументы = Менеджер.ПрефиксацияДокументов.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительДокументы);
	ДокументыЗаполнены = Выборка.Следующий();
	ПрефиксКода = Лев(ГруппаРодительДокументы.Код, 2);
	
	СтараяГруппа = ГруппаРодительДокументы;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Документы.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ПРЕФИКСАЦИЯ ДОКУМЕНТОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДокументыЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		ДокументыЗаполнены = Выборка.Следующий();
	КонецЕсли;
    ИскатьСтарые = ?(ГруппаРодительДокументы = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Документы Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		
		// Проверку корректности объекта осуществляем только для включенных в состав плана обмена
		Если СоставПланаОбмена.Содержит(ТекСтрока) Тогда
			СтрСообщения = "";
			Если Строка(ТекСтрока.ТипНомера) = "Число" Тогда
				СтрСообщения = СтрСообщения + "
							   |	- установлен неверный тип номера";
			КонецЕсли;
			Если ТекСтрока.ДлинаНомера < 10 Тогда
				СтрСообщения = СтрСообщения + "
							   |	- установлена неверная длина номера";
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(СтрСообщения) Тогда
				Сообщить("ВНИМАНИЕ! Для документа """ + Имя + """ обнаружены следующие несоответствия:" + СтрСообщения + "
				         |Установка режима префиксации для данного объекта невозможна!", СтатусСообщения.Важное);
				
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекСтрока.Реквизиты.Найти("РегламентированныйУчет") = Неопределено Тогда
			  Префиксация = "[П]";
		Иначе Префиксация = "[О]";
		КонецЕсли;
		
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим префиксации " + Имя, Истина, ГруппаРодительДокументы);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим префиксации " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		МассивТипов = Новый Массив(1);
		МассивТипов[0] = ТипЗнч(Префиксация);
		ОписаниеТипаПрефикса = Новый ОписаниеТипов(МассивТипов);
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Режим префиксации " + Имя;
			ТекОбъект.ТипЗначения  = ОписаниеТипаПрефикса;
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Компания;
			ТекОбъект.ЭтоНастройка = Истина;
			ЕстьИзменения = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если ТекОбъект.ТипЗначения <> ОписаниеТипаПрефикса Тогда
				ТекОбъект.ТипЗначения = ОписаниеТипаПрефикса;
				ЕстьИзменения = Истина;
			КонецЕсли; 
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительДокументы ИЛИ
			 ТекОбъект.ЗначениеПоУмолчанию <> Префиксация Тогда
			ТекОбъект.Родитель            = ГруппаРодительДокументы;
			ТекОбъект.ЗначениеПоУмолчанию = Префиксация;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
			ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
		Если ТекОбъект.ЭтоНовый() и ДокументыЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать правила префиксации и миграции
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих документов
	УдалитьПраваНесуществующихОбъектов(Метаданные.Документы,ГруппаРодительДокументы,"Режим префиксации ");
	
	Если НЕ СправочникиЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил префиксации справочников!", СтатусСообщения.Внимание);
	КонецЕсли;
	Если НЕ ДокументыЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил префиксации документов!", СтатусСообщения.Внимание);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПравилаПрефиксации()

// Процедура проверяет существование правил фильтрации
// для каждого вида объекта справочников.
// В случае, если значение по умолчанию не найдено, создает новое
//
// Без параметров
//
Процедура ПроверитьПравилаФильтрации() Экспорт
	
	// Правила фильтрации проверяются только в центральной ИБ
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Проверка правил фильтрации объектов ...");
	#КонецЕсли
	
	Менеджер = ПланыВидовХарактеристик.ПраваИНастройки;
	
	ГруппаРодительСправочники = Менеджер.ФильтрацияСправочников.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительСправочники);
	СправочникиЗаполнены = Выборка.Следующий();
	Код_ = ГруппаРодительСправочники.Код;
		
	СтараяГруппа = ГруппаРодительСправочники;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Справочники.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ФИЛЬТРАЦИЯ СПРАВОЧНИКОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СправочникиЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		СправочникиЗаполнены = Выборка.Следующий();
	КонецЕсли;
	ИскатьСтарые = ?(ГруппаРодительСправочники = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Справочники Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		Имя = ТекСтрока.Имя;
		Фильтрация = Перечисления.РежимФильтрации.НеФильтровать;
		
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим фильтрации " + Имя, Истина, ГруппаРодительСправочники);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим фильтрации " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			МассивТипов = Новый Массив(1);
			МассивТипов[0] = ТипЗнч(Фильтрация);
			
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Режим фильтрации " + Имя;
			ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Пользователь;
			ТекОбъект.ЭтоНастройка = Истина;
			
			ЕстьИзменения = Истина;
			
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительСправочники или
			 ТекОбъект.ЗначениеПоУмолчанию <> Фильтрация Тогда
			ТекОбъект.Родитель            = ГруппаРодительСправочники;
			ТекОбъект.ЗначениеПоУмолчанию = Фильтрация;
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Код_ <> ТекОбъект.Код Тогда
			ТекОбъект.УстановитьНовыйКод();
			ЕстьИзменения = Истина;
		КонецЕсли;
				
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;	
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих справочников
	УдалитьПраваНесуществующихОбъектов(Метаданные.Справочники,ГруппаРодительСправочники,"Режим фильтрации ");
	
	// Теперь заполним фильтрацию по умолчанию для документов
	ГруппаРодительДокументы = Менеджер.ФильтрацияДокументов.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительДокументы);
	ДокументыЗаполнены = Выборка.Следующий();
	Код_ = ГруппаРодительДокументы.Код;
		
	СтараяГруппа = ГруппаРодительДокументы;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Документы.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ФИЛЬТРАЦИЯ ДОКУМЕНТОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДокументыЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		ДокументыЗаполнены = Выборка.Следующий();
	КонецЕсли;
	ИскатьСтарые = ?(ГруппаРодительДокументы = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Документы Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		Фильтрация = Перечисления.РежимФильтрации.НеФильтровать;
		
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим фильтрации " + Имя, Истина, ГруппаРодительДокументы);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Режим фильтрации " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			МассивТипов = Новый Массив(1);
			МассивТипов[0] = ТипЗнч(Фильтрация);
			
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Режим фильтрации " + Имя;
			ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Пользователь;
			ТекОбъект.ЭтоНастройка = Истина;
			
			ЕстьИзменения = Истина;
			
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительДокументы или
			 ТекОбъект.ЗначениеПоУмолчанию <> Фильтрация Тогда
			ТекОбъект.Родитель            = ГруппаРодительДокументы;
			ТекОбъект.ЗначениеПоУмолчанию = Фильтрация;
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Код_ <> ТекОбъект.Код Тогда
			ТекОбъект.УстановитьНовыйКод();
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
		Если ТекОбъект.ЭтоНовый() и ДокументыЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать правила префиксации и миграции
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
					 |плана видов характеристик ""Права и настройки""!
					 |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих документов
	УдалитьПраваНесуществующихОбъектов(Метаданные.Документы,ГруппаРодительДокументы,"Режим фильтрации ");
	
	Если НЕ СправочникиЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил фильтрации справочников!", СтатусСообщения.Важное);
	КонецЕсли;
	Если НЕ ДокументыЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил фильтрации документов!", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры // ПроверитьПравилаФильтрации()

// Процедура проверяет существование правил доступа
// для каждого вида объекта справочников и документов.
// В случае, если значение по умолчанию не найдено, создает новое
//
// Без параметров
//
Процедура ПроверитьПраваДоступа() Экспорт
	
	// Права доступа проверяются только в центральной ИБ
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Состояние("Проверка правил настройки доступа ...");
	#КонецЕсли
	
	Менеджер = ПланыВидовХарактеристик.ПраваИНастройки;
	
	ГруппаРодительСправочники = Менеджер.ПраваДоступаСправочников.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительСправочники);
	СправочникиЗаполнены = Выборка.Следующий();
	ПрефиксКода = Лев(ГруппаРодительСправочники.Код, 2);
	
	СтараяГруппа = ГруппаРодительСправочники;
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Справочники.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ПРАВА ДОСТУПА СПРАВОЧНИКОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СправочникиЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		СправочникиЗаполнены = Выборка.Следующий();
	КонецЕсли;
	ИскатьСтарые = ?(ГруппаРодительСправочники = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Справочники Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		
		ВидыПравДляСправочников = Перечисления.ВидыПравДляСправочников.Редактирование; 
			
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Право доступа " + Имя, Истина, ГруппаРодительСправочники);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Право доступа " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		МассивТипов = Новый Массив(1);
		МассивТипов[0] = ТипЗнч(ВидыПравДляСправочников);
		
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Право доступа " + Имя;
			ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Пользователь;
			ТекОбъект.ЭтоНастройка = Ложь;
			ЕстьИзменения = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если (ТекОбъект.ТипЗначения.Типы().Количество() <> 1) И (НЕ ТекОбъект.ЭтоГруппа) Тогда
				ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительСправочники или
			 ТекОбъект.ЗначениеПоУмолчанию <> ВидыПравДляСправочников Тогда
			ТекОбъект.Родитель            = ГруппаРодительСправочники;
			ТекОбъект.ЗначениеПоУмолчанию = ВидыПравДляСправочников;
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
			ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
		Если ТекОбъект.ЭтоНовый() и СправочникиЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать настройку доступа 
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;	
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих справочников
	УдалитьПраваНесуществующихОбъектов(Метаданные.Справочники,ГруппаРодительСправочники,"Право доступа ");
	
	// Теперь заполним права доступа по умолчанию для документов
	ГруппаРодительДокументы = Менеджер.ПраваДоступаДокументов.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительДокументы);
	ДокументыЗаполнены = Выборка.Следующий();
	ПрефиксКода = Лев(ГруппаРодительДокументы.Код, 2);
	
	СтараяГруппа = ГруппаРодительДокументы;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель",     Менеджер.Документы.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ПРАВА ДОСТУПА ДОКУМЕНТОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДокументыЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		ДокументыЗаполнены = Выборка.Следующий();
	КонецЕсли;
    ИскатьСтарые = ?(ГруппаРодительДокументы = СтараяГруппа, Ложь, Истина);
	
	Для Каждого ТекСтрока Из Метаданные.Документы Цикл
		Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		
		ВидыПравДляДокументов = Перечисления.ВидыПравДляДокументов.РедактированиеВсе;
		
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		                                               
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Право доступа " + Имя, Истина, ГруппаРодительДокументы);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Право доступа " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		МассивТипов = Новый Массив(1);
		МассивТипов[0] = ТипЗнч(ВидыПравДляДокументов);
		
		ЕстьИзменения = Ложь;
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Право доступа " + Имя;
			ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Пользователь;
			ТекОбъект.ЭтоНастройка = Ложь;
			ЕстьИзменения = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если (ТекОбъект.ТипЗначения.Типы().Количество() <> 1) И (НЕ ТекОбъект.ЭтоГруппа) Тогда
				ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
		
		Если ТекОбъект.Родитель <> ГруппаРодительДокументы или
			 ТекОбъект.ЗначениеПоУмолчанию <> ВидыПравДляДокументов Тогда
			ТекОбъект.Родитель            = ГруппаРодительДокументы;
			ТекОбъект.ЗначениеПоУмолчанию = ВидыПравДляДокументов;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
			ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
			
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			ТекОбъект.Записать();
		КонецЕсли;
		
		Если ТекОбъект.ЭтоНовый() и ДокументыЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать настройку доступа
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих документов
	УдалитьПраваНесуществующихОбъектов(Метаданные.Документы,ГруппаРодительДокументы,"Право доступа ");
	
	/////////////////////////////
	
	// Теперь заполним права утверждения по умолчанию для документов
	МассивГрупп = Новый Массив();
	МассивГрупп.Добавить(Менеджер.УтверждениеДокументовПользователь.Ссылка);
	МассивГрупп.Добавить(Менеджер.УтверждениеДокументовПодразделение.Ссылка);
	
	Для Инд = 0 По МассивГрупп.ВГраница() Цикл
	    ГруппаРодительДокументы = МассивГрупп[Инд];
		
		Выборка = Менеджер.Выбрать(ГруппаРодительДокументы);
		УтвержденияДокументыЗаполнены = Выборка.Следующий();
		ПрефиксКода = Лев(ГруппаРодительДокументы.Код,2); //\\
		
		СтараяГруппа = ГруппаРодительДокументы;
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
		|ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
		|ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
		|    ПраваИНастройки.Родитель = &Родитель И
		|    ПраваИНастройки.Предопределенный = ЛОЖЬ И
		|    ПОДСТРОКА(ПраваИНастройки.Наименование,1,22) = &Наименование";
		Запрос.УстановитьПараметр("Родитель",     Менеджер.Документы.Ссылка);
		Запрос.УстановитьПараметр("Наименование", "УТВЕРЖДЕНИЕ ДОКУМЕНТОВ");
		
		РезЗапроса = Запрос.Выполнить();
		Если НЕ РезЗапроса.Пустой() Тогда
			Выборка = РезЗапроса.Выбрать();
			Если Выборка.Следующий() Тогда
				СтараяГруппа = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ УтвержденияДокументыЗаполнены Тогда
			Выборка = Менеджер.Выбрать(СтараяГруппа);
			ДокументыЗаполнены = Выборка.Следующий();
		КонецЕсли;
		ИскатьСтарые = ?(ГруппаРодительДокументы = СтараяГруппа, Ложь, Истина);
		
		Для Каждого ТекСтрока Из Метаданные.Документы Цикл
			Если ТекСтрока = Неопределено Тогда Продолжить; КонецЕсли;
			
			Имя = ТекСтрока.Имя;
			
			ВидУтвержденияДляДокументов = Ложь;
			
			МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
			
			Если ГруппаРодительДокументы = Менеджер.УтверждениеДокументовПользователь.Ссылка Тогда
				ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Утверждение по пользователю " + Имя, Истина, ГруппаРодительДокументы);
				Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
					ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Утверждение по пользователю " + Имя, Истина, СтараяГруппа);
				КонецЕсли;
			Иначе
				ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Утверждение по подразделению " + Имя, Истина, ГруппаРодительДокументы);
				Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
					ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Утверждение по подразделению " + Имя, Истина, СтараяГруппа);
				КонецЕсли;
			КонецЕсли;
			
			ЕстьИзменения = Ложь;
			Если ТекСсылка.Пустая() Тогда
				МассивТипов = Новый Массив(1);
				МассивТипов[0] = Тип("Булево");
				
				ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
				ТекОбъект.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
				Если ГруппаРодительДокументы = Менеджер.УтверждениеДокументовПользователь.Ссылка Тогда
				    ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Пользователь;
					ТекОбъект.Наименование = "Утверждение по пользователю " + Имя;
				Иначе	
				    ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Подразделение;
					ТекОбъект.Наименование = "Утверждение по подразделению " + Имя;
				КонецЕсли; 
				
				ТекОбъект.ЭтоНастройка = Ложь;
				
				ЕстьИзменения = Истина;
				
			Иначе
				ТекОбъект = ТекСсылка.ПолучитьОбъект();
			КонецЕсли;
			
			Если ТекОбъект.Родитель <> ГруппаРодительДокументы или
				ТекОбъект.ЗначениеПоУмолчанию <> ВидУтвержденияДляДокументов Тогда
				ТекОбъект.Родитель            = ГруппаРодительДокументы;
				ТекОбъект.ЗначениеПоУмолчанию = ВидУтвержденияДляДокументов;
				
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
				ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
				
				ЕстьИзменения = Истина;
			КонецЕсли;
			
			Если ЕстьИзменения Тогда
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Если ТекОбъект.ЭтоНовый() и УтвержденияДокументыЗаполнены Тогда
				Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
				|Необходимо отредактировать настройку доступа
				|для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЦикла; 
	
		
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);	
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;

	///////////////////////
	
	Если НЕ СправочникиЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил настройки доступа справочников!", СтатусСообщения.Внимание);
	КонецЕсли;
	Если НЕ ДокументыЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил настройки доступа документов!", СтатусСообщения.Внимание);
	КонецЕсли;
	Если НЕ УтвержденияДокументыЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил утверждения документов!", СтатусСообщения.Внимание);
	КонецЕсли;

КонецПроцедуры // ПроверитьПраваДоступа()

// Процедура проверяет существование правил миграции
// для каждого вида объекта документов.
// В случае, если значение по умолчанию не найдено, создает новое
//
// Параметры
//   Нет
//
Процедура ПроверитьПравилаМиграции() Экспорт
	
	// на всякий случай проверим наличие плана обмена
	ЕстьУРБД = НЕ Метаданные.ПланыОбмена.Найти("УдаленныеПодразделения") = Неопределено;
	Если ЕстьУРБД Тогда
		СоставПланаОбмена = Метаданные.ПланыОбмена["УдаленныеПодразделения"].Состав;
	Иначе
		Возврат;
	КонецЕсли;

	// Определим правило миграции по умолчанию (при обновлении релиза)
	// Только для центрального узла - по остальным разойдется при обмене
	МассивУзлов = одОбменДанными.ПолныйСписокУзловОбмена("УдаленныеПодразделения");
	ПравилоМиграцииПоУмолчанию = Справочники.ПравилаМиграцииИДоступа.ПустаяСсылка();
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		// это центральный узел
		Если МассивУзлов.Количество() = 0 Тогда
			// есть только центр. узел - обмена не производилось
			ПравилоМиграцииПоУмолчанию = Справочники.ПравилаМиграцииИДоступа.ПолнаяМиграция;
		Иначе	
			// обмен уже возможно был
			ПравилоМиграцииПоУмолчанию = Справочники.ПравилаМиграцииИДоступа.МиграцияПоПодразделениямУзлов;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли; 
	
	#Если Клиент Тогда
	Состояние("Проверка правил миграции документов ...");
	#КонецЕсли
	
	Менеджер = ПланыВидовХарактеристик.ПраваИНастройки;
	
	//ПРОВЕРКА ПРАВИЛ МИГРАЦИИ ДОКУМЕНТОВ
	
	// Теперь заполним по умолчанию
	ГруппаРодительДокументы = Менеджер.ПравилаМиграцииДокументов.Ссылка;
	Выборка = Менеджер.Выбрать(ГруппаРодительДокументы);
	ДокументыЗаполнены = Выборка.Следующий();
	ПрефиксКода = Лев(ГруппаРодительДокументы.Код, 2);
	
	СтараяГруппа = ГруппаРодительДокументы;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПраваИНастройки.Ссылка КАК Ссылка
				   |ИЗ ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
				   |ГДЕ ПраваИНастройки.ЭтоГруппа = ИСТИНА И
				   |    ПраваИНастройки.Родитель = &Родитель И
				   |    ПраваИНастройки.Предопределенный = ЛОЖЬ И
				   |    ПраваИНастройки.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Родитель", Менеджер.Документы.Ссылка);
	Запрос.УстановитьПараметр("Наименование", "ПРАВИЛА МИГРАЦИИ ДОКУМЕНТОВ");
	
	РезЗапроса = Запрос.Выполнить();
	Если НЕ РезЗапроса.Пустой() Тогда
		Выборка = РезЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СтараяГруппа = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДокументыЗаполнены Тогда
		Выборка = Менеджер.Выбрать(СтараяГруппа);
		ДокументыЗаполнены = Выборка.Следующий();
	КонецЕсли;
    ИскатьСтарые = ?(ГруппаРодительДокументы = СтараяГруппа, Ложь, Истина);
	
	ТипПравилоМиграции = Тип("СправочникСсылка.ПравилаМиграцииИДоступа");
	МассивТипов = Новый Массив(1);
	МассивТипов[0] = ТипПравилоМиграции;
	ОписаниеТипаПрефикса = Новый ОписаниеТипов(МассивТипов);
	НаборЗаписей = РегистрыСведений.ПраваИНастройки.СоздатьНаборЗаписей();
	// Обойдем все виды документов и проверим наличие по ним правила
	Для Каждого ТекСтрока Из Метаданные.Документы Цикл
		
		ЕстьИзменения = Ложь;
		СозданНовый   = Ложь;
		
		Если ТекСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ Метаданные.ПланыОбмена.УдаленныеПодразделения.Состав.Содержит(ТекСтрока) Тогда
			Продолжить; // данный вид документа не мигрирует
		КонецЕсли;
		
		Имя = ТекСтрока.Имя;
		МенеджерЗаписи = ПланыВидовХарактеристик.ПраваИНастройки;
		
		ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Правило миграции документа " + Имя, Истина, ГруппаРодительДокументы);
		Если ТекСсылка.Пустая() и ИскатьСтарые Тогда
			ТекСсылка = МенеджерЗаписи.НайтиПоНаименованию("Правило миграции документа " + Имя, Истина, СтараяГруппа);
		КонецЕсли;
		
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = МенеджерЗаписи.СоздатьЭлемент();
			ТекОбъект.Наименование = "Правило миграции документа " + Имя;
			ТекОбъект.ТипЗначения  = Новый ОписаниеТипов("СправочникСсылка.ПравилаМиграцииИДоступа");
			ТекОбъект.Назначение   = Перечисления.НазначениеПравИНастроек.Компания;
			ТекОбъект.ЭтоНастройка = Ложь;
			ТекОбъект.ЗначениеПоУмолчанию = ПравилоМиграцииПоУмолчанию;
			ЕстьИзменения = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если ТекОбъект.ТипЗначения <> ОписаниеТипаПрефикса Тогда
				ТекОбъект.ТипЗначения = ОписаниеТипаПрефикса;
				ЕстьИзменения = Истина;
			КонецЕсли; 
		КонецЕсли;
		// заполним правило миграции по умолчанию
		Если ТекОбъект.Родитель <> ГруппаРодительДокументы Тогда
			ТекОбъект.Родитель  = ГруппаРодительДокументы;
			ЕстьИзменения 		= Истина;
		КонецЕсли;
		
        Если Лев(ТекОбъект.Код, 2) <> ПрефиксКода Тогда
			ТекОбъект.УстановитьНовыйКод(ПрефиксКода);
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			СозданНовый = ТекОбъект.ЭтоНовый();
			Попытка
			    ТекОбъект.Записать();
			Исключение
				ТекОбъект.УстановитьНовыйКод();
				ТекОбъект.Записать();
			КонецПопытки;
			ПравоСсылка = ТекОбъект.Ссылка;
			Попытка
				НаборЗаписей.Отбор.ПравоНастройка.Установить(ПравоСсылка);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() = 0 Тогда
			    	НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Объект = Неопределено;
					НоваяЗапись.ПравоНастройка = ПравоСсылка;
					НоваяЗапись.Значение = ПравилоМиграцииПоУмолчанию;
				Иначе
					НоваяЗапись = НаборЗаписей[0];
			    	НоваяЗапись.Объект = Неопределено;
					Если НЕ ЗначениеЗаполнено(НоваяЗапись.Значение) Тогда
				    	НоваяЗапись.Значение = ПравилоМиграцииПоУмолчанию;
					КонецЕсли; 
				КонецЕсли; 
				НаборЗаписей.Записать();
			Исключение
				Сообщить("ВНИМАНИЕ! Ошибка при сохранении значения правила миграции для документа """ + ТекСтрока.Представление() +"""
						|Описание ошибки: " + ОписаниеОшибки() + "
				        |Необходимо вручную установить правильное значение правила миграции в правах и настройках!", СтатусСообщения.Внимание);
			КонецПопытки;
		КонецЕсли;
		
		Если СозданНовый и ДокументыЗаполнены Тогда
			Сообщить("ВНИМАНИЕ! Обнаружен новый объект, включенный в состав плана обмена!
					 |Необходимо отредактировать правила миграции
					 |для вида объектов: """ + ТекСтрока.Представление() + """!", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЦикла;
	
	// Удалим старую группу, созданную программно
	Если ИскатьСтарые и НЕ СтараяГруппа.Пустая() Тогда
		Попытка
			СтараяГруппа.ПолучитьОбъект().УстановитьПометкуУдаления(Истина, Истина);
			Сообщить("ВНИМАНИЕ! Установлена пометка удаления не используемой группы: """ + СтараяГруппа + """
			         |плана видов характеристик ""Права и настройки""!
			         |Произведите удаление помеченных объектов!", СтатусСообщения.Внимание);
		Исключение КонецПопытки;
	КонецЕсли;
	
	//Пометим на удаление права, для несуществующих документов
	УдалитьПраваНесуществующихОбъектов(Метаданные.Документы,ГруппаРодительДокументы,"Правило миграции документа ");
	
	Если НЕ ДокументыЗаполнены Тогда
		Сообщить("ВНИМАНИЕ! Произведено первичное заполнение правил миграции документов!", СтатусСообщения.Внимание);
	КонецЕсли;
КонецПроцедуры

// Помечает на удаление права доступа, правил префиксации и пр. для несуществующих объектов метаданных
//
// Параметры
//  ОбъектыМетаданных	– Коллекция метаданных конфигурации (например Метаданные.Справочники)
//  ГруппаРодитель		– ПВХ.ПраваИНастройки.Ссылка – Ссылка на группу поиска лишних прав
//  ПрефиксПрава		– Строка – Префикс наименования проверяемых прав 
//
Процедура УдалитьПраваНесуществующихОбъектов(ОбъектыМетаданных,ГруппаРодитель,ПрефиксПрава)
	//Пометим на удаление права, для несуществующих документов
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ПраваИНастройки.Ссылка КАК Ссылка,
	             |	ПраваИНастройки.Наименование КАК Наименование
	             |ИЗ
	             |	ПланВидовХарактеристик.ПраваИНастройки КАК ПраваИНастройки
	             |ГДЕ
	             |	ПраваИНастройки.ПометкаУдаления = ЛОЖЬ
	             |	И ПраваИНастройки.ЭтоГруппа = ЛОЖЬ
	             |	И ПраваИНастройки.Родитель = &Родитель
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
	Запрос.УстановитьПараметр("Родитель",ГруппаРодитель);
	Выборка=Запрос.Выполнить().Выбрать();
	ДлинаПрефикса=СтрДлина(ПрефиксПрава);
	Пока Выборка.Следующий() Цикл
		Имя=Выборка.Наименование;
		Позиция=Найти(Имя,ПрефиксПрава);
		Если Позиция>0 Тогда
			Имя=Сред(Имя,Позиция+ДлинаПрефикса);
		КонецЕсли;
		Если ОбъектыМетаданных.Найти(Имя)=Неопределено Тогда
			Право=Выборка.Ссылка.ПолучитьОбъект();
			Попытка
				Право.УстановитьПометкуУдаления(Истина);
			Исключение
				Сообщить("Ошибка пометки на удаление права <"+Выборка.Ссылка+">: "+ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки; 
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры // УдалитьПраваНесуществующихОбъектов()

// Обработка изменения реквизитов справочников
//
// Параметры
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
//
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	Если НЕ Отказ Тогда
		// Проверим ограничение по типам, т.к. поддерживается строго один тип для каждого элемента
		Если (ЭтотОбъект.ТипЗначения.Типы().Количество() <> 1) и (НЕ ЭтотОбъект.ЭтоГруппа) Тогда
			//Отказ = Истина;
			Сообщить("Должен быть указан единственный тип возможных значений! Запись элемента <"+СокрЛП(ЭтотОбъект)+"> отменена!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
