Процедура УдалитьЗначенияЗаПериодДобавленныеРаньшеДаты() 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_ЗначенияПоказателей.Период КАК Период,
	                      |	БТ_ЗначенияПоказателей.Показатель КАК Показатель,
	                      |	БТ_ЗначенияПоказателей.Организация КАК Организация,
	                      |	БТ_ЗначенияПоказателей.Подразделение КАК Подразделение
	                      |ИЗ
	                      |	РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
	                      |ГДЕ
	                      |	БТ_ЗначенияПоказателей.Период МЕЖДУ &Дата1 И &Дата2
	                      |	И НЕ БТ_ЗначенияПоказателей.Показатель.РучнойПоказатель
	                      |	И НЕ БТ_ЗначенияПоказателей.План
	                      |	И БТ_ЗначенияПоказателей.ДатаДобавления < &ДатаДобавления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период");
		Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
		Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
		Запрос.УстановитьПараметр("ДатаДобавления", ДобавленРаньшеДаты);
		
			
		Выборка = запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Наб = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьНаборЗаписей();
			Наб.Отбор.Период.Установить(Выборка.Период);
			Наб.Отбор.Показатель.Установить(Выборка.Показатель);
			Наб.Отбор.Организация.Установить(Выборка.Организация);
			Наб.Отбор.План.Установить(Ложь);
			Наб.Отбор.Подразделение.Установить(Выборка.Подразделение);
			Наб.Записать();
		КонецЦикла;	

КонецПроцедуры	

Процедура Сформировать() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Подразделения.Количество() Тогда
		Инициалиация();
	КонецЕсли;	
	
	Сообщить("Начало расчета " + ТекущаяДатаСеанса());

	Если Период.ДатаНачала >= НачалоДня(ТекущаяДатаСеанса()) и Не ТолькоУдаление Тогда
		Сообщить("Можно рассчитать только предыдущий день или более ранний период");
		Возврат;
	КонецЕсли;	
	
	Если Период.ДатаНачала >= НачалоДня(ТекущаяДатаСеанса()) и Не ТолькоУдаление Тогда
		Сообщить("Можно рассчитать только предыдущий день или более ранний период");
		
		Период.ДатаОкончания = НачалоДня(ТекущаяДатаСеанса()-86400);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДобавленРаньшеДаты) Тогда   
		УдалитьЗначенияЗаПериодДобавленныеРаньшеДаты();
		Возврат;
	КонецЕсли;	
	
	СписокПоказателей = Новый Массив;
	Для Каждого Строка Из Показатели Цикл
		Если Строка.флаг Тогда
			СписокПоказателей.Добавить(Строка.Показатель);
		КонецЕсли;	
	КонецЦикла;	
	
	СписокОрганизаций = Новый Массив;
	Для Каждого Строка Из Организации Цикл
		Если Строка.флаг Тогда
			СписокОрганизаций.Добавить(Строка.Организация);
		КонецЕсли;	
	КонецЦикла;	
	
	СписокПодразделений = Новый Массив;
	Для Каждого Строка Из Подразделения Цикл
		Если Строка.флаг Тогда
			СписокПодразделений.Добавить(Строка.Подразделение);
		КонецЕсли;	
	КонецЦикла;	
	
	Если Не СписокОрганизаций.Количество() Тогда
		Сообщить("Не выбрано ни одной организации");
		Возврат;
	КонецЕсли;	
	
	Если Не СписокПодразделений.Количество() Тогда
		Сообщить("Не выбрано ни одного подразделения");
		Возврат;
	КонецЕсли;	
    
	//Если УдалитьЗначения Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БТ_ЗначенияПоказателей.Период КАК Период,
		                      |	БТ_ЗначенияПоказателей.Показатель КАК Показатель,
		                      |	БТ_ЗначенияПоказателей.Организация КАК Организация,
		                      |	БТ_ЗначенияПоказателей.Подразделение КАК Подразделение
		                      |ИЗ
		                      |	РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
		                      |ГДЕ
		                      |	БТ_ЗначенияПоказателей.Период МЕЖДУ &Дата1 И &Дата2
		                      |	И (БТ_ЗначенияПоказателей.Показатель В (&Показатель)
		                      |			ИЛИ &Все)
		                      |	И НЕ БТ_ЗначенияПоказателей.Показатель.РучнойПоказатель
		                      |	И НЕ БТ_ЗначенияПоказателей.План
		                      |	И БТ_ЗначенияПоказателей.Подразделение В(&Подразделение)
		                      |	И БТ_ЗначенияПоказателей.Организация В(&Организация) 
							  |	И Истина
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	БТ_ЗначенияПоказателей.Период,
		                      |	БТ_ЗначенияПоказателей.Показатель,
		                      |	БТ_ЗначенияПоказателей.Организация,
		                      |	БТ_ЗначенияПоказателей.Подразделение");
		Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
		Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
		
				
		Запрос.УстановитьПараметр("Показатель", СписокПоказателей);
		Запрос.УстановитьПараметр("Все", Показатели.Количество() = 0);
		
		Запрос.УстановитьПараметр("Подразделение", СписокПодразделений);
		Запрос.УстановитьПараметр("Организация", СписокОрганизаций);
		
		Если СнятьФлагВыгружен Тогда  
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Истина", "И БТ_ЗначенияПоказателей.Выгружен");
		КонецЕсли;	
		
		Выборка = запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Наб = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьНаборЗаписей();
			Наб.Отбор.Период.Установить(Выборка.Период);
			Наб.Отбор.Показатель.Установить(Выборка.Показатель);
			Наб.Отбор.Организация.Установить(Выборка.Организация);
			Наб.Отбор.План.Установить(Ложь);
			Наб.Отбор.Подразделение.Установить(Выборка.Подразделение);
			Если СнятьФлагВыгружен Тогда
				Наб.Прочитать();
				Если Наб.Количество() = 1 Тогда 
					Наб[0].Выгружен = Ложь; 
					Наб.Записать();
				КонецЕсли;
			Иначе
				Наб.Записать();
			КонецЕсли;	
			
			
		КонецЦикла;	
		
		Если Не СнятьФлагВыгружен Тогда
			Сообщить("Значения удалены " + ТекущаяДатаСеанса()); 
		Иначе 
			Сообщить("Удален признак Выгрузка " + ТекущаяДатаСеанса());
		КонецЕсли;	
		если ТолькоУдаление или СнятьФлагВыгружен тогда
			возврат;
		конецесли;	
	//КонецЕсли;	
	
	НачДата = Период.ДатаНачала;
	Пока НачДата <= Период.ДатаОкончания Цикл
		БТ_РасчетПоказателей.ПроизвестиРасчетПоказателей(НачДата, ,?(СписокПоказателей.Количество() = 0, Неопределено, СписокПоказателей), Ложь, КонецДня(НачДата) = КонецДня(Период.ДатаОкончания), СписокОрганизаций, СписокПодразделений, НачДата <> Период.ДатаОкончания, Истина);
        Сообщить(НачДата);
		НачДата = НАчДАта + 86400;
	КонецЦикла;	
	
	Сообщить("Значения рассчитаны " + ТекущаяДатаСеанса());

КонецПроцедуры	

Процедура Инициалиация()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИСТИНА КАК Флаг,
	                      |	ПодразделенияКомпании.БТ_НазваниеДляССП КАК Подразделение
	                      |ИЗ
	                      |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |ГДЕ
	                      |	ПодразделенияКомпании.БТ_НазваниеДляССП <> """"
	                      |	И НЕ ПодразделенияКомпании.ПометкаУдаления");
	
	Подразделения.Загрузить(Запрос.Выполнить().Выгрузить());
	Новстр = Подразделения.Добавить();
	новстр.Подразделение = "Select Астрахань";
	новстр.флаг = истина;
	
	Новстр = Подразделения.Добавить();
	новстр.Подразделение = "Optima Select";
	новстр.флаг = истина;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
					|	ВЫРАЗИТЬ(БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Справочник.Организации) КАК Организация,
					|	Истина КАК Флаг
					|ИЗ
					|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
					|ГДЕ
					|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ССП_Организации""");
	Организации.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры	