// Модуль справочника

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем СогласиеНаОбработкуПерсональныхДанныхТек;	//Текущее значение реквизита СогласиеНаОбработкуПерсональныхДанных

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Печать бланка согласия на обработку персональных данных
//
Процедура СогласиеНаОбработкуПерсональныхДанныхПечать() Экспорт
	Если СогласиеНаОбработкуПерсональныхДанных<>Перечисления.ВариантыОтветов.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = Справочники.Контрагенты.ПолучитьМакет("СогласиеНаОбработкуПерсональныхДанных");
	
	СтруктураПредставления=Новый Структура(
		"ИНН,КПП,АдресЮридический,ТелефонРабочий",
		"ИНН ","КПП ","Адрес: ","тел.: "
	);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.КонтрагентНаименование	= Наименование;
	ОбластьМакета.Параметры.КонтрагентАдрес			= киПолучитьПредставлениеКИ(Ссылка,Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ОбластьМакета.Параметры.КонтрагентДокумент		= спПолучитьПодтверждающийДокументОбъектаПоВиду(Ссылка,Перечисления.ВидыДокументов.Паспорт);
	ОбластьМакета.Параметры.ОрганизацияНаименование	= спПолучитьПредставление(ПараметрыСеанса.Организация,Новый Структура("Наименование",""));
	ОбластьМакета.Параметры.ОрганизацияАдрес		= спПолучитьПредставление(ПараметрыСеанса.Организация,СтруктураПредставления);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Согласие");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.КонтрагентНаименование	= Наименование;
	ОбластьМакета.Параметры.СогласиеДата			= Формат(СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Отобразить печатный документ на экране
	КлючУникальности	= Новый УникальныйИдентификатор();
	ФормаПечати			= ПолучитьОбщуюФорму("ПечатнаяФормаДокументов",,КлючУникальности);
	ТабличныйДокумент	= ФормаПечати.ЭлементыФормы.ТабличныйДокумент;
	ТабличныйДокумент.Защита			= обПраво("ЗащитаПечатныхФорм",Права);
	ТабличныйДокумент.ТолькоПросмотр	= обПраво("ОткрытиеПечатныхФормДокументовВРежимеПросмотра",Права);
	// Выведем печатную форму	
	ФормаПечати.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДокумент);
	// Заполним необходимые переменные и откроем форму
	ФормаПечати.Объект						= ЭтотОбъект;
	ФормаПечати.ОбъектПредставление			= Строка(ЭтотОбъект);
	ФормаПечати.ДополнительноКПредставлению	= "Согласие на обработку персональных данных";
	ФормаПечати.Открыть();
КонецПроцедуры // СогласиеНаОбработкуПерсональныхДанныхПечать()

// Обработка изменения реквизитов справочников
//
// Параметры:
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры	– Структура		– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
//
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя="СогласиеНаОбработкуПерсональныхДанных" Тогда
		Если СогласиеНаОбработкуПерсональныхДанныхТек<>СогласиеНаОбработкуПерсональныхДанных Тогда
			Если обЗначениеНеЗаполнено(СогласиеНаОбработкуПерсональныхДанных) Тогда
				СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Спрашивать;
			КонецЕсли;
			Если СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Спрашивать Тогда
				СогласиеНаОбработкуПерсональныхДанныхДата=Неопределено;
			ИначеЕсли СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Да ИЛИ
					  СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Нет Тогда
				#Если Клиент Тогда
				СогласиеНаОбработкуПерсональныхДанныхДата=РабочаяДата;
				#Иначе
				СогласиеНаОбработкуПерсональныхДанныхДата=ТекущаяДата();
				#КонецЕсли
			КонецЕсли; 
			СогласиеНаОбработкуПерсональныхДанныхТек=СогласиеНаОбработкуПерсональныхДанных;
		КонецЕсли; 
		Возврат Истина;
		
	Иначе
		Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
//
// Параметры:
//  ДляЭлемента	– Булево			– Возвращаемая структура должна содержать реквизиты для проверки элемента.
//  ДляГруппы	– Булево 			– Возвращаемая структура должна содержать реквизиты для проверки группы элементов.
//
// Возвращаемое значение:
//   ОбязательныеРеквизиты   		– Структура, содержащая реквизиты для проверки элемента или группы элементов.
//
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("СогласиеНаОбработкуПерсональныхДанных",1);
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;

	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки 			– Строка		– Описание ошибок.
//  ДопРеквизиты	– Структура		– Дополнительные реквизиты для проверки.
//  Заполнение		– Булево		– Флаг для проверки заполнения.
//  Уникальность	– Булево		– Флаг для проверки уникальности.
//
// Возвращаемое значение:
//   Булево				   			– Правильность заполнения объекта.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
// Параметры:
//  БлокироватьРеквизиты	– Строка	– Блокируемые на изменение реквизиты объекта.
//
// Возвращаемое значение:
//   Булево		   					– Допустимость изменения объекта.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Спрашивать;
	СогласиеНаОбработкуПерсональныхДанныхТек=СогласиеНаОбработкуПерсональныхДанных;
	СогласиеНаОбработкуПерсональныхДанныхДата=Неопределено;
	ОбработкаРеквизита("СогласиеНаОбработкуПерсональныхДанных");
КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	
	СогласиеНаОбработкуПерсональныхДанных=Перечисления.ВариантыОтветов.Спрашивать;
	СогласиеНаОбработкуПерсональныхДанныхТек=СогласиеНаОбработкуПерсональныхДанных;
	СогласиеНаОбработкуПерсональныхДанныхДата=Неопределено;
	ОбработкаРеквизита("СогласиеНаОбработкуПерсональныхДанных");
КонецПроцедуры // ПриКопировании()

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	// Сформируем дату строкой для сортировки по дням рождения 
	Если НЕ обЗначениеНеЗаполнено(ДатаРождения) Тогда
		ДеньРождения = Формат(ДатаРождения, "ДФ=ММ") + "." + Формат(ДатаРождения, "ДФ=дд") ;
	КонецЕсли; 
КонецПроцедуры // ПередЗаписью()

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоКода()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

СогласиеНаОбработкуПерсональныхДанныхТек=Ссылка.СогласиеНаОбработкуПерсональныхДанных;
