//<<Павличенко 31.08.2020
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		Если ТекЗапись.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12178") Тогда
			Если РольДоступна("ПолныеПрава") тогда
				Возврат;
			КонецЕсли;
			
			РазрешенныеПользователи = Справочники.тт_СписокПараметров.НайтиПоКоду("000013706");
			Для каждого ЭлементПользователь из РазрешенныеПользователи.СписокПараметров цикл
				Если ЭлементПользователь.ЗначениеПараметра = ПараметрыСеанса.Пользователь тогда
					Возврат;
				КонецЕсли;		
			КонецЦикла;
			
			Отказ = Истина; // отказ от записи
			Сообщить(" Запись невозможна! У Вас нет прав на редактирование типа автоработы!");
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщить ("Запись не выполнена!");
	КонецЕсли;

КонецПроцедуры
//>>Павличенко 31.08.2020