
#Область ПрограммныйИнтерфейс

// Заполнение входных параметров для проверки РНПТ через API ФНС
//
// Параметры:
//  ПараметрыПроверки	 - Структура - Входные параметры проверки, которые должны быть:
//    * РНПТ - СправочникСсылка.ГТД - РНПТ для проверки ФНС;
//    * Организация - СправочникСсылка.Организации - Организация для определения настроек подключения к ФНС.
//
Процедура ЗаполнитьПараметрыПроверкиРНПТ(ПараметрыПроверки) Экспорт
	
	// Заполним организацию по умолчанию из параметров сеанса текущего пользователя
	Если НЕ ПараметрыПроверки.Свойство("Организация") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыПроверки.Организация) Тогда
		ПараметрыПроверки.Вставить("Организация", ПараметрыСеанса.Организация);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
