
//Перем ПоследовательностиОтчета Экспорт;                // хранит последовательности отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

//Функция ПолучитьСвойства() Экспорт
//	
//	СтруктураСвойств = Новый Структура;
//	
//	Возврат СтруктураСвойств;
//	
//КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	//ЭтотОбъект.ДатаОконания = ТекущаяДата();
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Функция ПолучениеОграниченийНастроек() Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Группировки");
	СтруктураПолей.Вставить("Показатели");
	СтруктураПолей.Вставить("Порядок");
	//СтруктураПолей.Вставить("Отборы");
	СтруктураПолей.Вставить("Параметры");
	
	Возврат СтруктураПолей;
	
КонецФункции

////Заполняет основные параметры отчета
////
////Без параметров
////
//Процедура УстановитьПараметры() 
//	
//	ДатаОкончания             = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончанияГраница", КомпоновщикНастроек.Настройки);
//	КоэффициентРублевогоКурса = обПересчет(1, Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), ДатаОкончания, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДатаОкончания);
//	
//	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КоэффициентРублевогоКурса", ?(КоэффициентРублевогоКурса=0, 1, КоэффициентРублевогоКурса));
//	
//КонецПроцедуры // УстановитьОсновныеПараметры()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если ДокументРезультат = Неопределено Тогда
		ДокументРезультат = Новый ТабличныйДокумент();
	Иначе
		ДокументРезультат.Очистить();
	КонецЕсли;
	
	ОтборКомпоновки = КомпоновщикНастроек.Настройки.Отбор;
	
	ИсполнителиОтбор = Новый ТаблицаЗначений;
	ПоляЗамен = Новый Соответствие;
	ПоляЗамен.Вставить("Исполнитель", "Ссылка");
	Запрос = Новый Запрос;
	ТекстОтбораОбычныеПоля = ОтчетыСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "Сотрудники", Запрос.Параметры, ПоляЗамен, "Исполнитель");
	Если ЗначениеЗаполнено(ТекстОтбораОбычныеПоля) Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	Сотрудники.Ссылка КАК Сотрудник,
		               |	0 КАК НомерСтроки
		               |ИЗ
		               |	Справочник.Сотрудники КАК Сотрудники
		               |ГДЕ ";
		Запрос.Текст = Запрос.Текст + Символы.ПС + ТекстОтбораОбычныеПоля;
		ИсполнителиОтбор = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ЦехаОтбор = Новый ТаблицаЗначений;
	ПоляЗамен = Новый Соответствие;
	ПоляЗамен.Вставить("Цех", "Ссылка");
	Запрос = Новый Запрос;
	ТекстОтбораОбычныеПоля = ОтчетыСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "Цеха", Запрос.Параметры, ПоляЗамен, "Цех");
	Если ЗначениеЗаполнено(ТекстОтбораОбычныеПоля) Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	Цеха.Ссылка КАК Цех,
		               |	0 КАК НомерСтроки
		               |ИЗ
		               |	Справочник.Цеха КАК Цеха
		               |ГДЕ ";
		Запрос.Текст = Запрос.Текст + Символы.ПС + ТекстОтбораОбычныеПоля;
		ЦехаОтбор = Запрос.Выполнить().Выгрузить();
	КонецЕсли;	
	
	РежимКалендаряПоУмолчанию = Неопределено;
	
	АРМЗаписьНаРемонт = Обработки.АРМЗаписьНаРемонт.Создать();
	НастройкиАРМ = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("НастройкиАРМ", КомпоновщикНастроек.Настройки);
	Если ЗначениеЗаполнено(НастройкиАРМ) Тогда
		НастройкиЗначение = НастройкиАРМ.Получить();
	Иначе
	 	РежимКалендаряПоУмолчанию = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("РежимКалендаря", КомпоновщикНастроек.Настройки);
		НастройкиЗначение = Обработки.АРМЗаписьНаРемонт.ПолучитьСписокНастроекАРМ();
		НастройкиЗначение.РежимКалендаря = РежимКалендаряПоУмолчанию; 
	КонецЕсли;
	
	Для Каждого ТекНастройка Из НастройкиЗначение Цикл
		АРМЗаписьНаРемонт[ТекНастройка.Ключ] = ТекНастройка.Значение;
	КонецЦикла;
	
	АРМЗаписьНаРемонт.ЦехаОтбор = ЦехаОтбор;
	АРМЗаписьНаРемонт.УстановленОтборЦеха = ЦехаОтбор.Количество()>0;
	АРМЗаписьНаРемонт.ИсполнителиОтбор = ИсполнителиОтбор;
	АРМЗаписьНаРемонт.УстановленОтборИсполнители = ИсполнителиОтбор.Количество()>0;
	АРМЗаписьНаРемонт.ДатаОтчета = ОтчетыСервер.КомпоновщикПолучитьЗначениеПараметра("ДатаОкончания", КомпоновщикНастроек.Настройки);
	АРМЗаписьНаРемонт.СформироватьТабличныйДокументКалендарьНаДень(ДокументРезультат);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//ИмяРегистра = "ОстаткиТоваровКомпании";
//отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
//ПромежуточныеЗначенияПостроителя = Новый Структура();
//СтруктураНеСвязанныхПоказателей = Новый Структура();

//ПоследовательностиОтчета = Новый Структура();
//ПоследовательностиОтчета.Вставить("ГраницыПартий");
//ПоследовательностиОтчета.Вставить("ГраницыВзаиморасчетов");

