
Процедура ПередЗаписью(Отказ, Замещение)
	Для Каждого НоваяЗапись Из ЭтотОбъект Цикл
		Если обЗначениеНеЗаполнено(НоваяЗапись.ВидЗадачи) Тогда
			Сообщить("Не указан вид задачи!",СтатусСообщения.Важное); Отказ=Истина;
		ИначеЕсли НоваяЗапись.ВидЗадачи<>Перечисления.ВидЗадачПланировщика.ЗавершениеРаботыСистемы И обЗначениеНеЗаполнено(НоваяЗапись.Объект) Тогда
			Сообщить("Не указан объект действия!",СтатусСообщения.Важное); Отказ=Истина;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(НоваяЗапись.ДействиеПриОшибке) Тогда
			Сообщить("Не указано действие при ошибке!",СтатусСообщения.Важное); Отказ=Истина;
		КонецЕсли;
		
		Если НоваяЗапись.Периодическая Тогда
			Если обЗначениеНеЗаполнено(НоваяЗапись.ПериодЗапускаЗадачи) Тогда
				Сообщить("Не указан период запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			ИначеЕсли НоваяЗапись.ПериодЗапускаЗадачи=Перечисления.ПериодыЗапускаЗадачПланировщика.Ежедневно И обЗначениеНеЗаполнено(НоваяЗапись.МоментЗапускаЗадачи) Тогда
				Сообщить("Не указан момент запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			КонецЕсли;
		Иначе
			Если обЗначениеНеЗаполнено(НоваяЗапись.ДатаИВремяОднократногоЗапуска) Тогда
				Сообщить("Не указаны дата и время запуска задачи!",СтатусСообщения.Важное); Отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

