
//Перем ПоследовательностиОтчета Экспорт;                // хранит последовательности отчета
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("Заказ");
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("ХарактеристикаНоменклатуры");
	
	Возврат СтруктураСвойств;
	
КонецФункции

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТекДокумент = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Документ")).Значение;
	Если обЗначениеНеЗаполнено(ТекДокумент) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не выбран документ закрытия!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//// проверка заполнения
//Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
//	
//	ПродолжитьФормирование = Истина;
//	Если обЗначениеНеЗаполнено(ДокументЗакрытия) Тогда
//		Предупреждение("Необходимо выбрать документ закрытия!");
//		ПродолжитьФормирование = Ложь;
//	КонецЕсли;
//	
//	Возврат Ложь;
//	
//КонецФункции // КорректностьЗаполнения()

//// Корректировка таблицы заголовка
//Процедура ОбработкаТаблицыЗаголовка(ТаблицаЗаголовка) Экспорт
//	
//	НоваяСтрока = ТаблицаЗаголовка.Вставить(1);
//	НоваяСтрока.Текст = "Документ закрытия заказов: " + Строка(ДокументЗакрытия);
//	НоваяСтрока.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
//	НоваяСтрока.Шрифт = Новый Шрифт(ТаблицаЗаголовка[0].Шрифт,, 10, Истина);
//	
//КонецПроцедуры
