&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРеквизитыАвито(Элементы.СопоставлениеРеквизитАвито.СписокВыбора);
	ЗаполнитьРеквизитыАвито(Элементы.СопоставлениеНоменклатурыРеквизитАвито.СписокВыбора);
	
	ЗаполнитьРеквизитыСправочника(Элементы.СопоставлениеРеквизитЗапчасти.СписокВыбора);
	ЗаполнитьРеквизитыСправочника(Элементы.СопоставлениеНоменклатурыРеквизитЗапчасти.СписокВыбора);
	
	ns_Переопределяемый.ЗаполнитьРеквизитыНоменклатуры(Элементы.СопоставлениеНоменклатурыРеквизит1С.СписокВыбора);
	ns_Переопределяемый.ЗаполнитьДопРеквизиты(Элементы.СопоставлениеРеквизит1С.СписокВыбора);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыАвито(СписокЗначений)
	СписокЗначений.Добавить("OEM", "Номер детали");
	СписокЗначений.Добавить("OriginalOEM", "Номер оригинальной детали OEM");
	СписокЗначений.Добавить("OriginalVendor", "Производитель оригинальной запчасти");

	СписокЗначений.Добавить("Brand_ПроизводителиЗапчастей", "Производитель (Запчастей)");
	СписокЗначений.Добавить("Brand_ПроизводителиШин", "Производитель (Шин)");
	
	СписокЗначений.Добавить("RimBolts", "Количество отверстий под болты");
	СписокЗначений.Добавить("RimBoltsDiameter", "Диаметр расположения отверстий под болты");
	СписокЗначений.Добавить("RimDiameter", "Диаметр, дюймы");
	СписокЗначений.Добавить("RimOffset", "Вылет (ET)");
	СписокЗначений.Добавить("RimTypeDisk", "Тип диска (Диски)");
	СписокЗначений.Добавить("RimTypeWheels", "Тип диска (Колёса)");
	СписокЗначений.Добавить("RimWidth", "Ширина обода, дюймов");
	СписокЗначений.Добавить("TireAspectRatio", "Высота профиля шины");
	СписокЗначений.Добавить("TireSectionWidthКолёса", "Ширина профиля (Колёса)");
	СписокЗначений.Добавить("TireSectionWidthМотошины", "Ширина профиля (Мотошины)");
	СписокЗначений.Добавить("TireSectionWidthШины", "Ширина профиля (Шины)");
	СписокЗначений.Добавить("TireType", "Сезонность шин или колес");
	СписокЗначений.Добавить("WheelAxle", "Ось мотошины");
	
	СписокЗначений.Добавить("VideoURL", "Видео c YouTube");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСправочника(СписокЗначений)
	СписокЗначений.Добавить("OEM", "Номер детали");
	СписокЗначений.Добавить("OriginalOEM", "Номер оригинальной детали OEM");
	СписокЗначений.Добавить("OriginalVendor", "Производитель оригинальной запчасти");
	СписокЗначений.Добавить("Brand", "Производитель");
	СписокЗначений.Добавить("RimBolts", "Количество отверстий под болты");
	СписокЗначений.Добавить("RimBoltsDiameter", "Диаметр расположения отверстий под болты");
	СписокЗначений.Добавить("RimDiameter", "Диаметр, дюймы");
	СписокЗначений.Добавить("RimOffset", "Вылет (ET)");
	СписокЗначений.Добавить("RimType", "Тип диска");
	СписокЗначений.Добавить("RimWidth", "Ширина обода, дюймов");
	СписокЗначений.Добавить("TireAspectRatio", "Высота профиля шины");
	СписокЗначений.Добавить("TireSectionWidth", "Ширина профиля шины");
	СписокЗначений.Добавить("TireType", "Сезонность шин или колес");
	СписокЗначений.Добавить("WheelAxle", "Ось мотошины");
	СписокЗначений.Добавить("VideoURL", "Видео c YouTube");
КонецПроцедуры  









