
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.БТ_ЦеныПредТО.Записывать = Истина;
	Движения.БТ_ЦеныПредТО.Очистить();  
	
	Для Каждого ТекСтрокаТаблицаТО Из ТаблицаТО Цикл 
		
		Движение = Движения.БТ_ЦеныПредТО.Добавить();
		Движение.Период = Дата;
		Движение.ПредоплаченноеТО = ПредоплаченноеТО;
		Движение.НомерТО = ТекСтрокаТаблицаТО.НомерТО;
		Движение.Цена = ТекСтрокаТаблицаТО.Цена;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ОбПраво("ОформлениеПакетовИЦенПредоплаченногоТО") Тогда 
		Сообщить("Нет доступа");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры
