////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяФормыОтчета        = ПараметрКоманды.КлючОтчета + ".ФормаНастроек";
	КлючВарианта          = ПараметрКоманды.КлючВарианта;
	ПредставлениеВарианта = ПараметрКоманды.Наименование;
	ВариантОтчета         = ПараметрКоманды.Настройки.Получить();
	
	//ПараметрыВыполненияКоманды.Источник
	ФормаНастроек = ОтчетыТонкийКлиент.ПолучитьФормуНастроек(Неопределено, ВариантОтчета, ИмяФормыОтчета, Новый УникальныйИдентификатор, КлючВарианта, ПредставлениеВарианта);
	ФормаНастроек.Открыть();
	
КонецПроцедуры
