Перем ВсегоРЛ;
Перем КонтрактыРЛ;
Перем РЛСАвто;
Перем ЮрЛица;
Перем СозданоЗаказов; 
Перем СпАВто;

Перем СебестоимостьДопов Экспорт;
Перем СуммаДопов Экспорт;
Перем Допы Экспорт;
Перем Логин Экспорт; 
Перем Пароль Экспорт;

Функция ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		
		Результат = HTTPСоединение.Получить(HTTPЗапрос, ФайлРезультата);
				
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		РезультатТекст = Ответ.ПолучитьТекст();
		
		ОригиналТекст = РезультатТекст; 
		
		//РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		
		//БИЗТЕХ КОВАЛЬ 06.09.2024++
		//Прочитаем json и вернем структуру
		Чтение = Новый ЧтениеJSON;
		ОригиналТекст = ИсправитьJSON(ОригиналТекст);
		Чтение.УстановитьСтроку(ОригиналТекст);
		ДанныеЛога = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		
		//Структуру превратим обратно в текст для совместимости для сравнения
		//
		JSONЭл = Новый ЗаписьJSON;    
		JSONЭл.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
		ЗаписатьJSON(JSONЭл, ДанныеЛога,);
		РезультатТекст = JSONЭл.Закрыть();
		//БИЗТЕХ КОВАЛЬ 06.09.2024--
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
		УдалитьФайлы(ФайлОтправки);
		УдалитьФайлы(ФайлРезультата);
		
		Возврат РезультатТекст;
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2", суммаДоп = 0) Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.Записать(HTTPЗапрос); 
		
		
		КодСостояния = Результат.КодСостояния;
		
		Результат = Результат.ПолучитьТелоКакСтроку();
		
		
		Ошибка = Ложь;
				
		//Ответ = Новый ТекстовыйДокумент();
		//Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		//РезультатТекст = Ответ.ПолучитьТекст();
		//РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		//
		//Если ПоказыватьРезультатЗапроса Тогда
		//	Сообщить(РезультатТекст);
		//КонецЕсли;
		
		//УдалитьФайлы(ФайлОтправки);
		//УдалитьФайлы(ФайлРезультата);
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		
		Ошибка = Истина;
		
		Результат = ОписаниеОшибки();
		
		//ВызватьИсключение;
	КонецПопытки;  
	
	Если Статус = "DOP" и КодСостояния <> 200 Тогда
		
		Возврат ложь;
		
	КонецЕсли;	
	
	Мен = РегистрыСведений.БТ_црмИзменениеСтатусаАвтомобиля.СоздатьМенеджерЗаписи();
	Мен.Период = ТекущаяДатаСеанса();
	Мен.Автомобиль = Автомобиль;
	Мен.ТекстЗапроса = СтрокаДляОтправки;
	Мен.ТекстОтвета = Результат; 
	Мен.Статус = Статус;
	Мен.Ошибка = Ошибка;
	
	Если ЗначениеЗаполнено(СуммаДоп) И КодСостояния = 200 Тогда
		Мен.СуммаДоп = СуммаДоп;
	КонецЕсли;	
	
	Если Не БезЗаписи Тогда
		Мен.Записать();
	КонецЕсли;	
	
КонецФункции 

Функция ПростаяЗаписьJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();  
	
КонецФункции

Процедура ЗаполнитьАвто() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	                      |			,
	                      |			СкладКомпании.тт_КатегорияСклада = &КатегорияСклада
	                      |				И Автомобиль.БТ_МаркаАвто = &Марка) КАК ОстаткиАвтомобилейОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = CRM_ВыгрузкаАвтомобилей.Автомобиль
	                      |ГДЕ
	                      |	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	                      |	И CRM_ВыгрузкаАвтомобилей.Автомобиль ЕСТЬ NULL"); 
	Запрос.УстановитьПараметр("Код", црмОбщиеФункции.НастройкаСкладовДляВыгрузкиАвто());
	ЗАпрос.УстановитьПараметр("Марка", Справочники.БТ_МаркиАвтомобилей.НайтиПоКоду("000000013"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                  
		
		црмОбщиеФункции.ДобавитьАвтоВВыгрузку(Выборка.Автомобиль);		
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтправитьАвто() Экспорт
	
	ДанныеДляПередачи = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Допы) и Статус <> "DEALER" Тогда
		СебестоимостьДопов = 0;
		СуммаДопов = 0;
		Допы = ПолучитьДопы(Автомобиль, СебестоимостьДопов, СуммаДопов);
	КонецЕсли;	
	
	ОтправитьДопы = Ложь;
	ДанныеДляПередачиBody = Новый Структура; 
	Если Статус <> "DOP" Тогда
		ДанныеДляПередачиBody.Вставить("statusCode", Статус);
		ДанныеДляПередачиBody.Вставить("statusDate", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
	КонецЕсли;	
	ДанныеДляПередачиBody.Вставить("code", Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("vin", Автомобиль.VIN); 
	Если Статус = "DEALER" Тогда
		ДанныеДляПередачиBody.Вставить("dateReceived", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
		ДанныеДляПередачиBody.Вставить("inStock", 1);
		
	ИначеЕсли Статус = "SOLD" или Статус = "DOP" Тогда
				
		Если Не ПустаяСтрока(Допы) Тогда
			ДанныеДляПередачиBody.Вставить("equipmentInputPrice", СебестоимостьДопов);
			ДанныеДляПередачиBody.Вставить("equipmentPrice", СуммаДопов);
			ДанныеДляПередачиBody.Вставить("equipmentText", Допы);
			
			ОтправитьДопы = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	//СтрокаОтправки = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/updateByVinFromRef/" + Автомобиль.VIN;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	ПараметрыПодключения.Логин = "A.Klient";
	ПараметрыПодключения.Пароль = "sxhmf4";
    
	ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения,,, ?(ОтправитьДопы, СуммаДопов, 0));
	
КонецПроцедуры

Процедура ОтправитьАвтомобилиCRM(Автомобиль = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Период КАК Период,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ДатаВыгрузки КАК ДатаВыгрузки,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Принят КАК Принят,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ID КАК ID,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Марка1С КАК Марка1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Марка КАК Марка,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модель1С КАК Модель1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модель КАК Модель,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Комплектация1С КАК Комплектация1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Поколение КАК Поколение,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Серия КАК Серия,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Комплектация КАК Комплектация,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модификация КАК Модификация,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Цвет1С КАК Цвет1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Цвет КАК Цвет,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Отделка КАК Отделка,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ОтветCRM КАК ОтветCRM,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.НеВыгружать КАК НеВыгружать
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей.СрезПоследних КАК CRM_ВыгрузкаАвтомобилейСрезПоследних
	                      |ГДЕ
	                      |	(НЕ CRM_ВыгрузкаАвтомобилейСрезПоследних.Принят
	                      |	И НЕ CRM_ВыгрузкаАвтомобилейСрезПоследних.НеВыгружать ИЛИ CRM_ВыгрузкаАвтомобилейСрезПоследних.Автомобиль = &Автомобиль и &Автомобиль <> Неопределено)");
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОтправитьАвтоВCRM(Выборка, автомобиль <> Неопределено);
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ОтправитьАвтоВCRM(Выборка, Обновление = Ложь)
	ДанныеДляПередачи = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Выборка.Комплектация) Тогда
		Возврат;
	КонецЕсли;	
	
	_автомобиль = Выборка.Автомобиль;
	
	ДанныеДляПередачиBody = Новый Структура; 
	ДанныеДляПередачиBody.Вставить("statusCode", "DEALER");
	ДатаПоступления = ДатаПоступления(_Автомобиль);
	
	Если Не ЗначениеЗаполнено(ДатаПоступления) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПередачиBody.Вставить("statusDate", Формат(ДатаПоступления, "ДФ=dd.MM.yyyy"));
	ДанныеДляПередачиBody.Вставить("code", _Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("vin", _Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("brandId", Выборка.Марка.id);
	ДанныеДляПередачиBody.Вставить("productionYear", Год(_Автомобиль.ГодВыпуска));
	ДанныеДляПередачиBody.Вставить("modelYearCode", "01");
	ДанныеДляПередачиBody.Вставить("generationId", Выборка.Поколение.id);
	//ДанныеДляПередачиBody.Вставить("fixedPrice", 0);
	
	ДанныеДляПередачиBody.Вставить("autosalonId", 1);
	ДанныеДляПередачиBody.Вставить("dealerCode", "");
	ДанныеДляПередачиBody.Вставить("modelId", Выборка.Модель.id);
	ДанныеДляПередачиBody.Вставить("serieId", Выборка.Серия.id);
	ДанныеДляПередачиBody.Вставить("modificationId", Выборка.Модификация.id);
	ДанныеДляПередачиBody.Вставить("equipmentId", Выборка.Комплектация.id);
	ДанныеДляПередачиBody.Вставить("bodyColor", СокрЛП(Выборка.Цвет));
	
	Цена = ЦенаАвто(_Автомобиль);   
	
	ЦенаРРЦ = ЦенаАвто(_Автомобиль, Справочники.ТипыЦен.РРЦ);
	
	ЦенаСтрокой = СтрЗаменить(Цена, Символы.НПП,"");	
	ЦенаСтрокой = СтрЗаменить(ЦенаСтрокой, ",",".");
	
	Если ЗначениеЗаполнено(Цена) Тогда
		ДанныеДляПередачиBody.Вставить("basePrice", ЦенаСтрокой(Цена));
		ДанныеДляПередачиBody.Вставить("fixedPrice", ЦенаСтрокой);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЦенаРРЦ) Тогда
		ДанныеДляПередачиBody.Вставить("invoicePrice", ЦенаСтрокой(ЦенаРРЦ));
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Выборка.Цвет) Тогда
		Цвет = Новый Структура("id, name", Выборка.Цвет.id, Выборка.Цвет.Наименование);
		ДанныеДляПередачиBody.Вставить("color", Цвет);
		ДанныеДляПередачиBody.Вставить("colorCode", Выборка.Цвет.КодЦвета);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Выборка.Отделка) Тогда
		Отделка = Новый Структура("id, name", Выборка.Отделка.id, Выборка.Отделка.Наименование);
		ДанныеДляПередачиBody.Вставить("trim", Отделка);
		ДанныеДляПередачиBody.Вставить("trimCode", Выборка.Отделка.КодОтделки);
	КонецЕсли;	
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	//СтрокаОтправки = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
	
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	Если НЕ Обновление Тогда
		ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/createFromRef";//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	Иначе
		ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/updateByVinFromRef/" + _Автомобиль.VIN;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	КонецЕсли;	
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	ПараметрыПодключения.Логин = Логин;
	ПараметрыПодключения.Пароль = Пароль;
	
	Если Не Обновление Тогда
		Ответ = ВыполнитьHTTPЗапросPost(ПараметрыПодключения);
	Иначе
		Ответ = ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения);
	КонецЕсли;	
	
	Ответ = стрЗаменить(Ответ, "{""00","{""_00");
	Ответ = стрЗаменить(Ответ, ",""00",",""_00");
	
	Если Не ПустаяСтрока(Ответ) Тогда
		Наб = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
		Наб.Отбор.Автомобиль.Установить(Выборка.Автомобиль);
		Наб.Прочитать();
		
		Если Наб.Количество() Тогда
			Запись = Наб[0];
			Запись.ОтветCRM = Ответ;
			Запись.ДатаВыгрузки = ТекущаяДатаСеанса();
			Запись.ЦенаПродажи = Цена;
			Запись.ТекстЗапроса = СтрокаОтправки;
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(Ответ);	
			
			Попытка
				
				Данные = ПрочитатьJSON(ЧтениеJson);
				
				СтруктураДанных = Данные.Result;
				
				Запись.Принят = (Данные.success = Истина);
				
				Если Запись.Принят Тогда
					Запись.id = СтруктураДанных.id;	
				КонецЕсли;	
			Исключение   
				Сообщить(ОписаниеОшибки());
			КонецПопытки;	
			
			Наб.Записать();
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ДатаПоступления(Автомобиль)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Подразделение КАК Подразделение
	                      |ПОМЕСТИТЬ ВТ_Склады
	                      |ИЗ
	                      |	Справочник.CRM_НастройкиПодключенияПоСалонам.Подразделения КАК CRM_НастройкиПодключенияПоСалонамПодразделения
	                      |ГДЕ
	                      |	CRM_НастройкиПодключенияПоСалонамПодразделения.Ссылка = &Код
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Период) КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			Автомобиль = &АВтомобиль
	                      |				И СкладКомпании В
	                      |					(ВЫБРАТЬ
	                      |						ВТ_Склады.Подразделение КАК Подразделение
	                      |					ИЗ
	                      |						ВТ_Склады КАК ВТ_Склады)) КАК ОстаткиАвтомобилейОбороты
	                      |ГДЕ
	                      |	ОстаткиАвтомобилейОбороты.КоличествоОборот > 0");    
	Запрос.УстановитьПараметр("Код", црмОбщиеФункции.НастройкаСкладовДляВыгрузкиАвто());
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Период;
		
	КонецЦикла;	
	
	
КонецФункции	

Функция ЦенаАвто(Авто, ТипЦен = Неопределено)
	
	Если Не ЗначениеЗаполнено(ТипЦен) Тогда
		ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
	                      |ИЗ
	                      |	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
	                      |			,
	                      |			ТипЦен = &ТипЦен
	                      |				И Автомобиль = &Автомобиль
	                      |				И (ВариантКомплектации = &ВариантКомплектации
	                      |					ИЛИ &Все)) КАК ЦеныАвтомобилейСрезПоследних");	
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	Запрос.УстановитьПараметр("ВариантКомплектации", Авто.ВариантКомплектации);
	Запрос.УстановитьПараметр("Все", Истина);
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;
		
		Если ЗначениеЗаполнено(Цена) Тогда
			Возврат Цена;
		КонецЕсли;	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Автомобиль", Авто.Модель);
	Запрос.УстановитьПараметр("ВариантКомплектации", Авто.ВариантКомплектации);
	Запрос.УстановитьПараметр("Все", Ложь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;
		
		Если ЗначениеЗаполнено(Цена) Тогда
			Возврат Цена;
		КонецЕсли;	
		
	КонецЕсли;
КонецФункции	

Функция ЦенаСтрокой(Цена)
	
	ЦенаСтрокой = СтрЗаменить(Цена, Символы.НПП,"");	
	Возврат СтрЗаменить(ЦенаСтрокой, ",",".");

КонецФункции

Функция ВыполнитьHTTPЗапросPost(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		//HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос, ФайлРезультата);
				
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		РезультатТекст = Ответ.ПолучитьТекст();
		РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
		УдалитьФайлы(ФайлОтправки);
		УдалитьФайлы(ФайлРезультата);
		
		Возврат РезультатТекст;
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции 

Функция ПолучитьДопы(Автомобиль, СебестоимостьДопов, СуммаДопов) Экспорт
	Допы = "";
	
	ВидыРемонта = црмРаботаСсоединением.ВидРемонтаДоукоплектация();
	
	Состояния = црмРаботаСсоединением.СостояниеЗНДоукоплектация();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
	                      |	ЗаказНарядТовары.СуммаВсего КАК СуммаВсего,
	                      |	ЗаказНарядТовары.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Товары
	                      |ИЗ
	                      |	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	                      |ГДЕ
	                      |	ЗаказНарядТовары.Ссылка.Автомобиль = &Автомобиль
	                      |	И ЗаказНарядТовары.Ссылка.Состояние в (&Состояние)
						  |	И НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
	                      |	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&ВидРемонта)
	                      |	И ЗаказНарядТовары.Ссылка.Дата >= &Дата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПартииТоваровКомпанииОбороты.Номенклатура КАК Номенклатура,
	                      |	ПартииТоваровКомпанииОбороты.СуммаРасход КАК СуммаРасход
	                      |ПОМЕСТИТЬ ВТ_Себестоимость
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Обороты(, , Регистратор, ) КАК ПартииТоваровКомпанииОбороты
	                      |		ПО ВТ_Товары.Ссылка = ПартииТоваровКомпанииОбороты.Регистратор.ДокументОснование
	                      |			И ВТ_Товары.Номенклатура = ПартииТоваровКомпанииОбороты.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Товары.Номенклатура КАК Номенклатура,
	                      |	СУММА(ВТ_Товары.СуммаВсего) КАК Сумма,
	                      |	СУММА(ЕСТЬNULL(ВТ_Себестоимость.СуммаРасход, 0)) КАК Себестоимость
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Себестоимость КАК ВТ_Себестоимость
	                      |		ПО ВТ_Товары.Номенклатура = ВТ_Себестоимость.Номенклатура
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Товары.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Товары.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Товары.Ссылка");
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидыРемонта);
	Запрос.УстановитьПараметр("Состояние", Состояния);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Дата", ДатаСтатуса-10*86400);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗ = Пакет[2].Выгрузить();
	//СуммаДопов = Окр(ТЗ.Итог("Сумма"));
	СебестоимостьДопов = Окр(ТЗ.Итог("Себестоимость"));
	
	Для Каждого Строка Из ТЗ Цикл
		Допы = Допы + ?(ПустаяСтрока(Допы),"", Символы.ПС) + Строка.Номенклатура;
	КонецЦикла;	  
	
	СуммаДопов = 0;
	Выборка = Пакет[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаДопов = СуммаДопов + Выборка.ссылка.СуммаДокумента
	КонецЦикла;	
	
	Возврат Допы;
КонецФункции	

функция ПолучениеДанных(Запрос)
	//ДанныеДляПередачи = Новый Структура;
	//
	//ДанныеДляПередачиBody = Новый Структура; 
	//ДанныеДляПередачиBody.Вставить("statusCode", Статус);
	//ДанныеДляПередачиBody.Вставить("statusDate", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
	//
	//ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
	//	
	//ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	СтрокаОтправки = "";//црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс            = Запрос;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	//
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	//ПараметрыПодключения.Логин = "A.Salaj";//"A.Klient";
	//ПараметрыПодключения.Пароль = "eb10oa";//"sxhmf4"; 
	ПараметрыПодключения.Логин = Логин;//"A.Klient";
	ПараметрыПодключения.Пароль = Пароль;//"sxhmf4";

		
	Возврат ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения);

Конецфункции

Процедура ПолучитьАвто() Экспорт
	
	ПолучениеДанных("/yii/api/warehouseVehicle");
	
КонецПроцедуры	

Функция ПолучитьРЛ() Экспорт
	
	СпАВто = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ID_РЛ) Тогда
		ПолучитьРЛПоСтранице();
	Иначе
		
		Если КоличествоСтраниц = 0 Тогда
			КоличествоСтраниц = 2;
		КонецЕсли;
		
		//БИЗТЕХ КОВАЛЬ 06.09.2024 ++
		//Разделение выгрузки по автосалонам для единого алгоритма для разных баз.
		Автосалоны = ПолучитьАвтосалоныДляОтделаПродаж();
		Если Автосалоны = Неопределено Тогда
			Сообщить("Не настроены автосалоны для отдела продаж!");
			Возврат Неопределено;
		КонецЕсли;
		
		Для Каждого Автосалон Из Автосалоны Цикл
			
			ВсегоРЛ = 0;
			КонтрактыРЛ = 0;
			РЛСАвто = 0; 
			ЮрЛица = 0;  
			СозданоЗаказов = 0;
			
			Если ПолучитьУчетныеДанныеПоIDАвтосалона(Автосалон.Код) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для сч = 1 По КоличествоСтраниц Цикл
				
				ПолучитьРЛПоСтранице(сч,,Автосалон.Код);
				
				//БТ КОВАЛЬ рабоч листы бу авто 09.08.2024
				ПолучитьРЛПоСтранице(сч,Истина,Автосалон.Код);
				//БТ
				
				Если СозданоЗаказов >= МаксКоличествоЗаказов и ЗначениеЗаполнено(МаксКоличествоЗаказов) Тогда
					Прервать;
				КонецЕсли;	  
				
			КонецЦикла;	
			
			Сообщить(СтрШаблон("Автосалон %6 - Всего рл %1, с контрактом %2, с авто %3. ЮрЛиц %4. Создано заказов %5", ВсегоРЛ, КонтрактыРЛ, РЛСАвто, ЮрЛица, СозданоЗаказов,Автосалон.Наименование));
			
		КонецЦикла;	
			
	КонецЕсли;	
КонецФункции

Функция ПолучитьРЛПоСтранице(НомерСтраницы=0, БУ=Ложь,КодАвтосалона=Неопределено) 
	
	Если ЗначениеЗаполнено(ID_РЛ) Тогда
		
		СтрокаЗапроса = "/yii/api/retailCase/" + СтрЗаменить(ID_РЛ, Символы.нпп, "");
		
	Иначе
		//БТ КОВАЛЬ рабоч листы бу авто 09.08.2024
		Если БУ=Истина Тогда
			СтрокаЗапроса = "/yii/api/SaleUsedCase?closedStageType=11&salonId="+ Строка(КодАвтосалона) + ?(НомерСтраницы = 1, "", "&SalesCaseSearch_page="+НомерСтраницы);	
		Иначе
			СтрокаЗапроса = "/yii/api/retailCase?closedStageType=11&salonId="+ Строка(КодАвтосалона) + ?(НомерСтраницы = 1, "", "&RetailCaseSearch_page="+НомерСтраницы);
		КонецЕсли;
		//БТ
	КонецЕсли;	
	
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
			
			ПолучитьОдинРЛ(Элемент);	
			
			Если СозданоЗаказов >= МаксКоличествоЗаказов и ЗначениеЗаполнено(МаксКоличествоЗаказов) Тогда
				Прервать;
			КонецЕсли;	  
			
		КонецЦикла;	
		
	Иначе	
		
		ПолучитьОдинРЛ(СтруктураДанных);
		
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьОдинРЛ(СтруктураДанных)
	
	ВсегоРЛ = ВсегоРЛ + 1;
	
	Если СтруктураДанных.contracts.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ДатаКонтракта = ЭтоКонтракт(СтруктураДанных.contract);
	
	Если ДатаКонтракта = Ложь Тогда
		
		Возврат;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДатаСтартаЗагрузкиЗаказов) И ДатаКонтракта < ДатаСтартаЗагрузкиЗаказов Тогда
			
			Возврат;
			
		КонецЕсли;	
		
		КонтрактыРЛ = КонтрактыРЛ + 1;
		
	КонецЕсли;	
	
	ДанныеКонтракта = СтруктураДанных.contract;
	
	_Сумма = ДанныеКонтракта.sum;
	
	Если Не ЗначениеЗаполнено(_Сумма) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Сумма = Число(_Сумма);
	
	Если СтруктураДанных.generalClient.tags.Количество() Тогда
		Для Каждого Тег из СтруктураДанных.generalClient.tags Цикл
			Если Тег = "247" И СтруктураДанных.autosalon.id = "25" Тогда
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураДанных.generalClient.type <> "individual" Тогда
		
		ЮрЛица = ЮрЛица + 1;
		
	КонецЕсли;	
	
	МасАвто = СтруктураДанных.needs;
	
	Если МасАвто.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	

	//БИЗТЕХ КОВАЛЬ 26.08.2024 ++
	//Внесены изменения для создания заказов по каждой потребности из одного РЛ
	idПотребности = Неопределено;
	
	Для Каждого Авто из МасАвто Цикл 
	
		Вин = Авто.vin;
		Если МасАвто.Количество() > 1 Тогда
			idПотребности = Авто.id;
		КонецЕсли;
		
		Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN", вин);

		Если Автомобиль.Пустая() Тогда
			Продолжить;
		Иначе
			РЛСАвто = РЛСАвто + 1;
		КонецЕсли;	
		
		Если СпАвто.НайтиПоЗначению(Автомобиль) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	

		СпАвто.Добавить(Автомобиль);
		ЗаказНаАвто = СоздатьЗаказНаАвтомобиль(СтруктураДанных, Автомобиль, Сумма, ДатаКонтракта, Число(СтруктураДанных.id),idПотребности);
	КонецЦикла;
	//БИЗТЕХ КОВАЛЬ 26.08.2024 --
	
КонецПроцедуры

Функция ЭтоКонтракт(СтруктураЗаказа)
	
	Если ТипЗнч(СтруктураЗаказа)<> Тип("Структура") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	ДатаКонтракта = СтруктураЗаказа.created_at;      
	
	Если ПустаяСтрока(ДатаКонтракта) Тогда
		Возврат ЛожЬ;
	КонецЕсли;	
	
	Попытка
		Возврат ПредставлениеДаты(ДатаКонтракта);
	Исключение   
		ВОзврат Ложь;
	КонецПопытки;	
	
Конецфункции

Функция НайтиКонтрагента(ДанныеКлиента)
	
	ид = Число(ДанныеКлиента.id);	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_црмКонтрагенты.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.БТ_црмКонтрагенты КАК БТ_црмКонтрагенты
	                      |ГДЕ
	                      |	БТ_црмКонтрагенты.id = &id");
	Запрос.УстановитьПараметр("id", ид);
	
	НайденныйКонтрагент = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Не ОбновлятьКонтрагентов Тогда
			Возврат Выборка.Контрагент;
		КонецЕсли;	                   
		
		НайденныйКонтрагент = Выборка.Контрагент;
		
	КонецЕсли;	                  
	
	Имя = ДанныеКлиента.firstName;
	Отчество = ДанныеКлиента.middleName;
	Фамилия = ДанныеКлиента.lastName;
	
	емейл = ДанныеКлиента.email;
	
	ПаспортКодПодразделения = ДанныеКлиента.passportDepartmentCode;
	ПаспортВыдан = ДанныеКлиента.passportIssuedAt;
	ПаспортКемВыдан = ДанныеКлиента.passportIssuedBy;
	ПаспортНомер = ДанныеКлиента.passportNumber;
	ПаспортСерия = ДанныеКлиента.passportSeries;  
	
	ПаспортДата = Неопределено;
	Если ЗначениеЗаполнено(ДанныеКлиента.passportIssuedAt) Тогда
		ПаспортДата = ПредставлениеДаты(ДанныеКлиента.passportIssuedAt);
	КонецЕсли;	
	
	СтруктураПаспорта = Новый Структура("Код, Кем, Когда, Серия, Номер", ПаспортКодПодразделения, ПаспортКемВыдан, ПаспортДата, ПаспортСерия, ПаспортНомер);
	
	Фио = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
	
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Фио);
	
	Если Не ЗначениеЗаполнено(НайденныйКонтрагент) Тогда
		
		Если Контрагент.Пустая() Тогда
			
			ОбКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			
		Иначе
			
			Возврат Контрагент;
				
		КонецЕсли;	
		
	Иначе
		
		ОбКонтрагент = НайденныйКонтрагент.ПолучитьОбъект();
		
	КонецЕсли;
	
	ОбКонтрагент.Фамилия = Фамилия;
	ОбКонтрагент.Имя = Имя;
	ОбКонтрагент.Отчество = Отчество;
	ОбКонтрагент.Наименование = фио;
	обКонтрагент.НаименованиеПолное = фио;
	ОбКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	ОбКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	
	Если Не ПустаяСтрока(ДанныеКлиента.gender) Тогда
		
		ОбКонтрагент.пол = ?(ДанныеКлиента.gender = "M", Перечисления.ПолФизическихЛиц.Мужской, Перечисления.ПолФизическихЛиц.Женский);
		
	КонецЕсли;	
	
	Телефоны = ДанныеКлиента.phones;
	
	Телефон = "";
	Если Телефоны.Количество() > 0 Тогда
		
		Телефон = ПредставлениеТелефона(Телефоны[0].number);
		
		ОбКонтрагент.ОсновнойТелефон = Телефон;
		
	КонецЕсли;	
	
	ДатаСОПД = ДанныеКлиента.consent_processing_personal_information_date;
	
	Если ЗначениеЗаполнено(ДатаСОПД) Тогда
	
		ДатаСОПД = ПредставлениеДаты(ДатаСОПД);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаСОПД) Тогда
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанныхДата = ДатаСопд;
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
	Иначе
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
	КонецЕсли;	
	
	Если не БезЗаписи Тогда
		обКонтрагент.Записать(); 
	КонецЕсли;	
	
	ДобавитьИДКонтрагента(ОбКонтрагент.Ссылка, ид);
	
	Если Не ПустаяСтрока(Телефон) Тогда
		ДобавитьТелефон(ОбКонтрагент.Ссылка, Телефоны[0].number)
	КонецЕсли;	
	
	Если Не ПустаяСтрока(емейл) Тогда
		ДобавитьЕмейл(ОбКонтрагент.Ссылка, емейл)
	КонецЕсли;	
	
	ДобавитьПаспорт(ОбКонтрагент.ссылка, СтруктураПаспорта);
	Если ДанныеКлиента.Свойство("address") = Истина Тогда
		ДобавитьАдрес(ОбКонтрагент.ссылка, ДанныеКлиента.address);
	КонецЕсли;
	
КонецФункции  

Процедура ДобавитьИДКонтрагента(Ссылка, ид)
	
	Наб = РегистрыСведений.БТ_црмКонтрагенты.СоздатьНаборЗаписей();
	Наб.Отбор.id.Установить(ид);
	Наб.Прочитать();
	
	Если Наб.Количество() = 0 Тогда
		
		Запись = Наб.Добавить();
		Запись.id = ид;
		Запись.Контрагент = Ссылка;
		
		Если Не БезЗаписи Тогда
			Наб.Записать();
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьИДЗаказа(Ссылка = Неопределено, ид, Контрагент, Автомобиль, Ошибка = "", idПотребности = Неопределено)
	
	Наб = РегистрыСведений.БТ_црмЗаказыНаАвтомобили.СоздатьНаборЗаписей();
	Наб.Отбор.id.Установить(ид);
	//условия для РЛ с несколькими потребностями
	Если idПотребности <> Неопределено Тогда
		Наб.Отбор.Потребность.Установить(Число(idПотребности));
	КонецЕсли;
	//
	Наб.Прочитать();
	
	Если Наб.Количество() = 0 Тогда
		
		Запись = Наб.Добавить();
		//условия для РЛ с несколькими потребностями
		Если idПотребности <> Неопределено Тогда
			Запись.Потребность = Число(idПотребности);	
		КонецЕсли;
		//
		Запись.id = ид;
		Запись.ЗаказНаАвтомобиль = Ссылка;
		Запись.Ошибки = Ошибка;
		Запись.Контрагент = Контрагент;
		Запись.Автомобиль = Автомобиль;
		Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
		
		Если Не БезЗаписи Тогда
			Наб.Записать();
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПредставлениеДаты(ДатаКонтракта)
	
	Возврат Дата(Сред(ДатаКонтракта, 9, 2)+"."+Сред(ДатаКонтракта, 6, 2)+"."+Лев(ДатаКонтракта, 4) + ?(СтрДлина(ДатаКонтракта) > 10, " "+Сред(ДатаКонтракта, 12), " 00:00:00"))
	
КонецФункции

Функция СоздатьЗаказНаАвтомобиль(СтруктураДанных, Автомобиль, Сумма, ДатаКонтракта, ид, idПотребности = Неопределено) 
	Попытка
		Автор = НайтиАвтора(СтруктураДанных);
	Исключение
		Возврат Неопределено
	КонецПопытки;
	
	Попытка
			ФамилияАвтора = СтруктураДанных.author.lastname;
		ИмяАвтора = СтруктураДанных.author.firstname;
	Исключение
		Возврат Неопределено
	КонецПопытки;
	
	//Сообщить(ФамилияАвтора + " " + ИмяАвтора);
	//Сообщить(Автомобиль);
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Возврат Неопределено;
	КонецЕсли;		
	
	Если Не црмРаботаСсоединением.ПодразделениеЦРМ(Автор.Подразделение) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Если БезЗаписи Тогда
		
		СозданоЗаказов = СозданоЗаказов + 1;
		
		Сообщить(Автомобиль);
		Возврат Неопределено;
	КонецЕсли;	
	
	Если СтруктураДанных.Свойство("PrimaryPerson") Тогда
		Контрагент = НайтиКонтрагента(СтруктураДанных.PrimaryPerson);	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_црмЗаказыНаАвтомобили.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ИЗ
	                      |	РегистрСведений.БТ_црмЗаказыНаАвтомобили КАК БТ_црмЗаказыНаАвтомобили
	                      |ГДЕ
	                      |	БТ_црмЗаказыНаАвтомобили.id = &id");
	Запрос.УстановитьПараметр("id", ид);
	
	//условия для РЛ с несколькими потребностями
	Если idПотребности <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "И БТ_црмЗаказыНаАвтомобили.Потребность = &idпотребности";
		Запрос.УстановитьПараметр("idпотребности", Число(idПотребности));
	КонецЕсли;
	
	НайденныйЗаказ = Неопределено;

	ВЗаказеПрописанИДРЛ = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Не ОбновлятьЗаказНаАвтомобиль Тогда
			Возврат Выборка.ЗаказНаАвтомобиль;
		КонецЕсли;	                   
		
		НайденныйЗаказ = Выборка.ЗаказНаАвтомобиль;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НайденныйЗаказ) Тогда
		
		Если ОбновлятьЗаказНаАвтомобиль Тогда
		
			ОбЗаказ = НайденныйЗаказ.ПолучитьОбъект();
			
		Иначе
			
			Возврат НайденныйЗаказ;
			
		КонецЕсли;	
		
	Иначе
		
		СуществующийЗаказ = УжеЕстьЗаказ(Автомобиль, Контрагент, ид, ВЗаказеПрописанИДРЛ);
		
		Если ЗначениеЗаполнено(СуществующийЗаказ)  Тогда
			
			Если Не ВЗаказеПрописанИДРЛ Тогда
			
				Ошибка = "В базе уже есть заказ клиента на этот авто " + СуществующийЗаказ; 
				
				ДобавитьИДЗаказа(, ид, Контрагент, Автомобиль, Ошибка, idПотребности);
				
				Возврат Неопределено;
			Иначе	
				
				//прописать условие, когда заказ в 1С уже не трогаем
				//Если ЗначениеЗаполнено(ОбЗаказ.автомобиль) Тогда
				//	Ошибка = "В базе уже есть заказ клиента на этот авто " + СуществующийЗаказ; 
				//
				//	ДобавитьИДЗаказа(, ид, Контрагент, Автомобиль, Ошибка);
				//	
				//	Возврат Неопределено;	
				//КонецЕсли;
				
				ОбЗаказ = СуществующийЗаказ.ПолучитьОбъект();
				
			КонецЕсли;	
		Иначе
			
			ОбЗаказ = Документы.ЗаказНаАвтомобиль.НайтиПоНомеру("ДФК0002474", '20230101').Скопировать();
		    СозданоЗаказов = СозданоЗаказов + 1;
			
		КонецЕсли;	
		
		
	КонецЕсли;	
	
	
	
	ОбЗаказ.Дата = ДатаКонтракта;  
	ОбЗаказ.Менеджер = автор;
	ОбЗаказ.ПодразделениеКомпании = Автор.Подразделение;
	ОбЗаказ.Организация = Автор.Организация;
	
	ОбЗаказ.Контрагент = Контрагент;
	ОбЗаказ.Заказчик = Контрагент;
	Обзаказ.Автомобиль = Автомобиль;
	ОбЗаказ.Автор = Автор;
	ОбЗаказ.Модель = автомобиль.Модель;
	ОбЗаказ.Цвет = автомобиль.Цвет;
	ОбЗаказ.ЦветКод = Автомобиль.ЦветКод;
	обЗаказ.СрокПоставки = Неопределено;
	ОбЗаказ.СуммаВсегоНаАвтомобиль = Сумма; 
	ОбЗаказ.ЦенаАвтомобиля = Сумма; 
	обЗаказ.СуммаСкидкиНаАвтомобиль = 0;
	ОбЗаказ.СуммаДокумента = Сумма;
	ОбЗаказ.bz_ПрогнозКМ = 0;
	ОбЗаказ.СтавкаНДСНаАвтомобиль = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	ОбЗаказ.ОбработкаРеквизита("СтавкаНДСНаАвтомобиль");
	
	Если не ЗначениеЗаполнено(НайденныйЗаказ) Тогда
		ОбЗаказ.ДоговорВзаиморасчетов = НайтиДоговор(Контрагент, ДатаКонтракта);		
	КонецЕсли;	
	
	Если Не БезЗаписи Тогда
		ОбЗаказ.Записать(РежимЗаписиДокумента.Запись);
		
		Ошибка = "";
		//Попытка
		//	ОбЗаказ.Записать(РежимЗаписиДокумента.Проведение)
		//Исключение
		//КонецПопытки;	
		
		ДобавитьИДЗаказа(обЗаказ.Ссылка, ид, Контрагент, Автомобиль, Ошибка, idПотребности);
	КонецЕсли;	
КонецФункции   

Функция НайтиАвтора(СтруктураДанных)
	ФамилияАвтора = СтруктураДанных.assignee.lastname;
	ИмяАвтора = СтруктураДанных.assignee.firstname;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Наименование ПОДОБНО &Наименование
	                      |	И НЕ Пользователи.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование", ФамилияАвтора+"%"+ИмяАвтора+"%");
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции	

Функция НайтиДоговор(Контрагент, ДатаКонтракта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	                      |ГДЕ
	                      |	НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	                      |	И ДоговорыВзаиморасчетов.Владелец = &Владелец
	                      |	И ДоговорыВзаиморасчетов.ДляАвтосалона
	                      |	И ДоговорыВзаиморасчетов.ДатаНачала = &ДатаНачала");
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаКонтракта));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
	ОбДоговор = Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ229807").Скопировать();
	ОбДоговор.Владелец = Контрагент;
	ОбДоговор.Наименование = "Продажа т\с в Руб от " + Формат(ДатаКонтракта, "ДФ=dd.MM.yy");
	ОбДоговор.Автор = ПараметрыСеанса.Пользователь;
	ОбДоговор.ДатаНачала = НачалоДня(ДатаКонтракта);
	обДоговор.ДляАвтосалона = Истина;
	ОбДоговор.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000001");
	обДоговор.УстановитьНовыйКод(ОбДоговор.тт_ВидДоговора.Префикс);
	
	Если Не БезЗаписи Тогда
		обДоговор.Записать();
	КонецЕсли;	
	
	Возврат обДоговор.Ссылка;
	
КонецФункции	

Функция УжеЕстьЗаказ(Автомобиль, Контрагент, ид, ВЗаказеПрописанИДРЛ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаАвтомобиль.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ГДЕ
	                      |	ЗаказНаАвтомобиль.БТ_idРЛCRM = &ид
	                      |	И НЕ ЗаказНаАвтомобиль.ПометкаУдаления");
	Запрос.УстановитьПараметр("ид", ид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВЗаказеПрописанИДРЛ = Истина;
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	

	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаАвтомобиль.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ГДЕ
	                      //|	ЗаказНаАвтомобиль.Проведен
	                      |	ЗаказНаАвтомобиль.Контрагент = &Контрагент
	                      |	И ЗаказНаАвтомобиль.Автомобиль = &Автомобиль");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
КонецФункции	

Функция ПредставлениеТелефона(телефон, КодГорода="", Префикс="", Номер="")
	
	Если СтрДлина(Телефон) <> 11 тогда
		
		Возврат Телефон;
		
	КонецЕсли;	        
	
	КодГорода = Лев(Телефон, 1);
	Префикс = Сред(Телефон, 2, 3);
	Номер = Сред(Телефон, 5);
	
	Возврат СтрШаблон("+%1 (%2) %3", КодГорода, Префикс, Номер);
	
конецФункции	

Процедура ДобавитьТелефон(Ссылка, Телефон)
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("00000007");
	
	КодГорода = ""; Префикс = ""; Номер = "";
	Представление = ПредставлениеТелефона(Телефон, КодГорода, Префикс, Номер);

	Если Не ПустаяСтрока(КодГорода) Тогда
		
		Мен.Поле1 = КодГорода;
		Мен.Поле2 = Префикс;
		Мен.Поле3 = Номер;
		
	КонецЕсли;	
	
	Мен.Представление = Представление;
	
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьЕмейл(Ссылка, емейл)
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
	
	Мен.Представление = емейл;
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры	
		
Процедура ДобавитьПаспорт(Ссылка, СтруктураПаспорта)
	
	//Новый Структура("Код, Кем, Когда, Серия, Номер"
	
	Если ПустаяСтрока(СтруктураПаспорта.Номер) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодтверждающиеДокументы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	                      |ГДЕ
	                      |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
	                      |	И ПодтверждающиеДокументы.Владелец = &Владелец
	                      |	И ПодтверждающиеДокументы.Номер = &Номер");	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
	Запрос.УстановитьПараметр("Номер", СтруктураПаспорта.Номер);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	НовыйДок = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	НовыйДок.Владелец = ссылка;
	НовыйДок.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
	
	НовыйДок.Номер = СтруктураПаспорта.Номер;
	НовыйДок.Серия = СтруктураПаспорта.Серия;
	НовыйДок.ДатаВыдачи = СтруктураПаспорта.Когда;
	НовыйДок.КемВыдан = СтруктураПаспорта.Кем;
	НовыйДОк.Наименование = НовыйДок.СформироватьНаименование();
	НовыйДок.Текущий = Истина;
	
	Если Не БезЗаписи Тогда
		НовыйДок.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьАдрес(Ссылка, Адреса)
	Если ПустаяСтрока(Адреса.city) и ПустаяСтрока(Адреса.region)	Тогда
		Возврат;
	КонецЕсли;	
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	Мен.Поле2 = Адреса.region;
	Мен.Поле4 = Адреса.city;
	Мен.Поле1 = Адреса.zipCode;
	Мен.Поле7 = АДреса.house;
	Мен.Поле6 = Адреса.street;
	
	Мен.Представление = киПолучитьПредставлениеАдреса(Мен);
	
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина); 
		
		Мен2 = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Мен2, Мен);
		Мен2.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		
		Мен2.Записать();
	КонецЕсли;	

КонецПроцедуры	

Процедура ПолучитьМодели() Экспорт
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМоделиПоСтранице(сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьМоделиПоСтранице(НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refModel?"+?(ЗначениеЗаполнено(ЗагружатьТолькоМарку),"brand_id="+СтрЗаменить(ЗагружатьТолькоМарку.ID, Символы.НПП, ""),"")+?(НомерСтраницы = 1, "", "&RefModelSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		Данные = ПрочитатьJSON(ЧтениеJson);
		
		СтруктураДанных = Данные.Result;
		
		Если Данные.meta.pagination.page_count < НомерСтраницы Тогда
			Возврат Ложь;
		КонецЕсли;	
		
		Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМодель(Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМодель(Данные) 
	
	Элемент = Справочники.CRM_МоделиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МоделиАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Марка = Справочники.CRM_МаркиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.brand_id));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьМарки() Экспорт
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМаркиПоСтранице(сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
	Сообщить("Страниц марок " + сч);
КонецПроцедуры                     

Функция ПолучитьМаркиПоСтранице(НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refBrand?"+?(НомерСтраницы = 1, "", "refBrandSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		Данные = ПрочитатьJSON(ЧтениеJson);
		
		СтруктураДанных = Данные.Result;
		
		Если Данные.meta.pagination.page_count < НомерСтраницы Тогда
			Возврат Ложь;
		КонецЕсли;	
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМарку(Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМарку(Данные) 
	
	Элемент = Справочники.CRM_МаркиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МаркиАвтомобилей.СоздатьЭлемент(); 
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id;
	Объект.Записать();
	
КонецПроцедуры 

Процедура ПолучитьПоколения() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьПоколенияПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьПоколенияПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьПоколенияПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьПоколенияПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьПоколенияПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refGeneration?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefGenerationSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьПоколение(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьПоколение(Модель, Данные) 
	
	Элемент = Справочники.CRM_ПоколенияАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_generation));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ПоколенияАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_generation; 
	Объект.Модель = Модель;
	
	Объект.Записать();
	
КонецПроцедуры  

Процедура ПолучитьСерии() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьСерииПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьСерииПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьСерииПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьСерииПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьСерииПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refSeries?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefSeriesSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьСерию(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьСерию(Модель, Данные) 
	
	Элемент = Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_serie));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_СерииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_serie; 
	Объект.Модель = Модель;        
	Объект.Поколение = Справочники.CRM_ПоколенияАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id_car_generation));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьКомплектации() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьКомплектацииПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьКомплектацииПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьКомплектацииПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьКомплектацииПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьКомплектацииПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refEquipment?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefEquipmentSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьКомплектацию(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьКомплектацию(Модель, Данные) 
	
	Элемент = Справочники.CRM_КомплектацииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_КомплектацииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель;        
	Объект.Серия = Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.series_id));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьМодификации() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СерииАвтомобилей.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СерииАвтомобилей КАК CRM_СерииАвтомобилей
	                      |ГДЕ
	                      |	(CRM_СерииАвтомобилей.Модель = &Модель
	                      |			ИЛИ &Все)");
	Запрос.УстановитьПараметр("Модель", ЗагружатьТолькоМодель);	
	Запрос.УстановитьПараметр("Все", ЗагружатьТолькоМодель.Пустая());	
	выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		ПолучитьМодификацииПоСерии(ВЫборка.Ссылка);
	КонецЦикла;	
		
	
КонецПроцедуры

Процедура ПолучитьМодификацииПоСерии(Серия)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМодификацииПоСтранице(Серия, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьМодификацииПоСтранице(Серия, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refModification?id_car_serie="+СтрЗаменить(Серия.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefModificationSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМодификацию(Серия, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМодификацию(Серия, Данные) 
	
	Элемент = Справочники.CRM_МодификацииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_modification));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МодификацииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_modification; 
	Объект.Модель = Серия.Модель;        
	Объект.Серия = Серия;//Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id_car_serie));
	Объект.Поколение = Серия.Поколение;
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьОтделки() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьОтделкиПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьОтделкиПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьОтделкиПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьОтделкиПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьОтделкиПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refSkin?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefSkinSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьОтделку(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьОтделку(Модель, Данные) 
	
	Элемент = Справочники.CRM_ОтделкиСалона.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ОтделкиСалона.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель; 
	Объект.КодОтделки = Данные.code;
	
	Объект.Записать();
	
КонецПроцедуры  

Процедура ПолучитьЦвета() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьЦветаПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьЦветаПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьЦветаПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьЦветаПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьЦветаПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refColor?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefColorSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьЦвет(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьЦвет(Модель, Данные) 
	
	Элемент = Справочники.CRM_ЦветаАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ЦветаАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель;
	Объект.rgb = Данные.rgb;  
	Объект.КодЦвета = Данные.code;
	
	Объект.Записать();
	
КонецПроцедуры  


#Область Закрытие_рабочего_листа_в_CRM
//При проведении реализации
Функция ЗакрытьРабочийЛистПоVIN(VIN,НомДок) Экспорт
	РЛ = ПолучитьРЛДляЗакрытия(VIN);	
	Если РЛ <> Неопределено Тогда
		Сообщить("Найден Рабочий лист №" + РЛ.id); 
		Если РЛ.needs.Количество() > 0 тогда
			Успешно = ПеревестиРЛВСтатусВыдан(РЛ.id,РЛ.needs[0].id,НомДок);
			Если Успешно Тогда
				Сообщить("Статус рабочего листа изменен на этап <Выдан>");
			КонецЕсли;
		Иначе
			Сообщить("Не найдена потребность в рабочем листе! Статус не изменен");	
		КонецЕсли;
	КонецЕсли;
КонецФункции
Функция ПолучитьРЛДляЗакрытия(VIN,БУ=Ложь) Экспорт 
	
	Если БУ=Истина Тогда
		СтрокаЗапроса = "/yii/api/SaleUsedCase?closedStageType=11&vehicleVin=" + VIN;	
	Иначе
		СтрокаЗапроса = "/yii/api/retailCase?closedStageType=11&vehicleVin=" + VIN;
	КонецЕсли;
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Если Элемент.contracts.Количество() <> 0 Тогда
				
				ДатаКонтракта = ЭтоКонтракт(Элемент.contract);
				
				Если ДатаКонтракта <> Ложь Тогда
				
					Возврат Элемент;
					
				КонецЕсли;
				
			КонецЕсли;	
	
		КонецЦикла;	
	
	КонецЕсли;
	
КонецФункции
Функция ПеревестиРЛВСтатусВыдан(ID,NeedId,НомДокумента) Экспорт
	//ID 			- id рабочего листа
	//NeedId 		- код потребности
	//НомДокумента 	- номер документа для комментария
	
	ДанныеДляПередачи = Новый Структура;
	ДанныеДляПередачиBody = Новый Структура; 
	
	ДанныеДляПередачиBody.Вставить("comment", "Автоматическая выдача после проведения реализации №"+НомДокумента);
	

	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);	
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс  = "yii/api/retailStage/finishIssue?id=" + ID + "&needId=" + NeedId;
	ПараметрыПодключения.Логин = "A.Klient";
	ПараметрыПодключения.Пароль = "sxhmf4";
    
	црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	
	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		ЗаголовокHTTP.Вставить("Host", СтрХост);
		ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
		ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
		ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		
		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.Записать(HTTPЗапрос); 
		
		КодСостояния = Результат.КодСостояния;
		
		Результат = Результат.ПолучитьТелоКакСтроку();
		
		
		Ошибка = Ложь;
		Возврат Истина;
				
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		
		Ошибка = Истина;
		
		Результат = ОписаниеОшибки();
		Возврат ложь;
		
	КонецПопытки;  
		
КонецФункции
#КонецОбласти 

#Область Создание_карточек_автомобилей_из_CRM
Функция ПолучитьАвтомобили(id_Автосалона,КоличествоСтраниц = 1) Экспорт 
		
	Для НомерСтраницы = 1 По КоличествоСтраниц Цикл
			
		СтрокаЗапроса = "/yii/api/warehouseVehicle?autosalonIds=" + id_Автосалона + ?(НомерСтраницы = 1, "", "&WarehouseVehicle_page="+НомерСтраницы);	
		
		СтрокаЗапроса = "/yii/api/warehouseVehicle?createdDateSince=13.08.2024&createdDateTill=15.08.2024" + ?(НомерСтраницы = 1, "", "&WarehouseVehicle_page="+НомерСтраницы);	
		
		Сообщить("Получаем страницу: "+ НомерСтраницы);
		Данные = ПолучениеДанных(СтрокаЗапроса);
		
		Данные = СтрЗаменить(Данные,"""05"":","""n05"":");
		
		
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(Данные);	
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
		
		Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			Для Каждого Элемент Из СтруктураДанных Цикл
					
				вин = Элемент.vin;
				
				НайденныйАвтомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN",вин);
				
				Если НайденныйАвтомобиль = Неопределено Тогда
					Сообщить("Авто не найден по вину: "+ вин);
				Иначе
					Сообщить("Найден автомобиль :" + НайденныйАвтомобиль);
				КонецЕсли;
				
			КонецЦикла;	
		
		КонецЕсли;			  
			
	КонецЦикла;
	
КонецФункции
#КонецОбласти 

#Область ОбновлениеРабочегоЛиста_в_CRM
#Если Клиент Тогда 
Функция ОбновитьРабочийЛистИзЗаказаНаАвтомобиль(ПодразделениеДокумента,АвтомобильДокумента,КонтрагентДокумента) Экспорт
	
	//Получаем id автосалона по подразделению
	ДанныеАвтосалонаПоПодразделению = ПолучитьIDпоПодразделению(ПодразделениеДокумента);
	Если ДанныеАвтосалонаПоПодразделению = Неопределено Тогда
		Сообщить("Подразделение "+ПодразделениеДокумента+" не настроено на обмен с CRM!");
		Предупреждение("Подразделение "+ПодразделениеДокумента+" не настроено на обмен с CRM!");
		Возврат Ложь;
	Иначе
		НаименованиеАвтосалонаПоПодразделению = ДанныеАвтосалонаПоПодразделению.Наименование;
		idАвтосалонаПоПодразделению = ДанныеАвтосалонаПоПодразделению.Код;
	КонецЕсли;
	
	//Костыль пока не добавим нормально
	Если ПолучитьУчетныеДанныеПоIDАвтосалона(idАвтосалонаПоПодразделению) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	//Попытка найти рабочий лист по VIN
	Если АвтомобильДокумента <> Неопределено И ЗначениеЗаполнено(АвтомобильДокумента.VIN) Тогда
		Сообщить("Пытаемся найти рабочий лист по VIN...");
		ДанныеРабочегоЛиста = ПолучитьРЛпоVIN(АвтомобильДокумента.VIN,idАвтосалонаПоПодразделению);
		Если ДанныеРабочегоЛиста = Неопределено Тогда
			Сообщить("Пытаемся найти рабочий лист БУ по VIN...");
			ДанныеРабочегоЛиста = ПолучитьРЛпоVIN(АвтомобильДокумента.VIN,idАвтосалонаПоПодразделению,Истина);
		КонецЕсли;
	Иначе
		Сообщить("VIN номер не заполнен! Обновление рабочего листа прервано!");
		Предупреждение("VIN номер не заполнен! Обновление рабочего листа прервано!");
		Возврат Ложь;
	КонецЕсли;
	
	УжеСпрашивали = Ложь;
	
	//Спросим - подходит ли найденый по VIN рабочий лист
	Если ДанныеРабочегоЛиста <> Неопределено Тогда
		idРЛ = ДанныеРабочегоЛиста.id;
		СтрокаВопроса = "Найден рабочий лист №"+Строка(idРЛ);
		Попытка
			ИмяКонтрагентаИзРабочегоЛиста = ДанныеРабочегоЛиста.primaryPerson.lastName + " " +
										    ДанныеРабочегоЛиста.primaryPerson.firstName + " " +
											ДанныеРабочегоЛиста.primaryPerson.middleName;
			СтрокаВопроса = СтрокаВопроса + Символы.ПС + "Контрагент : " + ИмяКонтрагентаИзРабочегоЛиста;
		Исключение
		КонецПопытки;
		СтрокаВопроса = СтрокаВопроса + Символы.ПС + "Продолжить?";
		Сообщить(СтрокаВопроса);
		Ответ = Вопрос(СтрокаВопроса,
						РежимДиалогаВопрос.ДаНет,
						0,
			        	КодВозвратаДиалога.Да, 
						"Найден рабочий лист"); 
	    Если Ответ = КодВозвратаДиалога.Нет Тогда
	    	ДанныеРабочегоЛиста = Неопределено;
			idРЛ				= Неопределено;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
			УжеСпрашивали = Истина;
	    КонецЕсли;
	КонецЕсли;
		
	//Спросим номер рабочего листа
	Если ДанныеРабочегоЛиста = Неопределено Тогда
		idРЛ = Неопределено;
		Сообщить("Рабочий лист не найден! Введите номер рабочего листа!");
		//Спросим номер рабочего листа
		Если ВвестиЧисло(idРЛ,"Введите номер рабочего листа", 7,0) Тогда
			Если idРЛ = 0 Тогда
				Сообщить("Номер рабочего листа не введен. Обновление рабочего листа прервано!");
				Возврат Ложь;
			КонецЕсли; 
			Сообщить("Пытаемся найти рабочий лист по номеру...");
			ДанныеРабочегоЛиста = ПолучитьРЛпоНомеру(idРЛ);
			Если ДанныеРабочегоЛиста = Неопределено Тогда
				Сообщить("Пытаемся найти рабочий лист БУ по номеру...");
				ДанныеРабочегоЛиста = ПолучитьРЛпоНомеру(idРЛ,Истина);
			КонецЕсли;
			Если ДанныеРабочегоЛиста = Неопределено Тогда
				Сообщить("Рабочий лист не найден в CRM! Проверьте корректность ввода. Обновление рабочего листа прервано!");
				Предупреждение("Рабочий лист не найден в CRM! Проверьте корректность ввода.");
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Сообщить("Номер рабочего листа не введен. Обновление рабочего листа прервано!");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Проверим соответствие автосалона и автосалона по подразделению
	idАвтосалонаИзРабочегоЛиста 			= ДанныеРабочегоЛиста.autosalon.id;
	НаименованиеАвтосалонаИзРабочегоЛиста 	= ДанныеРабочегоЛиста.autosalon.name;
	Если Строка(idАвтосалонаИзРабочегоЛиста)<>Строка(idАвтосалонаПоПодразделению) Тогда
		Сообщить("Автосалон из рабочего листа ("+НаименованиеАвтосалонаИзРабочегоЛиста+") не соответствует настроенному автосалону по подразделению ("+НаименованиеАвтосалонаПоПодразделению+")");
		Предупреждение("Автосалон из рабочего листа ("+НаименованиеАвтосалонаИзРабочегоЛиста+") не соответствует настроенному автосалону по подразделению ("+НаименованиеАвтосалонаПоПодразделению+")");
		Возврат Ложь;
	КонецЕсли;
	
	//Точно такой же блок как и при поиске по VIN
	//Спросим - подходит ли введенный по номеру рабочий лист
	Если ДанныеРабочегоЛиста <> Неопределено И УжеСпрашивали = Ложь Тогда
		idРЛ = ДанныеРабочегоЛиста.id;
		СтрокаВопроса = "Найден рабочий лист №"+Строка(idРЛ);
		Попытка
			ИмяКонтрагентаИзРабочегоЛиста = ДанныеРабочегоЛиста.primaryPerson.lastName + " " +
										    ДанныеРабочегоЛиста.primaryPerson.firstName + " " +
											ДанныеРабочегоЛиста.primaryPerson.middleName;
			СтрокаВопроса = СтрокаВопроса + Символы.ПС + "Контрагент : " + ИмяКонтрагентаИзРабочегоЛиста;
		Исключение
		КонецПопытки;
		СтрокаВопроса = СтрокаВопроса + Символы.ПС + "Продолжить?";
		Сообщить(СтрокаВопроса);
		Ответ = Вопрос(СтрокаВопроса,
						РежимДиалогаВопрос.ДаНет,
						0,
			        	КодВозвратаДиалога.Да, 
						"Найден рабочий лист"); 
	    Если Ответ = КодВозвратаДиалога.Нет Тогда
	    	Сообщить("Обновление рабочего листа отменено!");
			Возврат Ложь;
	    КонецЕсли;
	КонецЕсли;
	
	ДанныеКонтрагентаИз1С = ПолучитьДанныеКонтрагента(КонтрагентДокумента); 
	
	//Проверим - изменен ли номер телефона контрагента
	//APi не позволяет обновить информацию контрагента если телефон не был изменен и телефон содержится в запросе
	ОбновлятьТелефонКонтрагента		  = Истина;
	ТелефонКонтрагентаИзРабочегоЛиста = ДанныеРабочегоЛиста.primaryPerson.phones[0].number;
	ТелефонКонтрагентаИз1С			  = ДанныеКонтрагентаИз1С.Телефон;
	ТелефонКонтрагентаИз1С			  = СтрЗаменить(ТелефонКонтрагентаИз1С,"+","");
	ТелефонКонтрагентаИз1С			  = СтрЗаменить(ТелефонКонтрагентаИз1С," ","");
	ТелефонКонтрагентаИз1С			  = СтрЗаменить(ТелефонКонтрагентаИз1С,"(","");
	ТелефонКонтрагентаИз1С			  = СтрЗаменить(ТелефонКонтрагентаИз1С,")","");
	Если ТелефонКонтрагентаИз1С = ТелефонКонтрагентаИзРабочегоЛиста Тогда
		ОбновлятьТелефонКонтрагента	  = Ложь;
	КонецЕсли;
	//Проверка на корректную длину номера телефона
	Если СтрДлина(ТелефонКонтрагентаИз1С) <> 11 Тогда
		Сообщить("Номер телефона контрагента "+ДанныеКонтрагентаИз1С.Телефон+ " указан не верно. Телефон не будет обновлен.");
		ОбновлятьТелефонКонтрагента	  = Ложь;	
	КОнецЕсли;
	
	//обновим данные контрагента 
	idКонтрагента =  Строка(ДанныеРабочегоЛиста.clientId);
	idКонтрагента =  СтрЗаменить(idКонтрагента,Символы.НПП,"");
	idКонтрагента =  СтрЗаменить(idКонтрагента," ","");
	Если ЗначениеЗаполнено(idКонтрагента) Тогда
		ИтогОбновленияКонтрагента = ИзменитьКонтрагентаВCRM(ДанныеКонтрагентаИз1С,idКонтрагента,ОбновлятьТелефонКонтрагента);
		Успешно = ВыводОшибокAPI(ИтогОбновленияКонтрагента,"обновить контрагента");
		Если Успешно = Ложь Тогда
			Возврат Ложь;
		Иначе
			Сообщить("Контрагент обновлен в CRM");
		КонецЕсли;
	КонецЕсли;
	
	//найдем автомобиль по VIN
	VIN = АвтомобильДокумента.VIN;
	Если ЗначениеЗаполнено(VIN) Тогда 
		ДанныеАвтомобиляИзCRM = ПолучитьАвтомобильПоVin(VIN);
		Если ДанныеАвтомобиляИзCRM = Неопределено Тогда
			Сообщить("Не найден автомобиль по Vin номеру "+VIN);	
			Предупреждение("Не найден автомобиль по Vin номеру "+VIN);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//Проверим соответствие автосалона РЛ и автосалона Автомобиля
	Если ДанныеАвтомобиляИзCRM <> Неопределено Тогда
		idАвтосалонаАвтомобиля 				= ДанныеАвтомобиляИзCRM.autosalonId;
		НаименованиеАвтосалонаАвтомобиля 	= Справочники.CRM_СопоставлениеСалоновКПодразделениям.НайтиПоКоду(ДанныеАвтомобиляИзCRM.autosalonId);
		Если НаименованиеАвтосалонаАвтомобиля = Неопределено тогда
			НаименованиеАвтосалонаАвтомобиля = "Нет информации о наименовании";		
		КонецЕсли;
		Если Строка(idАвтосалонаАвтомобиля)<>Строка(idАвтосалонаПоПодразделению) Тогда
			Сообщить("Автосалон автомобиля из рабочего листа ("+НаименованиеАвтосалонаАвтомобиля+") не соответствует настроенному автосалону по подразделению ("+НаименованиеАвтосалонаПоПодразделению+")");
			Предупреждение("Автосалон автомобиля из рабочего листа ("+НаименованиеАвтосалонаАвтомобиля+") не соответствует настроенному автосалону по подразделению ("+НаименованиеАвтосалонаПоПодразделению+")");
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
		
	//обновим автомобиль
	idАвтомобиля  = ДанныеАвтомобиляИзCRM.id;
	idПотребности = ДанныеРабочегоЛиста.needs[0].id;
	Если ЗначениеЗаполнено(idАвтомобиля) И ЗначениеЗаполнено(idПотребности) И ЗначениеЗаполнено(idРЛ) Тогда
		ИтогОбновленияАвтомобиля = РезервированиеАвтоДляРабочегоЛиста(idАвтомобиля,idРЛ,idПотребности);	
		Успешно = ВыводОшибокAPI(ИтогОбновленияАвтомобиля,"обновить автомобиль");
		Если Успешно = Ложь Тогда
			Возврат Ложь;
		Иначе
			Сообщить("Автомобиль обновлен в CRM");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции
#КонецЕсли
Функция ПолучитьРЛпоVIN(VIN,idПодразделения,БУ=Ложь) Экспорт 
	
	Если БУ=Истина Тогда
		СтрокаЗапроса = "/yii/api/SaleUsedCase?salonId="+idПодразделения+"&vehicleVin=" + VIN;	
	Иначе
		СтрокаЗапроса = "/yii/api/retailCase?salonId="+idПодразделения+"&vehicleVin=" + VIN;
	КонецЕсли;
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Возврат Элемент;	
	
		КонецЦикла;	
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьРЛпоНомеру(НомерРЛ,БУ=Ложь) Экспорт 
	
	НомерРЛ = СтрЗаменить(НомерРЛ,Символы.НПП,"");
	Если БУ=Истина Тогда
		СтрокаЗапроса = "/yii/api/SaleUsedCase?id=" + НомерРЛ;	
	Иначе
		СтрокаЗапроса = "/yii/api/retailCase?id=" + НомерРЛ;
	КонецЕсли;
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
				
			Возврат Элемент;	
	
		КонецЦикла;	
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьВсеАвтосалоны() Экспорт 
	
	СтрокаЗапроса = "/yii/api/autosalon";
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Возврат СтруктураДанных	
	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьIDпоПодразделению(Подразделение) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СопоставлениеСалоновКПодразделениямПодразделения.Ссылка.Код КАК Код,
		|	CRM_СопоставлениеСалоновКПодразделениямПодразделения.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	Справочник.CRM_СопоставлениеСалоновКПодразделениям.Подразделения КАК CRM_СопоставлениеСалоновКПодразделениямПодразделения
		|ГДЕ
		|	CRM_СопоставлениеСалоновКПодразделениямПодразделения.Подразделение = &Подразделение
		|	И CRM_СопоставлениеСалоновКПодразделениямПодразделения.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураДляВозврата = Новый Структура;
		СтруктураДляВозврата.Вставить("Код",ВыборкаДетальныеЗаписи.Код);
		СтруктураДляВозврата.Вставить("Наименование",ВыборкаДетальныеЗаписи.Наименование);
		Возврат СтруктураДляВозврата;
	КонецЦикла;
КонецФункции
Функция ПолучитьДанныеКонтрагента(Контрагент) Экспорт 
	
	ДанныеКонтрагента = Новый Структура;	
	
	//фио
	ДанныеКонтрагента.Вставить("Имя",		Контрагент.Имя);
	ДанныеКонтрагента.Вставить("Фамилия",	Контрагент.Фамилия);
	ДанныеКонтрагента.Вставить("Отчество",Контрагент.Отчество);
	
	//паспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка КАК Документ,
	|	ПодтверждающиеДокументы.КемВыдан КАК ДокументКемВыдан,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидДокумента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И ПодтверждающиеДокументы.Текущий = ИСТИНА
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента";
	Запрос.УстановитьПараметр("Владелец", Контрагент);		
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);		
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	Если ВыборкаДокументов.Количество()<>0 Тогда
		ВыборкаДокументов.Следующий();
		ДанныеКонтрагента.Вставить("ПаспортСерия",		СокрЛП(ВыборкаДокументов.Документ.Серия));
		ДанныеКонтрагента.Вставить("ПаспортНомер",		СокрЛП(ВыборкаДокументов.Документ.Номер));
		ДанныеКонтрагента.Вставить("ПаспортКод",			СокрЛП(ВыборкаДокументов.Документ.НомерБланка));
		ДанныеКонтрагента.Вставить("ПаспортКемВыдан",		СокрЛП(ВыборкаДокументов.ДокументКемВыдан));
		ДанныеКонтрагента.Вставить("ПаспортДатаВыдачи",	Формат(ВыборкаДокументов.ДокументДатаВыдачи,"ДФ=dd.MM.yyyy"));
	Иначе
		ДанныеКонтрагента.Вставить("ПаспортСерия",		"");
		ДанныеКонтрагента.Вставить("ПаспортНомер",		"");
		ДанныеКонтрагента.Вставить("ПаспортКод",			"");
		ДанныеКонтрагента.Вставить("ПаспортКемВыдан",		"");
		ДанныеКонтрагента.Вставить("ПаспортДатаВыдачи",	"");
	КонецЕсли;
	
	//Телефон
	КонтрагентТелефон = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
	Если ПустаяСтрока(КонтрагентТелефон) Тогда
		КонтрагентТелефон = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	КонецЕсли;	
	Если ПустаяСтрока(КонтрагентТелефон) Тогда
		КонтрагентТелефон = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
	КонецЕсли;	
	Если ПустаяСтрока(КонтрагентТелефон) Тогда
		КонтрагентТелефон = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
	КонецЕсли;
	ДанныеКонтрагента.Вставить("Телефон",	КонтрагентТелефон);
	
	//почта
	КонтрагентЭлПочта = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Если КонтрагентЭлПочта="" Тогда
		КонтрагентЭлПочта = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);	
	КонецЕсли;
	ДанныеКонтрагента.Вставить("ЭлПочта",	КонтрагентЭлПочта);
	
	//адрес
	КонтрагентАдрес = "";
	Если НЕ обЗначениеНеЗаполнено(киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресФактический)) Тогда
		КонтрагентАдрес = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресФактический);	
	ИначеЕсли НЕ обЗначениеНеЗаполнено(киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресПочтовый)) Тогда
		КонтрагентАдрес = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	ИначеЕсли НЕ обЗначениеНеЗаполнено(киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресЮридический)) Тогда
		КонтрагентАдрес = киПолучитьПредставлениеКИ(Контрагент,Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтактнаяИнформация.Представление,
	               |	КонтактнаяИнформация.Поле1,
	               |	КонтактнаяИнформация.Поле2,
	               |	КонтактнаяИнформация.Поле3,
	               |	КонтактнаяИнформация.Поле4,
	               |	КонтактнаяИнформация.Поле5,
	               |	КонтактнаяИнформация.Поле6,
	               |	КонтактнаяИнформация.Поле7,
	               |	КонтактнаяИнформация.Поле8,
	               |	КонтактнаяИнформация.Поле9,
	               |	КонтактнаяИнформация.Поле10,
	               |	КонтактнаяИнформация.Комментарий
	               |ИЗ
	               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Объект = &Объект
	               |	И КонтактнаяИнформация.Тип = &Тип
	               |	И КонтактнаяИнформация.Вид = &Вид";
				   
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресФактический);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		ДанныеКонтрагента.Вставить("Почтовыйиндекс", Выборка.Поле1);
		ДанныеКонтрагента.Вставить("Регион", Выборка.Поле2);
		ДанныеКонтрагента.Вставить("Район", Выборка.Поле3);
		ДанныеКонтрагента.Вставить("Населенныйпункт", Выборка.Поле4);
		ДанныеКонтрагента.Вставить("Город", Выборка.Поле5);
		ДанныеКонтрагента.Вставить("Улица", Выборка.Поле6);
		ДанныеКонтрагента.Вставить("Дом", Выборка.Поле7);
		ДанныеКонтрагента.Вставить("Корпус", Выборка.Поле8);
		ДанныеКонтрагента.Вставить("Квартира", Выборка.Поле9);
	КонецЕсли;
	
	//СОПД 
	ДанныеКонтрагента.Вставить("СОПД", 		Контрагент.СогласиеНаОбработкуПерсональныхДанных);
	ДанныеКонтрагента.Вставить("СОПДДата",  Формат(Контрагент.СогласиеНаОбработкуПерсональныхДанныхДата,"ДФ=dd.MM.yyyy"));
	
	//День рождения
	Если ЗначениеЗаполнено(Контрагент.ДатаРождения) Тогда
		ДанныеКонтрагента.Вставить("ДатаРождения",  Формат(Контрагент.ДатаРождения,"ДФ=dd.MM.yyyy"));
	Иначе
		ДанныеКонтрагента.Вставить("ДатаРождения",  "");
	КонецЕсли;
	
	Возврат ДанныеКонтрагента;
		
КонецФункции
Функция ИзменитьКонтрагентаВCRM(ДанныеКонтрагента,idКонтрагентаВCRM,ОбновлятьЛиТелефон = Истина) Экспорт 
	
	ДанныеДляПередачиBody = Новый Структура;
	
	Если ЗначениеЗаполнено(ДанныеКонтрагента.ДатаРождения) Тогда
		ДанныеДляПередачиBody.Вставить("birthday",  ДанныеКонтрагента.ДатаРождения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКонтрагента.Имя) И ЗначениеЗаполнено(ДанныеКонтрагента.Фамилия) И ЗначениеЗаполнено(ДанныеКонтрагента.Отчество) Тогда
		ДанныеДляПередачиBody.Вставить("firstName",  ДанныеКонтрагента.Имя);
		ДанныеДляПередачиBody.Вставить("middleName", ДанныеКонтрагента.Отчество); 
		ДанныеДляПередачиBody.Вставить("lastName",	 ДанныеКонтрагента.Фамилия);
    КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКонтрагента.ЭлПочта) Тогда
		ДанныеДляПередачиBody.Вставить("email",  	 ДанныеКонтрагента.ЭлПочта);
    КонецЕсли;
	
	Если ОбновлятьЛиТелефон Тогда
		Если ЗначениеЗаполнено(ДанныеКонтрагента.Телефон) Тогда
			МассивТелефонов = новый Массив;
			ТелефонДляПередачи = Новый Структура;
			ТелефонДляПередачи.Вставить("id",  	 	 "0");
			ТелефонДляПередачи.Вставить("type",  	 	 "2");
			ТелефонДляПередачи.Вставить("number",  	 ДанныеКонтрагента.Телефон);  
			МассивТелефонов.Добавить(ТелефонДляПередачи);  
			ДанныеДляПередачиBody.Вставить("phones",  	 МассивТелефонов);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКонтрагента.Улица) И ЗначениеЗаполнено(ДанныеКонтрагента.Дом) Тогда
		МассивАдресов = новый Массив;	
		АдресДляПередачи = Новый Структура;
		АдресДляПередачи.Вставить("id",  	 	 	"0");
		АдресДляПередачи.Вставить("zipCode",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Почтовыйиндекс),ДанныеКонтрагента.Почтовыйиндекс,""));
		АдресДляПередачи.Вставить("region",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Регион),ДанныеКонтрагента.Регион,""));
		АдресДляПередачи.Вставить("district",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Район),ДанныеКонтрагента.Район,""));
		АдресДляПередачи.Вставить("city",  	 		?(ЗначениеЗаполнено(ДанныеКонтрагента.Город),ДанныеКонтрагента.Город,?(ЗначениеЗаполнено(ДанныеКонтрагента.Населенныйпункт),ДанныеКонтрагента.Населенныйпункт,"")));
		АдресДляПередачи.Вставить("street",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Улица),ДанныеКонтрагента.Улица,""));
		АдресДляПередачи.Вставить("house",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Дом),ДанныеКонтрагента.Дом,""));
		АдресДляПередачи.Вставить("building",  	 	?(ЗначениеЗаполнено(ДанныеКонтрагента.Корпус),ДанныеКонтрагента.Корпус,""));
		АдресДляПередачи.Вставить("apartment",  	?(ЗначениеЗаполнено(ДанныеКонтрагента.Квартира),ДанныеКонтрагента.Квартира,""));
		АдресДляПередачи.Вставить("cityDistrict",  	"");
		МассивАдресов.Добавить(АдресДляПередачи);	
		ДанныеДляПередачиBody.Вставить("addresses",  МассивАдресов);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеКонтрагента.ПаспортСерия) И ЗначениеЗаполнено(ДанныеКонтрагента.ПаспортНомер) Тогда
        ДанныеДляПередачиBody.Вставить("passportSeries",  			ДанныеКонтрагента.ПаспортСерия);
		ДанныеДляПередачиBody.Вставить("passportNumber", 			ДанныеКонтрагента.ПаспортНомер); 
		ДанныеДляПередачиBody.Вставить("passportIssuedAt",			ДанныеКонтрагента.ПаспортДатаВыдачи);
		ДанныеДляПередачиBody.Вставить("passportIssuedBy",			ДанныеКонтрагента.ПаспортКемВыдан);
		ДанныеДляПередачиBody.Вставить("passportDepartmentCode",	ДанныеКонтрагента.ПаспортКод);
	КонецЕсли;
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
	
	ДанныеДляПередачи = Новый Структура;
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс            = "/yii/api/client/" + idКонтрагентаВCRM;
	
	ПараметрыПодключения.Логин = "A.Klient";
	ПараметрыПодключения.Пароль = "sxhmf4";
	
	//ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения,,,);
	
	црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	
	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Host", СтрХост);
		ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
		ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
		ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.Записать(HTTPЗапрос); 
		
		КодСостояния = Результат.КодСостояния;
		
		Результат = Результат.ПолучитьТелоКакСтроку();
		
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(Результат);	
		
		Результат = ПрочитатьJSON(ЧтениеJson);
		
		Ошибка = Ложь;
				
	Исключение
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		Ошибка = Истина;
		Результат = ОписаниеОшибки();	
	КонецПопытки;  
	
	Возврат Результат;
		
КонецФункции
Функция РезервированиеАвтоДляРабочегоЛиста(idАвтомобиля=Неопределено,idРабочегоЛиста=Неопределено,idПотребности=Неопределено) Экспорт
	
	idАвтомобиля =  Строка(idАвтомобиля);
	idАвтомобиля =  СтрЗаменить(idАвтомобиля,Символы.НПП,"");
	idАвтомобиля =  СтрЗаменить(idАвтомобиля," ","");
	
	idРабочегоЛиста =  Строка(idРабочегоЛиста);
	idРабочегоЛиста =  СтрЗаменить(idРабочегоЛиста,Символы.НПП,"");
	idРабочегоЛиста =  СтрЗаменить(idРабочегоЛиста," ","");

	idПотребности =  Строка(idПотребности);
	idПотребности =  СтрЗаменить(idПотребности,Символы.НПП,"");
	idПотребности =  СтрЗаменить(idПотребности," ","");

	СтрокаЗапроса = "/yii/vehicleStock/vehicle/reserveVehicle/"+Строка(idАвтомобиля)+"/?needId="+Строка(idПотребности)+"&caseId=" + Строка(idРабочегоЛиста);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson);
	
	Если ТипЗнч(СтруктураДанных) = Тип("Структура") Тогда
		
		Возврат СтруктураДанных	
	
	КонецЕсли;
	
	Возврат Неопределено;	
КонецФункции
Функция ПолучитьАвтомобильПоVin(VIN) Экспорт 
	
	СтрокаЗапроса = "/yii/api/warehouseVehicle?vin=" + VIN;			
	Данные = ПолучениеДанных(СтрокаЗапроса);
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);
	
	//"options":{"00":null,"BW":null}
	//в блоке options могут содержатся значения с недопустимым именем
	Попытка
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	Исключение
		НачалоОпций = СтрНайти(Данные, """options"":{");
		КонецОпций	= СтрНайти(Данные, "},",,НачалоОпций); 
		ЧислоСимволов = КонецОпций - НачалоОпций + 2;
		Подстрока = Сред(Данные, НачалоОпций, ЧислоСимволов);
		Данные = СтрЗаменить(Данные, Подстрока, ""); 
		
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(Данные);
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	КонецПопытки;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Если СтруктураДанных.Количество() > 0 Тогда
			
			Возврат СтруктураДанных[0];
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;	
		
	Иначе	
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции
#Если Клиент Тогда 
Функция ВыводОшибокAPI(ДанныеЗапроса,ЧтоДелалиСтрока=Неопределено) Экспорт
	Если ТипЗнч(ДанныеЗапроса) = Тип("Структура") Тогда
		Если ДанныеЗапроса.success Тогда
			Возврат Истина;	
		Иначе
			Если ЧтоДелалиСтрока = Неопределено Тогда
				Сообщить("Не удалось..");
			Иначе
				Сообщить("Не удалось "+ЧтоДелалиСтрока);
			КонецЕсли;
			ВсеОшибки = "";
			Если ДанныеЗапроса.Свойство("errors") Тогда
				Если ТипЗнч(ДанныеЗапроса.errors) = Тип("Строка") Тогда
					//очистка текста ошибки от тегов
					ТекстОшибки = ОчисткаТекстаОтHTMLТегов(ДанныеЗапроса.errors);
					ВсеОшибки = "Текст ошибки: " + ТекстОшибки;
				Иначе
					Для Каждого ТипОшибки из ДанныеЗапроса.errors Цикл	
						Если ТипЗнч(ТипОшибки) = Тип("КлючИЗначение") И ТипОшибки.Значение.количество() > 0 Тогда
							Причина = ТипОшибки.Ключ; 
							ТекстОшибки = ТипОшибки.Значение[0];
						    //Текст ошибки до первого переноса строки	
							Если СтрНайти(ТекстОшибки,"<br>") > 0 Тогда
								ТекстОшибки = СтрРазделить(ТекстОшибки,"<br>")[0];			
							КонецЕсли;
							
							ВсеОшибки = ВсеОшибки+"Данные: "+Причина+" Комментарий: "+ТекстОшибки+Символы.ПС;
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;
			ИначеЕсли ДанныеЗапроса.Свойство("error") Тогда
				Если ТипЗнч(ДанныеЗапроса.error) = Тип("Строка") Тогда
					ВсеОшибки = "Текст ошибки: " + ДанныеЗапроса.error; 
				КонецЕсли;
			КонецЕсли;
			Сообщить(ВсеОшибки);
			Если ЧтоДелалиСтрока = Неопределено Тогда
				Предупреждение("Не удалось выполнить действие в CRM"+Символы.ПС+ВсеОшибки);
			Иначе
				Предупреждение("Не удалось "+ЧтоДелалиСтрока+Символы.ПС+ВсеОшибки);
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Сообщить("Неизвестный ответ от сервера");
		Возврат Ложь;
	КонецЕсли;	
КонецФункции
#КонецЕсли
Функция ОчисткаТекстаОтHTMLТегов(Текст) Экспорт 
	Пока СтрНайти(Текст,"<") <> 0 Цикл
		НачалоТега = СтрНайти(Текст, "<");
		КонецТега	= СтрНайти(Текст, ">"); 
		ЧислоСимволов = КонецТега - НачалоТега + 1;
		Подстрока = Сред(Текст, НачалоТега, ЧислоСимволов);
		Текст = СтрЗаменить(Текст, Подстрока, "");	
	КонецЦикла;
	Возврат Текст; 
КонецФункции
#КонецОбласти

#Область Получение_РЛ_по_Автосалонам
Функция ПолучитьАвтосалоныДляОтделаПродаж()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СопоставлениеСалоновКПодразделениям.Код КАК Код,
		|	CRM_СопоставлениеСалоновКПодразделениям.Наименование КАК Наименование
		|ИЗ
		|	Справочник.CRM_СопоставлениеСалоновКПодразделениям КАК CRM_СопоставлениеСалоновКПодразделениям
		|ГДЕ
		|	CRM_СопоставлениеСалоновКПодразделениям.ПометкаУдаления = ЛОЖЬ
		|	И CRM_СопоставлениеСалоновКПодразделениям.ИспользуетсяДляОтделаПродаж = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
#КонецОбласти  

Функция ИсправитьJSON(JSON)
	JSON = СтрЗаменитьПоРегулярномуВыражению(JSON, """([0-9]{1,30}[0-9aA-zZаА-ЯЯ]{0,100})"":", """N$1"":");	// наименование ключей цифрами
	Возврат JSON;
КонецФункции

Функция ПолучитьУчетныеДанныеПоIDАвтосалона(ID)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_СопоставлениеСалоновКПодразделениям.Логин КАК Логин,
		|	CRM_СопоставлениеСалоновКПодразделениям.Пароль КАК Пароль
		|ИЗ
		|	Справочник.CRM_СопоставлениеСалоновКПодразделениям КАК CRM_СопоставлениеСалоновКПодразделениям
		|ГДЕ
		|	CRM_СопоставлениеСалоновКПодразделениям.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Логин  = ВыборкаДетальныеЗаписи.Логин;
		Пароль = ВыборкаДетальныеЗаписи.Пароль;
		Возврат Истина;	
	КонецЦикла;
	
	Сообщить("Нет учетной записи для ID автосалона "+Строка(ID));
	Возврат Неопределено;	
	
КонецФункции

Логин = "A.Klient";
Пароль = "sxhmf4";