Функция ВыгрузитьВФайл(ВернутьРезультат = Ложь, СтруктураОтбора = Неопределено) Экспорт
	
	ПервыйЛист = ПолучитьПервыйЛист(СтруктураОтбора);  
	ВторойЛист = ПолучитьВторойЛист(ПервыйЛист.ТЗ, СтруктураОтбора); 
	ТретийЛист = Неопределено;
	Если СтруктураОтбора = Неопределено Тогда     
		
		ТретийЛист = ПолучитьВторойЛист(ПервыйЛист.ТЗ, СтруктураОтбора, "РасшифровкаОстаков"); 
		
	КонецЕсли;
	
	Если ВернутьРезультат Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ПервыйЛист", ПервыйЛист.ТабличныйДокумент);
		Результат.Вставить("ВторойЛист", ВторойЛист);     
		Если Не ТретийЛист = Неопределено Тогда
			
			Результат.Вставить("ТретийЛист", ТретийЛист);
			
		КонецЕсли;
		
		Возврат Результат;
		
	Иначе      
		
		Если Не СтруктураОтбора = Неопределено Тогда
			
			Если СтруктураОтбора.Свойство("Ссылка") и СтруктураОтбора.Свойство("ПутьФайлаЗН") и ЗначениеЗаполнено(СтруктураОтбора.ПутьФайлаЗН) Тогда
				
				ИмяФайла = ""+СтруктураОтбора.ПутьФайлаЗН+ "1.XLSX";
				
			Иначе
				
				ИмяФайла = ""+СтруктураОтбора.ПутьФайла+ "1.XLSX";
				
			КонецЕсли;
			
		КонецЕсли;
		
		Книга = Новый ПакетОтображаемыхДокументов;
		Лист1 = Книга.Состав.Добавить();
		Лист1.Данные 		= ПоместитьВоВременноеХранилище(ПервыйЛист.ТабличныйДокумент);  
		Лист1.Наименование	= "Заказ-наряды";
		Лист2 = Книга.Состав.Добавить();
		Лист2.Данные 		= ПоместитьВоВременноеХранилище(ВторойЛист.ТабличныйДокумент);
		Лист2.Наименование	= "Детализация Заказ-Нарядов";                        
		
		Если Не ТретийЛист = Неопределено Тогда
			
			Лист3 = Книга.Состав.Добавить();
			Лист3.Данные 		= ПоместитьВоВременноеХранилище(ТретийЛист.ТабличныйДокумент);
			Лист3.Наименование	= "ОстаткиТоваров";
			
		КонецЕсли;
		
		Книга.Записать(ИмяФайла, ?(ВРег(Прав(ИмяФайла, 4)) = "XLSX", ТипФайлаПакетаОтображаемыхДокументов.XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLS));
		XLSX = ВРег(Прав(ИмяФайла, 4)) = "XLSX";  
		ФорматФайла = ?(XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLSX, ТипФайлаПакетаОтображаемыхДокументов.XLS);
		Файл = Новый Файл(ИмяФайла);    
		
		ИмяФайла1 = Файл.Путь + Файл.ИмяБезРасширения + "_Заказ-наряды";
		ИмяФайла2 = Файл.Путь + Файл.ИмяБезРасширения + "_Детализация Заказ-Нарядов";      
		Если Не ТретийЛист = Неопределено Тогда            
			
			ИмяФайла3 = Файл.Путь + Файл.ИмяБезРасширения + "_Остатки";
			
		КонецЕсли;
		ПервыйЛист.ТабличныйДокумент.Записать(ИмяФайла1 + Файл.Расширение, ФорматФайла);
		ВторойЛист.ТабличныйДокумент.Записать(ИмяФайла2 + Файл.Расширение, ФорматФайла);     
		Если Не ТретийЛист = Неопределено Тогда                         
			
			ТретийЛист.ТабличныйДокумент.Записать(ИмяФайла3 + Файл.Расширение, ФорматФайла);  
			
		КонецЕсли;
		
		ВыгрузитьCSV(ИмяФайла1 + Файл.Расширение, Файл.Путь + "File1.txt",2); 
		ВыгрузитьCSV(ВторойЛист.ТЗ, Файл.Путь + "File2.txt",1);    
		Если Не ТретийЛист = Неопределено Тогда                  
			
			ВыгрузитьCSV(ТретийЛист.ТЗ, Файл.Путь + "File3.txt",1);   
			
		КонецЕсли;
		
		Попытка
			УдалитьФайлы(ИмяФайла1 + Файл.Расширение);
			УдалитьФайлы(ИмяФайла2 + Файл.Расширение);
			//УдалитьФайлы(ИмяФайла3 + Файл.Расширение); 
			Если Не СтруктураОтбора = Неопределено Тогда
			//	УдалитьФайлы(ИмяФайла);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
КонецФункции  

Функция ПолучитьТаблицуЗначенийИзТабДок(ТабДок)
	
	СоответсвиеКолонок = новый Соответствие;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	ЕстьОшибка = ложь;
	Для _У = 1 по 100 цикл
		
		Колонка 			= СокрЛП(Строка(ТабДок.Область(2,_У).Текст));
		
		Если ПустаяСтрока(Колонка) Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = СтрЗаменить(Колонка, " ", "");
		КолоНка = СтрЗаменить(Колонка, ".", "");
		КолоНка = СтрЗаменить(Колонка, "(", "");
		КолоНка = СтрЗаменить(Колонка, ")", "");
		КолоНка = СтрЗаменить(Колонка, ",", "");
		КолоНка = СтрЗаменить(Колонка, "-", "");
		ТаблицаДанных.Колонки.Добавить(КолоНка);
		 СоответсвиеКолонок.Вставить(Колонка,_У);
		
	КонецЦикла;     
	
	КолВоПропусков = 5;
	Для _У = 3 по 65535 цикл
		
		Если КолВоПропусков = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ПробноеЗначение = СокрЛП(Строка(ТабДок.Область(_У,1).Текст));
		
		Если ПустаяСтрока(ПробноеЗначение) ТОгда
			КолВоПропусков = КолВоПропусков - 1;
			Продолжить;
		КонецЕсли;
		
		НовСтр = ТаблицаДанных.Добавить();
		
		Для каждого ТекСтр из СоответсвиеКолонок Цикл
			
			Значение = СокрЛП(Строка(ТабДок.Область(_У,ТекСтр.Значение).Текст));
			НовСтр[ТекСтр.Ключ] = Значение;
				
		КонецЦикла;

	КонецЦикла;
	
	Возврат ТаблицаДанных
	
КонецФункции    

Функция ПолучитьСоответсвиеТиповРемонта()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение,
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение.Наименование КАК Наименование
		|ИЗ
		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
		|ГДЕ
		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетностьПоВизитам_ПредставлениеТипПозиции""";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Индексы.Добавить("Значение");

	Возврат РезультатЗапроса;

	
КонецФункции

Процедура ВыгрузитьCSV(Знач Таблица, ИмяФайлаCSV, КолВоСтрокПропуска) 
	
;            
	
	Если не ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(Таблица, СпособЧтенияЗначенийТабличногоДокумента.Значение);
		Таблица = ПолучитьТаблицуЗначенийИзТабДок(ТабДок);
		
	КонецЕсли;
	
	ТекстовыйФайл = Новый ТекстовыйДокумент; 
	Для инд = 1 по КолВоСтрокПропуска Цикл 
		
		ТекстовыйФайл.ДобавитьСтроку(";;");
		
	КонецЦикла;
	
	СоответсвиеТиповРемонта = ПолучитьСоответсвиеТиповРемонта();
	//Если Ложь Тогда
	//	
	//	СоответсвиеТиповРемонта = Новый ТаблицаЗначений;
	//	
	//КонецЕсли	
	Для каждого ТекСтр из Таблица Цикл
		
		Строка = "";
		
		ЗН = Неопределено;
		
		Для каждого ТекКолонка из Таблица.Колонки Цикл
			
			Значение 		= ТекСтр[ТекКолонка.Имя];  
			ЗначениеПоля 	= Строка(Значение);
			
			Если ТекКолонка.Имя = "Типремонта" Тогда
				
				НСтр = СоответсвиеТиповРемонта.Найти(Значение, "Наименование");
				
				Если НСтр = Неопределено Тогда
					
					ЗначениеПоля = "4";
					
				Иначе
					
					ЗначениеПоля = НСтр.Значение;
					
				КонецЕсли;
				
			КонецЕсли;   
			
			Если ТекКолонка.Имя = "Номер" Тогда //<<БАА
				ЗН = Документы.ЗаказНаряд.НайтиПоНомеру(ЗначениеПоля, ТекущаяДатаСеанса());
				
			КонецЕсли;	
			
			//Если ТипЗнч(Значение) = Тип("Булево") Тогда
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"БЛ=0; БИ=1"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ДЛФ=D"));
			//	
			//ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда         
			//	
			//	ЗначениеПоля  = Строка(Формат(Значение,"ЧГ=0"));
			//	
			//КонецЕсли;                    
			
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, Символы.ПС, "");
			ЗначениеПоля = СтрЗаменить(ЗначениеПоля, ";", ",");
			
			Строка = Строка + ?(ПустаяСтрока(Строка), "", ";") + ?(ПустаяСтрока(ЗначениеПоля), "Отсутствует", ЗначениеПоля);
			
		КонецЦикла; 
		
		Если КолВоСтрокПропуска = 2 и Ложь Тогда
			
			Строка = Строка + ";Отсутствует;Отсутствует;Отсутствует";
			
		КонецЕсли;
		
		//<<БАА
		Если ЗначениеЗаполнено(ЗН) Тогда
			Строка = Строка + ";" + ЗН.Мастер.ТабельныйНомер + ";" + ЗН.Мастер.ТабельныйНомер + ";" + ЗН.Мастер.ТабельныйНомер + ";" + "Заказ-наряд;" + ЕстьМойка(ЗН) + ";0"; ;;
		КонецЕсли;	                            
		
		ТекстовыйФайл.ДобавитьСтроку(Строка);
		
	КонецЦикла;  
	
	ТекстовыйФайл.Записать(ИмяФайлаCSV, "windows-1251");
	
КонецПроцедуры    

Функция ЕстьМойка(ЗН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНарядРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	ЗаказНарядРаботы.Ссылка = &Ссылка
		|	И ЗаказНарядРаботы.Работа.Наименование ПОДОБНО ""%Мойка%""";
	
	Запрос.УстановитьПараметр("Ссылка", ЗН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ?(РезультатЗапроса.Пустой(), "0", "1");
	
КонецФункции

Процедура ПроизвестиНастройкиОтчета(НастройкиВарианта, Отбор, СтруктураОтбора)
	
	ПериодИзОтчета = Новый СтандартныйПериод;
	ПериодИзОтчета.ДатаОкончания = КонецГода(ТекущаяДата());
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Период_",	ПериодИзОтчета);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",	СтруктураОтбора.КодДилера);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Марка3",		Строка(СтруктураОтбора.Марка));
	
	Для каждого ТекСтр из СтруктураОтбора Цикл
		
		Если ТекСтр.Ключ = "Марка" или
			ТекСтр.Ключ = "КодДилера" или
			ТекСтр.Ключ = "ПутьФайла" или
			ТекСтр.Ключ = "ПутьФайлаЗН" или
			ТекСтр.Ключ = "ПериодВыгрузки"или
			ТекСтр.Ключ = "Номенклатура" Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТекСтр.Ключ);
		
		Если ТекСтр.Ключ = "ВидРемонта" Тогда
			
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			
		ИначеЕсли ТекСтр.Ключ = "Модель" Тогда
			
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			
		Иначе                                                                        
			
			НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
		КонецЕсли;
		
		НовыйОтбор.ПравоеЗначение	= ТекСтр.Значение;
		НовыйОтбор.Использование	= Истина;   
		
	КонецЦикла; 
	
	Если СтруктураОтбора.Свойство("Ссылка") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПериодПоДатеЗакрытия = СтруктураОтбора.ПериодВыгрузки;
	
	НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДатаЗакрытия");
	НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	НовыйОтбор.ПравоеЗначение	= ПериодПоДатеЗакрытия.ДатаНачала;
	НовыйОтбор.Использование	= Истина;
	
	НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДатаЗакрытия");
	НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	НовыйОтбор.ПравоеЗначение	= ПериодПоДатеЗакрытия.ДатаОкончания;
	НовыйОтбор.Использование	= Истина; 	
	
	НовыйОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДатаСоздания");
	НовыйОтбор.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Заполнено;
	НовыйОтбор.Использование	= Истина;
	
КонецПроцедуры

Функция ПолучитьПервыйЛист(СтруктураОтбора)
	
	СКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");//.ВложенныеСхемыКомпоновкиДанных.Найти("Расшифровка").Схема;
	//ВариантЗН = СКД.ВариантыНастроек.СписокЗН;
	
	НастройкиВарианта 	= СКД.НастройкиПоУмолчанию;            
	ПериодИзОтчета 		= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение;   
	КодДилера			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[5].Значение;
	Марка				= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6].Значение;    
	
	Для Каждого ТекЭлемент из КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы Цикл
		
		Если Строка(ТекЭлемент.Параметр) = "КодДилера3" Тогда
			
			КодДилера 		= ТекЭлемент.Значение;	
			
		ИначеЕсли Строка(ТекЭлемент.Параметр) = "Марка3" Тогда      
			
			Марка			= ТекЭлемент.Значение;	
			
		ИначеЕсли Строка(ТекЭлемент.Параметр) = "Период_" Тогда      
			
			ПериодИзОтчета	= ТекЭлемент.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	ТекОтборы 			= КомпоновщикНастроек.Настройки.Отбор.Элементы;  
		
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Если СтруктураОтбора = Неопределено Тогда
	
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Период_",	ПериодИзОтчета);
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",	КодДилера);
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Марка3",		Марка);
		
	Иначе
		
		ПроизвестиНастройкиОтчета(НастройкиВарианта, Отбор, СтруктураОтбора)	
		
	КонецЕсли;        
	
	Для каждого ТекОтбор из ТекОтборы Цикл
		
		//Если 
		
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 	ЗаполнитьЗначенияСвойств(ЭлементОтбора, ТекОтбор);
		
	КонецЦикла;
	
	ТабДокОтчет = Новый ТабличныйДокумент;
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = МакетКомпоновки.Выполнить(СКД, НастройкиВарианта,);
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый 
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ТабличныйДокументРезультата);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновки);     
	
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	
	ВО = СКД.ВариантыНастроек.Найти("СписокЗН");
    КомпоновщикНастроекТЗ.ЗагрузитьНастройки(Во.Настройки);
    НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
    ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;  
		
	Отбор           = НастройкиКомпоновщика.Отбор;
	СтруктураОтчета = НастройкиКомпоновщика.Структура;
	Показатели      = НастройкиКомпоновщика.Выбор;  
	
	Если СтруктураОтбора = Неопределено Тогда
		
		
		ПараметрыНастройки.УстановитьЗначениеПараметра("Период_",		ПериодИзОтчета);
		ПараметрыНастройки.УстановитьЗначениеПараметра("КодДилера3",	КодДилера);
		ПараметрыНастройки.УстановитьЗначениеПараметра("Марка3",		Марка);
		
	Иначе
		
		ПроизвестиНастройкиОтчета(НастройкиКомпоновщика, Отбор, СтруктураОтбора)	
		
	КонецЕсли;   
	Для каждого ТекОтбор из ТекОтборы Цикл
		
		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	 	ЗаполнитьЗначенияСвойств(ЭлементОтбора, ТекОтбор);
		
	КонецЦикла;
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    Процессор = Новый ПроцессорКомпоновкиДанных;
    Процессор.Инициализировать(МакетКомпоновкиДанных);
    ТЗ = Новый ТаблицаЗначений;
    ТЗ.Очистить();
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(Процессор);                   
	
	ТабличныйДокументРезультата.УдалитьОбласть(ТабличныйДокументРезультата.Область(3,,3), ТипСмещенияТабличногоДокумента.ПоВертикали);
	ТабличныйДокументРезультата.Область(1,27,1,ТабличныйДокументРезультата.ШиринаТаблицы).Объединить();

	Возврат Новый Структура("ТабличныйДокумент, ТЗ", ТабличныйДокументРезультата, ТЗ);
	
КонецФункции

Функция ПолучитьВторойЛист(ТЗСсылок, СтруктураОтбора, Название = "Расшифровка")
	
	СКД = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").ВложенныеСхемыКомпоновкиДанных.Найти(Название).Схема;
	
	НастройкиВарианта = СКД.НастройкиПоУмолчанию;

	Если Название = "Расшифровка" Тогда
		
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка",		ТЗСсылок.ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;     
	
	Если Не Название = "Расшифровка" Тогда	   
		
		ПериодИзОтчета 		= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение;   
		КодДилера			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[5].Значение;
		Марка				= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6].Значение;
		СкладКомпанииВСписке = Неопределено;
		НаименованиеДилера 	= "";
		
		Для Каждого ТекЭлемент из КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы Цикл 
			
			Если Не ТекЭлемент.Использование Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Если Строка(ТекЭлемент.Параметр) = "КодДилера3" Тогда
				
				КодДилера 		= ТекЭлемент.Значение;	
				
			ИначеЕсли Строка(ТекЭлемент.Параметр) = "Марка3" Тогда      
				
				Марка			= ТекЭлемент.Значение;	
				
			ИначеЕсли Строка(ТекЭлемент.Параметр) = "Период_" Тогда      
				
				ПериодИзОтчета	= ТекЭлемент.Значение;	
				
			ИначеЕсли Строка(ТекЭлемент.Параметр) = "СкладКомпанииВСписке" Тогда      
				
				СкладКомпанииВСписке	= ТекЭлемент.Значение;	
				
			ИначеЕсли Строка(ТекЭлемент.Параметр) = "НаименованиеДилера" Тогда      
				
				НаименованиеДилера	= ТекЭлемент.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		ТекОтборы 			= КомпоновщикНастроек.Настройки.Отбор.Элементы; 
		
		Если СтруктураОтбора = Неопределено Тогда
		
			НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КонПериода",			ПериодИзОтчета.ДатаОкончания);
			НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",			КодДилера);                     
			НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеДилера",	НаименованиеДилера);
			НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен",				Справочники.ТипыЦен.НайтиПоКоду("00002"));
			
		Иначе
			
			ПроизвестиНастройкиОтчета(НастройкиВарианта, Отбор, СтруктураОтбора)	
			
		КонецЕсли;   
		
		Если не СкладКомпанииВСписке = Неопределено и ЗначениеЗаполнено(СкладКомпанииВСписке) Тогда
			
			ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			ЭлементОтбора.Использование	 	= Истина;
			ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("СкладКомпании");
			ЭлементОтбора.ПравоеЗначение	= СкладКомпанииВСписке;
			
		КонецЕсли;
		
		Для каждого ТекОтбор из ТекОтборы Цикл   
			
			Если ТекОтбор.Использование и ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
			
				ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			 	ЗаполнитьЗначенияСвойств(ЭлементОтбора, ТекОтбор);             
				
			КонецЕсли;
			
		КонецЦикла;  
	
	КонецЕсли;
	
	ТабДокОтчет = Новый ТабличныйДокумент;
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = МакетКомпоновки.Выполнить(СКД, НастройкиВарианта,);
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый 
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ТабличныйДокументРезультата);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновки);  
	
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
    КомпоновщикНастроекТЗ.ЗагрузитьНастройки(НастройкиВарианта);
    НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
	
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных; 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    Процессор = Новый ПроцессорКомпоновкиДанных;
    Процессор.Инициализировать(МакетКомпоновкиДанных);
    ТЗ = Новый ТаблицаЗначений;
    ТЗ.Очистить();
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(Процессор);
	
	Возврат Новый Структура("ТабличныйДокумент, ТЗ", ТабличныйДокументРезультата, ТЗ);	
	
КонецФункции