
Функция ПолучитьКодПризнакаСпособаРасчета(ТипСпособаРасчетаККТ, Товары, Оплаты) Экспорт
	
	ЭтоАванс = Товары.Итог("СуммаВсего") = 0 ИЛИ Товары.Найти(Справочники.Номенклатура.Предоплата, "Номенклатура") <> Неопределено;
	
	СуммаТовары = Товары.Итог("СуммаВсего");
	СуммаОплат = Оплаты.Итог("Сумма");
	
	СуммаОплатБезРассрочки = 0;
	Для Каждого СтрокаОплат ИЗ Оплаты Цикл
		Если СтрокаОплат.ТипОплаты.ТипОплатыККТ <> Перечисления.ТипыОплатыККТ.Постоплата Тогда
			СуммаОплатБезРассрочки = СуммаОплатБезРассрочки + СтрокаОплат.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипСпособаРасчетаККТ = Передача Тогда
		Если СуммаОплатБезРассрочки >= СуммаТовары Тогда
			Возврат 4;
		ИначеЕсли СуммаОплатБезРассрочки < СуммаТовары Тогда
			Возврат 5;
		ИначеЕсли СуммаОплатБезРассрочки = 0 Тогда
			Возврат 6;
		КонецЕсли;
	ИначеЕсли ТипСпособаРасчетаККТ = Предоплата Тогда
		Если ЭтоАванс Тогда
			Возврат 3;
		ИначеЕсли СуммаОплат < СуммаТовары Тогда
			Возврат 2;
		ИначеЕсли СуммаОплат >= СуммаТовары Тогда
			Возврат 1;
		КонецЕсли;
	ИначеЕсли ТипСпособаРасчетаККТ = Постоплата Тогда
		Возврат 7;
	Иначе
		Возврат 4;
	КонецЕсли;
КонецФункции


Функция ПолучитьНаименованиеСпособаРасчета(ПризнакСпособаРасчета) Экспорт
	
	ПрефиксНаименования = "";
	
	Если ПризнакСпособаРасчета = 1 Тогда
		ПрефиксНаименования = "ПРЕДОПЛАТА 100%" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 2 Тогда
		ПрефиксНаименования = "ПРЕДОПЛАТА" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 3 Тогда
		ПрефиксНаименования = "АВАНС" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 4 Тогда
		ПрефиксНаименования = "ПОЛНЫЙ РАСЧЕТ" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 5 Тогда
		ПрефиксНаименования = "ЧАСТИЧНЫЙ РАСЧЕТ И КРЕДИТ" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 6 Тогда
		ПрефиксНаименования = "ПЕРЕДАЧА В КРЕДИТ" + Символы.НПП;
	ИначеЕсли ПризнакСпособаРасчета = 7 Тогда
		ПрефиксНаименования = "ОПЛАТА КРЕДИТА" + Символы.НПП;
	КонецЕсли;
	
	Возврат ПрефиксНаименования;
	
КонецФункции