Функция ПолучитьСкладПоПодразделению(Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СкладПоУмолчаниюПоПодразделению.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	РегистрСведений.СкладПоУмолчаниюПоПодразделению КАК СкладПоУмолчаниюПоПодразделению
		|ГДЕ
		|	СкладПоУмолчаниюПоПодразделению.Подразделение В ИЕРАРХИИ(&Подразделение)";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СкладКомпании;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции