//Входящий вызов
Функция EventsPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
			
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json=")-4);
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
	
	Попытка
		СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		//Логирование
		ТТ_Mango.ЗаписатьвЖурнал(СтруктураДанных,"events/call");		
		ТТ_Mango.ДобавитьЗвонок(СтруктураДанных);
	Исключение
		Ошибка=ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Mango",УровеньЖурналаРегистрации.Информация,,,Ошибка);
		Возврат Ответ;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

//уведомление о записи разговора
Функция recordsPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураДанных	=Новый Структура;	
	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
	
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json=")-4);
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
		
	Попытка
		СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		ТТ_Mango.ДобавитьЗаписьРазговораВрегистр(СтруктураДанных);	
	Исключение
		Ошибка=ОписаниеОшибки();
		Возврат Ответ;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

//Перевод звонка
Функция transferPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураДанных	=Новый Структура;	
	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
	
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json=")-4);
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
		
	Попытка
		СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		//Логирование
		ТТ_Mango.ЗаписатьвЖурнал(СтруктураДанных,"transfer");		
		ТТ_Mango.ОповеститьОРезультатеПеревода(СтруктураДанных);	
	Исключение
		Ошибка=ОписаниеОшибки();
		Возврат Ответ;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

//Инициация звонка
Функция callbackPost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураДанных	=Новый Структура;	
	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
	
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json=")-4);
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
		
	Попытка
		СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		//ТТ_Mango.ОповеститьОРезультатеПеревода(СтруктураДанных);	
	Исключение
		Ошибка=ОписаниеОшибки();
		Возврат Ответ;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции

//Завершение звонка
Функция summarypost(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаЗапроса=Запрос.ПолучитьТелоКакСтроку();
	
	Раскодир=РаскодироватьСтроку(СтрокаЗапроса, СпособКодированияСтроки.КодировкаURL,КодировкаТекста.UTF8);
			
	СтрокаJSON=Прав(Раскодир, СтрДлина(Раскодир)-СтрНайти(Раскодир,"json=")-4);
	ЧтениеJson=Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаJSON);	
	
	Попытка
		СтруктураДанных=ПрочитатьJSON(ЧтениеJson);
		//Логирование
		ТТ_Mango.ЗаписатьвЖурнал(СтруктураДанных,"summary");		
		ТТ_Mango.ЗавершитьЗвонок(СтруктураДанных);	
	Исключение
		Ошибка=ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Mango",УровеньЖурналаРегистрации.Информация,,,Ошибка);
		Возврат Ответ;
	КонецПопытки;	
	
	Возврат Ответ;
	
КонецФункции






























