// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	//Заполним формы собственности
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	Организации.Ссылка КАК Организация
	             |ИЗ
	             |	Справочник.Организации КАК Организации
	             |ГДЕ
	             |	Организации.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ПустаяСсылка) ИЛИ
	             |	Организации.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ПустаяСсылка)
				 |";
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектОрганизация = Выборка.Организация.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(ОбъектОрганизация.ФормаСобственности) Тогда
			ОбъектОрганизация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо;
		КонецЕсли; 
		Если НЕ ЗначениеЗаполнено(ОбъектОрганизация.СистемаНалогообложения) Тогда
			ОбъектОрганизация.СистемаНалогообложения=Перечисления.СистемыНалогообложения.Общая;
		КонецЕсли; 
		ОбъектОрганизация.ОбменДанными.Загрузка=Истина;
		Попытка
			ОбъектОрганизация.Записать();
		Исключение
		КонецПопытки; 
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
