//Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПроверкуЗаполненияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Category.СписокВыбора.ЗагрузитьЗначения(ns_МотоциклыИМототехникаФормы.ПолучитьСписокКатегорий());
	УстановитьВидимостьРеквизитов();
КонецПроцедуры
 
//КонецОбласти

//Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура VehicleTypeПриИзменении(Элемент)
	СброситьРеквизитыЗаполнения();
	УстановитьВидимостьРеквизитов();
	УстановитьПроверкуЗаполненияНаСервере();
	ОбновитьРеквизиты();
КонецПроцедуры

//КонецОбласти

//Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьTitle(Команда)
	Объект.Title = СформироватьTitleНаСервере(Объект.ШаблонЗаголовка, Объект.Title, Объект.Номенклатура, Объект.Характеристика);
КонецПроцедуры

//КонецОбласти

//Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПроверкуЗаполненияНаСервере()
	ОбязательныеПоля = ns_МотоциклыИМототехникаВалидация.ПолучитьОбязательныеПоля();
	Для каждого ИмяПоля Из ОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
	
	ДополнительныеОбязательныеПоля = ns_МотоциклыИМототехникаВалидация.ПолучитьДополнительныеОбязательныеПоля(Объект.VehicleType);
	Для каждого ИмяПоля Из ДополнительныеОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизиты()
	Для каждого Реквизит Из Метаданные.Справочники.ns_ДляБизнеса.Реквизиты Цикл
		Если НЕ Элементы.Найти(Реквизит.Имя) = Неопределено Тогда
			Попытка
				Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Истина;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Истина;
				Иначе
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Ложь;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Ложь;
				КонецЕсли;
				Элементы[Реквизит.Имя].Видимость = Истина;	
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьTitleНаСервере(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика)
	Возврат ns_ШаблонизаторСервер.СформироватьTitle(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика);
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьРеквизитов()
	Если НЕ ЗначениеЗаполнено(Объект.VehicleType) Тогда
		Элементы.MotoType.Видимость = Ложь;
	Иначе
		Элементы.MotoType.Видимость = ns_МотоциклыИМототехникаВалидация.УстановитьВидимость_MotoType(Объект.VehicleType);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СброситьРеквизитыЗаполнения()
	Если ns_МотоциклыИМототехникаВалидация.УстановитьВидимость_MotoType(Объект.VehicleType) = Ложь Тогда
		Объект.MotoType = Неопределено;
	КонецЕсли;
КонецПроцедуры

//КонецОбласти 














