Функция ПолучитьСписокКатегорий() Экспорт
	Возврат ns_ЛичныеВещиПовтИсп.ПолучитьСписокКатегорий();
КонецФункции

Функция ПолучитьСписокПодкатегорий(Категория) Экспорт
	Возврат ns_ЛичныеВещиПовтИсп.ПолучитьСписокПодкатегорий(Категория);
КонецФункции

Функция ПолучитьСписокApparel(Подкатегория) Экспорт
	Возврат ns_ЛичныеВещиПовтИсп.ПолучитьСписокApparel(Подкатегория);
КонецФункции

Функция ПолучитьСписокApparelType(Apparel) Экспорт
	Возврат ns_ЛичныеВещиПовтИсп.ПолучитьСписокApparelType(Apparel);
КонецФункции

Функция ПолучитьСписокSize(GoodsType, Apparel) Экспорт
	Возврат ns_ЛичныеВещиПовтИсп.ПолучитьСписокSize(GoodsType, Apparel);
КонецФункции
