Перем ВсегоРЛ;
Перем КонтрактыРЛ;
Перем РЛСАвто;
Перем ЮрЛица;
Перем СозданоЗаказов; 
Перем СпАВто;

Перем СебестоимостьДопов Экспорт;
Перем СуммаДопов Экспорт;
Перем Допы Экспорт;
Перем Логин; 
Перем Пароль; 
Перем Настройка;

Функция ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			//ЗаголовокHTTP.Вставить("Authorization", "Basic QWxhZGRpbjpvcGVuIHNlc2FtZQ==");
			//ЗаголовокHTTP.Вставить("Authorization", "Bearer 5_Gfls45jGzmdU_thlfJSNeHgSVkRUPOTYR4xK1Ufo6i95BerU");
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		
		Результат = HTTPСоединение.Получить(HTTPЗапрос, ФайлРезультата);
				
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		РезультатТекст = Ответ.ПолучитьТекст();
		РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		
		
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
		УдалитьФайлы(ФайлОтправки);
		УдалитьФайлы(ФайлРезультата);
		
		Возврат РезультатТекст;
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2", суммаДоп = 0) Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.Записать(HTTPЗапрос); 
		
		
		КодСостояния = Результат.КодСостояния;
		
		Результат = Результат.ПолучитьТелоКакСтроку();
		Возврат Результат;
		
		Ошибка = Ложь;
				
		//Ответ = Новый ТекстовыйДокумент();
		//Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		//РезультатТекст = Ответ.ПолучитьТекст();
		//РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		//
		//Если ПоказыватьРезультатЗапроса Тогда
		//	Сообщить(РезультатТекст);
		//КонецЕсли;
		
		//УдалитьФайлы(ФайлОтправки);
		//УдалитьФайлы(ФайлРезультата);
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		
		Ошибка = Истина;
		
		Результат = ОписаниеОшибки();
		
		//ВызватьИсключение;
	КонецПопытки;  
	
	Если Статус = "DOP" и КодСостояния <> 200 Тогда
		
		Возврат ложь;
		
	КонецЕсли;	
	
	//Мен = РегистрыСведений.БТ_црмИзменениеСтатусаАвтомобиля.СоздатьМенеджерЗаписи();
	//Мен.Период = ТекущаяДатаСеанса();
	//Мен.Автомобиль = Автомобиль;
	//Мен.ТекстЗапроса = СтрокаДляОтправки;
	//Мен.ТекстОтвета = Результат; 
	//Мен.Статус = Статус;
	//Мен.Ошибка = Ошибка;
	//
	//Если ЗначениеЗаполнено(СуммаДоп) И КодСостояния = 200 Тогда
	//	Мен.СуммаДоп = СуммаДоп;
	//КонецЕсли;	
	//
	//Если Не БезЗаписи Тогда
	//	Мен.Записать();
	//КонецЕсли;	
	
КонецФункции 

Функция ПростаяЗаписьJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,Данные);			
	Возврат ЗаписьJSON.Закрыть();  
	
КонецФункции

Процедура ЗаполнитьАвто() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
	                      |			&ДатаОстатков,
	                      |			СкладКомпании.тт_КатегорияСклада = &КатегорияСклада
	                      |				И Автомобиль.БТ_МаркаАвто в( &Марка)) КАК ОстаткиАвтомобилейОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |		ПО ОстаткиАвтомобилейОстатки.Автомобиль = CRM_ВыгрузкаАвтомобилей.Автомобиль
	                      |ГДЕ
	                      |	ОстаткиАвтомобилейОстатки.КоличествоОстаток > 0
	                      |	И CRM_ВыгрузкаАвтомобилей.Автомобиль ЕСТЬ NULL"); 
	//Запрос.УстановитьПараметр("Код", црмОбщиеФункции.НастройкаСкладовДляВыгрузкиАвто());
	ЗАпрос.УстановитьПараметр("Марка", настройка.Марки.выгрузитьКолонку("Марка"));
	ЗАпрос.УстановитьПараметр("КатегорияСклада", Справочники.тт_КатегорияСклада.НайтиПоКоду("000000009"));
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл                  
		
		црмОбщиеФункции.ДобавитьАвтоВВыгрузку(Выборка.Автомобиль);		
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОтправитьАвто() Экспорт
	
	ДанныеДляПередачи = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Допы) и Статус <> "DEALER" Тогда
		СебестоимостьДопов = 0;
		СуммаДопов = 0;
		Допы = ПолучитьДопы(Автомобиль, СебестоимостьДопов, СуммаДопов);
	КонецЕсли;	
	
	ОтправитьДопы = Ложь;
	ДанныеДляПередачиBody = Новый Структура; 
	Если Статус <> "DOP" Тогда
		ДанныеДляПередачиBody.Вставить("statusCode", Статус);
		ДанныеДляПередачиBody.Вставить("statusDate", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
	КонецЕсли;	
	ДанныеДляПередачиBody.Вставить("code", Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("vin", Автомобиль.VIN); 
	Если Статус = "DEALER" Тогда
		ДанныеДляПередачиBody.Вставить("dateReceived", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
		ДанныеДляПередачиBody.Вставить("inStock", 1);
		
	ИначеЕсли Статус = "SOLD" или Статус = "DOP" Тогда
				
		Если Не ПустаяСтрока(Допы) Тогда
			ДанныеДляПередачиBody.Вставить("equipmentInputPrice", СебестоимостьДопов);
			ДанныеДляПередачиBody.Вставить("equipmentPrice", СуммаДопов);
			ДанныеДляПередачиBody.Вставить("equipmentText", Допы);
			
			ОтправитьДопы = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	//СтрокаОтправки = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/updateByVinFromRef/" + Автомобиль.VIN;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	ПараметрыПодключения.Логин = "A.Klient";
	ПараметрыПодключения.Пароль = "sxhmf4";
    
	ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения,,, ?(ОтправитьДопы, СуммаДопов, 0));
	
КонецПроцедуры

Процедура ОтправитьАвтомобилиCRM(Автомобиль = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Период КАК Период,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Автомобиль КАК Автомобиль,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ДатаВыгрузки КАК ДатаВыгрузки,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Принят КАК Принят,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ID КАК ID,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Марка1С КАК Марка1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Марка КАК Марка,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модель1С КАК Модель1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модель КАК Модель,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Комплектация1С КАК Комплектация1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Поколение КАК Поколение,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Серия КАК Серия,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Комплектация КАК Комплектация,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Модификация КАК Модификация,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Цвет1С КАК Цвет1С,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Цвет КАК Цвет,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.Отделка КАК Отделка,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ОтветCRM КАК ОтветCRM,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.НеВыгружать КАК НеВыгружать,
	                      |	CRM_ВыгрузкаАвтомобилейСрезПоследних.ТрейдИн КАК ТрейдИн
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей.СрезПоследних КАК CRM_ВыгрузкаАвтомобилейСрезПоследних
	                      |ГДЕ
	                      |	НЕ CRM_ВыгрузкаАвтомобилейСрезПоследних.Принят
	                      |				И НЕ CRM_ВыгрузкаАвтомобилейСрезПоследних.НеВыгружать
	                      |			И (CRM_ВыгрузкаАвтомобилейСрезПоследних.Автомобиль = &Автомобиль
	                      |				ИЛИ &Автомобиль = НЕОПРЕДЕЛЕНО)");
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОтправитьАвтоВCRM(Выборка, ОбновлятьСправочники);
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция Датапродажи(авто, ЦенаПродажи)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПродажиАвтомобилейОбороты.Период КАК Период,
		|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, , Регистратор, Автомобиль = &Авто) КАК ПродажиАвтомобилейОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Авто", Авто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		ЦенаПродажи = ВыборкаДетальныеЗаписи.СуммаОборот;
		
		Возврат ВыборкаДетальныеЗаписи.Период;
	КонецЦикла;
КонецФункции	

Процедура ОтправитьАвтоВCRM(Выборка, Обновление = Ложь)
	ДанныеДляПередачи = Новый Структура;
	
	//Если Не ЗначениеЗаполнено(Выборка.Комплектация) и не Выборка.ТрейдИн Тогда
	//	Возврат;
	//КонецЕсли;	
	
	_автомобиль = Выборка.Автомобиль;
	
	ДанныеДляПередачиBody = Новый Структура; 
	
	ДатаПоступления = ДатаПоступления(_Автомобиль);
	
	ценаПродажи = 0;
	Датапродажи = Датапродажи(_автомобиль, ЦенаПродажи);
	
	Если ЗначениеЗаполнено(ДатаОстатков) Тогда
		Датапродажи = Неопределено;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаПоступления) и не ЗначениеЗаполнено(Датапродажи) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляПередачиBody.Вставить("code", _Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("vin", _Автомобиль.VIN);

	
	Если ЗначениеЗаполнено(Датапродажи) и ЗначениеЗаполнено(Выборка.id) Тогда
		
		ДанныеДляПередачиBody.Вставить("statusCode", "SOLD");
		ДанныеДляПередачиBody.Вставить("statusDate", Формат(Датапродажи, "ДФ=dd.MM.yyyy"));  
		ДанныеДляПередачиBody.Вставить("sold", 1);
		ДанныеДляПередачиBody.Вставить("fixedPrice", ЦенаСтрокой(ЦенаПродажи));
	Иначе	
		
    	ДанныеДляПередачиBody.Вставить("statusCode", "DEALER");
		ДанныеДляПередачиBody.Вставить("statusDate", Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));
		ДанныеДляПередачиBody.Вставить("dateReceived", Формат(ДатаПоступления, "ДФ=dd.MM.yyyy"));
		
	    ДанныеДляПередачиBody.Вставить("inStock", 1);
		ДанныеДляПередачиBody.Вставить("brandId", Выборка.Марка.id);
		ДанныеДляПередачиBody.Вставить("productionYear", Год(_Автомобиль.ГодВыпуска));
		ДанныеДляПередачиBody.Вставить("modelYearCode", "01");
		ДанныеДляПередачиBody.Вставить("generationId", Выборка.Поколение.id);
		ДанныеДляПередачиBody.Вставить("fixedPrice", ЦенаСтрокой(ЦенаПродажи));
		
		ДанныеДляПередачиBody.Вставить("autosalonId", 5);
		ДанныеДляПередачиBody.Вставить("dealerCode", "");
		ДанныеДляПередачиBody.Вставить("modelId", Выборка.Модель.id);
		Если ЗначениеЗаполнено(Выборка.Серия) Тогда
			ДанныеДляПередачиBody.Вставить("serieId", Выборка.Серия.id);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Выборка.Модификация) Тогда
			ДанныеДляПередачиBody.Вставить("modificationId", Выборка.Модификация.id);
		КонецЕсли;	
		Если ЗначениеЗаполнено(Выборка.Комплектация) Тогда
			ДанныеДляПередачиBody.Вставить("equipmentId", Выборка.Комплектация.id);
		КонецЕсли;	
		Если ЗначениеЗаполнено(выборка.цвет) Тогда
			ДанныеДляПередачиBody.Вставить("bodyColor", СокрЛП(Выборка.Цвет));
		КонецЕсли;	
		//ДанныеДляПередачиBody.Вставить("isTradeIn", ?(ТрейдИн или выборка.ТрейдИн, 1, 0));
		ДанныеДляПередачиBody.Вставить("isTradeIn", 1);
		Цена = ЦенаАвто(_Автомобиль);   
		//Если Не ЗначениеЗаполнено(Цена) Тогда   
		//	 Цена = 2400000;
		//КонецЕсли;	
		//ЦенаРРЦ = ЦенаАвто(_Автомобиль, Справочники.ТипыЦен.РРЦ);
		ЦенаРРЦ = 0; 
		
		Пробег = Пробег(_Автомобиль); 
		
		Если ЗначениеЗаполнено(Пробег) тогда  
			ПробегСтрокой = СтрЗаменить(Пробег, Символы.НПП, ""); 
			ДанныеДляПередачиBody.Вставить("mileage", ПробегСтрокой);
		КонецЕсли;	
		
		ЦенаСтрокой = СтрЗаменить(Цена, Символы.НПП,"");	
		ЦенаСтрокой = СтрЗаменить(ЦенаСтрокой, ",",".");
		
		Если ЗначениеЗаполнено(Цена) Тогда
			ДанныеДляПередачиBody.Вставить("invoicePrice", ЦенаСтрокой(Цена));
			//ДанныеДляПередачиBody.Вставить("fixedPrice", 0);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ЦенаРРЦ) Тогда
			ДанныеДляПередачиBody.Вставить("invoicePrice", ЦенаСтрокой(ЦенаРРЦ));
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.Цвет) Тогда
			Цвет = Новый Структура("id, name", Выборка.Цвет.id, Выборка.Цвет.Наименование);
			ДанныеДляПередачиBody.Вставить("color", Выборка.Цвет.Наименование);
			ДанныеДляПередачиBody.Вставить("colorCode", Выборка.Цвет.Код);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Выборка.Отделка) Тогда
			Отделка = Новый Структура("id, name", Выборка.Отделка.id, Выборка.Отделка.Наименование);
			ДанныеДляПередачиBody.Вставить("trim", Отделка);
			ДанныеДляПередачиBody.Вставить("trimCode", Выборка.Отделка.КодОтделки);
		Иначе
			ДанныеДляПередачиBody.Вставить("trimCode", "TRY");
		КонецЕсли;	   
		
	КонецЕсли;		
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	//СтрокаОтправки = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
	
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;   
	
	
	//Если не ТрейдИн и не Выборка.ТрейдИн Тогда
		Если НЕ ЗначениеЗаполнено(Выборка.ID) Тогда
			ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/createFromRef";//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
		Иначе
			ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/updateByVinFromRef/" + _Автомобиль.VIN;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
		КонецЕсли;	
	//КонецЕсли;	
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	ПараметрыПодключения.Логин = Логин;
	ПараметрыПодключения.Пароль = Пароль;
		
	Если Не ЗначениеЗаполнено(Выборка.ID) Тогда
		Ответ = ВыполнитьHTTPЗапросPost(ПараметрыПодключения);
	Иначе
		Ответ = ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения);
	КонецЕсли;	
		
	Ответ = стрЗаменить(Ответ, "{""00","{""_00");
	Ответ = стрЗаменить(Ответ, ",""00",",""_00");
	
	Если Не ПустаяСтрока(Ответ) Тогда
		Наб = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
		Наб.Отбор.Автомобиль.Установить(Выборка.Автомобиль);
		попытка
			Наб.Прочитать();  
		исключение 
			возврат;
		КонецПопытки;	
		
		Если Наб.Количество() Тогда
			Запись = Наб[0];
			Запись.ОтветCRM = Ответ;
			Запись.ДатаВыгрузки = ТекущаяДатаСеанса();
			Запись.ЦенаПродажи = Цена;
			Запись.ТекстЗапроса = СтрокаОтправки;
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(Ответ);	
			
			Попытка
				
				Данные = ПрочитатьJSON(ЧтениеJson);
				
				СтруктураДанных = Данные.Result;
				
				Запись.Принят = (Данные.success = Истина);
				
				Если Запись.Принят Тогда
					Запись.id = СтруктураДанных.id;	
				КонецЕсли;	
			Исключение   
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;	
			
			наб.ОбменДанными.Загрузка = истина;
			Наб.Записать();
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры 

Процедура ОтправитьАвтоТрейдВCRM(Выборка, Обновление = Ложь)
	ДанныеДляПередачи = Новый Структура;
	
	//Если Не ЗначениеЗаполнено(Выборка.Комплектация) и не Выборка.ТрейдИн Тогда
	//	Возврат;
	//КонецЕсли;	
	
	_автомобиль = Выборка.Автомобиль;
	
	ДанныеДляПередачиBody = Новый Структура; 
	//ДанныеДляПередачиBody.Вставить("statusCode", "DEALER");
	ДатаПоступления = ДатаПоступления(_Автомобиль);
	
	Если Не ЗначениеЗаполнено(ДатаПоступления) Тогда
		Возврат;
	КонецЕсли;
	//ДанныеДляПередачиBody.Вставить("code", _Автомобиль.VIN);
	//ДанныеДляПередачиBody.Вставить("statusDate", Формат(ДатаПоступления, "ДФ=dd.MM.yyyy"));
	
	ДанныеДляПередачиBody.Вставить("vin", _Автомобиль.VIN);
	ДанныеДляПередачиBody.Вставить("refBrandId", Выборка.Марка.id);
	ДанныеДляПередачиBody.Вставить("refModelId", Выборка.Модель.id);
	//ДанныеДляПередачиBody.Вставить("productionYear", Год(_Автомобиль.ГодВыпуска));
	//ДанныеДляПередачиBody.Вставить("modelYearCode", "01");
	//ДанныеДляПередачиBody.Вставить("generationId", Выборка.Поколение.id);
	//ДанныеДляПередачиBody.Вставить("fixedPrice", 0);
	
	//ДанныеДляПередачиBody.Вставить("autosalonId", 7);
	//ДанныеДляПередачиBody.Вставить("dealerCode", "");
	
	//ДанныеДляПередачиBody.Вставить("serieId", Выборка.Серия.id);
	//ДанныеДляПередачиBody.Вставить("modificationId", Выборка.Модификация.id);
	//ДанныеДляПередачиBody.Вставить("equipmentId", Выборка.Комплектация.id);
	//ДанныеДляПередачиBody.Вставить("bodyColor", СокрЛП(Выборка.Цвет));
	//ДанныеДляПередачиBody.Вставить("isTradeIn", ?(ТрейдИн или выборка.ТрейдИн, 1, 0));
	
	//Цена = ЦенаАвто(_Автомобиль);   
	
	//ЦенаРРЦ = ЦенаАвто(_Автомобиль, Справочники.ТипыЦен.РРЦ);
	//ЦенаРРЦ = 0;
	//
	//ЦенаСтрокой = СтрЗаменить(Цена, Символы.НПП,"");	
	//ЦенаСтрокой = СтрЗаменить(ЦенаСтрокой, ",",".");
	//
	//Если ЗначениеЗаполнено(Цена) Тогда
	//	ДанныеДляПередачиBody.Вставить("basePrice", ЦенаСтрокой(Цена));
	//	ДанныеДляПередачиBody.Вставить("fixedPrice", ЦенаСтрокой);
	//КонецЕсли;	
	//
	//Если ЗначениеЗаполнено(ЦенаРРЦ) Тогда
	//	ДанныеДляПередачиBody.Вставить("invoicePrice", ЦенаСтрокой(ЦенаРРЦ));
	//КонецЕсли;	
	//
	//Если ЗначениеЗаполнено(Выборка.Цвет) Тогда
	//	Цвет = Новый Структура("id, name", Выборка.Цвет.id, Выборка.Цвет.Наименование);
	//	ДанныеДляПередачиBody.Вставить("color", Цвет);
	//	ДанныеДляПередачиBody.Вставить("colorCode", Выборка.Цвет.КодЦвета);
	//КонецЕсли;	
	//
	//Если ЗначениеЗаполнено(Выборка.Отделка) Тогда
	//	Отделка = Новый Структура("id, name", Выборка.Отделка.id, Выборка.Отделка.Наименование);
	//	ДанныеДляПередачиBody.Вставить("trim", Отделка);
	//	ДанныеДляПередачиBody.Вставить("trimCode", Выборка.Отделка.КодОтделки);
	//КонецЕсли;	
	
	ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
		
	ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	//СтрокаОтправки = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
	
	СтрокаОтправки = ПростаяЗаписьJSON(ДанныеДляПередачиBody);
	
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	//Если не ТрейдИн и не Выборка.ТрейдИн Тогда
		//Если НЕ Обновление Тогда
			ПараметрыПодключения.Ресурс            = "/yii/api/tradeInVehicle";//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
		//Иначе
		//	ПараметрыПодключения.Ресурс            = "/yii/api/warehouseVehicle/updateByVinFromRef/" + _Автомобиль.VIN;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
		//КонецЕсли;	
	//КонецЕсли;	
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли;
	
	ПараметрыПодключения.Логин = Логин;
	ПараметрыПодключения.Пароль = Пароль;
	
	Если Не Обновление Тогда
		Ответ = ВыполнитьHTTPЗапросPost(ПараметрыПодключения);
	Иначе
		Ответ = ВыполнитьHTTPЗапросЗаписать(ПараметрыПодключения);
	КонецЕсли;	
	
	Ответ = стрЗаменить(Ответ, "{""00","{""_00");
	Ответ = стрЗаменить(Ответ, ",""00",",""_00");
	
	Если Не ПустаяСтрока(Ответ) Тогда
		Наб = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
		Наб.Отбор.Автомобиль.Установить(Выборка.Автомобиль);
		Наб.Прочитать();
		
		Если Наб.Количество() Тогда
			Запись = Наб[0];
			Запись.ОтветCRM = Ответ;
			Запись.ДатаВыгрузки = ТекущаяДатаСеанса();
			//Запись.ЦенаПродажи = Цена;
			Запись.ТекстЗапроса = СтрокаОтправки;
			
			ЧтениеJson = Новый ЧтениеJSON;
			ЧтениеJson.УстановитьСтроку(Ответ);	
			
			Попытка
				
				Данные = ПрочитатьJSON(ЧтениеJson);
				
				СтруктураДанных = Данные.Result;
				
				Запись.Принят = (Данные.success = Истина);
				
				Если Запись.Принят Тогда
					Запись.id = СтруктураДанных.id;	
				КонецЕсли;	
			Исключение   
				Сообщить(ОписаниеОшибки());
			КонецПопытки;	
			
			Наб.Записать();
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ДатаПоступления(Автомобиль)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СкладыКомпании.Ссылка КАК Подразделение
	                      |ПОМЕСТИТЬ ВТ_Склады
	                      |ИЗ
	                      |	Справочник.СкладыКомпании КАК СкладыКомпании
	                      |ГДЕ
	                      |	СкладыКомпании.тт_КатегорияСклада = &Категория
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Период) КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиАвтомобилей.Обороты(
	                      |			,
	                      |			,
	                      |			Регистратор,
	                      |			Автомобиль = &АВтомобиль
	                      |				И СкладКомпании В
	                      |					(ВЫБРАТЬ
	                      |						ВТ_Склады.Подразделение КАК Подразделение
	                      |					ИЗ
	                      |						ВТ_Склады КАК ВТ_Склады)) КАК ОстаткиАвтомобилейОбороты
	                      |ГДЕ
	                      |	ОстаткиАвтомобилейОбороты.КоличествоОборот > 0");    
	Запрос.УстановитьПараметр("Код", црмОбщиеФункции.НастройкаСкладовДляВыгрузкиАвто());
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	ЗАпрос.УстановитьПараметр("Категория", Справочники.тт_КатегорияСклада.НайтиПоКоду("000000009"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат Выборка.Период;
		
	КонецЦикла;	
	
	
КонецФункции	

Функция ЦенаАвто(Авто, ТипЦен = Неопределено)
	
	//Если Не ЗначениеЗаполнено(ТипЦен) Тогда
	//	ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	//КонецЕсли;	
	//
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ЦеныАвтомобилейСрезПоследних.Цена КАК Цена
	//                      |ИЗ
	//                      |	РегистрСведений.ЦеныАвтомобилей.СрезПоследних(
	//                      |			,
	//                      |			ТипЦен = &ТипЦен
	//                      |				И Автомобиль = &Автомобиль
	//                      |				И (ВариантКомплектации = &ВариантКомплектации
	//                      |					ИЛИ &Все)) КАК ЦеныАвтомобилейСрезПоследних");	
	//Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	//Запрос.УстановитьПараметр("Автомобиль", Авто);
	//Запрос.УстановитьПараметр("ВариантКомплектации", Авто.ВариантКомплектации);
	//Запрос.УстановитьПараметр("Все", Истина);
	//
	//Выборка = ЗАпрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Цена = Выборка.Цена;
	//	
	//	Если ЗначениеЗаполнено(Цена) Тогда
	//		Возврат Цена;
	//	КонецЕсли;	
	//КонецЕсли;
	//
	//Запрос.УстановитьПараметр("Автомобиль", Авто.Модель);
	//Запрос.УстановитьПараметр("ВариантКомплектации", Авто.ВариантКомплектации);
	//Запрос.УстановитьПараметр("Все", Ложь);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Цена = Выборка.Цена;
	//	
	//	Если ЗначениеЗаполнено(Цена) Тогда
	//		Возврат Цена;
	//	КонецЕсли;	
	//	
	//КонецЕсли;    
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатков
		|			,
		|			Автомобиль = &Автомобиль
		|				И СкладКомпании.тт_КатегорияСклада = &Категория) КАК ОстаткиАвтомобилейОстатки";
	
	Запрос.УстановитьПараметр("Автомобиль", Авто);
	ЗАпрос.УстановитьПараметр("Категория", Справочники.тт_КатегорияСклада.НайтиПоКоду("000000009"));
	ЗАпрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецФункции

Функция Пробег(авто)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АвтомобилиСрезПоследних.Значение КАК Значение
	                      |ИЗ
	                      |	РегистрСведений.Автомобили.СрезПоследних(
	                      |			,
	                      |			Автомобиль = &Авто
	                      |				И ВидЗначения = &Видзначения) КАК АвтомобилиСрезПоследних");  
	Запрос.УстановитьПараметр("Авто", Авто);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;	                 

	Возврат 0;
	
КонецФункции

Функция ЦенаСтрокой(Цена)
	
	ЦенаСтрокой = СтрЗаменить(Цена, Символы.НПП,"");	
	Возврат СтрЗаменить(ЦенаСтрокой, ",",".");

КонецФункции

Функция ВыполнитьHTTPЗапросPost(ПараметрыПодключения,Объект = неопределено,Проект = "CRM_V2") Экспорт
	
	Если Проект = "CRM_V2" Тогда
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V2(ПараметрыПодключения);
	иначе
		црмРаботаСсоединением.ПолучитьНастройкиПодключенияЦРМ_V1(ПараметрыПодключения);
	КонецЕсли;

	СтрокаДляОтправки 					= ПараметрыПодключения.СтрокаДляОтправки;
	СтрХост   							= ПараметрыПодключения.Хост;
	СтрРесурс 							= ПараметрыПодключения.Ресурс;
	НастройкаЛогин  					= ПараметрыПодключения.Логин;
	НастройкаПароль 					= ПараметрыПодключения.Пароль;
	ssl1								= ПараметрыПодключения.ссл;
	ПоказыватьРезультатЗапроса	 	  	= ПараметрыПодключения.ПоказыватьРезультатЗапроса;
	ОбрабатыватьРезультатПодключения 	= ПараметрыПодключения.ОбрабатыватьРезультатПодключения;	
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение(СтрХост, , , , , ,SSL);
	
	Попытка
		ИмяФайлаОтправки = ПолучитьИмяВременногоФайла(".txt");
		
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки, КодировкаТекста.ANSI);
		ФайлОтправки.Закрыть();
		ФайлОтправки = Новый ЗаписьТекста(ИмяФайлаОтправки,,, Истина); 
		ФайлОтправки.Записать(СтрокаДляОтправки);
		ФайлОтправки.Закрыть();
		
		ФайлОтправкиДляРазмера = Новый Файл(имяФайлаОтправки);
		РазмерФайлаОтправки    = XMLСтрока(ФайлОтправкиДляРазмера.Размер());
		
		ФайлРезультата = ПолучитьИмяВременногоФайла(".txt");
		
		ЗаголовокHTTP = Новый Соответствие();
		
		//Если Проект = "CRM_V2" Тогда
			//ЗаголовокHTTP.Вставить("GET " + СтрХост + " HTTP/1.1");
			ЗаголовокHTTP.Вставить("Host", СтрХост);
			ЗаголовокHTTP.Вставить("Authorization", "Basic " + црмРаботаСсоединением.КодироватьСтрокуВBase64(НастройкаЛогин + ":" + НастройкаПароль));
			ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
			ЗаголовокHTTP.Вставить("X-AUTOCRM-API", "1");
			ЗаголовокHTTP.Вставить("Content-Type", "charset=utf-8");
		//Иначе
		//	ЗаголовокHTTP.Вставить("Host", СтрХост);
		//	ЗаголовокHTTP.Вставить("X-User", НастройкаЛогин);
		//	ЗаголовокHTTP.Вставить("X-API-Key", НастройкаПароль);
		//	ЗаголовокHTTP.Вставить("Accept", "application/json; charset=utf-8");
		//КонецЕсли;

		
		HTTPЗапрос = Новый HTTPЗапрос(СтрРесурс,ЗаголовокHTTP);
		//HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаОтправки);
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляОтправки);
		
		Результат = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос, ФайлРезультата);
		
				
		Ответ = Новый ТекстовыйДокумент();
		Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		РезультатТекст = Ответ.ПолучитьТекст();
		РезультатТекст = црмРаботаСсоединением.ПереобразоватьЮникод(РезультатТекст);
		
		Если ПоказыватьРезультатЗапроса Тогда
			Сообщить(РезультатТекст);
		КонецЕсли;
		
		УдалитьФайлы(ФайлОтправки);
		УдалитьФайлы(ФайлРезультата);
		
		Возврат РезультатТекст;
	Исключение
		
		Сообщить("_ Произошла сетевая ошибка!");
		Сообщить(ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции 

Функция ПолучитьДопы(Автомобиль, СебестоимостьДопов, СуммаДопов) Экспорт
	Допы = "";
	
	ВидыРемонта = црмРаботаСсоединением.ВидРемонтаДоукоплектация();
	
	Состояния = црмРаботаСсоединением.СостояниеЗНДоукоплектация();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
	                      |	ЗаказНарядТовары.СуммаВсего КАК СуммаВсего,
	                      |	ЗаказНарядТовары.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ ВТ_Товары
	                      |ИЗ
	                      |	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
	                      |ГДЕ
	                      |	ЗаказНарядТовары.Ссылка.Автомобиль = &Автомобиль
	                      |	И ЗаказНарядТовары.Ссылка.Состояние в (&Состояние)
						  |	И НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
	                      |	И ЗаказНарядТовары.Ссылка.ВидРемонта В(&ВидРемонта)
	                      |	И ЗаказНарядТовары.Ссылка.Дата >= &Дата
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПартииТоваровКомпанииОбороты.Номенклатура КАК Номенклатура,
	                      |	ПартииТоваровКомпанииОбороты.СуммаРасход КАК СуммаРасход
	                      |ПОМЕСТИТЬ ВТ_Себестоимость
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Обороты(, , Регистратор, ) КАК ПартииТоваровКомпанииОбороты
	                      |		ПО ВТ_Товары.Ссылка = ПартииТоваровКомпанииОбороты.Регистратор.ДокументОснование
	                      |			И ВТ_Товары.Номенклатура = ПартииТоваровКомпанииОбороты.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Товары.Номенклатура КАК Номенклатура,
	                      |	СУММА(ВТ_Товары.СуммаВсего) КАК Сумма,
	                      |	СУММА(ЕСТЬNULL(ВТ_Себестоимость.СуммаРасход, 0)) КАК Себестоимость
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Себестоимость КАК ВТ_Себестоимость
	                      |		ПО ВТ_Товары.Номенклатура = ВТ_Себестоимость.Номенклатура
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Товары.Номенклатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Товары.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	ВТ_Товары КАК ВТ_Товары
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_Товары.Ссылка");
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидыРемонта);
	Запрос.УстановитьПараметр("Состояние", Состояния);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Дата", ДатаСтатуса-10*86400);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗ = Пакет[2].Выгрузить();
	//СуммаДопов = Окр(ТЗ.Итог("Сумма"));
	СебестоимостьДопов = Окр(ТЗ.Итог("Себестоимость"));
	
	Для Каждого Строка Из ТЗ Цикл
		Допы = Допы + ?(ПустаяСтрока(Допы),"", Символы.ПС) + Строка.Номенклатура;
	КонецЦикла;	  
	
	СуммаДопов = 0;
	Выборка = Пакет[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		СуммаДопов = СуммаДопов + Выборка.ссылка.СуммаДокумента
	КонецЦикла;	
	
	Возврат Допы;
КонецФункции	

функция ПолучениеДанных(Запрос)
	//ДанныеДляПередачи = Новый Структура;
	//
	//ДанныеДляПередачиBody = Новый Структура; 
	//ДанныеДляПередачиBody.Вставить("statusCode", Статус);
	//ДанныеДляПередачиBody.Вставить("statusDate", ?(ЗначениеЗаполнено(ДатаСтатуса), Формат(ДатаСтатуса, "ДФ=dd.MM.yyyy"), ""));
	//
	//ДанныеДляПередачиBodyСтрокой = црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачиBody, Ложь, Ложь);
	//	
	//ДанныеДляПередачи.Вставить("body", ДанныеДляПередачиBodyСтрокой);
	
	СтрокаОтправки = "";//црмРаботаСсоединением.jsonЗаписатьИнициализация(ДанныеДляПередачи, Ложь, Ложь);
		
	ПараметрыПодключения = црмРаботаСсоединением.ПолучитьСтруктуруПараметров();
	
	ПараметрыПодключения.СтрокаДляОтправки = СтрокаОтправки;
	
	ПараметрыПодключения.Ресурс            = Запрос;//Справочники.CRM_НастройкаПодключения.CRM_Ресурс.Значение;
	
	//ДокЗаказНаряд = Документы.ЗаказНаряд.НайтиПоНомеру("ФКД0073109", ТекущаяДатаСеанса());
	//
	//црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения, ,ДокЗаказНаряд.ПодразделениеКомпании,ДокЗаказНаряд.ВидРемонта);
	//
	//
	//Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) и не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
	//	црмРаботаСсоединением.ПолучитьЛогинПароль(ПараметрыПодключения,ДокЗаказНаряд.Организация);
	//КонецЕсли; 
	
	ПараметрыПодключения.Логин = логин;
	ПараметрыПодключения.Пароль = пароль;
	
	Возврат ВыполнитьHTTPЗапросОтправить(ПараметрыПодключения);

Конецфункции

Процедура ПолучитьАвто() Экспорт
	
	ПолучениеДанных("/yii/api/warehouseVehicle");
	
КонецПроцедуры	

Функция ПолучитьРЛ() Экспорт
	
	ВсегоРЛ = 0;
	КонтрактыРЛ = 0;
	РЛСАвто = 0; 
	ЮрЛица = 0;  
	СозданоЗаказов = 0;     
	
	СпАВто = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ID_РЛ) Тогда
		ПолучитьРЛПоСтранице();
	Иначе
		
		Если КоличествоСтраниц = 0 Тогда
			КоличествоСтраниц = 2;
		КонецЕсли;
		
		Для сч = 1 По КоличествоСтраниц Цикл
			
			ПолучитьРЛПоСтранице(сч);
			
			Если СозданоЗаказов >= МаксКоличествоЗаказов и ЗначениеЗаполнено(МаксКоличествоЗаказов) Тогда
				Прервать;
			КонецЕсли;	  
			
		КонецЦикла;	
		
		Сообщить(СтрШаблон("Всего рл %1, с контрактом %2, с авто %3. ЮрЛиц %4. Создано заказов %5", ВсегоРЛ, КонтрактыРЛ, РЛСАвто, ЮрЛица, СозданоЗаказов));
		
	КонецЕсли;	
КонецФункции

Функция ПолучитьРЛПоСтранице(НомерСтраницы=0) 
	
	Если ЗначениеЗаполнено(ID_РЛ) Тогда
		
		СтрокаЗапроса = "/yii/api/retailCase/" + СтрЗаменить(ID_РЛ, Символы.нпп, "");
		
	Иначе
		
		СтрокаЗапроса = "/yii/api/retailCase?closedStageType=14"+?(НомерСтраницы = 1, "", "&RetailCaseSearch_page="+НомерСтраницы);
		
	КонецЕсли;	
	
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из СтруктураДанных Цикл
			
			ПолучитьОдинРЛ(Элемент);	
			
			Если СозданоЗаказов >= МаксКоличествоЗаказов и ЗначениеЗаполнено(МаксКоличествоЗаказов) Тогда
				Прервать;;
			КонецЕсли;	  
			
		КонецЦикла;	
		
	Иначе	
		
		ПолучитьОдинРЛ(СтруктураДанных);
		
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьОдинРЛ(СтруктураДанных)
	
	ВсегоРЛ = ВсегоРЛ + 1;
	
	Если СтруктураДанных.contracts.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	ДатаКонтракта = ЭтоКонтракт(СтруктураДанных.contract);
	
	Если ДатаКонтракта = Ложь Тогда
		
		Возврат;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДатаСтартаЗагрузкиЗаказов) И ДатаКонтракта < ДатаСтартаЗагрузкиЗаказов Тогда
			
			Возврат;
			
		КонецЕсли;	
		
		КонтрактыРЛ = КонтрактыРЛ + 1;
		
	КонецЕсли;	
	
	ДанныеКонтракта = СтруктураДанных.contract;
	
	_Сумма = ДанныеКонтракта.sum;
	
	Если Не ЗначениеЗаполнено(_Сумма) Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Сумма = Число(_Сумма);
	
	Если СтруктураДанных.generalClient.type <> "individual" Тогда
		
		ЮрЛица = ЮрЛица + 1;
		
	КонецЕсли;	
	
	МасАвто = СтруктураДанных.needs;
	
	Если МасАвто.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Вин = МасАвто[0].vin;
	
	Автомобиль = Справочники.Автомобили.НайтиПоРеквизиту("VIN", вин);
	
	Если Автомобиль.Пустая() Тогда
		
		Возврат;
		
	Иначе
		
		РЛСАвто = РЛСАвто + 1;
		
	КонецЕсли;	
	
	Если СпАвто.НайтиПоЗначению(Автомобиль) <> Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	СпАвто.Добавить(Автомобиль);
	
	ЗаказНаАвто = СоздатьЗаказНаАвтомобиль(СтруктураДанных, Автомобиль, Сумма, ДатаКонтракта, Число(СтруктураДанных.id)); 
	
КонецПроцедуры

Функция ЭтоКонтракт(СтруктураЗаказа)
	
	Если ТипЗнч(СтруктураЗаказа)<> Тип("Структура") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;	
	
	ДатаКонтракта = СтруктураЗаказа.created_at;      
	
	Если ПустаяСтрока(ДатаКонтракта) Тогда
		Возврат ЛожЬ;
	КонецЕсли;	
	
	Попытка
		Возврат ПредставлениеДаты(ДатаКонтракта);
	Исключение   
		ВОзврат Ложь;
	КонецПопытки;	
	
Конецфункции

Функция НайтиКонтрагента(ДанныеКлиента)
	
	ид = Число(ДанныеКлиента.id);	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_црмКонтрагенты.Контрагент КАК Контрагент
	                      |ИЗ
	                      |	РегистрСведений.БТ_црмКонтрагенты КАК БТ_црмКонтрагенты
	                      |ГДЕ
	                      |	БТ_црмКонтрагенты.id = &id");
	Запрос.УстановитьПараметр("id", ид);
	
	НайденныйКонтрагент = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Не ОбновлятьКонтрагентов Тогда
			Возврат Выборка.Контрагент;
		КонецЕсли;	                   
		
		НайденныйКонтрагент = Выборка.Контрагент;
		
	КонецЕсли;	                  
	
	Имя = ДанныеКлиента.firstName;
	Отчество = ДанныеКлиента.middleName;
	Фамилия = ДанныеКлиента.lastName;
	
	емейл = ДанныеКлиента.email;
	
	ПаспортКодПодразделения = ДанныеКлиента.passportDepartmentCode;
	ПаспортВыдан = ДанныеКлиента.passportIssuedAt;
	ПаспортКемВыдан = ДанныеКлиента.passportIssuedBy;
	ПаспортНомер = ДанныеКлиента.passportNumber;
	ПаспортСерия = ДанныеКлиента.passportSeries;  
	
	ПаспортДата = Неопределено;
	Если ЗначениеЗаполнено(ДанныеКлиента.passportIssuedAt) Тогда
		ПаспортДата = ПредставлениеДаты(ДанныеКлиента.passportIssuedAt);
	КонецЕсли;	
	
	СтруктураПаспорта = Новый Структура("Код, Кем, Когда, Серия, Номер", ПаспортКодПодразделения, ПаспортКемВыдан, ПаспортДата, ПаспортСерия, ПаспортНомер);
	
	Фио = СокрЛП(Фамилия) + " " + СокрЛП(Имя) + " " + СокрЛП(Отчество);
	
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(Фио);
	
	Если Не ЗначениеЗаполнено(НайденныйКонтрагент) Тогда
		
		Если Контрагент.Пустая() Тогда
			
			ОбКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			
		Иначе
			
			Возврат Контрагент;
				
		КонецЕсли;	
		
	Иначе
		
		ОбКонтрагент = НайденныйКонтрагент.ПолучитьОбъект();
		
	КонецЕсли;
	
	ОбКонтрагент.Фамилия = Фамилия;
	ОбКонтрагент.Имя = Имя;
	ОбКонтрагент.Отчество = Отчество;
	ОбКонтрагент.Наименование = фио;
	обКонтрагент.НаименованиеПолное = фио;
	ОбКонтрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
	ОбКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;
	
	Если Не ПустаяСтрока(ДанныеКлиента.gender) Тогда
		
		ОбКонтрагент.пол = ?(ДанныеКлиента.gender = "M", Перечисления.ПолФизическихЛиц.Мужской, Перечисления.ПолФизическихЛиц.Женский);
		
	КонецЕсли;	
	
	Телефоны = ДанныеКлиента.phones;
	
	Телефон = "";
	Если Телефоны.Количество() > 0 Тогда
		
		Телефон = ПредставлениеТелефона(Телефоны[0].number);
		
		ОбКонтрагент.ОсновнойТелефон = Телефон;
		
	КонецЕсли;	
	
	ДатаСОПД = ДанныеКлиента.consent_processing_personal_information_date;
	
	Если ЗначениеЗаполнено(ДатаСОПД) Тогда
	
		ДатаСОПД = ПредставлениеДаты(ДатаСОПД);
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаСОПД) Тогда
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанныхДата = ДатаСопд;
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да;
	Иначе
		ОбКонтрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
	КонецЕсли;	
	
	Если не БезЗаписи Тогда
		обКонтрагент.Записать(); 
	КонецЕсли;	
	
	ДобавитьИДКонтрагента(ОбКонтрагент.Ссылка, ид);
	
	Если Не ПустаяСтрока(Телефон) Тогда
		ДобавитьТелефон(ОбКонтрагент.Ссылка, Телефоны[0].number)
	КонецЕсли;	
	
	Если Не ПустаяСтрока(емейл) Тогда
		ДобавитьЕмейл(ОбКонтрагент.Ссылка, емейл)
	КонецЕсли;	
	
	ДобавитьПаспорт(ОбКонтрагент.ссылка, СтруктураПаспорта);
	ДобавитьАдрес(ОбКонтрагент.ссылка, ДанныеКлиента.address);
	
КонецФункции  

Процедура ДобавитьИДКонтрагента(Ссылка, ид)
	
	Наб = РегистрыСведений.БТ_црмКонтрагенты.СоздатьНаборЗаписей();
	Наб.Отбор.id.Установить(ид);
	Наб.Прочитать();
	
	Если Наб.Количество() = 0 Тогда
		
		Запись = Наб.Добавить();
		Запись.id = ид;
		Запись.Контрагент = Ссылка;
		
		Если Не БезЗаписи Тогда
			Наб.Записать();
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьИДЗаказа(Ссылка = Неопределено, ид, Контрагент, Автомобиль, Ошибка = "")
	
	Наб = РегистрыСведений.БТ_црмЗаказыНаАвтомобили.СоздатьНаборЗаписей();
	Наб.Отбор.id.Установить(ид);
	Наб.Прочитать();
	
	Если Наб.Количество() = 0 Тогда
		
		Запись = Наб.Добавить();
		Запись.id = ид;
		Запись.ЗаказНаАвтомобиль = Ссылка;
		Запись.Ошибки = Ошибка;
		Запись.Контрагент = Контрагент;
		Запись.Автомобиль = Автомобиль;
		Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
		
		Если Не БезЗаписи Тогда
			Наб.Записать();
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПредставлениеДаты(ДатаКонтракта)
	
	Возврат Дата(Сред(ДатаКонтракта, 9, 2)+"."+Сред(ДатаКонтракта, 6, 2)+"."+Лев(ДатаКонтракта, 4) + ?(СтрДлина(ДатаКонтракта) > 10, " "+Сред(ДатаКонтракта, 12), " 00:00:00"))
	
КонецФункции

Функция СоздатьЗаказНаАвтомобиль(СтруктураДанных, Автомобиль, Сумма, ДатаКонтракта, ид) 
	
	Автор = НайтиАвтора(СтруктураДанных);
	
	ФамилияАвтора = СтруктураДанных.author.lastname;
	ИмяАвтора = СтруктураДанных.author.firstname;
		
	//Сообщить(ФамилияАвтора + " " + ИмяАвтора);
	//Сообщить(Автомобиль);
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Возврат Неопределено;
	КонецЕсли;		
	
	Если Не црмРаботаСсоединением.ПодразделениеЦРМ(Автор.Подразделение) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Если БезЗаписи Тогда
		
		СозданоЗаказов = СозданоЗаказов + 1;
		
		Сообщить(Автомобиль);
		Возврат Неопределено;
	КонецЕсли;	
	
	Контрагент = НайтиКонтрагента(СтруктураДанных.PrimaryPerson);
		
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
			
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_црмЗаказыНаАвтомобили.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ИЗ
	                      |	РегистрСведений.БТ_црмЗаказыНаАвтомобили КАК БТ_црмЗаказыНаАвтомобили
	                      |ГДЕ
	                      |	БТ_црмЗаказыНаАвтомобили.id = &id");
	Запрос.УстановитьПараметр("id", ид);
	
	НайденныйЗаказ = Неопределено;

	ВЗаказеПрописанИДРЛ = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Не ОбновлятьЗаказНаАвтомобиль Тогда
			Возврат Выборка.ЗаказНаАвтомобиль;
		КонецЕсли;	                   
		
		НайденныйЗаказ = Выборка.ЗаказНаАвтомобиль;
		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НайденныйЗаказ) Тогда
		
		Если ОбновлятьЗаказНаАвтомобиль Тогда
		
			ОбЗаказ = НайденныйЗаказ.ПолучитьОбъект();
			
		Иначе
			
			Возврат НайденныйЗаказ;
			
		КонецЕсли;	
		
	Иначе
		
		СуществующийЗаказ = УжеЕстьЗаказ(Автомобиль, Контрагент, ид, ВЗаказеПрописанИДРЛ);
		
		Если ЗначениеЗаполнено(СуществующийЗаказ)  Тогда
			
			Если Не ВЗаказеПрописанИДРЛ Тогда
			
				Ошибка = "В базе уже есть заказ клиента на этот авто " + СуществующийЗаказ; 
				
				ДобавитьИДЗаказа(, ид, Контрагент, Автомобиль, Ошибка);
				
				Возврат Неопределено;
			Иначе	
				
				//прописать условие, когда заказ в 1С уже не трогаем
				//Если ЗначениеЗаполнено(ОбЗаказ.автомобиль) Тогда
				//	Ошибка = "В базе уже есть заказ клиента на этот авто " + СуществующийЗаказ; 
				//
				//	ДобавитьИДЗаказа(, ид, Контрагент, Автомобиль, Ошибка);
				//	
				//	Возврат Неопределено;	
				//КонецЕсли;
				
				ОбЗаказ = СуществующийЗаказ.ПолучитьОбъект();
				
			КонецЕсли;	
		Иначе
			
			ОбЗаказ = Документы.ЗаказНаАвтомобиль.НайтиПоНомеру("ДФК0002474", '20230101').Скопировать();
		    СозданоЗаказов = СозданоЗаказов + 1;
			
		КонецЕсли;	
		
		
	КонецЕсли;	
	
	
	
	ОбЗаказ.Дата = ДатаКонтракта;  
	ОбЗаказ.Менеджер = автор;
	ОбЗаказ.ПодразделениеКомпании = Автор.Подразделение;
	
	ОбЗаказ.Контрагент = Контрагент;
	ОбЗаказ.Заказчик = Контрагент;
	Обзаказ.Автомобиль = Автомобиль;
	ОбЗаказ.Автор = Автор;
	ОбЗаказ.Модель = автомобиль.Модель;
	ОбЗаказ.Цвет = автомобиль.Цвет;
	ОбЗаказ.ЦветКод = Автомобиль.ЦветКод;
	обЗаказ.СрокПоставки = Неопределено;
	ОбЗаказ.СуммаВсегоНаАвтомобиль = Сумма; 
	ОбЗаказ.ЦенаАвтомобиля = Сумма; 
	обЗаказ.СуммаСкидкиНаАвтомобиль = 0;
	ОбЗаказ.СуммаДокумента = Сумма;
	ОбЗаказ.bz_ПрогнозКМ = 0;
	ОбЗаказ.ОбработкаРеквизита("СтавкаНДСНаАвтомобиль");
	
	Если не ЗначениеЗаполнено(НайденныйЗаказ) Тогда
		ОбЗаказ.ДоговорВзаиморасчетов = НайтиДоговор(Контрагент, ДатаКонтракта);		
	КонецЕсли;	
	
	Если Не БезЗаписи Тогда
		ОбЗаказ.Записать(РежимЗаписиДокумента.Запись);
		
		Ошибка = "";
		Попытка
			ОбЗаказ.Записать(РежимЗаписиДокумента.Проведение)
		Исключение
		КонецПопытки;	
		
		ДобавитьИДЗаказа(обЗаказ.Ссылка, ид, Контрагент, Автомобиль, Ошибка);
	КонецЕсли;	
КонецФункции   

Функция НайтиАвтора(СтруктураДанных)
	ФамилияАвтора = СтруктураДанных.assignee.lastname;
	ИмяАвтора = СтруктураДанных.assignee.firstname;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Пользователи.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Пользователи КАК Пользователи
	                      |ГДЕ
	                      |	Пользователи.Наименование ПОДОБНО &Наименование
	                      |	И НЕ Пользователи.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование", ФамилияАвтора+"%"+ИмяАвтора+"%");
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции	

Функция НайтиДоговор(Контрагент, ДатаКонтракта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	                      |ГДЕ
	                      |	НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	                      |	И ДоговорыВзаиморасчетов.Владелец = &Владелец
	                      |	И ДоговорыВзаиморасчетов.ДляАвтосалона
	                      |	И ДоговорыВзаиморасчетов.ДатаНачала = &ДатаНачала");
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаКонтракта));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
	ОбДоговор = Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ229807").Скопировать();
	ОбДоговор.Владелец = Контрагент;
	ОбДоговор.Наименование = "Продажа т\с в Руб от " + Формат(ДатаКонтракта, "ДФ=dd.MM.yy");
	ОбДоговор.Автор = ПараметрыСеанса.Пользователь;
	ОбДоговор.ДатаНачала = НачалоДня(ДатаКонтракта);
	обДоговор.ДляАвтосалона = Истина;
	ОбДоговор.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000001");
	обДоговор.УстановитьНовыйКод(ОбДоговор.тт_ВидДоговора.Префикс);
	
	Если Не БезЗаписи Тогда
		обДоговор.Записать();
	КонецЕсли;	
	
	Возврат обДоговор.Ссылка;
	
КонецФункции	

Функция УжеЕстьЗаказ(Автомобиль, Контрагент, ид, ВЗаказеПрописанИДРЛ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаАвтомобиль.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ГДЕ
	                      |	ЗаказНаАвтомобиль.БТ_idРЛCRM = &ид
	                      |	И НЕ ЗаказНаАвтомобиль.ПометкаУдаления");
	Запрос.УстановитьПараметр("ид", ид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВЗаказеПрописанИДРЛ = Истина;
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	

	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗаказНаАвтомобиль.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	                      |ГДЕ
	                      //|	ЗаказНаАвтомобиль.Проведен
	                      |	ЗаказНаАвтомобиль.Контрагент = &Контрагент
	                      |	И ЗаказНаАвтомобиль.Автомобиль = &Автомобиль");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
КонецФункции	

Функция ПредставлениеТелефона(телефон, КодГорода="", Префикс="", Номер="")
	
	Если СтрДлина(Телефон) <> 11 тогда
		
		Возврат Телефон;
		
	КонецЕсли;	        
	
	КодГорода = Лев(Телефон, 1);
	Префикс = Сред(Телефон, 2, 3);
	Номер = Сред(Телефон, 5);
	
	Возврат СтрШаблон("+%1 (%2) %3", КодГорода, Префикс, Номер);
	
конецФункции	

Процедура ДобавитьТелефон(Ссылка, Телефон)
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.НайтиПоКоду("ЦБ000009");
	
	КодГорода = ""; Префикс = ""; Номер = "";
	Представление = ПредставлениеТелефона(Телефон, КодГорода, Префикс, Номер);

	Если Не ПустаяСтрока(КодГорода) Тогда
		
		Мен.Поле1 = КодГорода;
		Мен.Поле2 = Префикс;
		Мен.Поле3 = Номер;
		
	КонецЕсли;	
	
	Мен.Представление = Представление;
	
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьЕмейл(Ссылка, емейл)
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
	
	Мен.Представление = емейл;
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры	
		
Процедура ДобавитьПаспорт(Ссылка, СтруктураПаспорта)
	
	//Новый Структура("Код, Кем, Когда, Серия, Номер"
	
	Если ПустаяСтрока(СтруктураПаспорта.Номер) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодтверждающиеДокументы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	                      |ГДЕ
	                      |	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
	                      |	И ПодтверждающиеДокументы.Владелец = &Владелец
	                      |	И ПодтверждающиеДокументы.Номер = &Номер");	
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	Запрос.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
	Запрос.УстановитьПараметр("Номер", СтруктураПаспорта.Номер);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	НовыйДок = Справочники.ПодтверждающиеДокументы.СоздатьЭлемент();
	НовыйДок.Владелец = ссылка;
	НовыйДок.ВидПодтверждающегоДокумента = Перечисления.ВидыДокументов.Паспорт;
	
	НовыйДок.Номер = СтруктураПаспорта.Номер;
	НовыйДок.Серия = СтруктураПаспорта.Серия;
	НовыйДок.ДатаВыдачи = СтруктураПаспорта.Когда;
	НовыйДок.КемВыдан = СтруктураПаспорта.Кем;
	НовыйДОк.Наименование = НовыйДок.СформироватьНаименование();
	НовыйДок.Текущий = Истина;
	
	Если Не БезЗаписи Тогда
		НовыйДок.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьАдрес(Ссылка, Адреса)
	Если ПустаяСтрока(Адреса.city) и ПустаяСтрока(Адреса.region)	Тогда
		Возврат;
	КонецЕсли;	
	
	Мен = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Мен.Объект = Ссылка;
	Мен.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Мен.Вид = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	Мен.Поле2 = Адреса.region;
	Мен.Поле4 = Адреса.city;
	Мен.Поле1 = Адреса.zipCode;
	Мен.Поле7 = АДреса.house;
	Мен.Поле6 = Адреса.street;
	
	Мен.Представление = киПолучитьПредставлениеАдреса(Мен);
	
	Если Не БезЗаписи Тогда
		Мен.Записать(Истина); 
		
		Мен2 = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Мен, Мен2);
		Мен2.Вид = Справочники.ВидыКонтактнойИнформации.АдресЮридический;
		
		Мен2.Записать();
	КонецЕсли;	

КонецПроцедуры	

Процедура ПолучитьМодели() Экспорт
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМоделиПоСтранице(сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьМоделиПоСтранице(НомерСтраницы, ИмяМетода = "")
	
	Если ИмяМетода = "" Тогда
		ИмяМетода = "refModel";
	КонецЕсли;	
	
	//СтрокаЗапроса = "/yii/api/refModel?"+?(ЗначениеЗаполнено(ЗагружатьТолькоМарку),"brand_id="+СтрЗаменить(ЗагружатьТолькоМарку.ID, Символы.НПП, "")+"&is_deleted=0","&is_deleted=0")+?(НомерСтраницы = 1, "", "&refModelSearch_page="+НомерСтраницы);
	СтрокаЗапроса = "/yii/api/"+ИмяМетода+"?"+?(ЗначениеЗаполнено(ЗагружатьТолькоМарку),"brand_id="+СтрЗаменить(ЗагружатьТолькоМарку.ID, Символы.НПП, "")+"&is_deleted=0","&is_deleted=0")+?(НомерСтраницы = 1, "", "&RefModelSearch_page="+НомерСтраницы);
	//reference/model?brand_id=2643
	
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		Данные = ПрочитатьJSON(ЧтениеJson);
		
		СтруктураДанных = Данные.Result;
		
		
		
		Если Данные.meta.pagination.page_count < НомерСтраницы Тогда
			
			Если НомерСтраницы = 1 и ИмяМетода = "refModel" Тогда
					
				ПолучитьМоделиПоСтранице(НомерСтраницы, "reference/model");	
			Иначе     
				Возврат Ложь;
			КонецЕсли;	
			
		КонецЕсли;	
		
		Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				
				Если НомерСтраницы = 1 и ИмяМетода = "refModel" Тогда
					
					ПолучитьМоделиПоСтранице(НомерСтраницы, "reference/model");	
				Иначе	
					Возврат Ложь;
				КонецЕсли;	
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМодель(Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМодель(Данные) 
	
	Элемент = Справочники.CRM_МоделиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МоделиАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Марка = Справочники.CRM_МаркиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.brand_id));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьМарки() Экспорт
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМаркиПоСтранице(сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
	Сообщить("Страниц марок " + сч);
КонецПроцедуры                     

Функция ПолучитьМаркиПоСтранице(НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/reference/refBrand?is_deleted=0"+?(НомерСтраницы = 1, "", "&refBrandSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		Данные = ПрочитатьJSON(ЧтениеJson);
		
		СтруктураДанных = Данные.Result;
		
		Если Данные.meta.pagination.page_count < НомерСтраницы Тогда
			Возврат Ложь;
		КонецЕсли;	
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМарку(Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМарку(Данные) 
	
	Элемент = Справочники.CRM_МаркиАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МаркиАвтомобилей.СоздатьЭлемент(); 
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id;
	Объект.Записать();
	
КонецПроцедуры 

Процедура ПолучитьПоколения() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьПоколенияПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_МоделиАвтомобилей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CRM_МоделиАвтомобилей КАК CRM_МоделиАвтомобилей
		|ГДЕ
		|	(CRM_МоделиАвтомобилей.Марка = &Марка
		|			ИЛИ &ВсеМарки)";
	
	Запрос.УстановитьПараметр("ВсеМарки", ЗагружатьТолькоМарку.Пустая());
	Запрос.УстановитьПараметр("Марка", ЗагружатьТолькоМарку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПолучитьПоколенияПоМодели(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьПоколенияПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьПоколенияПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьПоколенияПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refGeneration?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefGenerationSearch_page="+НомерСтраницы);
	//СтрокаЗапроса = "/yii/api/reference/generation?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&GenerationSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьПоколение(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьПоколение(Модель, Данные) 
	
	Элемент = Справочники.CRM_ПоколенияАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_generation));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ПоколенияАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_generation; 
	Объект.Модель = Модель; 
	Объект.Год_с = Данные.year_begin;
	Объект.Год_по = Данные.year_end;
	
	Объект.Записать();
	
КонецПроцедуры  

Процедура ПолучитьСерии() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьСерииПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьСерииПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьСерииПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьСерииПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьСерииПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refSeries?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefSeriesSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьСерию(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьСерию(Модель, Данные) 
	
	Элемент = Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_serie));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_СерииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_serie; 
	Объект.Модель = Модель;        
	Объект.Поколение = Справочники.CRM_ПоколенияАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id_car_generation));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьКомплектации() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьКомплектацииПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьКомплектацииПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьКомплектацииПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьКомплектацииПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьКомплектацииПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refEquipment?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefEquipmentSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьКомплектацию(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьКомплектацию(Модель, Данные) 
	
	Элемент = Справочники.CRM_КомплектацииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_КомплектацииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель;        
	Объект.Серия = Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.series_id));
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьМодификации() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СерииАвтомобилей.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.CRM_СерииАвтомобилей КАК CRM_СерииАвтомобилей
	                      |ГДЕ
	                      |	(CRM_СерииАвтомобилей.Модель = &Модель
	                      |			ИЛИ &Все)");
	Запрос.УстановитьПараметр("Модель", ЗагружатьТолькоМодель);	
	Запрос.УстановитьПараметр("Все", ЗагружатьТолькоМодель.Пустая());	
	выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		ПолучитьМодификацииПоСерии(ВЫборка.Ссылка);
	КонецЦикла;	
		
	
КонецПроцедуры

Процедура ПолучитьМодификацииПоСерии(Серия)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьМодификацииПоСтранице(Серия, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьМодификацииПоСтранице(Серия, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refModification?id_car_serie="+СтрЗаменить(Серия.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefModificationSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьМодификацию(Серия, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьМодификацию(Серия, Данные) 
	
	Элемент = Справочники.CRM_МодификацииАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id_car_modification));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_МодификацииАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id_car_modification; 
	Объект.Модель = Серия.Модель;        
	Объект.Серия = Серия;//Справочники.CRM_СерииАвтомобилей.НайтиПоРеквизиту("ID", Число(Данные.id_car_serie));
	Объект.Поколение = Серия.Поколение;
	
	Объект.Записать();
	
КонецПроцедуры

Процедура ПолучитьОтделки() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьОтделкиПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьОтделкиПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьОтделкиПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьОтделкиПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьОтделкиПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refSkin?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefSkinSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьОтделку(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьОтделку(Модель, Данные) 
	
	Элемент = Справочники.CRM_ОтделкиСалона.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ОтделкиСалона.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель; 
	Объект.КодОтделки = Данные.code;
	
	Объект.Записать();
	
КонецПроцедуры  

Процедура ПолучитьЦвета() Экспорт
	
	Если ЗначениеЗаполнено(ЗагружатьТолькоМодель) Тогда
		
		ПолучитьЦветаПоМодели(ЗагружатьТолькоМодель);
		
	Иначе
		
		Выборка = Справочники.CRM_МоделиАвтомобилей.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ПометкаУдаления Тогда
				ПолучитьЦветаПоМодели(ВЫборка.Ссылка);
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	                                        
КонецПроцедуры

Процедура ПолучитьЦветаПоМодели(Модель)
	
	сч = 1;
	Пока Истина Цикл
		
		Если Не ПолучитьЦветаПоСтранице(Модель, сч) Тогда
			
			Прервать;
			
		КонецЕсли;	
		
		сч = сч + 1;
	КонецЦикла;	
	
КонецПроцедуры                     

Функция ПолучитьЦветаПоСтранице(Модель, НомерСтраницы)
	
	СтрокаЗапроса = "/yii/api/refColor?model_id="+СтрЗаменить(Модель.id, Символы.НПП, "")+?(НомерСтраницы = 1, "", "&RefColorSearch_page="+НомерСтраницы);
		
	Данные = ПолучениеДанных(СтрокаЗапроса);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(Данные);	
	
	Попытка
		
		СтруктураДанных = ПрочитатьJSON(ЧтениеJson).Result;
	
	    Если ТипЗнч(СтруктураДанных) = Тип("Массив") Тогда
			
			ЕстьЭлементы = СтруктураДанных.Количество();
			
			Если Не ЕстьЭлементы Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Для Каждого Элемент Из СтруктураДанных Цикл
				
				ЗагрузитьЦвет(Модель, Элемент);
				
				
			КонецЦикла;	
			
		Иначе	
			
			Возврат Ложь;
			
		КонецЕсли;   
	Исключение       
		
		Возврат Ложь;	
		
	КонецПопытки;	
	
	Возврат Истина;

КонецФункции	

Процедура ЗагрузитьЦвет(Модель, Данные) 
	
	Элемент = Справочники.CRM_ЦветаАвтомобилей.НайтиПоРеквизиту("id", Число(Данные.id));
	Если Не Элемент.Пустая() Тогда
		
		Если Не ОбновлятьСправочники Тогда
			Возврат;
		КонецЕсли;	
		
		Объект = Элемент.ПолучитьОбъект();
		
	Иначе
		
		Объект = Справочники.CRM_ЦветаАвтомобилей.СоздатьЭлемент(); 
		
	КонецЕсли;
	
	Объект.Наименование = Данные.name;
	Объект.ID = Данные.id; 
	Объект.Модель = Модель;
	Объект.rgb = Данные.rgb;  
	Объект.КодЦвета = Данные.code;
	
	Объект.Записать();
	
КонецПроцедуры  

Процедура ЗагрузитьВсеПоМарке() Экспорт
	
	ПолучитьМодели();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CRM_МоделиАвтомобилей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.CRM_МоделиАвтомобилей КАК CRM_МоделиАвтомобилей
		|ГДЕ
		|	CRM_МоделиАвтомобилей.Марка = &Марка";
	
	Запрос.УстановитьПараметр("Марка", ЗагружатьТолькоМарку);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗагружатьТолькоМодель = ВыборкаДетальныеЗаписи.Ссылка;
		
		ЗагрузитьВсеПоМодели();
		Сообщить("Обновлена модель " + ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗагрузитьВсеПоМодели() Экспорт 
	
	ПолучитьПоколения();
	ПолучитьСерии();
	ПолучитьКомплектации();
	ПолучитьМодификации();
	ПолучитьОтделки();
	ПолучитьЦвета(); 
	
КонецПроцедуры	


настройка = справочники.CRM_НастройкиПодключенияПоСалонам.НайтиПоКоду("000000010");

Логин = настройка.Логин;//"a.klient_treyd";
Пароль = настройка.Пароль;//"7r94qv";