Процедура УстановитьСтатус(ЗаявкаДДС, Статус, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	МенеджерЗаписей = РегистрыСведений.БТ_СтатусыЗаявкиДДС.СоздатьМенеджерЗаписи();
	МенеджерЗаписей.ЗаявкаДДС 	= ЗаявкаДДС;
	МенеджерЗаписей.Статус 		= Статус;
	МенеджерЗаписей.Период		= Дата;
	МенеджерЗаписей.Записать();
	
КонецПроцедуры       

Функция УзнатьТекСтатус(ЗаявкаДДС) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СтатусыЗаявкиДДССрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.БТ_СтатусыЗаявкиДДС.СрезПоследних(, ЗаявкаДДС = &ЗаявкаДДС) КАК БТ_СтатусыЗаявкиДДССрезПоследних";
	
	Запрос.УстановитьПараметр("ЗаявкаДДС", ЗаявкаДДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Статус;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции