Перем Адрес Экспорт;
Перем Заголовки Экспорт;
Перем Соединение Экспорт;
 

Процедура УстановитьСоединение() Экспорт
	
	ПрофильПодключения = Справочники.БТ_ПрофилиПодключенияHTTP.GAC;
	URL = ПрофильПодключения.URL;
	ИмяДоступа = ПрофильПодключения.ИмяПользователя;
	ПарольДоступа = ПрофильПодключения.ПарольПользователя;
	
	//Соединение = Новый HTTPСоединение(URL, ,
	//            ИмяДоступа,
	//            ПарольДоступа,,
	//            ,
	//            ?(ПрофильПодключения.HTTPS, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
				
	Соединение = Новый HTTPСоединение(URL, ,
                ,
                ,,
                ,
                ?(ПрофильПодключения.HTTPS, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
				
    
    Заголовки = Новый Соответствие;
	
	//СтрокаАвторизации = ПолучитьBase64СтрокуИзДвоичныхДанных(
	//	ПолучитьДвоичныеДанныеИзСтроки(
	//		СокрЛП(ИмяДоступа) + ":" + ПарольДоступа, КодировкаТекста.UTF8, Ложь));
			
	СтрокаАвторизации = ПолучитьBase64СтрокуИзДвоичныхДанных(
		ПолучитьДвоичныеДанныеИзСтроки(
			ПрофильПодключения.Authorization, КодировкаТекста.UTF8, Ложь));
	
	
	
	Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Заголовки.Вставить("Connection", "keep-alive");
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Authorization", ПрофильПодключения.Authorization);
	
КонецПроцедуры	

Процедура ВыгрузитьДанные() Экспорт

	Если Соединение = Неопределено Тогда
		
		УстановитьСоединение();
      	
	КонецЕсли;	
	
	Если ЗаказНаряды Тогда
		Если ЗначениеЗаполнено(ОдинЗН) И ОдинЗН.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			ид = НайтиВыгруженныйОбъект(ОдинЗН);
			
			Если Ид = Неопределено Тогда
				ДобавитьВыгруженныеДанные(ОдинЗН, "ЗаказНаряд", 0, "")
			КонецЕсли;	
		КонецЕсли;	
		
		ВыгрузитьЗаказНаряды();
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НачПериода) Тогда
		Если ОбновитьКонтрагента Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	БТ_СопоставлениеДанныхGAC.Данные1С КАК Данные1С,
				|	БТ_СопоставлениеДанныхGAC.ID КАК ID
				|ИЗ
				|	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
				|ГДЕ
				|	БТ_СопоставлениеДанныхGAC.Период МЕЖДУ &Дата1 И &Дата2
				|	И БТ_СопоставлениеДанныхGAC.Тип = &Тип";
			
			Запрос.УстановитьПараметр("Дата1", НачПериода);
			Запрос.УстановитьПараметр("Дата2", КонецДня(КонПериода));
			Запрос.УстановитьПараметр("Тип", "Контрагент");
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Ошибка = "";
				
				идКонтрагента = ВыгрузитьКонтрагента(ВыборкаДетальныеЗаписи.Данные1С, Ошибка, ВыборкаДетальныеЗаписи.ID);
				
				Если ЗначениеЗаполнено(идКонтрагента) и не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ID) Тогда
					
					ДобавитьВыгруженныеДанные(ВыборкаДетальныеЗаписи.Данные1С, "Контрагент", идКонтрагента, Ошибка);
					
					
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;   
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыгрузитьЗаказНаряды()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.Данные1С КАК Данные1С,
	                      |	БТ_СопоставлениеДанныхGAC.Период КАК Период,
	                      |	БТ_СопоставлениеДанныхGAC.ID КАК ID
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |ГДЕ
	                      |	(БТ_СопоставлениеДанныхGAC.ID = 0
	                      |				И НЕ &ОбновлениеДанных
	                      |			ИЛИ &ОбновлениеДанных
	                      |				И БТ_СопоставлениеДанныхGAC.Данные1С = &ОдинЗН)
	                      |	И БТ_СопоставлениеДанныхGAC.Тип = ""ЗаказНаряд""
	                      |	И НЕ БТ_СопоставлениеДанныхGAC.Данные1С.НеВыгружатьИмпортеру");
	
	Запрос.УстановитьПараметр("ОбновлениеДанных", ОбновитьЗН);
	Запрос.УстановитьПараметр("ОдинЗН", ОдинЗН);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(ОдинЗН) и Выборка.Данные1С <> ОдинЗН Тогда
			ПродолжитЬ;
		КонецЕсли;	
		
		Ошибка = "";
		
		идЗН = ВыгрузитьЗН(Выборка.Данные1С, Ошибка, Выборка.ID); 
		
		ДобавитьВыгруженныеДанные(Выборка.Данные1С, "ЗаказНаряд", идЗН, Ошибка);
		
	КонецЦикла; 
	
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.Данные1С КАК Данные1С,
						  |	БТ_СопоставлениеДанныхGAC.ДопДанные1С КАК ДопДанные1С,
	                      |	БТ_ДанныеПоЗН.ID КАК ID
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_ДанныеПоЗН
	                      |		ПО (БТ_СопоставлениеДанныхGAC.Данные1С = БТ_ДанныеПоЗН.Данные1С
	                      |				И БТ_ДанныеПоЗН.Тип = ""ЗаказНаряд""
	                      |				И БТ_ДанныеПоЗН.ID <> 0)
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGAC.ID = 0
	                      |	И БТ_СопоставлениеДанныхGAC.Тип = ""ЗаказНарядРаботы""");
	 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибка = "";  
		
		Если ЗначениеЗаполнено(ОдинЗН) и Выборка.Данные1С <> ОдинЗН Тогда
			ПродолжитЬ;
		КонецЕсли;
		
		Работа = Выборка.ДопДанные1С;
		
		идРаботЗН = ВыгрузитьРаботыЗН(Выборка.Данные1С, Выборка.ID, Работа, Ошибка); 
		
		ДобавитьВыгруженныеДанные(Выборка.Данные1С, "ЗаказНарядРаботы", идРаботЗН, Ошибка, Работа);
		
	КонецЦикла; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.Данные1С КАК Данные1С,
						  |	БТ_СопоставлениеДанныхGAC.ДопДанные1С КАК ДопДанные1С,
	                      |	БТ_ДанныеПоЗН.ID КАК ID
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_ДанныеПоЗН
	                      |		ПО (БТ_СопоставлениеДанныхGAC.Данные1С = БТ_ДанныеПоЗН.Данные1С
	                      |				И БТ_ДанныеПоЗН.Тип = ""ЗаказНаряд""
	                      |				И БТ_ДанныеПоЗН.ID <> 0)
	                      |ГДЕ
	                      |	БТ_СопоставлениеДанныхGAC.ID = 0
	                      |	И БТ_СопоставлениеДанныхGAC.Тип = ""ЗаказНарядТовары""");
	 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибка = "";
		
		Если ЗначениеЗаполнено(ОдинЗН) и Выборка.Данные1С <> ОдинЗН Тогда
			ПродолжитЬ;
		КонецЕсли;
		
		Товар = Выборка.ДопДанные1С;
		
		идТовараЗН = ВыгрузитьТоварыЗН(Выборка.Данные1С, Выборка.ID, Товар, Ошибка); 
		
		ДобавитьВыгруженныеДанные(Выборка.Данные1С, "ЗаказНарядТовары", идТовараЗН, Ошибка, Товар);
		
	КонецЦикла; 


КонецПроцедуры	

Процедура ДобавитьВыгруженныеДанные(Ссылка, Тип, Ид, Комментарий = "", ДопДанные = Неопределено)
	Наб = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
	Наб.Отбор.Данные1С.Установить(Ссылка);
	
	Если ЗначениеЗаполнено(ДопДанные) Тогда
		Наб.Отбор.ДопДанные1С.Установить(ДопДанные);
	КонецЕсли;	                                  
	
	Наб.Прочитать();
	
	Если Наб.Количество() = 0 тогда
		Мен = Наб.Добавить();
		Мен.Период = ТекущаяДата();
		Мен.Тип = Тип;
		Мен.Данные1С = Ссылка;
	Иначе
		Мен = Наб[0];
	КонецЕсли;	
	
	мен.Комментарий = Комментарий;
	Мен.ID = Ид;
	Мен.ДатаВыгрузки = ТекущаяДатаСеанса();
	
	Наб.Записать();

КонецПроцедуры	

Функция ВыгрузитьРаботыЗН(ЗН, идЗН, Знач Работа, Ошибка) 
	Если 1 = 2 Тогда
		ЗН = Документы.ЗаказНаряд.ПустаяСсылка();
	КонецЕсли;	
	
	Массив = Новый Массив;
	
	СтрокаРабот = Зн.Работы.Найти(Работа);
	Если СтрокаРабот <> Неопределено Тогда
		Структура = Новый Структура;
		Структура.Вставить("purchase_id", идЗН);
		Структура.Вставить("code", ?(ЗначениеЗаполнено(СтрокаРабот.Работа.Артикул),СтрокаРабот.Работа.Артикул,СтрокаРабот.Работа.Код));
		Структура.Вставить("name", СтрокаРабот.Работа.Наименование);
		Структура.Вставить("price", КорректноеЧисло(СтрокаРабот.Цена));
		Структура.Вставить("quantity", КорректноеЧисло(СтрокаРАбот.Количество * СтрокаРАбот.Коэффициент));
		Структура.Вставить("discount", КорректноеЧисло(СтрокаРАбот.СуммаСкидки));
		Структура.Вставить("sum", КорректноеЧисло(СтрокаРАбот.СуммаВсего));
		Структура.Вставить("status", 0);
		
		Ошибка = "";
		идРабот = ОтправитьЗапрос("/api/purchase-work", Структура, Ошибка);
		
		Возврат идРабот;
	Иначе
		Ошибка = "Работа не найдена в ЗН";
	КонецЕсли;
	
КонецФункции	

Функция КорректноеЧисло(ч)
	Возврат СтрЗаменить(формат(ч, "ЧДЦ=4; ЧРД=.; ЧН="), Символы.НПП, "");
КонецФункции	

Функция ВыгрузитьТоварыЗН(ЗН, идЗН, Товар, Ошибка) 
	
	Если 1 = 2 Тогда
		ЗН = Документы.ЗаказНаряд.ПустаяСсылка();
	КонецЕсли;	
	
	Массив = Новый Массив;
	
	СтрокаТоваров = Зн.Товары.Найти(Товар);
	Если СтрокаТоваров <> Неопределено Тогда
		Структура = Новый Структура;
		Структура.Вставить("purchase_id", идЗН);
		Структура.Вставить("code", СтрокаТоваров.Номенклатура.Артикул);
		Структура.Вставить("name", СтрокаТоваров.Номенклатура.Наименование);
		Структура.Вставить("type", ?(Найти(нрег(ЗН.ВидРемонта), "гарант") > 0, 0, 1));
		Структура.Вставить("price", КорректноеЧисло(СтрокаТоваров.Цена));
		Структура.Вставить("quantity", КорректноеЧисло(СтрокаТоваров.Количество));
		Структура.Вставить("discount", КорректноеЧисло(СтрокаТоваров.СуммаСкидки));
		Структура.Вставить("sum", КорректноеЧисло(СтрокаТоваров.СуммаВсего));
		Структура.Вставить("status", 0);
		
		Ошибка = "";
		идРабот = ОтправитьЗапрос("/api/purchase-spare", Структура, Ошибка);
		
		Возврат идРабот;
	Иначе
		Ошибка = "Товар не найдена в ЗН";
	КонецЕсли;

КонецФункции	

функция ТипОплаты(ВидРемонта)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.ID КАК ID
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеВидовРемонтаGAC КАК БТ_СопоставлениеВидовРемонтаGAC
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |		ПО (БТ_СопоставлениеВидовРемонтаGAC.ТипОплатыGAC = БТ_СопоставлениеДанныхGAC.Name
	                      |				И БТ_СопоставлениеДанныхGAC.Тип = ""ТипОплаты"")
	                      |ГДЕ
	                      |	БТ_СопоставлениеВидовРемонтаGAC.ВидРемонта = &ВидРемонта");
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ID;
	КонецЕсли;	
КонецФункции


Функция ВыгрузитьЗН(ЗН, Ошибка, идОбновления = 0)
	
	Если 1 = 2 Тогда
		ЗН = Документы.ЗаказНаряд.ПустаяСсылка();
	КонецЕсли;	
	
	_Контрагент = ЗН.Контрагент;     
	Если Не ЗначениеЗаполнено(_Контрагент) Тогда
		_Контрагент = Зн.Заказчик;
	КонецЕсли;	
	
	ВидРемонта = ВидРемонтаХавал(ЗН.ВидРемонта, ЗН.БТ_НомерТО);
	Если не ЗначениеЗаполнено(ВидРемонта) тогда
		Ошибка = "Не сопоставлен вид ремонта";
		Возврат 0;
	КонецЕсли;	

	//Если ВидРемонта = 5 или ВидРемонта = 25 Тогда
	//	_Контрагент = ЗН.Заказчик;
	//КонецЕсли;	
	//
	//Если Не ЗначениеЗаполнено(_Контрагент) Тогда
	//	_Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ000440");
	//КонецЕсли;	
	ИдКлиента = 0;
	
	Если ЗначениеЗаполнено(_Контрагент) Тогда
		ИдКлиента = НайтиВыгруженныйОбъект(_Контрагент);
		
		Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		
			Ошибка = "";
			ИдКлиента = ВыгрузитьКонтрагента(_Контрагент, Ошибка);
			
			ДобавитьВыгруженныеДанные(_Контрагент, "Контрагент", ИдКлиента, Ошибка);
			
			Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
				Ошибка = "Не сопоставлен контрагент";
				Возврат 0;
			КонецЕсли;	
		Иначе	
			Если ОбновитьКонтрагента Тогда
				ВыгрузитьКонтрагента(_Контрагент, Ошибка, ИдКлиента);
			КонецЕсли;	
	
		КонецЕсли;	     
		
	КонецЕсли;
	
	ИдАвто = НайтиВыгруженныйОбъект(ЗН.Автомобиль);
	
	Если Не ЗначениеЗаполнено(ИдАвто) Тогда
		
		Ошибка = "";
		ИдАвто = ВыгрузитьАвтомобиль(ЗН.Автомобиль, Ошибка);
		
		Если ЗначениеЗаполнено(ИдАвто) или не ПустаяСтрока(Ошибка) Тогда
			ДобавитьВыгруженныеДанные(ЗН.Автомобиль, "Автомобиль", ИдАвто, Ошибка);
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ИдАВто) Тогда 
			Ошибка = "Не сопоставлен автомобиль";
			Возврат 0;
		КонецЕсли;	
	Иначе
		Если Не ОбновитьАвто Тогда
			ОбновитьАвтомобиль(ЗН.Автомобиль, Ошибка, ИдАвто);
		Иначе
			ВыгрузитьАвтомобиль(ЗН.Автомобиль, Ошибка, ИдАвто)		
		КонецЕсли;	

	КонецЕсли;	
	
	Ошибка = "";
	
	Структура = Новый Структура;
	Если ЗначениеЗаполнено(идОбновления) Тогда
		Структура.Вставить("ID", идОбновления);
	КонецЕсли;	
	
	Структура.Вставить("code", СокрЛП(ЗН.Номер));
	Структура.Вставить("dateOpen", Формат(ЗН.ДатаСоздания, "ДФ=dd.MM.yyyy"));
	Структура.Вставить("dateClose", Формат(?(ЗначениеЗаполнено(ЗН.ДатаЗакрытия), ЗН.ДатаЗакрытия, ТекущаяДатаСеанса()), "ДФ=dd.MM.yyyy"));
	
	Если ЗначениеЗаполнено(ЗН.Мастер) Тогда
		ИдМастера = НайтиВыгруженныйОбъект(ЗН.Мастер);
		
		Если ЗначениеЗаполнено(ИдМастера) Тогда
			Структура.Вставить("acceptor_id", ИдМастера);
		Иначе
			Ошибка = "";
			ИдМастера = ВыгрузитьСотрудника(ЗН.Мастер, Ошибка);
			
			Если Не ЗначениеЗаполнено(ИдМастера) Тогда 
				Ошибка = "Не сопоставлен мастер-приемщик";
				Возврат 0;
			КонецЕсли;	
			
			Структура.Вставить("acceptor_id", ИдМастера);
		КонецЕсли;	
	КонецЕсли;	
	
	Структура.Вставить("client_id", ИдКлиента);
	
	
	КонтактноеЛицо = НайтиКонтакт(_Контрагент);
		
	//Если ЗначениеЗаполнено(КонтактноеЛицо) И КонтактноеЛицо.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
	//	
	//	ИдКонтакта = НайтиВыгруженныйОбъект(КонтактноеЛицо);
	//	
	//	Если Не ЗначениеЗаполнено(ИдКонтакта) Тогда
	//		ИдКонтакта = ВыгрузитьКонтрагента(КонтактноеЛицо, Ошибка);
	//		
	//		Если ЗначениеЗаполнено(ИдКонтакта) Тогда
	//			ДобавитьВыгруженныеДанные(КонтактноеЛицо, "Контрагент", ИдКонтакта, Ошибка);
	//        КонецЕсли;
	//		
	//	КонецЕсли;	
	//	
	//	Если ЗначениеЗаполнено(ИдКонтакта) Тогда
	//		Структура.Вставить("contact_person_id", ИдКонтакта);
	//	КонецЕсли;	
	//КонецЕсли; 
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) И КонтактноеЛицо.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо и _Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		
		ИдКонтакта = НайтиВыгруженныйОбъект(КонтактноеЛицо);
		
		Если Не ЗначениеЗаполнено(ИдКонтакта) Тогда
			ИдКонтакта = ВыгрузитьКонтрагента(КонтактноеЛицо, Ошибка);
			
			Если ЗначениеЗаполнено(ИдКонтакта) Тогда
				ДобавитьВыгруженныеДанные(КонтактноеЛицо, "Контрагент", ИдКонтакта, Ошибка);
            КонецЕсли;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ИдКонтакта) Тогда
			Структура.Вставить("contact_person_id", ИдКонтакта);
		Иначе
			Структура.Вставить("contact_person_id", "");
		КонецЕсли;	
	Иначе
	    Структура.Вставить("contact_person_id", "");
    КонецЕсли;
	
	Структура.Вставить("car_id", ИдАвто);
	Структура.Вставить("purchase_type_id", ?(найти(нрег(Зн.Цех), "кузов") > 0, 4, 1));
	
	ТипОплаты = ТипОплаты(ЗН.ВидРемонта);
	Если не ЗначениеЗаполнено(ТипОплаты) тогда
		Ошибка = "Не сопоставлен тип оплаты";
		Возврат 0;
	КонецЕсли;	
	
	Структура.Вставить("purchase_group_id", ТипОплаты);

	Структура.Вставить("status", "closed");
	Структура.Вставить("verify", "draft");
	Структура.Вставить("request_reason", ?(Не пустаяСтрока(ЗН.ПричинаОбращения), СокрЛП(ЗН.ПричинаОбращения), СокрЛП(ЗН.ВидРемонта)));
	
	// БИЗТЕХ КОВАЛЬ 27.10.2025 ++
	// Правка пробега на пробег из документа
	
	//пробег = Пробег(зн.автомобиль);
	
	пробег = зн.Пробег;
	
	// БИЗТЕХ КОВАЛЬ 27.10.2025 --
	
	Если ЗначениеЗаполнено(пробег) Тогда
		Структура.Вставить("mileage",  пробег);
	КонецЕсли;	
	
	МассивВидовРемонта = Новый Массив;
	МассивВидовРемонта.Добавить(Новый Структура("id,name,status", ВидРемонта, ЗН.ВидРемонта.Наименование, 0));
	//Структура.Вставить("tags", МассивВидовРемонта);  
	Структура.Вставить("tags", ВидРемонта);  
	Структура.Вставить("recommendations", СокрЛП(ЗН.Рекомендации));  
	
	Ошибка = "";
	Ошибка = "";
	Если Не ЗначениеЗаполнено(идОбновления) Тогда
		идЗН = ОтправитьЗапрос("/api/purchase", Структура, Ошибка);
	Иначе     
		идЗН = ОтправитьЗапрос("api/purchase/"+СтрЗаменить(идОбновления, Символы.НПП, ""), Структура, Ошибка, "PUT");
    КонецЕсли;
	
	Если Не ЗначениеЗаполнено(идЗН) Тогда 
		Возврат 0;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(идОбновления) Тогда
		Если Не ОбновлятьТоварыРаботы Тогда
			Структура = Новый Структура; 
			Структура.Вставить("verify", "approved");
			
			ОтправитьЗапрос("api/purchase/"+СтрЗаменить(идЗН, Символы.НПП, ""), Структура, Ошибка, "PUT");
			
			Возврат идЗН;
		Иначе
			
			Наб = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
			Наб.Отбор.Данные1С.Установить(ЗН);
			Наб.Отбор.Тип.Установить("ЗаказНарядРаботы");
			Наб.Записать();
			
			Наб = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
			Наб.Отбор.Данные1С.Установить(ЗН);
			Наб.Отбор.Тип.Установить("ЗаказНарядТовары");
			Наб.Записать();
			
			Структура = Новый Структура; 
			МасРабот = ОтправитьЗапрос("/api/purchase-work?purchase_id="+СтрЗаменить(идЗН, Символы.НПП, ""),,Ошибка, "GET");
			
			Если ЗначениеЗаполнено(МасРабот) Тогда
				Для Каждого Элемент Из МасРабот Цикл
					Если Элемент.Status = 0 Тогда
						УдалитьРаботу(Элемент.id);
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			
			Структура = Новый Структура; 
			МасЗЧ = ОтправитьЗапрос("/api/purchase-spare?purchase_id="+СтрЗаменить(идЗН, Символы.НПП, ""),,Ошибка, "GET");
			
			Если ЗначениеЗаполнено(МасЗЧ) Тогда
				Для Каждого Элемент Из МасЗЧ Цикл
					Если Элемент.Status = 0 Тогда
						УдалитьЗапчасть(Элемент.id);
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
			
				
	Для Каждого СтрокаРабот Из ЗН.Работы Цикл
		НоваяЗапись = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.Тип = "ЗаказНарядРаботы";
		НоваяЗапись.Данные1С = ЗН;
		НоваяЗапись.ДопДанные1С = СтрокаРАбот.Работа;
		НоваяЗапись.Записать();  
		
		Ошибка = "";
		ИдРаботЗН = ВыгрузитьРаботыЗН(ЗН, идЗН, СтрокаРабот.Работа, Ошибка);
		
		ДобавитьВыгруженныеДанные(ЗН, "ЗаказНарядРаботы", идРаботЗН, Ошибка, СтрокаРабот.Работа);
	КонецЦикла;		
	
	Для Каждого СтрокаТоваров Из ЗН.Товары Цикл
		НоваяЗапись = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.Тип = "ЗаказНарядТовары";
		НоваяЗапись.Данные1С = ЗН;
		НоваяЗапись.ДопДанные1С = СтрокаТоваров.Номенклатура;
		Попытка
			НоваяЗапись.Записать();
		
			Ошибка = "";
			ИдТоваровЗН = ВыгрузитьТоварыЗН(ЗН, идЗН, СтрокаТоваров.Номенклатура, Ошибка);
			
			ДобавитьВыгруженныеДанные(ЗН, "ЗаказНарядТовары", идТоваровЗН, Ошибка, СтрокаТоваров.Номенклатура);
		исключение
		КонецПопытки;	
	КонецЦикла;
			
	Структура = Новый Структура; 
	Структура.Вставить("verify", "approved");
	
	ОтправитьЗапрос("api/purchase/"+СтрЗаменить(идЗН, Символы.НПП, ""), Структура, Ошибка, "PUT");	
	
	Возврат идЗН;
КонецФункции

Процедура УдалитьРаботу(ид)
	Ошибка = "";
	Структура = Новый Структура; 
	Структура.Вставить("status", 1);
	
	ОтправитьЗапрос("/api/purchase-work/"+СтрЗаменить(ид, Символы.НПП, ""), Структура, Ошибка, "PUT");
КонецПроцедуры	

Процедура УдалитьЗапчасть(ид)
	Ошибка = "";
	Структура = Новый Структура; 
	Структура.Вставить("status", 1);
	
	ОтправитьЗапрос("/api/purchase-spare/"+СтрЗаменить(ид, Символы.НПП, ""), Структура, Ошибка, "PUT");
КонецПроцедуры

Функция ФормаСобственности(Контрагент)
	Если Найти(Контрагент, "ООО") > 0 Тогда
		Возврат "ООО";
	ИначеЕсли Найти(Контрагент, "ИП ") > 0 или Найти(Контрагент, " ИП") > 0 Тогда
		Возврат "ИП";	
	ИначеЕсли Найти(Контрагент, "АО ") > 0 или Найти(Контрагент, " АО") > 0 Тогда
		Возврат "АО";		
	ИначеЕсли Найти(Контрагент, "ОАО ") > 0 или Найти(Контрагент, " ОАО") > 0 Тогда
		Возврат "ОАО";			
	ИначеЕсли Найти(Контрагент, "ТОО ") > 0 или Найти(Контрагент, " ТОО") > 0 Тогда
		Возврат "ТОО";				
	ИначеЕсли Найти(Контрагент, "СООО ") > 0 или Найти(Контрагент, " СООО") > 0 Тогда
		Возврат "СООО";					
	ИначеЕсли Найти(Контрагент, "ЗАО ") > 0 или Найти(Контрагент, " ЗАО") > 0 Тогда
		Возврат "ЗАО";	
	Иначе
		Возврат "ООО";
	КонецЕсли;	
Конецфункции

Функция ВыгрузитьСотрудника(Сотрудник, Ошибка)
	Если 1 = 2 Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;	
	
	Структура = Новый Структура;
	Структура.Вставить("code", Сотрудник.Код);
	
	ФИО = РазобратьФИО(Сотрудник);
	ДеньРождения = Сотрудник.ДатаРождения;

	Если ФИО.Количество() > 0 Тогда
		Структура.Вставить("first_name", ФИО[0]);
		
		Если ФИО.Количество() > 1 Тогда
			Структура.Вставить("last_name", ФИО[1]);
		КонецЕсли;	
		
		Если ФИО.Количество() > 2 Тогда
			Структура.Вставить("middle_name", ФИО[2]);
        КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДеньРождения) Тогда
		Структура.Вставить("birthday", Формат(ДеньРождения,"ДФ=dd.MM.yyyy"));
	Иначе
		Структура.Вставить("birthday", "");
	КонецЕсли;	
	
	емейл = Емейл(Сотрудник);
	
	Если ЗначениеЗаполнено(Емейл) Тогда
		Структура.Вставить("email", емейл);
	Иначе
		Структура.Вставить("email", "no"+СокрЛП(Сред(Сотрудник.Код, 3))+"@mail.ru");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Сотрудник.ДатаПриема) Тогда
		Структура.Вставить("employment", Формат(Сотрудник.ДатаПриема, "ДФ=dd.MM.yyyy"));
	КонецЕсли;	
	
	ИдДолжности = НайтиВыгруженныйОбъект(Сотрудник.Должность);
	Если ЗначениеЗаполнено(ИдДолжности) Тогда
		Массив = Новый Массив;
		Массив.Вставить(ИдДолжности);
		
		Структура.Вставить("position_list", Массив);
	КонецЕсли;	
	
	Структура.Вставить("status", "active");
	
	Ошибка = "";
	идСотрудника = ОтправитьЗапрос("/api/manager", Структура, Ошибка);
	
	ДобавитьВыгруженныеДанные(Сотрудник, "Сотрудник", идСотрудника, Ошибка);
	
	Возврат идСотрудника;
КонецФункции	

функция ВидРемонтаХавал(ВидРемонта, Номер_ТО = Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БТ_СопоставлениеДанныхGAC.ID КАК ID
	                      |ИЗ
	                      |	РегистрСведений.БТ_СопоставлениеВидовРемонтаGAC КАК БТ_СопоставлениеВидовРемонтаGAC
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.БТ_СопоставлениеДанныхGAC КАК БТ_СопоставлениеДанныхGAC
	                      |		ПО БТ_СопоставлениеВидовРемонтаGAC.ДанныеGAC = БТ_СопоставлениеДанныхGAC.Name
	                      |			И (БТ_СопоставлениеДанныхGAC.Тип = ""ВидРемонта"")
	                      |ГДЕ
	                      |	БТ_СопоставлениеВидовРемонтаGAC.ВидРемонта = &ВидРемонта
	                      |	И (БТ_СопоставлениеВидовРемонтаGAC.НомерТО = &НомерТО
	                      |			ИЛИ &ВсеНомераТО)");
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта); 
	Запрос.УстановитьПараметр("НомерТО", Номер_ТО); 
	Запрос.УстановитьПараметр("ВсеНомераТО", не ЗначениеЗаполнено(Номер_ТО) или ВидРемонта.код <> "ЦБ000037");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ID;
	КонецЕсли;	
КонецФункции	

Функция Пробег(авто)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	АвтомобилиСрезПоследних.Значение КАК Значение
	                      |ИЗ
	                      |	РегистрСведений.Автомобили.СрезПоследних(
	                      |			,
	                      |			Автомобиль = &Авто
	                      |				И ВидЗначения = &Видзначения) КАК АвтомобилиСрезПоследних");  
	Запрос.УстановитьПараметр("Авто", Авто);
	Запрос.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;	                 

	Возврат 0;
	
КонецФункции	

Функция ВыгрузитьАвтомобиль(Автомобиль, Ошибка, ИдОбновления = 0)
	Если 1 = 2 Тогда
		Автомобиль = Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
	ИдБренда = НайтиВыгруженныйОбъект(Автомобиль.Модель.Родитель);
	
	Если Не ЗначениеЗаполнено(ИдБренда) Тогда
		ДобавитьВыгруженныеДанные(Автомобиль, "Автомобиль", 0, "Не найден ID бренда " + Автомобиль.Модель.Родитель);
		Возврат 0;
	КонецЕсли;	
	
	ИдМодели = НайтиВыгруженныйОбъект(Автомобиль.Модель);
	
	Если Не ЗначениеЗаполнено(ИдМодели) Тогда
		ДобавитьВыгруженныеДанные(Автомобиль, "Автомобиль", 0, "Не найден ID модели " + Автомобиль.Модель);
		Возврат 0;
	КонецЕсли;	
	
	пробег = Пробег(автомобиль);
	//ЗаписьЖурналаРегистрации("ИнфообменBelgee_пробег", УровеньЖурналаРегистрации.Информация,,Автомобиль, пробег);
	
	Структура = Новый Структура; 
	//Если ЗначениеЗаполнено(ИдОбновления) Тогда
	//	Структура.Вставить("ID", ИдОбновления);
	//КонецЕсли;	
	Структура.Вставить("brand_id", ИдБренда);
	Структура.Вставить("model_id", ИдМодели);
	Структура.Вставить("code", Автомобиль.Код);
	Структура.Вставить("version", СокрЛП(Автомобиль.ВариантКомплектации));
	Структура.Вставить("color", СокрЛП(Автомобиль.Цвет));
	Структура.Вставить("vin", автомобиль.VIN); 
	Структура.Вставить("mileage",  пробег);
	Структура.Вставить("is_test_drive", 0);  
	
	ГосНомер = СокрЛП(Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер));
	Если Не ПустаяСтрока(ГосНомер) Тогда
		Структура.Вставить("reg_number", ГосНомер);  
	КонецЕсли;	

	
	Если Не ЗначениеЗаполнено(идОбновления) Тогда
		идАвто = ОтправитьЗапрос("/api/vehicle", Структура, Ошибка);
		
	Иначе
		ОтправитьЗапрос("/api/vehicle/"+СтрЗаменить(идОбновления, Символы.НПП, ""), Структура, Ошибка, "PUT");
		
		идАвто = идОбновления;
	КонецЕсли;

	
	//Если ЗначениеЗаполнено(идАвто) Тогда
	//	Наб = РегистрыСведений.БТ_СопоставлениеДанныхBelgee.СоздатьНаборЗаписей();
	//	Наб.Отбор.Данные1С.Установить(Автомобиль);
	//	Наб.Записать();

	//КонецЕсли;	
	
	Возврат идАвто;
	
КонецФункции

Функция ОбновитьАвтомобиль(Автомобиль, Ошибка, идАвто = 0)
	Если 1 = 2 Тогда
		Автомобиль = Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
	//ИдБренда = НайтиВыгруженныйОбъект(Автомобиль.Модель.Родитель);
	//
	//Если Не ЗначениеЗаполнено(ИдБренда) Тогда
	//	Возврат 0;
	//КонецЕсли;	
	//
	//ИдМодели = НайтиВыгруженныйОбъект(Автомобиль.Модель);
	//
	//Если Не ЗначениеЗаполнено(ИдМодели) Тогда
	//	Возврат 0;
	//КонецЕсли;	
	//
	//пробег = Пробег(автомобиль);
	////ЗаписьЖурналаРегистрации("ИнфообменGAC_пробег", УровеньЖурналаРегистрации.Информация,,Автомобиль, пробег);
	
	пробег = Пробег(автомобиль);
	
	Если Не ЗначениеЗаполнено(пробег) Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	Структура = Новый Структура; 
	//Если ЗначениеЗаполнено(ИдОбновления) Тогда
	//	Структура.Вставить("ID", ИдОбновления);
	//КонецЕсли;	
	Структура.Вставить("mileage",  пробег);
	//Структура.Вставить("brand_id", ИдБренда);
	//Структура.Вставить("model_id", ИдМодели);
	//Структура.Вставить("code", Автомобиль.Код);
	//
	ОтправитьЗапрос("api/vehicle/"+СтрЗаменить(идавто, Символы.НПП, ""), Структура, Ошибка, "PUT");
	
	//Если ЗначениеЗаполнено(идАвто) Тогда
	//	Наб = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
	//	Наб.Отбор.Данные1С.Установить(Автомобиль);
	//	Наб.Записать();

	//КонецЕсли;	
	
	Возврат идАвто;
	
КонецФункции

Функция НайтиКонтакт(Контрагент)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактныеЛицаКонтрагентов.Ведомый КАК Ссылка
	                      |ИЗ
	                      |	РегистрСведений.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	                      |ГДЕ
	                      |	КонтактныеЛицаКонтрагентов.Ведущий = &Ведущий
	                      |	И КонтактныеЛицаКонтрагентов.Использование
	                      |	И КонтактныеЛицаКонтрагентов.Основной"); 
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	КонтактныеЛица.Ссылка КАК Ссылка
	//                      |ИЗ
	//                      |	Справочник.КонтактныеЛица КАК КонтактныеЛица
	//                      |ГДЕ
	//                      |	КонтактныеЛица.Владелец = &Владелец
	//                      |	И НЕ КонтактныеЛица.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ведущий", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;	
	
КонецФункции	 

Функция РазобратьФИО(Наименование)
	_Наименование = СокрЛП(СтрЗаменить(Наименование, "  ", " "));
	
	МасКомп = СтрРазделить(_Наименование, " ");
	Мас = Новый Массив;
	
	Если МасКомп.Количество() = 0 тогда
	ИначеЕсли МасКомп.Количество() = 1 Тогда
		Мас.Добавить(МасКомп[0]);
	Иначе
		Мас.Добавить(МасКомп[1]);
		Мас.Добавить(МасКомп[0]);
		
		Если МасКомп.Количество() > 2 Тогда
			Мас.Добавить(МасКомп[2]);
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Мас;
КонецФункции	

Функция Телефоны(Контрагент, ЛюбойТелефон = "")
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
	                      |	КонтактнаяИнформация.Представление КАК Представление,
	                      |	ВЫБОР
	                      |		КОГДА КонтактнаяИнформация.Вид = &Мобильный
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ КАК Тип
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Тип = &Тип
	                      |	И КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Мобильный", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	МассивДанных = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	спУже = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Если СпУже.НайтиПоЗначению(Выборка.Представление) <> Неопределено Тогда
			ПродолжитЬ;
		КонецЕсли;	   
		СпУже.Добавить(Выборка.Представление);
		
		ЛюбойТелефон = Выборка.Представление;
		
		Структура = Новый структура("number,type", Выборка.Представление,выборка.ТИп);
		МассивДанных.Добавить(Структура);
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции	

Функция Адрес(Контрагент, ВидКонтактнойИнфо = Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Тип = &Тип
	                      |	И КонтактнаяИнформация.Объект = &Объект
	                      |	И (КонтактнаяИнформация.Вид = &Вид
	                      |			ИЛИ &все)");
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнфо);
	Запрос.УстановитьПараметр("Все", ВидКонтактнойИнфо = Неопределено);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	МассивДанных = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;
	
КонецФункции             

Функция Емейл(Контрагент)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КонтактнаяИнформация.Представление КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Тип = &Тип
	                      |	И КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	МассивДанных = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат КорректныйТелефон(Выборка.Представление);
	КонецЕсли;

КонецФункции 

Функция КорректныйТелефон(Телефон)
	поз = найти(Телефон, "<");
	Если поз = 0 Тогда
		Возврат Телефон;
	КонецЕсли;	        
	
	_Телефон = Сред(Телефон, поз + 1);
	Поз2 = Найти(_Телефон, ">");
	
	Если Поз2 = 0 Тогда
		Возврат _Телефон;
	Иначе
		Возврат Лев(_Телефон, поз2 - 1);
	КонецЕсли;	
КонецФункции	

Функция ВыгрузитьКонтрагента(Контрагент, Ошибка, идОбновления = 0)
	
	Если 1 = 2 Тогда
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	//ИдОбновления в строку
	Если ЗначениеЗаполнено(ИдОбновления) Тогда
		ИдОбновленияСтрока = СтрЗаменить(идОбновления, Символы.НПП, "");
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("code", Контрагент.Код);
	Структура.Вставить("type", ?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо, 0, 1));
	
	ДеньРождения = Контрагент.ДатаРождения;
	ФИО = "";
	
	ДаноСОПД = Ложь;
	Имя = "";
	
	КонтактноеЛицо = Неопределено;
	
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		КонтактноеЛицо = НайтиКонтакт(Контрагент);
		
		Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			ФИО = РазобратьФИО(КонтактноеЛицо);
			ДеньРождения = КонтактноеЛицо.ДатаРождения;
			//
			Если ТипЗнч(КонтактноеЛицо) = Тип("СправочникСсылка.Контрагенты") Тогда
				Имя = КонтактноеЛицо.Имя;   
				ДаноСОПД = (КонтактноеЛицо.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да);
			КонецЕсли;	
		//Иначе
		//	//Структура.Вставить("name", СокрЛП(Контрагент));
		КонецЕсли;
		Структура.Вставить("company_legal_form", ФормаСобственности(Контрагент));
	Иначе
		ФИО = РазобратьФИО(Контрагент);  
		ДеньРождения = Контрагент.ДатаРождения;
		
		Имя = Контрагент.Имя;
		
		ДаноСОПД = (Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ФИО) Тогда
		Структура.Вставить("name", ?(Не ПустаяСтрока(Имя), Имя, ФИО[0]));
		
		Если ДаноСОПД Тогда
		
			Если ФИО.Количество() > 1 Тогда
				Структура.Вставить("last_name", ФИО[1]);
			КонецЕсли;	
			
			Если ФИО.Количество() > 2 Тогда
				Структура.Вставить("middle_name", ФИО[2]);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	ЛюбойТелефон = "";
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		Телефоны = Телефоны(КонтактноеЛицо, ЛюбойТелефон);
		емейл = Емейл(КонтактноеЛицо);
		адрес = Адрес(КонтактноеЛицо);
	Иначе
		Телефоны = Телефоны(Контрагент, ЛюбойТелефон);
		емейл = Емейл(Контрагент);
		адрес = Адрес(Контрагент);
	КонецЕсли;	                      
	
	Если Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо ИЛИ ДаноСОПД Тогда
		Если ЗначениеЗаполнено(Телефоны) Тогда
			Структура.Вставить("phones", Телефоны);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Емейл) Тогда
			Структура.Вставить("email", емейл);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Адрес) Тогда
			Структура.Вставить("address", Адрес);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДеньРождения) Тогда
			Структура.Вставить("birthday", Формат(ДеньРождения, "ДФ=dd.MM.yyyy"));
		Иначе
			Структура.Вставить("birthday", "");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ЛюбойТелефон) Тогда
			Структура.Вставить("phone_hash", МД5(ЛюбойТелефон));
		КонецЕсли;	
	КонецЕсли;	
	
	Если Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
		
		Структура.Вставить("company_name", СокрЛП(Контрагент.НаименованиеПолное));
		Структура.Вставить("company_address", Адрес(Контрагент, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
		Структура.Вставить("company_inn", Контрагент.ИНН);
		Структура.Вставить("company_kpp", Контрагент.КПП);
		Структура.Вставить("company_okpo", Контрагент.КодПоОКПО);
		Структура.Вставить("company_email", емейл(Контрагент));
		
		Если ЗначениеЗаполнено(Телефоны) Тогда
			Структура.Вставить("phone_hash", МД5(Телефоны[0].number));
		Иначе
			Структура.Вставить("phone_hash", МД5(""));
		КонецЕсли;	
		
		//Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
		//	Структура.Вставить("client_confirm_communication", ?(ДаноСОПД, 1, 0)); 
		//Иначе
		//	Структура.Вставить("client_confirm_communication", 0);
		//КонецЕсли;			
		
		Структура.Вставить("client_confirm_communication", ""); 
		//Структура.Вставить("may_process_personal_data", "");
		
	Иначе
		
		Структура.Вставить("client_confirm_communication", ?(Контрагент.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да, 1, 0));
		Структура.Вставить("may_process_personal_data", Структура.client_confirm_communication)
		
	КонецЕсли;
	
	// Отправка данных
	Если Не ЗначениеЗаполнено(идОбновления) Тогда
		Возврат ОтправитьЗапрос("/api/client", Структура, Ошибка);
	Иначе
		Возврат ОтправитьЗапрос("/api/client/" + ИдОбновленияСтрока, Структура, Ошибка, "PUT");
	КонецЕсли;
	
КонецФункции    

Функция МД5(ЛюбойТелефон) Экспорт
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
 
	Хеш.Добавить(ЛюбойТелефон);
	 
	Возврат нрег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
	
КонецФункции	

Функция ОтправитьЗапрос(Метод, Структура, Ошибка, ВызываемыйМетод = "POST")
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);
			
	СтрокаДанных = ЗаписьJSON.Закрыть();
	
	Запрос = Новый HTTPЗапрос(Метод, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаДанных, КодировкаТекста.UTF8);
	
    Ответ = Соединение.ВызватьHTTPМетод(ВызываемыйМетод, Запрос); 

	Если Ответ.КодСостояния >= 200 и Ответ.КодСостояния < 400 Тогда 
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
		
		МассивДанных = ПрочитатьJSON(Чтение);
		
		Если ВызываемыйМетод = "GET" Тогда
			Возврат МассивДанных;
		Иначе
			Возврат МассивДанных.id	
		КонецЕсли;	
		
		

	Иначе	
		Ошибка = "Код ответа " + Ответ.КодСостояния + ": " + Ответ.ПолучитьТелоКакСтроку();
		Возврат 0;
	КонецЕсли;	
	
	КонецФункции

Функция НайтиВыгруженныйОбъект(Ссылка)
	
	Набор = РегистрыСведений.БТ_СопоставлениеДанныхGAC.СоздатьНаборЗаписей();
	Набор.Отбор.Данные1С.Установить(Ссылка);
    Набор.Прочитать();
	
	Если Набор.Количество() Тогда
		
		Возврат Набор[0].ID;
		
	КонецЕсли;	
	
КонецФункции	

Функция ОбновитьПробегВЗН(идОбновления, Автомобиль, Ошибка)
	
	пробег = Пробег(автомобиль);
	
	Если Не ЗначениеЗаполнено(пробег) Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	Структура = Новый Структура; 
	//Если ЗначениеЗаполнено(ИдОбновления) Тогда
	//	Структура.Вставить("ID", ИдОбновления);
	//КонецЕсли;	
	Структура.Вставить("mileage",  пробег);
	//Структура.Вставить("brand_id", ИдБренда);
	//Структура.Вставить("model_id", ИдМодели);
	//Структура.Вставить("code", Автомобиль.Код);
	//
	ОтправитьЗапрос("api/purchase/"+СтрЗаменить(идОбновления, Символы.НПП, ""), Структура, Ошибка, "PUT");

КонецФункции
