
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиВарианта = "";
	Если Параметры.Свойство("СформироватьПриОткрытии") и Параметры.Свойство("Вариант",НастройкиВарианта) Тогда
		Если не НастройкиВарианта = Неопределено Тогда
			
			ОтчетОбъект = Отчеты.БТ_ДебиторскаяЗадолженность.Создать();
			
		    Схема = ОтчетОбъект.СхемаКомпоновкиДанных.ВложенныеСхемыКомпоновкиДанных.Расшифровка.Схема.ВариантыНастроек.Основной;    
		    Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));    
			
			Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
			
			СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
			Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = ложь;
КонецПроцедуры


&НаКлиенте
Процедура Отборы(Команда)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = не Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость;
КонецПроцедуры


&НаКлиенте
Процедура ИсключениеКонтрагентов(Команда)
	ОткрытьФормуИсключения("Контрагенты");
КонецПроцедуры


&НаКлиенте
Процедура ИсключениеДоговоров(Команда)
	ОткрытьФормуИсключения("ДоговорыВзаиморасчетов");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИсключения(Справочник)
	
	ОткрытьФорму("Отчет.БТ_ДебиторскаяЗадолженность.Форма.ФормаИсключений",Новый Структура("Справочник",Справочник));
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Попытка
		СтандартнаяОбработка = ложь;
		СтруктураЗначений = РаботаемСРасшифровкойНаСервере(Расшифровка);
		ТаблДок = Взаиморасчеты(СтруктураЗначений);
		Если не ТаблДок = Неопределено Тогда
			
			Результат = ТаблДок;
			
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Функция ДобавитьОтбор(ОтборЭлементы,Поле,Значение)
	
	ТекОтбор = ОтборЭлементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(Поле);
	ТекОтбор.ПравоеЗначение = Значение;
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
КонецФункции

&НаСервере
Функция Взаиморасчеты(СтруктураЗначений);//Период,Показатель)
	
	СКД = Отчеты.БТ_ДебиторскаяЗадолженность.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").ВложенныеСхемыКомпоновкиДанных.Найти("Расшифровка").Схема;//.ВариантыНастроек.осно;//Документы.ОтправкаОтчетаПоДебиторскойЗадолженностиИКредитнымРесурсам.ПолучитьМакет("Макет").ВложенныеСхемыКомпоновкиДанных.Найти("ВнутригрупповыеРасчеты").Схема;
	Период = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0];
	//Внешние = Новый Структура("Основной",ИтоговаяТЗ);
	НастройкиВарианта = СКД.НастройкиПоУмолчанию;
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода",Период.Значение.ДатаНачала);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода",Период.Значение.ДатаОкончания);
	//НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Период_2годаНазад",Новый СтандартныйПериод(ПредыдущийРабочийДень_2Года,ПредыдущийРабочийДень_2Года));
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Если СтруктураЗначений.Свойство("Контрагент") Тогда
		
		ДобавитьОтбор(Отбор.Элементы,"Контрагент",СтруктураЗначений.Контрагент);
		
	ИначеЕсли СтруктураЗначений.Свойство("ДоговорВзаиморасчетов") Тогда
		
		ДобавитьОтбор(Отбор.Элементы,"ДоговорВзаиморасчетов",СтруктураЗначений.ДоговорВзаиморасчетов);
	Иначе
		
		Сообщить("Для данного поля, расшифровка не предусмотрена");
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТабДокОтчет = Новый ТабличныйДокумент;
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = МакетКомпоновки.Выполнить(СКД,НастройкиВарианта,);
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДокОтчет);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	
	Возврат ТабДокОтчет;
	
КонецФункции

&НаСервере
Функция РаботаемСРасшифровкойНаСервере(Расшифровка)
 
	РезультатСтруктура = Новый Структура;
	
	//Внимание! Ресурс сумма может быть перезаписан в значение NULL - поэтому его значение лучше получать выше. 
	ЗаполнитьСтруктуруПолейРасшифровки(Расшифровка, РезультатСтруктура,);
	
	Возврат РезультатСтруктура;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьИмяПоляГруппировки(п_Поле)
	
	Возврат СокрЛП(СтрЗаменить(п_Поле,".",""));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтруктуруПолейРасшифровки(Знач Расшифровка, СтруктураПолей, Знач Данные = "")
    
	Если Данные = "" Тогда
		
        Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
        
        Если ТипЗнч(Данные.Элементы[Расшифровка]) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			
			Поля = Данные.Элементы[Расшифровка].ПолучитьПоля();                   
            Для каждого Поле Из Поля Цикл
                СтруктураПолей.Вставить(ПреобразоватьИмяПоляГруппировки(Поле.Поле), Поле.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат;
КонецПроцедуры
