
Процедура ПриЗаписиЗНПриЗаписи(Источник, Отказ) Экспорт
	Если РольДоступна(Метаданные.Роли.ПроверятьНаОтбитиеРабот) и  Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт тогда
		Запрос = Новый Запрос;
		//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНарядРаботы.ПакетРабот,
		|	ЗаказНарядРаботы.НомерПакета
		|ПОМЕСТИТЬ ТаблРабот
		|ИЗ
		|	&ТаблРабот КАК ЗаказНарядРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказНарядРаботы.ПакетРабот,
		|	ЗаказНарядРаботы.НомерПакета КАК НомерПакета
		|ИЗ
		|	ТаблРабот КАК ЗаказНарядРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|		ПО ЗаказНарядРаботы.ПакетРабот = РегистрацияВремениРабот.ПакетРабот
		|ГДЕ
		|	ЗаказНарядРаботы.НомерПакета <> 0
		|	И РегистрацияВремениРабот.Продолжительность ЕСТЬ NULL 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.ПакетРабот,
		|	ЗаказНарядРаботы.НомерПакета
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерПакета";
		Запрос.УстановитьПараметр("ТаблРабот",Источник.Работы.Выгрузить());
		КэшПакетов = Запрос.Выполнить().Выбрать();
		пока КэшПакетов.Следующий() цикл
			Отказ = истина;
			Сообщить("Работы по пакету работ №" + КэшПакетов.НомерПакета + " не выполнены!");
		конецЦикла;
	конецЕсли;
	
	//Присвоение скидки по дисконтным картам
	Если ЗначениеЗаполнено(Источник.Карточка) Тогда
		Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе Тогда
			
			пробег = Источник.Пробег;		
			Если пробег <> неопределено И пробег <> NULL Тогда
				Если 29000 <= пробег И пробег <= 31000 Тогда
					Если ПолучитьЗначениеСкидки(Источник.Карточка, Источник.Дата) <> 5 Тогда
						СоздатьДокументСкидок(Источник.Дата-3600,Справочники.ТипыСкидок.НайтиПоНаименованию("Скидка по дисконтной карте 5%"),Источник.Карточка,5);
						Источник.ОбработкаРеквизита("Карточка");
					КонецЕсли;
				ИначеЕсли 45000 <= пробег И пробег <= 47000 Тогда
					Если ПолучитьЗначениеСкидки(Источник.Карточка, Источник.Дата) <> 7 Тогда
						СоздатьДокументСкидок(Источник.Дата-3600,Справочники.ТипыСкидок.НайтиПоНаименованию("Скидка по дисконтной карте 7%"),Источник.Карточка,7);
						Источник.ОбработкаРеквизита("Карточка");
					КонецЕсли;
				ИначеЕсли 59000 <= пробег И пробег <= 61000 Тогда
					Если ПолучитьЗначениеСкидки(Источник.Карточка, Источник.Дата) <> 10 Тогда
						СоздатьДокументСкидок(Источник.Дата-3600,Справочники.ТипыСкидок.НайтиПоНаименованию("Скидка по дисконтной карте 10%"),Источник.Карточка,10);
						Источник.ОбработкаРеквизита("Карточка");
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//<<Павличенко 07.11.17
	Если Источник.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт и Источник.ДатаЗакрытия <> Дата(1,1,1) тогда
		сообщить("Заказ-Наряд с установленной датой закрытия должен быть записан лишь в состояние ЗАКРЫТ!");
		Отказ=Истина;
    КонецЕсли;
	//>>Павличенко 07.11.17
	//<<Павличенко 27.11.17
	//заявка Куновой О. проверка для Темп-Авто Сервиса, с видами ремонта "для ТТ" на нужного контрагента и нужные договора для ЗН выполнен/закрыт 
	Если (Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен) ИЛИ (Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт) тогда
		Если Источник.Дата > Дата(2017, 10, 31) тогда
			Если (Источник.Организация = Справочники.Организации.НайтиПоКоду("ТАС00001")) И (СтрНайти(Источник.ВидРемонта.Наименование, "для ТТ") <> 0) тогда
				СписокДоговоров = Новый СписокЗначений();
				СписокДоговоров.Добавить(Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ024743"));   //Договор ТО и ремонта ТАС
				СписокДоговоров.Добавить(Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ053358"));   //Договор ТО и ремонта ТАС ГАЗ
				
				Если (Источник.Контрагент <> Справочники.Контрагенты.НайтиПоКоду("ЦБ001314")) ИЛИ СписокДоговоров.НайтиПоЗначению(Источник.ДоговорВзаиморасчетов) = Неопределено тогда 
					сообщить ("" + Источник + " записать невозможно! ");
					сообщить ("Для организации " + Справочники.Организации.НайтиПоКоду("ТАС00001") + " с видом ремонта " + Источник.ВидРемонта.Наименование); 
					сообщить ("возможен выбор плательщиком лишь " + Справочники.Контрагенты.НайтиПоКоду("ЦБ001314") + " с договорами " + Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ024743") + ", либо " + СписокДоговоров.Добавить(Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ053358")));
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//>>Павличенко 27.11.17
	//<<Павличенко 28.11.17
	//заявка Куновой О.
	Если  Источник.Организация = Справочники.Организации.НайтиПоКоду("ТАС00001") ИЛИ (Источник.Организация = Справочники.Организации.НайтиПоКоду("ИПК00001"))  тогда
		Если НЕ РольДоступна("ВосстПослед") тогда
			Если (Источник.ДоговорВзаиморасчетов.ДатаКонца <> Дата(1,1,1)) И (Источник.ДоговорВзаиморасчетов.ДатаКонца < НачалоДня(Источник.ДатаЗакрытия)) тогда
				сообщить ("Дата окончания договора меньше даты закрытия ЗН! Документ не может быть записан");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//>>Павличенко 28.11.17
	//Проверка НДС для организации Техно-Темп
	
	//<<Павличенко 09.04.19
	Если (Источник.Организация = Справочники.Организации.ОсновнаяОрганизация) И (Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт) И  (Источник.ДатаЗакрытия >= Дата(2019, 4,1)) И (Источник.ВидРемонта.ТипРемонта = Перечисления.ТипыРемонта.Платный) тогда
		НетНДС = ложь;
		Для каждого СтрЗапчасти из Источник.Товары цикл
			Если СтрЗапчасти.СтавкаНДС <> справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
				НетНДС = Истина;
				Прервать;
			КонецЕсли;
			Если СтрЗапчасти.СуммаНДС <> Окр((СтрЗапчасти.СуммаВсего * СтрЗапчасти.СтавкаНДС.Ставка)/(100 + СтрЗапчасти.СтавкаНДС.Ставка),2) тогда
				Отказ=Истина;
				Сообщить("Неверный расчет НДС по номенклатуре " + СтрЗапчасти.Номенклатура.Наименование);
			КонецЕсли;
			
		конеццикла;
		Для каждого СтрРаботы из Источник.Работы цикл
			Если СтрРаботы.СтавкаНДС <> справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
				НетНДС = Истина;
				Прервать;
			КонецЕсли;
		конеццикла;
		Если СтрРаботы.СуммаНДС <> Окр((СтрРаботы.СуммаВсего * СтрРаботы.СтавкаНДС.Ставка)/(100 + СтрРаботы.СтавкаНДС.Ставка),2) тогда
			Отказ=Истина;
			Сообщить("Неверный расчет НДС по работе " + СтрРаботы.Работа.Наименование);
		КонецЕсли;
		Если  НетНДС тогда
			Отказ=Истина;
			Сообщить("Все закрытые заказ-наряды с 01.04.19 для организации Техно-Темп должны быть с НДС 2%! По всем работам и по всем запчастям");
		КонецЕсли;	
	КонецЕсли;
	Если (Источник.Организация = Справочники.Организации.ОсновнаяОрганизация) И (Источник.ДатаЗакрытия >= Дата(2019, 4,1)) И (Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("G")) тогда
		 СписокКонтрагентов = Новый СписокЗначений();
		 СписокКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "6320002223"));
		 СписокКонтрагентов.Добавить(Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "6320013659"));
		 Если СписокКонтрагентов.НайтиПоЗначению(Источник.Контрагент) = Неопределено тогда
			Отказ=Истина;
			Сообщить("На вкладке ""Дополнительно"" поле ""Плательщик"" указан неверно! Необходимо указывать Джи Эм-Автоваз, ПАО АвтоВАЗ.");
		 КонецЕсли;
	КонецЕсли;
	
	//>>Павличенко 09.04.19
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Источник.ДатаЗакрытия) и НЕ обПраво("РедактированиеДокументовВЗакрытомПериоде") Тогда
		
		ДатаЗапретаРедактирования = КонецДня(обПолучитьПраваИНастройкиПользователя(Источник.Организация,"ДатаЗапретаРедактирования",Источник));
		
		Если Источник.ДатаЗакрытия <= ДатаЗапретаРедактирования Тогда
			Сообщить("Операция не выполнена. Выбранное значение реквизита ""Дата закрытия"" меньше даты запрета редактирования.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
	//Азимут
	//Источник = Документы.ЗаказНаряд.НайтиПоНомеру("");
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		
		//Не даем записывать, 
		//если в ТЧ Товары или Работы есть хотя бы одна строка с нулевой суммой
		Если РольДоступна(Метаданные.Роли.ЗапретитьЗаписьЗНСНулевойСуммой) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказНарядТовары.НомерСтроки,
			|	""Товары"" КАК ТипТЧ
			|ИЗ
			|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
			|ГДЕ
			|	ЗаказНарядТовары.Сумма = 0
			|	И ЗаказНарядТовары.Ссылка = &ТекДок
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказНарядРаботы.НомерСтроки,
			|	""Работы"" КАК ТипТЧ
			|ИЗ
			|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
			|ГДЕ
			|	ЗаказНарядРаботы.Сумма = 0
			|	И ЗаказНарядРаботы.Ссылка = &ТекДок";
			
			Запрос.УстановитьПараметр("ТекДок", Источник.Ссылка);	
			Выборка = Запрос.Выполнить().Выбрать();	
			
			СтрСообщитьР = "";
			СтрСообщитьТ = "";
			Пока Выборка.Следующий() Цикл
				Если Выборка.ТипТЧ = "Работы" Тогда
					СтрСообщитьР = СтрСообщитьР + " " + Выборка.НомерСтроки;				
				КонецЕсли;	
				Если Выборка.ТипТЧ = "Товары" Тогда
					СтрСообщитьТ = СтрСообщитьТ + " " + Выборка.НомерСтроки;				
				КонецЕсли;	
			КонецЦикла;	
			
			Если СтрСообщитьР <> "" Тогда
				СтрСообщитьР = "В табличной части ""Работы"" поле ""Сумма"" равно нулю в строке(ах) с номером(ами) " + СтрСообщитьР;
				Сообщить(СтрСообщитьР);
				Отказ = Истина;	
			КонецЕсли;	
			
			Если СтрСообщитьТ <> "" Тогда
				СтрСообщитьТ = "В табличной части ""Товары"" поле ""Сумма"" равно нулю в строке(ах) с номером(ами) " + СтрСообщитьТ;
				Сообщить(СтрСообщитьТ);
				Отказ = Истина;	
			КонецЕсли;	
		КонецЕсли;	
		
		Если обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь, ПланыВидовХарактеристик.ПраваИНастройки.НайтиПоКоду("75008"), Источник) Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
			//Проверка дат
			Если НЕ ЗначениеЗаполнено(Источник.Мастер) Тогда
				Сообщить("Не заполнено поле ""Мастер""! Закрытие заказа невозможно!");
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Источник.Диспетчер) Тогда
				Сообщить("Не заполнено поле ""Диспетчер""! Закрытие заказа невозможно!");
				Отказ = Истина;
			КонецЕсли;
			//Заполнение рекомендации
			Если НЕ РольДоступна("ВосстПослед") И СокрЛП(источник.Рекомендации)="" Тогда
				Сообщить("Не заполнены рекомендации! Закрытие заказа невозможно!");
				Отказ = Истина;
			КонецЕсли;
			// Подразделение договора = подразделение организации      
			//Bizteh 15.09.2022г. закомментировали это условие <<
			//Если Источник.ВидРемонта.ТипРемонта = перечисления.ТипыРемонта.Платный 
			//	И Источник.ПодразделениеКомпании <> Источник.ДоговорВзаиморасчетов.Подразделение Тогда 
			//		Сообщить("Подразделение договора должно соответствовать подразделению организации! Процедура записи была отменена.");
			//		Отказ=Истина;
			//КонецЕсли;
			//Bizteh >>

			//Заполнение доверенности для юриков
			СвойствоПроверятьЗаполнениеДоверенностиЮЛ  = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Проверять заполнение доверенности юрлиц в ЗН");
			
			Если ЗначениеЗаполнено(СвойствоПроверятьЗаполнениеДоверенностиЮЛ) Тогда
				РезультатОтбора = РегистрыСведений.ЗначенияСвойствОбъектов.Получить(Новый Структура("Объект, Свойство",Источник.Организация, СвойствоПроверятьЗаполнениеДоверенностиЮЛ));
				Если ЗначениеЗаполнено(РезультатОтбора.Значение) Тогда									
					Если НЕ Источник.Заказчик.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо и НЕ СокрЛП(Источник.ВидРемонта.Код) = "АЗ000002" Тогда
						Доверенность = обПолучитьЗначениеСвойства(Источник,ПланыВидовХарактеристик.СвойстваОбъектов.Доверенность);
						Если Доверенность.Ссылка.Пустая() Тогда
							Сообщить("Укажите данные доверенности (панель свойств)! Закрытие заказа невозможно!");
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//Закрывают гарантию сервиса, дилера, автосалона только сервис-менеджеры
		Если НЕ РольДоступна("ЗакрытиеГарантии") И 
			Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт И
			(Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("Гарантия диллера") ИЛИ
			//Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("Гарантия диллера для ТТ") ИЛИ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("Гарантия салона") ИЛИ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("Гарантия сервиса")) Тогда
			Сообщить("Для закрытия обратитесь к сервис-менеджеру(руководителю).");
			Отказ=Истина;
		КонецЕсли;
		
		Если НЕ РольДоступна("ПолныеПрава") И  Источник.Организация = Справочники.Организации.ОсновнаяОрганизация И  //.Организации.НайтиПоКоду("00001   ")
			Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт И
			(Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") ИЛИ   //Восстановление товарных а/м для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") ИЛИ    //Гарантия диллера для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001") ИЛИ    //Дополнительное оборудование
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") ИЛИ    //Дополнительное оборудование П
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000022") ИЛИ    //Кузовной ремонт
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") ИЛИ    //Мойка автомобилей для тест-драйва для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") ИЛИ    //Мойка автомобилей для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") ИЛИ    //ПСО для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") ИЛИ    //ПСО по возмещению (крайслер)
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") ИЛИ    //ПСО по контрактам (УАЗ)
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") ИЛИ    //Ремонт автомобилей для тест-драйва для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K       ") ИЛИ    //Сервисный клиентский заказ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("МИНОБ   ") ИЛИ    //Сервисный клиентский заказ (Министерства Обороны)
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") ИЛИ    //Сервисный клиентский заказ для ТТ
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000023") ИЛИ    //Страховой ремонт
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014") ИЛИ    //Субподряд
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000034")) Тогда    //Техническое обслуживание
			
			
			
			Сообщить("Данный тип ремонта - Платный. Для закрытия обратитесь к бухгалтеру.");
			Отказ=Истина;
		КонецЕсли;
		
		
		//Запрет ПСО на невыкупленные Авто
		//Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт И
		//	(Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") ИЛИ //ПСО для ТТ
		//	Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024") ИЛИ // ПСО по возмещению (крайслер)
		//	Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") ИЛИ  // ПСО по контрактам (УАЗ)
		//	Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1")) Тогда // ПСО, работы с парком новых автомобилей
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
		//	|	ОстаткиАвтомобилейОстаткиИОбороты.СтатусПартии КАК Статус
		//	|ИЗ
		//	|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, &Дата, , , Автомобиль = &Авто) КАК ОстаткиАвтомобилейОстаткиИОбороты";
		//	Запрос.УстановитьПараметр("Авто",Источник.Автомобиль);
		//	Запрос.УстановитьПараметр("Дата",Источник.ДатаЗакрытия);
		//	Результат = Запрос.Выполнить();
		//	Если Не Результат.Пустой() Тогда
		//		Выборка = Результат.Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			Статус = Выборка.Статус;
		//		КонецЦикла;
		//		Если Статус <> Перечисления.СтатусыПартий.ТоварКупленный Тогда
		//			Сообщить("Автомобиль не выкуплен. Закрытие невозможно!");
		//			Отказ=Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;	
		
		//Проверка таблицы распределения
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаспределениеМатериаловПоРаботамЗН.Номенклатура,
		|	РаспределениеМатериаловПоРаботамЗН.Работа
		|ИЗ
		|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
		|ГДЕ
		|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд";
		
		Запрос.УстановитьПараметр("ЗаказНаряд", Источник.Ссылка);
		
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			
			СтрИсточник = Источник.Работы.Найти(Результат.Работа,"Работа");
			Если СтрИсточник = Неопределено Тогда
				Сообщить("Неверно распределены запчасти в работе: "+Результат.Работа);
				Отказ = Истина;
			КонецЕсли;
			
			СтрИсточник = Источник.Товары.Найти(Результат.Номенклатура,"Номенклатура");
			Если СтрИсточник = Неопределено Тогда
				Сообщить("Неверно распределена запчасть "+Результат.Номенклатура+" в работе: "+Результат.Работа);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013") И 
			Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035") И 
			Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") Тогда	
			Для Каждого СтрТоваров Из Источник.Товары Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РаспределениеМатериаловПоРаботамЗН.Номенклатура
				|ИЗ
				|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
				|ГДЕ
				|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд
				|	И РаспределениеМатериаловПоРаботамЗН.Номенклатура = &Номенклатура";
				
				Запрос.УстановитьПараметр("ЗаказНаряд", Источник.Ссылка);
				Запрос.УстановитьПараметр("Номенклатура", СтрТоваров.Номенклатура);
				
				Результат = Запрос.Выполнить().Выбрать();
				
				Если Результат.Количество()=0 Тогда
					Сообщить("В заказ-наряде, есть нераспределенные запчасти, закрытие невозможно!");
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//Проверка хозяина авто
		Если НЕ РольДоступна("НеПроверятьВладельцаАвто") и Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035") Тогда 
			Хозяин = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Источник.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Хозяин);
			Если Хозяин <> Источник.Заказчик Тогда	
				сообщить("Заказчик не является Владельцем Автомобиля. Проведение невозможно. Измените Владельца в Автомобиле.");
				Отказ= Истина;
			КонецЕсли;
		КонецЕсли;
		
		//<<Павличенко 09.04.19. Перенесено выше
		//Проверка НДС для платных видов ремонта организации Техно-Темп
		//Если Источник.Организация.Код ="00001" И Источник.ВидРемонта.Код <> "G       " И Источник.ВидРемонта.ТипРемонта =перечисления.ТипыРемонта.Платный Тогда
		//	нетНДС = ложь;
		//	для каждого СтрЗапчасти из Источник.Товары цикл
		//		Если СтрЗапчасти.СтавкаНДС <> справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		//			нетНДС = Истина;
		//		КонецЕсли;
		//	конеццикла;
		//	для каждого СтрРаботы из Источник.Работы цикл
		//		Если СтрРаботы.СтавкаНДС <> справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
		//			нетНДС = Истина;
		//		КонецЕсли;
		//	конеццикла;
		//	Если  нетНДС тогда
		//		Отказ=Истина;
		//		Сообщить("Платные виды ремонта для организации Техно-Темп должны быть с НДС!");
		//	КонецЕсли;			
		//КонецЕсли;
		//>>Павличенко 09.04.19
		
	ИначеЕсли Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
		Если Источник.ДоговорВзаиморасчетов.ПроцентПредоплаты = 100 Тогда
			#Если Клиент Тогда
				Предупреждение("У контрагента установлена 100 % предоплата услуг! Проверьте взаиморасчеты на наличие задолженности!");
			#КонецЕсли
		КонецЕсли;
	ИначеЕсли Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
		Если Источник.ВидРемонта.Код = "АЗ000002" Тогда//Гарантия
			Источник.СписаниеТоваровПоСебестоимости = Истина;
			Источник.ЗаполнитьТоварыПоСебестоимости();
		КонецЕсли;
		
		Если Источник.ДатаОкончания = Дата(1,1,1) Тогда
			 Источник.ДатаОкончания= ТекущаяДата();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьЗначениеСкидки(Карточка,ДатаДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкидкиШапкиСрезПоследних.ЗначениеСкидки
	|ИЗ
	|	РегистрСведений.СкидкиШапки.СрезПоследних(&ДатаДокумента, ДисконтнаяКарта = &ДисконтнаяКарта) КАК СкидкиШапкиСрезПоследних";
	Запрос.УстановитьПараметр("ДисконтнаяКарта", Карточка);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 	
		Возврат Выборка.ЗначениеСкидки;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура СоздатьДокументСкидок(ДатаНачала,Скидка,ДискКарта,ЗначениеСкидки)
	
	Док = Документы.НазначениеСкидокШапки.СоздатьДокумент();
	Док.ОбработкаЗаполнения(Неопределено);
	Док.ДатаНачалаДействия = ДатаНачала;// дата начала скидки
	Док.ХозОперация=Справочники.ХозОперации.УстановкаСкидкиНаДокумент;	
	Док.Дата = ТекущаяДата();
	
	НоваяСтрока = Док.Скидки.Добавить();
	
	НоваяСТрока.Скидка = Скидка;// ссылка на тип скидки
	НоваяСтрока.ДисконтнаяКарта = ДискКарта;// ссылка на карту
	НоваяСтрока.ЗначениеСкидки = ЗначениеСкидки;//  числовое значение
	НоваяСтрока.СкидкаНаРаботы = Истина;
	НоваяСтрока.СкидкаНаТовары = Истина;
	НоваяСтрока.НачВремя = ДАТА(1,1,1); 
	НоваяСтрока.КонВремя = ДАТА(1,1,1,23,59,59);
	НоваяСтрока.ДниНедели = "1111111";	
	
	Попытка	
		Док.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
КонецПроцедуры

Процедура ТТ_ПередЗаписьюСчетаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//Источник = Документы.СчетНаОплату.НайтиПоНомеру("");
	//Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
	//	Если Источник.ДокументОснование.Метаданные().Имя = "ЗаказНаряд" Тогда
	//		Если Источник.ДокументОснование.ВидРЕмонта.Код <> "ЦБ000023" Тогда
	//			
	//			Запрос = Новый Запрос;
	//			Запрос.Текст = 
	//			"ВЫБРАТЬ
	//			|	СчетНаОплатуТовары.Номенклатура
	//			|ИЗ
	//			|	Документ.СчетНаОплату.Товары КАК СчетНаОплатуТовары
	//			|ГДЕ
	//			|	СчетНаОплатуТовары.Ссылка = &Ссылка
	//			|	И СчетНаОплатуТовары.Номенклатура.ВидНоменклатуры <> &ВидНоменклатуры";
	//			
	//			Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Услуга);
	//			Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	//			
	//			Результат = Запрос.Выполнить().Выбрать();
	//			Пока Результат.Следующий() Цикл
	//				Сообщить("Удалите из таблицы ТОВАРЫ "+Результат.Номенклатура);
	//				Отказ = ИСтина;
	//			КонецЦикла;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура ТТ_ПриЗаполненииСчетаОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	#Если Клиент Тогда
		Если РольДоступна("ПолныеПрава") Тогда
			Если Вопрос("Использовать стандартный механизм заполнения счета?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	Если ДанныеЗаполнения.Метаданные().Имя = "ЗаказНаряд" Тогда
		ЗН = ДанныеЗаполнения.Ссылка;
		//ЗН = Документы.ЗаказНаряд.НайтиПоНомеру("");
		
		Для Каждого СтрТоваров Из ЗН.Товары Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаспределениеМатериаловПоРаботамЗН.Номенклатура
			|ИЗ
			|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
			|ГДЕ
			|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд
			|	И РаспределениеМатериаловПоРаботамЗН.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("ЗаказНаряд", ЗН.Ссылка);
			Запрос.УстановитьПараметр("Номенклатура", СтрТоваров.Номенклатура);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Количество()=0 Тогда
				Сообщить("В заказ-наряде, есть нераспределнные запчасти, печать акта невозможна!");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		Источник.Товары.Очистить();
		Для Каждого СтрЗН ИЗ ЗН.Работы Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаспределениеМатериаловПоРаботамЗН.Номенклатура,
			|	РаспределениеМатериаловПоРаботамЗН.Количество
			|ИЗ
			|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
			|ГДЕ
			|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд
			|	И РаспределениеМатериаловПоРаботамЗН.Работа = &Работа";
			
			Запрос.УстановитьПараметр("ЗаказНаряд", ЗН);
			Запрос.УстановитьПараметр("Работа", СтрЗН.Работа);
			
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			СуммаЗапчасти = 0;
			СуммаСкидки = 0;
			СуммаЗапчастиБезСкидки=0;
			СуммаЗапчастиСоСкидкой=0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = ЗН.Товары.Найти(ВыборкаДетальныеЗаписи.Номенклатура, "Номенклатура");
				СуммаЗапчастиБезСкидки = СуммаЗапчастиБезСкидки + Стр.Сумма;
				СуммаЗапчастиСоСкидкой = СуммаЗапчастиСоСкидкой + Стр.СуммаВсего;
				СуммаСкидки = СуммаСкидки + Стр.СуммаСкидки;
			КонецЦикла;
			
			НоваяСтрока=Источник.Товары.Добавить();
			НоваяСтрока.Номенклатура				= СтрЗН.Работа;
			НоваяСтрока.ЕдиницаИзмерения			= СтрЗН.Нормочас;
			НоваяСтрока.Количество					= 1;
			НоваяСтрока.Коэффициент					= 1;
			НоваяСтрока.СуммаСкидки					= СтрЗН.СуммаСкидки+СуммаСкидки;
			НоваяСтрока.ПроцентСкидки				= СтрЗН.ПроцентСкидки;
			НоваяСтрока.Цена						= СтрЗН.Сумма + СуммаЗапчастиБезСкидки;
			НоваяСтрока.Сумма						= СтрЗН.СуммаВсего + СуммаЗапчастиБезСкидки;

			НоваяСтрока.СтавкаНДС					= СтрЗН.СтавкаНДС;
			НоваяСтрока.СуммаНДС					= СтрЗН.СуммаНДС;
			НоваяСтрока.СуммаВсего                  = СуммаЗапчастиСоСкидкой + СтрЗН.СуммаВсего;
		КонецЦИкла;
		Сообщить("Заполнено на основании "+ЗН);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ТТ_ПриВводеНаОснованииЗНОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//ДанныеЗаполнения = Документы.ЗаказНаряд.НайтиПоНомеру();
	//Источник = Документы.ЗаказНаряд.НайтиПоНомеру();
	Если ДанныеЗаполнения = Неопределено Тогда Возврат; КонецЕсли;
	
	Если ДанныеЗаполнения.Организация.Код = "ЦБ000001" Тогда
		Источник.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Источник.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000001");
		Источник.Заказчик = Справочники.Контрагенты.НайтиПоКоду("ЦБ000089");
		
		Если ДанныеЗаполнения.ВидРемонта.Код = "K       " Тогда //ПСО
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("I1      ");
		ИначеЕсли ДанныеЗаполнения.ВидРемонта.Код = "00000001" Тогда //Доп оборудование
			Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
		КонецЕсли;
		
		Источник.Цех = Справочники.Цеха.НайтиПоКоду("ЦБ000002");
		Источник.Товары.Очистить();
		
		ЗН = ДанныеЗаполнения.Ссылка;
		
		Для Каждого СтрТоваров Из ЗН.Товары Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаспределениеМатериаловПоРаботамЗН.Номенклатура
			|ИЗ
			|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
			|ГДЕ
			|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд
			|	И РаспределениеМатериаловПоРаботамЗН.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("ЗаказНаряд", ЗН.Ссылка);
			Запрос.УстановитьПараметр("Номенклатура", СтрТоваров.Номенклатура);
			
			Результат = Запрос.Выполнить().Выбрать();
			
			Если Результат.Количество()=0 Тогда
				Сообщить("В заказ-наряде, есть нераспределнные запчасти, ввод на основании невозможен!");
				Отказ = ИСТИНА;
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		
		
		Для Каждого СтрЗН ИЗ ЗН.Работы Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаспределениеМатериаловПоРаботамЗН.Номенклатура
			|ИЗ
			|	РегистрСведений.РаспределениеМатериаловПоРаботамЗН КАК РаспределениеМатериаловПоРаботамЗН
			|ГДЕ
			|	РаспределениеМатериаловПоРаботамЗН.ЗаказНаряд = &ЗаказНаряд
			|	И РаспределениеМатериаловПоРаботамЗН.Работа = &Работа";
			
			Запрос.УстановитьПараметр("ЗаказНаряд", ЗН);
			Запрос.УстановитьПараметр("Работа", СтрЗН.Работа);
			
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выбрать();
			СуммаЗапчасти=0;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Стр = ЗН.Товары.Найти(ВыборкаДетальныеЗаписи.Номенклатура, "Номенклатура");
				СуммаЗапчасти = СуммаЗапчасти+Стр.СуммаВсего;
			КонецЦикла;
			
			СтрокаРабот = Источник.Работы.Найти(СтрЗН.Работа, "Работа");
			
			СтрокаРабот.Сумма		= СтрЗН.Сумма + СуммаЗапчасти;
			СтрокаРабот.Количество	= СтрЗН.Количество;
			СтрокаРабот.Цена		= СтрокаРабот.Сумма/СтрокаРабот.Количество;
			СтрокаРабот.СуммаВсего  = СтрокаРабот.Сумма;
		КонецЦИкла;
		Сообщить("Заполнено на основании "+ЗН);
		
	КонецЕсли;
КонецПроцедуры

Процедура ТТ_ПроверкаНаНаличиеРодителяПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Источник.Родитель) И Не Источник.ЭтоГруппа и НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		
		#Если Клиент Тогда
			ФормаВыбора = Справочники[Источник.Метаданные().Имя].ПолучитьФормуВыбораГруппы(); 
			ФормаВыбора.Заголовок	= "Выберите группу!";
			Источник.Родитель = ФормаВыбора.ОткрытьМодально();  
		#КонецЕсли
		
		Если Не ЗначениеЗаполнено(Источник.Родитель)  Тогда
			Если ТипЗнч(Источник)  = Тип("СправочникОбъект.Автомобили") Тогда						
				Если ЗначениеЗаполнено(Источник.VIN) Тогда				
					Отказ = Истина;
				КонецЕсли;
			Иначе			
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Отказ Тогда
			Сообщить("Операция не выполнена. Группа элемента не может быть пустой.");
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ТТ_ПриЗаписиВыгрузкаБППриЗаписи(Источник, Отказ) Экспорт
#Если Клиент Тогда
	//Если РольДоступна("ВосстПослед") Тогда 		
	
	//Проверки на соответствие организации
	Попытка
		Если Источник.ПодразделениеКомпании.Организация <> Источник.Организация Тогда      //Подразделение
			Сообщить("Организация Подразделения не соответствует организации документа!");
			Отказ=Истина;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	Попытка
		Если не ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда  
			Если не ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда  // Цех
				Если не ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЧекНаОплату") Тогда  // Цех
					Если не ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Выписка") Тогда  // Цех
					    //БИЗТЕХ КОВАЛЬ 30.10.2024 ++
						Если не ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИзменениеЦен") Тогда  // Цех
						//-	
							Если НЕ обЗначениеНеЗаполнено(Источник.СкладКомпании) И Источник.СкладКомпании.Организация <> Источник.Организация Тогда     //Склад
								Сообщить("Организация Склада не соответствует организации документа!");
								Отказ=Истина;				
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	Попытка
		Если НЕ обЗначениеНеЗаполнено(Источник.ДоговорВзаиморасчетов.Организация) И Источник.ДоговорВзаиморасчетов.Организация <> Источник.Организация Тогда  //Договор Взаиморасчетов
			Сообщить("Организация Договора взаиморасчетов не соответствует организации документа!");
			Отказ=Истина;				
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваровВПроизводство")   // Цех
		ИЛИ ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") И  Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт тогда			
		Если Источник.Цех.Организация <> Источник.Организация Тогда 
			Сообщить("Организация Цеха не соответствует организации документа!");
			Отказ=Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") И  Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт  Тогда
		Для каждого СтрокаТоваров из Источник.Товары Цикл
			Если СтрокаТоваров.СкладКомпании.Организация <> Источник.Организация Тогда    // ТЧ Товары в Заказ-Наряде
				Сообщить("Склад в табличной части Товары не соотвествует организации в заказ-наряде!");
				Отказ=Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
#КонецЕсли

	////КонецЕсли;	
	//
	//Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") тогда
	//	если   Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт и не Источник.ДатаЗакрытия = '00010101000000' тогда 
	//		ТекДата = ТекущаяДата();
	//		
	//		НаборЗаписей = РегистрыСведений.ВыгрузкаДокументовВБП.СоздатьНаборЗаписей();
	//		
	//		НаборЗаписей.Отбор.Документ.Установить(Источник.Ссылка);
	//		НаборЗаписей.Отбор.Период.Установить(ТекДата);
	//		НаборЗаписей.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
	//		
	//		НоваяЗапись = НаборЗаписей.Добавить();
	//		НоваяЗапись.Документ = Источник.Ссылка;
	//		НоваяЗапись.Период = ТекДата;
	//		НоваяЗапись.Автор = ПараметрыСеанса.Пользователь;
	//		НоваяЗапись.Выгружалось = Ложь;
	//		НаборЗаписей.Записать();
	//	конецесли;			
	//Иначе
	//	ТекДата = ТекущаяДата();
	//	
	//	НаборЗаписей = РегистрыСведений.ВыгрузкаДокументовВБП.СоздатьНаборЗаписей();
	//	
	//	НаборЗаписей.Отбор.Документ.Установить(Источник.Ссылка);
	//	НаборЗаписей.Отбор.Период.Установить(ТекДата);
	//	НаборЗаписей.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.Документ = Источник.Ссылка;
	//	НоваяЗапись.Период = ТекДата;
	//	НоваяЗапись.Автор = ПараметрыСеанса.Пользователь;
	//	НоваяЗапись.Выгружалось = Ложь;
	//	НаборЗаписей.Записать();
	//конецесли;		
	//	

КонецПроцедуры

Процедура ТТ_ОценкаЛояльностиКлиентаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	#Если Клиент Тогда
	//---------------------allgk--------------------//
	// по заказу Шовикова
	Возврат;
	//---------------------allgk--------------------//
		
		Если РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("ВосстПослед") ИЛИ обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь, ПланыВидовХарактеристик.ПраваИНастройки.НайтиПоКоду("75008"), Источник) Тогда
			Возврат;
		КонецЕсли;
		
		//Если документ внутренний, окно не показываем	
		Если ТипЗнч(Источник)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
			Если ТипЗнч(Источник.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Если Источник.Контрагент.Код = "ЦБ000089" ИЛИ Источник.Контрагент.Код = "ЦБ001314" Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
		
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
			
			Контрагент = Источник.Заказчик;
			ВыполнятьЗапись = Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РабочийЛист") Тогда
			
			Контрагент = Источник.Контрагент;
			ВыполнятьЗапись = Источник.Статус = Справочники.СтатусыРабочегоЛиста.Продажа;
			
			Если ВыполнятьЗапись И Не ТипЗнч(Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
				Сообщить("Операция не выполнена. Клиент не введен в справочник ""Контрагенты""");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Опрос") Тогда
			
			Контрагент = Источник.ОпрашиваемоеЛицо;
			ВыполнятьЗапись = Источник.ОпросЗавершен;
			
		ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЖалобаКлиента") Тогда
			
			Контрагент = Источник.Контрагент;
			ВыполнятьЗапись = Источник.Состояние = Перечисления.СостояниеЖалобКлиентов.Закрыта;
			
		КонецЕсли;
		
		Если Не ВыполнятьЗапись Тогда
			Возврат;
		КонецЕсли;
		
		ОбработкаОЛК =  Обработки.ОценкаЛояльностиКлиентов.Создать();
		
		ОбработкаОЛК.Контрагент = Контрагент;
		ОбработкаОЛК.Документ = Источник.Ссылка;
		ОбработкаОЛК.Автор = ПараметрыСеанса.Пользователь;
		
		ТекущаяДата = ТекущаяДата();
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ОценкаЛояльностиКлиентовСрезПоследних.Контрагент
		|ИЗ
		|	РегистрСведений.ОценкаЛояльностиКлиентов.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Документ = &Документ) КАК ОценкаЛояльностиКлиентовСрезПоследних";
		
		Запрос.УстановитьПараметр("Контрагент", ОбработкаОЛК.Контрагент);
		Запрос.УстановитьПараметр("Документ", ОбработкаОЛК.Документ);
		
		Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
			ФормаОЛК = ОбработкаОЛК.ПолучитьФорму();
			ФормаОЛК.ОткрытьМодально();
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ТТ_ПроверкаЗаполненияСтатьиДДСУпрОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.Дата < Дата(2013, 8, 30) Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
	НаборЗаписей.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("02043"));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 или НаборЗаписей[0].Значение = Неопределено Тогда
			
	//Получение Статьи ДДС упр
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗначенияСвойствОбъектов.Значение
	//|ИЗ
	//|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	//|ГДЕ
	//|	ЗначенияСвойствОбъектов.Объект.Ссылка = &Ссылка
	//|	И НЕ ЗначенияСвойствОбъектов.Значение ЕСТЬ NULL 
	//|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	//
	//Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	//Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("02043"));
	
	//Результат = Запрос.Выполнить();
		Сообщить("Необходимо указать Статью ДДС управленческого учета. Для этого сначала документ нужно записать, затем в Панели свойств указать Статью ДДС управленческого учета и после этого провести документ.");
		Отказ = Истина;
	Иначе
		
		Если РольДоступна("ВосстПослед") Тогда
			Возврат;
		КонецЕСли;	
		
		//*Проверка Статей на вид движения документа*_anton    
		
		//ВыборкаРезультат = Результат.Выбрать();
		
		//Пока ВыборкаРезультат.Следующий()Цикл
			СтатьяДДССсылка=НаборЗаписей[0].Значение;
		//КонецЦикла;
		
		//Получаем массив родителей статьи
		//МассивРодителей = Новый Массив;
		//
		//Родитель = СтатьяДДССсылка.Родитель;
		//
		//Пока Не Родитель.Пустая() Цикл 
		//	МассивРодителей.Добавить(Родитель);
		//	Родитель = Родитель.Родитель;	
		//КонецЦикла;
		
		//ГруппаПриходныхСтатей = Справочники.СтатьиДДСУпрЗначСв.НайтиПоКоду("ПД0000002");
		//ГруппаРасходныхСтатей = Справочники.СтатьиДДСУпрЗначСв.НайтиПоКоду("РД0000002"); 
		//ГруппаВыбраннойСтатьи = МассивРодителей[ МассивРодителей.Количество() - 1 ];
		ГруппаПриходныхСтатей = "ПД";
		ГруппаРасходныхСтатей = "РД"; 
		ГруппаВыбраннойСтатьи = Лев(СокрЛП(СтатьяДДССсылка.Код),2);

		//Приходный кассовый ордер	
		Если Источник.Ссылка.Метаданные().Имя = "ПриходныйКассовыйОрдер" Тогда 
			
			Если ГруппаВыбраннойСтатьи  <> ГруппаПриходныхСтатей Тогда
				Сообщить("Вид статьи ДДС (Приход/Расход) не соответствует типу документа");
				Отказ = Истина;	
			КонецЕсли;
			
			//Расходный кассовый ордер		
		ИначеЕсли Источник.Ссылка.Метаданные().Имя = "РасходныйКассовыйОрдер" Тогда 
			
			Если ГруппаВыбраннойСтатьи  <> ГруппаРасходныхСтатей Тогда
				Сообщить("Вид статьи ДДС (Приход/Расход) не соответствует типу документа");
				Отказ = Истина;		
			КонецЕсли;
			
			//Банковская Выписка
		ИначеЕсли Источник.Ссылка.Метаданные().Имя = "Выписка" Тогда
			
			Если Источник.Ссылка.СуммаДокументаПриход > 0 И ГруппаВыбраннойСтатьи  <> ГруппаПриходныхСтатей Тогда
				Сообщить("Вид статьи ДДС (Приход/Расход) не соответствует типу документа");
				Отказ = Истина;	
			КонецЕсли;
			
			Если Источник.Ссылка.СуммаДокументаРасход > 0 И ГруппаВыбраннойСтатьи  <> ГруппаРасходныхСтатей Тогда
				Сообщить("Вид статьи ДДС (Приход/Расход) не соответствует типу документа");
				Отказ = Истина;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	//*Проверка Статей на вид движения документа* Конец
	
КонецПроцедуры

Процедура ТТ_ПроверкаОстатковПоОрганизацииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.Номенклатура,
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&МоментВремени,
	|			Номенклатура В (&Номенклатура)
	|				И СкладКомпании.Организация = &Организация
	|				И Номенклатура.ТипНоменклатуры <> &Услуга) КАК ПартииТоваровКомпанииОстатки";
	
	Запрос.УстановитьПараметр("МоментВремени", Источник.МоментВремени());
	Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("Организация", Источник.Организация);
	Запрос.УстановитьПараметр("Услуга", Справочники.ТипыНоменклатуры.Услуга);
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	НеХватаетОстатков = Ложь;
	Для Каждого СтрДок Из Источник.Товары Цикл 
		Если СтрДок.Номенклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Услуга Тогда
			Продолжить;
		КонецЕсли;	
		НайденнаяСтрока = ТаблицаОстатков.Найти(СтрДок.Номенклатура, "Номенклатура");		
		Если НайденнаяСтрока = Неопределено Тогда
			Сообщить("Товара """ + СтрДок.Номенклатура + """ (строка таблицы: " + СтрДок.НомерСтроки + ") нет на остатках организации " + Источник.Организация);				
			НеХватаетОстатков = Истина;
		КонецЕсли;	
	КонецЦикла;		
	
	//<<Павличенко 30.11.17
	//корректнее так, т.к. проверка соответствия договоров-организации уже установила отказ в истину, а эта разрешила проведение, что неверно
	//Отказ = НеХватаетОстатков;
	Отказ = ?(Отказ = Ложь, НеХватаетОстатков, Отказ);
	//>>Павличенко 30.11.17
КонецПроцедуры

Процедура ТТ_ЗаполнениеСвойствПриВводеНаОснованииОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Документ
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Источник.Записать();	
	
	ТекущееСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02009");	
	Запрос.УстановитьПараметр("Документ", Источник.ДокументОснование.Ссылка);
	Запрос.УстановитьПараметр("Свойство", ТекущееСвойство);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	СтатьяДДСУпр = ВыборкаДетальныеЗаписи.Значение;
	
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей(); 
	
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка); 
	НаборЗаписей.Отбор.Свойство.Установить(ТекущееСвойство); 
	
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.Объект = Источник.Ссылка; 
	НоваяЗапись.Свойство = ТекущееСвойство; 
	НоваяЗапись.Значение = СтатьяДДСУпр; 
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры

Процедура ТТ_ПроверкаОрганизацииПеремещениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	#Если Клиент Тогда
	Если РольДоступна("ПолныеПрава") И НЕ РольДоступна("ВосстПослед") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.СкладКомпании.Организация <> Источник.СкладПолучатель.Организация ИЛИ
		Источник.СкладКомпании.Организация <> Источник.Организация Тогда 
		Отказ = Истина;	
		Сообщить("Реквизит ""Организация"" документа должен совпадать с реквизитами ""Организация"" выбранных складов.");	
	КонецЕсли;	
		
	Если Источник.Товары.Количество() = 0 Тогда
		Отказ=Истина;
		Сообщить("Невозможно провести пустое перемещение в производство!");
	КонецЕсли;
	
	Если Источник.СкладКомпании = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000016")  //Товары в пути
		И НЕ ( Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000015")   //склад инструментов
		ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000001") ) Тогда  // Основной склад запчастей
		
		Отказ = Истина;	
		Сообщить("Нельзя перемещать товары со склада Товары в пути напрямую на указанный склад получатель !");	
	КонецЕсли;	
	
	Если Источник.СкладКомпании = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000085")  //Товар в пути ТАС
		И НЕ (( Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000079") ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000111"))
		//Основной склад запчастей ТАС     //Склад запчастей ТАС возврат поставщику

		ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000099")     //Основной склад оборудования ГАЗ
		ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000086")     //Основной склад инструментов ТАС
		ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000084")     //Основной склад запчастей ГАЗ гарантия
		//ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000111")     //Склад запчастей ТАС возврат поставщику
		ИЛИ Источник.СкладПолучатель = справочники.СкладыКомпании.НайтиПоКоду("ЦБ000083") ) Тогда  // Основной склад запчастей ГАЗ
		
		Отказ = Истина;	
		Сообщить("Нельзя перемещать товары со склада Товары в пути ТАС напрямую на указанный склад получатель !");	
	КонецЕсли;	
	
#КонецЕсли	
	
КонецПроцедуры

Процедура ТТ_ПроверкаНеЗакрытыхЗНОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
#Если Клиент Тогда
	
	//Отказ незакрыт ЗН 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Номер,
	|	ЗаказНаряд.Дата,
	|	ЗаказНаряд.Автомобиль
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.Состояние <> &Отклонен
	|	И ЗаказНаряд.Автомобиль В(&Автомобили)
	|	И (ЗаказНаряд.ВидРемонта В (&ВидРемонта))
	|	И ЗаказНаряд.ДатаСоздания <= &РеализацияДата
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	ВидРемонта = Новый СписокЗначений;	
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000013")); //Восстановление товарных а/м
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026")); //Восстановление товарных а/м для ТТ
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("00000002")); //Комплектация автомобиля
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020")); //Комплектация автомобиля П
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019")); //Комплектация автомобиля_К
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("I2")); 	  //Мойка автомобилей для тест-драйв
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029")); //Мойка автомобилей для тест-драйв для ТТ
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017")); //Мойка автомобиля
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027")); //ПСО для ТТ
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("I1")); 	  //ПСО, работы с парком новых автомобилей
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000025")); //Ремонт автомобилей для тест-драйва
	ВидРемонта.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028")); //Ремонт автомобилей для тест-драйва для ТТ
	
	Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("Отклонен", Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002"));
	//Запрос.УстановитьПараметр("КонтрINT_SERV", Справочники.Контрагенты.НайтиПоКоду("ЦБ000089"));
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	Запрос.УстановитьПараметр("РеализацияДата", Источник.Дата);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ПервыйРаз = Истина;
	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПервыйРаз Тогда 
			ТекстСообщения = "Есть незакрытые Заказ-наряды по автомобилю "+ВыборкаДетальныеЗаписи.Автомобиль+" : ";
			ПервыйРаз = Ложь;	
		КонецЕсли;	
		Отказ = Истина;
		ТекстСообщения = ТекстСообщения+"
		|Заказ-наряд №" + ВыборкаДетальныеЗаписи.Номер + " от " + Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=Д");				
	КонецЦикла;
	
	Если НЕ ПервыйРаз Тогда
		Предупреждение(ТекстСообщения);
		Сообщить(ТекстСообщения);
	КонецЕсли;	
	
	//Оповещение о незакрытых
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Номер,
	|	ЗаказНаряд.Дата,
	|	ЗаказНаряд.Автомобиль
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.Состояние <> &Отклонен
	|	И ЗаказНаряд.Автомобиль В(&Автомобили)
	//|	И ЗаказНаряд.Заказчик <> &КонтрINT_SERV
	|	И ЗаказНаряд.ДатаСоздания <= &РеализацияДата
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	ВидРемонтаГарантия = Новый СписокЗначений;	
	
	Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("Отклонен", Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002"));
	//Запрос.УстановитьПараметр("КонтрINT_SERV", Справочники.Контрагенты.НайтиПоКоду("ЦБ000089"));
	Запрос.УстановитьПараметр("РеализацияДата", Источник.Дата);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ПервыйРаз = Истина;
	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПервыйРаз Тогда 
			ТекстСообщения = "Есть незакрытые Заказ-наряды по автомобилю "+ВыборкаДетальныеЗаписи.Автомобиль+" : ";
			ПервыйРаз = Ложь;	
		КонецЕсли;	
		ТекстСообщения = ТекстСообщения+"
		|Заказ-наряд №" + ВыборкаДетальныеЗаписи.Номер + " от " + Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=Д");				
	КонецЦикла;
	
	Если НЕ ПервыйРаз Тогда
		Предупреждение(ТекстСообщения);
	КонецЕсли;	
	
	//--------------------------------
	Если РольДоступна("ВосстПослед") Тогда
		Возврат;
	КонецЕсли;
	
	
	//Проверка на незакрытую допку для внутренних контрагентов
		
	ВнутрКонтр = Новый СписокЗначений;	
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ000089")) ;//Intserv
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ003748")) ;//Intserv ИП
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ001314")) ;//Техно-Темп
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Номер,
	|	ЗаказНаряд.Дата,
	|	ЗаказНаряд.Автомобиль
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|	И ЗаказНаряд.Состояние <> &Отклонен
	|	И ЗаказНаряд.Автомобиль В(&Автомобили)
	|	И ЗаказНаряд.Заказчик В (&ВнутрКонтр)
	|	И ЗаказНаряд.ВидРемонта = &ВидРемонта
	|	И ЗаказНаряд.ДатаСоздания <= &РеализацияДата
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	ВидРемонтаГарантия = Новый СписокЗначений;	
	
	Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("Отклонен", Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002"));
	Запрос.УстановитьПараметр("ВидРемонта",Справочники.ВидыРемонта.ДополнительноеОборудование);
	Запрос.УстановитьПараметр("ВнутрКонтр",ВнутрКонтр );

	Запрос.УстановитьПараметр("РеализацияДата", Источник.Дата);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ПервыйРаз = Истина;
	ТекстСообщения = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ПервыйРаз Тогда 
			ТекстСообщения = "Есть незакрытые Заказ-наряды по автомобилю "+ВыборкаДетальныеЗаписи.Автомобиль+" : ";
			ПервыйРаз = Ложь;	
		КонецЕсли;	
		ТекстСообщения = ТекстСообщения+"
		|Заказ-наряд №" + ВыборкаДетальныеЗаписи.Номер + " от " + Формат(ВыборкаДетальныеЗаписи.Дата, "ДЛФ=Д");				
	КонецЦикла;
	
	Если НЕ ПервыйРаз Тогда
		Предупреждение(ТекстСообщения);
		Отказ=Истина;
	КонецЕсли;	

	
	
	
	// Проверка на НеОплаченные Заказ-наряды	
	ВидРемонтаИскл = Новый СписокЗначений;	
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("G"));		  // Гарантийный заказ
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000008")); // Гарантия диллера
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032")); // Гарантия диллера для ТТ 
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000009")); // Гарантия салона
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ГЦ000003")); // Гарантия сервиса
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027")); // ПСО для ТТ	
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("I1      ")); // ПСО 
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("I2      ")); // Мойка автомобилей для тест-драйва
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029")); // Мойка автомобилей для тест-драйва для ТТ 
	//ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030")); // Мойка автомобилей для ТТ
	//ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017")); // мойка
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033")); //Доп обор П
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.ДополнительноеОборудование); // Доп обор
	ВидРемонтаИскл.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035")); // Возмещение ТУ
	
	ВнутрКонтр = Новый СписокЗначений;	
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ000089")) ;//Intserv
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ003748")) ;//Intserv ИП
	ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ001314")) ;//Техно-Темп
	//ВнутрКонтр.Добавить(Справочники.Контрагенты.НайтиПоКоду("ЦБ211338")) ;//ТАС	

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.Состояние <> &Отклонен
	|	И ЗаказНаряд.Автомобиль В(&Автомобили)
	|	И ЗаказНаряд.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ДополнительноеОборудование)
	|	И НЕ ЗаказНаряд.ВидРемонта В (&ВидРемонтаГарантия)
	|	И НЕ ЗаказНаряд.Заказчик В (&ВнутрКонтр) 
	|	И ЗаказНаряд.ДатаСоздания <= &РеализацияДата
	|	И НЕ ЗаказНаряд.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("Отклонен", Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002"));
	Запрос.УстановитьПараметр("ВнутрКонтр",ВнутрКонтр );
	Запрос.УстановитьПараметр("ВидРемонтаГарантия", ВидРемонтаИскл);
	Запрос.УстановитьПараметр("РеализацияДата", Источник.Дата);
		
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ПервыйРаз = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Подзапрос=Новый Запрос;
		Подзапрос.Текст ="ВЫБРАТЬ
						 |	ВзаиморасчетыКомпании.Регистратор
						 |ИЗ
						 |	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
						 |ГДЕ
						 |	ВзаиморасчетыКомпании.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.расход)
						 |	И ВзаиморасчетыКомпании.Сделка = &сделка" ;
		Подзапрос.УстановитьПараметр("сделка",ВыборкаДетальныеЗаписи.Ссылка);
		ВыборкаПодзапрос = Подзапрос.Выполнить().Выбрать();
		Если ВыборкаПодзапрос.Количество()= 0 Тогда //нет оплаты!		
			Если ПервыйРаз Тогда 
				Сообщить("Есть неоплаченные Заказ-наряды по этому автомобилю:");
				ПервыйРаз = Ложь;	
			КонецЕсли;	
			//misha убрать
			Отказ = Ложь;
			Сообщить("Заказ-наряд №" + ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	
#КонецЕсли	
КонецПроцедуры

Процедура ТТ_ДопРаходыНаАвтоОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ДатаЗакрытия <= Дата(2013, 11, 1) Тогда 
		Возврат;	
	КонецЕсли;	
	
	//Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт И
	//	Источник.ДатаЗакрытия >= Дата(2015,11,1) И
	//	Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035") Тогда //  Возмещение ТУ     //Создаем поступление субподряд
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПоступлениеТоваров.Ссылка
	//	|ИЗ
	//	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	//	|ГДЕ
	//	|	ПоступлениеТоваров.ДокументОснование = &ЗН";
	//	
	//	Запрос.УстановитьПараметр("ЗН", Источник.Ссылка);
	//	
	//	Результат = Запрос.Выполнить();
	//	
	//	Если Результат.Пустой() Тогда
	//		//Создаем поступление субподряд
	//		Док = документы.ПоступлениеТоваров.СоздатьДокумент();
	//		Док.ХозОперация=справочники.ХозОперации.УслугиПоСубподряду;
	//		//Док.ДокументОснование=Источник.Ссылка;
	//		док.Организация = Справочники.Организации.ОсновнаяОрганизация;	
	//		док.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;	
	//		Док.ВхДокНомер=Источник.Номер;
	//		Док.ВхДокДата=Источник.ДатаЗакрытия;
	//		
	//		Если Источник.Организация = Справочники.Организации.НайтиПоКоду("ТАС00001") Тогда // Темп Авто Сервис
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ211338");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоНаименованию("договор ТО и ремонт автомобилей №29 от 10.09.13",,Док.Контрагент);
	//		ИначеЕсли Источник.Организация = Справочники.Организации.НайтиПоКоду("ИПК00001") Тогда // Кунова ИП
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоНаименованию("договор оказания услуг 19.12.2011",,Док.Контрагент);
	//		Иначе
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ007331");	
	//		КонецЕсли;		
	//		Док.ОбработкаРеквизита("Контрагент");
	//		
	//		Док.Дата=Источник.ДатаЗакрытия;
	//		
	//		СтрокаРабот= Док.Товары.Добавить();
	//		СтрокаРабот.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("ЦБ023873");  //Восстановит. работы
	//		Док.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРабот);			
	//		СтрокаРабот.СтавкаНДС=справочники.СтавкиНДС.БезНДС;
	//		СтрокаРабот.Цена=Источник.СуммаРаботДокумента;
	//		Док.ОбработкаРеквизита("Товары.Цена", СтрокаРабот );
	//		СтрокаРабот.Коэффициент=1;
	//		СтрокаРабот.СуммаВсего= Источник.СуммаДокумента;
	//		СтрокаРабот.ЗаказНаряд=Источник.Ссылка;
	//		
	//		Док.Записать(РежимЗаписиДокумента.Проведение);
	//		Сообщить("Создан документ поступление услуг(субподряд): "+Док.Ссылка);
	//		Возврат;  
	//	Иначе
	//		Выборка = результат.Выбрать();
	//		Выборка.Следующий();
	//		
	//		Док = Выборка.Ссылка;
	//		Док = Док.ПолучитьОбъект();
	//		Док.ВхДокНомер=Источник.Номер;
	//		Док.ВхДокДата=Источник.ДатаЗакрытия;

	//		Док.Товары.Очистить();
	//		
	//		Если Источник.Организация = Справочники.Организации.НайтиПоКоду("ТАС00001") Тогда // Темп Авто Сервис
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ211338");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоНаименованию("договор ТО и ремонт автомобилей №29 от 10.09.13",,Док.Контрагент);
	//		ИначеЕсли Источник.Организация = Справочники.Организации.НайтиПоКоду("ИПК00001") Тогда // Кунова ИП
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоНаименованию("договор оказания услуг 19.12.2011",,Док.Контрагент);
	//		Иначе
	//			Док.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	//			Док.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ007331");	
	//		КонецЕсли;
	//		
	//		Док.ОбработкаРеквизита("Контрагент");
	//		
	//		СтрокаРабот= Док.Товары.Добавить();
	//		СтрокаРабот.Номенклатура=Справочники.Номенклатура.НайтиПоКоду("ЦБ023873");  //Восстановит. работы
	//		Док.ОбработкаРеквизита("Товары.Номенклатура", СтрокаРабот );
	//		СтрокаРабот.СтавкаНДС=справочники.СтавкиНДС.БезНДС;
	//		СтрокаРабот.Цена=Источник.СуммаРаботДокумента;
	//		Док.ОбработкаРеквизита("Товары.Цена", СтрокаРабот);
	//		СтрокаРабот.Коэффициент=1;
	//		СтрокаРабот.СуммаВсего= Источник.СуммаДокумента;			
	//		СтрокаРабот.ЗаказНаряд=Источник.Ссылка;
	//		
	//		Док.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//		Сообщить("Обновлен документ поступление услуг(субподряд): "+Док.Ссылка);
	//		
	//		Возврат;  
	//	КонецЕсли;
	//КонецЕсли;	
	
	Запрос = Новый Запрос;                                       
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеДопРасходовНаАвтомобили.Ссылка КАК ДопРасход
	|ИЗ
	|	Документ.ПоступлениеДопРасходовНаАвтомобили КАК ПоступлениеДопРасходовНаАвтомобили
	|ГДЕ
	|	ПоступлениеДопРасходовНаАвтомобили.ДокументОснование = &ЗаказНаряд
	|	И НЕ ПоступлениеДопРасходовНаАвтомобили.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗаказНаряд", Источник.Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт
		И Источник.Заказчик = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314")  
		И (
		 Источник.ВидРемонта = Справочники.ВидыРемонта.ДополнительноеОборудование ИЛИ // Дополнительное оборудование
	     Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("K") ИЛИ // Сервисный клиентский заказ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000026") ИЛИ // Восстановление товарных а/м для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000029") ИЛИ // Мойка автомобилей для тест-драйва для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000030") ИЛИ // Мойка автомобилей для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") ИЛИ // ПСО для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000028") ИЛИ // Ремонт автомобилей для тест-драйва для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000031") ИЛИ // Сервисный клиентский заказ для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") ИЛИ // Гарантия диллера для ТТ
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033") ИЛИ // Доп оборудование П
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021") ИЛИ  // ПСО по контрактам УАЗ 
		 Источник.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000036") )  // Акция для ТТ 
		Тогда 
		
		
		//проверяем, может это тест-драйв автомобиль
		ЗапросТД = Новый Запрос;
		ЗапросТД.Текст = 
		"ВЫБРАТЬ
		|	АвтомобилиДляТестДрайваОстатки.Автомобиль
		|ИЗ
		|	РегистрНакопления.АвтомобилиДляТестДрайва.Остатки(&Период, Автомобиль = &Автомобиль) КАК АвтомобилиДляТестДрайваОстатки";
		
		ЗапросТД.УстановитьПараметр("Автомобиль", Источник.Автомобиль);
		ЗапросТД.УстановитьПараметр("Период", Источник.ДатаЗакрытия);
		
		РезультатТД = ЗапросТД.Выполнить();
		АвтомобильТестДрайв = Ложь;
		Если НЕ РезультатТД.Пустой() Тогда 
			АвтомобильТестДрайв = Истина;					
		КонецЕсли;	
		
		//Проверяем, есть ли на остатках этот автомобиль
		Если Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000035")  
			И НЕ РольДоступна(Метаданные.Роли.ОтключПроверкаАвтоЗН) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОстаткиАвтомобилейОстатки.Автомобиль,
			|	ОстаткиАвтомобилейОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Период, Автомобиль = &Автомобиль) КАК ОстаткиАвтомобилейОстатки";
			
			Запрос.УстановитьПараметр("Автомобиль", Источник.Автомобиль);
			Запрос.УстановитьПараметр("Период", Источник.ДатаЗакрытия);
			
			РезультатОст = Запрос.Выполнить();
			Если РезультатОст.Пустой() И 
				Источник.ВидРемонта <> Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000032") И // Гарантия диллера для ТТ 
				НЕ АвтомобильТестДрайв
				Тогда 
				Сообщить("Автомобиля " + Источник.Автомобиль + " нет на остатках!");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		// ***		
		
		Если Результат.Пустой() Тогда 
			ДопРасход = Документы.ПоступлениеДопРасходовНаАвтомобили.СоздатьДокумент();
			НовыйДок = Истина;
			ДопРасход.ОбработкаЗаполнения(Источник.Ссылка);
			ДопРасход.УстановитьНовыйНомер();
		Иначе 
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ДопРасходСсылка = Выборка.ДопРасход;
			ДопРасход = ДопРасходСсылка.ПолучитьОбъект();
			НовыйДок = Ложь;
			ДопРасход.ОбработкаЗаполнения(Источник.Ссылка);
		КонецЕсли;	
		
 		ДопРасход.Записать(РежимЗаписиДокумента.Проведение);
		
		Если НовыйДок Тогда 
			Сообщить("Создан и проведен документ " + ДопРасход.Ссылка);
		Иначе	
			Сообщить("Обновлен и проведен документ " + ДопРасход.Ссылка);
		КонецЕсли;	
		

	Иначе
		Если НЕ Результат.Пустой() Тогда 
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ДопРасходСсылка = Выборка.ДопРасход;
			ДопРасход = ДопРасходСсылка.ПолучитьОбъект();			
			ДопРасход.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;	
	КонецЕсли;		
КонецПроцедуры

Процедура ТТ_ПроведениеЗаявокНаРасходДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если НЕ РольДоступна(Метаданные.Роли.ПроведениеЗаявокНаРасходДС) Тогда
		Сообщить("У Вас недостаточно прав для проведения этого документа.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ТТ_ПроверкаДолгаКонтрагентаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.Дата <= Дата(2013, 12, 10) Тогда 
		Возврат;
	КонецЕсли;
	
	 
	// 15.02.19 Ульянов Не даем записать сервисный клиентский з-н если есть долг более 2 мес
	Если Источник.Видремонта <> Справочники.ВидыРемонта.НайтиПоКоду("K") Тогда 
		Возврат;
	КонецЕсли;
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;

	Если РольДоступна("ВосстПослед") тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =" 
		|ВЫБРАТЬ
		|СУММА(ВзаиморасчетыКомпанииОстатки.СуммаОстаток) КАК Сумма
		|ИЗ
		|РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&Период, Контрагент = &Контрагент) КАК ВзаиморасчетыКомпанииОстатки
		|ГДЕ
		|ВзаиморасчетыКомпанииОстатки.Сделка.Дата < ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -2)
		//|И ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ВидДоговора = &ВидДоговора
		|И ВзаиморасчетыКомпанииОстатки.ДоговорВзаиморасчетов.ДляАвтосервиса = ИСТИНА";	
	
	Запрос.УстановитьПараметр("Контрагент", Источник.Заказчик);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Сумма) Тогда
			Если Выборка.Сумма > 0 Тогда 
				Сообщить("У контрагента " + Источник.Заказчик + " есть долг в размере " + Выборка.Сумма + " руб. сроком более двух месяцев. Запись невозможна. " );
				//Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ТТ_ПроверкаПСООбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт  
	#Если Клиент Тогда
					
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ВосстПослед") Тогда
		Возврат;
	КонецЕсли;
		
	Если Источник.Дата < Дата(2013, 12, 30) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Источник.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ211345") ИЛИ  // Темп Авто ФКДД
		Источник.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ007393") Тогда // Темп Авто Кубань
		Возврат;
	КонецЕсли;
	
	//-------------------------------------allgk-------------------------------------//
	Попытка
	//проверям склад для проверки ПСО
	ПравоПСО = Ложь;
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015004").СписокПараметров Цикл
		Если Источник.СкладКомпании = стр.ЗначениеПараметра Тогда                     
			ПравоПСО = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ПравоПСО Тогда Возврат; КонецЕсли;
	Исключение
		Инфо = ИнформацияОбОшибке();
	    Сообщить("Описание='" + Инфо.Описание + "'");
    	Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
	    Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    	Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
	КонецПопытки;
	
	
	// Так было
	//Если Источник.СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000008") ИЛИ Источник.СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007") ИЛИ Источник.СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000102") Тогда 
	//	Возврат;
	//КонецЕсли;;	
	//-------------------------------------allgk-------------------------------------//
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказНаряд.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|ГДЕ
	|	ЗаказНаряд.ВидРемонта В(&ВидыРемонтаПСО)
	|	И ( ЗаказНаряд.Состояние = &СостояниеОтказ
	|	ИЛИ ЗаказНаряд.Состояние = &СостояниеЗакрыт )
	|	И ЗаказНаряд.Автомобиль В(&Автомобили)";
	
	
	ВидыРемонтаПСО = Новый СписокЗначений;	
	ВидыРемонтаПСО.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027")); 	// ПСО для ТТ
	ВидыРемонтаПСО.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000024")); 	// ПСО по возмещению (крайслер)
	ВидыРемонтаПСО.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000021")); 	// ПСО по контрактам (УАЗ)
	ВидыРемонтаПСО.Добавить(Справочники.ВидыРемонта.НайтиПоКоду("I1")); 		// ПСО, работы с парком новых автомобилей
	
	Запрос.УстановитьПараметр("Автомобили", Источник.Автомобили.ВыгрузитьКолонку("Автомобиль"));
	Запрос.УстановитьПараметр("СостояниеОтказ", Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002"));
	Запрос.УстановитьПараметр("СостояниеЗакрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("ВидыРемонтаПСО", ВидыРемонтаПСО);
	
	МашиныПСО = Запрос.Выполнить().Выгрузить();                                
	
	СтрокаВывода = "На машину(ы) нет заказ-нарядов ПСО!" + Символы.ПС;
	Выводить = Ложь;
	Для Каждого Стр Из Источник.Автомобили Цикл 
		Если МашиныПСО.Найти(Стр.Автомобиль) = Неопределено Тогда 
			СтрокаВывода = СтрокаВывода + Строка(Стр.Автомобиль) + Символы.ПС;
			Выводить = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	Если Выводить Тогда 
		Сообщить(СтрокаВывода);
		Отказ = Истина;
	КонецЕсли;	
	
	Для каждого Строка из Источник.Автомобили Цикл
		Запрос = Новый Запрос;
		Запрос.Текст= 
		"ВЫБРАТЬ
		|	ЗаказНаАвтомобиль.Ссылка
		|ИЗ
		|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
		|ГДЕ
		|	ЗаказНаАвтомобиль.Автомобиль = &Авто
		|	И ЗаказНаАвтомобиль.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("Авто",Строка.Автомобиль);
		Если Запрос.Выполнить().Пустой() Тогда
			Отказ=Истина;
			Сообщить("Невозможно провести реализацию без заказа на автомобиль: "+Строка.Автомобиль);
		КонецЕсли;
	КонецЦикла;
	
#КонецЕсли


КонецПроцедуры

Процедура ТТ_ПроверкаНомераЗНОрганизацияПриЗаписи(Источник, Отказ) Экспорт
	Если НЕ ЗначениеЗаполнено(Источник.Номер) Тогда 
		Возврат;
	КонецЕсли;	
	Если Источник.Дата < Дата(2013, 12, 23) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Лев(Источник.Номер, 2) = "ТТ" И Источник.Организация <> Справочники.Организации.ОсновнаяОрганизация 
		ИЛИ Лев(Источник.Номер, 2) = "ТА" И Источник.Организация <> Справочники.Организации.НайтиПоКоду("ТАС00001") 
		Тогда
		Источник.УстановитьНовыйНомер();
	КонецЕсли;					
КонецПроцедуры

Процедура ТТ_ЗаполнениеАгентскогоВознагражденияёОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.Статус <> Справочники.СтатусыРабочегоЛиста.Создан Тогда
		Возврат;
	КонецЕсли;
	
	
	АВ = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02036"); // Агентское вознаграждение
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
	Запрос.УстановитьПараметр("Свойство", АВ);
	
	Результат = Запрос.Выполнить();
	АВНоль = Ложь;
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		АВЧисло = Выборка.Значение;		
		АВНоль = Истина;
		Если АВЧисло <> 0 Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ АВНоль Тогда 
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
		НаборЗаписей.Отбор.Свойство.Установить(АВ);
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Объект = Источник.Ссылка; 
		НоваяЗапись.Свойство = АВ; 
		НоваяЗапись.Значение = Окр(Источник.ПроцентнаяСтавка*Источник.СуммаКредита/100, 4); 
		НаборЗаписей.Записать(); 	
	Иначе 
		Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();	
		Запись.Объект = Источник.Ссылка;
		Запись.Свойство = АВ;
		Запись.Значение = Окр(Источник.ПроцентнаяСтавка*Источник.СуммаКредита/100, 4);
		Запись.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ТТ_ЗапретСозданияМоделейАвтомобилейПередЗаписью(Источник, Отказ) Экспорт
	Если Не РольДоступна("СозданиеМоделей") Тогда 
		Сообщить("У вас недостаточно прав на создание новой модели!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

Процедура ТТ_СозданииРеализацийРабЛистСтрахОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//Если Источник.Статус <> Справочники.СтатусыРабочегоЛиста.Создан Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РеализацияТоваров.Ссылка КАК Реализация
	//|ИЗ
	//|	Документ.РеализацияТоваров КАК РеализацияТоваров
	//|ГДЕ
	//|	РеализацияТоваров.ДокументОснование = &РабЛистСтрах";
	//
	//Запрос.УстановитьПараметр("РабЛистСтрах", Источник.Ссылка);
	//
	//Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда 
	//	Реализация = Документы.РеализацияТоваров.СоздатьДокумент();			
	//	Реализация.ОбработкаЗаполнения(Источник.Ссылка);
	//	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РабочийЛистКредитногоОтдела") Тогда 
	//		//Реализация.Записать(РежимЗаписиДокумента.Запись);
	//		ТТ_ВводНаОснованииРабЛистаКредитОбработкаЗаполнения(Реализация, Источник.Ссылка, Истина);
	//	КонецЕсли;	
	//	Реализация.Записать(РежимЗаписиДокумента.Проведение);
	//	Сообщить("Создан и проведен документ ""Реализация товаров"" " + Реализация.Номер);
	//Иначе
	//	//Выборка = Результат.Выбрать();
	//	//Выборка.Следующий();
	//	//Реализация = Выборка.Реализация.ПолучитьОбъект();
	//	//Реализация.ОбработкаЗаполнения(Источник.Ссылка);
	//	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.РабочийЛистКредитногоОтдела") Тогда 
	//	//	Реализация.Записать(РежимЗаписиДокумента.Запись);
	//	//	ТТ_ВводНаОснованииРабЛистаКредитОбработкаЗаполнения(Реализация, Источник.Ссылка, Истина);
	//	//КонецЕсли;
	//	//Реализация.Записать(РежимЗаписиДокумента.Проведение);
	//	//Сообщить("Обновлен и проведен документ ""Реализация товаров"" " + Реализация.Номер);
	//КонецЕсли;	
КонецПроцедуры

Процедура ТТ_ВводНаОснованииРабЛистаКредитОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") Тогда 
		Возврат;
	КонецЕсли;	
	Источник.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;
	Если ЗначениеЗаполнено(ДанныеЗаполнения.КредитнаяПрограмма.БанкКонтрагент) Тогда
		Банк = ДанныеЗаполнения.КредитнаяПрограмма.БанкКонтрагент;
	Иначе	
		Банк = Справочники.Контрагенты.НайтиПоНаименованию(ДанныеЗаполнения.Банк.Наименование);
		Если Банк = Справочники.Контрагенты.ПустаяСсылка() Тогда 
			Банк = Справочники.Контрагенты.СоздатьЭлемент();
			Банк.Наименование = ДанныеЗаполнения.Банк.Наименование;
			Банк.НаименованиеПолное = Банк.Наименование;
			Банк.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
			Банк.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель;		
			Банк.ОсвобожденОтНДС=Истина;
			Банк.Записать();
			Банк.СоздатьОсновнойДоговор();
		ИначеЕсли Банк.ОсвобожденОтНДС = Ложь Тогда
			банк = банк.ссылка.ПолучитьОбъект();
			Банк.ОсвобожденОтНДС=Истина;		
			Банк.Записать();
		КонецЕсли;
	КонецЕсли;
			
	Источник.Контрагент	= Банк.Ссылка;		
	Источник.ОбработкаРеквизита("Контрагент");
	
	НетДоговора = Ложь;
	Если Источник.ДоговорВзаиморасчетов.Организация <> Источник.Организация Тогда 
		//Поиск договора по организации в реализации
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	ДоговорыВзаиморасчетов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Организация = &Организация
		|	И ДоговорыВзаиморасчетов.Владелец = &Контрагент
		|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ" ;
		Запрос.УстановитьПараметр("Организация",Источник.Организация);
		Запрос.УстановитьПараметр("Контрагент",Источник.Контрагент);
		Результат=Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			НетДоговора =	Истина;
		Иначе // Нашли договор
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ДоговорСсылка = Выборка.Ссылка;
			КонецЦикла;
			Источник.ДоговорВзаиморасчетов=Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) ИЛИ НетДоговора Тогда  //Создадим договор
		Права = Неопределено;
		ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
		ТипЦенПокупки = Справочники.ТипыЦен.ПустаяСсылка();
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", Права);
		ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   Права);
		НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		НовыйДоговор.УстановитьНовыйКод();
		НовыйДоговор.Владелец = Источник.Контрагент.Ссылка;
		НовыйДоговор.ВидДоговора = ВидДоговора;
		НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
		НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
		НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
		//KamikadZe begin add 06.10.2015 23:25:56
		НовыйДоговор.Организация = Источник.Организация;
		НовыйДоговор.Подразделение = Источник.ПодразделениеКомпании;
		//KamikadZe end add
		НовыйДоговор.ОбработкаЗаполнения(Неопределено);
		НовыйДоговор.Записать(); 
		Источник.ДоговорВзаиморасчетов = НовыйДоговор.Ссылка;		
	КонецЕсли;	
	
	НоваяСтрока = Источник.Товары.Добавить();
	Если ЗначениеЗаполнено(ДанныеЗаполнения.КредитнаяПрограмма.АгентскаяУслуга) Тогда
		НоваяСтрока.Номенклатура = ДанныеЗаполнения.КредитнаяПрограмма.АгентскаяУслуга;
	Иначе	
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00000101");
	КонецЕсли;		
	Источник.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
//	НоваяСтрока.Цена = Окр(ДанныеЗаполнения.СуммаКредита*ДанныеЗаполнения.ПроцентнаяСтавка/100, 2);
	НоваяСтрока.Цена = ?(ДанныеЗаполнения.ОбщаяСуммаАВ=0,Окр(ДанныеЗаполнения.СуммаКредита*ДанныеЗаполнения.ПроцентнаяСтавка/100, 2),ДанныеЗаполнения.ОбщаяСуммаАВ);
	Источник.ОбработкаРеквизита("Товары.Цена", НоваяСтрока);	
	НоваяСтрока.СтатьяДоходов = справочники.СтатьиДоходовИРасходов.НайтиПоКоду("ТТ000101");

КонецПроцедуры

Процедура ТТ_ЗаполнениеВИДДогДДСВыпискаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ХозОперация <> Справочники.ХозОперации.БанковскаяВыписка Тогда 
		Возврат;
	КонецЕсли;	
	
	СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
	СвойствоКредит = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Кредит", Истина,, СвойствоДДС);
	СвойствоСтрахование = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Страхование", Истина,, СвойствоДДС);
	
	Для Каждого Стр Из Источник.Состав Цикл
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.Объект.Установить(Стр.ДоговорВзаиморасчетов);
		НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Стр.ДоговорВзаиморасчетов;
		Запись.Свойство = СвойствоДДС;
		Если ЗначениеЗаполнено(Стр.Сделка) Тогда
			Если ТипЗнч(Стр.Сделка.ДокументОснование) = Тип("ДокументСсылка.РабочийЛистКредитногоОтдела") Тогда 
				Запись.Значение = СвойствоКредит;
			Иначе 
				Запись.Значение = СвойствоСтрахование;
			КонецЕсли;
		Иначе
			Запись.Значение = СвойствоСтрахование;
		КонецЕсли;	
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ТТ_ПроверкаВИдДоговораДДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.Дата < Дата(2014, 1, 1) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если РольДоступна("ПолныеПрава") И Не РольДоступна("ВосстПослед") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Источник.Организация=Справочники.Организации.НайтиПоКоду("ЦБ000003") или Источник.Организация=Справочники.Организации.НайтиПоКоду("ЦБ000005") Тогда
		Возврат;
	КонецЕсли;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	
	СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
	СвойствоАвто = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Авто", Истина,, СвойствоДДС);
	СвойствоГарантия = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Гарантия", Истина,, СвойствоДДС);
	СвойствоСервис = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Сервис", Истина,, СвойствоДДС);
	СвойствоЗапчасти = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Запчасти", Истина,, СвойствоДДС);
	//KamikadZe begin add 22.11.2016 16:39:03
	СвойствоМатериалы = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Материалы", Истина,, СвойствоДДС);
	//KamikadZe end add
	СвойствоНеИсп = Справочники.ЗначенияСвойств.НайтиПоНаименованию("не используется", Истина,, СвойствоДДС);
	СвойствоПрочее = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Прочее", Истина,, СвойствоДДС);
	СвойствоМКУ = Справочники.ЗначенияСвойств.НайтиПоНаименованию("МКУ", Истина,, СвойствоДДС);	
	СвойствоСубподряд = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Субподряд", Истина,, СвойствоДДС);
	СвойствоТрансПоврежд = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Транспортные повреждения", Истина,, СвойствоДДС);
	
	Запрос.УстановитьПараметр("Объект", Источник.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("Свойство", СвойствоДДС);
	
	Результат = Запрос.Выполнить();		
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если (Результат.Пустой() ИЛИ Выборка.Значение = Неопределено) И Не РольДоступна("ВосстПослед") Тогда
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Выписка") И Источник.ХозОперация = Справочники.ХозОперации.БанковскаяВыписка Тогда 
			Возврат;   
		КонецЕсли;	
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ  
			ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Выписка") ИЛИ
			ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") ИЛИ
			ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходовНаАвтомобили") Тогда 
			
			//Сообщить("Документ не проведен!" + Символы.ПС + "Заполните в договоре дополнительное свойство - Вид договора ДДС");
			//Отказ = Истина;
			//Возврат;
		КонецЕсли;	
		
		
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Источник.ДоговорВзаиморасчетов);
		НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = Источник.ДоговорВзаиморасчетов;
		НоваяЗапись.Свойство = СвойствоДДС;
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда	
			НоваяЗапись.Значение = СвойствоСервис;
		КонецЕсли;	
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") ИЛИ ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда 
			НоваяЗапись.Значение = СвойствоАвто;
		КонецЕсли;	
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда 
			НоваяЗапись.Значение = СвойствоЗапчасти;
		КонецЕсли;	
		
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;		
	
	//Разрешить для з-н и запчастей свойство ДДС - "не используется"  для контрагентов Кунова, ТТ, ТАС
	Кунова = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	ТТ = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	ТАС = Справочники.Контрагенты.НайтиПоКоду("ЦБ211338");
	Если ( ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ
		ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ
		ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") ) И
		(Выборка.Значение = СвойствоМКУ ИЛИ Выборка.Значение = СвойствоНеИсп) И
		( Источник.Контрагент = Кунова ИЛИ Источник.Контрагент = ТТ ИЛИ Источник.Контрагент = ТАС ) Тогда	
		Возврат;
	КонецЕсли;	
	//-------------------------------------------------------------------	
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") И Выборка.Значение <> СвойствоСервис И Выборка.Значение <> СвойствоГарантия И Выборка.Значение <> СвойствоНеИсп И Выборка.Значение <> СвойствоМКУ И Выборка.Значение <> СвойствоТрансПоврежд Тогда 
		Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Сервис"",""Гарантия"",""не использовать"" или ""МКУ"", или Транспортные повреждения");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если (ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеАвтомобилей") ИЛИ ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияАвтомобилей")) И Выборка.Значение <> СвойствоАвто Тогда 
		Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Авто""");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	 
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Если (Источник.ХозОперация.Код = "010202") Тогда
			Если  Выборка.Значение <> СвойствоСубподряд И 
				  Выборка.Значение <> СвойствоМатериалы И
				  Выборка.Значение <> СвойствоЗапчасти И 
				  Выборка.Значение <> СвойствоПрочее Тогда //Субподряд
				Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Субподряд""");
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			//KamikadZe begin add 09.09.2015 22:35:04
		ИначеЕсли (Источник.ХозОперация.Код = "010100") Тогда // Товары
			Если Выборка.Значение <> СвойствоЗапчасти И Выборка.Значение <> СвойствоМатериалы Тогда 
				Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Запчасти"" или ""Материалы""");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		ИначеЕсли (Источник.ХозОперация.Код = "130214") Тогда  // Услуги
			Если  Выборка.Значение <> СвойствоСубподряд И 
				  Выборка.Значение <> СвойствоМатериалы И
				  Выборка.Значение <> СвойствоЗапчасти И 
				  Выборка.Значение <> СвойствоПрочее Тогда 
				Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Запчасти"" или ""Материалы""");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		Иначе
			// ----------------------------------allgk----------------------------------
			// по заказу Микоры 07 04 2017
			// закомментировал строки ниже для.  Документ посткпление услуг стронних организаций может быть любой вид договора ДДС
			//Если Выборка.Значение <> Справочники.ЗначенияСвойств.НайтиПоНаименованию("Прочее", Истина,, СвойствоДДС) Тогда 
			//	Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Прочее""");
			//	Отказ = Истина;
			//	Возврат;
			//КонецЕсли;
			// ----------------------------------allgk----------------------------------
			
			//KamikadZe end add
		КонецЕсли;	
	КонецЕсли;	
	
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") И Источник.Ссылка.ХозОперация = Справочники.ХозОперации.РеализацияТоваров  Тогда 
		Если Источник.СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ184831") ИЛИ Источник.СкладКомпании = Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000110") Тогда//склад мед. оборудования + тарабанов. склад корпавто
			Если Выборка.Значение <> СвойствоАвто И Выборка.Значение <> СвойствоПрочее Тогда
				Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Авто"" или ""Прочее""" );
				Отказ = Истина;
				Возврат;			
			КонецЕсли;	
		Иначе
			Если Выборка.Значение <> СвойствоЗапчасти И Выборка.Значение <> СвойствоМатериалы Тогда
				Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Запчасти"",""не использовать"" или ""МКУ""" );
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;		 
	
	
КонецПроцедуры

Процедура ТТ_ДопРасходыНаАвтоПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	//Запрет на невыкупленные Авто при незаполненном виде ремонта
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;	
	КонецЕсли;
	
	Если Источник.ВидРемонта = Справочники.ВидыРемонта.ПустаяСсылка() Тогда   
		Для Каждого Стр Из Источник.Автомобили Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОстаткиАвтомобилейОстаткиИОбороты.Автомобиль,
			|	ОстаткиАвтомобилейОстаткиИОбороты.СтатусПартии КАК Статус
			|ИЗ
			|	РегистрНакопления.ОстаткиАвтомобилей.ОстаткиИОбороты(, &Дата, , , Автомобиль = &Авто) КАК ОстаткиАвтомобилейОстаткиИОбороты";
			Запрос.УстановитьПараметр("Авто",Стр.Автомобиль);
			Запрос.УстановитьПараметр("Дата",Источник.Дата);
			Результат = Запрос.Выполнить();
			Если Не Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					Статус = Выборка.Статус;
				КонецЦикла;
				Если Статус <> Перечисления.СтатусыПартий.ТоварКупленный Тогда
					Сообщить("Автомобиль "+Стр.Автомобиль+" не выкуплен. Проведение невозможно!");
					Отказ=Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли
	
КонецПроцедуры

Процедура ТТ_ЗН_ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//+Тарабанов ограничение на ссмену вида работы по дням
	Если НЕ Источник.ЭтоНовый() Тогда
		ПредВидРаботы = ПолучитьСохраненныйВидРаботы(Источник.Ссылка);
		ПредВидРаботыВПроверяемых = ПроверитьВидРаботыНаМаксСумму(ПредВидРаботы);	
		НаличиеВПроверяемых = ПроверитьВидРаботыНаМаксСумму(Источник.ВидРемонта);
		Если НЕ ПредВидРаботыВПроверяемых И НаличиеВПроверяемых Тогда
			РазрешениеПользователю = ПроверитьРазрешениеПользователяНаПревышениеМаксСуммы(ПараметрыСеанса.Пользователь);
			Если НЕ РазрешениеПользователю Тогда
				КоличествоДней = Справочники.ТТ_СписокПараметров.НайтиПоКоду("000000010").СписокПараметров[0].ЗначениеПараметра;
				Если НачалоДня(ТекущаяДата()) - НачалоДня(Источник.Дата) > КоличествоДней*24*60*60 Тогда
					Отказ = Истина;
					Сообщить("Пользователю запрещено менять вид работы документа Заказ-наряд, в связи с установленным ограничением.");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-Тарабанов
	
	//+Тарабанов Проверка на макс сумму гарантийных ЗН
	//Получаем макс сумму
	МаксимальнаяСумма = ПолучитьМаксСуммуПроверяемыхЗН();
	//Проверяем задана ли максимальная сумма
	Если МаксимальнаяСумма > 0 Тогда
		//Проверяем вид работы на присутсвие в проверяемых работах
		НаличиеВПроверяемых = ПроверитьВидРаботыНаМаксСумму(Источник.ВидРемонта);
		Если НаличиеВПроверяемых Тогда
			Если ПроверитьУсловиеПревышениеПоСумме(Источник.Ссылка, Источник.Дата, Источник.Автомобиль, МаксимальнаяСумма) Тогда
				//Необходимо проверить разрешение для пользователя
				РазрешениеПользователю = ПроверитьРазрешениеПользователяНаПревышениеМаксСуммы(ПараметрыСеанса.Пользователь);
				Если Не РазрешениеПользователю Тогда
					Отказ = Истина;
					Сообщить("Пользователю системы запрещено создавать документ Заказ Наряд на сумму свыше " + Формат(МаксимальнаяСумма, "ЧРГ="));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//-Тарабанов
	
	Если РольДоступна("ПолныеПрава") Тогда
		Возврат;	
	КонецЕсли;
	
	//Запрет закрытия старых заказ нарядов
	//Если Источник.Дата < Дата(2015,01,1,00,00,00)Тогда
	//	Отказ= Истина;
	//	Сообщить("Невозможно записать заказ-наряд прошлого года. Обратитесь в IT отдел.");
	//КонецЕсли;

	//Запрет смены организации если было перемещение в производство
	Если Источник.Организация <> Источник.Ссылка.Организация Тогда 
		Для Каждого Стр из Источник.Товары Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПеремещениеТоваровВПроизводство.Ссылка
			               |ИЗ
			               |	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
			               |ГДЕ
			               |	ПеремещениеТоваровВПроизводство.Товары.Номенклатура.Ссылка = &Товар
			               |	И ПеремещениеТоваровВПроизводство.ПометкаУдаления = ЛОЖЬ
			               |	И ПеремещениеТоваровВПроизводство.Проведен = ИСТИНА
			               |	И ПеремещениеТоваровВПроизводство.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("Товар", Стр.Номенклатура);
			Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				Сообщить("Невозможно изменить организацию, т.к. есть перемещение в производство по товару """+Стр.Номенклатура.Наименование+"");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	// Проверка на наличие перемещений если пытаются перевести в отказ
	Если Источник.Состояние = Справочники.ВидыСостоянийЗаказНарядов.НайтиПоКоду("ЦБ00000002") Тогда 
		Для Каждого Стр из Источник.Товары Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПеремещениеТоваровВПроизводство.Ссылка
			               |ИЗ
			               |	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
			               |ГДЕ
			               |	ПеремещениеТоваровВПроизводство.Товары.Номенклатура.Ссылка = &Товар
			               |	И ПеремещениеТоваровВПроизводство.ПометкаУдаления = ЛОЖЬ
			               |	И ПеремещениеТоваровВПроизводство.Проведен = ИСТИНА
			               |	И ПеремещениеТоваровВПроизводство.ДокументОснование = &ДокументОснование";
			Запрос.УстановитьПараметр("Товар", Стр.Номенклатура);
			Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Отказ = Истина;
				Сообщить("Невозможно изменить статус, т.к. есть перемещение в производство по товару """+Стр.Номенклатура.Наименование+"");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	

	
	
	//	// 16/10/18 Ульянов
	////Установка цены на ПСО  ЦБ000027
	//
	Если Источник.ВидРемонта=Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027") и не Источник.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
		ВсяСумма=Источник.СуммаДокумента;			
		Если Источник.Автомобиль.Модель.Родитель=Справочники.Модели.НайтиПоКоду("ЦБ00000799") Тогда  //Приора
			Если ВсяСумма<>1300 Тогда 
				Если Источник.Товары.Итог("СуммаВсего")<1300 Тогда			
					Если Источник.Работы.Количество()=1 Тогда
						Стр=Источник.Работы[0];
						Стр.СуммаВсего=1300-Источник.Товары.Итог("СуммаВсего");
						Источник.ОбработкаРеквизита("Работы.СуммаВсего",Стр,Неопределено);
					Иначе
						Сообщить("Обнаружено больше одной работы, автоустановна суммы з-н невозможна");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Источник.Автомобиль.Модель.ПринадлежитЭлементу(Справочники.Модели.НайтиПоКоду("ЦБ00000031")) Тогда  //Вазы
			Если ВсяСумма<>1500 Тогда
				Если Источник.Товары.Итог("СуммаВсего")<1500 Тогда			
					Если Источник.Работы.Количество()=1 Тогда
						Стр=Источник.Работы[0];
						Стр.СуммаВсего=1500-Источник.Товары.Итог("СуммаВсего");
						Источник.ОбработкаРеквизита("Работы.СуммаВсего",Стр,Неопределено);
					Иначе
						Сообщить("Обнаружено больше одной работы, автоустановна суммы з-н невозможна");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Источник.Автомобиль.Модель.ПринадлежитЭлементу(Справочники.Модели.НайтиПоКоду("ЦБ00000004")) Тогда  //УАЗ
			Если ВсяСумма<>3400 Тогда
				Если Источник.Товары.Итог("СуммаВсего")<3400 Тогда			
					Если Источник.Работы.Количество()=1 Тогда
						Стр=Источник.Работы[0];
						Стр.СуммаВсего=3400-Источник.Товары.Итог("СуммаВсего");
						Источник.ОбработкаРеквизита("Работы.СуммаВсего",Стр,Неопределено);
					Иначе
						Сообщить("Обнаружено больше одной работы, автоустановна суммы з-н невозможна");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		ИначеЕсли Источник.Автомобиль.Модель=Справочники.Модели.НайтиПоКоду("ЦБ00000249") Тогда  // Шеви Нива
			Если ВсяСумма<>3700 Тогда
				Если Источник.Товары.Итог("СуммаВсего")<3700 Тогда			
					Если Источник.Работы.Количество()=1 Тогда
						Стр=Источник.Работы[0];
						Стр.СуммаВсего=3700-Источник.Товары.Итог("СуммаВсего");
						Источник.ОбработкаРеквизита("Работы.СуммаВсего",Стр,Неопределено);
					Иначе
						Сообщить("Обнаружено больше одной работы, автоустановна суммы з-н невозможна");
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		Иначе
			
		КонецЕсли;	
	КонецЕсли;

	
КонецПроцедуры

Процедура ТТ_ПроверкаОргДоговорПередЗаписью(Источник, Отказ) Экспорт
	#Если Клиент Тогда
		Если Источник.ЭтоНовый() ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИзменениеДоговоров") Тогда
			Возврат;
		КонецЕсли;
		Дог = Источник.Ссылка.ПолучитьОбъект();
		Если Дог.Организация <> Источник.организация ИЛИ Дог.подразделение <> Источник.подразделение ИЛИ Дог.ВидДоговора <> Источник.ВидДоговора Тогда
			Сообщить("Вы не можете менять Подразделение, Организацию и Вид договора!");
			Отказ=Истина;
		КонецЕсли;
	#КонецЕсли		
КонецПроцедуры

Процедура ТТ_РС_ЗначенияСвойствОбъектовПриЗаписи(Источник, Отказ, Замещение) Экспорт
	#Если Клиент Тогда
		
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(глФормаПанелиСвойств) Тогда	
			Если глФормаПанелиСвойств.ТекОбъект <> Неопределено И ТипЗнч(глФормаПанелиСвойств.ТекОбъект.Ссылка) = ТИП("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
				//По дате запрета редактирования
				ДатаЗапретаРедактирования = КонецДня(обПолучитьПраваИНастройкиПользователя(глФормаПанелиСвойств.ТекОбъект.Организация,"ДатаЗапретаРедактирования",глФормаПанелиСвойств.ТекОбъект));
				
				Если глФормаПанелиСвойств.ТекОбъект.Дата <= ДатаЗапретаРедактирования Тогда

				//ОстаткиЗаказаНаАвтомобиль=РегистрыНакопления.ЗаказыАвтомобилей.Остатки(,Новый Структура("Заказ",глФормаПанелиСвойств.ТекОбъект.Ссылка));
				//Если ОстаткиЗаказаНаАвтомобиль.Итог("Количество")=0 И 
				//	ОстаткиЗаказаНаАвтомобиль.Итог("Резерв")=0 Тогда
					Предупреждение("Заказ за границами даты запрета редактирования. Для редактирования обратитесь к гл. бухгалтеру.");
					Отказ = Истина;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;			
				
		Если НЕ РольДоступна("ИзменениеСвойстваНеликвид") Тогда	    
			СвойствоНеликвид = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Неликвид");				
			Для Каждого Запись Из Источник Цикл		
				Если Запись.Свойство = СвойствоНеликвид Тогда
					Сообщить("Нет прав на изменение этого свойства. Обратитесь к системному администратору.");
					Отказ = Истина;					
				КонецЕсли;
			КонецЦикла;		
		КонецЕсли;
				
		Если НЕ РольДоступна("ПринятиеСобытий") Тогда	   
			СвойствоСобытиеПринимается = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Событие принимается"); 				
			Для Каждого Запись Из Источник Цикл		
				Если Запись.Свойство = СвойствоСобытиеПринимается Тогда
					Сообщить("Нет прав на изменение этого свойства. Обратитесь к системному администратору.");
					Отказ = Истина;					
				КонецЕсли;
			КонецЦикла;		
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ТТ_ПоступАвтПриПроведПСООбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	#Если Клиент Тогда
		Если РольДоступна("ПолныеПрава") Тогда
			Возврат;	
		КонецЕсли;
		
		Если НЕ Источник.ХозОперация.Код = "010400" И НЕ Источник.ХозОперация.Код = "012005" Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого Стр из Источник.Автомобили Цикл	
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаказНаряд.Ссылка
			|ИЗ
			|	Документ.ЗаказНаряд КАК ЗаказНаряд
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей.Остатки(&Дата, ) КАК ОстаткиАвтомобилейОстатки
			|		ПО ЗаказНаряд.Автомобиль = ОстаткиАвтомобилейОстатки.Автомобиль
			|ГДЕ
			|	ЗаказНаряд.ВидРемонта = &ПСО
			|	И ЗаказНаряд.ПометкаУдаления = ЛОЖЬ
			|	И ЗаказНаряд.Автомобиль = &Авто
			|	И ЗаказНаряд.Дата >= &ТекДата";
			Запрос.УстановитьПараметр("ПСО",справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027"));
			Запрос.УстановитьПараметр("Авто",Стр.Автомобиль); 
			Запрос.УстановитьПараметр("Дата",ТекущаяДата());
			Запрос.УстановитьПараметр("ТекДата", Источник.Дата);
			
			Рез = Запрос.Выполнить().Выбрать();
			
			Если рез.Количество() = 0 Тогда
				Если Вопрос("Создать Заказ-наряд ""ПСО для ТТ"" для "+Стр.Автомобиль+" ?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда				
					Если обЗначениеНеЗаполнено(Стр.Автомобиль.Модель) Тогда  
						Сообщить("Не указана модель автомобиля "+Стр.Автомобиль+". ПСО не создан!");	
						Возврат;
					КонецЕсли;
					
					ЗапросАвторабот = Новый Запрос;
					ЗапросАвторабот.Текст ="ВЫБРАТЬ
					                       |	НазначениеАвторабот.Модель,
					                       |	НазначениеАвторабот.Авторабота,
					                       |	НазначениеАвторабот.Сумма,
					                       |	ВЫБОР
					                       |		КОГДА НЕ ЕСТЬNULL(НазначениеАвторабот.Модель.Родитель.Родитель.Родитель, """") = """"
					                       |			ТОГДА НазначениеАвторабот.Модель.Родитель.Родитель
					                       |		ИНАЧЕ ВЫБОР
					                       |				КОГДА НЕ ЕСТЬNULL(НазначениеАвторабот.Модель.Родитель.Родитель, """") = """"
					                       |					ТОГДА НазначениеАвторабот.Модель.Родитель
					                       |				ИНАЧЕ ВЫБОР
					                       |						КОГДА НЕ ЕСТЬNULL(НазначениеАвторабот.Модель.Родитель, """") = """"
					                       |							ТОГДА НазначениеАвторабот.Модель.Родитель
					                       |						ИНАЧЕ НазначениеАвторабот.Модель
					                       |					КОНЕЦ
					                       |			КОНЕЦ
					                       |	КОНЕЦ КАК Брэнд,
					                       |	НазначениеАвторабот.Нормочас
					                       |ИЗ
					                       |	Справочник.НазначениеАвторабот КАК НазначениеАвторабот" ;
					//ЗапросАвторабот.УстановитьПараметр("Организация",Справочники.Организации.НайтиПоКоду("ИПК00001"));

					БрэндАвто = ПолучитьБрэнд(Стр.Автомобиль.Модель);
					Работы = ЗапросАвторабот.Выполнить().Выгрузить();
					//Ищем
					НайденнаяСтрока = Работы.Найти(Стр.Автомобиль.Модель,"Модель");
					Если НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока = Работы.Найти(Стр.Автомобиль.Модель.Родитель ,"Модель");
					КонецЕсли;
					Если НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока = Работы.Найти(БрэндАвто,"Модель");	
					КонецЕсли;
					Если НайденнаяСтрока = Неопределено Тогда
						НайденнаяСтрока = Работы.Найти(БрэндАвто,"Брэнд");	
					КонецЕсли;
					
					//создаем заказ-наряд
					
					НовыйПСО = Документы.ЗаказНаряд.СоздатьДокумент();
					НовыйПСО.ОбработкаЗаполнения(Неопределено,"",Истина);
					НовыйПСО.Автомобиль=Стр.Автомобиль;
					НовыйПСО.ВидРемонта= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000027"); //ПСО для ТТ
					НовыйПСО.Заказчик = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314"); //Техно-темп
					НовыйПСО.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314"); //Техно-темп
					
					Если БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00000332") Или БрэндАвто = Справочники.Модели.НайтиПоКоду("ЦБ00001127") Тогда //ГАЗ, ПАЗ
						НовыйПСО.Организация= Справочники.Организации.НайтиПоКоду("ТАС00001");  //ООО "Темп Авто Сервис"
						НовыйПСО.ПодразделениеКомпании= справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000007");  //Сервис ГАЗ ТАС			
						НовыйПСО.ДоговорВзаиморасчетов= справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ024743"); // Договор ТО и ремонта ТАС	
						НовыйПСО.Цех = Справочники.Цеха.НайтиПоКоду("ЦБ000028");
					Иначе	 //Остальные
						НовыйПСО.Организация= Справочники.Организации.НайтиПоКоду("ИПК00001");  //Кунова
						НовыйПСО.ПодразделениеКомпании= справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000003");			
						НовыйПСО.ДоговорВзаиморасчетов= справочники.ДоговорыВзаиморасчетов.НайтиПоКоду("ЦБ017323");
						НовыйПСО.Цех = Справочники.Цеха.НайтиПоКоду("ЦБ000022");
					КонецЕсли;
					
					Если НЕ НайденнаяСтрока = Неопределено Тогда
						НоваяСтрока=НовыйПСО.Работы.Добавить();						
						НоваяСтрока.Работа= НайденнаяСтрока.Авторабота;
						НовыйПСО.ОбработкаРеквизита("Работы.Работа",НоваяСтрока);
						НоваяСтрока.Нормочас = НайденнаяСтрока.Нормочас;
						НовыйПСО.ОбработкаРеквизита("Работы.Нормочас",НоваяСтрока);
						НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
						Если обЗначениеНеЗаполнено(НоваяСтрока.Коэффициент) Тогда
							НоваяСтрока.Коэффициент = 1;
						КонецЕсли;
						Если  НайденнаяСтрока.Сумма = 0 Тогда
							НоваяСтрока.Цена = НайденнаяСтрока.Нормочас.Цена;
							НоваяСтрока.Сумма = НайденнаяСтрока.Нормочас.Цена;
						Иначе
							НоваяСтрока.Цена = НайденнаяСтрока.Сумма;
							НоваяСтрока.Сумма = НайденнаяСтрока.Сумма;
						КонецЕсли;	
					КонецЕсли;
					Попытка
						НовыйПСО.Записать();
						НовыйПСО.Записать(РежимЗаписиДокумента.Проведение);
						Сообщить("Создан Заказ-наряд с видом ремонта ПСО для ТТ: "+НовыйПСО.Ссылка+". Автомобиль: "+Стр.Автомобиль);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	#КонецЕсли
	
	
КонецПроцедуры

Функция ПолучитьБрэнд(Элемент)
	
	Если Элемент.Родитель.Пустая() Тогда
		Возврат Элемент;
	Иначе
		Возврат ПолучитьБрэнд(Элемент.Родитель);
	КонецЕсли;
	
КонецФункции

Процедура ТТ_РабЛистПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	#Если Клиент Тогда	
		
		Если РольДоступна("ПолныеПрава") Тогда 
			Возврат;
		КонецЕсли;
		
		
		Если обЗначениеНеЗаполнено(Источник.Модель) Тогда
			Отказ=Истина;
			Предупреждение("Не заполнена Модель!");
			Возврат;		
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(Источник.ПредставлениеТелефона) Тогда
			Отказ=Истина;
			Предупреждение("Не заполнен Телефон!");
			Возврат;		
		КонецЕсли;
		
		Если  Источник.Модель.ЭтоГруппа  Тогда
			Предупреждение("Модель не можеть быть группой. Выберите конкретную модель!");			
			Отказ=Истина;		
			Возврат;
		КонецЕсли;
		
		Если Источник.Модель.Родитель.Код = "ЦБ00000588" ИЛИ Источник.Модель.Родитель.Код = "ЦБ00000589"  Тогда
			Предупреждение("Группа CRM предназначена для служебного пользования. Выберите модель из группы с наименованием бренда.");			
			Отказ=Истина;
			Возврат;			
		КонецЕсли;	
		
		НабЗап = РегистрыСведений.ЛадаКлиент.СоздатьНаборЗаписей();
		НабЗап.Отбор.Объект.Установить(Источник.Ссылка);
		Набзап.Прочитать();
		Если Набзап.Количество() > 0 Тогда
			НабЗап[0].Изменен = Истина;
			Набзап.Записать();
		КонецЕсли;		
		
	#КонецЕсли
КонецПроцедуры

Процедура ТТ_КарточкиПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
		
	#Если Клиент Тогда
				
		Если РольДоступна("ПолныеПрава") ИЛИ  РольДоступна("ИзменениеДискКарт") Тогда	
			Если Источник.Родитель = Справочники.Карточки.НайтиПоНаименованию("Чистые карты")И НЕ обЗначениеНеЗаполнено( Источник.Объект) Тогда
				Источник.Родитель = Справочники.Карточки.НайтиПоНаименованию("Выданные карты");
			ИначеЕсли Источник.Родитель = Справочники.Карточки.НайтиПоНаименованию("Золотые карты")И НЕ обЗначениеНеЗаполнено( Источник.Объект) Тогда
				Источник.Родитель = Справочники.Карточки.НайтиПоНаименованию("Золотые картыВ",,Справочники.Карточки.НайтиПоНаименованию("Выданные карты"));
			КонецЕсли;
		Иначе	
			Отказ=Истина;
			Сообщить("Нет прав на редактирование.");
		КонецЕсли;
	
	#КонецЕсли

КонецПроцедуры

Процедура ТТ_РабЛистЗаполнОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	#Если Клиент Тогда
		Если ТипЗнч(Источник)  = Тип("ДокументОбъект.РабочийЛистКредитногоОтдела") Тогда
			Источник.ПодразделениеКомпании = справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000013"); //   Арутюн
			Источник.Организация = справочники.Организации.НайтиПоКоду("ЦБ000004");
		ИначеЕсли ТипЗнч(Источник)  = Тип("ДокументОбъект.РабочийЛистОтделаСтрахования") Тогда 
			Источник.ПодразделениеКомпании = справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000012"); // ЛОпат
			Источник.Организация = справочники.Организации.НайтиПоКоду("ЦБ000003");		
		КонецЕсли;
	#КонецЕсли	
КонецПроцедуры

Процедура ТТ_ПроверкаВидДДССчетаНаОплатуПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.Дата < Дата(2014, 1, 1) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	
	СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
	СвойствоАвто = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Авто", Истина,, СвойствоДДС);
	СвойствоСервис = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Сервис", Истина,, СвойствоДДС);
	СвойствоЗапчасти = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Запчасти", Истина,, СвойствоДДС);
	СвойствоНеИсп = Справочники.ЗначенияСвойств.НайтиПоНаименованию("не используется", Истина,, СвойствоДДС);
	СвойствоМКУ = Справочники.ЗначенияСвойств.НайтиПоНаименованию("МКУ", Истина,, СвойствоДДС);	
    СвойствоСубаренда = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Субаренда", Истина,, СвойствоДДС);	
	СвойствоГарантия = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Гарантия", Истина,, СвойствоДДС); 
	СвойствоТрансПоврежд = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Транспортные повреждения", Истина,, СвойствоДДС);
	
	Запрос.УстановитьПараметр("Объект", Источник.ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("Свойство", СвойствоДДС);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда		
		
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Источник.ДоговорВзаиморасчетов);
		НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Объект = Источник.ДоговорВзаиморасчетов;
		НоваяЗапись.Свойство = СвойствоДДС;
		
		
		Если  ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") Тогда 
			НоваяЗапись.Значение = СвойствоАвто;
		КонецЕсли;	
		
		Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда 
			
			ЗапросСч = Новый Запрос;
			ЗапросСч.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(СчетНаОплатуТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК Запчасти,
			|	СУММА(ВЫБОР
			|			КОГДА ТИПЗНАЧЕНИЯ(СчетНаОплатуТовары.Номенклатура) = ТИП(Справочник.Автоработы)
			|				ТОГДА 1
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК Услуги
			|ИЗ
			|	Документ.СчетНаОплату.Товары КАК СчетНаОплатуТовары
			|ГДЕ
			|	СчетНаОплатуТовары.Ссылка = &Ссылка";
			
			ЗапросСч.УстановитьПараметр("Ссылка", Источник.Ссылка);				
			ТЗСч = ЗапросСч.Выполнить().Выгрузить();
			Если ТЗСч[0].Услуги > 0 Тогда 
				НоваяЗапись.Значение = СвойствоСервис;
			Иначе 	
				НоваяЗапись.Значение = СвойствоАвто;
			КонецЕсли;	
		КонецЕсли;	
		
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;			
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	//Разрешить свойство ДДС - "не используется"  для контрагентов Кунова, ТТ, ТАС
	Кунова = Справочники.Контрагенты.НайтиПоКоду("ЦБ001303");
	ТТ = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	ТАС = Справочники.Контрагенты.НайтиПоКоду("ЦБ211338");
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплату") И
		(Выборка.Значение = СвойствоМКУ ИЛИ Выборка.Значение = СвойствоНеИсп) И
		( Источник.Контрагент = Кунова ИЛИ Источник.Контрагент = ТТ ИЛИ Источник.Контрагент = ТАС ) Тогда	
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили") И Выборка.Значение <> СвойствоАвто Тогда 
		Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должно быть ""Авто""");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплату") И Выборка.Значение <> СвойствоСервис И 
		Выборка.Значение <> СвойствоАвто И Выборка.Значение <> СвойствоЗапчасти И Выборка.Значение <> СвойствоМКУ И
		Выборка.Значение <> СвойствоГарантия И Выборка.Значение <> СвойствоСубаренда И Выборка.Значение <> СвойствоТрансПоврежд Тогда 
		Сообщить("Документ не проведен!" + Символы.ПС + "В договоре дополнительное свойство ""Вид договора ДДС"" должны быть ""Авто"" или ""Сервис"",""Гарантия"",""Запчасти"" или ""МКУ""");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	
	
КонецПроцедуры

Процедура ТТ_ПроверкаПоступленияНеликвидовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ВосстПослед") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Источник.Контрагент.Код = "ЦБ001303" или  Источник.Контрагент.Код = "ЦБ001314" или  Источник.Контрагент.Код = "ЦБ007393" или  Источник.Контрагент.Код = "ЦБ211345" 
		или  Источник.Контрагент.Код = "ЦБ002733" тогда
			Возврат;
	КонецЕсли;

	
	Если Источник.Дата < Дата(2014, 2, 20) Тогда 
		Возврат;			
	КонецЕсли;	
	
	//+Тарабанов разрешение на оприходование нелеквида
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000000008").СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = ПараметрыСеанса.Пользователь Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	//-Тарабанов
	
	СвйоствоНеликвид = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02049");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &СвйоствоНеликвид
	|	И (ЗначенияСвойствОбъектов.Значение = 1
	|			ИЛИ ЗначенияСвойствОбъектов.Значение = 2)
	|	И ЗначенияСвойствОбъектов.Объект В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СвйоствоНеликвид", СвйоствоНеликвид);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокаВывода = "Запрщено ставить на приход неликвидный товар" + Символы.ПС;
	ЕстьНеликвид = Ложь;
	Пока Выборка.Следующий() Цикл
		СтрокаВывода = СтрокаВывода + Выборка.Номенклатура.Наименование + " " + Выборка.Номенклатура.Артикул + Символы.ПС;
		ЕстьНеликвид = Истина;
	КонецЦикла;
	Если ЕстьНеликвид Тогда 
		Сообщить(СтрокаВывода);
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры


Процедура ТТ_СозданиеДоговораЗаявкаНаРемонтОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Источник.Контрагент) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(Источник.Контрагент) = Тип("Строка") Тогда 
		Возврат;
	КонецЕсли;	
	
	Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	
	СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
	СвойствоСервис = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Сервис", Истина,, СвойствоДДС);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыВзаиморасчетов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	|ГДЕ
	|	ДоговорыВзаиморасчетов.Владелец = &Контрагент
	|	И ДоговорыВзаиморасчетов.Организация = &Организация
	|	И ДоговорыВзаиморасчетов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.Продажа)
	|	И ДоговорыВзаиморасчетов.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Контрагент", Источник.Контрагент);
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.НайтиПоКоду("ТАС00001"));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТекДоговор = Выборка.Договор;
		
		Источник.ДоговорВзаиморасчетов = ТекДоговор;
		//Источник.Записать(РежимЗаписиДокумента.Проведение);
		Возврат;
	КонецЕсли;	
	
	Права = Неопределено;
	Если Источник.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель Тогда
		ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
		ТипЦенПокупки = Справочники.ТипыЦен.ПустаяСсылка();
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", Права);
		ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   Права);
	ИначеЕсли Источник.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Поставщик Тогда	
		ВидДоговора   = Перечисления.ВидыДоговоров.Покупка;
		ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", Права);
		ТипЦенПродажи = Справочники.ТипыЦен.ПустаяСсылка();
		ТипЦенРабот   = Справочники.ТипыЦен.ПустаяСсылка();
	Иначе
		ВидДоговора   = Перечисления.ВидыДоговоров.Прочее;
		ТипЦенПокупки = Справочники.ТипыЦен.ПустаяСсылка();
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", Права);
		ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   Права);
	КонецЕсли;
	НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	НовыйДоговор.УстановитьНовыйКод();
	НовыйДоговор.ОбработкаЗаполнения(Неопределено);
	Если Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000004") Тогда// ТАС 160 
		НовыйДоговор.Наименование = "Договор ТО и ремонта ТАС";	
	ИначеЕсли Подразделение = Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000007") Тогда//  ГАЗ ТАС
		НовыйДоговор.Наименование = "Договор ТО и ремонта ГАЗ ТАС";	
	Иначе
		НовыйДоговор.Наименование = "Договор ТО и ремонта";	
	КонецЕсли;
	
	НовыйДоговор.Владелец = Источник.Контрагент.Ссылка;
	НовыйДоговор.ВидДоговора = ВидДоговора;
	НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
	НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
	НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;	
	НовыйДоговор.Организация = Справочники.Организации.НайтиПоКоду("ТАС00001");
	НовыйДоговор.Подразделение = Подразделение ;
	НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
	НовыйДоговор.Записать();
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(НовыйДоговор.Ссылка);
	НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
	Запись = НаборЗаписей.Добавить();
	Запись.Объект = НовыйДоговор.Ссылка;
	Запись.Свойство = СвойствоДДС;
	Запись.Значение = СвойствоСервис;
	НаборЗаписей.Записать();
	
	Источник.ДоговорВзаиморасчетов = НовыйДоговор;
	//Источник.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ТТ_ПроверкаОрганизацииЗНПерОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если РольДоступна("ПолныеПрава") Тогда 
		Возврат;	
	КонецЕсли;	
	
	Если Источник.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровВПроизводство.Ссылка КАК Перемещение
	|ИЗ
	|	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
	|ГДЕ
	|	ПеремещениеТоваровВПроизводство.ДокументОснование = &ЗаказНаряд";
	
	Запрос.УстановитьПараметр("ЗаказНаряд", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокаВывода = "Есть документы ""Перемещение в производство"", у которых организация отличается от организации в документа ""Заказ наряд"":" + Символы.ПС;
	Есть = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Перемещение.Организация <> Источник.Организация Тогда 
			Есть = Истина;
			СтрокаВывода = СтрокаВывода + Выборка.Перемещение + Символы.ПС;
		КонецЕсли;	
	КонецЦикла;	
	
	Если Есть Тогда 
		Сообщить(СтрокаВывода);
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура Тт_ПриЗаписиРеализацииОповещатьОТюнинге(Источник, Отказ) Экспорт
	#Если Клиент Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаряд.Ссылка
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Автомобиль = &Автомобиль
		|	И (ЗаказНаряд.ВидРемонта.Код = ""00000001""
		|			ИЛИ ЗаказНаряд.ВидРемонта.Код = ""ЦБ000019"")";
		
		
		Для каждого стр из Источник.Автомобили цикл
			
			Запрос.УстановитьПараметр("Автомобиль", стр.Автомобиль);
			выборка = запрос.Выполнить().Выбрать();
			если выборка.Количество()> 0 тогда 
				Сообщить("Для " + стр.Автомобиль + " были проведены работы по установке доп.оборудования");
			конецесли;
			
		конеццикла;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ТТ_ЗаполнениеДогСчетНаОплатуПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	#Если Клиент Тогда
		Если ПараметрыСеанса.Пользователь.Сотрудник <> Справочники.Сотрудники.НайтиПоКоду("ЦБ004517") Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.Контрагент) или НЕ ЗначениеЗаполнено(Источник.Организация) Тогда 
			Возврат;
		КонецЕсли;
		
		НетДоговора = Ложь;
		СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
		СвойствоСервис = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Сервис", Истина,, СвойствоДДС);
		
		Если Источник.ДоговорВзаиморасчетов.Организация <> Источник.Организация Тогда 
			//Поиск договора по организации в реализации
			Запрос = Новый Запрос;
			Запрос.Текст ="ВЫБРАТЬ
			|	ДоговорыВзаиморасчетов.Ссылка
			|ИЗ
			|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			|ГДЕ
			|	ДоговорыВзаиморасчетов.Организация = &Организация
			|	И ДоговорыВзаиморасчетов.Владелец = &Контрагент
			|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ" ;
			Запрос.УстановитьПараметр("Организация",Источник.Организация);
			Запрос.УстановитьПараметр("Контрагент",Источник.Контрагент);
			Результат=Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				НетДоговора =	Истина;
			Иначе // Нашли договор
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					ДоговорСсылка = Выборка.Ссылка;
				КонецЦикла;
				Источник.ДоговорВзаиморасчетов=Выборка.Ссылка;
			КонецЕсли;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) ИЛИ НетДоговора Тогда  //Создадим договор
			Права = Неопределено;
			ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
			ТипЦенПокупки = Справочники.ТипыЦен.ПустаяСсылка();
			ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", Права);
			ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   Права);
			НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
			НовыйДоговор.УстановитьНовыйКод();
			НовыйДоговор.ОбработкаЗаполнения(Неопределено);
			НовыйДоговор.Наименование = "Договор ТО и ремонт ТАС";
			НовыйДоговор.Владелец = Источник.Контрагент.Ссылка;
			НовыйДоговор.ВидДоговора = ВидДоговора;
			НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
			НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
			НовыйДоговор.Организация = ПараметрыСеанса.Пользователь.Организация;
			НовыйДоговор.Подразделение = ПараметрыСеанса.Пользователь.Подразделение;
			НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;	
			НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
			НовыйДоговор.Записать(); 	
			Источник.ДоговорВзаиморасчетов = НовыйДоговор.Ссылка;
			
			НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();  //Назначим договору свойство ДДС - Сервис
			НаборЗаписей.Отбор.Объект.Установить(НовыйДоговор.Ссылка);
			НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Объект = НовыйДоговор.Ссылка;
			НоваяЗапись.Свойство = СвойствоДДС;
			НоваяЗапись.Значение = СвойствоСервис;
			НаборЗаписей.Записать();
			Сообщить("Создан договор "+НовыйДоговор.Наименование+" на организацию "+НовыйДоговор.Организация+" , контрагент "+НовыйДоговор.Владелец);
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура ТТ_СобытиеПриВводеНаОснованииОбработкаЗаполнения(Источник, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Опрос") Тогда
		Источник.Содержание =ДанныеЗаполнения.Комментарий; 	
	КонецЕсли;	
КонецПроцедуры

Процедура ТТ_ЗаявкаНаРемонтПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =        "ВЫБРАТЬ
	|	Событие.Номер
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ДокументОснование = &ЗаявкаНаРемонт
	|	И Событие.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ЗаявкаНаРемонт", Источник.Ссылка);
	Если Запрос.Выполнить().Пустой() Тогда 
		
		ДокСобытие = Документы.Событие.СоздатьДокумент();
		ДокСобытие.ОбработкаЗаполнения(Неопределено);
		ДокСобытие.ФорматТекста=Перечисления.ФорматТекста.ПростойТекст;
		ДокСобытие.Контрагент= Источник.Заказчик;
		ДокСобытие.ВидСобытия=перечисления.ВидыСобытий.ТелефонныйЗвонок;
		ДокСобытие.ТипСообщения=Перечисления.ТипыСообщений.Исходящее;
		ДокСобытие.ПредставлениеТелефона = источник.контрагент.основнойтелефон;
		ДокСобытие.ДатаНачала=Источник.ДатаНачала;
		ДокСобытие.ДатаОкончания=Источник.ДатаОкончания;
		ДокСобытие.Приоритет=Перечисления.Важность.Средняя;
		ДокСобытие.Тема = "Заявка на ремонт";
		ДокСобытие.ДокументОснование=Источник.Ссылка;
		ДокСобытие.Состояние=Перечисления.СостоянияСобытий.Запланировано;
		ДокСобытие.Содержание="Причина обращения: "+Источник.ПричинаОбращения +"; Автомобиль: "+Источник.Автомобиль;
		ДокСобытие.Дата = Источник.Дата+1;
		
		ДокСобытие.Записать(РежимЗаписиДокумента.Проведение);
		
		Если Источник.ДатаНачала  > НачалоДня(ТекущаяДата()) + 17*60*60 Тогда
			Напоминание = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
			Напоминание.Отбор.Объект.Установить(ДокСобытие);
			НовоеНапоминание = Напоминание.Добавить();
			НовоеНапоминание.Автор=Источник.Автор;
			НовоеНапоминание.Пользователь=справочники.Пользователи.НайтиПоКоду("Мельников В.");
			НовоеНапоминание.Завершено = Ложь;			
			НовоеНапоминание.РеальнаяДатаОповещения = НачалоДня(Источник.ДатаНачала - 24*60*60) + 17*60*60; 
			НовоеНапоминание.Объект = ДокСобытие;
			НовоеНапоминание.Тема = "Оповещение о записи на ремонт";
			НовоеНапоминание.Описание ="Телефон: "+источник.контрагент.основнойтелефон+"; Причина обращения: "+ Источник.ПричинаОбращения +"; Автомобиль: "+Источник.Автомобиль;
			НовоеНапоминание.ДатаАктуальности= Источник.ДатаНачала;
			НовоеНапоминание.ДатаНачала=Источник.ДатаНачала;
			НовоеНапоминание.УдалитьПоИстеченииСрока=Истина;
			Напоминание.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ТТ_ПриЗаписиЗаказНаАвтомобильПриЗаписи(Источник, Отказ) Экспорт
	
	#Если Клиент Тогда      
		//БизТех 10.07.2023г. убираем отказ <<
		
		//Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ВосстПослед") Тогда 
		//	Возврат;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(Источник.Дата) Тогда
		//	
		//	ДатаЗапретаРедактирования = КонецДня(обПолучитьПраваИНастройкиПользователя(Источник.Организация,"ДатаЗапретаРедактирования",Источник));
		//	
		//	Если Источник.Дата <= ДатаЗапретаРедактирования Тогда
		//		Сообщить("Заказ за границами даты запрета редактирования.");
		//		Отказ = Истина;
		//	КонецЕсли;
		//КонецЕсли;
		//>>
	#КонецЕсли
	
КонецПроцедуры

Процедура ТТ_СобытиеПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	#Если Клиент Тогда
		
		НабЗап = РегистрыСведений.ЛадаКлиент.СоздатьНаборЗаписей();
		НабЗап.Отбор.Объект.Установить(Источник.Ссылка);
		Набзап.Прочитать();
		Если Набзап.Количество() > 0 Тогда
			НабЗап[0].Изменен = Истина;
			Набзап.Записать();
		КонецЕсли;
		
		Если РольДоступна("ПолныеПрава")  Тогда 
			Возврат;
		КонецЕсли;	
		
		
		Если НЕ Источник.ДокументОснование.Пустая() И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.РабочийЛист")  Тогда
			ГрафикКалендарный =  ПолучитьГрафикКалендарный(Источник.ДокументОснование.Менеджер.ГрафикРаботы, Источник.ДатаНачала);
			УРВ_ТабельноеВремя = ПолучитьГрафикТабельноеВремя(Источник.ДокументОснование.Менеджер, Источник.ДатаНачала);
			
			Если ГрафикКалендарный <> Неопределено И ГрафикКалендарный.ВидДня = перечисления.ВидДня.Выходной Тогда
				Предупреждение("Нельзя планировать событие на выходной день по табелю рабочего времени.");
				Отказ=Истина;
			ИначеЕсли УРВ_ТабельноеВремя <>Неопределено И УРВ_ТабельноеВремя.ВидДня <> справочники.ВидыИнтервалов.Работа Тогда 
				Предупреждение("Нельзя планировать событие на выходной день по табелю рабочего времени.");
				Отказ=Истина;				
			КонецЕсли;
		КонецЕсли;
		
	#КонецЕсли	
КонецПроцедуры

Функция ПолучитьГрафикКалендарный(График,Дата);
	
	НаборЗаписей = РегистрыСведений.ГрафикРаботКалендарный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.График.Установить(График);
	НаборЗаписей.Отбор.Дата.Установить(Дата);	
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		ГрафикКалендарный = Новый Структура();
		ГрафикКалендарный.Вставить("ВидДня", НаборЗаписей[0].ВидДня );
		
		Возврат ГрафикКалендарный;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьГрафикТабельноеВремя(Сотрудник, Дата);
	
	//НаборЗаписей = РегистрыСведений.УРВ_ТабельноеВремя.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	//НаборЗаписей.Отбор.Период.Установить(Дата);	
	//НаборЗаписей.Прочитать();
	//Если НаборЗаписей.Количество() > 0 Тогда
	//	ГрафикКалендарный = Новый Структура();
	//	ГрафикКалендарный.Вставить("ВидДня", НаборЗаписей[0].ВидИнтервала );
	//	
	//	Возврат ГрафикКалендарный;		
	//КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьСохраненныйВидРаботы(СсылкаЗН)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	ЗаказНаряд.ВидРемонта
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|ГДЕ
		|	ЗаказНаряд.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаЗН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ВидРемонта;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат Неопределено;
КонецФункции

Функция ПолучитьВерхнююГруппу(АвтомобильДокумента)
	Если ЗначениеЗаполнено(АвтомобильДокумента.Родитель) тогда
		Возврат ПолучитьВерхнююГруппу(АвтомобильДокумента.Родитель);
	Иначе
		Возврат АвтомобильДокумента;
	КонецЕсли;
	//Возврат Неопределено;
КонецФункции

Функция ПроверитьУсловиеПревышениеПоСумме(СсылкаДокумнет, ДатаДокумента, АвтомобильДокумента, МаксимальнаяСумма)
	
	ПроверяемаяГруппа = ПолучитьВерхнююГруппу(АвтомобильДокумента);
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаДокумента
		|ИЗ
		|	Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТТ_СписокПараметров.СписокПараметров КАК ТТ_СписокПараметровСписокПараметров
		|		ПО ЗаказНаряд.ВидРемонта = ТТ_СписокПараметровСписокПараметров.ЗначениеПараметра
		|ГДЕ
		|	ЗаказНаряд.Проведен
		|	И ТТ_СписокПараметровСписокПараметров.Ссылка.Код = &Код
		|	И (ЗаказНаряд.Состояние = &Выполнен ИЛИ ЗаказНаряд.Состояние = &Закрыт)
		|	И ЗаказНаряд.Автомобиль В ИЕРАРХИИ(&Автомобиль)
		|	И ЗаказНаряд.Дата >= &ДатаНачала
		|	И ЗаказНаряд.Дата <= &ДатаОкончания
		|	И ЗаказНаряд.Ссылка <> &СсылкаДокумент";
	
	Запрос.УстановитьПараметр("Автомобиль", ПроверяемаяГруппа);
	Запрос.УстановитьПараметр("Выполнен", Справочники.ВидыСостоянийЗаказНарядов.Выполнен);
	Запрос.УстановитьПараметр("Закрыт", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	Запрос.УстановитьПараметр("Код", "000000005");
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДатаДокумента));
	Запрос.УстановитьПараметр("СсылкаДокумент", ?(ЗначениеЗаполнено(СсылкаДокумнет), СсылкаДокумнет, Документы.ЗаказНаряд.ПустаяСсылка()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			Возврат ВыборкаДетальныеЗаписи.СуммаДокумента > МаксимальнаяСумма;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Возврат Ложь;
КонецФункции

Функция  ПроверитьРазрешениеПользователяНаПревышениеМаксСуммы(ПользовательСистемы)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_СписокПараметровСписокПараметров.Ссылка
		|ИЗ
		|	Справочник.ТТ_СписокПараметров.СписокПараметров КАК ТТ_СписокПараметровСписокПараметров
		|ГДЕ
		|	ТТ_СписокПараметровСписокПараметров.ЗначениеПараметра = &ЗначениеПараметра
		|	И ТТ_СписокПараметровСписокПараметров.Ссылка.Код = &Код";
	
	Запрос.УстановитьПараметр("ЗначениеПараметра", ПользовательСистемы);
	Запрос.УстановитьПараметр("Код", "000000006");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

Функция ПроверитьВидРаботыНаМаксСумму(ВидРемонта)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_СписокПараметровСписокПараметров.Ссылка
		|ИЗ
		|	Справочник.ТТ_СписокПараметров.СписокПараметров КАК ТТ_СписокПараметровСписокПараметров
		|ГДЕ
		|	ТТ_СписокПараметровСписокПараметров.ЗначениеПараметра = &ЗначениеПараметра
		|	И ТТ_СписокПараметровСписокПараметров.Ссылка.Код = &Код";
	
	Запрос.УстановитьПараметр("ЗначениеПараметра", ВидРемонта);
	Запрос.УстановитьПараметр("Код", "000000005");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

Функция ПолучитьМаксСуммуПроверяемыхЗН()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_СписокПараметров.Ссылка
		|ИЗ
		|	Справочник.ТТ_СписокПараметров КАК ТТ_СписокПараметров
		|ГДЕ
		|	ТТ_СписокПараметров.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", "000000004");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МаксимальнаяСумма = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		МаксимальнаяСумма = МаксимальнаяСумма + ВыборкаДетальныеЗаписи.Ссылка.СписокПараметров.Итог("ЗначениеПараметра");
	КонецЦикла;
	
	Возврат МаксимальнаяСумма;
КонецФункции

Процедура ТТ_НоменклатураПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	
	#Если Клиент Тогда
		Если РольДоступна("ПолныеПрава") Тогда 
			Возврат;
		КонецЕсли;
		
		////Проверка доступности на изменение
		//Если (НЕ Источник.ЭтоГруппа) ИЛИ (НЕ РольДоступна("ПолныеПрава")) Тогда
		//	Если ЗначениеЗаполнено(Источник.Родитель) Тогда
		//		СтруктураРезультата = ПолучитьПраваНаЗапись(Источник.Родитель, ПараметрыСеанса.Пользователь);
		//		
		//		Если СтруктураРезультата.ЕстьОграничения Тогда
		//			//Были найдены ограничения
		//			Если Не СтруктураРезультата.ДоступноИзменение Тогда
		//				Отказ = Истина;
		//				Сообщить("У текущего пользователя отсутствуют права на изменения текущей позиции номенклатуры. При необходимости обратитесь в ИТ отдел.");
		//			КонецЕсли;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		//БизТех 20.03.2025г. Тихонов Р. убираем эту проверку <<
		//Если НЕ Источник.ЭтоГруппа Тогда 
		//	Если Источник.ТипНоменклатуры.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Шины Тогда
		//		
		//		Если обЗначениеНеЗаполнено(Источник.Производитель) Тогда
		//			Сообщить("Не заполнено значение ""Производитель"".");
		//			Отказ=Истина;
		//		КонецЕсли;
		//		
		//		Если обЗначениеНеЗаполнено(Источник.СтранаПроисхождения) Тогда
		//			Сообщить("Не заполнено значение ""Страна"".");
		//			Отказ=Истина;
		//		КонецЕсли;
		//		
		//	КонецЕсли; 
		//КонецЕсли;	
		//БизТех 20.03.2025г.>>
		
		//<<Павличенко 15.12.17\
		Если ПараметрыСеанса.Пользователь.ШаблонПрав = Справочники.Пользователи.НайтиПоКоду("Шаблон_Кладовщик_ГАЗ") тогда
			Если Источник.Ссылка.Родитель<> Источник.Родитель тогда
				 сообщить("У Вас нет прав доступа на изменение справочника Номенклатура!");
				 Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//>>Павличенко 15.12.17

	
	#КонецЕсли
	
	
КонецПроцедуры

Функция ПолучитьПраваНаЗапись(ГруппаНоменклатуры, Пользователь)
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОграничения", Ложь);
	Результат.Вставить("ДоступноИзменение", Ложь);	
	
	//Проверяем на доступной по данной папке
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТТ_ДопПраваНаНоменклатуру.Пользователь,
		|	ТТ_ДопПраваНаНоменклатуру.Номенклатура
		|ИЗ
		|	РегистрСведений.ТТ_ДопПраваНаНоменклатуру КАК ТТ_ДопПраваНаНоменклатуру
		|ГДЕ
		|	ТТ_ДопПраваНаНоменклатуру.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", ГруппаНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) Тогда
			Результат.ЕстьОграничения = Истина;
			Если ВыборкаДетальныеЗаписи.Пользователь = Пользователь Тогда
				Результат.ДоступноИзменение = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ГруппаНоменклатуры.Родитель) Тогда
		РезультатГруппы = ПолучитьПраваНаЗапись(ГруппаНоменклатуры.Родитель, Пользователь);
		
		Если НЕ Результат.ЕстьОграничения Тогда
			Результат.ЕстьОграничения = РезультатГруппы.ЕстьОграничения;
		КонецЕсли;
		
		Если Не Результат.ДоступноИзменение Тогда
			Результат.ДоступноИзменение = РезультатГруппы.ДоступноИзменение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ТТ_ПроверкаЗаплненияЯчейкиОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Проверяем пользователя в списке разрешенных
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000000009").СписокПараметров Цикл
		Если ПараметрыСеанса.Пользователь.Ссылка = Стр.ЗначениеПараметра.Ссылка Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	//Конец проверки
	
	СписокПодразделений = Справочники.ТТ_СписокПараметров.НайтиПоКоду("000000007");
	НеобходимаПроверка = Ложь;
	Для Каждого Стр Из СписокПодразделений.СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = Источник.СкладКомпании Тогда
			НеобходимаПроверка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	
	Если НеобходимаПроверка Тогда
		Счетчик = 1;
		
		Для Каждого Стр Из Источник.Товары Цикл
			Если ЗначениеЗаполнено(Стр.Ячейка) Тогда
				Если Лев(Стр.Ячейка.Код, 1) <> "а" Тогда
					Сообщить("В строке " + Строка(Счетчик) + " выбрана не верная ячейка. Проведение документа не возможно.");
					Отказ = Истина;
				КонецЕсли;
			Иначе
				Отказ = Истина;
				Сообщить("В строке " + Строка(Счетчик) + " не заполнено поле ячейка. Проведение документа не возможно.");
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


//-----------------------------------allgk-----------------------------------//
Процедура тт_ПриПроведенииПрверкаСкладОрганизацияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
//-----------------------------------allgk-----------------------------------//
	#Если Клиент Тогда
		Попытка //Проверяем склад
			Если ЗначениеЗаполнено(Источник.СкладКомпании.Организация) и (Источник.СкладКомпании.Организация <> Источник.Организация или Источник.складПолучатель.Организация <> Источник.Организация) Тогда
				//Если СкладКомпании.Организация = Организация Тогда     //Склад
				Сообщить("Проведение невозможно!" + Символы.ПС + "Организация Склада не соответствует организации документа!",СтатусСообщения.Важное);
				Отказ=Истина;				
			КонецЕсли;
		Исключение
			//Инфо = ИнформацияОбОшибке();
			//Сообщить("Описание='" + Инфо.Описание + "'");
			//Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
			//Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
			//Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
		КонецПопытки;
	#КонецЕсли
//-----------------------------------allgk-----------------------------------//
КонецПроцедуры

Процедура ттПроверкаЦехОрганизацияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
//-----------------------------------allgk-----------------------------------//
	#Если Клиент Тогда
		Попытка //Проверяем Цех
			Если ЗначениеЗаполнено(Источник.Цех.Организация) и (Источник.Цех.Организация <> Источник.Организация) Тогда     
				Сообщить("Проведение невозможно!" + Символы.ПС + "Организация цеха не соответствует организации документа!",СтатусСообщения.Важное);
				Отказ=Истина;				
			КонецЕсли;
		Исключение
    		Инфо = ИнформацияОбОшибке();
    		Сообщить("Описание='" + Инфо.Описание + "'");
    		Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    		Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    		Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
		КонецПопытки;
	#КонецЕсли
//-----------------------------------allgk-----------------------------------//
КонецПроцедуры

Процедура ТТ_проверкаЗаполненияГИПриЗаписи(Источник, Отказ) Экспорт
	
	ГИ = обПолучитьЗначениеСвойства(Источник,"Государственный идентификатор",Неопределено);
		
	Если ГИ = "" Тогда
		сообщить ("Не заполнен государственный идентификатор!" + Символы.ПС + "Для государственных контрактов обязательное поле!");
	КонецЕсли;
КонецПроцедуры

//<<Павличенко 28.09.17
//по заявке Лукаш С.В. все договоры взаиморасчетов по организации ООО "Техно Темп" 
//с видом "поставка" и прочее будут редактировать лишь люди из определенного списка
//в справочнике ТТ_СписокПараметров
Процедура ТТ_ПроверкаДоговоровВзаиморасчетов(Источник, Отказ) Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ВидыДоговоров.Покупка);
	Массив.Добавить(Перечисления.ВидыДоговоров.Прочее);

	Если Массив.Найти(Источник.ВидДоговора) = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Организация <> Справочники.Организации.НайтиПоКоду("00001   ") тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015008").СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = ПараметрыСеанса.Пользователь Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	сообщить ("У вас нет прав доступа на изменение договоров поставка/прочее по организации ООО ""Техно-Темп""! Обратитесь в бухгалтерию");
	Отказ = Истина;
КонецПроцедуры
//>>Павличенко 28.09.17
//<<Павличенко 24.10.17
Процедура ТТ_ПроверкаДатыДействияДоговораВПоступленияхПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//Возврат;//до выяснения обстоятельств
	Если Источник.Организация <> Справочники.Организации.НайтиПоКоду("00001   ") тогда       //только техно-темп
		Возврат;
	КонецЕсли;
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015009").СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = ПараметрыСеанса.Пользователь Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	Если Источник.ДоговорВзаиморасчетов.ДатаКонца = Дата(1,1,1) тогда
		Возврат;
	//	сообщить ("У договора нет даты окончания! Документ не может быть записан!");
	//	Отказ = Истина;
	ИначеЕсли  Источник.ДоговорВзаиморасчетов.ДатаКонца < Источник.Дата тогда
		сообщить ("Дата окончания договора меньше даты документа! Документ не может быть записан");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
//>>Павличенко 24.10.17

// <<Ульянов 15.11.17
Процедура ТТ_ПроверкаЦФОИнвентаризацияПриПроведении(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.Дата < Дата(2017, 11, 1) Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Объект.Установить(Источник.Ссылка);
	НаборЗаписей.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("04204"));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 или НаборЗаписей[0].Значение = Неопределено Тогда
			
		Сообщить("Необходимо указать ЦФО Бренд. Для этого сначала документ нужно записать, затем в Панели свойств указать ЦФО Бренд и после этого провести документ.");
		Отказ = Истина;
	КонецЕсли;	
	
	
	НаборЗаписей.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("04205"));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 или НаборЗаписей[0].Значение = Неопределено Тогда
			
		Сообщить("Необходимо указать ЦФО Подразделение. Для этого сначала документ нужно записать, затем в Панели свойств указать ЦФО Подразделение и после этого провести документ.");
		Отказ = Истина;
	КонецЕсли;	

	
	
КонецПроцедуры	
//>>Ульянов


//<<Павличенко 28.11.17
//заявка Куновой О.
Процедура ТТ_ПриЗаписиРеализацииТоваровПриЗаписи(Источник, Отказ) Экспорт
	Если РольДоступна("ВосстПослед") тогда
		Возврат;
	КонецЕсли;
	Если (Источник.Организация <> Справочники.Организации.НайтиПоКоду("ТАС00001")) И (Источник.Организация <> Справочники.Организации.НайтиПоКоду("ИПК00001")) тогда       //только темп авто сервис  и кунова
		Возврат;
	КонецЕсли;
	
	Если (Источник.ДоговорВзаиморасчетов.ДатаКонца <> Дата(1,1,1)) И (Источник.ДоговорВзаиморасчетов.ДатаКонца < НачалоДня(Источник.Дата)) тогда
		сообщить ("Дата окончания договора меньше даты документа! Документ не может быть записан");
		Отказ = Истина;
	КонецЕсли;
		Если Источник.Организация = Справочники.Организации.НайтиПоКоду("ИПК00001") тогда //дальше только для Темп Авто Сервис
		Возврат;
	КонецЕсли;
	//<<Павличенко 03.04.18
	//заявка Куновой
	Если Источник.ХозОперация <> Справочники.ХозОперации.РеализацияТоваров тогда
		Возврат;
	КонецЕсли;	
	НастройкиТАС = Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015011");
	//СтрокаСклады = НастройкиТАС.СписокПараметров.Найти("СкладКомпании", "ЗначениеПараметра"); 
	//СтрокаПодразделения = НастройкиТАС.СписокПараметров.Найти("ПодразделениеКомпании", "ЗначениеПараметра"); 
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ЗначениеПараметра", "СкладКомпании");
	Табл = НастройкиТАС.СписокПараметров.Выгрузить(ПараметрыОтбора, "Параметр1, Параметр2, Параметр3, Параметр4, Параметр5");
	Если Табл.Найти(Источник.СкладКомпании) = Неопределено тогда
		сообщить ("Документ не может быть записан! Реализация товаров по ТАС со склада " + Источник.СкладКомпании + " запрещена!");
		Отказ = Истина;
	КонецЕсли;	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ЗначениеПараметра", "ПодразделениеКомпании");
	Табл = НастройкиТАС.СписокПараметров.Выгрузить(ПараметрыОтбора, "Параметр1, Параметр2, Параметр3, Параметр4, Параметр5");
	
	Если Табл.Найти(Источник.ПодразделениеКомпании) = Неопределено тогда
		сообщить ("Документ не может быть записан! Реализация товаров по ТАС из подразделения " + Источник.ПодразделениеКомпании + " запрещена!");
		Отказ = Истина;
	КонецЕсли;	
	//>>Павличенко 03.04.18
КонецПроцедуры
//заявка Черкашиной Т.
Процедура ТТ_ПриПроведенииПоступленияДопРасходовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если РольДоступна("ВосстПослед") тогда
		Возврат;
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Услуги.Номенклатура КАК Услуга
	|ПОМЕСТИТЬ Услуги
	|ИЗ
	|	&Услуги КАК Услуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Услуги.Услуга,
	|	Номенклатура.СпособРаспределенияДопРасходов
	|ИЗ
	|	Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Услуги.Услуга = Номенклатура.Ссылка
	|ГДЕ
	|	НЕ Номенклатура.СпособРаспределенияДопРасходов В (&СписокСпособовРаспределенияДопРасходов)";
	
		
	Запрос.УстановитьПараметр("Услуги", Источник.Товары);
	СписокСпособовРаспределенияДопРасходов = Новый СписокЗначений();
	СписокСпособовРаспределенияДопРасходов.Добавить(Перечисления.СпособыРаспределенияДопРасходов.ПоКоличеству);
	СписокСпособовРаспределенияДопРасходов.Добавить(Перечисления.СпособыРаспределенияДопРасходов.ПоСумме);
	Запрос.УстановитьПараметр("СписокСпособовРаспределенияДопРасходов", СписокСпособовРаспределенияДопРасходов);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		сообщить("Для услуги " + ВыборкаДетальныеЗаписи.Услуга + " выбран неверный способ распределения дополнительных расходов! Нужно выбрать ""по количеству"" или ""по сумме""");
		сообщить("" + Источник + " не может быть проведен!");
		Отказ = Истина;
	КонецЦикла;

КонецПроцедуры
//>>Павличенко 28.11.17

//<<Павличенко 30.11.17
//заявка Черкашиной Т.
Процедура ТТ_ПоступлениеАвтомобилейПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если РольДоступна("ВосстПослед") тогда
		Возврат;
	КонецЕсли;	
	//<<Павличенко 10.04.18
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль,
	|	ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель.КатегорияТС
	|ИЗ
	|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
	|ГДЕ
	|	ПоступлениеАвтомобилейАвтомобили.Ссылка = &Ссылка
	|	И ПоступлениеАвтомобилейАвтомобили.Автомобиль.Модель.КатегорияТС = &ПустаяКатегорияТС";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("ПустаяКатегорияТС", Справочники.КатегорииТранспортныхСредств.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() тогда
		сообщить("Запрещено проводить документ Поступление автомобилей с неуказанной в модели автомобиля категорией транспортного средства!");
		Отказ = Истина;
	КонецЕсли;	
	//>>Павличенко 10.04.18
	//Если Источник.СкладКомпании <> Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007") тогда
		Возврат;
	//КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
	|	И ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Объект", Источник.Ссылка);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	ТаблицаВыгрузки = Запрос.Выполнить().Выгрузить();
	Если ТаблицаВыгрузки.Количество() = 0 тогда
		сообщить("Не указан заказ на автомобиль Trade IN в свойствах документа! Документ не записан! ");
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры
//>>Павличенко 30.11.17

// Ульянов 22.03.18
Процедура ТТ_ПриЗаписиСтраховогоПолисаПриЗаписи(Источник, Отказ) Экспорт
	// Вставить содержимое обработчика.
	Контрагент=Источник.Страхователь;
	Договор=Источник.ДоговорВзаиморасчетов;
	
	НетДоговора=Ложь;
	
	Если Договор.Организация <> Источник.Организация Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	ДоговорыВзаиморасчетов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Организация = &Организация
		|	И ДоговорыВзаиморасчетов.Владелец = &Контрагент
		|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ" ;
		Запрос.УстановитьПараметр("Организация",Источник.Организация);
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		Результат=Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			НетДоговора =	Истина;
		Иначе // Нашли договор
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ДоговорСсылка = Выборка.Ссылка;
			КонецЦикла;
			Источник.ДоговорВзаиморасчетов=Выборка.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
		СвойствоДДС = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02045");	
		СвойствоСервис = Справочники.ЗначенияСвойств.НайтиПоНаименованию("Страхование", Истина,, СвойствоДДС);

		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект,
		|ЗначенияСвойствОбъектов.Свойство,
		|ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект = &Объект
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Значение = &Значение";
		Запрос.УстановитьПараметр("Объект",Договор);
		Запрос.УстановитьПараметр("Свойство",СвойствоДДС);
		Запрос.УстановитьПараметр("Значение",СвойствоСервис);
		Результат=Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			НетДоговора =	Истина;
		КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) ИЛИ НетДоговора Тогда  //Создадим договор
		Права = Неопределено;
		ВидДоговора   = Перечисления.ВидыДоговоров.Продажа;
		ТипЦенПокупки = Справочники.ТипыЦен.ПустаяСсылка();
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", Права);
		ТипЦенРабот   = обПраво("ОсновнойТипЦенРабот",   Права);
		НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		НовыйДоговор.УстановитьНовыйКод();
		НовыйДоговор.Владелец = Контрагент.Ссылка;
		НовыйДоговор.ВидДоговора = ВидДоговора;
		НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
		НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
		НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		НовыйДоговор.Организация = Источник.Организация;
		НовыйДоговор.Подразделение = Источник.ПодразделениеКомпании;
		НовыйДоговор.ОбработкаЗаполнения(Неопределено);
		НовыйДоговор.ДатаНачала=Источник.Дата;
		НовыйДоговор.НомерДоговора=Источник.СерияПолиса+" "+Источник.НомерПолиса;
		НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас;
		НовыйДоговор.Записать(); 
		Источник.ДоговорВзаиморасчетов = НовыйДоговор.Ссылка;	
		
			НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();  //Назначим договору свойство ДДС - Страхование
			НаборЗаписей.Отбор.Объект.Установить(Источник.ДоговорВзаиморасчетов.Ссылка);
			НаборЗаписей.Отбор.Свойство.Установить(СвойствоДДС);
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Объект = Источник.ДоговорВзаиморасчетов.Ссылка;
			НоваяЗапись.Свойство = СвойствоДДС;
			НоваяЗапись.Значение = СвойствоСервис;
			НаборЗаписей.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры


//<<Павличенко 03.04.18
Процедура ТТ_ПлатежноеПоручениеПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
		Если РольДоступна("ВосстПослед") тогда
		Возврат;
	КонецЕсли;	
	Если Источник.ДокументОснование = Неопределено тогда
		Сообщить ("Нельзя вводить Платежное поручение с неуказанным документом-основанием!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
КонецПроцедуры
//>>Павличенко 03.04.18
// Ульянов 08.10.18
Процедура ТТ_РабочийЛистКредитногоПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Отказ = Истина;
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015013").СписокПараметров Цикл
		Если Источник.КредитнаяПрограмма = стр.ЗначениеПараметра Тогда 
			Если Источник.Организация=стр.Параметр1 Тогда
				Отказ = Ложь;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ=Истина Тогда
		Сообщить("Для данной кредитной программы необходимо выбрать другую организацию");
		Возврат; 
    КонецЕсли;
		
	
КонецПроцедуры

//misha2
Процедура ТТ_ЗаявкаДС_ПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//#Если Клиент Тогда
	
	//anton 27/03/2019
	Если Источник.ОбменДанными.Загрузка=Истина Тогда
		Возврат;
	КонецЕсли;
	
	//Если Источник.СтатусТТ <> Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка И
	//	НЕ обПраво("ИзменениеСтатусаЗаявкиНаРасходДС")
	//	Тогда
	//	Сообщить("Нет прав на установку выбранного статуса заявки!");
	//	Отказ = Истина;		
	//КонецЕсли;
	//anton 27/03/2019
	
	Для Каждого Стр Из Источник.Платежи Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ДатаПлатежа) Тогда
			Сообщить("Не заполнена дата платежа!");
			Отказ = Истина;
		КонецЕсли;
		
		//anton 27/03/2019
		Если НачалоДня(Стр.ДатаПлатежа) < НачалоДня(Источник.Дата) Тогда
			Сообщить("Дата платежа не может быть раньше даты документа!");
			Отказ = Истина;
		КонецЕсли;
		
		Источник.ДатаПлатежа=Стр.ДатаПлатежа;
		//anton 27/03/2019
		
		
		Если Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплата или
			Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Резерв Тогда
			
			Если НачалоДня(Стр.ДатаПлатежа) = НачалоДня(ИСточник.Дата) Тогда
				Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплата;
			Иначе
				Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Резерв;
			КонецЕсли;
			
			СтатьяДДС = обПолучитьЗначениеСвойства(Источник,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02043"));
			Если НЕ СтатьяДДС.ТТ_ПроверятьПоПлану Тогда
				Возврат;
			КонецЕсли;
			
			СуммаПлана=0;
			СуммаРезерв = 0;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТТ_ФактПоУтвержденнымЗаявкамДСОстатки.СтатьяДДСУпр,
			|	ТТ_ФактПоУтвержденнымЗаявкамДСОстатки.СуммаОстаток КАК Сумма
			|ИЗ
			|	РегистрНакопления.ТТ_ФактПоУтвержденнымЗаявкамДС.Остатки(&ДатаОтч, ) КАК ТТ_ФактПоУтвержденнымЗаявкамДСОстатки
			|ГДЕ
			|	ТТ_ФактПоУтвержденнымЗаявкамДСОстатки.Организация = &Организация
			|	И ТТ_ФактПоУтвержденнымЗаявкамДСОстатки.СтатьяДДСУпр = &СтатьяДДСУпр";
			
			Запрос.УстановитьПараметр("ДатаОтч", (Стр.ДатаПлатежа-1));
			Запрос.УстановитьПараметр("Организация", Источник.Организация);
			Запрос.УстановитьПараметр("СтатьяДДСУпр", СтатьяДДС);
			
			Рез = Запрос.Выполнить().Выгрузить();
			
			СуммаРезерв = Рез.Итог("Сумма");
						
			Запрос2 = Новый Запрос;
			Запрос2.Текст = 
			"ВЫБРАТЬ
			|	ПланФактПоказатели.ВидАналитикиПланирования1 КАК Статья,
			|	ПланФактПоказатели.ПоказательПлана1 КАК Сумма
			|ИЗ
			|	Документ.ПланФакт.Показатели КАК ПланФактПоказатели
			|ГДЕ
			|	ПланФактПоказатели.Ссылка.Проведен = ИСТИНА
			|	И ПланФактПоказатели.Ссылка.Организация = &Организация
			|	И ПланФактПоказатели.Ссылка.ХозОперация = &ХозОперация
			|	И ПланФактПоказатели.Ссылка.ВидПлана = &ВидПлана
			|	И ПланФактПоказатели.Ссылка.ДатаНачала = &ДатаНачала
			|	И ПланФактПоказатели.Ссылка.ДатаКонца = &ДатаКонца
			|	И ПланФактПоказатели.ВидАналитикиПланирования1 = &Статья";
			
			Запрос2.УстановитьПараметр("ВидПлана", Справочники.ВидыПлановКомпании.НайтиПоНаименованию("Упр. ДДС (расходы)",истина));
			Запрос2.УстановитьПараметр("ДатаКонца", НачалоДня(КонецМесяца(Стр.ДатаПлатежа)));
			Запрос2.УстановитьПараметр("ДатаНачала", НачалоМесяца(Стр.ДатаПлатежа));
			Запрос2.УстановитьПараметр("Организация", Источник.Организация);
			Запрос2.УстановитьПараметр("Статья", СтатьяДДС);
			Запрос2.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.План);
			
			Рез2 = Запрос2.Выполнить().Выгрузить();
			
			СуммаПлана = Рез2.Итог("Сумма");
			
			Если (Стр.Сумма+СуммаРезерв) > СуммаПлана Тогда
				Сообщить("По статье "+СтатьяДДС+" в планировании расходов на "+Формат(Стр.ДатаПлатежа,"ДФ=MMMM")+" месяц, недостаточно средств! "+"План: "+СуммаПлана+" Резерв: "+СуммаРезерв+" в документе: "+Стр.Сумма);
				Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.НеВплане;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
//#КонецЕсли		
КонецПроцедуры

Процедура ТТ_ЗаявкаДС_ПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка или
		Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.НеВплане или
		Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Отклонена Тогда
		Сообщить("Документ можно провести только со статусом - Резерв ДС или Заявка к оплате!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//Источник = Документы.ЗаявкаНаРасходДС.НайтиПоНомеру("").ПолучитьОбъект();
	Источник.Движения.ТТ_ФактПоУтвержденнымЗаявкамДС.Очистить();
	
	НаборЗаписей = Источник.Движения.ТТ_ФактПоУтвержденнымЗаявкамДС.ДобавитьПриход();
	
	Для Каждого Стр Из Источник.Платежи Цикл
		НаборЗаписей.Организация = ИСточник.Организация;
		НаборЗаписей.Период = Стр.ДатаПлатежа;
		НаборЗаписей.Подразделение = Источник.ПодразделениеКомпании;
		НаборЗаписей.Регистратор = Источник.Ссылка;
		
		СтатьяДДС = обПолучитьЗначениеСвойства(Источник,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02043"));
		НаборЗаписей.СтатьяДДСУпр = СтатьяДДС;
		НаборЗаписей.Сумма	= Стр.Сумма;
	КонецЦикла;
	
КонецПроцедуры

Процедура ТТ_ЗаявкаДС_ПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Источник.СтатусТТ) Тогда
		Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
	КонецЕсли;
КонецПроцедуры

Процедура ТТ_ЗаявкаДС_ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Источник.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
КонецПроцедуры
// 08.10.18
