
&НаКлиенте
Процедура УстановитьОграничениеТипа()
	
	Элементы.ОбъектДоступа.Доступность = Истина;
	Если НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Организация") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Организации");
		Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Подразделение") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
		Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Пользователь") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	Иначе
		Элементы.ОбъектДоступа.Доступность           = Ложь;
		ОбъектДоступа = Неопределено;
	КонецЕсли;
	
	Если НазначениеДоступа.Пустая() Тогда
		Список.Параметры.УстановитьЗначениеПараметра("НазначениеДоступа", "");
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("НазначениеДоступа", НазначениеДоступа);
	КонецЕсли;
	
	ОбъектДоступаПриИзменении(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтборыСписка(КлючОтчета)
	
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь",  ПараметрыСеанса.Пользователь);
	Список.Параметры.УстановитьЗначениеПараметра("Подразделение", ПараметрыСеанса.ПодразделениеКомпании);
	Список.Параметры.УстановитьЗначениеПараметра("Организация",   ПараметрыСеанса.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("КлючОтчета",    КлючОтчета);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоОтчетов(СтруктураПодсистем, СтруктураОтчетов)
	
	Для Каждого ТекСтрока Из СтруктураПодсистем.Подсистемы Цикл
		НоваяСтрока = СтруктураОтчетов.Строки.Добавить();
		НоваяСтрока.Представление = ТекСтрока.Синоним;
		ЗаполнитьДеревоОтчетов(ТекСтрока, НоваяСтрока);
		Для Каждого ОтчетПодсистемы Из ТекСтрока.Состав Цикл
			Если (НЕ Метаданные.Отчеты.Содержит(ОтчетПодсистемы)) ИЛИ 
				(НЕ ОтчетПодсистемы.ОсновнаяФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйОтчет = НоваяСтрока.Строки.Добавить();
			НовыйОтчет.Представление = ОтчетПодсистемы.Синоним;
			НовыйОтчет.КлючОтчета    = ОтчетПодсистемы.ПолноеИмя();
		КонецЦикла;
	КонецЦикла;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураОтчетов = РеквизитФормыВЗначение("ДеревоОтчетов", Тип("ДеревоЗначений"));
	
	ЗаполнитьДеревоОтчетов(Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Отчеты, СтруктураОтчетов);
	
	ЗначениеВРеквизитФормы(СтруктураОтчетов, "ДеревоОтчетов");
	
	ЭтаФорма.ДеревоОтчетовТекущаяСтрока = -1;
	Элементы.ДеревоОтчетов.ТекущаяСтрока = 0;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборНаименование", ОтборНаименование);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборАвтор",        ОтборАвтор);
	
	ДеревоОтчетовУстановитьПараметрыСписка();
	
	Если Параметры.Свойство("ВыбранныеЗначения") Тогда
		ВыбранныеЗначения = Параметры.ВыбранныеЗначения;
		Для Каждого Элемент Из ВыбранныеЗначения Цикл
			ВыбранныйОтчет = Элемент.Значение;
			НоваяСтрока = ПодобранныеВарианты.Добавить();
			НоваяСтрока.Отчет               = ВыбранныйОтчет;
			НоваяСтрока.Представление       = ВыбранныйОтчет.Наименование;
			НоваяСтрока.ПредставлениеОтчета = ВыбранныйОтчет.ПредставлениеОтчета;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	Если РежимРаботыФормы = "ВсеОтчетыРаздела" Тогда
//		Элементы.ДеревоПодсистем.Развернуть(ДеревоПодсистемТекущаяСтрока, Истина);
//	КонецЕсли;
//КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// Вызывается после загрузки данных из настроек в реквизиты формы
	
	ОтборНаименованиеСписокВыбора = Настройки.Получить("ОтборНаименованиеСписокВыбора");
	Если ТипЗнч(ОтборНаименованиеСписокВыбора) = Тип("Массив") Тогда
		Элементы.ОтборНаименование.СписокВыбора.ЗагрузитьЗначения(ОтборНаименованиеСписокВыбора);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборНаименование",  ОтборНаименование);
	Список.Параметры.УстановитьЗначениеПараметра("ОтборАвтор",         ОтборАвтор);
	//Список.Параметры.УстановитьЗначениеПараметра("ВключаяПодчиненные", ВключаяПодчиненные);
КонецПроцедуры

//&НаСервере
//Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
//	Настройки.Вставить("ОтборНаименованиеСписокВыбора", Элементы.ОтборНаименование.СписокВыбора.ВыгрузитьЗначения());
//КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборНаименованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборНаименование) Тогда
		СписокВыбора = Элементы.ОтборНаименование.СписокВыбора;
		ЭлементСписка = СписокВыбора.НайтиПоЗначению(ОтборНаименование);
		Если ЭлементСписка = Неопределено Тогда
			СписокВыбора.Вставить(0, ОтборНаименование);
			Если СписокВыбора.Количество() > 10 Тогда
				СписокВыбора.Удалить(10);
			КонецЕсли;
		Иначе
			Индекс = СписокВыбора.Индекс(ЭлементСписка);
			Если Индекс <> 0 Тогда
				СписокВыбора.Сдвинуть(Индекс, -Индекс);
			КонецЕсли;
		КонецЕсли;
		ТекущийЭлемент = Элементы.ОтборНаименование;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ОтборНаименование", ОтборНаименование);
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ОтборАвтор", ОтборАвтор);
КонецПроцедуры

//&НаКлиенте
//Процедура ВключаяПодчиненныеПриИзменении(Элемент)
//	Список.Параметры.УстановитьЗначениеПараметра("ВключаяПодчиненные", ВключаяПодчиненные);
//КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДеревоПодсистем


&НаКлиенте
Процедура ДеревоОтчетовПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ДеревоОтчетовОбработчикАктивизацииСтроки", 0.1, Истина);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Список

&НаКлиенте
Процедура ДеревоОтчетовОбработчикАктивизацииСтроки()
	
	ДеревоОтчетовУстановитьПараметрыСписка();
	
КонецПроцедуры

&НаСервере
Процедура ДеревоОтчетовУстановитьПараметрыСписка()
	
	Если ДеревоОтчетовТекущаяСтрока = Элементы.ДеревоОтчетов.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ДеревоОтчетовТекущаяСтрока = Элементы.ДеревоОтчетов.ТекущаяСтрока;
	
	СтрокаДерева = ЭтаФорма.ДеревоОтчетов.НайтиПоИдентификатору(ЭтаФорма.ДеревоОтчетовТекущаяСтрока);
	Если СтрокаДерева = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОтборыСписка(СтрокаДерева.КлючОтчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьМассивОтчетов(СтруктураПодсистем, ТаблицаОтчетов)
	
	Для Каждого ТекСтрока Из СтруктураПодсистем.Подсистемы Цикл
		Для Каждого ОтчетПодсистемы Из ТекСтрока.Состав Цикл
			
			Если (НЕ Метаданные.Отчеты.Содержит(ОтчетПодсистемы)) ИЛИ 
				(НЕ ОтчетПодсистемы.ОсновнаяФорма.ТипФормы = Метаданные.СвойстваОбъектов.ТипФормы.Управляемая) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОтчетов.Добавить();
			НоваяСтрока.КлючОтчета    = ОтчетПодсистемы.ПолноеИмя();
			НоваяСтрока.Представление = ОтчетПодсистемы.Синоним;
			НоваяСтрока.Имя           = ОтчетПодсистемы.Имя;
		КонецЦикла;
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПерезаполнитьВарианты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.КлючОтчета          = &КлючОтчета И 
	|	ВариантыОтчетов.Автор               = &Автор И 
	|	ВариантыОтчетов.КлючВарианта        = &КлючВарианта И 
	|	ВариантыОтчетов.ЭтоПредопределенный = &Предопределенный";
	
	ТаблицаОтчетов = Новый ТаблицаЗначений;
	ТаблицаОтчетов.Колонки.Добавить("КлючОтчета");
	ТаблицаОтчетов.Колонки.Добавить("Представление");
	ТаблицаОтчетов.Колонки.Добавить("Имя");
	
	ПользовательСеанса = ПараметрыСеанса.Пользователь;
	Запрос.УстановитьПараметр("Автор", ПользовательСеанса);
	
	ЗаполнитьМассивОтчетов(Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Отчеты, ТаблицаОтчетов);
	
	Для Каждого ТекСтрока Из ТаблицаОтчетов Цикл
		
		ОтчетОбъект = Отчеты[ТекСтрока.Имя].Создать();
		СхемаКомпоновки = ОтчетОбъект.СхемаКомпоновкиДанных;
		
		Запрос.УстановитьПараметр("КлючОтчета", ТекСтрока.КлючОтчета);
		
		Для Каждого ТекВариантНастроек Из СхемаКомпоновки.ВариантыНастроек Цикл
			Запрос.УстановитьПараметр("КлючВарианта",     ТекВариантНастроек.Имя);
			Запрос.УстановитьПараметр("Предопределенный", Истина);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ВариантыОтчета = Выборка.Ссылка.ПолучитьОбъект();
				ВариантыОтчета.Наименование        = ТекВариантНастроек.Представление;
				ВариантыОтчета.ПредставлениеОтчета = ТекСтрока.Представление;
				//ВариантыОтчета.НазначениеДоступа   = Перечисления.НазначениеПравИНастроек.Компания;
			Иначе
				ВариантыОтчета = Справочники.ВариантыОтчетов.СоздатьЭлемент();
				ВариантыОтчета.Наименование        = ТекВариантНастроек.Представление;
				ВариантыОтчета.КлючОтчета          = ТекСтрока.КлючОтчета;
				ВариантыОтчета.ПредставлениеОтчета = ТекСтрока.Представление;
				ВариантыОтчета.КлючВарианта        = ТекВариантНастроек.Имя;
				ВариантыОтчета.Автор               = ПользовательСеанса;
				ВариантыОтчета.ЭтоПредопределенный = Истина;
				ВариантыОтчета.НазначениеДоступа   = Перечисления.НазначениеПравИНастроек.Компания;
			КонецЕсли;
			ВариантыОтчета.Настройки = Новый ХранилищеЗначения(ТекВариантНастроек.Настройки);
			ВариантыОтчета.Записать();
		КонецЦикла;
		//СписокСохраненныхВариантов = ХранилищеВариантовОтчетов.ПолучитьСписок(ТекСтрока.КлючОтчета);
		ВыборкаВариантов = ХранилищеВариантовОтчетов.Выбрать(Новый Структура("КлючОбъекта", ТекСтрока.КлючОтчета));
		Пока ВыборкаВариантов.Следующий() Цикл
			Запрос.УстановитьПараметр("КлючВарианта",     ВыборкаВариантов.КлючНастроек);
			Запрос.УстановитьПараметр("Предопределенный", Ложь);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ВариантыОтчета = Выборка.Ссылка.ПолучитьОбъект();
				ВариантыОтчета.Наименование        = ВыборкаВариантов.Представление;
				ВариантыОтчета.ПредставлениеОтчета = ТекСтрока.Представление;
				//ВариантыОтчета.НазначениеДоступа   = Перечисления.НазначениеПравИНастроек.Компания;
			Иначе
				ВариантыОтчета = Справочники.ВариантыОтчетов.СоздатьЭлемент();
				ВариантыОтчета.Наименование              = ВыборкаВариантов.Представление;
				ВариантыОтчета.КлючВарианта              = ВыборкаВариантов.КлючНастроек;
				ВариантыОтчета.КлючОтчета                = ТекСтрока.КлючОтчета;
				ВариантыОтчета.ПредставлениеОтчета       = ТекСтрока.Представление;
				ВариантыОтчета.Автор                     = ПользовательСеанса;
				ВариантыОтчета.ЭтоПредопределенный       = Ложь;
				ВариантыОтчета.ПользовательскаяНастройка = Истина;
				ВариантыОтчета.НазначениеДоступа         = Перечисления.НазначениеПравИНастроек.Компания;
			КонецЕсли;
			ВариантыОтчета.Настройки = Новый ХранилищеЗначения(ВыборкаВариантов.Настройки);
			ВариантыОтчета.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеДоступаПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектДоступаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОбъектДоступа) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОбъектДоступа", ОбъектДоступа);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОбъектДоступа", "");
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавленныеРассылки = ПодобранныеВарианты.НайтиСтроки(Новый Структура("Отчет", ВыбраннаяСтрока));
	Если ДобавленныеРассылки.Количество() = 0 Тогда
		НоваяСтрока = ПодобранныеВарианты.Добавить();
		НоваяСтрока.Отчет               = ВыбраннаяСтрока;
		НоваяСтрока.Представление       = ВыбраннаяСтрока.Наименование;
		НоваяСтрока.ПредставлениеОтчета = ВыбраннаяСтрока.ПредставлениеОтчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобранныеВариантыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДобавленныеРассылки = ПодобранныеВарианты.НайтиСтроки(Новый Структура("Отчет", Значение));
	Если ДобавленныеРассылки.Количество() = 0 Тогда
		НоваяСтрока = ПодобранныеВарианты.Добавить();
		НоваяСтрока.Отчет               = Значение;
		НоваяСтрока.Представление       = Значение.Наименование;
		НоваяСтрока.ПредставлениеОтчета = Значение.ПредставлениеОтчета;
	КонецЕсли;
	
КонецПроцедуры
