
// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	
	//Заполнение кодов маркировки
	
	ТоварныеГруппы = ПоддерживаемыеТоварныеГруппы();
	
	// Для меха код маркировки "00 02"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ИзделияИзМеха.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 2;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для лекарств код маркировки "00 03"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ЛекарственныеПрепараты.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 3;
	КонецЕсли;
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для табак код маркировки "00 05"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ТабачнаяПродукция.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 5;
	КонецЕсли;
	
	ЗаполнитьТоварныеГруппы(ТекущийТипМаркировки, "tobacco", ТоварныеГруппы);
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для обуви код маркировки "15 20"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ОбувныеТовары.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 5408;
	КонецЕсли;
	
	ЗаполнитьТоварныеГруппы(ТекущийТипМаркировки, "shoes", ТоварныеГруппы);
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Для шин код маркировки "22 11"
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ШиныИАвтопокрышки.ПолучитьОбъект();
	
	Если ТекущийТипМаркировки.КодМаркировки = 0 Тогда
		ТекущийТипМаркировки.КодМаркировки = 8721;
	КонецЕсли;
	
	ЗаполнитьТоварныеГруппы(ТекущийТипМаркировки, "tires", ТоварныеГруппы);
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Парфюмерия
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.Парфюмерия.ПолучитьОбъект();
	
	ЗаполнитьТоварныеГруппы(ТекущийТипМаркировки, "perfumery", ТоварныеГруппы);
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Легкая промышленность
	ТекущийТипМаркировки = Справочники.ТипыМаркировки.ЛегкаяПромышленность.ПолучитьОбъект();
	
	ЗаполнитьТоварныеГруппы(ТекущийТипМаркировки, "lp", ТоварныеГруппы);
	
	НовыйЭлемент = ТекущийТипМаркировки.ЭтоНовый();
	Если ТекущийТипМаркировки.Модифицированность() Тогда
		Попытка
			ТекущийТипМаркировки.Записать();
			#Если Клиент Тогда
			Сообщить("Справочник ""Типы маркировки"". "+?(НовыйЭлемент,"Создан","Обновлен")+" элемент """+СокрЛП(ТекущийТипМаркировки.Наименование)+"""");
			#КонецЕсли
		Исключение КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()

// Возвращает список поддерживаемых товарных групп
//
// Возвращаемое значение:
//  Структура - поддерживаемые товарные группы.
//
Функция ПоддерживаемыеТоварныеГруппы() Экспорт
	
	Результат = Новый Структура();
	
	Макет = Справочники.ТипыМаркировки.ПолучитьМакет("ПоддерживаемыеТоварныеГруппы");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		Наименование = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		Если ПустаяСтрока(Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = Новый Структура();
		Значение.Вставить("Описание", СокрЛП(Макет.Область(НомерСтроки, 2).Текст));
		Значение.Вставить("КодТоварнойГруппы", СокрЛП(Макет.Область(НомерСтроки, 3).Текст));
		Значение.Вставить("ДоступноСозданиеДокументов", НЕ обЗначениеНеЗаполнено(СокрЛП(Макет.Область(НомерСтроки, 4).Текст)));
		Результат.Вставить(Наименование, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТоварныеГруппы(Объект, ТоварнаяГруппа, ТоварныеГруппы)
	
	Значение = Неопределено;
	
	Если ТоварныеГруппы.Свойство(ТоварнаяГруппа, Значение) Тогда
		Объект.ТоварнаяГруппа = ТоварнаяГруппа;
		Объект.КодТоварнойГруппы = Значение.КодТоварнойГруппы;
		Объект.ДоступноСозданиеДокументов = Значение.ДоступноСозданиеДокументов;
	КонецЕсли;
	
КонецПроцедуры
