Перем ДокументОбъект Экспорт;    // ДокументОбъект.
Перем ШапкаДокумента Экспорт;    // Выборка из запроса по реквизитам документа
Перем НеПроводитьПартии Экспорт; // Булево. Истина-документ не надо допроводить по партиям

// Зафиксировать
Функция Зафиксировать() Экспорт
	// проверим надо ли фиксировать непроведение партий
	НеПроводитьПартии=Ложь;
	ОтложенноеПроведениеПоПартиям=Ложь;
	
	// определим режим проведения по партиям
	РежимПроведенияПоПартиям = одОбменДанными.ПолучитьРежимПроведенияПоПартиям();
	
	Попытка
		ОтложенноеПроведениеПоПартиям = (РежимПроведенияПоПартиям = Перечисления.РежимыПроведенияПартий.ПартииОтсутствуют);
	Исключение
		ОтложенноеПроведениеПоПартиям=Ложь;
	КонецПопытки; 
	Если НЕ (ДокументОбъект.Ссылка=ШапкаДокумента.Ссылка И ОтложенноеПроведениеПоПартиям) Тогда
		ШапкаДокумента=Неопределено;
		ДокументОбъект=Неопределено;
		Возврат Истина;
	КонецЕсли;
	
	// зафиксируем, что документ надо допровести
	НоваяЗапись=Добавить();
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=ШапкаДокумента.ПодразделениеКомпании;
	
	НеПроводитьПартии=Истина;
	
	ШапкаДокумента=Неопределено;
	ДокументОбъект=Неопределено;
	
	Возврат Истина;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()


