#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ВозвратПоставщику" , "Возвратная накладная");
	СтруктураМакетов.Вставить("ТОРГ12"            , "ТОРГ-12 (Товарная накладная)");
	СтруктураМакетов.Вставить("МХ3"               , "МХ-3 (Акт о возврате ТМЦ)");
	СтруктураМакетов.Вставить("ЭтикетокИЦенников" ,"Печать этикеток и ценников");
	СтруктураМакетов.Вставить("УПД"               , "Универсальный передаточный документ");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра "Операции прослеживаемых товаров"
//
// Возвращаемое значение:
//  Строка - текст запроса
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГТДПартийТоваровКомпании.Регистратор КАК Регистратор,
	|	ГТДПартийТоваровКомпании.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
	|ГДЕ
	|	ГТДПартийТоваровКомпании.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ГТДПартийТоваровКомпании.ГТД.РНПТ
	|	И ГТДПартийТоваровКомпании.Регистратор ССЫЛКА Документ.ВозвратПоставщику";
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти