
#Область ПрограммныйИнтерфейс

// Формирует запрос проверки РНПТ и его отправку на открытый API ФНС
//
// Параметры:
//  ПараметрыКоманды	 - Структура - Входящие параметры запроса:
//    * РНПТ - СправочникСсылка.ГТД - РНПТ для проверки ФНС;
//    * Организация - СправочникСсылка.Организации - Организация для определения настроек подключения к ФНС.
//
Функция ЗапросПроверкиРНПТ(ПараметрыКоманды) Экспорт
	
	Сообщить("Начало проверки РНПТ через ФНС");
	
	РезультатПроверки = ОбменСФНССервер.ВыполнитьЗапросПроверкиРНПТ(ПараметрыКоманды);
	
	Сообщить("Проверка РНПТ завершена");
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти
