Процедура ВывестиОтчетСОшибками(НомерОтчетаСОшибками) Экспорт
	
	АдресВХранилище = ns_АвитоОбработкаОшибок.ПолучитьДанныеОтчетаИзБазы(НомерОтчетаСОшибками, Новый УникальныйИдентификатор);
	Если АдресВХранилище = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВХранилище", АдресВХранилище);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

	ФормаОтчета = ПолучитьФорму("Отчет.ns_ОтчетОшибкиАвито.Форма.ФормаОтчетаУпр", ПараметрыФормы);
	ФормаОтчета.Открыть();
	
КонецПроцедуры
 