// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	//Заполним основную смену работы компании
	ОсновнаяСменаРаботыКомпании = Справочники.Смены.ОсновнаяСменаКомпании.ПолучитьОбъект();
	Если ОсновнаяСменаРаботыКомпании.Интервалы.Количество() = 0 Тогда
		НовыйИнтервал = ОсновнаяСменаРаботыКомпании.Интервалы.Добавить();
		НовыйИнтервал.ВидИнтервала = Справочники.ВидыИнтервалов.Работа;
		НовыйИнтервал.НачалоРабочегоВремени = '00010101090000';
		НовыйИнтервал.КонецРабочегоВремени = '00010101130000';
		НовыйИнтервал.Продолжительность = '00010101040000';
		НовыйИнтервал = ОсновнаяСменаРаботыКомпании.Интервалы.Добавить();
		НовыйИнтервал.ВидИнтервала = Справочники.ВидыИнтервалов.ОбеденныйПерерыв;
		НовыйИнтервал.НачалоРабочегоВремени = '00010101130000';
		НовыйИнтервал.КонецРабочегоВремени = '00010101140000';
		НовыйИнтервал.Продолжительность = '00010101010000';
		НовыйИнтервал = ОсновнаяСменаРаботыКомпании.Интервалы.Добавить();
		НовыйИнтервал.ВидИнтервала = Справочники.ВидыИнтервалов.Работа;
		НовыйИнтервал.НачалоРабочегоВремени = '00010101140000';
		НовыйИнтервал.КонецРабочегоВремени = '00010101180000';
		НовыйИнтервал.Продолжительность = '00010101040000';
		
		//Сохранение справочника
		Попытка
			ОсновнаяСменаРаботыКомпании.Записать();
			Сообщить("Справочник ""Смены"". Обновлен элемент """ + СокрЛП(ОсновнаяСменаРаботыКомпании.Наименование) + """");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
