Перем Права Экспорт;


Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТТ_УПР_ЗП Приход
	Движения.ТТ_УПР_ЗП.Записывать = Истина;
	Движения.ТТ_УПР_ЗП.Очистить();
	Для Каждого ТекСтрокаДанныеЗУП Из ДанныеЗУП Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Подразделение = ТекСтрокаДанныеЗУП.Подразделение;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Должность = ТекСтрокаДанныеЗУП.Должность;
		Движение.Бренд = ТекСтрокаДанныеЗУП.Бренд;
		Движение.БазаРаспределения = ТекСтрокаДанныеЗУП.БазаРаспределения;
		Движение.Распределение = ТекСтрокаДанныеЗУП.Распределение;
		Движение.ВидРемонта = ТекСтрокаДанныеЗУП.ВидРемонта;
		Движение.ВидРаботы = ТекСтрокаДанныеЗУП.ВидРаботы;
		Движение.СуммаОклад = ТекСтрокаДанныеЗУП.СуммаОклад;
		Движение.СуммаПремия = ТекСтрокаДанныеЗУП.СуммаПремия;
		Движение.СуммаЗатраты = ТекСтрокаДанныеЗУП.СуммаЗатраты;
		Движение.СуммаНалоги = ТекСтрокаДанныеЗУП.СуммаНалоги;
		Движение.РабДни = ТекСтрокаДанныеЗУП.РабДни;
		Движение.АвтоЗП = ТекСтрокаДанныеЗУП.АвтоЗП;
		Движение.ФинЗП = ТекСтрокаДанныеЗУП.ФинЗП;
		Движение.ДопЗП = ТекСтрокаДанныеЗУП.ДопЗП;
		Движение.ТинЗП = ТекСтрокаДанныеЗУП.ТинЗП;
		Движение.ДопПремия = ТекСтрокаДанныеЗУП.ДопПремия;
		Движение.Кумулятив = ТекСтрокаДанныеЗУП.Кумулятив;
		Движение.ПроцентПремии = ТекСтрокаДанныеЗУП.ПроцентПремии;
		Движение.KPI = ТекСтрокаДанныеЗУП.KPI;
		Движение.БольничныеОП = ТекСтрокаДанныеЗУП.БольничныеОП;
		Движение.ОтпускныеОП = ТекСтрокаДанныеЗУП.ОтпускныеОП;
		Движение.СуммаСервисРабот = ТекСтрокаДанныеЗУП.СуммаСервисРабот;
		Движение.СуммаСервисЗП = ТекСтрокаДанныеЗУП.СуммаСервисЗП;
		Движение.ЧасыСервис = ТекСтрокаДанныеЗУП.ЧасыСервис;
		Движение.ПодНалог = ТекСтрокаДанныеЗУП.ПодНалог;
		Движение.Выплачено = ТекСтрокаДанныеЗУП.Выплачено;
		Движение.ДопУПР = ТекСтрокаДанныеЗУП.ДопУПР;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Права   = Неопределено;

#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли 