
&НаКлиенте
Процедура ПериодЗаполненияПриИзменении(Элемент)
	
	Объект.ПериодЗаполненияНачало 		= ПериодЗаполнения.ДатаНачала;
	Объект.ПериодЗаполненияОкончание 	= ПериодЗаполнения.ДатаОкончания;

	Если ЗначениеЗаполнено(Объект.ПериодЗаполненияНачало) и ЗначениеЗаполнено(Объект.ПериодЗаполненияОкончание) Тогда
		
		СоздатьТЧ();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодЗаполнения.ДатаНачала 		= Объект.ПериодЗаполненияНачало;
	ПериодЗаполнения.ДатаОкончания 		= Объект.ПериодЗаполненияОкончание;
	
	Если ЗначениеЗаполнено(Объект.ПериодЗаполненияНачало) и ЗначениеЗаполнено(Объект.ПериодЗаполненияОкончание) Тогда
		
		СоздатьТЧ();
		
	КонецЕсли;     
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Ответственный = ПараметрыСеанса.Пользователь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьВДанные();
	
	ТЗФормы = ТабЧасть.Выгрузить();
	
	Для каждого ТекСтрока из ТЗФормы Цикл
		
		ПервыйПропуск = Истина;   
		
		Для Каждого ТекКолонка из ТЗФормы.Колонки Цикл 
		
			Если ПервыйПропуск  Тогда
				
				ПервыйПропуск = Ложь;
				Продолжить;
				
			КонецЕсли;
			
			НовСтр = Объект.ТЧПрогноз.Добавить();
			НовСтр.СтатьяДДС 	= ТекСтрока.СтатьяДДС;
			
			Дата = СтрЗаменить(ТекКолонка.Имя, "Дата", "");  
			Дата = Лев(Дата, 2) + "." + Сред(Дата, 3, 2) + "." + Прав(Дата, 4) + " 00:00:00";
			
			НовСтр.Дата 		= Дата(Дата);
			НовСтр.Сумма 		= ТекСтрока[ТекКолонка.Имя];
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьТЧ()
	
	ЗаписатьВДанные();
	
	ТЗФормы 		= ДанныеФормыВЗначение(ТабЧасть, Тип("ТаблицаЗначений"));
	УРеквизиты 		= Новый Массив;               
	ПервыйПропуск 	= Истина;   
	
	Для каждого ТекКолонка из ТЗФормы.Колонки Цикл
		
		Если ПервыйПропуск  Тогда
			
			ПервыйПропуск = Ложь;
			Продолжить;
			
		КонецЕсли;      
		
		НайденныйЭлементФормы = ЭтаФорма.Элементы.Найти(ТекКолонка.Имя); 
		
		Если НайденныйЭлементФормы <> Неопределено  Тогда   
			
            ЭтаФорма.Элементы.Удалить(НайденныйЭлементФормы); 
			
		КонецЕсли;	                
		
		УРеквизиты.Добавить("ТабЧасть." + ТекКолонка.имя);
		
	КонецЦикла;
	
	ТипЧисло 	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	нРеквизиты 	= Новый Массив;
	
	ДатаНачала = Объект.ПериодЗаполненияНачало;
	
	Пока ДатаНачала <= Объект.ПериодЗаполненияОкончание Цикл
		
		ИмяКолонки 			= "Дата"+Формат(ДатаНачала, "ДФ=ddMMyyyy");
		ЗаголовокКолонки 	= Формат(ДатаНачала, "ДЛФ=D");
		нРеквизиты.Добавить(Новый РеквизитФормы(ИмяКолонки, ТипЧисло, "ТабЧасть", ЗаголовокКолонки));   
		
		ДатаНачала = ДатаНачала + 86400;
		
	КонецЦикла; 
	
	Если нРеквизиты.Количество() > 0 Тогда
		
		ИзменитьРеквизиты(нРеквизиты, УРеквизиты);   
		
		ДатаНачала = Объект.ПериодЗаполненияНачало;
		Пока ДатаНачала <= Объект.ПериодЗаполненияОкончание Цикл
			
			ИмяКолонки 			= "Дата"+Формат(ДатаНачала, "ДФ=ddMMyyyy");
			ЗаголовокКолонки 	= Формат(ДатаНачала, "ДЛФ=D");     
			
			нЭлемент = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), Элементы.ТабЧасть); 
			нЭлемент.Вид 			= ВидПоляФормы.ПолеВвода; 
			нЭлемент.ПутьКДанным 	= "ТабЧасть."+ИмяКолонки;  
			
			ДатаНачала = ДатаНачала + 86400;
			
		КонецЦикла; 
		
	КонецЕсли;   
	
	ТабЧасть.Загрузить(ПолучитьТаблицуДанных());
	
КонецПроцедуры

Функция ПолучитьТаблицуДанных()
	
	ТЗДанных = Новый ТаблицаЗначений;
	ТЗДанных.Колонки.Добавить("СтатьяДДС");
	
	ТЗДат = Объект.ТЧПрогноз.Выгрузить(); 
	ТЗДат.Свернуть("Дата");

	Для Каждого ТекДата из ТЗДат Цикл
		
		ТЗДанных.Колонки.Добавить("Дата"+Формат(ТекДата.Дата, "ДФ=ddMMyyyy"));
		
	КонецЦикла;  
	
	Для каждого ТекСтр из Объект.ТЧПрогноз Цикл
		
		НСтр = ТЗДанных.Найти(ТекСтр.СтатьяДДС, "СтатьяДДС");
		
		Если НСтр = Неопределено Тогда
			
			НСтр = ТЗДанных.Добавить();
			НСтр.СтатьяДДС = ТекСтр.СтатьяДДС;
			
		КонецЕсли;
		
		НСтр["Дата"+Формат(ТекСтр.Дата, "ДФ=ddMMyyyy")] = ТекСтр.Сумма;
		
	КонецЦикла;
	
	Возврат ТЗДанных;
	
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Объект.ТЧПрогноз.Очистить();
	ЗаписатьВДанные();

КонецПроцедуры
