#Область Настройки
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		//@skip-check undefined-function
		Ответ = Вопрос("Настройки были изменены. Записать настройки?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ЭтаФорма.Модифицированность = Ложь;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да тогда
			СохранитьНастройкиНаСервере();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.СохранитьНастройки();
	ЗначениеВРеквизитФормы(Обр,"Объект");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ВосстановитьНастройки();
	ЗначениеВРеквизитФормы(Обработка,"Объект"); 
	МассивИменТочек = Объект.СписокТочек.Выгрузить().ВыгрузитьКолонку("Представление");
	Элементы.СопоставленияДанныхИмяТочки.СписокВыбора.ЗагрузитьЗначения(МассивИменТочек);
	МассивИдТочек = Объект.СписокТочек.Выгрузить().ВыгрузитьКолонку("ИдТочки");
	Элементы.СопоставленияДанныхИдТочки.СписокВыбора.ЗагрузитьЗначения(МассивИдТочек);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированность()
	ЭтаФорма.Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
	Модифицированность = Ложь;
КонецПроцедуры
#КонецОбласти 

#Область СвязанныеРегистры
&НаКлиенте
Процедура КомандаОткрытьРегистрСопоставления(Команда)
	ОткрытьФорму("РегистрСведений.БТ_ЛогированиеИнфообменаЧери.Форма.ФормаСписка");
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура КомандаОтправить(Команда)
	КомандаОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтправитьНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.Сформировать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделениямиО2НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Цеха.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Цеха КАК Цеха
	                |ГДЕ
	                |	Цеха.Наименование ПОДОБНО ""%О2%""
	                |	И Цеха.Родитель <> &ПустойЦех";
	Запрос.УстановитьПараметр("ПустойЦех", Справочники.Цеха.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Для каждого Стр Из РезультатЗапроса Цикл 
		СтруктураОтбора = Новый Структура("ПодменяемоеЗначение", Стр);
		Если НЕ Объект.ПодменяемыеДанные.НайтиСтроки(СтруктураОтбора).Количество() Тогда
			НоваяСтрока = Объект.ПодменяемыеДанные.Добавить();
			НоваяСтрока.ПодменяемоеЗначение = Стр;
		КонецЕсли;
	КонецЦикла; 
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделениямиО2(Команда)
	ЗаполнитьПодразделениямиО2НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СопоставленияДанныхПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура СопоставленияДанныхЦехПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СопоставленияДанныхЦехПриИзменении(Элемент)
	СопоставленияДанныхЦехПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СопоставленияДанныхИдТочкиПриИзменении(Элемент)
	МассивТочек = ПолучитьСписокТочек();
	НайденнаяТочка = МассивТочек.Найти(Элемент.ТекстРедактирования);
	Если НайденнаяТочка <> Неопределено Тогда
		Элементы.СопоставленияДанных.ТекущиеДанные.ИмяТочки = НайденнаяТочка.Представление;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТочек()
	Возврат Объект.СписокТочек.Выгрузить();
КонецФункции

&НаКлиенте
Процедура СопоставленияДанныхИмяТочкиПриИзменении(Элемент)
	МассивТочек = ПолучитьСписокТочек();
	НайденнаяТочка = МассивТочек.Найти(Элемент.ТекстРедактирования);
	Если НайденнаяТочка <> Неопределено Тогда
		Элементы.СопоставленияДанных.ТекущиеДанные.ИдТочки = НайденнаяТочка.ИдТочки;	
	КонецЕсли;

КонецПроцедуры








































