#Если Клиент Тогда
// Модуль обработки


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Осуществляет проверку данных выбранного типа номенклатуры
// в соответствии с параметрами обработки
// возвращает текст с найденными ошибками
//
// Параметры:
//  ВыбТип - СправочникСсылка - ТипыНоменклатуры
//
Функция ПроверитьТипНоменклатуры(ВыбТип) Экспорт
	Попытка // а вдруг не ссылка
		Если ВыбТип.Пустая() Тогда
			Возврат ("Не указан тип номенклатуры для проверки !");
		КонецЕсли;
	Исключение
		Возврат ("Ошибка вызова проверки типа номенклатуры !");
	КонецПопытки;
	Состояние("Проверяю тип номенклатуры - "+ВыбТип.Наименование);
	ОтборТипа = Новый Структура ("ТипНоменклатуры",ВыбТип);
	
	Если ПроверятьЕдиницыИзмерения Тогда
		Если ВыбТип.ИспользованиеЕдиницИзмерения = 1 Тогда
			// подчинены типу номенклатуры
			Номенкл = Справочники.Номенклатура.Выбрать(,,ОтборТипа);
			Пока Номенкл.Следующий() Цикл
				Выборка = Справочники.ЕдиницыИзмерения.Выбрать(,Номенкл.Ссылка);
				Пока Выборка.Следующий() Цикл
					Стр = ТаблицаОшибок.Добавить();
					Стр.ТипНоменклатуры = ВыбТип;
					Стр.ВидОбъекта = "ЕдиницыИзмерения";
					Стр.Ошибка = "Подчинение номенклатуре вместо типа";
					Стр.Объект = Выборка.Ссылка;
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ВыбТип.ИспользованиеЕдиницИзмерения = 2 Тогда
			// подчинены номенклатуре
			Выборка = Справочники.ЕдиницыИзмерения.Выбрать(,ВыбТип);
			Пока Выборка.Следующий() Цикл
				Стр = ТаблицаОшибок.Добавить();
				Стр.ТипНоменклатуры = ВыбТип;
				Стр.ВидОбъекта = "ЕдиницыИзмерения";
				Стр.Ошибка = "Подчинение типу вместо номенклатуры";
				Стр.Объект = Выборка.Ссылка;
			КонецЦикла;
		Иначе
			 Предупреждение ("Некорректный тип номенклатуры "+ВыбТип);
		КонецЕсли;
	КонецЕсли;
	
	Если ПроверятьХарактеристики Тогда
	КонецЕсли;
	
	Если ПроверятьШтрихкоды Тогда
	КонецЕсли;
КонецФункции // ПроверитьТипНоменклатуры()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ТаблицаОшибок.Очистить();
ТаблицаОшибок.Колонки.Добавить("ТипНоменклатуры");
ТаблицаОшибок.Колонки.Добавить("ВидОбъекта");
ТаблицаОшибок.Колонки.Добавить("Ошибка");
ТаблицаОшибок.Колонки.Добавить("Объект");
ТаблицаОшибок.Колонки.Добавить("Заменяемое");

#КонецЕсли