Функция ЗаполнитьСправочникGoodsType() Экспорт
	Попытка
		НачатьТранзакцию();
		
		НайтиИДобавитьЭлементыGoodsType("Готовый бизнес", ПолучитьGoodsType_ГотовыйБизнес());
		НайтиИДобавитьЭлементыGoodsType("Оборудование для бизнеса", ПолучитьGoodsType_ОборудованиеДляБизнеса());
		
		ЗафиксироватьТранзакцию();		
	Исключение
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли; 
	    ns_ОбщегоНазначения.СообщениеПользователю(ОписаниеОшибки());
	КонецПопытки; 
	
КонецФункции

Процедура НайтиИДобавитьЭлементыGoodsType(ИмяВладелеца, СписокGoodsType)
	Категория = Справочники.ns_Category.НайтиПоНаименованию(ИмяВладелеца);
    Если Категория.Пустая() Тогда
		Возврат;
	КонецЕсли;  
	
	Для каждого Элемент Из СписокGoodsType Цикл
		НайтиИДобавитьЭлементGoodsType(Элемент, Категория);
	КонецЦикла;
КонецПроцедуры

Процедура НайтиИДобавитьЭлементGoodsType(Наименование, Владелец)
	Элемент = Справочники.ns_GoodsType_ДляБизнеса.НайтиПоНаименованию(Наименование,,, Владелец);
	Если НЕ ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Справочники.ns_GoodsType_ДляБизнеса.СоздатьЭлемент();
		Элемент.Владелец = Владелец; 
		Элемент.Наименование = Наименование;
		Элемент.Записать();
	КонецЕсли; 
КонецПроцедуры

Функция ПолучитьGoodsType_ГотовыйБизнес()
	Список = Новый Массив;
	Список.Добавить("Интернет-магазин");
	Список.Добавить("Общественное питание");
	Список.Добавить("Производство");
	Список.Добавить("Развлечения");
	Список.Добавить("Сельское хозяйство");
	Список.Добавить("Строительство");
	Список.Добавить("Сфера услуг");
	Список.Добавить("Торговля");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция ПолучитьGoodsType_ОборудованиеДляБизнеса()
	Список = Новый Массив;
	Список.Добавить("Для магазина");
	Список.Добавить("Для офиса");
	Список.Добавить("Для ресторана");
	Список.Добавить("Для салона красоты");
	Список.Добавить("Промышленное");
	Список.Добавить("Другое");
	
	Возврат Список;
КонецФункции

Функция СправочникДляБизнесаСопоставлен() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ns_ДляБизнеса.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ДляБизнеса КАК ns_ДляБизнеса";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции

// Область Выгрузка

Функция ПолучитьДанныеНоменклатуры(МагазинСтрока) Экспорт 
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьIDКатегории() Тогда
		Префикс = "biz-" + Строка(МагазинСтрока.Магазин.Префикс) + "-";
	Иначе
		Префикс = Строка(МагазинСтрока.Магазин.Префикс);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ДляБизнеса.Номенклатура КАК Номенклатура,
	|	ns_ДляБизнеса.Title КАК Title,
	|	ns_ДляБизнеса.AdStatus КАК AdStatus,
	|	ns_ДляБизнеса.AllowEmail КАК AllowEmail,
	|	ns_ДляБизнеса.AvitoId КАК AvitoId,
	|	ns_ДляБизнеса.Category КАК Category,
	|	ns_ДляБизнеса.GoodsType КАК GoodsType,
	|	ns_ДляБизнеса.DateBegin КАК DateBegin,
	|	ns_ДляБизнеса.DateEnd КАК DateEnd,
	|	&Префикс + ns_ДляБизнеса.Id КАК Id,
	|	ns_ДляБизнеса.ListingFee КАК ListingFee,
	|	ns_ДляБизнеса.nsDescription КАК nsDescription,
	|	ns_ДляБизнеса.VideoURL КАК VideoURL,
	|	ns_ДляБизнеса.Шаблон КАК Шаблон,
	|	0 КАК Price,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(17)) КАК ContactPhone,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(40)) КАК ManagerName,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(255)) КАК Address,
	|	ns_ДляБизнеса.Артикул КАК Артикул,
	|	ns_ДляБизнеса.Наименование КАК Наименование,
	|	ns_ДляБизнеса.Характеристика КАК Характеристика,
	|	ns_ДляБизнеса.Ссылка КАК Ссылка,
	|	ns_ДляБизнеса.Condition КАК Condition
	|ИЗ
	|	Справочник.ns_ДляБизнеса КАК ns_ДляБизнеса
	|ГДЕ
	|	ns_ДляБизнеса.ЭтоГруппа = ЛОЖЬ
	|	И ns_ДляБизнеса.Выгружать = ИСТИНА";
	Запрос.УстановитьПараметр("Префикс", Префикс);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

// Область Выгрузка

//Область Сопоставление

Процедура Сопоставить(Ссылка, Характеристика, Родитель, ТаблицаСопоставления) Экспорт
	Изменен = Истина;
	
	СсылкаНаЭлемент = ns_Сопоставление.НайтиСопоставление(Ссылка, Характеристика, ТаблицаСопоставления);
	Если СсылкаНаЭлемент = Неопределено Тогда
		ОбъектЭлемент = Справочники.ns_ДляБизнеса.СоздатьЭлемент();
		ОбъектЭлемент.Номенклатура = Ссылка;
		Если ЗначениеЗаполнено(Характеристика) Тогда
			ОбъектЭлемент.Характеристика = Характеристика;
			Id = Строка(Ссылка.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		Иначе
			Id = Строка(Ссылка.УникальныйИдентификатор());
		КонецЕсли; 
		ОбъектЭлемент.Id = Id;
		ОбъектЭлемент.Выгружать = ns_ОбщегоНазначенияПовтИсп.ПолучитьДобавлятьВВыгрузку();
		ОбъектЭлемент.Condition = ns_ОбщегоНазначенияПовтИсп.ПолучитьConditionДляБизнеса();
		
		Изменен = Истина;
	Иначе
		ОбъектЭлемент = СсылкаНаЭлемент.ПолучитьОбъект();
	КонецЕсли; 
	
	ns_Сопоставление.ЗаполнитьTitle(ОбъектЭлемент);
	ns_Сопоставление.ЗаполнитьDescription(Ссылка, ОбъектЭлемент);
	
	ОбъектЭлемент.ПометкаУдаления = Ссылка.ПометкаУдаления;
	ОбъектЭлемент.Наименование = Ссылка.Наименование;
	ОбъектЭлемент.Артикул = Ссылка.Артикул;
	ОбъектЭлемент.Родитель = Справочники.ns_ДляБизнеса.ПолучитьСсылку(Родитель.УникальныйИдентификатор());
	
	Если Изменен Тогда
		ОбъектЭлемент.Записать();
	КонецЕсли; 
	
КонецПроцедуры

Процедура СопоставитьЭлементНоменклатуры(Ссылка) Экспорт
	ns_Сопоставление.СопоставитьЭлементНоменклатуры(Ссылка, "ns_ДляБизнеса");			
КонецПроцедуры
 
//КонецОбласти 











