
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЗначениеЗаполнено(IDУстройства) Тогда
		Отказ = Истина;
		Сообщить("ID устройства связанного с этим узлом обмена не указан.", СтатусСообщения.ОченьВажное);
		
		Возврат;
	КонецЕсли;
	
	// теперь провери на уникальность
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбменСМобильнымУстройством.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменСМобильнымУстройством КАК ОбменСМобильнымУстройством
	|ГДЕ
	|	ОбменСМобильнымУстройством.Ссылка <> &ЭтаСсылка
	|	И ОбменСМобильнымУстройством.IDУстройства = &IDУстройства";
	
	Запрос.УстановитьПараметр("ЭтаСсылка"    , Ссылка);
	Запрос.УстановитьПараметр("IDУстройства" , IDУстройства);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Сообщить("ID устройства уже прикрепленн к другому узлу обмена.", СтатусСообщения.ОченьВажное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
