Функция ПолучитьНаборПараметровТестДрайва(Модель,Знач Дата = Неопределено) Экспорт
	Результат = Новый Структура("ПродолжительностьЭксплуатации,МаксимальныйПробег,АнкетаПредварительная,АнкетаИтоговая, СрокПоставки",0,0,Справочники.ТиповыеАнкеты.ПустаяСсылка(),Справочники.ТиповыеАнкеты.ПустаяСсылка(), 0);
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиТестДрайваСрезПоследних.ПродолжительностьЭксплуатации,
	|	НастройкиТестДрайваСрезПоследних.МаксимальныйПробег,
	|	НастройкиТестДрайваСрезПоследних.АнкетаПредварительная,
	|	НастройкиТестДрайваСрезПоследних.АнкетаИтоговая,
	|	НастройкиТестДрайваСрезПоследних.СрокПоставки
	|ИЗ
	|	РегистрСведений.НастройкиТестДрайва.СрезПоследних(&Период, Модель = &Модель) КАК НастройкиТестДрайваСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Модель", Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ПродолжительностьЭксплуатации = Выборка.ПродолжительностьЭксплуатации;
		Результат.МаксимальныйПробег            = Выборка.МаксимальныйПробег;
		Результат.АнкетаПредварительная         = Выборка.АнкетаПредварительная;
		Результат.АнкетаИтоговая                = Выборка.АнкетаИтоговая;
		Результат.СрокПоставки                  = Выборка.СрокПоставки;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции