Перем ИмяОбработки Экспорт;					// Имя обработки
Перем Права Экспорт;						// Кеш для хранения прав
Перем ИмяМикросервера;						// Имя файла микросервера
Перем ЗаполнятьРодителяАвтоработы Экспорт;	// Признак заполнения групп авторабот
Перем ДеревоАвторабот;						// Переменная дляхранения иерархии авторабот

//Свойства обмена
Перем СвойствоТипЗаказа Экспорт;						//Тип заказа
Перем СвойствоНомерГарантийнойЗаявки Экспорт;			//Номер заявка
Перем СвойствоТипЗаказаЗапчастей Экспорт;				//Тип заказа деталей
Перем СвойствоНомерГарантийнойЗаявкиЗапчастей Экспорт;	//Номер заявки деталей
Перем СвойствоКодДвигателяАвтомобиля Экспорт;			//Код двигателя
Перем СвойствоКодКППАвтомобиля Экспорт;					//Код КПП
Перем СвойствоЦеноваяГруппаЗапчасти Экспорт;			//Ценовая группа деталей

Перем СоздаватьНовыйЗаказ;					// Признак создания новых заказов методом New
Перем СоздаватьНовыйОбъект;					// Признак создания новых объектов справочников ВариантыКомплектации и Нормочасы

////////////////////////////////////////////////////////////////////////////////
//	ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция осуществляет приведение номера
//
Функция ПривестиНомерДокумента(Номер, Разрядность)
	
	Если СтрДлина(Номер) = Разрядность Тогда
		
		Возврат Номер;
		
	ИначеЕсли СтрДлина(Номер) > Разрядность Тогда
		
		КоличествоЛишнихЦифр	= СтрДлина(Номер) - Разрядность;
		Для Индекс=1 По КоличествоЛишнихЦифр Цикл
			Для ИндексЦифр=0 По СтрДлина(Номер)-1 Цикл
				ТекИндекс	= СтрДлина(Номер)-ИндексЦифр;
				ТекСимвол	= Сред(Номер, ТекИндекс, 1);
				Если ТекСимвол="0" Тогда
					Номер	= Сред(Номер, 1, ТекИндекс-1)+Сред(Номер, ТекИндекс+1); 
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Возврат Номер;
	Иначе
		СтрДоп								= "0";
		ВременнаяСтрокаЦифрНомера			= "";
		ВременнаяСтрокаПрефиксацииНомера	="";
		КоличествоДопСимволов				= Разрядность-СтрДлина(Номер);
		ПозицияСимвола						= СтрДлина(Номер);
		Пока ПозицияСимвола >= 1 Цикл
			Символ	= Сред(Номер,ПозицияСимвола,1);
			Если Найти("0123456789",Символ)<>0 Тогда
				ПозицияСимвола	= ПозицияСимвола-1;
			Иначе	 
			 	ВременнаяСтрокаЦифрНомера		= Прав(Номер,СтрДлина(Номер)-ПозицияСимвола);
			  	ВременнаяСтрокаПрефиксацииНомера= Лев(Номер,ПозицияСимвола);
			  	Прервать;
			КонецЕсли;
		КонецЦикла;	
		КоличествоДобавили	= 1;
		Пока КоличествоДобавили<=КоличествоДопСимволов Цикл
			Если Не ЗначениеЗаполнено(ВременнаяСтрокаЦифрНомера) И Не ЗначениеЗаполнено(ВременнаяСтрокаПрефиксацииНомера) Тогда
				Номер						= СтрДоп+Номер;
			Иначе	
			    ВременнаяСтрокаЦифрНомера	= СтрДоп+ВременнаяСтрокаЦифрНомера;
			КонецЕсли;
			КоличествоДобавили	= КоличествоДобавили+1;
		КонецЦикла;
		Если ЗначениеЗаполнено(ВременнаяСтрокаЦифрНомера) И ЗначениеЗаполнено(ВременнаяСтрокаПрефиксацииНомера) Тогда
				Номер	= ВременнаяСтрокаПрефиксацииНомера+ВременнаяСтрокаЦифрНомера;
		КонецЕсли;
		Возврат Номер;
	КонецЕсли;
КонецФункции

// Функция определеяет является ли переданный параметр числом
//
Функция ЭтоЧисло(Строка) // Экспорт
	
	РезультатЭтоЧисло = Истина;	
	ДлинаСтроки = СтрДлина(Строка);	
	Для Индекс = 1 По ДлинаСтроки Цикл		
		ТекущийСимвол	= Лев(Строка, 1);
		Строка 			= Сред(Строка, 2);
		
		Если Найти("1234567890,.-", ТекущийСимвол)=0 Тогда
			РезультатЭтоЧисло = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
		
	Возврат РезультатЭтоЧисло;
	
КонецФункции // ЭтоЧисло

// Функция возвращает идентификатор, полученный из текущей даты
// в виде ГГГГММДДЧЧММСС
// Параметры:
//
// Возвращаемое значение - строковой идентификатор, полученный на основе текущей даты
//
Функция ПолучитьИдентификаторПоВремени() Экспорт

	ТекДата			= ТекущаяДата();
	ТекДатаСтрокой	= СокрЛП(Формат(ТекДата, "ДФ=yyyy-MM-dd"));
	ТекВремяСтрокой	= СокрЛП(Формат(ТекДата, "ДЛФ=T"));
	
	Если СтрДлина(ТекВремяСтрокой)=7 Тогда
		ТекВремяСтрокой	= "0"+ТекВремяСтрокой;
	КонецЕсли;
	
	Идентификатор	= СтрЗаменить(ТекДатаСтрокой, "-","")+СтрЗаменить(ТекВремяСтрокой, ":", "");
	
	Возврат Идентификатор;
	
КонецФункции

// Функция преобразует значение к указанному типу
// Параметры:
//	ТекЗначение				- значение, которое необходимо преобразовать
//	НужныйТип				- тип, к которому необходимо преобразовать значение
//	Параметры				- структура параметров приведения к типу
//
// Возвращаемое значение - преобразованное к нужному типу значение
//
Функция ПривестиКТипу(ТекЗначение, НужныйТип, Знач Параметры=Неопределено) Экспорт
	
	ЗнВозврата	= ТекЗначение;
	
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Имя						= Неопределено;
		ОбратнаяТранслитерация	= Неопределено;
		ПроверкаКодировки		= Неопределено;
		Параметры.Свойство("Имя", Имя);
		Параметры.Свойство("ОбратнаяТранслитерация", ОбратнаяТранслитерация);
		Параметры.Свойство("ПроверкаКодировки", ПроверкаКодировки);
	КонецЕсли;
	
	Если Имя=Неопределено Тогда
		Имя						= "";
	КонецЕсли;
	Если ОбратнаяТранслитерация=Неопределено Тогда
		ОбратнаяТранслитерация	= Ложь;	
	КонецЕсли;
	Если ПроверкаКодировки=Неопределено Тогда
		ПроверкаКодировки	= Ложь;
	КонецЕсли;
	
	Если ОбратнаяТранслитерация Тогда
		Если ИспользоватьТранслитерациюНаименований Тогда
			ТекЗначение	= кмОбратнаяТранслитирация(ТекЗначение);
		ИначеЕсли ИспользоватьТранслитерациюНомеров Тогда
			ПредДлинаСтроки	= СтрДлина(ТекЗначение);
			ТекЗначение	= кмОбратнаяТранслитирация(ТекЗначение);
			Если ПредДлинаСтроки<>СтрДлина(ТекЗначение) Тогда
				Если Имя="ORDER_NO" Тогда
					ТекЗначение	= ПривестиНомерДокумента(ТекЗначение, 10);
				ИначеЕсли  Имя="SPAREPART_NO" Тогда
					ТекЗначение	= ПривестиНомерДокумента(ТекЗначение, 8);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Если НужныйТип = "Число" Тогда
		Попытка
			ЗнВозврата = Число(ТекЗначение);
		Исключение
			ЗнВозврата = 0;
		КонецПопытки;
	
	ИначеЕсли НужныйТип = "Строка" Тогда
		ЗнВозврата = СокрЛП(ТекЗначение);
		
		Если ПроверкаКодировки Тогда
			НеправильнаяКодировка	= Ложь;
			Для Индекс=1 По СтрДлина(ЗнВозврата) Цикл
				ТекущийСимвол			= Сред(ЗнВозврата,Индекс,1);
				ТекущийКодСимвола		= КодСимвола(ТекущийСимвол);
				НеправильнаяКодировка	= НЕ ((ТекущийКодСимвола>1 И ТекущийКодСимвола<128) ИЛИ (ТекущийКодСимвола>1039 И ТекущийКодСимвола<1104));
				Если НеправильнаяКодировка Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НеправильнаяКодировка Тогда
				ВременныйКаталог	= КаталогВременныхФайлов();
				ДокТекст			= Новый ТекстовыйДокумент();
				ДокТекст.УстановитьТекст(ЗнВозврата);
				ДокТекст.Записать(ВременныйКаталог+"encoding.txt", "cp1252");
					
				ДокТекст.Прочитать(ВременныйКаталог+"encoding.txt", "cp1251");
				ЗнВозврата		= ДокТекст.ПолучитьТекст();				
			КонецЕсли;
		КонецЕсли;		
		
	ИначеЕсли НужныйТип = "Дата" Тогда
		
		Если Найти(ТекЗначение, "-")=5 ИЛИ Найти(ТекЗначение, ".")=5 Тогда
			РазбираемыйГод		= Сред(ТекЗначение,0,4);
			РазбираемыйМесяц	= Сред(ТекЗначение,6,2);
			РазбираемоеЧисло	= Сред(ТекЗначение,9,2);
			ТекущееЗначение		= ""+РазбираемыйГод+РазбираемыйМесяц+РазбираемоеЧисло;
			Если СтрДлина(ТекЗначение)>10 Тогда
				РазбираемыйЧас		= Сред(ТекЗначение,12,2);
				РазбираемаяМинута	= Сред(ТекЗначение,15,2);
				РазбираемаяСекунда	= Сред(ТекЗначение,18,2);
				ТекущееЗначение		= ТекущееЗначение + " "+РазбираемыйЧас+":"+РазбираемаяМинута+":"+РазбираемаяСекунда;
			КонецЕсли;
		ИначеЕсли СтрДлина(ТекЗначение)=4 Тогда	
			// Предположительно год
			ТекущееЗначение	= "0101"+ТекЗначение;
		Иначе
			ТекущееЗначение	= СтрЗаменить(ТекЗначение,"-",".");
		КонецЕсли;
		
		Попытка
			ЗнВозврата	= Дата(ТекущееЗначение);
		Исключение
			#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
			#КонецЕсли
			ЗнВозврата	= Дата(1,1,1);
		КонецПопытки;
		
	ИначеЕсли НужныйТип = "Булево" Тогда
		Если НРег(ТекЗначение) = "истина" ИЛИ НРег(ТекЗначение) = "да" ИЛИ НРег(ТекЗначение) = "ложь" ИЛИ НРег(ТекЗначение) = "нет" Тогда
			ЗнВозврата = ?(НРег(ТекЗначение) = "истина" ИЛИ НРег(ТекЗначение) = "да", Истина, Ложь);
		Иначе
			Попытка
				ЗнВозврата = Число(ТекЗначение)>0;
			Исключение
				ЗнВозврата = Ложь;
			КонецПопытки;

		КонецЕсли;
		
	ИначеЕсли НужныйТип="СправочникСсылка.КлассификаторСтранМира" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_КлассификаторСтранМира(ТекЗначение, НужныйТип);
		
	ИначеЕсли НужныйТип= "СправочникСсылка.Сотрудники" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Сотрудники(ТекЗначение, НужныйТип);
				
	ИначеЕсли НужныйТип = "СправочникСсылка.СкладыКомпании" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_СкладыКомпании(ТекЗначение, НужныйТип);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.Цеха" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Цеха(ТекЗначение, НужныйТип);

	ИначеЕсли НужныйТип = "СправочникСсылка.Валюты" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Валюты(ТекЗначение, НужныйТип);
			
	ИначеЕсли НужныйТип = "СправочникСсылка.СтавкиНДС" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_СтавкиНДС(ТекЗначение, НужныйТип);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.Автоработы" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Автоработы(ТекЗначение, НужныйТип, Параметры);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.Номенклатура" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Номенклатура(ТекЗначение, НужныйТип, Параметры);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.ТипыКПП" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_ТипыКПП(ТекЗначение, НужныйТип, Параметры);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.ВариантыКомплектации" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_ВариантыКомплектации(ТекЗначение, НужныйТип, Параметры);
		
	ИначеЕсли  НужныйТип="СправочникСсылка.Нормочасы" Тогда
		
		ЗнВозврата	= ЗагрузитьСправочник_Нормочасы(ТекЗначение, НужныйТип, Параметры)
		
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции	//	ПривестиКТипу()

// Функция выводит информационное сообщение ошибки, возникшей в результате
// ответа сервера на запрос
// Параметры:
//	СтруктураОшибок - код и описание ошибки
//	ИнформационнаяФорма - форма, в которой выводится сообщение
//
// Возвращаемое значение - истина в случае наличия ошибки, иначе ложь
//
Функция ВывестиОшибки(СтруктураОшибок, ИнформационнаяФорма) Экспорт
	
	ЕстьОшибки	= Ложь;
	
	Если ТипЗнч(СтруктураОшибок)=Тип("Структура") Тогда
		Если НЕ ПустаяСтрока(СтруктураОшибок.Описание) Тогда			
			ИнформационнаяФорма.ЭлементыФормы.ПолеHTML.УстановитьТекст("<HTML>
				|	<HEAD>
				|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
				|	</HEAD>
				|	<BODY>
				|		<P>"+СтруктураОшибок.Код+"
				|		<P>"+СтруктураОшибок.Описание+"
				|	</BODY>
				|</HTML>");
				
			ЕстьОшибки	= истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЕстьОшибки;
КонецФункции

// Функция преобразует xml результат ответа сервера в html
// Параметры:
//	Тип					- тип запроса, на который получен ответ
//	ДеревоЗапроса		- Ответ, полученный от сервера
//	СтруктураПараметров	- структура параметров функции
//
// Возвращаемое значение- ответ серврера в виде html
//
Функция ПолучитьHTMLИзОтветаСервера(Тип, ДеревоЗапроса, СтруктураПараметров) Экспорт

	ТекстHTML = 
			"<HTML>
			|	<HEAD>
			|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
			|	</HEAD>
			|	<BODY></BODY></HTML>";
	
	Если ТипЗнч(СтруктураПараметров)=Тип("Структура") Тогда
		
		КартинкаDMS	= Неопределено;
		ПолеHTML	= Неопределено;
		СтруктураПараметров.Свойство("КартинкаDMS", КартинкаDMS);
		СтруктураПараметров.Свойство("ПолеHTML", ПолеHTML);
		
		ТекстHTML = 
			"<HTML>
			|	<HEAD>
			|		<META http-equiv=Content-Type content=""text/html; charset=utf-8"">
			|	</HEAD>
			|	<BODY scroll=auto>
			|		"+?(КартинкаDMS<>Неопределено И ПолеHTML<>Неопределено,"<P><IMG src="""+ПолучитьПутьККартинкеДляHTML(КартинкаDMS, ПолеHTML)+""">","");
			
			Если Тип="AliveTest" Тогда
				ТекстHTML	= ТекстHTML+"
				|		<P>
				|		<UL>";

				Для Каждого ТекСтрокаПриложение Из ДеревоЗапроса.Строки Цикл
					ТекстHTML	= ТекстHTML + "<LI><STRONG>"+ТекСтрокаПриложение.Имя+"</STRONG>&nbsp;&nbsp;Версия&nbsp;&nbsp;"+ТекСтрокаПриложение.Версия+"&nbsp;&nbsp;Поставщик&nbsp;&nbsp;<STRONG>"+ТекСтрокаПриложение.Поставщик+"</STRONG>
					|		";	
					Для Каждого ТекСтрокаСервис Из ТекСтрокаПриложение.Строки Цикл
						ТекстHTML	= ТекстHTML + "<LI>Сервис&nbsp;&nbsp;<STRONG>"+ТекСтрокаСервис.Имя+"</STRONG>&nbsp;&nbsp;Версия&nbsp;&nbsp;"+ТекСтрокаСервис.Версия+"
						|		";	
						Для Каждого ТекСтрокаМетод Из ТекСтрокаСервис.Строки Цикл
							ТекстHTML	= ТекстHTML + "<UL><LI>"+ТекСтрокаМетод.Имя+"&nbsp;&nbsp;<STRONG>"+ТекСтрокаМетод.Значение+"</STRONG>&nbsp;&nbsp;Версия&nbsp;&nbsp;"+ТекСтрокаМетод.Версия+"</LI></UL>";						
						КонецЦикла;
						ТекстHTML	= ТекстHTML+"</LI>
						|";	
					КонецЦикла;
					ТекстHTML	= ТекстHTML+"</LI>
					|		</UL>";
				КонецЦикла;
				
			ИначеЕсли Тип="ListServices" Тогда
				ТекстHTML	= ТекстHTML+"
				|		<P>Список сервисов
				|		<UL>";

				Для Каждого ТекСтрокаСервис Из ДеревоЗапроса.Строки Цикл
					ТекстHTML	= ТекстHTML + "<LI>Сервис&nbsp;&nbsp;<STRONG>"+ТекСтрокаСервис.Имя+"</STRONG>
					|<UL><LI>Доступ&nbsp;разрешен:&nbsp;"+ТекСтрокаСервис.Доступ+"</LI>
					|<LI>Комментарий:&nbsp;"+ТекСтрокаСервис.Комментарий+"</LI>
					|<LI>URL:&nbsp;"+ТекСтрокаСервис.Адрес+"</LI>
					|<LI>URL&nbsp;настройки:&nbsp;"+ТекСтрокаСервис.АдресАдминистрирования+"</LI></UL>";	
				КонецЦикла;

				ТекстHTML	= ТекстHTML+"		</UL>";
			КонецЕсли;
			
			ТекстHTML = ТекстHTML + "</BODY>
			|</HTML>";
		
	КонецЕсли;
		
	Возврат ТекстHTML;
	
КонецФункции

// Функция формирует url картинки для отображения в форме html
// Параметры:
//	Картинка			- картинка для получения url
//	ПолеHTMLДокумента	 - поле html документа
//
// Возвращаемое значение - url картинки
//
Функция ПолучитьПутьККартинкеДляHTML(Картинка, ПолеHTMLДокумента) Экспорт
	
	МетаУрл	= ПолеHTMLДокумента.ПолучитьURL(Метаданные);
	МетаУрл	= Лев(МетаУрл,Найти(МетаУрл,"mdobject")-1);
	КартИД	= ЗначениеВСтрокуВнутр(Картинка);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Сред(КартИД,Найти(КартИД,"{")+1);
	КартИД	= Лев(КартИД,НАйти(КартИД,"}")-1);
	
	Если Лев(КартИД,1) = "-" Тогда
		КартИд	= "n"+КартИД;
	Иначе
		КартИД	= Сред(КартИД,3);
	КонецЕсли;
	
	Возврат МетаУрл+"mdpicture/id" + КартИД;
	
КонецФункции // КартинкаУрл()

// Процедура разбирает строку подключения
//
Процедура РазложитьПуть(Путь, ТаблицаПути)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(Путь);
	
	Если ТекстовыйДокумент.КоличествоСтрок() <> 0 Тогда
		
		КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
		Для НомСтр = 1 По КоличествоСтрок Цикл
			ИмяИБ		= "";
			ПутьИБ		= "";
			ТекСтрока	= ТекстовыйДокумент.ПолучитьСтроку(НомСтр);
			Если Лев(ТекСтрока,1) = "[" И Прав(ТекСтрока,1) = "]" Тогда
				ИмяИБ		= Сред(ТекСтрока,2,СтрДлина(ТекСтрока)-2);
				НомСтр		= НомСтр + 1;
				ТекСтрока	= ТекстовыйДокумент.ПолучитьСтроку(НомСтр);
				Если Найти(ТекСтрока, "Connect=File=") <> 0 Тогда //файловые базы
					ПутьИБ = Сред(ТекСтрока,9, СтрДлина(ТекСтрока)-9);						
					
					НоваяСтрока			= ТаблицаПути.Добавить();
					НоваяСтрока.Имя		= ИмяИБ;
					НоваяСтрока.Путь	= ПутьИБ;
					
				ИначеЕсли Найти(ТекСтрока, "Connect=Srvr=") <> 0 Тогда //серверные 
					ПутьИБ = Сред(ТекСтрока,9, СтрДлина(ТекСтрока)-9);
					
					НоваяСтрока			= ТаблицаПути.Добавить();
					НоваяСтрока.Имя		= ИмяИБ;
					НоваяСтрока.Путь	= ПутьИБ;					
				КонецЕсли;					
				
				Если НомСтр >= КоличествоСтрок Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;					
		КонецЦикла;				
	КонецЕсли;			

КонецПроцедуры

// Функция получает из реестра путь к каталогам текущего пользователя
// а по указанному пути получает список зарегистрированных ИБ
//
Функция ПолучитьСписокИБ() Экспорт 
	                  
    СистемнаяИнформация	= Новый СистемнаяИнформация();
	ВерсияПлатформы		= СистемнаяИнформация.ВерсияПриложения;
	
	ТаблицаПути	= Новый ТаблицаЗначений();
	ТаблицаПути.Колонки.Добавить("Имя");
	ТаблицаПути.Колонки.Добавить("Путь");
	ТаблицаПути.Колонки.Добавить("Пользователь");
	ТаблицаПути.Колонки.Добавить("Пароль");
	
	Попытка
		
		ScrptCtrl=Новый COMObject("MSScriptControl.ScriptControl");
		ScrptCtrl.Language="vbscript";
		ScrptCtrl.AddCode("
		|Function Get1CV8Titles()
		|	const HKEY_CURRENT_USER = &H80000001
		|	Set oReg=GetObject(""winmgmts:{impersonationLevel=impersonate}!\\.\root\default:StdRegProv"")
		|	strKeyPath = ""Volatile Environment""
		|	oReg.EnumValues HKEY_CURRENT_USER, strKeyPath, arrValues
		|	strInfo=vbNullString
		|   Get1CV8Titles = strInfo
		|	On Error Resume Next
		|	For i = LBound(arrValues) To UBound(arrValues)		
		|		call oReg.GetStringValue(HKEY_CURRENT_USER,strKeyPath,arrValues(i),Value)
		|       if (arrValues(i) = ""APPDATA"") then
		|		    strInfo=Value
		|       end if
		|	Next		
		| 	Get1CV8Titles = strInfo
		|End Function
		|");
		
		Если Найти(ВерсияПлатформы, "8.1")>0 Тогда
			
			//Пути к базам 8.1
			
			//пути к локальным базам
			Путь	= СокрЛП(ScrptCtrl.Run("Get1CV8Titles")) + "\1C\1Cv81\ibases.v8i";		
			Файл	= Новый Файл(Путь);
			Если Файл.Существует() Тогда			
				РазложитьПуть(Путь, ТаблицаПути);			
			КонецЕсли;
			
			//пути к общим базам
			Путь	= СокрЛП(ScrptCtrl.Run("Get1CV8Titles")) + "\1C\1Cv81\ibases.v8l";		
			Файл	= Новый Файл(Путь);
			Если Файл.Существует() Тогда			
				ТекстовыйДокумент	= Новый ТекстовыйДокумент;
				ТекстовыйДокумент.Прочитать(Путь);
				КоличествоСтрок		= ТекстовыйДокумент.КоличествоСтрок();
				Если КоличествоСтрок <> 0 Тогда				
					Для НомСтр = 1 По КоличествоСтрок Цикл
						Путь	= ТекстовыйДокумент.ПолучитьСтроку(НомСтр);
						Файл	= Новый Файл(Путь);
						Если Файл.Существует() Тогда			
							РазложитьПуть(Путь, ТаблицаПути);			
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			//Пути к базам 8.2
			
			//пути к локальным базам
			Путь=СокрЛП(ScrptCtrl.Run("Get1CV8Titles")) + "\1C\1CEStart\ibases.v8i";		
			Файл = Новый Файл(Путь);
			Если Файл.Существует() Тогда			
				РазложитьПуть(Путь, ТаблицаПути);			
			КонецЕсли;
			
			//пути к общим базам
			Путь=СокрЛП(ScrptCtrl.Run("Get1CV8Titles")) + "\1C\1CEStart\ibases.v8l";		
			Файл = Новый Файл(Путь);
			Если Файл.Существует() Тогда			
				ТекстовыйДокумент = Новый ТекстовыйДокумент;
				ТекстовыйДокумент.Прочитать(Путь);
				КоличествоСтрок = ТекстовыйДокумент.КоличествоСтрок();
				Если КоличествоСтрок <> 0 Тогда				
					Для НомСтр = 1 По КоличествоСтрок Цикл
						Путь = ТекстовыйДокумент.ПолучитьСтроку(НомСтр);
						Файл = Новый Файл(Путь);
						Если Файл.Существует() Тогда			
							РазложитьПуть(Путь, ТаблицаПути);			
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		Возврат ТаблицаПути;
	КонецПопытки;
	
	ТаблицаПути.Свернуть("Имя, Путь, Пользователь, Пароль",);
	ТаблицаПути.Сортировать("Имя");

	Возврат ТаблицаПути;
	
КонецФункции //ПолучитьСписокИБ

// Функция проверяет текст xml, предназначеный для обмена с dmsbb
//
Функция ПроверитьХМЛ(Знач ЗаписьXML)
	
	Если ТипЗнч(ЗаписьXML)=Тип("ЗаписьXML") Тогда
		
		ТекстХМЛ	= ЗаписьXML.Закрыть();		
		ТекстХМЛ	= "<?xml version=""1.0"""+?(ПустаяСтрока(КодировкаПоУмолчанию),""," encoding="""+КодировкаПоУмолчанию+"""")+"?>
		|"+ТекстХМЛ;
		
		// Удаление лишних символов
		ТекстХМЛ	= СтрЗаменить(ТекстХМЛ, Символы.ПС, "");
		ТекстХМЛ	= СтрЗаменить(ТекстХМЛ, Символы.ВК, "");
		ТекстХМЛ	= СтрЗаменить(ТекстХМЛ, Символы.Таб, "");
		
	Иначе
		
	 	ТекстХМЛ	= ЗаписьXML;
		
	КонецЕсли;
	
	Возврат ТекстХМЛ;
	
КонецФункции

// ПрОцедура осуществляет проверку текста запроса
//
Процедура ПроверитьТекстЗапроса(ТекстЗапроса)
	
	// Проверка правильности заполнения первой строки xml
	ОбъектXML		= Новый ЧтениеXML();
	
	Попытка
		ОбъектXML.УстановитьСтроку(ТекстЗапроса);
	Исключение 
		Возврат;
	КонецПопытки;
			
	ОчереднойУзелXMLПрочитан = Истина;	
	Попытка
		ОчереднойУзелXMLПрочитан = ОбъектXML.Прочитать();
	Исключение
		ОчереднойУзелXMLПрочитан = Ложь;
	КонецПопытки;
	
	Если НЕ ОчереднойУзелXMLПрочитан Тогда
		Позиция	= Найти(ТекстЗапроса, "xml version=""1.0""?>");
		Если Позиция>0 Тогда
			НекорректныйПрефикс	= Сред(ТекстЗапроса, 1, Позиция-1);
			ТекстЗапроса	= СтрЗаменить(ТекстЗапроса, НекорректныйПрефикс+"xml version=""1.0""?>", "<?xml version=""1.0""?>");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура осуществляет заполнение подписчиков на события dmsbb
//
Процедура ЗаполнитьПодписчиковНаСобытия() Экспорт
	
	ВозможныеСобытия	= Новый Массив();
	ВозможныеСобытия.Добавить("Delete");
	ВозможныеСобытия.Добавить("New");
	ВозможныеСобытия.Добавить("Lock");
	ВозможныеСобытия.Добавить("Close");
	ВозможныеСобытия.Добавить("Update");
	ВозможныеСобытия.Добавить("AllEvents");
	
	ВозможныеПодписчики	= Новый Массив();
	ВозможныеПодписчики.Добавить(Новый Структура("Служба, Подписчик", "WorkshopOrder", "OrderService"));
	ВозможныеПодписчики.Добавить(Новый Структура("Служба, Подписчик", "WorkshopOrder", "OrderServiceParts"));
	ВозможныеПодписчики.Добавить(Новый Структура("Служба, Подписчик", "SparepartOrder", "OrderServiceParts"));
	
	СтрокиПодписки	= РегистрыСведений.СведенияОСобытияхDMSBB.СоздатьНаборЗаписей();
	СтрокиПодписки.Прочитать();
	СтрокиПодписки.Очистить();
	
	Для Каждого ТекПодписчик Из ВозможныеПодписчики Цикл
		Для Каждого ТекСобытие Из ВозможныеСобытия Цикл
			НоваяСтрока					= СтрокиПодписки.Добавить();
			НоваяСтрока.Страна			= СтранаDMS;
			НоваяСтрока.Регион			= РегионDMS;
			НоваяСтрока.Дилер			= ДилерDMS;
			НоваяСтрока.Служба			= ТекПодписчик.Служба;
			НоваяСтрока.Подписчик		= ТекПодписчик.Подписчик;
			НоваяСтрока.Событие			= ТекСобытие;
		КонецЦикла; 
	КонецЦикла;
	
	Попытка
		СтрокиПодписки.Записать();
	Исключение
		#Если Клиент Тогда
		Сообщить(ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;
	
КонецПроцедуры

// Процедура осуществляет заполнение значимых событий.
// Осуществляет передачу данных подписчикам
// на указанные сервисы при записи соответствующих объектов 1С;
//
Процедура СформироватьЗначимыеСобытияСервисов(НаименованиеСобытия, ИсточникСобытия, ПредставлениеИсточника) Экспорт
	
	ПередаватьДанныеDMSBB	= обПраво("ПередаватьДанныеDMSBB", Права);
	Если НЕ ПередаватьДанныеDMSBB Тогда
		Возврат;
	КонецЕсли;
	
	КодДляВыполнения	= "// Передача данных DMSBB
							|DMSBB		= Обработки.ОбменСDMSBB.Создать();
							|DMSBB.ОтправитьДанныеПодписки(Параметры.ОбъектИсточникСобытия);";													
							
							ЗначениеСобытия		= "ПриЗаписи";
	ЗапросСобытия		= Новый Запрос();
	ЗапросСобытия.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1
	                   	  |	ЗначимыеСобытия.Ссылка
	                   	  |ИЗ
	                   	  |	Справочник.ЗначимыеСобытия КАК ЗначимыеСобытия
	                   	  |ГДЕ
	                   	  |	ЗначимыеСобытия.Источник = &ИсточникСобытия
	                   	  |	И ЗначимыеСобытия.Событие = &ЗначениеСобытия";
	ЗапросСобытия.УстановитьПараметр("ИсточникСобытия", ИсточникСобытия);
	ЗапросСобытия.УстановитьПараметр("ЗначениеСобытия", ЗначениеСобытия);
	ВыборкаСобытия	= ЗапросСобытия.Выполнить().Выбрать();
	Если ВыборкаСобытия.Следующий() Тогда
		СобытиеСсылка	= ВыборкаСобытия.Ссылка;
	Иначе
		СобытиеОбъект	= Справочники.ЗначимыеСобытия.СоздатьЭлемент();
		СобытиеОбъект.УстановитьНовыйКод();
		СобытиеОбъект.Заполнить(Неопределено);
		СобытиеОбъект.Источник		= ИсточникСобытия;
		СобытиеОбъект.ПредставлениеИсточника	= ПредставлениеИсточника;
		СобытиеОбъект.Событие		= ЗначениеСобытия;
		СобытиеОбъект.Наименование	= НаименованиеСобытия;
		СобытиеОбъект.РежимВыполнения	= Перечисления.РежимыВыполненияДействий.Прерывать;
		СобытиеОбъект.Активность	= Истина;
		Попытка
			СобытиеОбъект.Записать();			
		Исключение
			Возврат;
		КонецПопытки;
		СобытиеСсылка	= СобытиеОбъект.Ссылка;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(СобытиеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	НаименованиеДействия	= "Отправка данных подписчикам DMS";
	ВидДействия				= Перечисления.ВидДействияНаЗначимоеСобытие.Прочее;
	ЗапросНаДействия		= Новый Запрос();
	ЗапросНаДействия.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1
	                      	  |	ДействияНаЗначимыеСобытия.Ссылка
	                      	  |ИЗ
	                      	  |	Справочник.ДействияНаЗначимыеСобытия КАК ДействияНаЗначимыеСобытия
	                      	  |ГДЕ
	                      	  |	ДействияНаЗначимыеСобытия.ВидДействия = &ВидДействия
	                      	  |	И ДействияНаЗначимыеСобытия.Наименование = &НаименованиеДействия
	                      	  |	И ДействияНаЗначимыеСобытия.Владелец = &Владелец";
	ЗапросНаДействия.УстановитьПараметр("НаименованиеДействия", НаименованиеДействия);
	ЗапросНаДействия.УстановитьПараметр("ВидДействия", ВидДействия);
	ЗапросНаДействия.УстановитьПараметр("Владелец", СобытиеСсылка);
	ВыборкаДействий	= ЗапросНаДействия.Выполнить().Выбрать();
	Если ВыборкаДействий.Следующий() Тогда
		ДействиеСсылка	= ВыборкаДействий.Ссылка.ПолучитьОбъект();
	Иначе
		ДействиеОбъект	= Справочники.ДействияНаЗначимыеСобытия.СоздатьЭлемент();
		ДействиеОбъект.УстановитьНовыйКод();
		ДействиеОбъект.Наименование		= НаименованиеДействия;
		ДействиеОбъект.ВидДействия		= ВидДействия;
		ДействиеОбъект.ПроизвольныйКод	= КодДляВыполнения;
		ДействиеОбъект.Владелец			= СобытиеСсылка;
	
		Попытка
			ДействиеОбъект.Записать();
		Исключение
		#Если Клиент Тогда
		Сообщить(ОписаниеОшибки());		
		#КонецЕсли
		КонецПопытки;
		ДействиеСсылка	= ДействиеОбъект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает таблицу опций
Функция ЗагрузитьОпцииИОборудованиеАвтомобиля(СсылкаНаАвтомобиль)
	
	тзОпцииИОборудованиеАвтомобиля	= Новый ТаблицаЗначений();
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаАвтомобиль) Тогда
		Возврат тзОпцииИОборудованиеАвтомобиля;
	КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ОпцииВариантовКомплектации.Опция КАК Опция,
				 |	ОпцииВариантовКомплектации.Опция.Наименование КАК ОпцияНаименование,
	             |	ОпцииВариантовКомплектации.Количество КАК Количество
	             |ИЗ
	             |	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
	             |ГДЕ
	             |	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
	             |	И ОпцииВариантовКомплектации.ВидВключения = 2
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
				 |ВЫБРАТЬ
	             |	КомплектацияАвтомобилей.Номенклатура,
				 |	КомплектацияАвтомобилей.Номенклатура.Наименование,
	             |	СУММА(КомплектацияАвтомобилей.Количество)
	             |ИЗ
	             |	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	             |ГДЕ
				 |	КомплектацияАвтомобилей.Автомобиль=&Автомобиль И 
				 |	(КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей ИЛИ
				 |	КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ЗаказНаряд ИЛИ
				 |	КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей ИЛИ
				 |	КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей) И 
				 |	КомплектацияАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	             |СГРУППИРОВАТЬ ПО
	             |	КомплектацияАвтомобилей.Автомобиль,
	             |	КомплектацияАвтомобилей.Номенклатура
				 |ИМЕЮЩИЕ 
				 |	СУММА(КомплектацияАвтомобилей.Количество)<>0
	             |УПОРЯДОЧИТЬ ПО
	             |	ОпцияНаименование";
	Запрос.УстановитьПараметр("ВариантКомплектации",СсылкаНаАвтомобиль.ВариантКомплектации);
	Запрос.УстановитьПараметр("Автомобиль",			СсылкаНаАвтомобиль);
	тзОпцииИОборудованиеАвтомобиля	= Запрос.Выполнить().Выгрузить();
	
	Возврат тзОпцииИОборудованиеАвтомобиля;
	
КонецФункции

// Процедура осуществляет формирование дерева авторабот,
// которое используется при заполнении родителя во время
// загрузки авторабот из ELSA.
//
Процедура СформироватьДеревоАвторабот()
	
	
	МассивСтрок		= Новый Массив();
	МакетАвторабот	= ЭтотОбъект.ПолучитьМакет("Автоработы");
	ПредДлинаКода	= 0;
	ТекДлинаКода	= 0;
	НоваяСтрока		= Неопределено;
	
	Для Индекс=2 По МакетАвторабот.ВысотаТаблицы Цикл
		ТекущийКод			= СокрЛП(МакетАвторабот.ПолучитьОбласть(Индекс, 2, Индекс, 2).ТекущаяОбласть.Текст);
		ТекущееНаименование	= СокрЛП(МакетАвторабот.ПолучитьОбласть(Индекс, 3, Индекс, 3).ТекущаяОбласть.Текст);
		ТекДлинаКода		= СтрДлина(ТекущийКод);
		
		Если ТекДлинаКода>ПредДлинаКода Тогда
			Если НоваяСтрока<>Неопределено Тогда
				МассивСтрок.Добавить(НоваяСтрока);
			КонецЕсли;
		ИначеЕсли ТекДлинаКода<ПредДлинаКода Тогда
			Если ТекДлинаКода=1 Тогда
				МассивСтрок.Очистить();
			Иначе
				МассивСтрок.Удалить(МассивСтрок.ВГраница());
			КонецЕсли;
		КонецЕсли;
		
		Если МассивСтрок.Количество()=0 Тогда
			НоваяСтрока		= ДеревоАвторабот.Строки.Добавить();
		Иначе
			ТекущаяСтрока	= МассивСтрок.Получить(МассивСтрок.ВГраница());
			НоваяСтрока		= ТекущаяСтрока.Строки.Добавить();						
		КонецЕсли;
		
		НоваяСтрока.Код				= ТекущийКод;
		НоваяСтрока.Наименование	= ТекущееНаименование;	

		ПредДлинаКода	= ТекДлинаКода;
	КонецЦикла;
	
КонецПроцедуры

// Функция осуществляет заполнение дерева и поиск/создание авторабот
//
Функция НайтиСоздатьГруппуАвторабот(КодРаботы)
		
	Если ДеревоАвторабот.Строки.Количество()=0 Тогда
		СформироватьДеревоАвторабот();
	КонецЕсли;

	Если СтрДлина(КодРаботы)=6 Тогда
		КодРодителя		= Сред(КодРаботы,1,4);
		СсылкаНаРодителя= НайтиСоздатьГруппуАвторабот(КодРодителя);
	ИначеЕсли СтрДлина(КодРаботы)=4 Тогда
		КодРодителя		= Сред(КодРаботы, 1, 2);
		СсылкаНаРодителя= НайтиСоздатьГруппуАвторабот(КодРодителя);	
	ИначеЕсли СтрДлина(КодРаботы)=2 Тогда
		Если СтрДлина(КодРаботы)=1 Тогда			
			СсылкаНаРодителя= Неопределено;
		Иначе
			СтрокаРодителя	= ДеревоАвторабот.Строки.Найти(КодРаботы, "Код", Истина);
			Если СтрокаРодителя<>Неопределено И СтрокаРодителя.Родитель<>Неопределено Тогда
				СсылкаНаРодителя	= НайтиСоздатьГруппуАвторабот(СтрокаРодителя.Родитель.Код);
			Иначе
				СсылкаНаРодителя	= Неопределено;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрДлина(КодРаботы)=1 Тогда
		СсылкаНаРодителя	= Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	НайденнаяСтрока	= ДеревоАвторабот.Строки.Найти(КодРаботы, "Код", Истина);
	Если НайденнаяСтрока=Неопределено Тогда
		НаименованиеСтроки	= КодРаботы;
	Иначе
		НаименованиеСтроки	= НайденнаяСтрока.Наименование;
	КонецЕсли;
	
	НайденнаяРабота	= Справочники.Автоработы.НайтиПоНаименованию(НаименованиеСтроки, Истина);
	Если НайденнаяРабота=Справочники.Автоработы.ПустаяСсылка() ИЛИ НайденнаяРабота=Неопределено Тогда
		АвтоработаОбъект				= Справочники.Автоработы.СоздатьГруппу();
		АвтоработаОбъект.Код			= КодРаботы;
		АвтоработаОбъект.Наименование	= НаименованиеСтроки;
		
		Если ЗначениеЗаполнено(СсылкаНаРодителя) Тогда
			АвтоработаОбъект.Родитель	= СсылкаНаРодителя;
		КонецЕсли;
		
		Попытка
			АвтоработаОбъект.Записать();
		Исключение
			АвтоработаОбъект.УстановитьНовыйКод();
			Попытка
				АвтоработаОбъект.Записать();
			Исключение
				АвтоработаОбъект	= Неопределено;
			КонецПопытки;
		КонецПопытки;
		Если АвтоработаОбъект=Неопределено Тогда
			НайденнаяРабота	= Неопределено;
		Иначе
			НайденнаяРабота	= АвтоработаОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат НайденнаяРабота;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//		ОБРАБОТЧИКИ ЗАГРУЗКИ СПРАВОЧНИКОВ

// Обработчик загрузки справочника КлассификаторСтранМира
//
Функция ЗагрузитьСправочник_КлассификаторСтранМира(Знач ТекЗначение, Знач НужныйТип)
	
	НаименованиеСтраны= СокрЛП(ТекЗначение);
	Запрос		= Новый запрос();
	Запрос.УстановитьПараметр("НаименованиеСтраны", НаименованиеСтраны);
	Запрос.Текст= "ВЫБРАТЬ
				  |	КлассификаторСтранМира.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
				  |ГДЕ
				  |	КлассификаторСтранМира.Наименование = &НаименованиеСтраны";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(НаименованиеСтраны) Тогда
			НоваяСтрана						= Справочники.КлассификаторСтранМира.СоздатьЭлемент();
			НоваяСтрана.ОбменДанными.Загрузка	= Истина;
			НоваяСтрана.Наименование		= НаименованиеСтраны;
			НоваяСтрана.НаименованиеПолное	= НаименованиеСтраны;
			Попытка
				НоваяСтрана.Записать();
				ЗнВозврата	= НоваяСтрана.Ссылка;
			Исключение
				ЗнВозврата	= Неопределено;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;	
		КонецЕсли;
		
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;			
	КонецЕсли;
		
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Сотрудники
//
Функция ЗагрузитьСправочник_Сотрудники(Знач ТекЗначение, Знач НужныйТип) 
	
	КодСотрудника	= СокрЛП(ТекЗначение);
	Запрос			= Новый Запрос();
	Запрос.УстановитьПараметр("КодСотрудника", КодСотрудника);
	Запрос.Текст	= "ВЫБРАТЬ
				  |	Сотрудники.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.Сотрудники КАК Сотрудники
				  |ГДЕ
				  |	Сотрудники.Код = &КодСотрудника";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(КодСотрудника) Тогда
			НовыйСотрудник						= Справочники.Сотрудники.СоздатьЭлемент();
			НовыйСотрудник.Заполнить(Неопределено);
			НовыйСотрудник.ОбменДанными.Загрузка	= Истина;
			НовыйСотрудник.Код				= КодСотрудника;
			НовыйСотрудник.Наименование		= КодСотрудника;
			НовыйСотрудник.Должность		= Справочники.Должности.Неопределена;
			Попытка
				НовыйСотрудник.Записать();
				ЗнВозврата	= НовыйСотрудник.Ссылка;
			Исключение
				Попытка
					НовыйСотрудник.УстановитьНовыйКод();
					НовыйСотрудник.Записать();
					ЗнВозврата	= НовыйСотрудник.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника СкладыКомпании
//
Функция ЗагрузитьСправочник_СкладыКомпании(Знач ТекЗначение, Знач НужныйТип) 
	
	КодСклада	= СокрЛП(ТекЗначение);
	Запрос		= Новый Запрос();
	Запрос.УстановитьПараметр("КодСклада", КодСклада);
	Запрос.Текст	= "ВЫБРАТЬ
				  |	Склады.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.СкладыКомпании КАК Склады
				  |ГДЕ
				  |	Склады.Код = &КодСклада";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(КодСклада) Тогда
			НовыйСклад						= Справочники.СкладыКомпании.СоздатьЭлемент();
			НовыйСклад.Заполнить(Неопределено);
			НовыйСклад.ОбменДанными.Загрузка	= Истина;
			НовыйСклад.Код				= КодСклада;
			НовыйСклад.Наименование		= КодСклада;
			НовыйСклад.ВидСклада		= Перечисления.ВидыСкладов.Обычный;
			Попытка
				НовыйСклад.Записать();
				ЗнВозврата	= НовыйСклад.Ссылка;
			Исключение
				Попытка
					НовыйСклад.УстановитьНовыйКод();
					НовыйСклад.Записать();
					ЗнВозврата	= НовыйСклад.Ссылка;
				Исключение	
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Цеха
//
Функция ЗагрузитьСправочник_Цеха(Знач ТекЗначение, Знач НужныйТип) 
	
	КодЦеха	= СокрЛП(ТекЗначение);
	Запрос		= Новый Запрос();
	Запрос.УстановитьПараметр("КодЦеха", КодЦеха);
	Запрос.Текст	= "ВЫБРАТЬ
				  |	Цеха.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.Цеха КАК Цеха
				  |ГДЕ
				  |	Цеха.Код = &КодЦеха";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(КодЦеха) Тогда
			НовыйЦех						= Справочники.Цеха.СоздатьЭлемент();
			НовыйЦех.Заполнить(Неопределено);
			НовыйЦех.ОбменДанными.Загрузка	= Истина;
			НовыйЦех.Код				= КодЦеха;
			НовыйЦех.Наименование		= КодЦеха;
			Попытка
				НовыйЦех.Записать();
				ЗнВозврата	= НовыйЦех.Ссылка;
			Исключение
				Попытка
					НовыйЦех.УстановитьНовыйКод();
					НовыйЦех.Записать();
					ЗнВозврата	= НовыйЦех.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Валюты
//
Функция ЗагрузитьСправочник_Валюты(Знач ТекЗначение, Знач НужныйТип) 
	
	НаименованиеВалюты	= СокрЛП(ТекЗначение);
	Запрос		= Новый запрос();
	Запрос.УстановитьПараметр("НаименованиеВалюты", НаименованиеВалюты);
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Валюты.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.Валюты КАК Валюты
	            	  |ГДЕ
	            	  |	Валюты.Наименование = &НаименованиеВалюты";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(НаименованиеВалюты) Тогда
			НоваяВалюта					= Справочники.Валюты.СоздатьЭлемент();
			НоваяВалюта.Заполнить(Неопределено);
			НоваяВалюта.ОбменДанными.Загрузка= Истина;
			НоваяВалюта.Наименование		= НаименованиеВалюты;
			НоваяВалюта.НаименованиеПолное	= НаименованиеВалюты;
			Попытка
				НоваяВалюта.Записать();
				ЗнВозврата	= НоваяВалюта.Ссылка;
			Исключение
				ЗнВозврата	= Неопределено;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника СтавкиНДС
//
Функция ЗагрузитьСправочник_СтавкиНДС(Знач ТекЗначение, Знач НужныйТип) 
		
	Ставка	= СокрЛП(ТекЗначение);
	Ставка	= СтрЗаменить(Ставка, ".", ",");
	
	Попытка
		СтавкаЧислом	= Число(Ставка);
	Исключение
		СтавкаЧислом	= Неопределено;
	КонецПопытки;
	
	Если СтавкаЧислом=Неопределено Тогда
		ЗнВозврата	= Неопределено;
		
	ИначеЕсли СтавкаЧислом=18 Тогда
		ЗнВозврата	= Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		
	Иначе
		
		Запрос		= Новый запрос();
		Запрос.УстановитьПараметр("СтавкаЧислом", СтавкаЧислом);
		Запрос.Текст	= "ВЫБРАТЬ
					  |	СтавкиНДС.Ссылка КАК Ссылка
					  |ИЗ
					  |	Справочник.СтавкиНДС КАК СтавкиНДС
					  |ГДЕ
					  |	СтавкиНДС.Ставка = &СтавкаЧислом";
					  
		РезультатЗапроса	= Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			НоваяСтавка					= Справочники.СтавкиНДС.СоздатьЭлемент();
			НоваяСтавка.Заполнить(Неопределено);
			НоваяСтавка.ОбменДанными.Загрузка= Истина;
			НоваяСтавка.Наименование	= "Ставка "+Ставка+"%";
			НоваяСтавка.Ставка			= СтавкаЧислом;
			Попытка
				НоваяСтавка.Записать();
				ЗнВозврата	= НоваяСтавка.Ссылка;
			Исключение
				НоваяСтавка	= Неопределено;
			КонецПопытки;			
		Иначе
			Выборка		= РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗнВозврата	= Выборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Автоработы
//
Функция ЗагрузитьСправочник_Автоработы(Знач ТекЗначение, Знач НужныйТип, Параметры=Неопределено) 
	
	КодРаботы			= СокрЛП(ТекЗначение);
	СсылкаНаРодителя	= Неопределено;
	Запрос				= Новый Запрос();
	Запрос.УстановитьПараметр("КодРаботы", КодРаботы);
	Запрос.Текст		= "ВЫБРАТЬ
				  |	Автоработы.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.Автоработы КАК Автоработы
				  |ГДЕ
				  |	Автоработы.Артикул = &КодРаботы";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Наименование		= Неопределено;
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Параметры.Свойство("Наименование", 		Наименование);
	КонецЕсли;
	
	КодРаботыКорректен	= СтрДлина(КодРаботы)>7;
	Если ЗаполнятьРодителяАвтоработы И КодРаботыКорректен Тогда
		
		ГруппаРемонта		= Сред(КодРаботы,1,2);
		НомерИилюстрации	= Сред(КодРаботы,3,2);
		НомерЗадания		= Сред(КодРаботы,5,2);
		ИндексРаботы		= Сред(КодРаботы,7,2);

		КодРодителя			= ГруппаРемонта+НомерИилюстрации;
		СсылкаНаРодителя	= НайтиСоздатьГруппуАвторабот(КодРодителя);	
	КонецЕсли;
	Наименование	= ?(Наименование=Неопределено,КодРаботы,Наименование);
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(КодРаботы) Тогда
			НоваяРабота						= Справочники.Автоработы.СоздатьЭлемент();
			НоваяРабота.Заполнить(Неопределено);
			НоваяРабота.ОбменДанными.Загрузка= Истина;
			НоваяРабота.Наименование		= Наименование;
			НоваяРабота.НаименованиеПолное	= Наименование;
			НоваяРабота.Артикул				= КодРаботы;
			НоваяРабота.Код					= КодРаботы;
			
			Если СсылкаНаРодителя<>Неопределено тогда
				НоваяРабота.Родитель	= СсылкаНаРодителя;	
			КонецЕсли;
			
			Попытка
				НоваяРабота.Записать();
				ЗнВозврата	= НоваяРабота.Ссылка;
			Исключение
				Попытка
					НоваяРабота.УстановитьНовыйКод();
					НоваяРабота.Записать();
					ЗнВозврата	= НоваяРабота.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Номенклатура
//
Функция ЗагрузитьСправочник_Номенклатура(Знач ТекЗначение, Знач НужныйТип, Параметры=Неопределено) 
	
	КодЗапчасти					= СокрЛП(ТекЗначение);
	Наименование				= Неопределено;
	СоздаватьНовуюНоменклатуру	= Неопределено;
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Параметры.Свойство("Наименование", 			Наименование);
		Параметры.Свойство("СоздаватьНовыйОбъект",	СоздаватьНовуюНоменклатуру);
	КонецЕсли;	
	
	Если Наименование=Неопределено Тогда
		Наименование	= КодЗапчасти;
	КонецЕсли;
	
	Запрос		= Новый Запрос();
	Запрос.УстановитьПараметр("КодЗапчасти", КодЗапчасти);
	Запрос.Текст	= "ВЫБРАТЬ
				  |	Номенклатура.Ссылка КАК Ссылка
				  |ИЗ
				  |	Справочник.Номенклатура КАК Номенклатура
				  |ГДЕ
				  |	Номенклатура.Артикул = &КодЗапчасти";
				  
	РезультатЗапроса	= Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() И СоздаватьНовуюНоменклатуру=Истина Тогда
		Если НЕ ПустаяСтрока(КодЗапчасти) Тогда			
			НоваяЗапчасть						= Справочники.Номенклатура.СоздатьЭлемент();
			НоваяЗапчасть.Заполнить(Неопределено);
			НоваяЗапчасть.ОбменДанными.Загрузка= Истина;
			НоваяЗапчасть.Наименование		= Наименование;
			НоваяЗапчасть.НаименованиеПолное= Наименование;
			НоваяЗапчасть.Артикул			= КодЗапчасти;
			НоваяЗапчасть.УстановитьНовыйКод();
		
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.ТипНоменклатуры) Тогда
				НоваяЗапчасть.ТипНоменклатуры	= Справочники.ТипыНоменклатуры.Штучный;
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.ВидНоменклатуры) Тогда
				НоваяЗапчасть.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.БазоваяЕдиницаИзмерения) И ЗначениеЗаполнено( НоваяЗапчасть.ТипНоменклатуры) Тогда
				НоваяЗапчасть.БазоваяЕдиницаИзмерения = НоваяЗапчасть.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.БазоваяЕдиницаИзмерения) Тогда
				НоваяЗапчасть.БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияКоличества
			КонецЕсли;
			
			Если НЕ обЗначениеНеЗаполнено(НоваяЗапчасть.БазоваяЕдиницаИзмерения)
				И обЗначениеНеЗаполнено(НоваяЗапчасть.ОсновнаяЕдиницаИзмерения) Тогда
				
				ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НоваяЗапчасть.БазоваяЕдиницаИзмерения.Наименование,Истина);
				Если обЗначениеНеЗаполнено(ЕдиницаИзмерения) Тогда
					ЕдиницаИзмерения						= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
					ЕдиницаИзмерения.ОбменДанными.Загрузка	= Истина;
					//ЕдиницаИзмерения.Владелец				= НоваяЗапчасть;
					ЕдиницаИзмерения.УстановитьНовыйКод();
					ЕдиницаИзмерения.Наименование 			= НоваяЗапчасть.БазоваяЕдиницаИзмерения.Наименование;
					ЕдиницаИзмерения.ЕдиницаПоКлассификатору= НоваяЗапчасть.БазоваяЕдиницаИзмерения;
					ЕдиницаИзмерения.Коэффициент			= 1;
					Попытка
						ЕдиницаИзмерения.Записать();
					Исключение КонецПопытки; 
				КонецЕсли; 
				НоваяЗапчасть.ОсновнаяЕдиницаИзмерения	= ЕдиницаИзмерения.Ссылка;				
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.ВалютаУчета) Тогда
				НоваяЗапчасть.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(НоваяЗапчасть.СтавкаНДС) Тогда
				НоваяЗапчасть.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;			
			
			Попытка					
				НоваяЗапчасть.Записать();
				ЗнВозврата	= НоваяЗапчасть.Ссылка;					
			Исключение
				ЗнВозврата	= Неопределено;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			
			ЗнВозврата	= Выборка.Ссылка;			
			Если ЗнВозврата.Наименование=КодЗапчасти И Наименование<>КодЗапчасти Тогда
				ТекОбъект	= ЗнВозврата.ПолучитьОбъект();
				Если ТекОбъект<>Неопределено Тогда
					ТекОбъект.ОбменДанными.Загрузка	= Истина;
					
					Если обЗначениеНеЗаполнено(ТекОбъект.ТипНоменклатуры) Тогда
						ТекОбъект.ТипНоменклатуры	= Справочники.ТипыНоменклатуры.Штучный
					КонецЕсли;
					
					Если ТекОбъект.ВидНоменклатуры=Неопределено Тогда
						ТекОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
					КонецЕсли;
					
					Если обЗначениеНеЗаполнено(ТекОбъект.БазоваяЕдиницаИзмерения) Тогда
						ТекОбъект.БазоваяЕдиницаИзмерения = Константы.ОсновнаяЕдиницаИзмеренияКоличества
					КонецЕсли;
					
					Если НЕ обЗначениеНеЗаполнено(ТекОбъект.БазоваяЕдиницаИзмерения)
						И обЗначениеНеЗаполнено(ТекОбъект.ОсновнаяЕдиницаИзмерения) Тогда
						
						ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(ТекОбъект.БазоваяЕдиницаИзмерения.Наименование,Истина);
						Если обЗначениеНеЗаполнено(ЕдиницаИзмерения) Тогда
							ЕдиницаИзмерения						= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
							ЕдиницаИзмерения.ОбменДанными.Загрузка	= Истина;
							//ЕдиницаИзмерения.Владелец				= ТекОбъект;
							ЕдиницаИзмерения.УстановитьНовыйКод();
							ЕдиницаИзмерения.Наименование 			= ТекОбъект.БазоваяЕдиницаИзмерения.Наименование;
							ЕдиницаИзмерения.ЕдиницаПоКлассификатору= ТекОбъект.БазоваяЕдиницаИзмерения;
							ЕдиницаИзмерения.Коэффициент			= 1;
							Попытка
								ЕдиницаИзмерения.Записать();
							Исключение КонецПопытки; 
						КонецЕсли; 
						ТекОбъект.ОсновнаяЕдиницаИзмерения	= ЕдиницаИзмерения.Ссылка;				
					КонецЕсли;
					
					Если обЗначениеНеЗаполнено(ТекОбъект.ВалютаУчета) Тогда
						ТекОбъект.ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
					КонецЕсли;
					
					Если обЗначениеНеЗаполнено(ТекОбъект.СтавкаНДС) Тогда
						ТекОбъект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
					КонецЕсли;				
					
					ТекОбъект.Наименование			= Наименование;
					
					Попытка
						ТекОбъект.Записать();
					Исключение КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника ТипыКПП
//
Функция ЗагрузитьСправочник_ТипыКПП(Знач ТекЗначение, Знач НужныйТип, Параметры=Неопределено) 
	
	КодКПП	= СокрЛП(ТекЗначение);
	Запрос		= Новый Запрос();
	Запрос.УстановитьПараметр("КодКПП", КодКПП);
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ТипыКПП.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.ТипыКПП КАК ТипыКПП
	            	  |ГДЕ
	            	  |	ТипыКПП.Код = &КодКПП";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Наименование		= Неопределено;
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Параметры.Свойство("Наименование", 		Наименование);
	КонецЕсли;
	
	Наименование	= ?(Наименование=Неопределено,КодКПП,Наименование);
	
	Если РезультатЗапроса.Пустой() Тогда
		Если НЕ ПустаяСтрока(КодКПП) Тогда
			НовыйТипКПП						= Справочники.ТипыКПП.СоздатьЭлемент();
			НовыйТипКПП.Заполнить(Неопределено);
			НовыйТипКПП.ОбменДанными.Загрузка= Истина;
			НовыйТипКПП.Наименование		= Наименование;
			НовыйТипКПП.Код					= КодКПП;			
			
			Попытка
				НовыйТипКПП.Записать();
				ЗнВозврата	= НовыйТипКПП.Ссылка;
			Исключение
				Попытка
					НовыйТипКПП.УстановитьНовыйКод();
					НовыйТипКПП.Записать();
					ЗнВозврата	= НовыйТипКПП.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗнВозврата	= Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника ВариантыКомплектации
//
Функция ЗагрузитьСправочник_ВариантыКомплектации(Знач ТекЗначение, Знач НужныйТип, Параметры=Неопределено) 
	
	Наименование			= Неопределено;
	ТипКПП					= Неопределено;
	Модель					= Неопределено;
	СоздаватьНовыйВариант	= Неопределено;
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Параметры.Свойство("Наименование", 			Наименование);
		Параметры.Свойство("ТипКПП", 				ТипКПП);
		Параметры.Свойство("Модель", 				Модель);
		Параметры.Свойство("СоздаватьНовыйОбъект",	СоздаватьНовыйВариант);
	КонецЕсли;
	
	ВариантКомплектации	= СокрЛП(ТекЗначение);
	Наименование	= ?(Наименование=Неопределено, ВариантКомплектации,Наименование);	
		
	Запрос		= Новый Запрос();
	Запрос.УстановитьПараметр("ВариантКомплектации", ВариантКомплектации);
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ВариантыКомплектации.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
	            	  |ГДЕ
	            	  |	ВариантыКомплектации.Код = &ВариантКомплектации";
				  
	РезультатЗапроса	= Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() И СоздаватьНовыйВариант=Истина Тогда
		Если НЕ ПустаяСтрока(ВариантКомплектации) Тогда
			НовыйВариантКомплектации				= Справочники.ВариантыКомплектации.СоздатьЭлемент();
			НовыйВариантКомплектации.Заполнить(Неопределено);
			НовыйВариантКомплектации.ОбменДанными.Загрузка	= Истина;
			НовыйВариантКомплектации.Наименование			= Наименование;
			НовыйВариантКомплектации.Код					= ВариантКомплектации;
			
			Если ТипКПП<>Неопределено Тогда
				НовыйВариантКомплектации.ТипКПП	= ТипКПП;	
			КонецЕсли;
			Если Модель<>Неопределено Тогда
				НовыйВариантКомплектации.Владелец	= модель;
			КонецЕсли;
			
			Попытка
				НовыйВариантКомплектации.Записать();
				ЗнВозврата	= НовыйВариантКомплектации.Ссылка;
			Исключение
				Попытка
					НовыйВариантКомплектации.УстановитьНовыйКод();
					НовыйВариантКомплектации.Записать();
					ЗнВозврата	= НовыйВариантКомплектации.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗнВозврата	= Выборка.Ссылка;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

// Обработчик загрузки справочника Нормочасы
//
Функция ЗагрузитьСправочник_Нормочасы(Знач ТекЗначение, Знач НужныйТип, Параметры=Неопределено) 
	
	КодНормочаса	= СокрЛП(ТекЗначение);
	Наименование	= КодНормочаса;
	
	СоздаватьНовыйНормочас= Неопределено;
	Если ТипЗнч(Параметры)=Тип("Структура") Тогда
		Параметры.Свойство("СоздаватьНовыйОбъект",	СоздаватьНовыйНормочас);
	КонецЕсли;	
	
	Запрос			= Новый Запрос();
	Запрос.УстановитьПараметр("КодНормочаса", КодНормочаса);
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Нормочасы.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.Нормочасы КАК Нормочасы
	            	  |ГДЕ
	            	  |	Нормочасы.Наименование = &КодНормочаса";
				  
	РезультатЗапроса	= Запрос.Выполнить();	
	
	Если РезультатЗапроса.Пустой() И СоздаватьНовыйНормочас=Истина Тогда
		Если НЕ ПустаяСтрока(КодНормочаса) Тогда
			НовыйНормочас				= Справочники.Нормочасы.СоздатьЭлемент();
			НовыйНормочас.Заполнить(Неопределено);
			НовыйНормочас.ОбменДанными.Загрузка	= Истина;
			НовыйНормочас.Наименование			= Наименование;
			НовыйНормочас.УстановитьНовыйКод();
			
			НормочасПоУмолчанию	= обПраво("НормочасПоУмолчанию");
			Если ЗначениеЗаполнено(НормочасПоУмолчанию) Тогда
				Если обЗначениеНеЗаполнено(НовыйНормочас.Цена) Тогда
					НовыйНормочас.Цена	= НормочасПоУмолчанию.Цена;
				КонецЕсли;
				Если обЗначениеНеЗаполнено(НовыйНормочас.Валюта) Тогда
					НовыйНормочас.Валюта	= НормочасПоУмолчанию.Валюта;
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				НовыйНормочас.Записать();
				ЗнВозврата	= НовыйНормочас.Ссылка;
			Исключение
				Попытка
					НовыйНормочас.УстановитьНовыйКод();
					НовыйНормочас.Записать();
					ЗнВозврата	= НовыйНормочас.Ссылка;
				Исключение
					ЗнВозврата	= Неопределено;
				КонецПопытки;
			КонецПопытки;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;			
	Иначе
		Выборка		= РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗнВозврата	= Выборка.Ссылка;
		Иначе
			ЗнВозврата	= Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗнВозврата;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//		ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С HTTP

// Функция возвращает адрес скрипта для отправки запросов DMS
// Параметры:
//	ТипСервиса	- текстовое наименование сервиса, для которого необходимо сформировать адрес
//
// Возвращаемое значение - адрес сервиса в виде строки
//
Функция ПолучитьАдресСкрипта(ТипСервиса="") Экспорт
		
	Если ТипСервиса="WorkshopOrder.Subscribtion"
		ИЛИ ТипСервиса="WorkshopOrder.SubscriptionData" Тогда
		
		АдресСкрипта	= СерверHTTP+"/WorkshopOrder.bb";
	Иначе
		АдресСкрипта	= СерверHTTP+"/DMSBackbone.bb";
	КонецЕсли;

	Возврат АдресСкрипта;
	
КонецФункции

// Функция осуществляет передачу указанного файла на сервер
// Параметры:
//	СодержимоеЗапроса - Данные, подлежащему передаче
//
// Возращаемое значение - Строка с ответом от сервера
//
Функция ПередатьДанныеНаСервер(АдресСкрипта, Знач СодержимоеЗапроса) Экспорт
	
	ОтветСервера	= "";
	
	Попытка
		xmlhttp    = Новый COMОбъект("Microsoft.XMLHTTP");
	Исключение
		ОтветСервера	= "Не удалось подключить COM-объект ""XMLHTTP"". Убедитесь что установлена данная библиотека";
		Возврат ОтветСервера;
	КонецПопытки;
	
	xmlhttp.open("POST", АдресСкрипта, 0);
	xmlhttp.setRequestHeader("Content-Type", "text/xml");
	Попытка
		xmlhttp.send(СодержимоеЗапроса);
	Исключение
		ОтветСервера	 = ОписаниеОшибки();
		Возврат ОтветСервера;
	КонецПопытки;
	
	Статус			= xmlhttp.status;
	ОтветСервера	= xmlhttp.responseText;
	
	Возврат ?(ЗначениеЗаполнено(ОтветСервера), ОтветСервера, "");	
	
КонецФункции

// Функция проверяет существует ли указанный файл
//
Функция ФайлСуществует(Путь="") Экспорт
	
	Результат	= Ложь;
	ТекКаталог	= КаталогВременныхФайлов();
	
	Если ПустаяСтрока(Путь) Тогда
		ПутьКМикросерверу	= КаталогВременныхФайлов()+ИмяМикросервера+".exe";
	Иначе
		ПутьКМикросерверу	= Путь;	
	КонецЕсли;
	
	НайденныеФайлы	= НайтиФайлы(ТекКаталог, ПутьКМикросерверу);
	Если НайденныеФайлы.Количество()=0 Тогда
		Результат	= Ложь;
	Иначе
		Результат	= Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция осуществляет запуск микросервера DMSBB (прокси) или отключение от него
// Параметры:
//	Подключиться	- признак подключения/отключения
//
// Возвращаемое значение - признак удачного запуска/отключения
//
Функция Микросервер(Подключиться=Истина) Экспорт
	
	Успешно							= Истина;
	СистемнаяИнформация	= Новый СистемнаяИнформация();
	ВерсияПлатформы		= СистемнаяИнформация.ВерсияПриложения;
	
	ТекКаталог						= КаталогВременныхФайлов();
	ПутьКМикросерверу				= ТекКаталог+ИмяМикросервера+".exe";
	ПутьКНастройкамМикросервера     = ТекКаталог+ИмяМикросервера+".ini";
	ПутьККомандномуФайлу			= ТекКаталог+ИмяМикросервера+".bat";
	
	Если Подключиться Тогда		
		Если НЕ ФайлСуществует(ПутьКМикросерверу) Тогда
			ФайлМикросервера	= ЭтотОбъект.ПолучитьМакет("PCWeb");
			Попытка
				ФайлМикросервера.Записать(ПутьКМикросерверу);
			Исключение
				Успешно	= Ложь;
			КонецПопытки;
		КонецЕсли;
		
		СистемнаяИнформация	= Новый СистемнаяИнформация();
		ВерсияПлатформы		= СистемнаяИнформация.ВерсияПриложения;
		
		ФайлНастроек	= Новый ТекстовыйДокумент();
		ФайлНастроек.УстановитьТекст("[config]
		|connectionstring="+ПутьКБазе+"; usr="""+ПользовательБазы+"""; pwd="""+ПарольКБазе+""";
		|port = "+ПортМикросервера+"
		|connectionlivetime = 9000000
		|ServerMode = 2
		|Platform1C = "+?(Найти(ВерсияПлатформы, "8.2")>0,"2",?(Найти(ВерсияПлатформы, "8.3")>0,"3","1"))+"
		|");
		ФайлНастроек.Записать(ПутьКНастройкамМикросервера, КодировкаТекста.ANSI);
		
		Попытка
			Выполнить("ЗапуститьПриложение(ПутьКМикросерверу);");
		Исключение
			Успешно	= Ложь;
		КонецПопытки;
		
	Иначе	
		
		ФайлНастроек	= Новый ТекстовыйДокумент();
		ФайлНастроек.УстановитьТекст("taskkill /IM "+ИмяМикросервера+".exe");
		ФайлНастроек.Записать(ПутьККомандномуФайлу, КодировкаТекста.ANSI);
		Выполнить("ЗапуститьПриложение(ПутьККомандномуФайлу)");
			
		Попытка
			УдалитьФайлы(ПутьКМикросерверу);	
		Исключение
			Успешно	= Ложь;
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ПутьКНастройкамМикросервера);	
		Исключение
			Успешно	= Ложь;
		КонецПопытки;
		
		Попытка
			УдалитьФайлы(ПутьККомандномуФайлу);	
		Исключение
			Успешно	= Ложь;
		КонецПопытки;		
	КонецЕсли;	
	
	Возврат Успешно;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С XML

// Функция осуществляет переход на указанное количество уровней дерева вниз
//
Функция СпуститьсяПоДереву(Дерево, Шаг=0)

	ТекущиеСтроки	= Дерево.Строки;
	ИскомаяСтрока	= Дерево;
		
	Для Индекс=1 По Шаг Цикл
		КоличествоСтрок	= ТекущиеСтроки.Количество();
		Если КоличествоСтрок>0 Тогда
			ИскомаяСтрока	= ТекущиеСтроки[КоличествоСтрок-1];
			ТекущиеСтроки	= ИскомаяСтрока.Строки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИскомаяСтрока;
	
КонецФункции

// Функция производит разбор данных полученных в ответ на запрос от серврера dms
// в формате xml.
// Параметры:
//	ОтветСервера		- Строка подлежащая разбору
//  СтруктураОшибок		- структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//	ПараметрыРазбора	- структура параметров разбираемого запроса
//
// Возвращаемое значение - Дерево значений, полученное после разбора xml
//
Функция РазобратьОтветСервера(Знач ОтветСервера, СтруктураОшибок, ПараметрыРазбора)
	
	Успешно			= Истина;
	ОбъектXML		= Новый ЧтениеXML();
	ДеревоЗапроса	= Новый ДеревоЗначений();
	
	Попытка
		ОбъектXML.УстановитьСтроку(ОтветСервера);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ИмяЗапроса		= "";	
	ТипЗапроса		= "";
	ВерсияЗапроса	= "";
	ИдЗапроса		= "";
	ЭтоЗапрос		= Ложь;
	
	ПоследовательностьЭлементов = "";
		
	Пока Истина Цикл	
		ОчереднойУзелXMLПрочитан = Ложь;	
		Попытка
			ОчереднойУзелXMLПрочитан = ОбъектXML.Прочитать();
		Исключение
			Успешно = Ложь;
			Прервать;
		КонецПопытки;	
		
		Если НЕ ОчереднойУзелXMLПрочитан Тогда
			Прервать;
		КонецЕсли;	
		
		ТипУзла		= ОбъектXML.ТипУзла;
		ИмяУзла		= ОбъектXML.Имя;
		
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда		
			ПоследовательностьЭлементов	= ДобавитьЭлементКПоследовательности(ПоследовательностьЭлементов, ИмяУзла);
			Успешно						= ОбработатьНачалоЭлемента(ОбъектXML, ПоследовательностьЭлементов, ДеревоЗапроса, СтруктураОшибок, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса, ЭтоЗапрос);
			Если НЕ Успешно Тогда
				Прервать;
			КонецЕсли;
			
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			ПоследовательностьЭлементов = УдалитьПоследнийЭлементИзПоследовательности(ПоследовательностьЭлементов);		
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда			
			ЗначениеЭлемента	= ОбъектXML.Значение;  
			Успешно				= ОбработатьЗначениеЭлемента(ПоследовательностьЭлементов, ЗначениеЭлемента, ДеревоЗапроса, СтруктураОшибок, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса, ЭтоЗапрос);
			Если НЕ Успешно Тогда
				Прервать;
			КонецЕсли;			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектXML.Закрыть();
	
	ПараметрыРазбора.ИмяЗапроса		= ИмяЗапроса;
	ПараметрыРазбора.ТипЗапроса		= ТипЗапроса;
	ПараметрыРазбора.ВерсияЗапроса	= ВерсияЗапроса;
	ПараметрыРазбора.ИдЗапроса		= ИдЗапроса;
	ПараметрыРазбора.ЭтоЗапрос		= ЭтоЗапрос;
	
	Если НЕ Успешно Тогда
		ДеревоЗапроса = Неопределено;
	КонецЕсли;
	
	Если НЕ ЭтоЗапрос Тогда		
		Если ИмяЗапроса="AddService" ИЛИ ИмяЗапроса="RemoveService"
			ИЛИ ИмяЗапроса="Activate" ИЛИ ИмяЗапроса="Subscribtion" Тогда
			НоваяСтрокаДерева				= ДеревоЗапроса.Строки.Добавить();
			НоваяСтрокаДерева.Имя			= ИмяЗапроса;
			НоваяСтрокаДерева.Тип			= ТипЗапроса;
			НоваяСтрокаДерева.Версия		= ВерсияЗапроса;
			НоваяСтрокаДерева.Идентификатор	= ИдЗапроса;
		КонецЕсли;
	КонецЕсли;
		
	Возврат ДеревоЗапроса;
	
КонецФункции

// Функция обрабатывает начало нового элемента xml
// Параметры:
//	ОбъектXML		- xml для разбора запроса
//	ИмяЭлемента		- текущий разбираемый узел xml
//	ДеревоЗапроса	- дерево значений, в которое сохраняется результат разбора xml
//	СтруктураОшибок	- структура для хранения информации об ошибках
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//	ЭтоЗапрос		- признак того, что в xml присутствует тэг COMMAND
//
Функция ОбработатьНачалоЭлемента(ОбъектXML, Знач ИмяЭлемента, ДеревоЗапроса, СтруктураОшибок, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса, ЭтоЗапрос)
	
	Успешно					= Истина;	
	ТекущаяСтрокаДерева		= Неопределено;		
	КоличествоЭлементов		= ДеревоЗапроса.Строки.Количество();
	
	Если КоличествоЭлементов>0 Тогда
		ТекущаяСтрокаДерева	= ДеревоЗапроса.Строки[КоличествоЭлементов - 1];
	КонецЕсли;	
	
	Если ИмяЭлемента = "MESSAGE" Тогда
		
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл						
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "VERSION" Тогда
				ВерсияДанныхЗапроса	= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.RESULT.RESPONSE" Тогда				
		
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл						
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "DTD" Тогда
				ТипЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "ID" Тогда
				ИдЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "NAME" Тогда	
				ИмяЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "VERSION" Тогда
				ВерсияЗапроса	= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		
		Если ТекущееИмяЗапроса="ALIVETEST" Тогда
			ДеревоЗапроса.Колонки.Добавить("Имя");
			ДеревоЗапроса.Колонки.Добавить("Тип");
			ДеревоЗапроса.Колонки.Добавить("Версия");
			ДеревоЗапроса.Колонки.Добавить("Идентификатор");
			ДеревоЗапроса.Колонки.Добавить("Поставщик");
			ДеревоЗапроса.Колонки.Добавить("Приемник");
			ДеревоЗапроса.Колонки.Добавить("Значение");
			
		ИначеЕсли ТекущееИмяЗапроса="LISTSERVICES" Тогда
			ДеревоЗапроса.Колонки.Добавить("Имя");
			ДеревоЗапроса.Колонки.Добавить("Доступ");
			ДеревоЗапроса.Колонки.Добавить("Комментарий");
			ДеревоЗапроса.Колонки.Добавить("Адрес");
			ДеревоЗапроса.Колонки.Добавить("АдресАдминистрирования");
			
		ИначеЕсли ТекущееИмяЗапроса="ACTIVATE" ИЛИ ТекущееИмяЗапроса="ADDSERVICE"
			ИЛИ ТекущееИмяЗапроса="REMOVESERVICE" ИЛИ ТекущееИмяЗапроса="SUBSCRIPTION" Тогда
			
			ДеревоЗапроса.Колонки.Добавить("Имя");
			ДеревоЗапроса.Колонки.Добавить("Тип");
			ДеревоЗапроса.Колонки.Добавить("Версия");
			ДеревоЗапроса.Колонки.Добавить("Идентификатор");
		КонецЕсли;
		
	//AliveTest
	ИначеЕсли ИмяЭлемента = "MESSAGE.RESULT.RESPONSE.DATA.APPLICATION" Тогда			

		Приемник		= "";			
		Имя				= "";
		Поставщик		= "";
		Версия			= "";
			
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл			
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "HOSTNAME" Тогда
				Приемник	= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "VENDOR" Тогда
				Поставщик		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "NAME" Тогда	
				Имя		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "VERSION" Тогда
				Версия		= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Имя) Тогда
			НоваяСтрока					= ДеревоЗапроса.Строки.Добавить();			
			НоваяСтрока.Приемник 		= Приемник;
			НоваяСтрока.Имя				= Имя;
			НоваяСтрока.Поставщик		= Поставщик;
			НоваяСтрока.Версия			= Версия;
		КонецЕсли;

		
	ИначеЕсли ИмяЭлемента = "MESSAGE.RESULT.RESPONSE.DATA.SERVICE" Тогда
		Имя						= "";
		Версия					= "";
		Доступ					= "";
		Комментарий				= "";
		Адрес					= "";
		АдресАдминистрирования	= "";
		
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл			
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "NAME" Тогда	
				Имя		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "VERSION" Тогда
				Версия		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "ACCESS" Тогда
				Доступ		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "COMMENT" Тогда
				Комментарий		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "URL" Тогда
				Адрес		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "ADMINURL" Тогда
				АдресАдминистрирования	= ОбъектXML.Значение;
				
			КонецЕсли;			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(Имя) Тогда
			ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
			
			Если ТекущееИмяЗапроса="ALIVETEST" Тогда
				ТекущаяСтрокаТеста				= СпуститьсяПоДереву(ДеревоЗапроса, 1);				
				Если ТекущаяСтрокаТеста<>Неопределено Тогда
					ТекущаяСтрокаТеста				= ТекущаяСтрокаТеста.Строки.Добавить();
					ТекущаяСтрокаТеста.Имя			= Имя;
				
					Если НЕ ПустаяСтрока(Версия) Тогда
						ТекущаяСтрокаТеста.Версия	= Версия;
					КонецЕсли;
				КонецЕсли;				
			КонецЕсли;
			
			Если ТекущееИмяЗапроса="LISTSERVICES" Тогда
				НоваяСтрока					= ДеревоЗапроса.Строки.Добавить();
				НоваяСтрока.Имя				= Имя;
			
				Если НЕ ПустаяСтрока(Версия) Тогда
					НоваяСтрока.Версия			= Версия;
				КонецЕсли;
				Если НЕ ПустаяСтрока(Доступ) Тогда
					НоваяСтрока.Доступ			= Доступ;
				КонецЕсли;
				Если НЕ ПустаяСтрока(Комментарий) Тогда
					НоваяСтрока.Комментарий			= Комментарий;
				КонецЕсли;
				Если НЕ ПустаяСтрока(Адрес) Тогда
					НоваяСтрока.Адрес			= Адрес;
				КонецЕсли;
				Если НЕ ПустаяСтрока(АдресАдминистрирования) Тогда
					НоваяСтрока.АдресАдминистрирования	= АдресАдминистрирования;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.RESULT.RESPONSE.DATA.SERVICE.METHOD" Тогда	

		Версия			= "";
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл			
			Если ВРег(ОбъектXML.Имя) = "VERSION" Тогда
				Версия		= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
				
		Если НЕ ПустаяСтрока(Версия) Тогда
			//AliveTest
			НайденныеСтроки	= ДеревоЗапроса.Строки.НайтиСтроки(Новый Структура("Имя", "DMSBackbone"), Истина);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				КоличествоЭлементов	= НайденнаяСтрока.Строки.Количество();
				Если КоличествоЭлементов>0 Тогда
					ТекСтрока			= НайденнаяСтрока.Строки[КоличествоЭлементов-1];
					НоваяСтрока			= ТекСтрока.Строки.Добавить();
					НоваяСтрока.Имя		= "Метод";	//METHOD
					НоваяСтрока.Версия	= Версия;
				КонецЕсли;
				Прервать;
			КонецЦикла;			
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST" Тогда
		
		ЭтоЗапрос	= Истина;
		
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл						
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "DTD" Тогда
				ТипЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "ID" Тогда
				ИдЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "NAME" Тогда	
				ИмяЗапроса		= ОбъектXML.Значение;
				
			ИначеЕсли ТекущееИмяАтрибута = "VERSION" Тогда
				ВерсияЗапроса	= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);
		
		Если ТекущееИмяЗапроса="ALIVETEST" Тогда
			
			ДеревоЗапроса.Колонки.Добавить("Имя");
			ДеревоЗапроса.Колонки.Добавить("Тип");
			ДеревоЗапроса.Колонки.Добавить("Версия");
			ДеревоЗапроса.Колонки.Добавить("Идентификатор");
			
		ИначеЕсли ТекущийТипЗапроса ="WORKSHOPORDER"
			ИЛИ ТекущийТипЗапроса="BUSINESSPARTNERDATA"
			ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA"
			ИЛИ ТекущийТипЗапроса="SPAREPARTORDER" Тогда
			
			Если ТекущееИмяЗапроса="LISTENTRIES"
				ИЛИ ТекущееИмяЗапроса="LISTORDER" Тогда
				
				ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
				ДеревоЗапроса.Колонки.Добавить("РегионDMS");
				ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
				ДеревоЗапроса.Колонки.Добавить("brand_id");
				
				Если ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда
					ДеревоЗапроса.Колонки.Добавить("Ограничение");	
				КонецЕсли;
				
			ИначеЕсли ТекущееИмяЗапроса="GETENTRY"
				ИЛИ ТекущееИмяЗапроса="GETORDER"
				ИЛИ ТекущееИмяЗапроса="DELETEORDERCONTENT" Тогда
				
				ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
				ДеревоЗапроса.Колонки.Добавить("РегионDMS");
				ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
				ДеревоЗапроса.Колонки.Добавить("brand_id");
				
				Если ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда
					ДеревоЗапроса.Колонки.Добавить("ИмяПоляПоиска");
					ДеревоЗапроса.Колонки.Добавить("ЗначениеПоляПоиска");
				ИначеЕсли ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
					ДеревоЗапроса.Колонки.Добавить("ИмяПоляПоиска");
					ДеревоЗапроса.Колонки.Добавить("ЗначениеПоляПоиска");
					ДеревоЗапроса.Колонки.Добавить("vin");
				Иначе
					ДеревоЗапроса.Колонки.Добавить("Номер");					
					Если ТекущееИмяЗапроса="GETENTRY" Тогда					
						ДеревоЗапроса.Колонки.Добавить("Ограничение");
						ДеревоЗапроса.Колонки.Добавить("Опция");
					ИначеЕсли ТекущееИмяЗапроса="GETORDER" Тогда					
						ДеревоЗапроса.Колонки.Добавить("Ограничение");
						ДеревоЗапроса.Колонки.Добавить("Опция");						
					ИначеЕсли  ТекущееИмяЗапроса="DELETEORDERCONTENT" И ТекущийТипЗапроса="WORKSHOPORDER" Тогда					
						ДеревоЗапроса.Колонки.Добавить("Ограничение");						
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="NEWORDER"
				ИЛИ ТекущееИмяЗапроса="CALCULATE" Тогда
				
				ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
				ДеревоЗапроса.Колонки.Добавить("РегионDMS");
				ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
				ДеревоЗапроса.Колонки.Добавить("brand_id");
				
				Если ТекущееИмяЗапроса="NEWORDER" Тогда					
					ДеревоЗапроса.Колонки.Добавить("customer_ref");
					ДеревоЗапроса.Колонки.Добавить("vehicle_ref");
					ДеревоЗапроса.Колонки.Добавить("vin");
					ДеревоЗапроса.Колонки.Добавить("license_tags");
					ДеревоЗапроса.Колонки.Добавить("order_type");
					
				ИначеЕсли ТекущееИмяЗапроса="UPDATEORDER" Тогда
					
					ДеревоЗапроса.Колонки.Добавить("Номер");
				КонецЕсли;
				ДеревоЗапроса.Колонки.Добавить("Опция");
				
				ДеревоЗапроса.Колонки.Добавить("НомерСтроки");
				ДеревоЗапроса.Колонки.Добавить("Источник");
				ДеревоЗапроса.Колонки.Добавить("invoice_text");
				
				Если ТекущийТипЗапроса<>"SPAREPARTORDER" Тогда
					ДеревоЗапроса.Колонки.Добавить("labour_no");					
					ДеревоЗапроса.Колонки.Добавить("type_of_family");
					ДеревоЗапроса.Колонки.Добавить("repair_group");
					ДеревоЗапроса.Колонки.Добавить("illustration_number");
					ДеревоЗапроса.Колонки.Добавить("task_number");
					ДеревоЗапроса.Колонки.Добавить("index_number");					
					ДеревоЗапроса.Колонки.Добавить("lac");
					ДеревоЗапроса.Колонки.Добавить("wsc");
					ДеревоЗапроса.Колонки.Добавить("billing_factor");
					ДеревоЗапроса.Колонки.Добавить("mechanics");
					ДеревоЗапроса.Колонки.Добавить("timeunits_buy");
					ДеревоЗапроса.Колонки.Добавить("timeunits_sell");
				КонецЕсли;
				
				ДеревоЗапроса.Колонки.Добавить("sparepart_no");
				ДеревоЗапроса.Колонки.Добавить("stocks");
				ДеревоЗапроса.Колонки.Добавить("stocks_type");
				ДеревоЗапроса.Колонки.Добавить("price");
				ДеревоЗапроса.Колонки.Добавить("currency");
				ДеревоЗапроса.Колонки.Добавить("taxcode");
				ДеревоЗапроса.Колонки.Добавить("taxcode_rate");
				ДеревоЗапроса.Колонки.Добавить("sparepart_category");
				ДеревоЗапроса.Колонки.Добавить("sparepart_group");
				
				ДеревоЗапроса.Колонки.Добавить("ТаблицаПакета");
				
			ИначеЕсли ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда	
				
				Если ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
					
					ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
					ДеревоЗапроса.Колонки.Добавить("РегионDMS");
					ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
					ДеревоЗапроса.Колонки.Добавить("brand_id");
					ДеревоЗапроса.Колонки.Добавить("Номер");
					ДеревоЗапроса.Колонки.Добавить("СсылкаЗапроса");
										
					ДеревоЗапроса.Колонки.Добавить("manufacturer");
					ДеревоЗапроса.Колонки.Добавить("description");
					ДеревоЗапроса.Колонки.Добавить("my");
					ДеревоЗапроса.Колонки.Добавить("vehicle_type");
					ДеревоЗапроса.Колонки.Добавить("engine_code");
					ДеревоЗапроса.Колонки.Добавить("transmission_type");
					ДеревоЗапроса.Колонки.Добавить("transmission_code");
					ДеревоЗапроса.Колонки.Добавить("license_tags");					
					ДеревоЗапроса.Колонки.Добавить("odometer_tag");
					ДеревоЗапроса.Колонки.Добавить("odometer");
					ДеревоЗапроса.Колонки.Добавить("hu");
					ДеревоЗапроса.Колонки.Добавить("au");
										
				ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда
					
					ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
					ДеревоЗапроса.Колонки.Добавить("РегионDMS");
					ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
					ДеревоЗапроса.Колонки.Добавить("brand_id");
					ДеревоЗапроса.Колонки.Добавить("СсылкаЗапроса");
					
					ДеревоЗапроса.Колонки.Добавить("pid");
					ДеревоЗапроса.Колонки.Добавить("partner_type");
					ДеревоЗапроса.Колонки.Добавить("partner_status");
					ДеревоЗапроса.Колонки.Добавить("account_no");
					ДеревоЗапроса.Колонки.Добавить("matchcode");
					ДеревоЗапроса.Колонки.Добавить("courtesy_title");
					ДеревоЗапроса.Колонки.Добавить("courtesy_type");
					ДеревоЗапроса.Колонки.Добавить("ТаблицаИмен");
					ДеревоЗапроса.Колонки.Добавить("adress");
					ДеревоЗапроса.Колонки.Добавить("zip");
					ДеревоЗапроса.Колонки.Добавить("city");
					ДеревоЗапроса.Колонки.Добавить("country");
					ДеревоЗапроса.Колонки.Добавить("ТаблицаКонтактов");
					ДеревоЗапроса.Колонки.Добавить("date_of_birth");
					ДеревоЗапроса.Колонки.Добавить("Валюта");
					ДеревоЗапроса.Колонки.Добавить("СвойствоГруппа");
					ДеревоЗапроса.Колонки.Добавить("СвойствоКодНовогоАвто");
					ДеревоЗапроса.Колонки.Добавить("СвойствоКодСбора");
					ДеревоЗапроса.Колонки.Добавить("СвойстваКопии");
					ДеревоЗапроса.Колонки.Добавить("КоэффициентОплаты");
					ДеревоЗапроса.Колонки.Добавить("КоэффициентЗапчастей");
					ДеревоЗапроса.Колонки.Добавить("ДатаПоследнегоИзменения");
					ДеревоЗапроса.Колонки.Добавить("КоличествоВизитов");
					ДеревоЗапроса.Колонки.Добавить("ТаблицаВизитов");
				КонецЕсли; 
				
			ИначеЕсли ТекущееИмяЗапроса="SUBSCRIPTION" Тогда
				
				ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
				ДеревоЗапроса.Колонки.Добавить("РегионDMS");
				ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
				ДеревоЗапроса.Колонки.Добавить("СобытиеЗапроса");
				ДеревоЗапроса.Колонки.Добавить("ПодписчикЗапроса");
				ДеревоЗапроса.Колонки.Добавить("СсылкаЗапроса");
				ДеревоЗапроса.Колонки.Добавить("Опция");
				
			КонецЕсли;
			
		ИначеЕсли ТекущийТипЗапроса ="SHOPDATA" Тогда	
			
			Если ТекущееИмяЗапроса="GETSTOCKINFORMATION" Тогда
				ДеревоЗапроса.Колонки.Добавить("СтранаDMS");
				ДеревоЗапроса.Колонки.Добавить("РегионDMS");
				ДеревоЗапроса.Колонки.Добавить("ДилерDMS");
				ДеревоЗапроса.Колонки.Добавить("brand_id");
				ДеревоЗапроса.Колонки.Добавить("sparepart_no");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.PARAM" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);
		
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="BUSINESSPARTNERDATA"
			ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" ИЛИ ТекущийТипЗапроса="SHOPDATA"
			ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="LISTENTRIES" ИЛИ ТекущееИмяЗапроса="GETENTRY" 
			ИЛИ ТекущееИмяЗапроса="LISTORDER" ИЛИ ТекущееИмяЗапроса="GETORDER"
			ИЛИ ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="SUBSCRIPTION"
			ИЛИ ТекущееИмяЗапроса="DELETEORDERCONTENT" ИЛИ ТекущееИмяЗапроса="UPDATEENTRY"
			ИЛИ ТекущееИмяЗапроса="GETSTOCKINFORMATION" ИЛИ ТекущееИмяЗапроса="NEWORDER"
			ИЛИ ТекущееИмяЗапроса="NEWENTRY" ИЛИ ТекущееИмяЗапроса="CALCULATE") Тогда
			
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл						
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "NAME" Тогда
					ИмяПараметра		= ОбъектXML.Значение;
					
				ИначеЕсли ТекущееИмяАтрибута = "VALUE" Тогда
					ЗначениеПараметра	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;
		
		    КоличествоЭлементов		= ДеревоЗапроса.Строки.Количество();		
			Если КоличествоЭлементов=0 Тогда
				ТекущаяСтрокаДерева	= ДеревоЗапроса.Строки.Добавить();
			Иначе
				ТекущаяСтрокаДерева	= ДеревоЗапроса.Строки[КоличествоЭлементов - 1];
			КонецЕсли;
			
			ТекущееИмяПараметра	= ВРег(ИмяПараметра);
			
			Если ТекущееИмяПараметра="COUNTRY_CODE" Тогда
				ТекущаяСтрокаДерева.СтранаDMS	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="REGION" Тогда
				ТекущаяСтрокаДерева.РегионDMS	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="DEALER" Тогда
				ТекущаяСтрокаДерева.ДилерDMS	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="BRAND_ID" Тогда
				ТекущаяСтрокаДерева.brand_id	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="ORDER_NO" Тогда
				ПараметрыПреобразования		= Новый Структура();
				ПараметрыПреобразования.Вставить("Имя", "ORDER_NO");
				ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНомеров);
				ТекущаяСтрокаДерева.Номер	= ПривестиКТипу(ЗначениеПараметра, "Строка", ПараметрыПреобразования);
				
			ИначеЕсли ТекущееИмяПараметра="SPAREPART_NO" Тогда
				
				ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 1);				
				Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
					ТекущаяСтрокаЗапчасти				= ТекущаяСтрокаЗапчасти.Строки.Добавить();
					ТекущаяСтрокаЗапчасти.sparepart_no	= ПривестиКТипу(ЗначениеПараметра, "Строка");
				КонецЕсли;
				
			ИначеЕсли ТекущееИмяПараметра="OPTION" Тогда
				// Для UPDATEORDER CHARGE; UNPRICED
				ТекущаяСтрокаДерева.Опция	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="SUBJECT" Тогда
				Если ВРег(ИмяЗапроса)="SUBSCRIPTION" Тогда
					ТекущаяСтрокаДерева.СобытиеЗапроса	= ЗначениеПараметра;
				ИначеЕсли ТекущийТипЗапроса="WORKSHOPORDER" Тогда
					ТекущаяСтрокаДерева.Ограничение	= ЗначениеПараметра;	//LABOUR_OPERATION; SPAREPART
				КонецЕсли;		
				
			ИначеЕсли ТекущееИмяПараметра="SUBSCRIBER" Тогда
				ТекущаяСтрокаДерева.ПодписчикЗапроса	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="REFERENCE" Тогда
				ТекущаяСтрокаДерева.СсылкаЗапроса	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="CUSTOMER_REF" Тогда
				ТекущаяСтрокаДерева.customer_ref	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="VEHICLE_REF" Тогда
				ТекущаяСтрокаДерева.vehicle_ref	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="VIN" Тогда				
				Если (ТекущееИмяЗапроса="GETENTRY")
					И (ТекущийТипЗапроса="BUSINESSPARTNERDATA" ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA") Тогда
					ТекущаяСтрокаДерева.ИмяПоляПоиска		= ИмяПараметра;
					ТекущаяСтрокаДерева.ЗначениеПоляПоиска	= ЗначениеПараметра;
				Иначе
					ТекущаяСтрокаДерева.vin	= ЗначениеПараметра;
				КонецЕсли;
				
			ИначеЕсли ТекущееИмяПараметра="LICENSE_TAGS" Тогда
				ТекущаяСтрокаДерева.license_tags	= ЗначениеПараметра;
				
			ИначеЕсли ТекущееИмяПараметра="ORDER_TYPE" Тогда
				ТекущаяСтрокаДерева.order_type	= ЗначениеПараметра;
				
			Иначе	
				Если (ТекущееИмяЗапроса="GETENTRY")
					И (ТекущийТипЗапроса="BUSINESSPARTNERDATA" ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA") Тогда
					ТекущаяСтрокаДерева.ИмяПоляПоиска		= ИмяПараметра;
					ТекущаяСтрокаДерева.ЗначениеПоляПоиска	= ЗначениеПараметра;
				КонецЕсли;
			КонецЕсли;			
			
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM" Тогда	
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="CALCULATE") Тогда
			
			ТекНомерСтроки	= "";			
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "OIID" Тогда
					ТекНомерСтроки		= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 1);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				НоваяСтрокаРаботы				= ТекущаяСтрокаРаботы.Строки.Добавить();
				НоваяСтрокаРаботы.НомерСтроки	= ТекНомерСтроки;
			КонецЕсли;						
		КонецЕсли;		
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION" Тогда	
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущийТипЗапроса="WORKSHOPORDER" И (ТекущееИмяЗапроса="UPDATEORDER"
			ИЛИ ТекущееИмяЗапроса="CALCULATION") Тогда
			Работа		= "";
			Источник	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "LOID" Тогда
					Работа		= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "ORIGIN" Тогда
					Источник	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.labour_no	= Работа;
				ТекущаяСтрокаРаботы.Источник	= Источник;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.MECHANIC" Тогда
			
		ТекущаяСтрокаРаботы	= СпуститьсяПоДереву(ДеревоЗапроса, 2);							
		Если ТекущаяСтрокаРаботы<>Неопределено Тогда
			
			Если ТекущаяСтрокаРаботы.mechanics=Неопределено Тогда
				mechanics	= Новый ТаблицаЗначений();
				mechanics.Колонки.Добавить("Значение");
				ТекущаяСтрокаРаботы.mechanics	= mechanics;
			КонецЕсли;
			mechanics		= ТекущаяСтрокаРаботы.mechanics;						
		КонецЕсли;		
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART" Тогда	
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="CALCULATION") Тогда
			Запчасть	= "";
			Источник	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "SID" Тогда
					Запчасть		= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "ORIGIN" Тогда
					Источник		= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.sparepart_no	= Запчасть;
				ТекущаяСтрокаЗапчасти.Источник		= Источник;
			КонецЕсли;	
		КонецЕсли;
		   
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.STOCKS" Тогда	
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="CALCULATION") Тогда
			
			ТипСклада		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипСклада		= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.stocks_type		= ТипСклада;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.PRICE" Тогда	
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="CALCULATION") Тогда
			
			ТипЦены			= "";
			ВалютаЗаказа	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипЦены		= ОбъектXML.Значение;
				ИначеЕсли  ТекущееИмяАтрибута="CURRENCY" Тогда
					ВалютаЗаказа= ОбъектXML.Значение; 
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.currency		= ВалютаЗаказа;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.TAXCODE" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER")
			И (ТекущееИмяЗапроса="UPDATEORDER" ИЛИ ТекущееИмяЗапроса="CALCULATION") Тогда
			СтавкаНалога			= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "RATE" Тогда
					СтавкаНалога		= ОбъектXML.Значение; 
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаЗапчасти		= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.taxcode_rate		= СтавкаНалога;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.TRANSMISSION"
		ИЛИ ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.TRANSMISSION" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" И ТекущееИмяЗапроса="UPDATEENTRY" Тогда
			ТипКПП			= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипКПП		= ОбъектXML.Значение; 
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаАвтомобиль		= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиль<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиль.transmission_type		= ТипКПП;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.HISTORY.ODOMETER" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
			ПризнакОдометра	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TAG" Тогда
					ПризнакОдометра		= ОбъектXML.Значение; 
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаАвтомобиль		= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиль<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиль.odometer_tag	= ПризнакОдометра;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			КодКонтрагента		= "";
			ТипКонтрагента		= "";
			СтатусКонтрагента	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "PID" Тогда
					КодКонтрагента	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "TYPE" Тогда
					ТипКонтрагента	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "STATUS" Тогда
					СтатусКонтрагента= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.pid				= КодКонтрагента;
				ТекущаяСтрокаКонтрагента.partner_type		= ТипКонтрагента;
				ТекущаяСтрокаКонтрагента.partner_status		= СтатусКонтрагента;
			КонецЕсли;	
		КонецЕсли;		
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.ACCOUNT_NO" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			СтранаКонтрагента		= "";
			РегионКонтрагента		= "";
			ДилерКонтрагента		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "COUNTRY_CODE" Тогда
					СтранаКонтрагента	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "REGION" Тогда
					РегионКонтрагента	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "DEALER" Тогда
					ДилерКонтрагента	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
			КонецЕсли;	
		КонецЕсли;		
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.COURTESY_TITLE" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			ТипФормыОбращения		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипФормыОбращения	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.courtesy_type	= ТипФормыОбращения;
			КонецЕсли;	
		КонецЕсли;	
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.NAME" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			ТипИмени		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипИмени	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);							
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				
				Если ТекущаяСтрокаКонтрагента.ТаблицаИмен=Неопределено Тогда
					ТаблицаИмен	= Новый ТаблицаЗначений();
					ТаблицаИмен.Колонки.Добавить("Тип");
					ТаблицаИмен.Колонки.Добавить("Значение");
					ТекущаяСтрокаКонтрагента.ТаблицаИмен	= ТаблицаИмен;
				КонецЕсли;
				ТаблицаИмен		= ТекущаяСтрокаКонтрагента.ТаблицаИмен;
				НоваяСтрока		= ТаблицаИмен.Добавить();
				НоваяСтрока.Тип	= ТипИмени;
									
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.CONTACT" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			ТипКонтакта		= "";
			ПризнакКонтакта	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипКонтакта	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "SIGN" Тогда
					ПризнакКонтакта	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);							
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда				
				Если ТекущаяСтрокаКонтрагента.ТаблицаКонтактов=Неопределено Тогда
					ТаблицаКонтактов	= Новый ТаблицаЗначений();
					ТаблицаКонтактов.Колонки.Добавить("Тип");
					ТаблицаКонтактов.Колонки.Добавить("Признак");
					ТаблицаКонтактов.Колонки.Добавить("Значение");
					ТекущаяСтрокаКонтрагента.ТаблицаКонтактов	= ТаблицаКонтактов;
				КонецЕсли;
				ТаблицаКонтактов	= ТекущаяСтрокаКонтрагента.ТаблицаКонтактов;
				НоваяСтрока			= ТаблицаКонтактов.Добавить();
				НоваяСтрока.Тип		= ТипКонтакта;
				НоваяСтрока.Признак	= ПризнакКонтакта;
								
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.DATE_OF_VISITS" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если ТекущееИмяЗапроса="UPDATEENTRY" ИЛИ ТекущееИмяЗапроса="NEWENTRY" Тогда
			ТипВизита		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "TYPE" Тогда
					ТипВизита	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);							
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				Если ТекущаяСтрокаКонтрагента.ТаблицаВизитов=Неопределено Тогда
					ТаблицаВизитов	= Новый ТаблицаЗначений();
					ТаблицаВизитов.Колонки.Добавить("Тип");
					ТаблицаВизитов.Колонки.Добавить("Значение");
					ТекущаяСтрокаКонтрагента.ТаблицаВизитов	= ТаблицаВизитов;
				КонецЕсли;	
				НоваяСтрока		= ТекущаяСтрокаКонтрагента.ТаблицаВизитов.Добавить();
				НоваяСтрока.Тип		= ТипВизита;								
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущееИмяЗапроса="CALCULATE" ИЛИ ТекущееИмяЗапроса="UPDATEORDER") Тогда
			Источник		= "";
			КодПакета		= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "ORIGIN" Тогда
					Источник	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "CODE" Тогда
					КодПакета	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);							
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				
				Если ТекущаяСтрокаПакета.ТаблицаПакета=Неопределено Тогда
					ТаблицаПакета	= Новый ТаблицаЗначений();
					ТаблицаПакета.Колонки.Добавить("Источник");
					ТаблицаПакета.Колонки.Добавить("КодПакета");
					ТаблицаПакета.Колонки.Добавить("ИдПакета");
					ТаблицаПакета.Колонки.Добавить("ЯзыкТекстаСчета");
					ТаблицаПакета.Колонки.Добавить("ТекстСчета");
					ТаблицаПакета.Колонки.Добавить("ТрудоваяНорма");
					ТаблицаПакета.Колонки.Добавить("ИдОбъекта");
					ТаблицаПакета.Колонки.Добавить("Механик");
					ТаблицаПакета.Колонки.Добавить("ВремяРаботы");
					ТаблицаПакета.Колонки.Добавить("ВалютаЦены");
					ТаблицаПакета.Колонки.Добавить("ТипЦены");
					ТаблицаПакета.Колонки.Добавить("СкидкаЦены");
					ТаблицаПакета.Колонки.Добавить("Цена");
					ТаблицаПакета.Колонки.Добавить("Набор");
					ТекущаяСтрокаПакета.ТаблицаПакета	= ТаблицаПакета;
				КонецЕсли;
				НоваяСтрока	= ТекущаяСтрокаПакета.ТаблицаПакета.Добавить();
				НоваяСтрока.Источник	= Источник;
				НоваяСтрока.КодПакета	= КодПакета;
									
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.INVOICE_TEXT" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущееИмяЗапроса="CALCULATE" ИЛИ ТекущееИмяЗапроса="UPDATEORDER") Тогда
			ЯзыкТекстаСчета	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "LANG" Тогда
					ЯзыкТекстаСчета	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ЯзыкТекстаСчета= ЯзыкТекстаСчета;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
	ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.PRICE" Тогда
		
		ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
		ТекущийТипЗапроса	= ВРег(ТипЗапроса);	
		Если (ТекущееИмяЗапроса="CALCULATE" ИЛИ ТекущееИмяЗапроса="UPDATEORDER") Тогда
			ВалютаЦены	= "";
			ТипЦены		= "";
			СкидкаЦены	= "";
			Пока ОбъектXML.ПрочитатьАтрибут() Цикл				
				ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
				Если ТекущееИмяАтрибута = "CURRENCY" Тогда
					ВалютаЦены	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "TYPE" Тогда
					ТипЦены	= ОбъектXML.Значение;
				ИначеЕсли ТекущееИмяАтрибута = "DISCOUNT" Тогда
					СкидкаЦены	= ОбъектXML.Значение;
				КонецЕсли;			
			КонецЦикла;			
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ВалютаЦены= ВалютаЦены;
					ТекущаяСтрока.ТипЦены	= ТипЦены;
					ТекущаяСтрока.СкидкаЦены= СкидкаЦены;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	
	ИначеЕсли ИмяЭлемента = "MESSAGE.EXCEPTION.ERROR" Тогда
		Пока ОбъектXML.ПрочитатьАтрибут() Цикл			
			ТекущееИмяАтрибута	= ВРег(ОбъектXML.Имя);
			Если ТекущееИмяАтрибута = "IDREFS" Тогда
				СтруктураОшибок.Ид	= ОбъектXML.Значение;
			КонецЕсли;			
		КонецЦикла;
		
		// Добавление пустой строки в дерево для того, чтобы корректно прочитать значения узлов
		НоваяСтрока					= ДеревоЗапроса.Строки.Добавить();
		
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

// Функция обрабатывает значение узла объекта xml
// Параметры:
//	ИмяЭлемента		- имя элемента
//	ЗначениеЭлемента- значение элемента
//	ДеревоЗапроса	- дерево значений для формирования результата
//	СтруктураОшибок	- структура для хранения информации об ошибках
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//	ЭтоЗапрос		- признак того, что в xml присутствует тэг COMMAND
//
// Возвращаемое значение - дерево с разобранным xml
//
Функция ОбработатьЗначениеЭлемента(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ДеревоЗапроса, СтруктураОшибок, ИмяЗапроса, типЗапроса, версияЗапроса, ИдЗапроса, ЭтоЗапрос);
	
	Успешно				= Истина;
	КоличествоЭлементов	= ДеревоЗапроса.Строки.Количество();
	ИмяТекущегоЭлемента	= ПолучитьИмяЭлементаИзПоследовательности(ИмяЭлемента);
	
	Если КоличествоЭлементов > 0 Тогда
		
		ТекущаяСтрокаДерева       = ДеревоЗапроса.Строки[КоличествоЭлементов - 1];	
		
		Если ИмяЭлемента = "MESSAGE.RESULT.RESPONSE.DATA.SERVICE.METHOD" Тогда	
			
			//AliveTest
			НайденныеСтроки	= ДеревоЗапроса.Строки.НайтиСтроки(Новый Структура("Имя", "DMSBackbone"), Истина);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				КоличествоСервисов	= НайденнаяСтрока.Строки.Количество();
				Если КоличествоСервисов>0 Тогда
					ТекСтрокаСервис		= НайденнаяСтрока.Строки[КоличествоСервисов-1];
					КоличествоМетодов	= ТекСтрокаСервис.Строки.Количество();
					Если КоличествоМетодов>0 Тогда
						ТекСтрокаМетод	= ТекСтрокаСервис.Строки[КоличествоМетодов-1];
						ТекСтрокаМетод.Значение	= ЗначениеЭлемента;
					КонецЕсли;
				КонецЕсли;
				Прервать;
			КонецЦикла;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.TYPE_OF_FAMILY" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.type_of_family		= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.LO_NUMBER.REPAIR_GROUP" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.repair_group= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.LO_NUMBER.ILLUSTRATION_NUMBER" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.illustration_number	= ЗначениеЭлемента;
			КонецЕсли;
			                                                               
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.LO_NUMBER.TASK" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.task_number		= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.LO_NUMBER.INDEX" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.index_number	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.INVOICE_TEXT" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.invoice_text	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.LAC" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.lac		= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.WSC" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.wsc	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.BILLING_FACTOR" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				ТекущаяСтрокаРаботы.billing_factor	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.MECHANIC" Тогда
			
			ЗначениеЭлемента	= СокрЛП(ЗначениеЭлемента);
			
			ТекущаяСтрокаРаботы	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				mechanics			= ТекущаяСтрокаРаботы.mechanics;
				Если ТипЗнч(mechanics)=Тип("ТаблицаЗначений") Тогда					
					Если НЕ ПустаяСтрока(ЗначениеЭлемента) Тогда
						ТекущаяСтрока			= mechanics.Добавить();
						ТекущаяСтрока.Значение	= ЗначениеЭлемента;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.LABOUR_OPERATION.TIMEUNITS" Тогда
			
			ТекущаяСтрокаРаботы					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаРаботы<>Неопределено Тогда
				Если ЗначениеЗаполнено(ТекущаяСтрокаРаботы.timeunits_buy) Тогда
					ТекущаяСтрокаРаботы.timeunits_sell	= ЗначениеЭлемента;	
				Иначе
					ТекущаяСтрокаРаботы.timeunits_buy	= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.SPAREPART_NO" Тогда
			
			ТекущаяСтрокаЗапчасти				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.sparepart_no	= ЗначениеЭлемента;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.INVOICE_TEXT" Тогда
			
			ТекущаяСтрокаЗапчасти				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.invoice_text	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.STOCKS" Тогда
			
			ТекущаяСтрокаЗапчасти				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.stocks	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.PRICE" Тогда				
				
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.price	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.TAXCODE" Тогда				
				
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.taxcode	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.SPAREPART_CATEGORY" Тогда				
				
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.sparepart_category	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.SPAREPART.SPAREPART_GROUP" Тогда				
				
			ТекущаяСтрокаЗапчасти					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаЗапчасти<>Неопределено Тогда
				ТекущаяСтрокаЗапчасти.sparepart_group	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE_TYPE" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.vehicle_type	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.MANUFACTURER" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.manufacturer	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.DESCRIPTION" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.description	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.MY" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.my	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.REGISTRATION.LICENSE_TAGS" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.license_tags	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.HISTORY.ODOMETER" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.odometer	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.HISTORY.HU" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.hu	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.HISTORY.AU" Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.au	= ЗначениеЭлемента;
			КонецЕсли;			
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ENGINE.ENGINE_CODE"
			ИЛИ ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.VEHICLE.ENGINE.ENGINE_CODE"Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.engine_code	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.TRANSMISSION.TRANSMISSION_CODE"
			ИЛИ ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.TRANSMISSION.VEHICLE.TRANSMISSION_CODE"Тогда				
				
			ТекущаяСтрокаАвтомобиля					= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаАвтомобиля<>Неопределено Тогда
				ТекущаяСтрокаАвтомобиля.transmission_code= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.ACCOUNT_NO" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 1);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.account_no	= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.MATCHCODE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.matchcode= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.COURTESY_TITLE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.courtesy_title= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.NAME" Тогда
			
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТаблицаИмен					= ТекущаяСтрокаКонтрагента.ТаблицаИмен;
				Если ТипЗнч(ТаблицаИмен)=Тип("ТаблицаЗначений") И ТаблицаИмен.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаИмен.Количество();
					ТекущаяСтрока			= ТаблицаИмен[КоличествоСтрок-1];
					ТекущаяСтрока.Значение	= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.ADDRESS" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.adress= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.ZIP" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.zip= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.CITY" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.city= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.COUNTRY" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.country= ЗначениеЭлемента;
			КонецЕсли;			
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.CONTACT" Тогда
			
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТаблицаКонтактов				= ТекущаяСтрокаКонтрагента.ТаблицаКонтактов;
				Если ТипЗнч(ТаблицаКонтактов)=Тип("ТаблицаЗначений") И ТаблицаКонтактов.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаКонтактов.Количество();
					ТекущаяСтрока			= ТаблицаКонтактов[КоличествоСтрок-1];
					ТекущаяСтрока.Значение	= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;			
					
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.DATE_OF_BIRTH" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.date_of_birth= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.CURRENCY" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.Валюта= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.PROPERTIES.CUSTOMER_GROUP" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.СвойствоГруппа= ЗначениеЭлемента;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.PROPERTIES.NEWVEHICLE_CODE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.СвойствоКодНовогоАвто= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.PROPERTIES.GATHERING_CODE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.СвойствоКодСбора= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.PROPERTIES.COPIES" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.СвойстваКопии= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.DISCOUNT.WAGES_SHARE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.КоэффициентОплаты= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.DISCOUNT.PARTS_SHARE" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.КоэффициентЗапчастей= ЗначениеЭлемента;
			КонецЕсли;
						
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.LAST_MODIFIED" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.ДатаПоследнегоИзменения= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.NUMBER_OF_VISITS" Тогда				
				
			ТекущаяСтрокаКонтрагента				= СпуститьсяПоДереву(ДеревоЗапроса, 2);				
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТекущаяСтрокаКонтрагента.КоличествоВизитов= ЗначениеЭлемента;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.BUSINESS_PARTNER.DATE_OF_VISITS" Тогда				
				
			ТекущаяСтрокаКонтрагента	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаКонтрагента<>Неопределено Тогда
				ТаблицаВизитов				= ТекущаяСтрокаКонтрагента.ТаблицаВизитов;
				Если ТипЗнч(ТаблицаВизитов)=Тип("ТаблицаЗначений") И ТаблицаВизитов.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаВизитов.Количество();
					ТекущаяСтрока			= ТаблицаВизитов[КоличествоСтрок-1];
					ТекущаяСтрока.Значение	= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.PACKET_ID" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ИдПакета	= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.INVOICE_TEXT" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ТекстСчета= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.BILLING_FACTOR" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ТрудоваяНорма= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.OBJECT_ID" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ИдОбъекта= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;	
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.MECHANIC" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.Механик= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.TIMEUNITS" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.ВремяРаботы= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.PRICE" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.Цена= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.COMMAND.REQUEST.DATA.ORDER_ITEM.PACKET_INFO.KIT" Тогда
			
			ТекущаяСтрокаПакета	= СпуститьсяПоДереву(ДеревоЗапроса, 2);			
			Если ТекущаяСтрокаПакета<>Неопределено Тогда
				ТаблицаПакета					= ТекущаяСтрокаПакета.ТаблицаПакета;
				Если ТипЗнч(ТаблицаПакета)=Тип("ТаблицаЗначений") И ТаблицаПакета.Количество()>0 Тогда
					КоличествоСтрок			= ТаблицаПакета.Количество();
					ТекущаяСтрока			= ТаблицаПакета[КоличествоСтрок-1];
					ТекущаяСтрока.Набор= ЗначениеЭлемента;
				КонецЕсли;
			КонецЕсли;
		
		ИначеЕсли ИмяЭлемента = "MESSAGE.EXCEPTION.ERROR.CODE" Тогда
			
			СтруктураОшибок.Вставить("Код", ЗначениеЭлемента);
			
		ИначеЕсли ИмяЭлемента = "MESSAGE.EXCEPTION.ERROR.TEXT" Тогда
			
			СтруктураОшибок.Вставить("Описание", ЗначениеЭлемента);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Успешно;

КонецФункции

// Функция формирует строку последовательности обхода узлов по иерархии
// Параметры:
//	ПоследовательностьЭлементов - строка последовательности узлов обхода
//	ИмяУзла - имя добавляемого в последовательность узла
//
// Возвращаемое значение - строка последовательности
Функция ДобавитьЭлементКПоследовательности(Знач ПоследовательностьЭлементов, Знач ИмяУзла)
			
	Если НЕ ПоследовательностьЭлементов = "" Тогда
		ПоследовательностьЭлементов = ПоследовательностьЭлементов + ".";	
	КонецЕсли;	
	ПоследовательностьЭлементов = ПоследовательностьЭлементов + ИмяУзла;
	
	Возврат ПоследовательностьЭлементов;

КонецФункции

// Функция получает имя элемента из последовательности
//
Функция ПолучитьИмяЭлементаИзПоследовательности(Знач ПоследовательностьЭлементов)
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ИмяПоследнегоЭлемента = "";
	Если КоличествоЭлементов > 0 Тогда
		ИмяПоследнегоЭлемента = СтрПолучитьСтроку(ПромСтрока, КоличествоЭлементов);
	КонецЕсли;
	
	Возврат ИмяПоследнегоЭлемента;
	
КонецФункции

// Функция исключает из последовательности последний узел
// Параметры:
//	ПоследовательностьЭлементов - разбираемая псоледовательность
//
// Возвращаемое значение - строка-последовательность без последнего узла
//
Функция УдалитьПоследнийЭлементИзПоследовательности(Знач ПоследовательностьЭлементов);
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ПоследовательностьЭлементов	= "";
	Если КоличествоЭлементов > 0 Тогда
		КоличествоЭлементов = КоличествоЭлементов - 1;
		Для Счетчик = 1 По КоличествоЭлементов Цикл
			ПоследовательностьЭлементов	= ПоследовательностьЭлементов + "." + СтрПолучитьСтроку(ПромСтрока, Счетчик);
		КонецЦикла;	
		ПоследовательностьЭлементов = Прав(ПоследовательностьЭлементов, СтрДлина(ПоследовательностьЭлементов) - 1);
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕРЕДАЧИ ДАННЫХ DMSBB

// Функция формирует запрос для отправки на сервер DMSBB
// Параметры:
//	ТипСервиса	- текстовое наименование сервиса, для которого необходимо сформировать запрос
//	ПараметрыЗапроса	- параметры формирования запроса
//
// Возвращаемое значение - запрос в виде xml для отправки на сервер
//
Функция СформироватьЗапросДляСервера(ТипСервиса, ПараметрыЗапроса)
	
	ТекстЗапроса	= "";		
	ЗаписьXML	= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТипЗнч(ПараметрыЗапроса)<>Тип("Структура") Тогда
		ТекстЗапроса	= ЗаписьXML.Закрыть();
		Возврат ТекстЗапроса
	КонецЕсли;
	
	ИдентификаторЗапроса	= "";
	ПараметрыЗапроса.Свойство("ИдентификаторЗапроса", ИдентификаторЗапроса);
	
	Если ТипСервиса="DMSBackBone.AliveTest" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", "1.0");	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"AliveTest");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","");
		ЗаписьXML.ЗаписатьАтрибут("ID",		ИдентификаторЗапроса);				
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
		
	ИначеЕсли ТипСервиса="DMSBackBone.Activate" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"Activate");				
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
		
	ИначеЕсли ТипСервиса="DMSBackBone.ListServices" Тогда	
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"ListServices");				
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТипСервиса="DMSBackBone.AddService" Тогда
		
		ИмяСервиса			= Неопределено;
		АдресСервисаПодписки= Неопределено;
		КомментарийСервиса	= Неопределено;
		ПараметрыЗапроса.Свойство("ИмяСервиса",		ИмяСервиса);
		ПараметрыЗапроса.Свойство("АдресСервисаПодписки",	АдресСервисаПодписки);
		ПараметрыЗапроса.Свойство("КомментарийСервиса",КомментарийСервиса);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", "1.0");	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"AddService");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		ИдентификаторЗапроса);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	?(ИмяСервиса=Неопределено,"OrderService", ИмяСервиса));
		ЗаписьXML.ЗаписатьАтрибут("URL",	?(АдресСервисаПодписки=Неопределено,"http://localhost:6669/OrderService", АдресСервисаПодписки));
		ЗаписьXML.ЗаписатьАтрибут("COMMENT",?(КомментарийСервиса=Неопределено,"Order service", КомментарийСервиса));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТипСервиса="DMSBackBone.RemoveService" Тогда
		
		ИмяСервиса			= Неопределено;
		ПараметрыЗапроса.Свойство("ИмяСервиса",		ИмяСервиса);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", "1.0");	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"RemoveService");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		ИдентификаторЗапроса);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	?(ИмяСервиса=Неопределено,"OrderService", ИмяСервиса));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТипСервиса="WorkshopOrder.Subscribtion" Тогда	
		
		Событие				= Неопределено;
		Сервис				= Неопределено;
		Подписчик			= Неопределено;
		ОтписатьсяОтСобытия	= Неопределено;
		ПараметрыЗапроса.Свойство("Событие",	Событие);
		ПараметрыЗапроса.Свойство("Сервис",		Сервис);
		ПараметрыЗапроса.Свойство("Подписчик",	Подписчик);
		ПараметрыЗапроса.Свойство("ОтписатьсяОтСобытия", ОтписатьсяОтСобытия);		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
		ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"Subscription");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	Сервис);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		ИдентификаторЗапроса);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"COUNTRY_CODE");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(СтранаDMS));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"REGION");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(РегионDMS));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"DEALER");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(ДилерDMS));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"SUBJECT");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	Событие);
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"SUBSCRIBER");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	Подписчик);
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"REFERENCE");
		ЗаписьXML.ЗаписатьАтрибут("VALUE",	"");
		ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
		
		Если ОтписатьсяОтСобытия Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
			ЗаписьXML.ЗаписатьАтрибут("NAME",	"OPTION");
			ЗаписьXML.ЗаписатьАтрибут("VALUE",	"Unsubscribe");
			ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM	
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
		ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
		
	КонецЕсли;
	
	ТекстЗапроса	= ЗаписьXML.Закрыть();
	
	ТекстЗапроса	= "<?xml version=""1.0"" encoding="""+КодировкаПоУмолчанию+"""?>
	|"+ТекстЗапроса;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Функция осуществляет вызов метода AliveTest
// Параметры:
//  СтруктураОшибок - структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ВызватьМетодAliveTest(СтруктураОшибок) Экспорт
	
	ИмяСервиса				= "DMSBackBone.AliveTest";
	АдресСкрипта			= ПолучитьАдресСкрипта();
	ИдентификаторЗапроса	= ПолучитьИдентификаторПоВремени();
	
	ПараметрыЗапроса	= Новый Структура();
	ПараметрыЗапроса.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "AliveTest";
	СтрокаОтладки.Сервис	= "DMSBackbone";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;
	
КонецФункции

// Функция осуществляет добавление нового сервиса
// Параметры:
//  СтруктураОшибок 		- структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//	ИмяСервиса				- имя нового сервиса
//	АдресНовогоСервиса		- адрес доступа к сервису
//	КомментарийНовогоСервиса- комментарий к новому сервису
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ВызватьМетодAddService(СтруктураОшибок, ИмяНовогоСервиса, АдресНовгоСервиса, КомментарийНовогоСервиса) Экспорт

	ИмяСервиса				= "DMSBackBone.AddService";
	АдресСкрипта			= ПолучитьАдресСкрипта();
	ИдентификаторЗапроса	= ПолучитьИдентификаторПоВремени();
	
	ПараметрыЗапроса	= Новый Структура();
	ПараметрыЗапроса.Вставить("ИдентификаторЗапроса",	ИдентификаторЗапроса);
	ПараметрыЗапроса.Вставить("ИмяСервиса",				ИмяНовогоСервиса);
	ПараметрыЗапроса.Вставить("АдресСервисаПодписки",	АдресНовгоСервиса);
	ПараметрыЗапроса.Вставить("КомментарийСервиса",		КомментарийНовогоСервиса);
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "Add service";
	СтрокаОтладки.Сервис	= "DMSBackbone";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;	
	
КонецФункции

// Функция осуществляет удаление указанного сервиса
// Параметры:
//  СтруктураОшибок - структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//	ИмяСервиса		- имя удаляемого сервиса
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ВызватьМетодRemoveService(СтруктураОшибок, ИмяНовогоСервиса) Экспорт

	ИмяСервиса				= "DMSBackBone.RemoveService";
	АдресСкрипта			= ПолучитьАдресСкрипта();
	ИдентификаторЗапроса	= ПолучитьИдентификаторПоВремени();
	
	ПараметрыЗапроса	= Новый Структура();
	ПараметрыЗапроса.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	ПараметрыЗапроса.Вставить("ИмяСервиса", ИмяНовогоСервиса);
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "Remove service";
	СтрокаОтладки.Сервис	= "DMSBackbone";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;	
	
КонецФункции

// Функция осуществляет активацию сервисов
// Параметры:
//  СтруктураОшибок - структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ВызватьМетодActivateService(СтруктураОшибок)Экспорт

	ИмяСервиса		= "DMSBackBone.Activate";
	АдресСкрипта	= ПолучитьАдресСкрипта();
		
	ПараметрыЗапроса	= Новый Структура();
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "Activate";
	СтрокаОтладки.Сервис	= "DMSBackbone";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;	
	
КонецФункции	

// Функция запрашивает список сервисов dms
// Параметры:
//  СтруктураОшибок - структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ВызватьМетодListServices(СтруктураОшибок)Экспорт

	ИмяСервиса		= "DMSBackBone.ListServices";
	АдресСкрипта	= ПолучитьАдресСкрипта();
		
	ПараметрыЗапроса	= Новый Структура();
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "ListServices";
	СтрокаОтладки.Сервис	= "";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок,ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;	
	
КонецФункции

// Функция осуществляется подписку на события сервисов DMSBB
// Параметры:
//  СтруктураОшибок 	- структура для хранения информации об исключительной ситуации, произошедшей в результате запроса
//	Событие				- событие, на которое должно приходить уведомление
//	Сервис				- сервис, для которого отслеживаются изменения
//	Подписчик			- получатель измеенний сервиса
//	ОтписатьсяОтСобытия	- флаг отключения от приема уведомлений о событии сервиса
//
// Возвращаемое значение - ответ на запрос от сервера dms в виде дерева значений
//
Функция ПодписатьсяНаСобытие(СтруктураОшибок, Событие, Сервис, Подписчик, ОтписатьсяОтСобытия=Ложь) Экспорт
	
	ИмяСервиса				= "WorkshopOrder.Subscribtion";
	АдресСкрипта			= ПолучитьАдресСкрипта(ИмяСервиса);
	ИдентификаторЗапроса	= ПолучитьИдентификаторПоВремени();
	
	ПараметрыЗапроса	= Новый Структура();
	ПараметрыЗапроса.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	ПараметрыЗапроса.Вставить("Событие",	Событие);
	ПараметрыЗапроса.Вставить("Сервис",		Сервис);
	ПараметрыЗапроса.Вставить("Подписчик",	Подписчик);
	ПараметрыЗапроса.Вставить("ОтписатьсяОтСобытия", ОтписатьсяОтСобытия);
	СодержимоеЗапроса	= СформироватьЗапросДляСервера(ИмяСервиса, ПараметрыЗапроса);
	
	ОтветСервера	= ПередатьДанныеНаСервер(АдресСкрипта, СодержимоеЗапроса);
	СтрокаОтладки	= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "WorkshopOrder Subscription";
	СтрокаОтладки.Сервис	= "";
	СтрокаОтладки.Значение	= ОтветСервера;
	
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
	
	Возврат ДеревоЗапроса;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБРАБОТКИ ПОЛУЧЕНИЯ ДАННЫХ ОТ DMSBB

// Функция формирует строку для записи в xml из значения 
//	
Функция СформироватьСтрокуXML(Значение, Транслитерация=Ложь, Имя="") Экспорт
	
	Если ТипЗнч(Значение)=Тип("Число") Тогда
		СтрокаЗаписи	= СтрЗаменить(Строка(Значение), Символ(160), "");
		СтрокаЗаписи	= СтрЗаменить(СтрокаЗаписи, ",", ".");
		                            
	ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
		СтрокаЗаписи	= Формат(Значение, "ДФ=yyyy-MM-dd");
		
	ИначеЕсли ТипЗнч(Значение)=Тип("СправочникСсылка.Валюты") Тогда	
		Если Значение.Код="643" Тогда
			СтрокаЗаписи	= "RUR";
		ИначеЕсли Значение.Код="840" Тогда
			СтрокаЗаписи	= "USD";
		ИначеЕсли Значение.Код="978" Тогда
			СтрокаЗаписи	= "EUR";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение)=Тип("СправочникСсылка.СтавкиНДС") Тогда	
		Если Значение=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС Тогда
			СтрокаЗаписи	= "18";
		ИначеЕсли Значение=Справочники.СтавкиНДС.БезНДС Тогда
			СтрокаЗаписи	= "";
		ИначеЕсли Значение<>Неопределено И Значение<>Справочники.СтавкиНДС.ПустаяСсылка() Тогда
			СтрокаЗаписи	= Строка(Значение.Ставка);
		Иначе
			СтрокаЗаписи	= "";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение)=Тип("СправочникСсылка.Автоработы")
		ИЛИ ТипЗнч(Значение)=Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Значение)=Тип("СправочникСсылка.Цеха") 
		ИЛИ ТипЗнч(Значение)=Тип("СправочникСсылка.СкладыКомпании")
		ИЛИ ТипЗнч(Значение)=Тип("СправочникСсылка.Сотрудники") Тогда	
		                            
		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаЗаписи	= СокрЛП(Значение.Код);
		Иначе
			СтрокаЗаписи	= "";
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Значение)=Тип("СправочникСсылка.Номенклатура") Тогда
		
		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаЗаписи	= СокрЛП(Значение.Артикул);
		Иначе
			СтрокаЗаписи	= "";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение)=Тип("СправочникСсылка.Автомобили") Тогда
		
		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаЗаписи	= СокрЛП(Значение.VIN);
		Иначе
			СтрокаЗаписи	= "";
		КонецЕсли;
		
	ИначеЕсли  ТипЗнч(Значение)=Тип("СправочникСсылка.ТипыДвигателей") Тогда

		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаЗаписи	= СокрЛП(Значение.Наименование);
		Иначе
			СтрокаЗаписи	= "";
		КонецЕсли;
		
	ИначеЕсли  ТипЗнч(Значение)=Тип("СправочникСсылка.КлассификаторСтранМира") Тогда
		
		Если ЗначениеЗаполнено(Значение) Тогда
			СтрокаЗаписи	= СокрЛП(Значение.Наименование);
		Иначе
			СтрокаЗаписи	= "DEU";
		КонецЕсли;
		
	Иначе
		СтрокаЗаписи	= СокрЛП(Значение);
	КонецЕсли;
	
	Если Имя="ORDER_NO" И ИспользоватьТранслитерациюНомеров Тогда
		
		СтрокаЗаписи	= кмТранслитерация(СокрЛП(СтрокаЗаписи));
		СтрокаЗаписи	= ПривестиНомерДокумента(СтрокаЗаписи, 10);
		
	ИначеЕсли Транслитерация И ИспользоватьТранслитерациюНаименований Тогда
		
		СтрокаЗаписи	= кмТранслитерация(СокрЛП(СтрокаЗаписи));
		
	КонецЕсли;	
	
	Возврат СтрокаЗаписи;
	
КонецФункции

// Функция производит поиск свойства по имени,
// в случае невозможности поиска, создает новое свойство
Функция НайтиСоздатьСвойствоОбъекта(НазначениеСсылка, ИмяСвойства) Экспорт
	
	СвойствоСсылка 	 	= ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Назначение" , НазначениеСсылка);
	Запрос.УстановитьПараметр("ИмяСвойства", ИмяСвойства);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НазначенияСвойствОбъектовВидыСвойств.Свойство.Ссылка КАК СвойствоСсылка
		|ИЗ
		|	ПланВидовХарактеристик.НазначенияСвойствОбъектов.ВидыСвойств КАК НазначенияСвойствОбъектовВидыСвойств
		|ГДЕ
		|	НазначенияСвойствОбъектовВидыСвойств.Ссылка = &Назначение
		|	И НазначенияСвойствОбъектовВидыСвойств.Свойство.Наименование = &ИмяСвойства";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СвойствоСсылка = Выборка.СвойствоСсылка;	
	Иначе		
		ТекСвойство	= ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(ИмяСвойства);
		Если НЕ ЗначениеЗаполнено(ТекСвойство) Тогда
			НовоеСвойство				= ПланыВидовХарактеристик.СвойстваОбъектов.СоздатьЭлемент();
			НовоеСвойство.УстановитьНовыйКод();
			НовоеСвойство.Наименование	= ИмяСвойства;				
			Если ИмяСвойства="PRICE_GR" Тогда
				НовоеСвойство.ТипЗначения	= Новый ОписаниеТипов("Строка");
			Иначе	
				НовоеСвойство.ТипЗначения	= Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойств");
			КонецЕсли;
				
			Попытка 
				НовоеСвойство.Записать();
			Исключение
				//СообщитьПользователю("Не удалось записать свойство " + ИмяСвойства, Ложь,,1);
				Возврат Ложь;
			КонецПопытки;
			СвойствоСсылка = НовоеСвойство.Ссылка;
		Иначе
			СвойствоСсылка = ТекСвойство;
		КонецЕсли;
		
		НазначениеДляЗаказа			= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Документ_ЗаказНаряд.ПолучитьОбъект();
		Если НазначениеДляЗаказа.ВидыСвойств.Найти(СвойствоСсылка) = Неопределено Тогда
			НовоеНазначение				= НазначениеДляЗаказа.ВидыСвойств.Добавить();
			НовоеНазначение.Свойство	= СвойствоСсылка;
			Попытка
				НазначениеДляЗаказа.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СвойствоСсылка;
	
КонецФункции

// Функция возвращает значение свойства
//
Функция ПолучитьЗначениеСвойстваПоСтроке(СвойствоСсылка, ЗначениеСвойства)
	
	ТекЗначениеСвойства	= Неопределено;
	
	Если (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("Число"))) Тогда
		Попытка
			ТекЗначениеСвойства	= Число(Строка(ЗначениеСвойства));
		Исключение
			Возврат ТекЗначениеСвойства;
		КонецПопытки;
	ИначеЕсли (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("Дата"))) Тогда
		Попытка
			ТекЗначение	= СтрЗаменить(ЗначениеСвойства,"-",".");
			ТекЗначениеСвойства	= Дата(ТекЗначение);
		Исключение
			Возврат ТекЗначениеСвойства;
		КонецПопытки;			
	ИначеЕсли (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("Строка"))) Тогда
		Попытка
			ТекЗначениеСвойства	= Строка(ЗначениеСвойства);
		Исключение
			Возврат ТекЗначениеСвойства;
		КонецПопытки;
	ИначеЕсли (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.КлассификаторСтранМира"))) Тогда
		Если ТипЗнч(ЗначениеСвойства)=Тип("СправочникСсылка.КлассификаторСтранМира") Тогда
			Возврат ЗначениеСвойства;
		КонецЕсли;
		
		ЗапросЗначенияСвойства	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
												 |	Страны.Ссылка КАК Ссылка
												 |ИЗ
												 |	Справочник.КлассификаторСтранМира КАК Страны
												 |ГДЕ
												 |	Страны.Наименование = &Наименование
												 |	И (НЕ Страны.ПометкаУдаления)");
		ЗапросЗначенияСвойства.УстановитьПараметр("Наименование", Строка(ЗначениеСвойства));
		РезультатЗапросаЗначенияСвойства	= ЗапросЗначенияСвойства.Выполнить();
		Если (РезультатЗапросаЗначенияСвойства.Пустой()) Тогда
			НовоеЗначениеСвойства				= Справочники.КлассификаторСтранМира.СоздатьЭлемент();
			НовоеЗначениеСвойства.УстановитьНовыйКод();
			НовоеЗначениеСвойства.Наименование			= ЗначениеСвойства;
			НовоеЗначениеСвойства.НаименованиеПолное	= ЗначениеСвойства;
			Попытка
				НовоеЗначениеСвойства.Записать();
			Исключение
				Возврат ТекЗначениеСвойства;
			КонецПопытки;
			ТекЗначениеСвойства	= НовоеЗначениеСвойства;
		Иначе
			ВыборкаЗначенияСвойства	= РезультатЗапросаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Следующий();
			ТекЗначениеСвойства		= ВыборкаЗначенияСвойства.Ссылка;
		КонецЕсли;
		
	ИначеЕсли (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Сотрудники"))) Тогда	
		Если ТипЗнч(ЗначениеСвойства)=Тип("СправочникСсылка.Сотрудники") Тогда
			Возврат ЗначениеСвойства;
		КонецЕсли;
		
		ЗапросЗначенияСвойства	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
												 |	Сотрудники.Ссылка КАК Ссылка
												 |ИЗ
												 |	Справочник.Сотрудники КАК Сотрудники
												 |ГДЕ
												 |	Сотрудники.Код = &Код
												 |	И (НЕ Сотрудники.ПометкаУдаления)");
		ЗапросЗначенияСвойства.УстановитьПараметр("Код", СокрЛП(ЗначениеСвойства));
		РезультатЗапросаЗначенияСвойства	= ЗапросЗначенияСвойства.Выполнить();
		Если (РезультатЗапросаЗначенияСвойства.Пустой()) Тогда
			НовоеЗначениеСвойства				= Справочники.Сотрудники.СоздатьЭлемент();
			НовоеЗначениеСвойства.Код			= ЗначениеСвойства;
			НовоеЗначениеСвойства.Наименование	= "Сотрудник из DMSBB №"+ЗначениеСвойства;
			НовоеЗначениеСвойства.ОбменДанными.Загрузка	= Истина;
			Попытка
				НовоеЗначениеСвойства.Записать();
			Исключение
				Возврат ТекЗначениеСвойства;
			КонецПопытки;
			ТекЗначениеСвойства	= НовоеЗначениеСвойства;
		Иначе
			ВыборкаЗначенияСвойства	= РезультатЗапросаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Следующий();
			ТекЗначениеСвойства		= ВыборкаЗначенияСвойства.Ссылка;
		КонецЕсли;
		
	ИначеЕсли (СвойствоСсылка.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойств"))) Тогда
		ЗапросЗначенияСвойства	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
												 |	ЗначенияСвойств.Ссылка
												 |ИЗ
												 |	Справочник.ЗначенияСвойств КАК ЗначенияСвойств
												 |ГДЕ
												 |	ЗначенияСвойств.Наименование = &Наименование
												 |	И (НЕ ЗначенияСвойств.ПометкаУдаления)");
		ЗапросЗначенияСвойства.УстановитьПараметр("Наименование", Строка(ЗначениеСвойства));
		РезультатЗапросаЗначенияСвойства	= ЗапросЗначенияСвойства.Выполнить();
		Если (РезультатЗапросаЗначенияСвойства.Пустой()) Тогда
			НовоеЗначениеСвойства				= Справочники.ЗначенияСвойств.СоздатьЭлемент();
			НовоеЗначениеСвойства.УстановитьНовыйКод();
			НовоеЗначениеСвойства.Наименование	= ЗначениеСвойства;
			НовоеЗначениеСвойства.Владелец		= СвойствоСсылка;
			Попытка
				НовоеЗначениеСвойства.Записать();
			Исключение
				Возврат ТекЗначениеСвойства;
			КонецПопытки;
			ТекЗначениеСвойства	= НовоеЗначениеСвойства;
		Иначе
			ВыборкаЗначенияСвойства	= РезультатЗапросаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Выбрать();
			ВыборкаЗначенияСвойства.Следующий();
			ТекЗначениеСвойства		= ВыборкаЗначенияСвойства.Ссылка;
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ТекЗначениеСвойства;
	
КонецФункции

// Функция устанавливает значение свойства объекта
//
Функция УстановитьСвойство(ОбъектСсылка, СвойствоСсылка, ЗначениеСвойства) Экспорт
	
	Успешно = Истина;
		
	//Преобразование типа значения свойства
	ТекЗначениеСвойства				= ЗначениеСвойства;
	
	Если НЕ СвойствоСсылка.ТипЗначения.СодержитТип(ТипЗнч(ТекЗначениеСвойства)) Тогда
		ТекЗначениеСвойства	= ПолучитьЗначениеСвойстваПоСтроке(СвойствоСсылка, ЗначениеСвойства);		
	КонецЕсли;
	
	Запись = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	Запись.Объект	= ОбъектСсылка;
	Запись.Свойство = СвойствоСсылка;
	Запись.Значение = ТекЗначениеСвойства;
	
	Попытка
		Запись.Записать();
	Исключение
		#Если Клиент Тогда
		Сообщить(ОписаниеОшибки());
		#КонецЕсли
		Успешно = Ложь;	
	КонецПопытки;
				
	Возврат Успешно;
	
КонецФункции

// Функция возвращает значение указанного свойства
//
Функция ПолучитьЗначениеСвойства(Объект, Свойство) Экспорт
	
	Результат	= Неопределено;
	
	МенеджерЗаписиРегистра			= РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписиРегистра.Объект	= Объект;
	МенеджерЗаписиРегистра.Свойство	= Свойство;
	МенеджерЗаписиРегистра.Прочитать();
	Если МенеджерЗаписиРегистра.Выбран() Тогда
		Результат	= МенеджерЗаписиРегистра.Значение;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция формирует таблицу объектов
// Параметры:
//	ПараметрыЗапроса- структура параметров запроса
//	ИмяЗапроса		- имя запроса
//	ТипЗапроса		- тип запроса
//
// Возвращаемое значение - таблица значений со списком объектов
//
Функция ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса)
	
	тзОбъектов				= Новый ТаблицаЗначений();
	ЗапросОбъектов			= Новый Запрос();	
	ТекущееИмяЗапроса		= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса		= ВРег(ТипЗапроса);
	УсловиеЗапроса	= "";
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		ТипОбъекта		= "Документ.ЗаказНаряд";
		УсловиеЗапроса	= "ГДЕ
							|	(НЕ ТаблицаОбъектов.Состояние=ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен))
							|	И (НЕ ТаблицаОбъектов.Состояние=ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))
							|	И (НЕ ТаблицаОбъектов.ПометкаУдаления)";
		Показатели		= "ТаблицаОбъектов.Ссылка КАК Заказ,
			                   	  |	ТаблицаОбъектов.Номер КАК Номер,
			                   	  |	ТаблицаОбъектов.Дата КАК Дата";
								  
	ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда
		ТипОбъекта	= "Справочник.Контрагенты";
		Показатели		= "ТаблицаОбъектов.Ссылка КАК Контрагент,
			                   	  |	ТаблицаОбъектов.Код КАК Код";								  
								  
	ИначеЕсли ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
		ТипОбъекта	= "Справочник.Автомобили";
		Показатели		= "ТаблицаОбъектов.Ссылка КАК Автомобиль,
			                   	  |	ТаблицаОбъектов.VIN КАК VIN";
								  
	ИначеЕсли ТекущийТипЗапроса="SPAREPARTORDER" Тогда
		ТипОбъекта		= "Документ.ЗаказПокупателя";
		Показатели		= "ТаблицаОбъектов.Ссылка КАК Заказ,
			                   	  |	ТаблицаОбъектов.Номер КАК Номер,
			                   	  |	ТаблицаОбъектов.Дата КАК Дата";
		УсловиеЗапроса	= "ГДЕ
							|	(НЕ ТаблицаОбъектов.Проведен)";
	Иначе
		Возврат тзОбъектов;	
	КонецЕсли;
	
	ЗапросОбъектов.Текст	= "ВЫБРАТЬ
							 |	"+Показатели+"
							 |
							 |ИЗ
							 |	"+ТипОбъекта+" КАК ТаблицаОбъектов
							 |"+?(ПустаяСтрока(УсловиеЗапроса), "",УсловиеЗапроса)+"
							 |
							 |СГРУППИРОВАТЬ ПО
							 |	ТаблицаОбъектов.Ссылка";
						  
	тзОбъектов	= ЗапросОбъектов.Выполнить().Выгрузить();
	тзОбъектов.Колонки.Добавить("Страна");
	тзОбъектов.Колонки.Добавить("Регион");
	тзОбъектов.Колонки.Добавить("Дилер");
	тзОбъектов.ЗаполнитьЗначения(СтранаDMS, "Страна");
	тзОбъектов.ЗаполнитьЗначения(РегионDMS, "Регион");
	тзОбъектов.ЗаполнитьЗначения(ДилерDMS, "Дилер");
								  		
	
	Возврат тзОбъектов;
	
КонецФункции

// Функция возвращает краткую структуру запчасти с указанным номером
// Параметры:
//	Параметры	- структура параметров для получения информации о запчасти
//
// Возвращаемое значение - структура заказа
//
Функция ПолучитьСтруктуруЗапчасти(Параметры) Экспорт
		
	МассивСтруктур				= Новый Массив();
	ЗапросЗапчасти				= Новый Запрос();
	ПустаяСтруктура				= Новый Структура();
	Запчасть					= Неопределено;
	ТекущийТипЦен				= Неопределено;
	СтрокаЗапчасть				= Неопределено;
	СсылкаНаЗаказ				= Неопределено;
	СсылкаНаЗапчасть			= Неопределено;
	СсылкаНаСкладКомпании		= Неопределено;
	ЭтоСчетНаОплату				= Неопределено;
	СоздаватьНовуюНоменклатуру	= Неопределено;
	
	ПустаяСтруктура.Вставить("СтранаЗаказа",	Неопределено);	
	ПустаяСтруктура.Вставить("РегионЗаказа",	Неопределено);
	ПустаяСтруктура.Вставить("ДилерЗаказа",		Неопределено);																
	ПустаяСтруктура.Вставить("Номенклатура",	Неопределено);	
	
	Параметры.Свойство("Запчасть",					Запчасть);
	Параметры.Свойство("ТипЦен",					ТекущийТипЦен);
	Параметры.Свойство("СтрокаЗапчасть",			СтрокаЗапчасть);
	Параметры.Свойство("СсылкаНаЗаказ",				СсылкаНаЗаказ);
	Параметры.Свойство("СкладКомпании",				СсылкаНаСкладКомпании);
	Параметры.Свойство("ЭтоСчетНаОплату",			ЭтоСчетНаОплату);
	Параметры.Свойство("СоздаватьНовуюНоменклатуру", СоздаватьНовуюНоменклатуру);
	
	Если ЭтоСчетНаОплату=Неопределено Тогда
		ЭтоСчетНаОплату	= Ложь;
	КонецЕсли;
	
	Если СтрокаЗапчасть<>Неопределено И ЗначениеЗаполнено(СтрокаЗапчасть.Номенклатура) Тогда
		
		СсылкаНаЗапчасть		= СтрокаЗапчасть.Номенклатура;
		ЗапросЗапчасти.УстановитьПараметр("Номенклатура",	СсылкаНаЗапчасть);
		
		Если НЕ ЭтоСчетНаОплату Тогда
			Если СсылкаНаСкладКомпании=Неопределено Тогда
				Если СсылкаНаЗаказ<>Неопределено Тогда
					СсылкаНаСкладКомпании	= СсылкаНаЗаказ.СкладКомпании;	
				Иначе
					СсылкаНаСкладКомпании	= СтрокаЗапчасть.СкладКомпании;	
				КонецЕсли;
			КонецЕсли;
			ЗапросЗапчасти.УстановитьПараметр("СкладКомпании",	СсылкаНаСкладКомпании);
		КонецЕсли;
			
	ИначеЕсли Запчасть<>Неопределено Тогда
		
		ПараметрыПреобразования	= Новый Структура();
		ПараметрыПреобразования.Вставить("СоздаватьНовыйОбъект", 	СоздаватьНовуюНоменклатуру);
		ПривестиКТипу(Запчасть, "СправочникСсылка.Номенклатура", ПараметрыПреобразования);		
		
		ЗапросЗапчасти.УстановитьПараметр("Артикул",				Запчасть);
		
  	Иначе
		МассивСтруктур.Добавить(ПустаяСтруктура);
		Возврат МассивСтруктур;	
	КонецЕсли;
		
	ЗапросЗапчасти.Текст	= "ВЫБРАТЬ
								  |	Номенклатура.Ссылка КАК Номенклатура
								  |ПОМЕСТИТЬ ТаблицаЗапчастей
								  |ИЗ
								  |	Справочник.Номенклатура КАК Номенклатура
								  |ГДЕ
								  |	Номенклатура."+?(СсылкаНаЗапчасть=Неопределено,"Артикул = &Артикул","Ссылка = &Номенклатура")+"
								  |
								  |СГРУППИРОВАТЬ ПО
								  |	Номенклатура.Ссылка
								  |;
		                    	  |
		                    	  |////////////////////////////////////////////////////////////////////////////////
		                    	  |ВЫБРАТЬ                                   
		                    	  |	ТаблицаЗапчастей.Номенклатура КАК Номенклатура,
								  |	ТаблицаЗапчастей.Номенклатура.Наименование КАК Наименование,
								  |	ВЫРАЗИТЬ(ТаблицаЗапчастей.Номенклатура.НаименованиеПолное КАК СТРОКА(500)) КАК НаименованиеПолное,
		                    	  |	ЕстьNULL(ОстаткиТоваровКомпанииОстатки.СкладКомпании, "+?(СсылкаНаСкладКомпании=Неопределено,"ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)"," &СкладКомпании")+") КАК СкладКомпании,
								  |	ТаблицаЗапчастей.Номенклатура.ВалютаУчета КАК СсылкаНаВалюту,
		                    	  |	СУММА(ЕстьNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0)) КАК Количество,
		                    	  |	СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) - СУММА(ОстаткиТоваровКомпанииОстатки.РезервОстаток) КАК Остаток
								  
		                    	  |ИЗ
		                    	  |	ТаблицаЗапчастей КАК ТаблицаЗапчастей
		                    	  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, "+?(СсылкаНаСкладКомпании=Неопределено,"","СкладКомпании = &СкладКомпании")+") КАК ОстаткиТоваровКомпанииОстатки
		                    	  |		ПО ТаблицаЗапчастей.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		                    	  |
		                    	  |СГРУППИРОВАТЬ ПО
								  |	ТаблицаЗапчастей.Номенклатура,
								  |	ТаблицаЗапчастей.Номенклатура.ВалютаУчета,
								  |	ЕстьNULL(ОстаткиТоваровКомпанииОстатки.СкладКомпании, "+?(СсылкаНаСкладКомпании=Неопределено,"ЗНАЧЕНИЕ(Справочник.СкладыКомпании.ПустаяСсылка)"," &СкладКомпании")+"),
		                    	  |	ТаблицаЗапчастей.Номенклатура,
		                    	  |	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Розничный";
		
	ВыборкаЗапчасти	= ЗапросЗапчасти.Выполнить().Выбрать();
	Пока ВыборкаЗапчасти.Следующий() Цикл
		
        СтруктураЗапчасти	= Новый Структура();
		СтруктураЗапчасти.Вставить("Номенклатура",			ВыборкаЗапчасти.Номенклатура);
		СтруктураЗапчасти.Вставить("Наименование",			ВыборкаЗапчасти.Наименование);
		СтруктураЗапчасти.Вставить("НаименованиеПолное",	ВыборкаЗапчасти.НаименованиеПолное);
		СтруктураЗапчасти.Вставить("СтранаЗапчасти",		СтранаDMS);
		СтруктураЗапчасти.Вставить("РегионЗапчасти",		РегионDMS);
		СтруктураЗапчасти.Вставить("ДилерЗапчасти",			ДилерDMS);
		СтруктураЗапчасти.Вставить("Валюта",				ВыборкаЗапчасти.СсылкаНаВалюту);
		СтруктураЗапчасти.Вставить("ТипЗапаса",				"ACTUAL");
		
		Если СсылкаНаЗапчасть=Неопределено Тогда
			
			Если ТекущийТипЦен=Неопределено Тогда
				ТекущийТипЦен	= обПраво("ТипЦенDMS", Права);
			КонецЕсли;
			
			СтавкаНДС				= ВыборкаЗапчасти.Номенклатура.СтавкаНДС;							
			ТипНалога				= ?(СтавкаНДС=Справочники.СтавкиНДС.БезНДС,"NET","GROSS");
			Цена					= обПолучитьЦену(ТекущийТипЦен, ВыборкаЗапчасти.Номенклатура,,,ВыборкаЗапчасти.СсылкаНаВалюту,,,,ПараметрыСеанса.ПодразделениеКомпании);
			
			СтруктураЗапчасти.Вставить("СкладКомпании",	ВыборкаЗапчасти.СкладКомпании);			
			СтруктураЗапчасти.Вставить("СтавкаНДС",		СтавкаНДС);
			СтруктураЗапчасти.Вставить("ТипНалога",		ТипНалога);			
			СтруктураЗапчасти.Вставить("ОстатокНаСкладе",ВыборкаЗапчасти.Количество);
			СтруктураЗапчасти.Вставить("Цена",			Цена);			
			
			МассивСтруктур.Добавить(СтруктураЗапчасти);
			
			Если ЭтоСчетНаОплату Тогда
				Прервать;
			КонецЕсли;			
		Иначе			
			СтавкаНДС				= СтрокаЗапчасть.СтавкаНДС;							
			ТипНалога				= ?(СтавкаНДС=Справочники.СтавкиНДС.БезНДС,"NET","GROSS");
			Цена					= СтрокаЗапчасть.Цена;
		
			СтруктураЗапчасти.Вставить("СкладКомпании",	СсылкаНаСкладКомпании);			
			СтруктураЗапчасти.Вставить("СтавкаНДС",		СтавкаНДС);
			СтруктураЗапчасти.Вставить("ТипНалога",		ТипНалога);			
			СтруктураЗапчасти.Вставить("ОстатокНаСкладе",СтрокаЗапчасть.Количество);
			СтруктураЗапчасти.Вставить("Цена",			Цена);
			
			МассивСтруктур.Добавить(СтруктураЗапчасти);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСтруктур;	
	
КонецФункции

// Функция возвращает краткую структуру заказа с указанным номером
// Параметры:
//	Параметры	- структура параметров для получения информации о заказе
//	Кратко		- флаг вывода краткой структуры заказа
//
// Возвращаемое значение - структура заказа
//
Функция ПолучитьСтруктуруЗаказа(Параметры, Кратко=Истина) Экспорт
	
	СтруктураЗаказа		= Новый Структура();
	НомерЗаказа			= Неопределено;
	ТипЗапроса			= Неопределено;
	СсылкаНаЗаказ		= Неопределено;
	Параметры.Свойство("Номер", 		НомерЗаказа);
	Параметры.Свойство("СсылкаНаЗаказ", СсылкаНаЗаказ);
	Параметры.Свойство("ТипЗапроса",	ТипЗапроса);
	
	Если ВРег(ТипЗапроса)="SPAREPARTORDER" Тогда
		ЭтоЗаказПокупателя	= Истина;
	Иначе
		ЭтоЗаказПокупателя	= Ложь;		
	КонецЕсли;
	                                           
	Если СсылкаНаЗаказ=Неопределено Тогда		
		ЗапросЗаказа		= Новый Запрос();
		Если ЭтоЗаказПокупателя Тогда
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
			                  	  |	ЗаказПокупателя.Ссылка КАК Ссылка
			                  	  |
			                  	  |ИЗ
			                  	  |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			                  	  |ГДЕ
			                  	  |	ЗаказПокупателя.Номер = &Номер";			
		Иначе
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
			                  	  |	ЗаказНаряд.Ссылка КАК Ссылка
			                  	  |ИЗ
			                  	  |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                  	  |ГДЕ
			                  	  |	ЗаказНаряд.Номер = &Номер
			                  	  |	И (НЕ ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))";
		КонецЕсли;
						  
		ЗапросЗаказа.УстановитьПараметр("Номер", СокрЛП(НомерЗаказа));
		ВыборкаЗаказа	= ЗапросЗаказа.Выполнить().Выбрать();
		
		Если ВыборкаЗаказа.Следующий() Тогда
			СсылкаНаЗаказ	= ВыборкаЗаказа.Ссылка;
		КонецЕсли;
	КонецЕсли;
		
	Если СсылкаНаЗаказ<>Неопределено Тогда
		
		СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	СсылкаНаЗаказ);
		СтруктураЗаказа.Вставить("НомерЗаказа",		СсылкаНаЗаказ.Номер);
		СтруктураЗаказа.Вставить("ДатаЗаказа",		СсылкаНаЗаказ.Дата);
		СтруктураЗаказа.Вставить("ВалютаЗаказа",	СсылкаНаЗаказ.ВалютаДокумента);
		СтруктураЗаказа.Вставить("Заказчик",		СсылкаНаЗаказ.Контрагент);
		
		СтранаЗаказа	= СтранаDMS;
		РегионЗаказа	= РегионDMS;
		ДилерЗаказа		= ДилерDMS;		
	
		Если ЭтоЗаказПокупателя Тогда
			ТипЗаказа		= ПолучитьЗначениеСвойства(СсылкаНаЗаказ, СвойствоТипЗаказаЗапчастей);
			НомерГарантийнойЗаявки	= ПолучитьЗначениеСвойства(СсылкаНаЗаказ, СвойствоНомерГарантийнойЗаявкиЗапчастей);
			ДействиеЗаказа	= "Normal";
			
			Если СсылкаНаЗаказ.Проведен Тогда
				СтатусЗаказа	= "Closed";
			ИначеЕсли СсылкаНаЗаказ.ПометкаУдаления Тогда
				СтатусЗаказа	= "Deleted";
			Иначе
				СтатусЗаказа	= "Updated";
			КонецЕсли;			
			
		Иначе
			ТипЗаказа		= ПолучитьЗначениеСвойства(СсылкаНаЗаказ, СвойствоТипЗаказа);
			НомерГарантийнойЗаявки	= ПолучитьЗначениеСвойства(СсылкаНаЗаказ, СвойствоНомерГарантийнойЗаявки);
			
			СостояниеЗаказа	= СсылкаНаЗаказ.Состояние;
			Если СостояниеЗаказа=Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
				ДействиеЗаказа	= "Offer";			
			Иначе
				ДействиеЗаказа	= "Normal";	
			КонецЕсли;
			
			Если СсылкаНаЗаказ.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен
				ИЛИ СсылкаНаЗаказ.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
				СтатусЗаказа	= "Closed";
			ИначеЕсли СсылкаНаЗаказ.ПометкаУдаления Тогда
				СтатусЗаказа	= "Deleted";
			Иначе
				СтатусЗаказа	= "Updated";
			КонецЕсли;
			
		КонецЕсли;
		
		Если обЗначениеНеЗаполнено(ТипЗаказа) Тогда
			ТипЗаказа	= "Normal";
		КонецЕсли;
		
		СтруктураЗаказа.Вставить("СтранаЗаказа",СтранаЗаказа);				
		СтруктураЗаказа.Вставить("РегионЗаказа",РегионЗаказа);				
		СтруктураЗаказа.Вставить("ДилерЗаказа",	ДилерЗаказа);					
		СтруктураЗаказа.Вставить("ТипЗаказа",	ТипЗаказа);
		СтруктураЗаказа.Вставить("СтатусЗаказа",СтатусЗаказа);
		СтруктураЗаказа.Вставить("НомерГарантийнойЗаявки", НомерГарантийнойЗаявки);

		Если ДействиеЗаказа<>Неопределено Тогда
			СтруктураЗаказа.Вставить("ДействиеЗаказа",	ДействиеЗаказа);
		КонецЕсли;
		
		ЗаявкаНаРемонт	= Неопределено;			
		
		Если ЗначениеЗаполнено(СсылкаНаЗаказ.Менеджер) Тогда
			СтруктураЗаказа.Вставить("Менеджер",	СсылкаНаЗаказ.Менеджер.Наименование);
		Иначе
			СтруктураЗаказа.Вставить("Менеджер",	Неопределено);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаНаЗаказ) Тогда
			
			//КоэффициентОплаты
			ТекСуммаСкидкиНаценки			= СсылкаНаЗаказ.СуммаСкидкиНаценки;
			ТекСуммаНоменклатурыДокумента	= СсылкаНаЗаказ.Товары.Итог("СуммаВсего");
			ТекСуммаДокумента				= СсылкаНаЗаказ.СуммаДокумента;
			
			Если (ТекСуммаДокумента+ТекСуммаСкидкиНаценки)=0 ИЛИ ТекСуммаСкидкиНаценки=0 Тогда
				КоэффициентОплаты	= 1;	
			Иначе
				КоэффициентОплаты	= Окр((ТекСуммаСкидкиНаценки/(ТекСуммаДокумента+ТекСуммаСкидкиНаценки)),2);					
			КонецЕсли;
			
			СтруктураЗаказа.Вставить("КоэффициентОплаты",	?(КоэффициентОплаты=0,1,КоэффициентОплаты));
			
			//КоэффициентЗапчастей
			Если ТекСуммаДокумента=0 Тогда
				КоэффициентЗапчастей	= 1;					
			Иначе 
				КоэффициентЗапчастей	= Окр(ТекСуммаНоменклатурыДокумента/ТекСуммаДокумента,2);	
			КонецЕсли;
			СтруктураЗаказа.Вставить("КоэффициентЗапчастей",	?(КоэффициентЗапчастей=0,1,КоэффициентЗапчастей));		
		КонецЕсли;
		
		// Заполнить атрибуты
		Если ЗначениеЗаполнено(СсылкаНаЗаказ.Контрагент) Тогда
			СтруктураЗаказа.Вставить("Контрагент",	СсылкаНаЗаказ.Контрагент);
		Иначе
			СтруктураЗаказа.Вставить("Контрагент",	"0");
		КонецЕсли;
		
		// Заполнить атрибуты
		Если ЗначениеЗаполнено(СсылкаНаЗаказ.Автомобиль) Тогда
			СтруктураЗаказа.Вставить("Автомобиль",	СсылкаНаЗаказ.Автомобиль.VIN);
		Иначе
			СтруктураЗаказа.Вставить("Автомобиль",	"0");
		КонецЕсли;
	
	КонецЕсли;
				
		
	Возврат СтруктураЗаказа;
	
КонецФункции

// Функция возвращает структуру контрагента по указанному полю поиска
// Параметры:
//	Параметры	- структура параметров для получения информации о заказе
//
// Возвращаемое значение - структура заказа
//
Функция ПолучитьСтруктуруКонтрагента(Параметры) Экспорт
	
	МассивСтруктур		= Новый Массив();	
	ИмяПоляПоиска		= Неопределено;
	ЗначениеПоляПоиска	= Неопределено;
	КонтрагентПоиска	= Неопределено;
	ВыборкаКонтрагента	= Неопределено;
	ЗапросКонтрагента	= Новый Запрос();
	ПоискПоШаблону		= Ложь;
	
	Параметры.Свойство("ИмяПоляПоиска", 		ИмяПоляПоиска);
	Параметры.Свойство("ЗначениеПоляПоиска",	ЗначениеПоляПоиска);
	Параметры.Свойство("СсылкаНаКонтрагента",	КонтрагентПоиска);
	
	Если ИмяПоляПоиска="ACCOUNT_NO" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	Контрагенты.Ссылка КАК Ссылка,
		                       	  |	Контрагенты.Код КАК Код,
		                       	  |	Контрагенты.Наименование КАК Наименование,
		                       	  |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	Контрагенты.Комментарий КАК Комментарий,
		                       	  |	Контрагенты.ДатаРождения КАК ДатаРождения,
		                       	  |	Контрагенты.Дата КАК ДатаПоследнегоИзменения
		                       	  |ИЗ
		                       	  |	Справочник.Контрагенты КАК Контрагенты
		                       	  |ГДЕ
		                       	  |	Контрагенты.Код "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
							  
		ЗапросКонтрагента.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
		
	ИначеЕсли ИмяПоляПоиска="NAME" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	Контрагенты.Ссылка КАК Ссылка,
		                       	  |	Контрагенты.Код КАК Код,
		                       	  |	Контрагенты.Наименование КАК Наименование,
		                       	  |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	Контрагенты.Комментарий КАК Комментарий,
		                       	  |	Контрагенты.ДатаРождения КАК ДатаРождения,
		                       	  |	Контрагенты.Дата КАК ДатаПоследнегоИзменения
		                       	  |ИЗ
		                       	  |	Справочник.Контрагенты КАК Контрагенты
		                       	  |ГДЕ
		                       	  |	Контрагенты.Наименование "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
							  
		ЗапросКонтрагента.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
		
	ИначеЕсли ИмяПоляПоиска="ADDRESS" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	КонтактнаяИнформация.Объект.Ссылка КАК Ссылка,
								  |	КонтактнаяИнформация.Объект.Код КАК Код,
		                       	  |	КонтактнаяИнформация.Объект.Наименование КАК Наименование,
		                       	  |	КонтактнаяИнформация.Объект.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	КонтактнаяИнформация.Объект.Комментарий КАК Комментарий,
		                       	  |	КонтактнаяИнформация.Объект.ДатаРождения КАК ДатаРождения,
		                       	  |	КонтактнаяИнформация.Объект.Дата КАК ДатаПоследнегоИзменения
								  |
		                       	  |ИЗ
		                       	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                       	  |ГДЕ
		                       	  |	КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
								  |	И КонтактнаяИнформация.Тип = &ТипКИ
		                       	  |	И КонтактнаяИнформация.Вид = &ВидКИ
		                       	  |	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(250))) "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
								  
		ЗапросКонтрагента.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЗапросКонтрагента.УстановитьПараметр("ВидКИ", Справочники.ВидыКонтактнойИнформации.АдресФактический);
		ЗапросКонтрагента.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
		
	ИначеЕсли ИмяПоляПоиска="ZIP" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	КонтактнаяИнформация.Объект.Ссылка КАК Ссылка,
								  |	КонтактнаяИнформация.Объект.Код КАК Код,
		                       	  |	КонтактнаяИнформация.Объект.Наименование КАК Наименование,
		                       	  |	КонтактнаяИнформация.Объект.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	КонтактнаяИнформация.Объект.Комментарий КАК Комментарий,
		                       	  |	КонтактнаяИнформация.Объект.ДатаРождения КАК ДатаРождения,
		                       	  |	КонтактнаяИнформация.Объект.Дата КАК ДатаПоследнегоИзменения
								  |
		                       	  |ИЗ
		                       	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                       	  |ГДЕ
		                       	  |	КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
								  |	И КонтактнаяИнформация.Тип = &ТипКИ
		                       	  |	И КонтактнаяИнформация.Вид = &ВидКИ
		                       	  |	И (ВЫРАЗИТЬ(КонтактнаяИнформация.Представление КАК СТРОКА(250))) "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
								  
		ЗапросКонтрагента.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЗапросКонтрагента.УстановитьПараметр("ВидКИ", Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
		ЗапросКонтрагента.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
		
	ИначеЕсли ИмяПоляПоиска="CITY" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	КонтактнаяИнформация.Объект.Ссылка КАК Ссылка,
								  |	КонтактнаяИнформация.Объект.Код КАК Код,
		                       	  |	КонтактнаяИнформация.Объект.Наименование КАК Наименование,
		                       	  |	КонтактнаяИнформация.Объект.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	КонтактнаяИнформация.Объект.Комментарий КАК Комментарий,
		                       	  |	КонтактнаяИнформация.Объект.ДатаРождения КАК ДатаРождения,
		                       	  |	КонтактнаяИнформация.Объект.Дата КАК ДатаПоследнегоИзменения
								  |
		                       	  |ИЗ
		                       	  |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		                       	  |ГДЕ
		                       	  |	КонтактнаяИнформация.Объект ССЫЛКА Справочник.Контрагенты
								  |	И КонтактнаяИнформация.Тип = &ТипКИ
		                       	  |	И КонтактнаяИнформация.Вид = &ВидКИ
		                       	  |	И КонтактнаяИнформация.Поле4 "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
								  
		ЗапросКонтрагента.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);
		ЗапросКонтрагента.УстановитьПараметр("ВидКИ", Справочники.ВидыКонтактнойИнформации.АдресФактический);
		ЗапросКонтрагента.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
		
	ИначеЕсли КонтрагентПоиска<>Неопределено Тогда
				ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
		                       	  |	Контрагенты.Ссылка КАК Ссылка,
		                       	  |	Контрагенты.Код КАК Код,
		                       	  |	Контрагенты.Наименование КАК Наименование,
		                       	  |	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		                       	  |	Контрагенты.Комментарий КАК Комментарий,
		                       	  |	Контрагенты.ДатаРождения КАК ДатаРождения,
		                       	  |	Контрагенты.Дата КАК ДатаПоследнегоИзменения
		                       	  |ИЗ
		                       	  |	Справочник.Контрагенты КАК Контрагенты
		                       	  |ГДЕ
		                       	  |	Контрагенты.Ссылка = &КонтрагентПоиска";
							  
		ЗапросКонтрагента.УстановитьПараметр("КонтрагентПоиска", КонтрагентПоиска);
		ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
	КонецЕсли;
	
	Если ВыборкаКонтрагента<>Неопределено Тогда
		
		Пока ВыборкаКонтрагента.Следующий() Цикл
			
			СтруктураКонтрагента= Новый Структура();
			СсылкаНаКонтрагента	= ВыборкаКонтрагента.Ссылка;
			
			СтруктураКонтрагента.Вставить("КонтрагентСсылка",	СсылкаНаКонтрагента);
			
			СтруктураКонтрагента.Вставить("НомерКонтрагента",	СокрЛП(СсылкаНаКонтрагента.Код));
			СтруктураКонтрагента.Вставить("СтранаКонтрагента",	СтранаDMS);
			СтруктураКонтрагента.Вставить("РегионКонтрагента",	РегионDMS);
			СтруктураКонтрагента.Вставить("ДилерКонтрагента",	ДилерDMS);
			СтруктураКонтрагента.Вставить("Код",				ВыборкаКонтрагента.Код);
			СтруктураКонтрагента.Вставить("Наименование",		ВыборкаКонтрагента.Наименование);
			СтруктураКонтрагента.Вставить("НаименованиеПолное",	ВыборкаКонтрагента.НаименованиеПолное);
			СтруктураКонтрагента.Вставить("ДатаРождения",		ВыборкаКонтрагента.ДатаРождения);		
			
			Если СсылкаНаКонтрагента.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Поставщик Тогда
				СтруктураКонтрагента.Вставить("ВидКонтрагента",		"SUPPLIER");
			Иначе
				СтруктураКонтрагента.Вставить("ВидКонтрагента",		"CUSTOMER");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВыборкаКонтрагента.Комментарий) тогда
				СтруктураКонтрагента.Вставить("Комментарий",	ВыборкаКонтрагента.Комментарий);
			Иначе
				СтруктураКонтрагента.Вставить("Комментарий",	"Комментарий");
			КонецЕсли;
			СтруктураКонтрагента.Вставить("ДатаПоследнегоИзменения",	ВыборкаКонтрагента.ДатаПоследнегоИзменения);
			
			
			Если СсылкаНаКонтрагента.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
				СтруктураКонтрагента.Вставить("Обращение",	"Уважаемое");
				СтруктураКонтрагента.Вставить("Пол",		"CO");
				
			ИначеЕсли СсылкаНаКонтрагента.Пол=Перечисления.ПолФизическихЛиц.Женский Тогда
				СтруктураКонтрагента.Вставить("Обращение",	"Госпожа");
				СтруктураКонтрагента.Вставить("Пол",		"FEMALE");
			Иначе
				СтруктураКонтрагента.Вставить("Обращение",	"Господин");
				СтруктураКонтрагента.Вставить("Пол",		"MALE");		
			КонецЕсли;		
			
			ЗапросПоВалюте	= Новый Запрос();
			ЗапросПоВалюте.УстановитьПараметр("Контрагент", СсылкаНаКонтрагента);
			ЗапросПоВалюте.Текст	= "ВЫБРАТЬ
			                    	  |	ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов КАК ВалютаКонтрагента,
			                    	  |	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
			                    	  |ИЗ
			                    	  |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			                    	  |ГДЕ
			                    	  |	ДоговорыВзаиморасчетов.Владелец = &Контрагент
									  |	И (НЕ ДоговорыВзаиморасчетов.ПометкаУдаления)
			                    	  |
			                    	  |УПОРЯДОЧИТЬ ПО
			                    	  |	ДатаНачала УБЫВ";
			ВыборкаПоВалюте	= ЗапросПоВалюте.Выполнить().Выбрать();
			
			ТекущаяВалютаКонтрагента	= Неопределено;
			Пока ВыборкаПоВалюте.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаПоВалюте.ВалютаКонтрагента) Тогда
					ТекущаяВалютаКонтрагента	= ВыборкаПоВалюте.ВалютаКонтрагента;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			мВалютаРегламентированногоУчета	= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			
			Если ТекущаяВалютаКонтрагента=Неопределено И ЗначениеЗаполнено(мВалютаРегламентированногоУчета) Тогда
				ТекущаяВалютаКонтрагента	= мВалютаРегламентированногоУчета;
			Иначе
				ТекущаяВалютаКонтрагента	= "USD";	
			КонецЕсли;
			
			СтруктураКонтрагента.Вставить("ВалютаКонтрагента",	ТекущаяВалютаКонтрагента);					
			
			ФактическийАдрес= "";
			ПочтовыйАдрес	= "";
			ЭлектронныйАдрес= "";
			Город			= "";
			Страна			= "";
			ТелефонРабочий	= "";
			ТелефонДомашний	= "";
			
			НаборКонтактнойИнформацииКонтрагента = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			киПрочитатьКонтактнуюИнформацию(НаборКонтактнойИнформацииКонтрагента, СсылкаНаКонтрагента);
			Для Каждого СтрокаКИ Из НаборКонтактнойИнформацииКонтрагента Цикл
				
				Если СтрокаКИ.Тип=Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
					
					Если СтрокаКИ.Вид=Справочники.ВидыКонтактнойИнформации.АдресПочтовый Тогда
						ПочтовыйАдрес		= СтрокаКИ.Представление;	
					ИначеЕсли СтрокаКИ.Вид=Справочники.ВидыКонтактнойИнформации.АдресФактический Тогда
						ФактическийАдрес	= СтрокаКИ.Представление;
						Страна				= СтрокаКИ.Поле2;
						Город				= СтрокаКИ.Поле4;
					КонецЕсли;
					
				ИначеЕсли  СтрокаКИ.Тип=Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					
					Если СтрокаКИ.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонРабочий Тогда
						ТелефонРабочий				= СтрокаКИ.Представление;
					ИначеЕсли СтрокаКИ.Вид=Справочники.ВидыКонтактнойИнформации.ТелефонДомашний Тогда
						ТелефонДомашний				= СтрокаКИ.Представление;		
					КонецЕсли;
					
				ИначеЕсли  СтрокаКИ.Тип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					
					ЭлектронныйАдрес	= СтрокаКИ.Представление;
					
				КонецЕсли;
			КонецЦикла;
			
			СтруктураКонтрагента.Вставить("ФактическийАдрес",	ФактическийАдрес);
			СтруктураКонтрагента.Вставить("ПочтовыйАдрес",		ПочтовыйАдрес);
			СтруктураКонтрагента.Вставить("ЭлектронныйАдрес",	ЭлектронныйАдрес);
			СтруктураКонтрагента.Вставить("Город",				Город);
			СтруктураКонтрагента.Вставить("Страна",				Страна);		
			СтруктураКонтрагента.Вставить("ТелефонРабочий",		ТелефонРабочий);
			СтруктураКонтрагента.Вставить("ТелефонДомашний",	ТелефонДомашний);
			
			ЗапросЗаказов			= Новый Запрос();
			ЗапросЗаказов.УстановитьПараметр("Контрагент", СсылкаНаКонтрагента);
			ЗапросЗаказов. Текст	= "ВЫБРАТЬ
			                    	  |	ЗаказНаряд.Номер КАК НомерЗаказа,
			                    	  |	ЗаказНаряд.Дата КАК ДатаЗаказа,
			                    	  |	ЗаказНаряд.Автомобиль.VIN КАК VIN
			                    	  |ИЗ
			                    	  |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                    	  |ГДЕ
			                    	  |	ЗаказНаряд.Контрагент = &Контрагент";
			ТаблицаЗаказов		= ЗапросЗаказов.Выполнить().Выгрузить();
			
			СтруктураКонтрагента.Вставить("Заказы",	ТаблицаЗаказов);
			
			МассивСтруктур.Добавить(СтруктураКонтрагента);
			
			Если НЕ ПоискПоШаблону Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
		
	Возврат МассивСтруктур;
	
КонецФункции

// Функция возвращает  структуру Автомобиля по указанному полю поиска
// Параметры:
//	Параметры	- структура параметров для получения информации о заказе
//
// Возвращаемое значение - структура заказа
//
Функция ПолучитьСтруктуруАвтомобиля(Параметры) Экспорт
	
	МассивСтруктур		= Новый Массив();
	ЗапросАвтомобиля	= Новый Запрос();
	ИмяПоляПоиска		= Неопределено;
	ЗначениеПоляПоиска	= Неопределено;
	АвтомобильПоиска	= Неопределено;
	ВыборкаАвтомобиля	= Неопределено;
	ПоискПоШаблону		= Ложь;
	
	Параметры.Свойство("ИмяПоляПоиска", 		ИмяПоляПоиска);
	Параметры.Свойство("ЗначениеПоляПоиска",	ЗначениеПоляПоиска);
	Параметры.Свойство("СсылкаНаАвтомобиль",	АвтомобильПоиска);
	
	Если ИмяПоляПоиска="VIN" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросАвтомобиля.Текст	= "ВЫБРАТЬ
		                      	  |	Автомобили.Ссылка КАК Ссылка,
								  |	Автомобили.VIN КАК VIN,
								  |	Автомобили.Модель КАК Модель,
								  |	Автомобили.Код КАК Код,
								  |	Автомобили.Наименование КАК Наименование,
								  |	Автомобили.ГодВыпуска КАК ГодВыпуска,
								  |	Автомобили.ТипДвигателя КАК ТипДвигателя,
								  |	Автомобили.НомерДвигателя КАК НомерДвигателя,
								  |	Автомобили.ВариантКомплектации КАК ВариантКомплектации
								  |
		                      	  |ИЗ
		                      	  |	Справочник.Автомобили КАК Автомобили
		                      	  |ГДЕ
		                      	  |	Автомобили.VIN "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
							  
		ЗапросАвтомобиля.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаАвтомобиля	= ЗапросАвтомобиля.Выполнить().Выбрать();
		
	ИначеЕсли ИмяПоляПоиска="LICENSE_TAGS" Тогда		
		
		Если Найти(ЗначениеПоляПоиска,"*") Тогда
			ЗначениеПоляПоиска	= СтрЗаменить(ЗначениеПоляПоиска, "*","%");
			ПоискПоШаблону	= Истина;
		КонецЕсли;
		
		ЗапросАвтомобиля.Текст	= "ВЫБРАТЬ
		                      	  |	Автомобили.Автомобиль.Ссылка КАК Ссылка,
		                      	  |	Автомобили.Автомобиль.VIN КАК VIN,
		                      	  |	Автомобили.Автомобиль.Модель КАК Модель,
		                      	  |	Автомобили.Автомобиль.Код КАК Код,
		                      	  |	Автомобили.Автомобиль.Наименование КАК Наименование,
		                      	  |	Автомобили.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		                      	  |	Автомобили.Автомобиль.ТипДвигателя КАК ТипДвигателя,
		                      	  |	Автомобили.Автомобиль.НомерДвигателя КАК НомерДвигателя,
		                      	  |	Автомобили.Автомобиль.ВариантКомплектации КАК ВариантКомплектации
		                      	  |ИЗ
		                      	  |	РегистрСведений.Автомобили КАК Автомобили
		                      	  |ГДЕ
		                      	  |	Автомобили.ВидЗначения = &ВидЗначения
		                      	  |	И Автомобили.Значение "+?(ПоискПоШаблону,"ПОДОБНО","=")+" &ЗначениеПоляПоиска";
							  
		ЗапросАвтомобиля.УстановитьПараметр("ВидЗначения", Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		ЗапросАвтомобиля.УстановитьПараметр("ЗначениеПоляПоиска", СокрЛП(ЗначениеПоляПоиска));
		ВыборкаАвтомобиля	= ЗапросАвтомобиля.Выполнить().Выбрать();
		
	ИначеЕсли АвтомобильПоиска<>Неопределено Тогда
		ЗапросАвтомобиля.Текст	= "ВЫБРАТЬ
		                      	  |	Автомобили.Ссылка КАК Ссылка,
								  |	Автомобили.VIN КАК VIN,
								  |	Автомобили.Модель КАК Модель,
								  |	Автомобили.Код КАК Код,
								  |	Автомобили.Наименование КАК Наименование,
								  |	Автомобили.ГодВыпуска КАК ГодВыпуска,
								  |	Автомобили.ТипДвигателя КАК ТипДвигателя,
								  |	Автомобили.НомерДвигателя КАК НомерДвигателя,
								  |	Автомобили.ВариантКомплектации КАК ВариантКомплектации
								  |
		                      	  |ИЗ
		                      	  |	Справочник.Автомобили КАК Автомобили
		                      	  |ГДЕ
		                      	  |	Автомобили.Ссылка = &АвтомобильПоиска";
							  
		ЗапросАвтомобиля.УстановитьПараметр("АвтомобильПоиска", АвтомобильПоиска);
		ВыборкаАвтомобиля	= ЗапросАвтомобиля.Выполнить().Выбрать();	
	КонецЕсли;
	
	Если ВыборкаАвтомобиля<>Неопределено Тогда
		
		Пока ВыборкаАвтомобиля.Следующий() Цикл
			
			СтруктураАвтомобиля	= Новый Структура();
			СсылкаНаАвтомобиль			= ВыборкаАвтомобиля.Ссылка;
			ТекущаяМодель				= ВыборкаАвтомобиля.Модель;
			ТекущееНаименование			= ВыборкаАвтомобиля.Наименование;
			ТекущийВариантКомплектации	= ВыборкаАвтомобиля.ВариантКомплектации;
			ТекущийГодВыпуска			= ВыборкаАвтомобиля.ГодВыпуска;
			ТекущийТипДвигателя			= ВыборкаАвтомобиля.ТипДвигателя;
			ТекущийНомерДвигателя		= ВыборкаАвтомобиля.НомерДвигателя;
			
			СтруктураАвтомобиля.Вставить("СсылкаНаАвтомобиль",	СсылкаНаАвтомобиль);	
			СтруктураАвтомобиля.Вставить("СтранаАвтомобиля",	СтранаDMS);
			СтруктураАвтомобиля.Вставить("РегионАвтомобиля",	РегионDMS);
			СтруктураАвтомобиля.Вставить("ДилерАвтомобиля",		ДилерDMS);
			
			ТекущийПроизводительКод		= "0";
			ТекущийПроизводитель		= "VA";			
			
			Если ЗначениеЗаполнено(ТекущаяМодель) И ЗначениеЗаполнено(ТекущаяМодель.Родитель) Тогда				
				ТекущийПроизводитель		= СокрЛП(ТекущаяМодель.Родитель.Код);
			КонецЕсли;
			
			СтруктураАвтомобиля.Вставить("ПроизводительКод",	ТекущийПроизводительКод);
			СтруктураАвтомобиля.Вставить("Производитель",		ТекущийПроизводитель);
			
			СтруктураАвтомобиля.Вставить("VIN",				?(ЗначениеЗаполнено(ВыборкаАвтомобиля.VIN),ВыборкаАвтомобиля.VIN,"0"));
			СтруктураАвтомобиля.Вставить("ТипАвтомобиля",	"PC");
			СтруктураАвтомобиля.Вставить("Содержание",		"CUSTOMERVEHICLE");		
			СтруктураАвтомобиля.Вставить("Происхождение",	"WORKSHOP");
			
			Если ЗначениеЗаполнено(СсылкаНаАвтомобиль.ВариантКомплектации) Тогда
				ВариантКомплектации	= СсылкаНаАвтомобиль.ВариантКомплектации.Наименование;
			Иначе
				ВариантКомплектации	= "0";
			КонецЕсли;		
			СтруктураАвтомобиля.Вставить("ВариантКомплектации",	ВариантКомплектации);
			
			СтруктураАвтомобиля.Вставить("Наименование",	?(ЗначениеЗаполнено(ТекущееНаименование),ТекущееНаименование,"Car"));
			СтруктураАвтомобиля.Вставить("ГодВыпуска",		?(ЗначениеЗаполнено(ТекущийГодВыпуска),ТекущийГодВыпуска,"0000"));
			
			// Двух- или трехзначный код двигателя, например BFH.
			КодДвигателя	= СсылкаНаАвтомобиль.НомерДвигателя;
			Если НЕ ЗначениеЗаполнено(КодДвигателя) Тогда
				КодДвигателя	= ПолучитьЗначениеСвойства(СсылкаНаАвтомобиль, СвойствоКодДвигателяАвтомобиля);
				Если НЕ ЗначениеЗаполнено(КодДвигателя) Тогда
					КодДвигателя	= "0";
				КонецЕсли;
			КонецЕсли;
			
			// Двух- или трехзначный код двигателя, например BFH.
			Если ЗначениеЗаполнено(ТекущийТипДвигателя) Тогда
				ТипДвигателя	= ТекущийТипДвигателя.Наименование;
				ОбъемДвигателя	= ТекущийТипДвигателя.ОбъемДвигателя;
			Иначе
				ТипДвигателя	= "0";
				ОбъемДвигателя	= "0";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекущийНомерДвигателя) Тогда
				НомерДвигателя	= Строка(ТекущийНомерДвигателя);
			Иначе
				НомерДвигателя	= "0000000";
			КонецЕсли;
			
			Если ТекущийВариантКомплектации<>"0" И ЗначениеЗаполнено(ТекущийВариантКомплектации)
				И ЗначениеЗаполнено(ТекущийВариантКомплектации.ТипКПП) Тогда
				КодКПП			= СокрЛП(ТекущийВариантКомплектации.ТипКПП.Код);
				НаименованиеКПП	= ТекущийВариантКомплектации.ТипКПП.Наименование;
				НомерКПП		= СокрЛП(ТекущийВариантКомплектации.ТипКПП.Код);
			Иначе
				КодКПП			= ПолучитьЗначениеСвойства(СсылкаНаАвтомобиль, СвойствоКодКППАвтомобиля);
				Если НЕ ЗначениеЗаполнено(КодКПП) Тогда
					КодКПП	= "0";
				КонецЕсли;
				
				НаименованиеКПП	= "MAIN";
				НомерКПП		= "0";
			КонецЕсли;		
			
			Если ЗначениеЗаполнено(СсылкаНаАвтомобиль.Цвет) Тогда
				ЦветКузова				= СсылкаНаАвтомобиль.Цвет;
				НаименованиеЦветаКузова	= СсылкаНаАвтомобиль.Цвет.Наименование;
			Иначе
				ЦветКузова				= "";
				НаименованиеЦветаКузова	= "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СсылкаНаАвтомобиль.ЦветКод) Тогда
				КодЦветаКузова	= СсылкаНаАвтомобиль.ЦветКод;
			Иначе
				КодЦветаКузова	= "";
			КонецЕсли;		
			
			СтруктураАвтомобиля.Вставить("КодДвигателя",	КодДвигателя);
			СтруктураАвтомобиля.Вставить("ТипДвигателя",	ТипДвигателя);
			СтруктураАвтомобиля.Вставить("ОбъемДвигателя",	ОбъемДвигателя);
			СтруктураАвтомобиля.Вставить("НомерДвигателя",	НомерДвигателя);
			СтруктураАвтомобиля.Вставить("ОписаниеДвигателя","Engine");
			СтруктураАвтомобиля.Вставить("КодКПП",			КодКПП);
			СтруктураАвтомобиля.Вставить("НаименованиеКПП",	НаименованиеКПП);
			СтруктураАвтомобиля.Вставить("НомерКПП",		НомерКПП);
			СтруктураАвтомобиля.Вставить("ИсточникКодаКПП",	"OWN");
			СтруктураАвтомобиля.Вставить("ЦветКузова",		ЦветКузова);
			СтруктураАвтомобиля.Вставить("КодЦветаКузова",	КодЦветаКузова);
			СтруктураАвтомобиля.Вставить("НаименованиеЦветаКузова", НаименованиеЦветаКузова);
			СтруктураАвтомобиля.Вставить("ГруппаАвтомобиля","0");
			
			ОпцииАвтомобиля	= Новый ТаблицаЗначений();
			ОпцииАвтомобиля.Колонки.Добавить("Количество");
			ОпцииАвтомобиля.Колонки.Добавить("НомерОпции");
			ОпцииАвтомобиля.Колонки.Добавить("НаименованиеОпции");
			ОпцииАвтомобиля.Колонки.Добавить("ТипЦеныОпции");
			ОпцииАвтомобиля.Колонки.Добавить("ВалютаЦеныОпции");
			ОпцииАвтомобиля.Колонки.Добавить("ЦенаОпции");
			
			тзОпцииИОборудованиеАвтомобиля	= ЗагрузитьОпцииИОборудованиеАвтомобиля(СсылкаНаАвтомобиль); 	
			Для Каждого Комплектация Из тзОпцииИОборудованиеАвтомобиля Цикл
				ТекущаяОпция					= Комплектация.Опция;
				НоваяСтрока						= ОпцииАвтомобиля.Добавить();
				НоваяСтрока.Количество			= Комплектация.Количество;
				НоваяСтрока.НомерОпции			= ТекущаяОпция.Артикул;
				НоваяСтрока.НаименованиеОпции	= ТекущаяОпция.НаименованиеПолное;
				
				Если ТекущаяОпция.СтавкаНДС=Справочники.СтавкиНДС.БезНДС Тогда
					НоваяСтрока.ТипЦеныОпции	= "NET";
				Иначе
					НоваяСтрока.ТипЦеныОпции	= "GROSS";
				КонецЕсли;
				
				НоваяСтрока.ВалютаЦеныОпции		= 0;
				НоваяСтрока.ЦенаОпции			= ТекущаяОпция.ВалютаУчета;
			КонецЦикла;
					
			СтруктураАвтомобиля.Вставить("ОпцииАвтомобиля",		ОпцииАвтомобиля);

			//Получить последний пробег
			СтруктураОтбора		= Новый Структура("Автомобиль,ВидЗначения", СсылкаНаАвтомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			СтруктураСведений	= РегистрыСведений.Автомобили.ПолучитьПоследнее(,СтруктураОтбора);
			Пробег				= СтруктураСведений.Значение;
	
			//Получить последний ГосНомер
			СтруктураОтбора		= Новый Структура("Автомобиль,ВидЗначения", СсылкаНаАвтомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			СтруктураСведений	= РегистрыСведений.Автомобили.ПолучитьПоследнее(,СтруктураОтбора);
			ГосНомер			= СтруктураСведений.Значение;
			
			//Получить последний техпаспорт
			СтруктураОтбора		= Новый Структура("Автомобиль,ВидЗначения", СсылкаНаАвтомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
			СтруктураСведений	= РегистрыСведений.Автомобили.ПолучитьПоследнее(,СтруктураОтбора);
			ТехПаспорт			= СтруктураСведений.Значение;
			
			СтруктураАвтомобиля.Вставить("Пробег",		Пробег);
			СтруктураАвтомобиля.Вставить("ГосНомер",	ГосНомер);
			СтруктураАвтомобиля.Вставить("ТехПаспорт",	ТехПаспорт);
			
			ЗапросЗаказов			= Новый Запрос();
			ЗапросЗаказов.УстановитьПараметр("Автомобиль", СсылкаНаАвтомобиль);
			ЗапросЗаказов. Текст	= "ВЫБРАТЬ
			                    	  |	ЗаказНаряд.Номер КАК НомерЗаказа,
			                    	  |	ЗаказНаряд.Дата КАК ДатаЗаказа,
			                    	  |	ЗаказНаряд.Контрагент.Код КАК НомерКонтрагента
			                    	  |ИЗ
			                    	  |	Документ.ЗаказНаряд КАК ЗаказНаряд
			                    	  |ГДЕ
			                    	  |	ЗаказНаряд.Автомобиль = &Автомобиль";
			ТаблицаЗаказов		= ЗапросЗаказов.Выполнить().Выгрузить();
			
			СтруктураАвтомобиля.Вставить("Заказы",	ТаблицаЗаказов);
			
			МассивСтруктур.Добавить(СтруктураАвтомобиля);
			
			Если НЕ ПоискПоШаблону Тогда
				Прервать;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
		
	Возврат МассивСтруктур;
	
КонецФункции

// Функция осуществляет обработку запроса сервиса от DMSBB и возвращает ответ на запрос
// Параметры:
//	ТекстЗапроса	- текст запроса, на который необходимо ответить
//
// Возвращаемое значение - ответ на запрос
//
Функция ОбработатьЗапросDMSBB(ИмяСервиса, ТекстЗапроса) Экспорт
	
	СтрокаОтладки			= ТаблицаОтладки.Добавить();
	СтрокаОтладки.Дата		= ТекущаяДата();	
	СтрокаОтладки.Запрос	= "";
	СтрокаОтладки.Сервис	= ИмяСервиса;
	СтрокаОтладки.Значение	= ТекстЗапроса;
	
	ПроверитьТекстЗапроса(ТекстЗапроса);
	
	СтруктураОшибок	= Новый Структура("Ид,Код,Описание","",0,"");
	ПараметрыРазбора= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
	ДеревоЗапроса	= РазобратьОтветСервера(ТекстЗапроса, СтруктураОшибок, ПараметрыРазбора);
	
	ОтветНаЗапрос	= ОбработатьДеревоЗапроса(ДеревоЗапроса, ПараметрыРазбора);  
		
	Возврат ОтветНаЗапрос;
	
КонецФункции

// Функция формирует ответное сообщение на посланный DMSBB запрос
// Параметры:
//	ДеревоЗапроса		- дерево значений, в котором хранится разобранный запрос
//	ПараметрыРазбора	- структура параметров разбираемого запроса
//
// Возвращаемое значение- данные, подлежащие передаче в от вет на запрос
//
Функция ОбработатьДеревоЗапроса(ДеревоЗапроса, ПараметрыРазбора)
	
	ИмяЗапроса		= Неопределено;
	ТипЗапроса		= Неопределено;
	ВерсияЗапроса	= Неопределено;
	ИдЗапроса		= Неопределено;
	ЭтоЗапрос		= Ложь;
	
	ПараметрыРазбора.Свойство("ИмяЗапроса",		ИмяЗапроса);
	ПараметрыРазбора.Свойство("ТипЗапроса",		ТипЗапроса);
	ПараметрыРазбора.Свойство("ВерсияЗапроса",	ВерсияЗапроса);
	ПараметрыРазбора.Свойство("ИдЗапроса",		ИдЗапроса);
	ПараметрыРазбора.Свойство("ЭтоЗапрос",		ЭтоЗапрос);
	
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	
	Если ИмяЗапроса="AliveTest" Тогда
		ОтветНаЗапрос	= ОтветитьНаМетодAliveTest(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);	
		
	ИначеЕсли ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="BUSINESSPARTNERDATA"
		ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER"  Тогда
		
		Если (ТекущееИмяЗапроса="LISTENTRIES" ИЛИ ТекущееИмяЗапроса="LISTORDER") Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодList(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
		
		ИначеЕсли (ТекущееИмяЗапроса="GETENTRY" ИЛИ ТекущееИмяЗапроса="GETORDER") Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодGet(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="UPDATEORDER" Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодUpdate(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="NEWORDER" Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодNew(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="NEWENTRY" Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодNewEntry(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="UPDATEENTRY" Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодUpdateEntry(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="DELETEORDERCONTENT" Тогда	
			ОтветНаЗапрос	= ОтветитьНаМетодDeleteContent(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="SUBSCRIPTION" Тогда
			ОтветНаЗапрос	= ОтветитьНаМетодSubscription(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		ИначеЕсли ТекущееИмяЗапроса="CALCULATE" Тогда
			ОтветНаЗапрос	= ОтветитьНаМетодCalculate(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
			
		КонецЕсли;
		
	ИначеЕсли ТекущийТипЗапроса="SHOPDATA" Тогда	
		
		Если ТекущееИмяЗапроса="GETSTOCKINFORMATION" Тогда
			ОтветНаЗапрос	= ОтветитьНаМетодGetStockInformation(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);	
		КонецЕсли;
		
	Иначе
		ОтветНаЗапрос	= "<?xml version=""1.0"">";
	КонецЕсли;
	
	Возврат ОтветНаЗапрос;
	
КонецФункции

// Процедура записывает в xml указанный метод
//
Процедура ЗаписатьМетодВXML(ЗаписьXML, Имя, Версия)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("METHOD");
	ЗаписьXML.ЗаписатьАтрибут("VERSION",Версия);
	ЗаписьXML.ЗаписатьТекст(Имя);
	ЗаписьXML.ЗаписатьКонецЭлемента();	// METHOD	
	
КонецПроцедуры

// Функция формирует ответ на полученный от DMSBB метод AliveTest
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодAliveTest(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета	= "";		
	ЗаписьXML	= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
	ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
	ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
	ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));
	ЗаписьXML.ЗаписатьАтрибут("NAME",	"AliveTest");		
	ЗаписьXML.ЗаписатьАтрибут("VERSION","");
	ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("APPLICATION");
	ЗаписьXML.ЗаписатьАтрибут("HOSTNAME",	ИмяКомпьютера());
	ЗаписьXML.ЗаписатьАтрибут("NAME",		"Alfa-Avto");
	ЗаписьXML.ЗаписатьАтрибут("VENDOR",		"1C-Rarus");
	ЗаписьXML.ЗаписатьАтрибут("VERSION",	"1.0");
	ЗаписьXML.ЗаписатьКонецЭлемента();	// APPLICATION
	
	//WorkshopOrder
	Если ВРег(ТипЗапроса)="WORKSHOPORDER" ИЛИ ТипЗапроса="" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"WorkshopOrder");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"WorkshopOrder");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		
		ЗаписатьМетодВXML(ЗаписьXML, "ListEntries", "1.0");	// Получение общего списка заказов
		ЗаписатьМетодВXML(ЗаписьXML, "GetEntry", "1.0");	// Получение общей информации заказов по указанному заказу
		ЗаписатьМетодВXML(ЗаписьXML, "ListOrder", "1.0");	// Получение списка заказов
		//ЗаписатьМетодВXML(ЗаписьXML, "NewOrder", "1.0");	// Создание нового заказа
		ЗаписатьМетодВXML(ЗаписьXML, "GetOrder", "1.0");	// Получение данных/содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "UpdateOrder", "1.0");	// Обновление данных/содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "DeleteOrderContent", "1.0");	//	Удаление содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "Subscription", "1.0");// Подписка на изменение данных заказа

		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
	КонецЕсли;
	
	//SparepartOrder
	Если ВРег(ТипЗапроса)="SPAREPARTORDER" ИЛИ ТипЗапроса="" Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"SparepartOrder");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"SparepartOrder");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		
		ЗаписатьМетодВXML(ЗаписьXML, "ListEntries", "1.0");	// Получение общего списка заказов
		ЗаписатьМетодВXML(ЗаписьXML, "GetEntry", "1.0");	// Получение общей информации заказов по указанному заказу
		ЗаписатьМетодВXML(ЗаписьXML, "ListOrder", "1.0");	// Получение списка заказов
		//ЗаписатьМетодВXML(ЗаписьXML, "NewOrder", "1.0");	// Создание нового заказа
		ЗаписатьМетодВXML(ЗаписьXML, "GetOrder", "1.0");	// Получение данных/содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "UpdateOrder", "1.0");	// Обновление данных/содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "DeleteOrderContent", "1.0");	//	Удаление содержимого заказа
		ЗаписатьМетодВXML(ЗаписьXML, "Subscription", "1.0");// Подписка на изменение данных заказа

		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
	КонецЕсли;
	
	//BusinessPartnerData
	Если ВРег(ТипЗапроса)="BUSINESSPARTNERDATA" ИЛИ ТипЗапроса="" Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"BusinessPartnerData");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"BusinessPartnerData");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		
		ЗаписатьМетодВXML(ЗаписьXML, "ListEntries", "1.0");	// Получение общего списка контрагентов
		ЗаписатьМетодВXML(ЗаписьXML, "GetEntry", "1.0");	// Получение общей информации заказов по указанному контрагенту
		ЗаписатьМетодВXML(ЗаписьXML, "UpdateEntry", "1.0");	// Обновление данных/содержимого контрагента
		ЗаписатьМетодВXML(ЗаписьXML, "Subscription", "1.0");// Подписка на изменение данных контрагентов

		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
	КонецЕсли;
	
	//CustomerVehicleData
	Если ВРег(ТипЗапроса)="CUSTOMERVEHICLEDATA" ИЛИ ТипЗапроса="" Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"CustomerVehicleData");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"CustomerVehicleData");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		
		ЗаписатьМетодВXML(ЗаписьXML, "ListEntries", "1.0");	// Получение общего списка автомобилей
		ЗаписатьМетодВXML(ЗаписьXML, "GetEntry", "1.0");	// Получение общей информации заказов по указанному автомобилю
		ЗаписатьМетодВXML(ЗаписьXML, "UpdateEntry", "1.0");	// Обновление данных/содержимого автомобиля
		ЗаписатьМетодВXML(ЗаписьXML, "Subscription", "1.0");// Подписка на изменение данных автомобиля

		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
	КонецЕсли;
	
	//ShopData
	Если ВРег(ТипЗапроса)="SHOPDATA" ИЛИ ТипЗапроса="" Тогда
	ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE");
		ЗаписьXML.ЗаписатьАтрибут("DTD",	"ShopData");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	"ShopData");
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0.0.0");
		
		ЗаписатьМетодВXML(ЗаписьXML, "GetStockInformation", "1.0");	// Получение общего списка автомобилей

		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE				
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);
	
	Возврат ТекстОтвета;	
	
КонецФункции

// Процедура формирует шапку заказа
// Параметры:
//	ЗаписьXML 		- запись, в которую сохраняются выводимые данные
//	СтруктураЗаказа	- структура выводимого заказа
//
Процедура Сформировать_Order(ЗаписьXML, СтруктураЗаказа)
	
	Если ТипЗнч(СтруктураЗаказа)<>Тип("Структура") ИЛИ СтруктураЗаказа.Количество()=0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER");
	
	// Код страны в формате ISO 3166-alpha-3
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураЗаказа.СтранаЗаказа));
	
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураЗаказа.РегионЗаказа));
	
	// № дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураЗаказа.ДилерЗаказа));
	
	// Свободный идентификатор процесса, генерируется клиентом для запросов. Обычно значение,
	// возвращаемое DMS, такое же, как и № заказа (ORDER_NO).
	ЗаписьXML.ЗаписатьАтрибут("OID",			СформироватьСтрокуXML(СтруктураЗаказа.НомерЗаказа, Истина, "ORDER_NO"));
	
	// № заказа или идентификатор
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_NO");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.НомерЗаказа, Истина, "ORDER_NO"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_NO
	
	// Тип заказа, как используется в DMS
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_TYPE");
	
	// Тип заказа в общем виде. Допустимые значения:
	//	Normal		- Нормальный (workshop) заказ, по-умолчанию.
	//	Warranty	- Warranty заказ.
	//	Goodwill	- Goodwill заказ.
	//	Internal	- Любой внутренний заказ.
	//	Other		- Если не соответствует приведенным выше.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураЗаказа.ТипЗаказа));
	
	// Дополнительная интерпретация заказа. Допустимые значения:
	//	Normal			- нет дополнительной интерпретации, по-умолчанию.
	//	Cancellation	- заказ или часть его была отменена DMS,
	//					  в этом случае должен быть установлен RECEIPT_REF.
	//	Offer			- используется для вычисления значений заказа, таких как цена.
	ЗаписьXML.ЗаписатьАтрибут("ACTION",			СформироватьСтрокуXML(СтруктураЗаказа.ДействиеЗаказа));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.ТипЗаказа));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_TYPE
	
	// Статус заказа. Допустимые значения:
	//	New		- Новый создаваемый заказ, обычно в нем пока нет позиций заказа.
	//	Active	- Заказ в обработке, это значит, что есть содержимое заказа.
	//	Deleted	- Заказ отменен.
	//	Updated	- Заказ был обновлен.
	//	Charged	- Заказ одобрен для выставления счёта (инвойс).
	//	Closed	- Заказ был инвойсирован, конец процесса.
	//	Locked	- Заказ заблокирован.
	ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_STATUS");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.СтатусЗаказа));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_STATUS
	
	// Дата акцептования заказа в формате ISO 8601
	ЗаписьXML.ЗаписатьНачалоЭлемента("DATE");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.ДатаЗаказа));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DATE
	
	// Сервис-консультант. Человек, который создает заказ или ответственный за задачу
	Если ЗначениеЗаполнено(СтруктураЗаказа.Менеджер) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SERVICE_ADVISOR");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.Менеджер, Истина));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// SERVICE_ADVISOR
	КонецЕсли;
	
	// Код графика работ. Предоставляет собой случайное обозначение транспортного
	//// средства во время нахождения в мастерской
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SCHEDULE_CODE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML());
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SCHEDULE_CODE
	
	// Доля работ в формате десятичной дроби. Может быть интерпретирована как фактор
	// того, какую часть (стоимости заказчик должен заплатить. По-умолчанию =1.
	// Значение <1 указывает скидку с суммы для этого заказа, зависит обычно от «свойств» заказчика.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("WAGES_SHARE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.КоэффициентОплаты));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// WAGES_SHARE
	
	// Доля запчастей в формате десятичной дроби. Может быть интерпретирована как фактор того,
	// какую часть цены запчастей заказчик должен заплатить. По-умолчанию =1.
	// Значение <1 указывает скидку со стоимости запчастей для этого заказа, зависит обычно от «свойств» заказчика
	//ЗаписьXML.ЗаписатьНачалоЭлемента("PARTS_SHARE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураЗаказа.КоэффициентЗапчастей));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// PARTS_SHARE
	
	// Ссылка на заказчика (№ заказчика). Основной идентификатор.
	Сформировать_Customer_ref(ЗаписьXML, Новый Структура("СсылкаНаКонтрагента", СтруктураЗаказа.Заказчик));
	
	// Ссылка на транспортное  средство. Этот элемент может появляться дважды.
	// Первый элемент может содержать номер шасси (по умолчанию). В этом случае
	// атрибуты, зависящие от дилера, должны быть установлены для определения запасов товара дилера.
	// Второй содержит тип модели. В этом случае атрибут ORIGIN должен быть установлен для
	// определения связанного каталога.
	
	Сформировать_Vehicle_ref(ЗаписьXML, Новый Структура("СсылкаНаАвтомобиль", СтруктураЗаказа.Автомобиль));
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER
	
КонецПроцедуры

// Процедура формирует табличную часть заказа
// Параметры:
//	ЗаписьXML 		- запись, в которую сохраняются выводимые данные
//	СтруктураЗаказа	- структура выводимого заказа
//
Процедура Сформировать_Order_Item(ЗаписьXML, СтруктураЗаказа)

	Если ТипЗнч(СтруктураЗаказа)<>Тип("Структура") ИЛИ СтруктураЗаказа.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	ТекСсылка		= СтруктураЗаказа.СсылкаНаЗаказ;
	
	Если ТекСсылка=Неопределено ИЛИ ТекСсылка=Документы.ЗаказНаряд.ПустаяСсылка()
		ИЛИ ТекСсылка=Документы.ЗаказПокупателя.ПустаяСсылка()Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикСтрок	= 0;
	ТекОграничение	= "";
	СтруктураЗаказа.Свойство("Ограничение", ТекОграничение);
	
	Если ТипЗнч(ТекСсылка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда	
		Если ТекОграничение=Неопределено ИЛИ ТекОграничение="LABOUR_OPERATION" Тогда
			Для Каждого СтрокаРаботы Из ТекСсылка.Работы Цикл
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");
				
				// Код страны в формате ISO 3166-alpha-3
				ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураЗаказа.СтранаЗаказа));
				
				// Регион/Область
				ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураЗаказа.РегионЗаказа));
				
				//№ дилера
				ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураЗаказа.ДилерЗаказа));
				
				//№ заказа
				ЗаписьXML.ЗаписатьАтрибут("ORDER_NO",		СформироватьСтрокуXML(СтруктураЗаказа.НомерЗаказа, Истина, "ORDER_NO"));
				
				// № счета-фактуры (счета). Должен быть установлен, когда заказ заполнен.
				// Значение применяется к подобному атрибуту из ORDER_VALUE.
				// (Не возможно изменить любое значение содержимого без аннулирования счета.)					
				//Если СтрокаРаботы<>Неопределено И ЗначениеЗаполнено(СтрокаРаботы.Работа) Тогда
				//	// Счет фактура
				//	ЗаписьXML.ЗаписатьАтрибут("INVOICE_REF",	СформироватьСтрокуXML(СтрокаРаботы.Работа.Наименование));
				//КонецЕсли;
				
				// Ссылочный № гарантийного или goodwill требования, обязательно,
				// когда позиция принадлежит гарантийному требованию.
				ЗаписьXML.ЗаписатьАтрибут("CLAIM_REF",		СформироватьСтрокуXML(СтруктураЗаказа.НомерГарантийнойЗаявки));
				
				// Определяет включение позиции в выставляемый счет. Допустимые значения:
				// 	Client		– позиция выписывается клиенту (по умолчанию).
				//	Insurance	– позиция должна быть выписана на страховую компанию.
				//	Leasing		– позиция должна быть выписана на лизинговую компанию.
				ЗаписьXML.ЗаписатьАтрибут("CLASS",			СформироватьСтрокуXML("Client"));
				
				// Свободный № позиции заказа, сгенерированный клиентом.
				ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(СчетчикСтрок));
				
				// Послужил причиной повреждения: 0 – нет 1 – да.
				//ЗаписьXML.ЗаписатьАтрибут("DAMAGE_CAUSING",	СформироватьСтрокуXML("0"));
				
				ТекНомерСтроки	= СтрокаРаботы.НомерСтроки-1;
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
				ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекНомерСтроки));
				ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_ITEM_ID
				
				// LABOUR_OPERATION
				Сформировать_Labour_Operation(ЗаписьXML, СтруктураЗаказа, СтрокаРаботы);
				
				ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_ITEM
				
				СчетчикСтрок	= СчетчикСтрок + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекОграничение=Неопределено ИЛИ ТекОграничение="SPAREPART" Тогда
		Для Каждого СтрокаЗапчасть Из ТекСсылка.Товары Цикл
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");
			
			// Код страны в формате ISO 3166-alpha-3
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураЗаказа.СтранаЗаказа));
			
			// Регион/Область
			ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураЗаказа.РегионЗаказа));
			
			//№ дилера
			ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураЗаказа.ДилерЗаказа));
			
			//№ заказа
			ЗаписьXML.ЗаписатьАтрибут("ORDER_NO",		СформироватьСтрокуXML(СтруктураЗаказа.НомерЗаказа, Истина, "ORDER_NO"));
			
			// № счета-фактуры (счета). Должен быть установлен, когда заказ заполнен.
			// Значение применяется к подобному атрибуту из ORDER_VALUE.
			// (Не возможно изменить любое значение содержимого без аннулирования счета.)		
			//Если СтрокаЗапчасть<>Неопределено И ЗначениеЗаполнено(СтрокаЗапчасть.Номенклатура) Тогда
			//	// Счет фактура
			//	ЗаписьXML.ЗаписатьАтрибут("INVOICE_REF",	СформироватьСтрокуXML(СтрокаЗапчасть.Номенклатура.Наименование));
			//КонецЕсли;
			
			// Ссылочный № гарантийного или goodwill требования, обязательно,
			// когда позиция принадлежит гарантийному требованию.
			ЗаписьXML.ЗаписатьАтрибут("CLAIM_REF",		СформироватьСтрокуXML(СтруктураЗаказа.НомерГарантийнойЗаявки));
			
			// Определяет включение позиции в выставляемый счет. Допустимые значения:
			// 	Client		– позиция выписывается клиенту (по умолчанию).
			//	Insurance	– позиция должна быть выписана на страховую компанию.
			//	Leasing		– позиция должна быть выписана на лизинговую компанию.
			ЗаписьXML.ЗаписатьАтрибут("CLASS",			СформироватьСтрокуXML("Client"));
			
			// Свободный № позиции заказа, сгенерированный клиентом.
			ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(СчетчикСтрок));
			
			// Послужил причиной повреждения: 0 – нет 1 – да.
			//ЗаписьXML.ЗаписатьАтрибут("DAMAGE_CAUSING",	СформироватьСтрокуXML("0"));
			
			ТекНомерСтроки	= СтрокаЗапчасть.НомерСтроки-1;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекНомерСтроки));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_ITEM_ID
			
			// SPAREPART
			ПараметрыЗапчасти	= Новый Структура();
			ПараметрыЗапчасти.Вставить("СтрокаЗапчасть", СтрокаЗапчасть); 
			Если ТипЗнч(ТекСсылка)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ПараметрыЗапчасти.Вставить("СкладКомпании", ТекСсылка.СкладКомпании);	
			КонецЕсли;
			ПараметрыЗапчасти.Вставить("ТипЦен", ТекСсылка.ТипЦен);
			
			МассивЗапчастей	= ПолучитьСтруктуруЗапчасти(ПараметрыЗапчасти);
			Для Каждого СтруктураЗапчасти Из МассивЗапчастей Цикл
				Сформировать_Sparepart(ЗаписьXML, СтруктураЗапчасти);
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_ITEM
			
			СчетчикСтрок	= СчетчикСтрок + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует элемент LABOUR_OPERATION
// Параметры:
//	ЗаписьXML		- запись, в которую сохраняется элемент
//	СтруктураЗаказа	- заказ
//	СтрокаРабота	- строка табличной части Работы заказа
//
Процедура Сформировать_Labour_Operation(ЗаписьXML, СтруктураЗаказа, СтрокаРабота)

	Если обЗначениеНеЗаполнено(СтрокаРабота.Работа) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСсылка		= СтруктураЗаказа.СсылкаНаЗаказ;

	ЗаписьXML.ЗаписатьНачалоЭлемента("LABOUR_OPERATION");
		
	// Код страны в формате ISO 3166-alpha-3
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураЗаказа.СтранаЗаказа));
		
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураЗаказа.РегионЗаказа));
		
	//№ дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураЗаказа.ДилерЗаказа));
		
	Если ЗначениеЗаполнено(СтрокаРабота.Работа) Тогда
		loid		= СформироватьСтрокуXML(СтрокаРабота.Работа.Артикул);
		invoice_text= СформироватьСтрокуXML(СтрокаРабота.Работа.Наименование);
	Иначе
		loid		= "";
		invoice_text= "";
	КонецЕсли;

	// Свободный упорядоченный № ремонтной операции или код ремонтной операции в заказе
	Если НЕ ПустаяСтрока(loid) Тогда
		ЗаписьXML.ЗаписатьАтрибут("LOID",			loid);
	КонецЕсли;
	
	// Идентификация происхождения ремонтной операции. Допустимые значения:
	//	OWN		– главная БД ремонтных работ (Volkswagen/AUDI).
	//	OUTSIDE	– внешние работы.
	//	SAZ		– местоположение SAZ.
	//	TEMP	– сгенерированная, ручная, измененная, временная работа.
	ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML("OWN"));

	// Тип ремонтной операции (это основная APOS идентификация) Тип из ELSA WIN.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TYPE_OF_FAMILY");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("38"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TYPE_OF_FAMILY
	
	// № ремонтной операции (repair op) или SAZ идентификация, как определено APOS или SAZ.
	ЗаписьXML.ЗаписатьНачалоЭлемента("LO_NUMBER");
	
	// Группа восстановления (цифры 1-2 в repair op) или основная идентификация SAZ идентификации.
	ЗаписьXML.ЗаписатьНачалоЭлемента("REPAIR_GROUP");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(Сред(loid,1,2)));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// REPAIR_GROUP
	
	// № иллюстрации (цифры 3-4 в repair op), должно быть пропущено в случае SAZ.
	ЗаписьXML.ЗаписатьНачалоЭлемента("ILLUSTRATION_NUMBER");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(Сред(loid,3,2)));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ILLUSTRATION_NUMBER
	
	// Код задания (нормы работы) (цифры 5-6 в repair op) или остальные части SAZ идентификации
	ЗаписьXML.ЗаписатьНачалоЭлемента("TASK");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(Сред(loid,5,2)));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TASK
	
	// Код индекса (цифры 7-8 в repair op), должно быть пропущено в случае SAZ
	ЗаписьXML.ЗаписатьНачалоЭлемента("INDEX");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(Сред(loid,7,2)));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// INDEX
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// LO_NUMBER
	
	Если НЕ ПустаяСтрока(invoice_text) Тогда
		// Текст счета для ремонтной операции.
		ЗаписьXML.ЗаписатьНачалоЭлемента("INVOICE_TEXT");
		// Код языка, согласно ISO 639.
		ЗаписьXML.ЗаписатьАтрибут("LANG",	СформироватьСтрокуXML("RU"));
		ЗаписьXML.ЗаписатьТекст(invoice_text);
		ЗаписьXML.ЗаписатьКонецЭлемента();	// INVOICE_TEXT
	КонецЕсли;
	
	// Покрасочный материал.
	ЗаписьXML.ЗаписатьНачалоЭлемента("LAC");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// LAC
		
	// Код сервис-центра
	Если ТипЗнч(ТекСсылка)=Тип("ДокументСсылка.ЗаказНаряд") И ЗначениеЗаполнено(ТекСсылка.Цех) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("WSC");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСсылка.Цех));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// WSC
	КонецЕсли;	
	
	// Трудовая норма.
	Если СтрокаРабота<>Неопределено И ЗначениеЗаполнено(СтрокаРабота.Нормочас) Тогда
		billing_factor		= СформироватьСтрокуXML(СтрокаРабота.Нормочас.Наименование);
		Если НЕ ЭтоЧисло(billing_factor) Тогда
			billing_factor	= "";
		КонецЕсли;
	Иначе
		billing_factor	= "";	
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(billing_factor) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("BILLING_FACTOR");
		ЗаписьXML.ЗаписатьТекст(billing_factor);
		ЗаписьXML.ЗаписатьКонецЭлемента();	// BILLING_FACTOR
	КонецЕсли;
	
	// Код механика
	Если ТипЗнч(ТекСсылка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("MECHANIC");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ПолучитьИсполнителяРаботы(ТекСсылка, СтрокаРабота)));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//MECHANIC
	Иначе
		ИсполнительРаботы	= Неопределено;
		СтруктураЗаказа.Свойство("ИсполнительРаботы", ИсполнительРаботы);
		Если ИсполнительРаботы<>Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("MECHANIC");
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ИсполнительРаботы.Код));
			ЗаписьXML.ЗаписатьКонецЭлемента();	//MECHANIC			
		КонецЕсли;
	КонецЕсли;
	
	// Единица времени. Значение должно быть основано на правиле:
	// 1 час эквивалентен 100 единицам времени. Начиная с версии 1.3.0.0 определений DMS-BB
	// существует два дополнительных атрибута, которые могут заменять элементы BILLING_FACTOR
	// и MECHANIC. Новая структура дает большую гибкость использовании группировок.
	Если ТипЗнч(ТекСсылка)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("TIMEUNITS");
		
		// Указывает на группу выставления счетов элемента согласно APOS относительно mechanic или люого другого ресурса
		//ЗаписьXML.ЗаписатьАтрибут("BILLING_FACTOR",	СформироватьСтрокуXML(""));
		// Эквивалентно MECHANIC. Указывает идентификацию механика или id любого ресурса ,
		// по которому собираются единицы времени
		//ЗаписьXML.ЗаписатьАтрибут("RESOURCE_ID",		СформироватьСтрокуXML(""));
		
		НормаВремени	= Окр(СтрокаРабота.Коэффициент*100, 0);
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(НормаВремени));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//TIMEUNITS
	Иначе
		ЕдиницыВремени	= Неопределено;
		СтруктураЗаказа.Свойство("ЕдиницыВремени", ЕдиницыВремени);
		Если ЕдиницыВремени<>Неопределено Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("TIMEUNITS");
			//ЗаписьXML.ЗаписатьАтрибут("RESOURCE_ID",		СформироватьСтрокуXML(""));
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ЕдиницыВремени));
			ЗаписьXML.ЗаписатьКонецЭлемента();	//TIMEUNITS			
		КонецЕсли;
	КонецЕсли;
	
	// Себестоимости/себестоимость работ сторонней организации.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TRADE_IN");
	// Информация о валюте, согласно ISO 4217.
	//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
	// Для интерпретации значения:
	//	NET		- Значение без налогов.
	//	GROSS	- Значение с налогами.
	//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	//TRADE_IN
	
	// Вычисленная продажная цена (по-умолчанию). Элемент обязателен во всех случаях,
	// где объект дается в контексте определения величины и необязателен в остальных случаях.
	// В случае специальных мероприятий или скидок элемент должен появляться дважды. Один раз для предоставления
	// расчетной продажной цены, второй раз – для специальной цены. Специальная продажная цена
	// должна содержать атрибут DISCOUNT со значением не равным "None" для определения норм (бухгалтерского) учета.
	Если ЗначениеЗаполнено(СтрокаРабота.Нормочас) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
		// Информация о валюте, согласно ISO 4217.
		Если ЗначениеЗаполнено(СтрокаРабота.Нормочас.Валюта) Тогда
			ТекущаяВалюта	= СтрокаРабота.Нормочас.Валюта;
		Иначе
			ТекущаяВалюта	= "RUR";
		КонецЕсли;
		ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(ТекущаяВалюта));
		
		// Для интерпретации значения:
		//	NET		-  Значение без налогов.
		//	GROSS	- Значение с налогами.
		ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(?(ЗначениеЗаполнено(СтрокаРабота.СуммаНДС),"GROSS","NET")));
		
		// Тип скидки. Допустимые значения:
		//	None		– по-умолчанию (никогда не должна использоваться в случае скидок).
		//	Wages		– скидка только на доход.
		//	Parts		– скидка только на запчасти.
		//	Gross		– специальная скидка на стоимость с налогами, общая
		ЗаписьXML.ЗаписатьАтрибут("DISCOUNT",			СформироватьСтрокуXML(?(ЗначениеЗаполнено(СтрокаРабота.СуммаСкидки),"Gross","None")));
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтрокаРабота.Цена));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//PRICE
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// LABOUR_OPERATION
	
КонецПроцедуры

// Функция возвращает исполнителя работы по идентификатору работы
//
Функция ПолучитьИсполнителяРаботы(ТекСсылка, СтрокаРаботы)
	СтрокаВозврата	= "";
	
	Если СтрокаРаботы<>Неопределено Тогда
		ИдентификаторРаботы	= СтрокаРаботы.ИдентификаторРаботы;
		НайденнаяСтрока		= ТекСсылка.Исполнители.Найти(ИдентификаторРаботы, "ИдентификаторРаботы");
		Если НайденнаяСтрока<>Неопределено Тогда
			СтрокаВозврата	= НайденнаяСтрока.Исполнитель;			
		КонецЕсли;
	КонецЕсли;		
	
	Возврат СтрокаВозврата;
КонецФункции

// Процедура формирует элемент SPAREPART
// Параметры:
//	ЗаписьXML			- запись, в которую сохраняется элемент
//	СтруктураОбъекта	- структура запчасти
//
Процедура Сформировать_Sparepart(ЗаписьXML, СтруктураОбъекта)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SPAREPART");
	
	// Свободный упорядоченный № или идентификатор запчасти в заказе
	//ЗаписьXML.ЗаписатьАтрибут("SID_REF",			СформироватьСтрокуXML());				
	Если СтруктураОбъекта.Номенклатура<>Неопределено
		И СтруктураОбъекта.Номенклатура<>Справочники.Номенклатура.ПустаяСсылка() Тогда	
		//Ссылка на запчасть вместе с истолкованием.
		КодЗапчасти	= СформироватьСтрокуXML(СтруктураОбъекта.Номенклатура);
		ЗаписьXML.ЗаписатьАтрибут("SID",			КодЗапчасти);
	КонецЕсли;	
	
	// Код страны в формате ISO 3166-alpha-3
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураОбъекта.СтранаЗапчасти));
		
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураОбъекта.Регионзапчасти));
		
	//№ дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураОбъекта.ДилерЗапчасти));
			
	// Идентификация происхождения запчасти. Допустимые значения:
	//	OWN		– главная БД запчастей (Volkswagen/AUDI).
	//	OUTSIDE	– запчасть не дилера, сторонняя.
	ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML("OWN"));
	
	//Идентификация предполагаемой запчасти. Допустимое значение: ESTIMATED.
	ЗаписьXML.ЗаписатьАтрибут("VALUE",			СформироватьСтрокуXML("ESTIMATED"));
	
	// № запчасти.
	ЗаписьXML.ЗаписатьНачалоЭлемента("SPAREPART_NO");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Номенклатура.Артикул));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// SPAREPART_NO		
	
	// Описание запчасти (длинный текст).
	ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
	ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Наименование, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION	
	
	// Описание запчасти (короткий текст).
	ЗаписьXML.ЗаписатьНачалоЭлемента("INVOICE_TEXT");
	ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Наименование, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// INVOICE_TEXT
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("KIT");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();	//KIT		
	
	// Склады (запасы)
	ЗаписьXML.ЗаписатьНачалоЭлемента("STOCKS");
	// Определение значения запаса:
	//	MIN		– минимальный запас
	//	ACTUAL	– текущий запас (по-умолчанию).
	//	ORDER	– число запчастей распределено по пунктам заказа.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураОбъекта.ТипЗапаса));
	ЗаписьXML.ЗаписатьАтрибут("UNIT",			СформироватьСтрокуXML("NUMBER"));
	Если СтруктураОбъекта.СкладКомпании<>Неопределено
		И СтруктураОбъекта.СкладКомпании<>Справочники.СкладыКомпании.ПустаяСсылка() Тогда
		ОстатокТовараНаСкладе	= СтруктураОбъекта.ОстатокНаСкладе;
		Склад					= СтруктураОбъекта.СкладКомпании;
		
		Если Склад.ВидСклада=Перечисления.ВидыСкладов.Ячеистый Тогда
			Постфикс	= " X="+Склад.ВходX+" Y="+Склад.ВходY;
		Иначе
			Постфикс	= "";
		КонецЕсли;
		
		НаименованиеСклада		= Склад.Наименование+Постфикс;
	Иначе
		ОстатокТовараНаСкладе	= "0";
		НаименованиеСклада		= "Импортер";
	КонецЕсли;
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ОстатокТовараНаСкладе));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// STOCKS
	
	// Место хранения (номер ячейки).
	ЗаписьXML.ЗаписатьНачалоЭлемента("STORE");	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(НаименованиеСклада));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// STORE	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("TRADE_IN");
	
	// Детали валюты формате ISO 4217, если значение не в евро
	ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(СтруктураОбъекта.Валюта));
	
	// Для интерпретации значения:
	// NET		- Значение без налогов.
	// GROSS	- Значение с налогами
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML("NET"));
	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TRADE_IN	
	
	// Реальная дилерская розничная цена, как отмечено на складе, или рекомендованная розничная цена за единицу
	// (это по умолчанию). В случае специальных мероприятий или скидок элемент должен появляться дважды. Один раз
	//  для предоставления RRP, второй раз – для специальной цены. Специальная продажная цена должна
	// содержать атрибут DISCOUNT со значением не равным "None" для определения норм (бухгалтерского) учета.
	ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
	
	// Информация о валюте, согласно ISO 4217 (alphabetic).
	ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(СтруктураОбъекта.Валюта));
	
	// Для интерпретации значения цены:
	//	NET		- Значение без налогов.
	//	GROSS	- Значение с налогами.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураОбъекта.ТипНалога));
	
	// Тип скидки. Допустимые значения:
	//	None		– по умолчанию (никогда не должна использоваться в случае скидок).
	//	Wages		– скидка только на доход.
	//	Parts		– скидка только на запчасти.
	//	Gross		– специальная скидка на стоимость с налогами, общая на доход и запчасти.
	//	Net			– специальная скидка на стоимость без налогов, общая на доход и запчасти.
	ЗаписьXML.ЗаписатьАтрибут("DISCOUNT",			СформироватьСтрокуXML("None"));
	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Цена));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE		
	
	// Управляющий (контрольный) код
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DISPOSAL_CODE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DISPOSAL_CODE
	
	// Детализация типа налога. Значение должно быть аббревиатурой наименования налога, обычно «VAT» (НДС).
	ЗаписьXML.ЗаписатьНачалоЭлемента("TAXCODE");
	
	// Процент налога. (Это новый атрибут, поэтому определен как необязательный для обратной совместимости.)
	ЗаписьXML.ЗаписатьАтрибут("RATE",			СформироватьСтрокуXML(СтруктураОбъекта.СтавкаНДС));	
	//ЗаписьXML.ЗаписатьАтрибут("SHARE",		СформироватьСтрокуXML(""));
	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("VAT"));	//НДС
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TAXCODE	
	
	// Производственный код/тип товара
	ЗаписьXML.ЗаписатьНачалоЭлемента("SPAREPART_CATEGORY");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("VA"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// SPAREPART_CATEGORY
	
	// Группа запчастей
	Если ЗначениеЗаполнено(СтруктураОбъекта.Номенклатура) Тогда
		ЦеноваяГруппа	= ПолучитьЗначениеСвойства(СтруктураОбъекта.Номенклатура, СвойствоЦеноваяГруппаЗапчасти);	
	КонецЕсли;
	Если ЦеноваяГруппа=Неопределено Тогда
		ЦеноваяГруппа	= "0";	
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SPAREPART_GROUP");	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ЦеноваяГруппа));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// SPAREPART_GROUP
	
	// Данные интерпретации.
	ЗаписьXML.ЗаписатьНачалоЭлемента("INTERPRETATION");
	
	// Код интерпретации.
	//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
	
	// Группа интерпретации.
	ЗаписьXML.ЗаписатьНачалоЭлемента("INTERPRETATION_GROUP");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// INTERPRETATION_GROUP
	
	// Упорядоченный № в группе интерпретации.
	ЗаписьXML.ЗаписатьНачалоЭлемента("COUNT");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// COUNT
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// INTERPRETATION
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// SPAREPART

КонецПроцедуры

// Процедура формирует элемент PACKET_INFO
// Параметры:
//	ЗаписьXML			- запись, в которую сохраняется элемент
//	СтруктураОбъекта	- структура запчасти
//
Процедура Сформировать_Packet_Info(ЗаписьXML, СтруктураОбъекта)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PACKET_INFO");
						
	// Указывает тип группы. Применимые значения:
	//	PASS	– система пакетов сервиса.
	//	SAZ		– самогенерируемая рабочая инструкция
	Если ЗначениеЗаполнено(СтруктураОбъекта.Источник) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ORIGIN",	СформироватьСтрокуXML(СтруктураОбъекта.Источник));
	КонецЕсли;
	
	// Безопасная идентификация генерируется SAZ для обеспечения корректности и
	// непротиворечивости (применима только в использовании с SAZ группами, в противном случае необязательна).
	Если ЗначениеЗаполнено(СтруктураОбъекта.КодПакета) Тогда
		ЗаписьXML.ЗаписатьАтрибут("CODE",	СформироватьСтрокуXML(СтруктураОбъекта.КодПакета));
	КонецЕсли;
	
	// Идентификация группы. Значением описывает содержимое и должно интерпретироваться различно,
	// если это необходимо согласно PASS или SAZ схеме. DMS может использовать его эквивалентно № ремонтной операции.
	Если ЗначениеЗаполнено(СтруктураОбъекта.ИдПакета) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("PACKET_ID");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.ИдПакета));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//PACKET_ID
	КонецЕсли;
	
	// Текст счета для группы.
	Если ЗначениеЗаполнено(СтруктураОбъекта.ТекстСчета) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("INVOICE_TEXT");
		ЗаписьXML.ЗаписатьАтрибут("LANG",	СформироватьСтрокуXML(СтруктураОбъекта.ЯзыкТекстаСчета));
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.ТекстСчета));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//INVOICE_TEXT
	КонецЕсли;
	
	// Дополнительное определение того, какая деталь транспортного средства будет восстановлена.
	// PASS и SAZ ответственны за предоставление обзора возможных значений. Элемент определен как
	// необязательный в предположении того, что DMS сама по себе не может определить это значение.Дополнительное определение того,
	// какая деталь транспортного средства будет восстановлена. PASS и SAZ ответственны за предоставление обзора возможных
	// значений. Элемент определен как необязательный в предположении того, что DMS сама по себе не может определить это значение.
	Если ЗначениеЗаполнено(СтруктураОбъекта.ИдОбъекта) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("OBJECT_ID");
		ЗаписьXML.ЗаписатьТекст("",			СформироватьСтрокуXML(СтруктураОбъекта.ИдОбъекта));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//OBJECT_ID
	КонецЕсли;	
	
	// Процент труда.
	Если ЗначениеЗаполнено(СтруктураОбъекта.ТрудоваяНорма) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("BILLING_FACTOR");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.ТрудоваяНорма));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//BILLING_FACTOR
	КонецЕсли;
	
	// Код механика.
	Если ЗначениеЗаполнено(СтруктураОбъекта.Механик) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("MECHANIC");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Механик));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//MECHANIC
	КонецЕсли;	
	
	// Единицы времени..
	Если ЗначениеЗаполнено(СтруктураОбъекта.ВремяРаботы) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("TIMEUNITS");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.ВремяРаботы));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//TIMEUNITS
	КонецЕсли;
		
	// Вычисленная рекомендованная розничная цена (по умолчанию). В случае специальных мероприятий
	// или скидок элемент должен появляться дважды. Один раз для предоставления рекомендованной розничной цены,
	// второй – для специальной цены. Специальная продажная цена должна содержать атрибут DISCOUNT со значением
	// не равным "None" для определения норм (бухгалтерского) учета..
	Если ЗначениеЗаполнено(СтруктураОбъекта.Цена) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
		
		Если ЗначениеЗаполнено(СтруктураОбъекта.ВалютаЦены) Тогда
			ЗаписьXML.ЗаписатьАтрибут("CURRENCY",	СформироватьСтрокуXML(СтруктураОбъекта.ВалютаЦены));
		КонецЕсли;		
		Если ЗначениеЗаполнено(СтруктураОбъекта.ТипЦены) Тогда
			ЗаписьXML.ЗаписатьАтрибут("TYPE",	СформироватьСтрокуXML(СтруктураОбъекта.ТипЦены));
		КонецЕсли;		
		Если ЗначениеЗаполнено(СтруктураОбъекта.СкидкаЦены) Тогда
			ЗаписьXML.ЗаписатьАтрибут("DISCOUNT",	СформироватьСтрокуXML(СтруктураОбъекта.СкидкаЦены));
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Цена));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//PRICE
	КонецЕсли;	
	
	// Порядковый № группы в заказе DMS. Этот элемент должен быть заменен в будущих версиях через
	// использование PACKET_REF или ORDER_ITEM_ID.
	Если ЗначениеЗаполнено(СтруктураОбъекта.Набор) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("KIT");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураОбъекта.Набор));
		ЗаписьXML.ЗаписатьКонецЭлемента();	//KIT
	КонецЕсли;	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PACKET_INFO

КонецПроцедуры

// Процедура формирует данные контрагента
// Параметры:
//	ЗаписьXML 				- запись, в которую сохраняются выводимые данные
//	СтруктураКонтрагента	- структура выводимого контрагента
//
Процедура Сформировать_Business_Partner(ЗаписьXML, СтруктураКонтрагента)
	
	Если ТипЗнч(СтруктураКонтрагента)<>Тип("Структура") ИЛИ СтруктураКонтрагента.Количество()=0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("BUSINESS_PARTNER");
	
	СсылкаНаКонтрагента	= СтруктураКонтрагента.КонтрагентСсылка;
	
	// Код страны в формате ISO 3166-alpha-3                          
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураКонтрагента.СтранаКонтрагента));
	                                                                  
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураКонтрагента.РегионКонтрагента));
	
	// № дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураКонтрагента.ДилерКонтрагента));
	
	// Свободная идентификация
	ЗаписьXML.ЗаписатьАтрибут("PID",			СформироватьСтрокуXML(СтруктураКонтрагента.Код));
	
	// Описание клиента или поставщика. Допустимые значения:
	//	CUSTOMER	– клиент
	//	SUPPLIER	– поставщик
	//	PROSPECT	– предполагаемый клиент
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураКонтрагента.ВидКонтрагента));
	
	// Определяет используемость данных клиента. Допустимые значения:
	//	ACTIVE		– данные клиента одобрены.
	//	INACTIVE	– данные клиента приостановлены.
	//	CLOSED		– данные клиента уже не действительны.
	ЗаписьXML.ЗаписатьАтрибут("STATUS",			СформироватьСтрокуXML("ACTIVE"));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ACCOUNT_NO");
	
	// Код страны в формате ISO 3166-alpha-3                          
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураКонтрагента.СтранаКонтрагента));
	                                                                  
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураКонтрагента.РегионКонтрагента));
	
	// № дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураКонтрагента.ДилерКонтрагента));	
	
	// Тип № клиента указывает параметры выписки счета-фактуры (счета). Допустимые значения:
	//	INDIVIDUAL		– (default) персональный № клиента, клиент будет получателем счета-фактуры (счета).
	//	MAIN_ACCOUNT	– начисление через главный номер счета. Т. е. получателем счета-фактуры (счета) будет не клиент,
	//					  а кто-нибудь другой, например, его фирма.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML("INDIVIDUAL"));
	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураКонтрагента.НомерКонтрагента));
		
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ACCOUNT_NO
	
	// Сокращенное наименование клиента.
	ЗаписьXML.ЗаписатьНачалоЭлемента("MATCHCODE");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураКонтрагента.Наименование, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MATCHCODE
	
	// Форма обращения включая "титул учтивости" (в виде текста).
	ЗаписьXML.ЗаписатьНачалоЭлемента("COURTESY_TITLE");
		
	// Тип COURTESY_TITLE. Допустимые значения:
	//	CO		– компания.
	//	FEMALE	– женщина.
	//	MALE	– мужчина.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураКонтрагента.Пол));	
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураКонтрагента.Обращение, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// COURTESY_TITLE	
	
	//Имя клиента
	ЗаписьXML.ЗаписатьНачалоЭлемента("NAME");
	
	// Тип имени. Допустимые значения:
	//	LAST	– фамилия.
	//	FIRST	– имя.
	//	MIDDLE	– второе имя.
	//	EXTEND	– дополнение к имени.
	//	TITLE	– наименование.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML("LAST"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураКонтрагента.НаименованиеПолное, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// NAME
	
	// Адрес, название улицы и номер дома.
	Если ЗначениеЗаполнено(СтруктураКонтрагента.ФактическийАдрес) Тогда
		ТекущийФактическийАдрес	= СтруктураКонтрагента.ФактическийАдрес;
	Иначе
		ТекущийФактическийАдрес	= "Не заполнено";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ADDRESS");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущийФактическийАдрес, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ADDRESS
	
	// Почтовый индекс
	Если ЗначениеЗаполнено(СтруктураКонтрагента.ПочтовыйАдрес) Тогда
		ТекущийПочтовыйАдрес	= СтруктураКонтрагента.ПочтовыйАдрес;
	Иначе
		ТекущийПочтовыйАдрес	= "Не заполнено";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ZIP");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущийПочтовыйАдрес));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ZIP
	
	// Город.
	Если ЗначениеЗаполнено(СтруктураКонтрагента.Город) Тогда
		ТекущийГород	= СтруктураКонтрагента.Город;
	Иначе
		ТекущийГород	= "Не указано";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CITY");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущийГород, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// CITY
	
	// Код страны согласно ISO 3166-alpha-3
	Если ЗначениеЗаполнено(СтруктураКонтрагента.Страна) Тогда
		ТекущаяСтрана	= СтруктураКонтрагента.Страна;
	Иначе
		ТекущаяСтрана	= "Не заполнено";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("COUNTRY");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущаяСтрана, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// COUNTRY
	
	Если ЗначениеЗаполнено(СтруктураКонтрагента.ЭлектронныйАдрес) Тогда
		ТекущийЭлектронныйАдрес	= СтруктураКонтрагента.ЭлектронныйАдрес; 
	Иначе
		ТекущийЭлектронныйАдрес	= СтруктураКонтрагента.СтранаКонтрагента;
	КонецЕсли;
		
	// Контакт
	ЗаписьXML.ЗаписатьНачалоЭлемента("CONTACT");
		
	//	PHONE	– № телефона
	//	FAX		– № факса
	//	EMAIL	– адрес E-mail
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML("EMAIL"));
		
	//	HOME – домашний №
	//	BUSINESS – рабочий №
	//	TEMP	– можно временно связаться по…
	ЗаписьXML.ЗаписатьАтрибут("SIGN",			СформироватьСтрокуXML("BUSINESS"));
		
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущийЭлектронныйАдрес));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// CONTACT
	
	// Дата рождения в формате ISO-8601
	Если ЗначениеЗаполнено(СтруктураКонтрагента.ДатаРождения) Тогда
		ТекущаяДатаРождения	= СтруктураКонтрагента.ДатаРождения;
	Иначе
		ТекущаяДатаРождения	= Дата(1,1,1);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DATE_OF_BIRTH");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущаяДатаРождения));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DATE_OF_BIRTH
	
	ТекущаяВалютаКонтрагента	= Неопределено;
	Если ТипЗнч(СтруктураКонтрагента)=Тип("Структура") И СтруктураКонтрагента.Свойство("ВалютаКонтрагента", ТекущаяВалютаКонтрагента) Тогда
		ТекущаяВалютаКонтрагента	= СформироватьСтрокуXML(СтруктураКонтрагента.ВалютаКонтрагента);	
	Иначе
		ТекущаяВалютаКонтрагента	= СформироватьСтрокуXML(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить());	
	КонецЕсли;
	
	// Предпочтительная валюта счета в формате ISO 4217 (alphabetic)
	ЗаписьXML.ЗаписатьНачалоЭлемента("CURRENCY");
	ЗаписьXML.ЗаписатьТекст(ТекущаяВалютаКонтрагента);
	ЗаписьXML.ЗаписатьКонецЭлемента();	// CURRENCY
	
	// Специальные свойства клиента. Для этой группы необходимо проверить, избыточна ли
	// информация в CUSTOMER_GROUP и в атрибуте TYPE из BUSINESS_PARTNER. Но информация из CUSTOMER_GROUP обязательна.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("PROPERTIES");

	// Группа клиентов
	//ЗаписьXML.ЗаписатьНачалоЭлемента("CUSTOMER_GROUP");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// CUSTOMER_GROUP
	
	// Подгруппа группы клиентов
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SUBGROUP");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SUBGROUP
	
	// Подгруппа для новых АМ
	//ЗаписьXML.ЗаписатьНачалоЭлемента("NEWVEHICLE_CODE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// NEWVEHICLE_CODE	
	
	// Код встречи (сборки)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("GATHERING_CODE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// GATHERING_CODE
	
	// Число копий
	//ЗаписьXML.ЗаписатьНачалоЭлемента("COPIES");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// COPIES
	
	// Код защиты данных
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SECURITY_FLAG");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SECURITY_FLAG	
	
	// Код для маркетинговой операции
	//ЗаписьXML.ЗаписатьНачалоЭлемента("MARKETING_ID");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// MARKETING_ID	
	
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// PROPERTIES
	
	// Коэффициент скидки для клиента
	ЗаписьXML.ЗаписатьНачалоЭлемента("DISCOUNT");

	// Индивидуальный коэффициент скидки на работы в сервисе в формате десятичной дроби.
	// Интерпретируется как коэффициент того, какую часть суммы клиент должен оплатить.
	// По-умолчанию предполагается 1. Значение <1 указывает на скидку оплаты.
	ЗаписьXML.ЗаписатьНачалоЭлемента("WAGES_SHARE");
    ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("1"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// WAGES_SHARE
	
	// Индивидуальный коэффициент скидки на запчасти в формате десятичной дроби. Будет
	// интерпретироваться как коэффициент того, какую часть стоимости запчастей клиент должен оплатить.
	// По-умолчанию предполагается 1. Значение < 1 указывает на скидку оплаты запчастей.
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARTS_SHARE");
    ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("1"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARTS_SHARE	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DISCOUNT	
	
	// Поле общих примечаний.
	ЗаписьXML.ЗаписатьНачалоЭлемента("MEMO");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураКонтрагента.Комментарий, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MEMO	
	
	// Дата последней модификации данных клиента в формате ISO-8601. Изменения элементов,
	// следующие за изменениями (элементов), которые автоматически нормально сгенерированы,
	// не перечисляются.
	Если ЗначениеЗаполнено(СтруктураКонтрагента.ДатаПоследнегоИзменения) Тогда
		ДатаПоследнегоИзменения	= СтруктураКонтрагента.ДатаПоследнегоИзменения;
	Иначе
		ДатаПоследнегоИзменения	= ТекущаяДата();
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("LAST_MODIFIED");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ДатаПоследнегоИзменения));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// LAST_MODIFIED
	
	//// Число посещений
	//ЗаписьXML.ЗаписатьНачалоЭлемента("NUMBER_OF_VISITS");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	//NUMBER_OF_VISITS
	
	// Даты посещений в формате ISO 8601.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DATE_OF_VISITS");
	
	// Может быть ссылкой на:
	//	FIRST	– первый визит.
	//	LAST	– последний визит.
	//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML("LAST"));
	
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DATE_OF_VISITS
		
	// Ссылки на все заказы бизнес партнера, обработанные к настоящему времени.
	Для Каждого ТекСтрока Из СтруктураКонтрагента.Заказы Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_REF");
		
		// Код страны в формате ISO 3166-alpha-3                          
		ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураКонтрагента.СтранаКонтрагента));
		                                                                  
		// Регион/Область
		ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураКонтрагента.РегионКонтрагента));
		
		// № дилера
		ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураКонтрагента.ДилерКонтрагента));	
		
		// Дата заказа в формате ISO 8601
		ЗаписьXML.ЗаписатьАтрибут("DATE",			СформироватьСтрокуXML(ТекСтрока.ДатаЗаказа));	
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.НомерЗаказа));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_REF	
	КонецЦикла;
	
	// Ссылка на счет-фактуру (счет). Может указывать на последние счета-фактуры (счета) бизнес партнеров.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("INVOICE_REF");
	
	// Код страны в формате ISO 3166-alpha-3                          
	//ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(""));
	                                                                  
	// Регион/Область
	//ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(""));
	
	// № дилера
	//ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(""));	
		
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// INVOICE_REF	
	
	// Ссылка на автомобиль клиента (№ шасси). Указывает на все АМ бизнес-партнера для 
	// информирования о собственности или праве реализации.
	Для Каждого ТекСтрока Из СтруктураКонтрагента.Заказы Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_REF");
		
		// Код страны в формате ISO 3166-alpha-3                          
		ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураКонтрагента.СтранаКонтрагента));
																		  
		// Регион/Область
		ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураКонтрагента.РегионКонтрагента));
		
		// № дилера
		ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураКонтрагента.ДилерКонтрагента));	
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.VIN));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// VEHICLE_REF
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// BUSINESS_PARTNER
	
КонецПроцедуры

// Процедура формирует данные для ссылки на контрагента
//
Процедура Сформировать_Customer_ref(ЗаписьXML, Параметры)
	
	СсылкаНаКонтрагента	= Неопределено;
	Параметры.Свойство("СсылкаНаКонтрагента", СсылкаНаКонтрагента);
	
	Если СсылкаНаКонтрагента=Неопределено
		ИЛИ СсылкаНаКонтрагента=Справочники.Контрагенты.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CUSTOMER_REF");
	
	ЗапросСвойств	= Новый Запрос();
	ЗапросСвойств.УстановитьПараметр("Ссылка",			СсылкаНаКонтрагента);
	ЗапросСвойств.Текст	= "ВЫБРАТЬ
	                   	  |	Контрагенты.Ссылка
	                   	  |ИЗ
	                   	  |	Справочник.Контрагенты КАК Контрагенты
	                   	  |ГДЕ
	                   	  |	Контрагенты.Ссылка = &Ссылка";
						  
	ВыборкаСвойств	= ЗапросСвойств.Выполнить().Выбрать();
	Если ВыборкаСвойств.Следующий() Тогда		
		
		// Код страны в формате ISO 3166-alpha-3
		Если ЗначениеЗаполнено(СтранаDMS) Тогда
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаDMS));	
		КонецЕсли;
		
		// Регион/Область
		Если ЗначениеЗаполнено(РегионDMS) Тогда
			ЗаписьXML.ЗаписатьАтрибут("REGION",	СформироватьСтрокуXML(РегионDMS));	
		КонецЕсли;
		
		// № дилера
		Если ЗначениеЗаполнено(ДилерDMS) Тогда
			ЗаписьXML.ЗаписатьАтрибут("DEALER",	СформироватьСтрокуXML(ДилерDMS));	
		КонецЕсли;		
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ВыборкаСвойств.Ссылка));
	Иначе
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СсылкаНаКонтрагента));
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьКонецЭлемента();	// CUSTOMER_REF	
КонецПроцедуры

// Процедура формирует данные для ссылки на автомобиль
//
Процедура Сформировать_Vehicle_ref(ЗаписьXML, Параметры)
	
	СсылкаНаАвтомобиль	= Неопределено;
	Параметры.Свойство("СсылкаНаАвтомобиль", СсылкаНаАвтомобиль);
	
	Если СсылкаНаАвтомобиль=Неопределено
		ИЛИ СсылкаНаАвтомобиль=Справочники.Автомобили.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_REF");
				
	// Код страны в формате ISO 3166-alpha-3
	Если ЗначениеЗаполнено(СтранаDMS) Тогда
		ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаDMS));	
	КонецЕсли;
		
	// Регион/Область
	Если ЗначениеЗаполнено(РегионDMS) Тогда
		ЗаписьXML.ЗаписатьАтрибут("REGION",	СформироватьСтрокуXML(РегионDMS));	
	КонецЕсли;
		
	// № дилера
	Если ЗначениеЗаполнено(ДилерDMS) Тогда
		ЗаписьXML.ЗаписатьАтрибут("DEALER",	СформироватьСтрокуXML(ДилерDMS));	
	КонецЕсли;		
		
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СсылкаНаАвтомобиль));
		
	ЗаписьXML.ЗаписатьКонецЭлемента();	// VEHICLE_REF	
КонецПроцедуры

// Процедура формирует данные автомобиля
// Параметры:
//	ЗаписьXML 				- запись, в которую сохраняются выводимые данные
//	СтруктураАвтомобиля		- структура выводимого автомобиля
//
Процедура Сформировать_Vehicle(ЗаписьXML, СтруктураАвтомобиля)
	
	Если ТипЗнч(СтруктураАвтомобиля)<>Тип("Структура") ИЛИ СтруктураАвтомобиля.Количество()=0 Тогда
		Возврат;		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE");
	
	СсылкаНаАвтомобиль	= СтруктураАвтомобиля.СсылкаНаАвтомобиль;
	
	// Код страны в формате ISO 3166-alpha-3                          
	ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураАвтомобиля.СтранаАвтомобиля));
	                                                                  
	// Регион/Область
	ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураАвтомобиля.РегионАвтомобиля));
	
	// № дилера
	ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураАвтомобиля.ДилерАвтомобиля));
	
	// № дилера
	ЗаписьXML.ЗаписатьАтрибут("BRAND_ID",		СформироватьСтрокуXML(СтруктураАвтомобиля.ПроизводительКод));
	
	// Свободный идентификатор в DMS, № шасси
	ЗаписьXML.ЗаписатьАтрибут("VID",			СформироватьСтрокуXML(СтруктураАвтомобиля.VIN));
	
	// Тип автомобиля. Допустимые значения:
	// PC – пассажирская машина (по-умолчанию).
	// TRUCK – коммерческий автомобиль.
	// ENGINE – промышленная машина.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураАвтомобиля.ТипАвтомобиля));
	
	// Атрибуты для определения содержимого объекта. Допустимые значения:
	//	CUSTOMERVEHICLE – автомобиль из БД автомобилей заказчика.
	//	NEWVEHICLE – БД новых автомобилей.
	//	USEDVEHICLE – БД подержанных автомобилей.
	//	OTHER – любая другая БД (используется для промышленных машин, объект может содержать 
	//			только небольшое количество элементов).
	ЗаписьXML.ЗаписатьАтрибут("CONTENT",			СформироватьСтрокуXML(СтруктураАвтомобиля.Содержание));
	
	// Идентификатор происхождения данных автомобиля. Допустимые значения:
	// USEDVEHICLE	– покупка подержанного автомобиля.
	// NEWVEHICLE	– покупка нового автомобиля.
	// WORKSHOP		– создано заказ-нарядом на ремонт.
	ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML(СтруктураАвтомобиля.Происхождение));
	
	// Производитель, название бренда. Этот элемент требуется сейчас только для подержанных автомобилей
	ЗаписьXML.ЗаписатьНачалоЭлемента("MANUFACTURER");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.Производитель));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MANUFACTURER
	
	//// Группа автомобилей. Используется только в отношении новых автомобилей
	//ЗаписьXML.ЗаписатьНачалоЭлемента("GROUP");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ГруппаАвтомобиля));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// GROUP
	
	// Код модели, например, 1J1RZ7
	ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_TYPE");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ВариантКомплектации));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// VEHICLE_TYPE
	
	// Описание модели в виде текста, например, Golf V6 4Motion. Для гарантии: описание типа и версии
	ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
	// Код языка в формате ISO 639
	ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.Наименование, Истина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
	
	// Цвет кузова
	Если ЗначениеЗаполнено(СтруктураАвтомобиля.ЦветКузова) Тогда
		
		// Код цвета. 6-ти значный код цвета, разделенный на компоненты,
		// которые могут иметь детальное описание.	
		ЗаписьXML.ЗаписатьНачалоЭлемента("ADI");		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("FINISH");
		
		// Двухзначный цветовой код
		Если ЗначениеЗаполнено(СсылкаНаАвтомобиль.ЦветКод) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("COLOUR_CODE");
			//ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML(""));
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.КодЦветаКузова));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// COLOUR_CODE
		КонецЕсли;
		
		// Описание/Цвет
		ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
		// Код языка в формате ISO 639
		ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.НаименованиеЦветаКузова));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
		
		//// Более высокая/низкая цена в EUR, только для новых АМ
		//ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
		//
		//// Детали валюты формате ISO 4217, если значение не в евро
		//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
		//
		//// Для интерпретации значения:
		//// NET		- Значение без налогов.
		//// GROSS	- Значение с налогами.
		//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
		//
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE	
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// FINISH
		
		//// Цвет крыши
		//ЗаписьXML.ЗаписатьНачалоЭлемента("TOP");

		//// Двухзначный цветовой код
		//ЗаписьXML.ЗаписатьНачалоЭлемента("COLOUR_CODE");
		//ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// COLOUR_CODE
		//
		//// Описание/Цвет
		//ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
		//// Код языка в формате ISO 639
		//ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
		//
		//// Более высокая/низкая цена в EUR, только для новых АМ
		//ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
		//
		//// Детали валюты формате ISO 4217, если значение не в евро
		//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
		//
		//// Для интерпретации значения:
		//// NET		- Значение без налогов.
		//// GROSS	- Значение с налогами.
		//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
		//
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE	
		//
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// TOP
		
		//// Код цвета интерьерного оборудования
		//ЗаписьXML.ЗаписатьНачалоЭлемента("INTERIOR");
		//
		//// Двухзначный цветовой код
		//ЗаписьXML.ЗаписатьНачалоЭлемента("COLOUR_CODE");
		//ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// COLOUR_CODE
		//
		//// Описание/Цвет
		//ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
		//// Код языка в формате ISO 639
		//ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
		//
		//// Более высокая/низкая цена в EUR, только для новых АМ
		//ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
		//
		//// Детали валюты формате ISO 4217, если значение не в евро
		//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
		//
		//// Для интерпретации значения:
		//// NET		- Значение без налогов.
		//// GROSS	- Значение с налогами.
		//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
		//
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE		

		//ЗаписьXML.ЗаписатьКонецЭлемента();	// INTERIOR		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// ADI
	КонецЕсли;
	
	
	// Год модели
	ЗаписьXML.ЗаписатьНачалоЭлемента("MY");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ГодВыпуска));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MY
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SALES_REF");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("0"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SALES_REF	
	
	// Номер шасси
	ЗаписьXML.ЗаписатьНачалоЭлемента("VIN");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.VIN));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// VIN
	
	//// Полезная нагрузка
	//ЗаписьXML.ЗаписатьНачалоЭлемента("PAYLOAD");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("0"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// PAYLOAD
	//
	//// Допустимый предельный вес
	//ЗаписьXML.ЗаписатьНачалоЭлемента("GVWR");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("0"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// GVWR
	
	// Данные двигателя
	ЗаписьXML.ЗаписатьНачалоЭлемента("ENGINE");

	Если СтруктураАвтомобиля.КодДвигателя<>Неопределено Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("ENGINE_CODE");
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.КодДвигателя));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// ENGINE_CODE
	КонецЕсли;
	
	// 7-значный серийный №двигателя
	ЗаписьXML.ЗаписатьНачалоЭлемента("ENGINE_NO");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.НомерДвигателя));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ENGINE_NO
	
	// Описание двигателя, например TDI, MPI, SDI…
	ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
	// Код языка в формате ISO 639
	ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ОписаниеДвигателя));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
	
	// Тип двигателя как дополнительное описание, может быть, например EM (emission motor), DM (diesel motor)…
	ЗаписьXML.ЗаписатьНачалоЭлемента("ENGINE_TYPE");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ТипДвигателя));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ENGINE_TYPE
			
	// Объем в кубических сантиметрах, например 3200.
	ЗаписьXML.ЗаписатьНачалоЭлемента("CAPACITY");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ОбъемДвигателя));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// CAPACITY

	// Мощность, например 177
	//ЗаписьXML.ЗаписатьНачалоЭлемента("KW");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// KW
		
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ENGINE
	
	//Данные трансмиссии
	ЗаписьXML.ЗаписатьНачалоЭлемента("TRANSMISSION");
		
	// Тип трансмиссии:
	// AWD	– для полноприводных АМ. 
	// MAIN	– основная.
	ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(СтруктураАвтомобиля.НаименованиеКПП));

	// Двух- или трехзначный код трансмиссии, например FMP или FGT, если тип атрибута это AWD и т.д.		
	Если СтруктураАвтомобиля.КодКПП<>Неопределено Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("TRANSMISSION_CODE");
		//ЗаписьXML.ЗаписатьАтрибут("ORIGIN",			СформироватьСтрокуXML(СтруктураАвтомобиля.ИсточникКодаКПП));
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.КодКПП));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// TRANSMISSION_CODE
	КонецЕсли;
	
	// Серийный №	
	ЗаписьXML.ЗаписатьНачалоЭлемента("TRANSMISSION_NO");
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.НомерКПП));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TRANSMISSION_NO
	
	// Описание трансмиссии, например Automatic
	ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
	ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.НаименованиеКПП));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
	
	// Классификация производителей, например 01M.Q для ERX или ESF трансмиссий
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TRANSMISSION_TYPE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TRANSMISSION_TYPE
		
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TRANSMISSION
	
	//Оборудование/Аксессуары
	Если ТипЗнч(СтруктураАвтомобиля.ОпцииАвтомобиля)=Тип("ТаблицаЗначений")
		И СтруктураАвтомобиля.ОпцииАвтомобиля.Количество()>0 тогда		
		
		Для Каждого ТекущаяОпция Из СтруктураАвтомобиля.ОпцииАвтомобиля Цикл			
			ЗаписьXML.ЗаписатьНачалоЭлемента("EQUIPMENT");
		
			// PR номер
			ЗаписьXML.ЗаписатьНачалоЭлемента("PR");
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущаяОпция.НомерОпции));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// PR
			
			// Описание/Цвет
			ЗаписьXML.ЗаписатьНачалоЭлемента("DESCRIPTION");
			// Код языка в формате ISO 639
			ЗаписьXML.ЗаписатьАтрибут("LANG",			СформироватьСтрокуXML("RU"));
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущаяОпция.НаименованиеОпции));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// DESCRIPTION
			
			// Цена (может быть отрицательной) только для новых АМ
			ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
			
			// Детали валюты формате ISO 4217, если значение не в евро
			ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(ТекущаяОпция.ВалютаЦеныОпции));
			
			// Для интерпретации значения:
			// NET		- Значение без налогов.
			// GROSS	- Значение с налогами
			ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(ТекущаяОпция.ТипЦеныОпции));
			
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекущаяОпция.ЦенаОпции));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE	
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// EQUIPMENT
			
			Прервать;
		
		КонецЦикла;	
	КонецЕсли;
	
	// Данные регистрации
	Если ЗначениеЗаполнено(СтруктураАвтомобиля.Техпаспорт)
		ИЛИ ЗначениеЗаполнено(СтруктураАвтомобиля.ГосНомер) Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("REGISTRATION");

		// № регистрационного документа АМ
		Если ЗначениеЗаполнено(СтруктураАвтомобиля.Техпаспорт) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("LETTER");
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.Техпаспорт));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// LETTER
		КонецЕсли;
		
		//// Дата первой регистрации в формате ISO 8601
		//ЗаписьXML.ЗаписатьНачалоЭлемента("LICENSE_DATE");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// LICENSE_DATE
		
		// Регистрационный №
		Если ЗначениеЗаполнено(СтруктураАвтомобиля.ГосНомер) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("LICENSE_TAGS");
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.ГосНомер));
			ЗаписьXML.ЗаписатьКонецЭлемента();	// LICENSE_TAGS
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// REGISTRATION
	КонецЕсли;
	
	//// Этот элемент будет покрывать все расчетные данные (финансовые)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("ACCOUNTANCY");

	//// DC данные счет-фактуры (счета) в формате ISO 8601
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DATE_DC");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DATE_DC
	//
	//ЗаписьXML.ЗаписатьНачалоЭлемента("PRICE");
	//
	//// Детали валюты формате ISO 4217, если значение не в евро
	//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
	//
	//// Для интерпретации значения:
	//// NET		- Значение без налогов.
	//// GROSS	- Значение с налогами
	//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
	//
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// PRICE
	//
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TRADE_IN");
	//
	//// Детали валюты формате ISO 4217, если значение не в евро
	//ЗаписьXML.ЗаписатьАтрибут("CURRENCY",			СформироватьСтрокуXML(""));
	//
	//// Для интерпретации значения:
	//// NET		- Значение без налогов.
	//// GROSS	- Значение с налогами
	//ЗаписьXML.ЗаписатьАтрибут("TYPE",			СформироватьСтрокуXML(""));
	//
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TRADE_IN
	//
	//// Код налога
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TAX_CODE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("VAT"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TAX_CODE	
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// ACCOUNTANCY	
	
	// Пробег или срок службы, в зависимости от UNIT и TAG
	Если ЗначениеЗаполнено(СтруктураАвтомобиля.Пробег) Тогда
		
		// Итория
		ЗаписьXML.ЗаписатьНачалоЭлемента("HISTORY");		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ODOMETER");
		
		// Задаются единицы измерения значения. Допустимые значения:
		// KM	- километр.
		// MI	- миля.
		// HRS	- час
		ЗаписьXML.ЗаписатьАтрибут("UNIT",			СформироватьСтрокуXML("KM"));
		
		// TOTAL	– общий пробег. (согласно заказчику)
		// CURRENT	– текущий пробег.
		ЗаписьXML.ЗаписатьАтрибут("TAG",			СформироватьСтрокуXML("CURRENT"));
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СтруктураАвтомобиля.Пробег));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// ODOMETER
		
		//// Дата следующего обслуживания в сервисе в формате ISO 8601
		//ЗаписьXML.ЗаписатьНачалоЭлемента("HU");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// HU
		//
		//// Дата следующего контроля выхлопных газов в формате ISO 8601
		//ЗаписьXML.ЗаписатьНачалоЭлемента("AU");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// AU
		//
		//// № предыдущего владельца
		//ЗаписьXML.ЗаписатьНачалоЭлемента("OWNER_CNT");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// OWNER_CNT
		//
		//// Аварийная поломка
		//ЗаписьXML.ЗаписатьНачалоЭлемента("ACCIDENT");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// ACCIDENT
		//
		//// Дата последнего техобслуживания формате ISO 8601
		//ЗаписьXML.ЗаписатьНачалоЭлемента("LAST_MAINTENANCE");
		//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
		//ЗаписьXML.ЗаписатьКонецЭлемента();	// LAST_MAINTENANCE		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// HISTORY
	КонецЕсли;
		
	//// Иная информация
	//// 1. Существует
	//// 0. Не существует
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SHORTCUTS");

	//// Безаварийный (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("ACCIDENT_FREE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// ACCIDENT_FREE
	//
	//// Автоматическая трансмиссия (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("AT");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// AT
	//
	//// Полный привод (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("AWD");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// AWD
	//
	//// Количество дверей
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DOORS");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DOORS
	//
	//// Лизинг АМ (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("LEASING");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// LEASING
	//
	//// Оперативная (0/1) Boolean
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DRIVINGREADY");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DRIVINGREADY
	//
	//// Демонстрационная (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("DEMONSTRATION_CAR");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// DEMONSTRATION_CAR
	//
	//// Такси (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TAXI");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TAXI
	//
	//// Стандартные шины (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TIRE");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TIRE
	//
	//// Жёсткая буксирная балка (0/1
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TRAILER_HITCH");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TRAILER_HITCH
	//
	//// Печать Ассоциации германских производителей моторов (0/1)
	//ЗаписьXML.ЗаписатьНачалоЭлемента("ZDK");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// ZDK
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SHORTCUTS	
	
	// Дата последней модификации данных АМ в формате ISO 8601.
	// Модификация последующих автоматически создаваемых элементов не записывается
	Если ЗначениеЗаполнено(СсылкаНаАвтомобиль.Дата) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("LAST_MODIFIED");
	    ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(СсылкаНаАвтомобиль.Дата));	
		ЗаписьXML.ЗаписатьКонецЭлемента();	// LAST_MODIFIED
	КонецЕсли;
	
	// Стоянка или склад, где АМ припаркованы.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("LOCATION");
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(""));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// LOCATION
	
	Для Каждого ТекСтрока Из СтруктураАвтомобиля.Заказы Цикл
		// Номера связанных заказов, может быть список текущих заказов
		ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_REF");

		// Код страны в формате ISO 3166-alpha-3                          
		ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураАвтомобиля.СтранаАвтомобиля));
																		  
		// Регион/Область
		ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураАвтомобиля.РегионАвтомобиля));
		
		// № дилера
		ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураАвтомобиля.ДилерАвтомобиля));
		
		// Дата заказа в формате ISO 8601
		ЗаписьXML.ЗаписатьАтрибут("DATE",			СформироватьСтрокуXML(ТекСтрока.ДатаЗаказа));
		
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.НомерЗаказа));
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_REF
		
		// Ссылка на заказчика / его №. Должна указывать на владельца и контактную персону, оплатившую заказ
		Сформировать_Customer_ref(ЗаписьXML, Новый Структура("СсылкаНаКонтрагента", ТекСтрока.НомерКонтрагента));
		
		// DMSBBFLOW выдает ошибку при указании нескольких ссылок на заказ и покупателя
		Прервать;
		
	КонецЦикла;
	
	//// Ссылка на счет-фактуру (счет). Может указывать на счет-фактуры (счета), связанные с автомобилем
	//ЗаписьXML.ЗаписатьНачалоЭлемента("INVOICE_REF");

	//// Код страны в формате ISO 3166-alpha-3                          
	//ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураАвтомобиля.СтранаАвтомобиля));
	//																  
	//// Регион/Область
	//ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураАвтомобиля.РегионАвтомобиля));
	//
	//// № дилера
	//ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураАвтомобиля.ДилерАвтомобиля));
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// INVOICE_REF	
	//
	//// Код продавца.
	//ЗаписьXML.ЗаписатьНачалоЭлемента("SALESPERSON_REF");

	//// Код страны в формате ISO 3166-alpha-3                          
	//ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтруктураАвтомобиля.СтранаАвтомобиля));
	//																  
	//// Регион/Область
	//ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(СтруктураАвтомобиля.РегионАвтомобиля));
	//
	//// № дилера
	//ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(СтруктураАвтомобиля.ДилерАвтомобиля));
	//
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// SALESPERSON_REF
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// VEHICLE
	
КонецПроцедуры

// Процедура формирует сообщение об ошибке в контексте ответа серверу
//
Процедура Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса, Уровень="Information", КодОшибки="")
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Возврат;		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("EXCEPTION");
	ЗаписьXML.ЗаписатьНачалоЭлемента("ERROR");
	ЗаписьXML.ЗаписатьАтрибут("IDREFS", ИдЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("LEVEL",	СформироватьСтрокуXML("Information"));
	
	Если НЕ ПустаяСтрока(КодОшибки) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("CODE");
		//ЗаписьXML.ЗаписатьАтрибут("SRC",	СформироватьСтрокуXML(""));
		ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("DMS"+КодОшибки));
		ЗаписьXML.ЗаписатьКонецЭлемента();	// CODE
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("TEXT");
	ЗаписьXML.ЗаписатьАтрибут("LANG",	СформироватьСтрокуXML("RU"));
	ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекстОшибки));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// TEXT
	
	//ЗаписьXML.ЗаписатьНачалоЭлемента("TOPIC");
	//ЗаписьXML.ЗаписатьАтрибут("REF",	СформироватьСтрокуXML("OIID"));
	//ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML("2"));
	//ЗаписьXML.ЗаписатьКонецЭлемента();	// TOPIC
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// ERROR
	ЗаписьXML.ЗаписатьКонецЭлемента();	// EXCEPTION
	
КонецПроцедуры

// Функция формирует ответ на полученный от DMSBB метод List
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодList(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
	ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
	ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
	ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);		
	ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
	ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
	ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
	ПараметрыЗапроса	= Новый Структура("Страна, Регион, Дилер", "", "", "");
	Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
		ПараметрыЗапроса.Вставить("Страна", ТекСтрока.СтранаDMS);
		ПараметрыЗапроса.Вставить("Регион", ТекСтрока.РегионDMS);
		ПараметрыЗапроса.Вставить("Дилер", ТекСтрока.ДилерDMS);
		Прервать;
	КонецЦикла;		
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" И ТекущееИмяЗапроса="LISTENTRIES" Тогда
		
		тзЗаказов	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзЗаказов Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_REF");
			
			// Код страны в формате ISO 3166-alpha-3
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(ТекСтрока.Страна));
			
			// Регион/Область
			ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(ТекСтрока.Регион));
			
			// № дилера
			ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ТекСтрока.Дилер));
			
			// Дата создания заказа в формате ISO 8601
			ЗаписьXML.ЗаписатьАтрибут("DATE",			СформироватьСтрокуXML(Формат(ТекСтрока.Дата, "ДФ=yyyy-MM-dd")));
			
			// № заказа или идентификатор
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.Номер, Истина, "ORDER_NO"));
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_REF
		КонецЦикла;				
		
	ИначеЕсли ТекущийТипЗапроса="WORKSHOPORDER" И ТекущееИмяЗапроса="LISTORDER" Тогда	
		
		тзЗаказов	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзЗаказов Цикл

			СтруктураЗаказа	= ПолучитьСтруктуруЗаказа(Новый Структура("Номер", ТекСтрока.Номер));
			Сформировать_Order(ЗаписьXML, СтруктураЗаказа);			
			
		КонецЦикла;
		
	ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" И ТекущееИмяЗапроса="LISTENTRIES" Тогда	
		
		тзКонтрагентов	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзКонтрагентов Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("CUSTOMER_REF");
			
			// Код страны в формате ISO 3166-alpha-3
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(ТекСтрока.Страна));
			
			// Регион/Область
			ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(ТекСтрока.Регион));
			
			// № дилера
			ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ТекСтрока.Дилер));
			
			// № заказа или идентификатор
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.Код, Истина, "BUSINESSPARTNER_NO"));
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// CUSTOMER_REF
		КонецЦикла;		
		
	ИначеЕсли ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" И ТекущееИмяЗапроса="LISTENTRIES" Тогда	
		
		тзАвтомобилей	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзАвтомобилей Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_REF");
			
			// Код страны в формате ISO 3166-alpha-3
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(ТекСтрока.Страна));
			
			// Регион/Область
			ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(ТекСтрока.Регион));
			
			// № дилера
			ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ТекСтрока.Дилер));
			
			// № заказа или идентификатор
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.VIN));
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// VEHICLE_REF
		КонецЦикла;	
		
	ИначеЕсли  ТекущийТипЗапроса="SPAREPARTORDER" И ТекущееИмяЗапроса="LISTENTRIES" Тогда
		
		тзЗаказов	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзЗаказов Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_REF");
			
			// Код страны в формате ISO 3166-alpha-3
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(ТекСтрока.Страна));
			
			// Регион/Область
			ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(ТекСтрока.Регион));
			
			// № дилера
			ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ТекСтрока.Дилер));
			
			// Дата создания заказа в формате ISO 8601
			ЗаписьXML.ЗаписатьАтрибут("DATE",			СформироватьСтрокуXML(Формат(ТекСтрока.Дата, "ДФ=yyyy-MM-dd")));
			
			// № заказа или идентификатор
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекСтрока.Номер, Истина, "ORDER_NO"));
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// ORDER_REF
		КонецЦикла;
		
	ИначеЕсли  ТекущийТипЗапроса="SPAREPARTORDER" И ТекущееИмяЗапроса="LISTORDER" Тогда	
		
		тзЗаказов	= ПолучитьСписокОбъектов(ПараметрыЗапроса, ИмяЗапроса, ТипЗапроса);		
		Для Каждого ТекСтрока Из тзЗаказов Цикл

			СтруктураЗаказа	= ПолучитьСтруктуруЗаказа(Новый Структура("Номер, ТипЗапроса", ТекСтрока.Номер, ТипЗапроса));
			Сформировать_Order(ЗаписьXML, СтруктураЗаказа);			
			
		КонецЦикла;		
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE	
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);
	
	Возврат ТекстОтвета;	
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод Get
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодGet(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета	= "";		
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML	= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		НомерЗаказа		= "";
		Ограничение		= "";
		Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
			НомерЗаказа	= ТекСтрока.Номер;
			Ограничение	= ТекСТрока.Ограничение;
			Прервать;
		КонецЦикла;
		
		ПараметрыПреобразования	= Новый Структура();
		ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
		НомерЗаказа				= ПривестиКТипу(СокрЛП(НомерЗаказа), "Строка", ПараметрыПреобразования);		
		
		СтруктураЗаказа	= ПолучитьСтруктуруЗаказа(Новый Структура("Номер, ТипЗапроса", НомерЗаказа, ТипЗапроса));
		Если СтруктураЗаказа<>Неопределено И СтруктураЗаказа.Количество()>0 Тогда
			СтруктураЗаказа.Вставить("Ограничение", Ограничение);
		КонецЕсли;
		
		Сформировать_Order(ЗаписьXML, СтруктураЗаказа);
		
		Если ТекущееИмяЗапроса="GETORDER" Тогда
			Сформировать_Order_Item(ЗаписьXML, СтруктураЗаказа);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE				
		
	ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда
		ТекстОшибки	= "";
		КодОшибки	= "";
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		ИмяПоляПоиска		= Неопределено;
		ЗначениеПоляПоиска	= Неопределено;
		Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
			ИмяПоляПоиска		= ТекСтрока.ИмяПоляПоиска;
			ЗначениеПоляПоиска	= ТекСтрока.ЗначениеПоляПоиска;
			Прервать;
		КонецЦикла;
		
		МассивСтруктур	= ПолучитьСтруктуруКонтрагента(Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", ИмяПоляПоиска, ЗначениеПоляПоиска));
		Если МассивСтруктур.Количество()=0 Тогда
			ТекстОшибки	= "Не удалось найти контрагента по указаному полю поиска.";
			КодОшибки	= "1111I";
		Иначе
			Для Каждого ТекущаяСтруктураКонтрагента Из МассивСтруктур Цикл
				Сформировать_Business_Partner(ЗаписьXML, ТекущаяСтруктураКонтрагента);
			КонецЦикла;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса, "Warning", КодОшибки);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
		
	ИначеЕсли ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		ИмяПоляПоиска		= Неопределено;
		ЗначениеПоляПоиска	= Неопределено;
		Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
			ИмяПоляПоиска		= ТекСтрока.ИмяПоляПоиска;
			ЗначениеПоляПоиска	= ТекСтрока.ЗначениеПоляПоиска;
			Прервать;
		КонецЦикла;
		
		СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", ИмяПоляПоиска, ЗначениеПоляПоиска); 
		МассивСтруктур		= ПолучитьСтруктуруАвтомобиля(СтруктураПоиска);
		
		Если МассивСтруктур.Количество()=0 Тогда
			ТекстОшибки	= "Не удалось найти автомобиль по указаному полю поиска.";
			КодОшибки	= "1111I";
		Иначе
			Для Каждого ТекущаяСтруктураАвтомобиля Из МассивСтруктур Цикл
				Сформировать_Vehicle(ЗаписьXML, ТекущаяСтруктураАвтомобиля);
			КонецЦикла;
		КонецЕсли;		
	
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
			Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса, "Warning", КодОшибки);
		КонецЕсли;		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
		
	ИначеЕсли ТекущийТипЗапроса="SPAREPARTORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		НомерЗаказа		= "";
		Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
			НомерЗаказа	= ТекСтрока.Номер;
			Прервать;
		КонецЦикла;
		
		ПараметрыПреобразования	= Новый Структура();
		ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
		НомерЗаказа				= ПривестиКТипу(СокрЛП(НомерЗаказа), "Строка", ПараметрыПреобразования);		
		
		СтруктураЗаказа	= ПолучитьСтруктуруЗаказа(Новый Структура("Номер, ТипЗапроса", НомерЗаказа, ТипЗапроса));
		Сформировать_Order(ЗаписьXML, СтруктураЗаказа);
		
		Если ТекущееИмяЗапроса="GETORDER" Тогда
			Сформировать_Order_Item(ЗаписьXML, СтруктураЗаказа);
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE	
		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);
	
	Возврат ТекстОтвета;	
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод New
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодNew(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
		
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		
		Если СоздаватьНовыйЗаказ Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");	
		Иначе
			ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
			ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
			ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
			ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
			Возврат ТекстОтвета;
		КонецЕсли;
				
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаАвтомобиль	= Неопределено;
			СсылкаНаКонтрагента	= Неопределено;
						
			ОпцияЗаказа		= ВРег(СтрокаШапкаЗаказа.Опция);
			СтранаЗаказа	= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа	= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа		= СтрокаШапкаЗаказа.ДилерDMS;
			
			customer_ref	= СокрЛП(СтрокаШапкаЗаказа.customer_ref);
			vehicle_ref		= СокрЛП(СтрокаШапкаЗаказа.vehicle_ref);
			vin				= СокрЛП(СтрокаШапкаЗаказа.vin);
			license_tags	= СокрЛП(СтрокаШапкаЗаказа.license_tags);
			order_type		= СтрокаШапкаЗаказа.order_type;			
						
			Если НЕ ПустаяСтрока(customer_ref) Тогда
				СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "ACCOUNT_NO", customer_ref); 
				МассивСтруктур		= ПолучитьСтруктуруКонтрагента(СтруктураПоиска);
				Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
					Если НЕ обЗначениеНеЗаполнено(ТекущаяСтруктура.КонтрагентСсылка) Тогда
						СсылкаНаКонтрагента	= ТекущаяСтруктура.КонтрагентСсылка;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;			
			
			Если НЕ ПустаяСтрока(vehicle_ref) Тогда
				СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "VIN", vehicle_ref); 
				МассивСтруктур		= ПолучитьСтруктуруАвтомобиля(СтруктураПоиска);
				Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
					Если НЕ обЗначениеНеЗаполнено(ТекущаяСтруктура.СсылкаНаАвтомобиль) Тогда
						СсылкаНаАвтомобиль	= ТекущаяСтруктура.СсылкаНаАвтомобиль;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;			
			
			Если обЗначениеНеЗаполнено(СсылкаНаАвтомобиль) И (НЕ ПустаяСтрока(vin)) Тогда
				СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "VIN", vin); 
				МассивСтруктур		= ПолучитьСтруктуруАвтомобиля(СтруктураПоиска);
				Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
					Если НЕ обЗначениеНеЗаполнено(ТекущаяСтруктура.СсылкаНаАвтомобиль) Тогда
						СсылкаНаАвтомобиль	= ТекущаяСтруктура.СсылкаНаАвтомобиль;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(СсылкаНаАвтомобиль) И (НЕ ПустаяСтрока(license_tags)) Тогда
				СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "LICENSE_TAGS", license_tags); 
				МассивСтруктур		= ПолучитьСтруктуруАвтомобиля(СтруктураПоиска);
				Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
					Если НЕ обЗначениеНеЗаполнено(ТекущаяСтруктура.СсылкаНаАвтомобиль) Тогда
						СсылкаНаАвтомобиль	= ТекущаяСтруктура.СсылкаНаАвтомобиль;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;
						
			ТекОбъект						= Документы.ЗаказНаряд.СоздатьДокумент();
			ТекОбъект.УстановитьНовыйНомер();
			ТекОбъект.Дата					= ТекущаяДата();
			ТекОбъект.ОбменДанными.Загрузка	= Истина;
			
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаКонтрагента) Тогда
				ТекОбъект.Контрагент	= СсылкаНаКонтрагента;
			КонецЕсли;
			
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаАвтомобиль) Тогда
				ТекОбъект.Автомобиль			= СсылкаНаАвтомобиль;
			КонецЕсли;
			
			ТекОбъект.ДополнительныеСвойства.Вставить("ОтправлятьЗаказВDMSBB", Ложь);
			
			Попытка
				ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;
			
			Если ПустаяСтрока(ТекОбъект) Тогда
				СтруктураПоиска		= Новый Структура("СсылкаНаЗаказ, ТипЗапроса", ТекОбъект.Ссылка, ТекущийТипЗапроса);
				СтруктураОбъекта	= ПолучитьСтруктуруЗаказа(СтруктураПоиска);
				Сформировать_Order(ЗаписьXML, СтруктураОбъекта);	
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТекущийТипЗапроса="SPAREPARTORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		
		Если СоздаватьНовыйЗаказ Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");	
		Иначе
			ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
			ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
			ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
			ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
			Возврат ТекстОтвета;
		КонецЕсли;		
		
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаАвтомобиль	= Неопределено;
			СсылкаНаКонтрагента	= Неопределено;
			
			ОпцияЗаказа		= ВРег(СтрокаШапкаЗаказа.Опция);
			СтранаЗаказа	= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа	= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа		= СтрокаШапкаЗаказа.ДилерDMS;
			
			customer_ref	= СтрокаШапкаЗаказа.customer_ref;
			order_type		= СтрокаШапкаЗаказа.order_type;
			
			Если НЕ ПустаяСтрока(customer_ref) Тогда
				СтруктураПоиска		= Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "ACCOUNT_NO", customer_ref); 
				МассивСтруктур		= ПолучитьСтруктуруКонтрагента(СтруктураПоиска);
				Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
					Если НЕ обЗначениеНеЗаполнено(ТекущаяСтруктура.КонтрагентСсылка) Тогда
						СсылкаНаКонтрагента	= ТекущаяСтруктура.КонтрагентСсылка;
						Прервать;
					КонецЕсли;
				КонецЦикла;				
			КонецЕсли;						
			
			ТекОбъект						= Документы.ЗаказПокупателя.СоздатьДокумент();
			ТекОбъект.УстановитьНовыйНомер();
			ТекОбъект.Дата					= ТекущаяДата();
			ТекОбъект.ОбменДанными.Загрузка	= Истина;
			
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаКонтрагента) Тогда
				ТекОбъект.Контрагент	= СсылкаНаКонтрагента;
			КонецЕсли;
			
			ТекОбъект.ДополнительныеСвойства.Вставить("ОтправлятьЗаказВDMSBB", Ложь);
			
			Попытка
				ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;
			
			Если ПустаяСтрока(ТекОбъект) Тогда
				СтруктураПоиска		= Новый Структура("СсылкаНаЗаказ, ТипЗапроса", ТекОбъект.Ссылка, ТекущийТипЗапроса);
				СтруктураОбъекта	= ПолучитьСтруктуруЗаказа(СтруктураПоиска);
				Сформировать_Order(ЗаписьXML, СтруктураОбъекта);	
			КонецЕсли;	
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;	
		
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод NewEntry
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодNewEntry(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
	ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
	ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
	ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
	ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));	
	
	Если ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда		
		
		Для Каждого СтрокаАвтомобиль Из ДеревоЗапроса.Строки Цикл
			
			СтранаАвтомобиля= СокрЛП(СтрокаАвтомобиль.СтранаDMS);
			РегионАвтомобиля= СокрЛП(СтрокаАвтомобиль.РегионDMS);
			ДилерАвтомобиля	= СокрЛП(СтрокаАвтомобиль.ДилерDMS);
			
			vehicle_type		= СокрЛП(СтрокаАвтомобиль.vehicle_type);
			engine_code			= СокрЛП(СтрокаАвтомобиль.engine_code);
			transmission_type	= СокрЛП(СтрокаАвтомобиль.transmission_type);
			transmission_code	= СокрЛП(СтрокаАвтомобиль.transmission_code);			
			manufacturer		= СокрЛП(СтрокаАвтомобиль.manufacturer);
			description			= СокрЛП(СтрокаАвтомобиль.description);
			my					= ПривестиКТипу(СокрЛП(СтрокаАвтомобиль.my), "Дата");
			license_tags		= СокрЛП(СтрокаАвтомобиль.license_tags);					
			odometer_tag		= СокрЛП(СтрокаАвтомобиль.odometer_tag);
			odometer			= ПривестиКТипу(СокрЛП(СтрокаАвтомобиль.odometer), "Число");
			hu					= СокрЛП(СтрокаАвтомобиль.hu);
			au					= СокрЛП(СтрокаАвтомобиль.au);

			ТекОбъект			= Справочники.Автомобили.СоздатьЭлемент();
			ТекОбъект.Заполнить(Неопределено);
			ТекОбъект.ОбменДанными.Загрузка	= Истина;
			ТекОбъект.УстановитьНовыйКод();
			
			ПараметрыДляПреобразования	= Новый Структура();
			ПараметрыДляПреобразования.Вставить("Наименование", transmission_type); 
			СсылкаНаТипКПП	= ПривестиКТипу(transmission_code, "СправочникСсылка.ТипыКПП", ПараметрыДляПреобразования);
			
			ПараметрыДляПреобразования	= Новый Структура();
			ПараметрыДляПреобразования.Вставить("ТипКПП",				СсылкаНаТипКПП);
			ПараметрыДляПреобразования.Вставить("Модель", 				ТекОбъект.Модель);
			ПараметрыДляПреобразования.Вставить("СоздаватьНовыйОбъект", СоздаватьНовыйОбъект);			
			СсылкаНаВариантКомплектации	= ПривестиКТипу(vehicle_type, "СправочникСсылка.ВариантыКомплектации", ПараметрыДляПреобразования);
			
			ТекОбъект.НомерДвигателя		= engine_code;
			ТекОбъект.ТипКПП				= СсылкаНаТипКПП;
			Если ЗначениеЗаполнено(СсылкаНаВариантКомплектации) Тогда
				ТекОбъект.ВариантКомплектации	= СсылкаНаВариантКомплектации;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(description) Тогда
				ТекОбъект.Наименование	= description;
			Иначе
				ТекОбъект.Наименование	= engine_code;
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(manufacturer) Тогда
				Если ЗначениеЗаполнено(ТекОбъект.Модель) Тогда
					МодельОбъект	= ТекОбъект.Модель.ПолучитьОбъект();
				Иначе
					МодельОбъект	= Справочники.Модели.СоздатьЭлемент();
					МодельОбъект.МаскаVIN			= ТекОбъект.VIN;
					Если ПустаяСтрока(description) Тогда
						НаименованиеМодели	= ТекОбъект.Наименование;
					Иначе
						НаименованиеМодели	= description;
					КонецЕсли;
					МодельОбъект.Наименование		= НаименованиеМодели;
					МодельОбъект.НаименованиеПолное	= НаименованиеМодели; 
					МодельОбъект.ВалютаУчета		= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
					МодельОбъект.Заполнить(Неопределено);
					МодельОбъект.ОбменДанными.Загрузка	= Истина;
					МодельОбъект.УстановитьНовыйКод();				КонецЕсли;
				
				Если МодельОбъект<>Неопределено Тогда
					МодельОбъект.Производитель	= manufacturer;
					
					Попытка
						МодельОбъект.Записать();
						СсылкаНаМодель	= МодельОбъект.Ссылка;
					Исключение
						СсылкаНаМодель	= Неопределено;
						#Если Клиент Тогда							
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
					
					Если СсылкаНаМодель<>Неопределено Тогда
						ТекОбъект.Модель	= СсылкаНаМодель;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(my) Тогда
				ТекОбъект.ГодВыпуска	= my;
			КонецЕсли;
			
			Попытка
				ТекОбъект.Записать();
				СсылкаНаАвтомобиль	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;

			//Пробег
			Пробег		= Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ТекОбъект.Ссылка, odometer, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			//ГосНомер
			ГосНомер	= Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ТекОбъект.Ссылка, license_tags, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);			
			
			Если ЗначениеЗаполнено(engine_code) Тогда
				УстановитьСвойство(СсылкаНаАвтомобиль, СвойствоКодДвигателяАвтомобиля,	engine_code);
			КонецЕсли;
			Если ЗначениеЗаполнено(transmission_code) Тогда
				УстановитьСвойство(СсылкаНаАвтомобиль, СвойствоКодКППАвтомобиля,		transmission_code);
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_REF");            
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE", СформироватьСтрокуXML(СтранаАвтомобиля));
			ЗаписьXML.ЗаписатьАтрибут("REGION", СформироватьСтрокуXML(РегионАвтомобиля));
			ЗаписьXML.ЗаписатьАтрибут("DEALER", СформироватьСтрокуXML(ДилерАвтомобиля));
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекОбъект.VIN));
			ЗаписьXML.ЗаписатьКонецЭлемента();	//VEHICLE_REF
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
			Прервать;
		КонецЦикла;
			
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);						
		
	ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда		
		
		ПараметрыПреобразования		= Новый Структура();
		ПараметрыПреобразования.Вставить("Имя", "");
		ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);		
		
		Для Каждого СтрокаКонтрагент Из ДеревоЗапроса.Строки Цикл
			СсылкаНаКонтрагента		= Неопределено;
			СтранаКонтрагента		= СтрокаКонтрагент.СтранаDMS;
			РегионКонтрагента		= СтрокаКонтрагент.РегионDMS;
			ДилерКонтрагента		= СтрокаКонтрагент.ДилерDMS;
			ОбластьДействия			= СтрокаКонтрагент.СсылкаЗапроса;
			КодКонтрагентаСтрокой	= СтрокаКонтрагент.pid;
			ТипКонтрагента			= СтрокаКонтрагент.partner_type;
			СтатусКонтрагента		= СтрокаКонтрагент.partner_status;
							
			НомерЗаписи	= СтрокаКонтрагент.account_no;					
			ТекОбъект	= Справочники.Контрагенты.СоздатьЭлемент();
			ТекОбъект.Заполнить(Неопределено);
			ТекОбъект.ОбменДанными.Загрузка	= Истина;
			ТекОбъект.УстановитьНовыйКод();
			
			Если ТипКонтрагента="SUPPLIER" Тогда
				ТекОбъект.ВидКонтрагента	= Перечисления.ВидыКонтрагентов.Поставщик;	
			ИначеЕсли ТипКонтрагента="CUSTOMER" Тогда
				ТекОбъект.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Покупатель;	
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(СтрокаКонтрагент.matchcode) Тогда
				ПараметрыПреобразования		= Новый Структура();
				ПараметрыПреобразования.Вставить("Имя", "");
				ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
				ТекОбъект.Наименование	= ПривестиКТипу(СтрокаКонтрагент.matchcode, "Строка", ПараметрыПреобразования);					
			КонецЕсли;
			
			Если ТипЗнч(СтрокаКонтрагент.ТаблицаИмен)=Тип("ТаблицаЗначений") Тогда
				ТекИмя				= "";
				ТекОтчество			= "";
				ТекФамилия			= "";
				Для Каждого СтрокаИмя Из СтрокаКонтрагент.ТаблицаИмен Цикл
					Если СтрокаИмя.Тип="FIRST" Тогда							
						ТекИмя		= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
					ИначеЕсли СтрокаИмя.Тип="MIDDLE" Тогда
						ПараметрыПреобразования		= Новый Структура();
						ТекОтчество	= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
					ИначеЕсли СтрокаИмя.Тип="LAST" Тогда
						ТекФамилия	= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
					КонецЕсли;
				КонецЦикла;
				
				Если НЕ ПустаяСтрока(ТекИмя) ИЛИ НЕ ПустаяСтрока(ТекФамилия) Тогда
					ТекОбъект.НаименованиеПолное	= ?(ПустаяСтрока(ТекФамилия),"",ТекФамилия+" ")+?(ПустаяСтрока(ТекИмя),"",ТекИмя+" ")+?(ПустаяСтрока(ТекОтчество),"",ТекОтчество);
					ТекОбъект.Наименование			= ТекОбъект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
			
			ДеньРождения	= ПривестиКТипу(СтрокаКонтрагент.date_of_birth, "Дата");
			Если ЗначениеЗаполнено(ДеньРождения) Тогда
				ТекОбъект.ДеньРождения	= ДеньРождения;	
			КонецЕсли;

			ДатаПоследнегоИзменения	= ПривестиКТипу(СтрокаКонтрагент.ДатаПоследнегоИзменения, "Дата");
			Если ЗначениеЗаполнено(ДатаПоследнегоИзменения) Тогда
				ТекОбъект.Дата	= ДатаПоследнегоИзменения;	
			КонецЕсли;
			
			Попытка
				ТекОбъект.Записать();
				СсылкаНаКонтрагента	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;			
			
			НаборКонтактнойИнформацииКонтрагента = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			ПочтовыйАдрес	= СтрокаКонтрагент.zip;
			ФактическийАдрес= ПривестиКТипу(СтрокаКонтрагент.adress, "Строка", ПараметрыПреобразования);
			Страна			= ПривестиКТипу(СтрокаКонтрагент.country, "Строка", ПараметрыПреобразования);
			Город			= ПривестиКТипу(СтрокаКонтрагент.city, "Строка", ПараметрыПреобразования);
			
			Если ТипЗнч(СтрокаКонтрагент.ТаблицаКонтактов)=Тип("ТаблицаЗначений") Тогда
				ТелефонРабочий	= "";
				ТелефонДомашний	= "";
				ЭлектронныйАдрес= "";
				
				Для Каждого СтрокаКонтакт Из СтрокаКонтрагент.ТаблицаКонтактов Цикл
					Если СтрокаКонтакт.Тип="PHONE" И СтрокаКонтакт.Признак="HOME" Тогда
						ТелефонДомашний	= ПривестиКТипу(СтрокаКонтакт.Значение, "Строка", ПараметрыПреобразования);
					ИначеЕсли СтрокаКонтакт.Тип="PHONE" И СтрокаКонтакт.Признак="BUSINESS" Тогда
						ТелефонРабочий	= ПривестиКТипу(СтрокаКонтакт.Значение, "Строка", ПараметрыПреобразования);	
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;

			Если НЕ ПустаяСтрока(ПочтовыйАдрес) Тогда
				НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
				НаборКонтактнойИнформацииКонтрагента.Прочитать();
				
				Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
					СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
					СтрокаНабора.Объект	= СсылкаНаКонтрагента;
					СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Адрес;
					СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.АдресПочтовый;
				Иначе
					СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
				КонецЕсли;
				
				СтрокаНабора.Представление	= ПочтовыйАдрес;
				Попытка
					НаборКонтактнойИнформацииКонтрагента.Записать();
				Исключение
					#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());						
					#КонецЕсли
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ФактическийАдрес) ИЛИ НЕ ПустаяСтрока(Город) ИЛИ НЕ ПустаяСтрока(Страна) Тогда
				НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
				НаборКонтактнойИнформацииКонтрагента.Прочитать();
				
				Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
					СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
					СтрокаНабора.Объект	= СсылкаНаКонтрагента;
					СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Адрес;
					СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.АдресФактический;
				Иначе
					СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
					СтрокаНабора.Представление	= ФактическийАдрес;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Страна) Тогда
					СтрокаНабора.Поле2			= Страна;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(Город) тогда
					СтрокаНабора.Поле4			= Город;
				КонецЕсли;
				
				Попытка
					НаборКонтактнойИнформацииКонтрагента.Записать();
				Исключение
					#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());						
					#КонецЕсли
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТелефонДомашний) Тогда
				НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
				НаборКонтактнойИнформацииКонтрагента.Прочитать();
				
				Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
					СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
					СтрокаНабора.Объект	= СсылкаНаКонтрагента;
					СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Телефон;
					СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
				Иначе
					СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
				КонецЕсли;
				
				СтрокаНабора.Представление	= ТелефонДомашний;
				Попытка
					НаборКонтактнойИнформацииКонтрагента.Записать();
				Исключение
					#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());						
					#КонецЕсли
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТелефонРабочий) Тогда
				НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
				НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
				НаборКонтактнойИнформацииКонтрагента.Прочитать();
				
				Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
					СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
					СтрокаНабора.Объект	= СсылкаНаКонтрагента;
					СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Телефон;
					СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
				Иначе
					СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
				КонецЕсли;
				
				СтрокаНабора.Представление	= ТелефонРабочий;
				Попытка
					НаборКонтактнойИнформацииКонтрагента.Записать();
				Исключение
					#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());						
					#КонецЕсли
				КонецПопытки;
			КонецЕсли;							
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
			
			МассивСтруктур	= ПолучитьСтруктуруКонтрагента(Новый Структура("СсылкаНаКонтрагента", СсылкаНаКонтрагента));	
			Для Каждого ТекущаяСтруктураКонтрагента Из МассивСтруктур Цикл
				Сформировать_Business_Partner(ЗаписьXML, ТекущаяСтруктураКонтрагента);
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		КонецЦикла;
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);		
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод Update
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодUpdate(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаЗаказ	= Неопределено;
			
			//НомерЗаказа			= СокрЛП(СтрокаШапкаЗаказа.Номер);
			ПараметрыПреобразования	= Новый Структура();
			ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
			НомерЗаказа				= ПривестиКТипу(СокрЛП(СтрокаШапкаЗаказа.Номер), "Строка", ПараметрыПреобразования);
						
			ОпцияЗаказа		= ВРег(СтрокаШапкаЗаказа.Опция);
			СтранаЗаказа	= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа	= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа		= СтрокаШапкаЗаказа.ДилерDMS;
			
			// Поиск указанного заказа
			ЗапросЗаказа	= Новый Запрос();
			ЗапросЗаказа.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
			
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
			                  	  |	Заказы.Ссылка КАК Ссылка
			                  	  |ИЗ
			                  	  |	Документ.ЗаказНаряд КАК Заказы
			                  	  |ГДЕ
			                  	  |	Заказы.Номер = &НомерЗаказа";
			
			ВыборкаЗапроса	= ЗапросЗаказа.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				СсылкаНаЗаказ	= ВыборкаЗапроса.Ссылка;						
			КонецЕсли;
			
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаЗаказ) Тогда
				Если СсылкаНаЗаказ.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
					ТекстОшибки	= "Заказ-наряд №"+СсылкаНаЗаказ.Номер+" выполнен и не подлежит редактированию.";
				ИначеЕсли СсылкаНаЗаказ.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
					ТекстОшибки	= "Заказ-наряд №"+СсылкаНаЗаказ.Номер+" закрыт и не подлежит редактированию.";	
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда				
				ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
				ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
				ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
				
				Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
				
				ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE				
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаЗаказ)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
				Попытка
					ТекОбъект	= СсылкаНаЗаказ.ПолучитьОбъект();
				Исключение
					Продолжить;
					#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());
					#КонецЕсли
				КонецПопытки;
			Иначе
				ТекОбъект	= Неопределено;
			КонецЕсли;
			
			Если ТекОбъект=Неопределено Тогда
				Продолжить;
			Иначе
				ТекОбъект.ОбменДанными.Загрузка	= Истина;
			КонецЕсли;
			
			Для Каждого ТекСтрока Из СтрокаШапкаЗаказа.Строки Цикл				
				
				// Работы
				Если ТекСтрока.labour_no<>Неопределено Тогда								
					oiid				= ТекСтрока.НомерСтроки;					
					type_of_family		= СокрЛП(ТекСтрока.type_of_family);
					repair_group		= СокрЛП(ТекСтрока.repair_group);
					illustration_number	= СокрЛП(ТекСтрока.illustration_number);
					task_number			= СокрЛП(ТекСтрока.task_number);
					index_number		= СокрЛП(ТекСтрока.index_number);
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					invoice_text		= ПривестиКТипу(СокрЛП(ТекСтрока.invoice_text), "Строка", ПараметрыПреобразования);
					
					lac					= СокрЛП(ТекСтрока.lac);
					wsc					= ПривестиКТипу(СокрЛП(ТекСтрока.wsc), "СправочникСсылка.Цеха");
					
					ПараметрыПреобразования.Очистить();
					ПараметрыПреобразования.Вставить("СоздаватьНовыйОбъект", СоздаватьНовыйОбъект);
					billing_factor		= ПривестиКТипу(СокрЛП(ТекСтрока.billing_factor), "СправочникСсылка.Нормочасы", ПараметрыПреобразования);
					
					timeunits_buy		= ПривестиКТипу(СокрЛП(ТекСтрока.timeunits_buy), "Число")/100;
					timeunits_sell		= ПривестиКТипу(СокрЛП(ТекСтрока.timeunits_sell), "Число")/100;
					mechanics			= ТекСтрока.mechanics;
					
					НомерРаботы			= ТекСтрока.labour_no;
					Если ПустаяСтрока(НомерРаботы) Тогда
						НомерРаботы	= НомерРаботы+repair_group+illustration_number+task_number+index_number;	
					КонецЕсли;
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Наименование", invoice_text);
					labour				= ПривестиКТипу(НомерРаботы, "СправочникСсылка.Автоработы", ПараметрыПреобразования);
					
					НайденнаяСтрока		= Неопределено;
					Если ОпцияЗаказа="UPDATE" ИЛИ ОпцияЗаказа="DELETE" ИЛИ ОпцияЗаказа="NEW" Тогда
						НайденнаяСтрока	= ТекОбъект.Работы.Найти(labour, "Работа");
					КонецЕсли;
					
					Если (НайденнаяСтрока=Неопределено И ОпцияЗаказа="NEW" И ЗначениеЗаполнено(labour))
						ИЛИ ПустаяСтрока(ОпцияЗаказа) Тогда
						НайденнаяСтрока				= ТекОбъект.Работы.Добавить();
					КонецЕсли;	
					
					Если НайденнаяСтрока=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОпцияЗаказа="DELETE" Тогда
						ТекОбъект.Работы.Удалить(НайденнаяСтрока);
					Иначе
						НайденнаяСтрока.Работа				= labour;
						НайденнаяСтрока.ИдентификаторРаботы	= Строка(labour.УникальныйИдентификатор());
						Если timeunits_buy>0 Тогда
							НайденнаяСтрока.Коэффициент			= timeunits_buy;
						ИначеЕсли timeunits_sell>0 Тогда
							НайденнаяСтрока.Коэффициет	= timeunits_sell;
						Иначе
							НайденнаяСтрока.Коэффициент	= 0;
						КонецЕсли;							
						НайденнаяСтрока.Количество		= 1;
																		
						Если НЕ обЗначениеНеЗаполнено(billing_factor) И СоздаватьНовыйОбъект Тогда							
							НайденнаяСтрока.Нормочас	= billing_factor;
						Иначе
							Если обЗначениеНеЗаполнено(ТекОбъект.Автомобиль) Тогда
								МодельАвтомобиля		= Справочники.Модели.ПустаяСсылка();
							Иначе
								МодельАвтомобиля		= ТекОбъект.Автомобиль.Модель;
							КонецЕсли;
							
							// Необходимо получить тип цен работ
							Попытка
								ТипЦенРабот	= ТекОбъект.ТипЦенРабот;
							Исключение
								ТипЦенРабот	= Неопределено;
							КонецПопытки;
							
							Если НЕ ЗначениеЗаполнено(ТипЦенРабот) Тогда
								ТипЦенРабот	= обПраво("ОсновнойТипЦенРабот", Права);
							КонецЕсли;

							ЦенаРаботы				= орПолучитьЦенуАвтоработы(ТипЦенРабот, labour, МодельАвтомобиля, ТекОбъект.ДоговорВзаиморасчетов, ТекОбъект.Цех, ТекОбъект.ВидРемонта,,ТекОбъект.ВалютаДокумента,ТекОбъект.КурсДокумента);
													
							Если ТипЗнч(ЦенаРаботы)=Тип("Структура") И ЗначениеЗаполнено(ЦенаРаботы.Нормочас) Тогда
								НайденнаяСтрока.Нормочас	= ЦенаРаботы.Нормочас;							 
							Иначе							
								НайденнаяСтрока.Нормочас	= обПраво("НормочасПоУмолчанию");
							КонецЕсли;							
						КонецЕсли;
						
						ТекОбъект.ОбработкаРеквизита("Работы.Нормочас", НайденнаяСтрока);
									
						Если ТекОбъект.Исполнители.Количество()>0 И ТекОбъект.ИсполнителиДляВсехРабот Тогда
							ИдентификаторТекущейРаботы	= НайденнаяСтрока.ИдентификаторРаботы;
							
							Для Каждого Исполнитель Из ТекОбъект.Исполнители Цикл
								Если Исполнитель.ИдентификаторРаботы<>ИдентификаторТекущейРаботы Тогда
										НовыйИсполнитель					= ТекОбъект.Исполнители.Добавить();
										НовыйИсполнитель.ИдентификаторРаботы= ИдентификаторТекущейРаботы;
										НовыйИсполнитель.Исполнитель		= Исполнитель.Исполнитель;
										НовыйИсполнитель.Цех				= Исполнитель.Цех;
										НовыйИсполнитель.Процент			= Исполнитель.Процент;
										Прервать;
								КонецЕсли; 
							КонецЦикла;
						
						ИначеЕсли ТипЗнч(mechanics)=Тип("ТаблицаЗначений") И mechanics.Количество()>0 Тогда
							
							ПроцентИсполнителя	= Окр(100/mechanics.Количество(),2);
													
							Для Каждого СтрокаИсполнитель Из mechanics Цикл
								НоваяСтрокаИсполнителя					= ТекОбъект.Исполнители.Добавить();
								НоваяСтрокаИсполнителя.ИдентификаторРаботы	= НайденнаяСтрока.ИдентификаторРаботы;
								НоваяСтрокаИсполнителя.Исполнитель			= ПривестиКТипу(СокрЛП(СтрокаИсполнитель.Значение), "СправочникСсылка.Сотрудники");
								Если wsc=Неопределено Тогда
									wsc	= ТекОбъект.Цех;
								КонецЕсли;
								НоваяСтрокаИсполнителя.Цех					= wsc;
								НоваяСтрокаИсполнителя.Процент				= ПроцентИсполнителя;
							КонецЦикла;						
						КонецЕсли;
						
						Если (НЕ ТекОбъект.СкидкаНаценкаРаботы.Пустая()) И (ТекОбъект.СкидкаНаценкаРаботы.СпособВычисления=Перечисления.СкидкиСпособВычисления.Относительная) Тогда
							НайденнаяСтрока.ПроцентСкидки	= ТекОбъект.ЗначениеСкидкиНаценкиРабот; 	
						Иначе	
							НайденнаяСтрока.ПроцентСкидки	= 0;
						КонецЕсли; 
						// Сбросим значения скидки строки, если таковые имеются.
						НайденнаяСтрока.СкидкаНаТовар		= Справочники.ТипыСкидок.ПустаяСсылка(); 
						НайденнаяСтрока.ПроцентСкидкиСтроки	= 0;
						НайденнаяСтрока.СуммаСкидкиСтроки	= 0;
					 
						//Заполнение ставок налогов
						Если ТекОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ТекОбъект.Организация.ОсвобожденОтНДС Тогда
							НайденнаяСтрока.СтавкаНДС	= Справочники.СтавкиНДС.БезНДС;
						Иначе
							НайденнаяСтрока.СтавкаНДС	= НайденнаяСтрока.Работа.Номенклатура.СтавкаНДС;
						КонецЕсли; 
						
						//Расчет сумм по строке
						ТекОбъект.ОбработкаРеквизита("Работы.Цена", НайденнаяСтрока);
						
					КонецЕсли;
					
					Если oiid=Неопределено Тогда
						oiid	= ?(НайденнаяСтрока.НомерСтроки>0,НайденнаяСтрока.НомерСтроки-1,0);
					КонецЕсли;
					
					// Формирование ответа на запрос для элементов заказа							
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");					
					ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(РегионЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ДилерЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("ORDER_NO",		СформироватьСтрокуXML(НомерЗаказа, Истина, "ORDER_NO"));
					ЗаписьXML.ЗаписатьАтрибут("CUSTOMER_REF",	СформироватьСтрокуXML(СсылкаНаЗаказ.Контрагент));
					ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(oiid));
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
					ЗаписьXML.ЗаписатьТекст(oiid);
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM_ID
					
					// LABOUR_OPERATION
					Если ОпцияЗаказа<>"DELETE" Тогда	
						СтруктураЗаказа	= Новый Структура();
						СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	СсылкаНаЗаказ);
						СтруктураЗаказа.Вставить("СтранаЗаказа",	СтранаЗаказа);
						СтруктураЗаказа.Вставить("РегионЗаказа",	РегионЗаказа);
						СтруктураЗаказа.Вставить("ДилерЗаказа",		ДилерЗаказа);
						СтруктураЗаказа.Вставить("ВалютаЗаказа",	СсылкаНаЗаказ.ВалютаДокумента);
						
						Сформировать_Labour_Operation(ЗаписьXML, СтруктураЗаказа, НайденнаяСтрока);
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM					
				КонецЕсли;
				
				// Товары
				Если ТекСтрока.sparepart_no<>Неопределено Тогда
					oiid					= ТекСТрока.НомерСтроки;
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
					invoice_text			= ПривестиКТипу(СокрЛП(ТекСтрока.invoice_text), "Строка", ПараметрыПреобразования);
										
					stocks_type				= СоКрЛП(ТекСтрока.stocks_type);
					taxcode					= СокрЛП(ТекСтрока.taxcode);
					sparepart_category		= СокрЛП(ТекСтрока.sparepart_category);
					sparepart_group			= СокрЛП(ТекСтрока.sparepart_group);
					
					stocks		= ПривестиКТипу(ТекСтрока.stocks, "Число");
					price		= ПривестиКТипу(ТекСтрока.price, "Число");
					currency	= ПривестиКТипу(ТекСтрока.currency, "СправочникСсылка.Валюты");
					vat			= ПривестиКТипу(ТекСтрока.taxcode_rate, "СправочникСсылка.СтавкиНДС");
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Наименование", 			invoice_text);
					ПараметрыПреобразования.Вставить("СоздаватьНовыйОбъект", 	Истина);
					sparepart	= ПривестиКТипу(ТекСтрока.sparepart_no, "СправочникСсылка.Номенклатура", ПараметрыПреобразования);
					
					НайденнаяСтрока		= Неопределено;					
					Если ОпцияЗаказа="UPDATE" ИЛИ ОпцияЗаказа="DELETE" ИЛИ ОпцияЗаказа="NEW" Тогда
						НайденнаяСтрока	= ТекОбъект.Товары.Найти(sparepart, "Номенклатура");
					КонецЕсли;
					
					Если (НайденнаяСтрока=Неопределено И ОпцияЗаказа="NEW" И ЗначениеЗаполнено(sparepart))
						ИЛИ ПустаяСтрока(ОпцияЗаказа) Тогда
						НайденнаяСтрока				= ТекОбъект.Товары.Добавить();	//New по умолчанию
					КонецЕсли;
					
					Если НайденнаяСтрока=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОпцияЗаказа="DELETE" Тогда
						ТекОбъект.Товары.Удалить(НайденнаяСтрока);
					Иначе
						НайденнаяСтрока.Номенклатура		= sparepart;
						НайденнаяСтрока.СкладКомпании		= обПраво("ОсновнойСкладКомпании", Права);				
						НайденнаяСтрока.Цена				= price;
						НайденнаяСтрока.ЕдиницаИзмерения	= sparepart.ОсновнаяЕдиницаИзмерения;
						НайденнаяСтрока.Коэффициент			= 1;
						НайденнаяСтрока.СтавкаНДС			= vat;
						НайденнаяСтрока.Количество			= stocks;
						
						ТекОбъект.ОбработкаРеквизита("Товары.Номенклатура",НайденнаяСтрока);
					КонецЕсли;
					
					Если oiid=Неопределено Тогда
						oiid	= ?(НайденнаяСтрока.НомерСтроки>0,НайденнаяСтрока.НомерСтроки-1,0);
					КонецЕсли;					
					
					// Формирование ответа на запрос для элементов заказа							
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");					
					ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(РегионЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ДилерЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("ORDER_NO",		СформироватьСтрокуXML(НомерЗаказа, Истина, "ORDER_NO"));
					ЗаписьXML.ЗаписатьАтрибут("CUSTOMER_REF",	СформироватьСтрокуXML(СсылкаНаЗаказ.Контрагент));
					ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(oiid));
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
					ЗаписьXML.ЗаписатьТекст(oiid);
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM_ID
					
					УстановитьСвойство(sparepart, СвойствоЦеноваяГруппаЗапчасти, sparepart_group);
					
					// SPAREPART
					Если ОпцияЗаказа<>"DELETE" Тогда	
						СтруктураЗаказа	= Новый Структура();
						СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	СсылкаНаЗаказ);
						СтруктураЗаказа.Вставить("СтранаЗаказа",	СтранаЗаказа);
						СтруктураЗаказа.Вставить("РегионЗаказа",	РегионЗаказа);
						СтруктураЗаказа.Вставить("ДилерЗаказа",		ДилерЗаказа);
						СтруктураЗаказа.Вставить("ВалютаЗаказа",	currency);
						
						МассивЗапчастей	= ПолучитьСтруктуруЗапчасти(Новый Структура("СтрокаЗапчасть, ТипЦен", НайденнаяСтрока, СсылкаНаЗаказ.ТипЦен));
						Для Каждого СтруктураЗапчасти Из МассивЗапчастей Цикл
							Сформировать_Sparepart(ЗаписьXML, СтруктураЗапчасти);
						КонецЦикла;
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM					
				КонецЕсли;			
			КонецЦикла;
			
			ТекОбъект.ДополнительныеСвойства.Вставить("ОтправлятьЗаказВDMSBB", Ложь);
			
			Попытка
				ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
				СсылкаНаЗаказ	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТекущийТипЗапроса="SPAREPARTORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаЗаказ	= Неопределено;
			
			//НомерЗаказа			= СокрЛП(СтрокаШапкаЗаказа.Номер);
			ПараметрыПреобразования	= Новый Структура();
			ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
			НомерЗаказа				= ПривестиКТипу(СокрЛП(СтрокаШапкаЗаказа.Номер), "Строка", ПараметрыПреобразования);			
			
			ОпцияЗаказа		= ВРег(СтрокаШапкаЗаказа.Опция);
			СтранаЗаказа	= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа	= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа		= СтрокаШапкаЗаказа.ДилерDMS;
			
			// Поиск указанного заказа
			ЗапросЗаказа	= Новый Запрос();
			ЗапросЗаказа.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
			
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
									|	Заказы.Ссылка КАК Ссылка
									|ИЗ
									|	Документ.ЗаказПокупателя КАК Заказы
									|ГДЕ
									|	Заказы.Номер = &НомерЗаказа";
			ВыборкаЗапроса	= ЗапросЗаказа.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				СсылкаНаЗаказ	= ВыборкаЗапроса.Ссылка;						
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаЗаказ)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ТекОбъект	= СсылкаНаЗаказ.ПолучитьОбъект();
			Иначе
				ТекОбъект	= Неопределено;
			КонецЕсли;
			
			Если ТекОбъект=Неопределено Тогда
				Продолжить;
			Иначе
				ТекОбъект.ОбменДанными.Загрузка	= Истина;
			КонецЕсли;		
			
			Для Каждого ТекСтрока Из СтрокаШапкаЗаказа.Строки Цикл
				
				// Товары
				Если ТекСтрока.sparepart_no<>Неопределено Тогда
					oiid					= ТекСтрока.НомерСтроки;
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
					invoice_text			= ПривестиКТипу(СокрЛП(ТекСтрока.invoice_text), "Строка", ПараметрыПреобразования);
										
					stocks_type				= ТекСтрока.stocks_type;
					taxcode					= ТекСтрока.taxcode;
					sparepart_category		= ТекСтрока.sparepart_category;
					sparepart_group			= ТекСтрока.sparepart_group;
					
					stocks		= ПривестиКТипу(ТекСтрока.stocks, "Число");
					price		= ПривестиКТипу(ТекСтрока.price, "Число");
					currency	= ПривестиКТипу(ТекСтрока.currency, "СправочникСсылка.Валюты");
					vat			= ПривестиКТипу(ТекСтрока.taxcode_rate, "СправочникСсылка.СтавкиНДС");					
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Наименование", 			invoice_text);
					ПараметрыПреобразования.Вставить("СоздаватьНовыйОбъект",	Истина);
					sparepart	= ПривестиКТипу(ТекСтрока.sparepart_no, "СправочникСсылка.Номенклатура", ПараметрыПреобразования);
					
					НайденнаяСтрока		= Неопределено;					
					Если ОпцияЗаказа="UPDATE" ИЛИ ОпцияЗаказа="DELETE" ИЛИ ОпцияЗаказа="NEW" Тогда
						НайденнаяСтрока	= ТекОбъект.Товары.Найти(sparepart, "Номенклатура");
					КонецЕсли;
										
					Если (НайденнаяСтрока=Неопределено И ОпцияЗаказа="NEW" И ЗначениеЗаполнено(sparepart))
						ИЛИ ПустаяСтрока(ОпцияЗаказа) Тогда
						НайденнаяСтрока				= ТекОбъект.Товары.Добавить();	//New по умолчанию
					КонецЕсли;
					
					Если НайденнаяСтрока=Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					Если ОпцияЗаказа="DELETE" Тогда
						ТекОбъект.Товары.Удалить(НайденнаяСтрока);
					Иначе
						НайденнаяСтрока.Номенклатура		= sparepart;				
						НайденнаяСтрока.Цена				= price;
						НайденнаяСтрока.ЕдиницаИзмерения	= sparepart.ОсновнаяЕдиницаИзмерения;
						НайденнаяСтрока.Коэффициент			= 1;				
						НайденнаяСтрока.СтавкаНДС			= vat;
						НайденнаяСтрока.Количество			= stocks;
						НайденнаяСтрока.Сумма				= НайденнаяСтрока.Количество*НайденнаяСтрока.Цена;
						НайденнаяСтрока.СуммаВсего			= НайденнаяСтрока.Сумма;
						
						ТекОбъект.ОбработкаРеквизита("Товары.Номенклатура",НайденнаяСтрока);
					КонецЕсли;
					
					Если oiid=Неопределено Тогда
						oiid	= ?(НайденнаяСтрока.НомерСтроки>0,НайденнаяСтрока.НомерСтроки-1,0);
					КонецЕсли;										
					
					// Формирование ответа на запрос для элементов заказа							
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");					
					ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(РегионЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ДилерЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("ORDER_NO",		СформироватьСтрокуXML(НомерЗаказа, Истина, "ORDER_NO"));
					ЗаписьXML.ЗаписатьАтрибут("CUSTOMER_REF",	СформироватьСтрокуXML(СсылкаНаЗаказ.Контрагент));
					ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(oiid));
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
					ЗаписьXML.ЗаписатьТекст(oiid);
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM_ID
					
					УстановитьСвойство(sparepart, СвойствоЦеноваяГруппаЗапчасти, sparepart_group);
					
					// SPAREPART
					Если ОпцияЗаказа<>"DELETE" Тогда	
						СтруктураЗаказа	= Новый Структура();
						СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	СсылкаНаЗаказ);
						СтруктураЗаказа.Вставить("СтранаЗаказа",	СтранаЗаказа);
						СтруктураЗаказа.Вставить("РегионЗаказа",	РегионЗаказа);
						СтруктураЗаказа.Вставить("ДилерЗаказа",		ДилерЗаказа);
						СтруктураЗаказа.Вставить("ВалютаЗаказа",	currency);
						
						МассивЗапчастей	= ПолучитьСтруктуруЗапчасти(Новый Структура("СтрокаЗапчасть, СсылкаНаЗаказ, ТипЦен", НайденнаяСтрока, СсылкаНаЗаказ, ТекОбъект.ТипЦен));
						Для Каждого СтруктураЗапчасти Из МассивЗапчастей Цикл
							Сформировать_Sparepart(ЗаписьXML, СтруктураЗапчасти);
						КонецЦикла;
					КонецЕсли;
					
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM					
				КонецЕсли;			
			КонецЦикла;
			
			ТекОбъект.ДополнительныеСвойства.Вставить("ОтправлятьЗаказВDMSBB", Ложь);
			
			Попытка
				ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
				СсылкаНаЗаказ	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод Calculate
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодCalculate(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Для Каждого СтрокаШапка Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаСчет	= Неопределено;
			ОпцияСчета		= ВРег(СтрокаШапка.Опция);
			СтранаЗаказа	= СтрокаШапка.СтранаDMS;
			РегионЗаказа	= СтрокаШапка.РегионDMS;
			ДилерЗаказа		= СтрокаШапка.ДилерDMS;
						
			ТекОбъект		= Документы.СчетНаОплату.СоздатьДокумент();
			СсылкаНаСчет	= ТекОбъект.Ссылка;
			
			ТекОбъект.ОбменДанными.Загрузка	= Истина;
			ТекОбъект.Товары.Очистить();			
			
			Для Каждого ТекСтрока Из СтрокаШапка.Строки Цикл			
				НомерСтроки	= ТекСтрока.НомерСтроки;
				
				// Работы
				Если ТекСтрока.labour_no<>Неопределено Тогда								
                    oiid				= ТекСтрока.НомерСтроки;
					type_of_family		= ТекСтрока.type_of_family;
					repair_group		= ТекСтрока.repair_group;
					illustration_number	= ТекСтрока.illustration_number;
					task_number			= ТекСтрока.task_number;
					index_number		= ТекСтрока.index_number;
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					invoice_text		= ПривестиКТипу(СокрЛП(ТекСтрока.invoice_text), "Строка", ПараметрыПреобразования);
					
					lac					= ТекСтрока.lac;
					billing_factor		= ТекСтрока.ТрудованияНорма;
					timeunits_buy		= ТекСтрока.timeunits_buy;										
					wsc					= ПривестиКТипу(ТекСтрока.wsc, "СправочникСсылка.Цеха");
					ИсполнительРаботы	= ПривестиКТипу(ТекСтрока.Исполнитель, "СправочникСсылка.Сотрудники");
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Наименование", invoice_text);
					Авторабота			= ПривестиКТипу(ТекСтрока.labour_no, "СправочникСсылка.Автоработы", ПараметрыПреобразования);
					
					НайденнаяСтрока		= Неопределено;				
					СтруктураСтроки		= Новый Структура();				
					СтруктураСтроки.Вставить("Номенклатура",Авторабота);					
					СтруктураСтроки.Вставить("Цех",			wsc);				
					СтруктураСтроки.Вставить("Исполнитель",	ИсполнительРаботы);
					
					НайденнаяСтрока	= ТекОбъект.Товары.Добавить();	//New по умолчанию
					ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтруктураСтроки);
					
					Если oiid=Неопределено Тогда
						oiid	= ?(НайденнаяСтрока.НомерСтроки>0,НайденнаяСтрока.НомерСтроки-1,0);
					КонецЕсли;
					
					// Формирование ответа на запрос для элементов заказа							
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");					
					ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(РегионЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ДилерЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("CUSTOMER_REF",	СформироватьСтрокуXML(СсылкаНаСчет.Контрагент));
					ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(oiid));
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
					ЗаписьXML.ЗаписатьТекст(НомерСтроки);
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM_ID
					
					// LABOUR_OPERATION	
					СтруктураЗаказа	= Новый Структура();
					СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	СсылкаНаСчет);
					СтруктураЗаказа.Вставить("СтранаЗаказа",	СтранаЗаказа);
					СтруктураЗаказа.Вставить("РегионЗаказа",	РегионЗаказа);
					СтруктураЗаказа.Вставить("ДилерЗаказа",		ДилерЗаказа);
					СтруктураЗаказа.Вставить("ВалютаЗаказа",	СсылкаНаСчет.ВалютаДокумента);
					СтруктураЗаказа.Вставить("ИсполнительРаботы",ИсполнительРаботы);
					СтруктураЗаказа.Вставить("ЕдиницыВремени",	timeunits_buy);
						
					Сформировать_Labour_Operation(ЗаписьXML, СтруктураЗаказа, НайденнаяСтрока);
					
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM					
				КонецЕсли;
				
				// Товары
				Если ТекСтрока.sparepart_no<>Неопределено Тогда
					oiid					= ТекСтрока.НомерСтроки;
					
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					invoice_text			= ПривестиКТипу(СокрЛП(ТекСтрока.invoice_text), "Строка", ПараметрыПреобразования);
					
					stocks_type				= ТекСтрока.stocks_type;
					taxcode					= ТекСтрока.taxcode_rate;
					sparepart_category		= ТекСтрока.sparepart_category;
					sparepart_group			= ТекСтрока.sparepart_group;

					stocks		= ПривестиКТипу(ТекСтрока.СкладКомпании, "СправочникСсылка.СкладыКомпании");
					price		= ПривестиКТипу(ТекСтрока.price, "Число");
					currency	= ПривестиКТипу(ТекСтрока.currency, "СправочникСсылка.Валюты");
					vat			= ПривестиКТипу(ТекСтрока.taxcode_rate, "СправочникСсылка.СтавкиНДС");
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Наименование",			invoice_text);
					ПараметрыПреобразования.Вставить("СоздаватьНовыйОбъект",	Истина);
					sparepart	= ПривестиКТипу(ТекСтрока.sparepart_no, "СправочникСсылка.Номенклатура", ПараметрыПреобразования);
					
					НайденнаяСтрока		= Неопределено;					
					НайденнаяСтрока		= ТекОбъект.Товары.Добавить();	//New по умолчанию					
					
					НайденнаяСтрока.Номенклатура		= sparepart;
					НайденнаяСтрока.СкладКомпании		= обПраво("ОсновнойСкладКомпании", Права);				
					НайденнаяСтрока.Цена				= price;
					НайденнаяСтрока.ЕдиницаИзмерения	= sparepart.ОсновнаяЕдиницаИзмерения;
					НайденнаяСтрока.Коэффициент			= 1;				
					НайденнаяСтрока.СтавкаНДС			= stocks;					
					
					Если НайденнаяСтрока.НомерСтроки=Неопределено Тогда
						oiid	= ?(НайденнаяСтрока.НомерСтроки>0,НайденнаяСтрока.НомерСтроки-1,0);
					КонецЕсли;
					
					// Формирование ответа на запрос для элементов заказа							
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM");					
					ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE",	СформироватьСтрокуXML(СтранаЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("REGION",			СформироватьСтрокуXML(РегионЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("DEALER",			СформироватьСтрокуXML(ДилерЗаказа));
					ЗаписьXML.ЗаписатьАтрибут("CUSTOMER_REF",	СформироватьСтрокуXML(СсылкаНаСчет.Контрагент));
					ЗаписьXML.ЗаписатьАтрибут("OIID",			СформироватьСтрокуXML(oiid));
					ЗаписьXML.ЗаписатьНачалоЭлемента("ORDER_ITEM_ID");
					ЗаписьXML.ЗаписатьТекст(НомерСтроки);
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM_ID
					
					УстановитьСвойство(sparepart, СвойствоЦеноваяГруппаЗапчасти, sparepart_group);
					
					// SPAREPART	
					СтруктураЗаказа	= Новый Структура();
					СтруктураЗаказа.Вставить("СсылкаНаЗаказ",	Документы.ЗаказНаряд.ПустаяСсылка());
					СтруктураЗаказа.Вставить("СтранаЗаказа",	СтранаЗаказа);
					СтруктураЗаказа.Вставить("РегионЗаказа",	РегионЗаказа);
					СтруктураЗаказа.Вставить("ДилерЗаказа",		ДилерЗаказа);
					СтруктураЗаказа.Вставить("ВалютаЗаказа",	currency);
					
					МассивЗапчастей	= ПолучитьСтруктуруЗапчасти(Новый Структура("СтрокаЗапчасть, ЭтоСчетНаОплату", НайденнаяСтрока, Истина));
					Для Каждого СтруктураЗапчасти Из МассивЗапчастей Цикл
						Сформировать_Sparepart(ЗаписьXML, СтруктураЗапчасти);
					КонецЦикла;
										
					ЗаписьXML.ЗаписатьКонецЭлемента();	//ORDER_ITEM					
				КонецЕсли;
				// Пакет информации
				Если ТипЗнч(ТекСтрока.ТаблицаПакета)=Тип("ТаблицаЗначений") И ТекСтрока.ТаблицаПакета.Количество()>0 Тогда
					Для Каждого СтрокаПакета Из ТекСтрока.ТаблицаПакета Цикл
						СтруктураПакета	= Новый Структура();
						СтруктураПакета.Вставить("Источник",	СтрокаПакета.Источник);
						СтруктураПакета.Вставить("КодПакета",	СтрокаПакета.КодПакета);
						СтруктураПакета.Вставить("ИдПакета",		СтрокаПакета.ИдПакета);
						СтруктураПакета.Вставить("ЯзыкТекстаСчета",	СтрокаПакета.ЯзыкТекстаСчета);
						СтруктураПакета.Вставить("ТекстСчета",		СтрокаПакета.ТекстСчета);
						СтруктураПакета.Вставить("ТрудоваяНорма",	СтрокаПакета.billing_factor);
						СтруктураПакета.Вставить("ИдОбъекта",	СтрокаПакета.ИдОбъекта);
						СтруктураПакета.Вставить("Механик",		СтрокаПакета.Механик);
					    СтруктураПакета.Вставить("ВремяРаботы",	СтрокаПакета.ВремяРаботы);						
						СтруктураПакета.Вставить("Цена",		СтрокаПакета.Цена);
						СтруктураПакета.Вставить("ВалютаЦены",	СтрокаПакета.ВалютаЦены);
						СтруктураПакета.Вставить("ТипЦены",		СтрокаПакета.ТипЦены);
						СтруктураПакета.Вставить("СкидкаЦены",	СтрокаПакета.СкидкаЦены);
						СтруктураПакета.Вставить("Набор",		СтрокаПакета.Набор);
						
						Сформировать_Packet_Info(ЗаписьXML, СтруктураПакета);
					КонецЦикла;
				КонецЕсли;				
			КонецЦикла;
			
			Попытка
				ТекОбъект.Записать(РежимЗаписиДокумента.Запись);
				СсылкаНаСчет	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;
			
			Если ОпцияСчета="PRINT" Тогда
				// Печать
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
				
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод UpdateEntry
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодUpdateEntry(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
	ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
	ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
	ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
	ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
	ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
	ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));	
	
	Если ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда		
		
		Для Каждого СтрокаАвтомобиль Из ДеревоЗапроса.Строки Цикл			
			
			СсылкаНаЗаказ	= Неопределено;
			
			ПараметрыПреобразования	= Новый Структура();
			ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
			НомерЗаказа				= ПривестиКТипу(СокрЛП(СтрокаАвтомобиль.Номер), "Строка", ПараметрыПреобразования);
			
			СтранаАвтомобиля= СокрЛП(СтрокаАвтомобиль.СтранаDMS);
			РегионАвтомобиля= СокрЛП(СтрокаАвтомобиль.РегионDMS);
			ДилерАвтомобиля	= СокрЛП(СтрокаАвтомобиль.ДилерDMS);
			
 			vehicle_type		= СокрЛП(СтрокаАвтомобиль.vehicle_type);
			engine_code			= СокрЛП(СтрокаАвтомобиль.engine_code);
			transmission_type	= СокрЛП(СтрокаАвтомобиль.transmission_type);
			transmission_code	= СокрЛП(СтрокаАвтомобиль.transmission_code);
			manufacturer		= СокрЛП(СтрокаАвтомобиль.manufacturer);
			description			= СокрЛП(СтрокаАвтомобиль.description);
			my					= ПривестиКТипу(СокрЛП(СтрокаАвтомобиль.my), "Дата");
			license_tags		= СокрЛП(СтрокаАвтомобиль.license_tags);					
			odometer_tag		= СокрЛП(СтрокаАвтомобиль.odometer_tag);
			odometer			= ПривестиКТипу(СокрЛП(СтрокаАвтомобиль.odometer), "Число");
			hu					= СокрЛП(СтрокаАвтомобиль.hu);
			au					= СокрЛП(СтрокаАвтомобиль.au);
			
			// Поиск указанного заказа
			ЗапросЗаказа	= Новый Запрос();
			ЗапросЗаказа.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
			
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
			                  	  |	Заказы.Ссылка КАК Ссылка
			                  	  |ИЗ
			                  	  |	Документ.ЗаказНаряд КАК Заказы
			                  	  |ГДЕ
			                  	  |	Заказы.Номер = &НомерЗаказа";
			ВыборкаЗапроса	= ЗапросЗаказа.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				СсылкаНаЗаказ	= ВыборкаЗапроса.Ссылка;						
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаЗаказ)<>Тип("ДокументСсылка.ЗаказНаряд")
				ИЛИ СсылкаНаЗаказ=Документы.ЗаказНаряд.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			
			СсылкаНаАвтомобиль	= СсылкаНаЗаказ.Автомобиль;
			ТекОбъект			= СсылкаНаАвтомобиль.ПолучитьОбъект();
			
			Если ТекОбъект=Неопределено Тогда
				Продолжить;
			КонецЕсли;			
			
			ПараметрыДляПреобразования	= Новый Структура();
			ПараметрыДляПреобразования.Вставить("Наименование", transmission_type); 
			СсылкаНаТипКПП	= ПривестиКТипу(transmission_code, "СправочникСсылка.ТипыКПП", ПараметрыДляПреобразования);
			
			ПараметрыДляПреобразования	= Новый Структура();
			ПараметрыДляПреобразования.Вставить("ТипКПП", 				СсылкаНаТипКПП);
			ПараметрыДляПреобразования.Вставить("Модель", 				ТекОбъект.Модель);
			ПараметрыДляПреобразования.Вставить("Наименование", 		СсылкаНаАвтомобиль.Наименование);
			ПараметрыДляПреобразования.Вставить("СоздаватьНовыйОбъект", СоздаватьНовыйОбъект);
			СсылкаНаВариантКомплектации	= ПривестиКТипу(vehicle_type, "СправочникСсылка.ВариантыКомплектации", ПараметрыДляПреобразования);
			
			ТекОбъект.НомерДвигателя		= engine_code;
			ТекОбъект.ТипКПП				= СсылкаНаТипКПП;
			Если ЗначениеЗаполнено(СсылкаНаВариантКомплектации) Тогда
				ТекОбъект.ВариантКомплектации	= СсылкаНаВариантКомплектации;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(description) Тогда
				ТекОбъект.Наименование	= description;
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(manufacturer) Тогда
				Если ЗначениеЗаполнено(ТекОбъект.Модель) Тогда
					МодельОбъект	= ТекОбъект.Модель.ПолучитьОбъект();
				Иначе
					МодельОбъект	= Справочники.Модели.СоздатьЭлемент();
					МодельОбъект.МаскаVIN			= ТекОбъект.VIN;
					Если ПустаяСтрока(description) Тогда
						НаименованиеМодели	= ТекОбъект.Наименование;
					Иначе
						НаименованиеМодели	= description;
					КонецЕсли;
					МодельОбъект.Наименование		= НаименованиеМодели;
					МодельОбъект.НаименованиеПолное	= НаименованиеМодели; 
					МодельОбъект.ВалютаУчета		= Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
					МодельОбъект.Заполнить(Неопределено);
					МодельОбъект.ОбменДанными.Загрузка	= Истина;
					МодельОбъект.УстановитьНовыйКод();				КонецЕсли;
				
				Если МодельОбъект<>Неопределено Тогда
					МодельОбъект.Производитель	= manufacturer;
					
					Попытка
						МодельОбъект.Записать();
						СсылкаНаМодель	= МодельОбъект.Ссылка;
					Исключение
						#Если Клиент Тогда
							СсылкаНаМодель	= Неопределено;
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
					
					Если СсылкаНаМодель<>Неопределено Тогда
						ТекОбъект.Модель	= СсылкаНаМодель;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(my) Тогда
				ТекОбъект.ГодВыпуска	= my;
			КонецЕсли;			
			
			Попытка
				ТекОбъект.Записать();
				СсылкаНаАвтомобиль	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;

			//Пробег
			Пробег		= Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ТекОбъект.Ссылка, odometer, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			//ГосНомер
			ГосНомер	= Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(ТекОбъект.Ссылка, license_tags, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);						
			
			Если ЗначениеЗаполнено(engine_code) Тогда
				УстановитьСвойство(СсылкаНаАвтомобиль, СвойствоКодДвигателяАвтомобиля,	engine_code);
			КонецЕсли;
			Если ЗначениеЗаполнено(transmission_code) Тогда
				УстановитьСвойство(СсылкаНаАвтомобиль, СвойствоКодКППАвтомобиля,		transmission_code);
			КонецЕсли;					
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("VEHICLE_REF");            
			ЗаписьXML.ЗаписатьАтрибут("COUNTRY_CODE", СформироватьСтрокуXML(СтранаАвтомобиля));
			ЗаписьXML.ЗаписатьАтрибут("REGION", СформироватьСтрокуXML(РегионАвтомобиля));
			ЗаписьXML.ЗаписатьАтрибут("DEALER", СформироватьСтрокуXML(ДилерАвтомобиля));
			ЗаписьXML.ЗаписатьТекст(СформироватьСтрокуXML(ТекОбъект.VIN));
			ЗаписьXML.ЗаписатьКонецЭлемента();	//VEHICLE_REF
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA			
			Прервать;
		КонецЦикла;
			
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);						
		
	ИначеЕсли ТекущийТипЗапроса="BUSINESSPARTNERDATA" Тогда		
		
		ПараметрыПреобразования		= Новый Структура();
		ПараметрыПреобразования.Вставить("Имя", "");
		ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);		
		
		Для Каждого СтрокаКонтрагент Из ДеревоЗапроса.Строки Цикл
			ПродолжитьОбработку		= Истина;
			СсылкаНаКонтрагента		= Неопределено;
			СтранаКонтрагента		= СтрокаКонтрагент.СтранаDMS;
			РегионКонтрагента		= СтрокаКонтрагент.РегионDMS;
			ДилерКонтрагента		= СтрокаКонтрагент.ДилерDMS;
			ОбластьДействия			= СтрокаКонтрагент.СсылкаЗапроса;
			КодКонтрагентаСтрокой	= СтрокаКонтрагент.pid;
			ТипКонтрагента			= СтрокаКонтрагент.partner_type;
			СтатусКонтрагента		= СтрокаКонтрагент.partner_status;
			НомерЗаписи				= СтрокаКонтрагент.account_no;
			
			Если НЕ ЗначениеЗаполнено(КодКонтрагентаСтрокой) Тогда
				ОтветСервера	= ОтветитьНаМетодNewEntry(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса);
				Возврат ОтветСервера;
			КонецЕсли;
			
			ЗапросКонтрагента		= Новый Запрос();
			ЗапросКонтрагента.УстановитьПараметр("Код", СокрЛП(КодКонтрагентаСтрокой));
			ЗапросКонтрагента.Текст	= "ВЫБРАТЬ
			                       	  |	Контрагенты.Ссылка КАК Ссылка
			                       	  |ИЗ
			                       	  |	Справочник.Контрагенты КАК Контрагенты
			                       	  |ГДЕ
			                       	  |	Контрагенты.Код = &Код";
			ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
			Если ВыборкаКонтрагента.Следующий() Тогда
				СсылкаНаКонтрагента	= ВыборкаКонтрагента.Ссылка;
			КонецЕсли;			
							
			Если СсылкаНаКонтрагента=Неопределено Тогда
				ЗапросКонтрагента.УстановитьПараметр("Код", СокрЛП(НомерЗаписи));
				ВыборкаКонтрагента	= ЗапросКонтрагента.Выполнить().Выбрать();
				Если ВыборкаКонтрагента.Следующий() Тогда
					СсылкаНаКонтрагента	= ВыборкаКонтрагента.Ссылка;
				Иначе
					// Впоследствии создание новго контрагента
					ПродолжитьОбработку	= Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если ПродолжитьОбработку Тогда
				ТекОбъект	= СсылкаНаКонтрагента.ПолучитьОбъект();
				Если ТекОбъект=Неопределено Тогда
					ПродолжитьОбработку	= Ложь;
				КонецЕсли;
			КонецЕсли;

			Если ПродолжитьОбработку Тогда
			
				Если НЕ ПустаяСтрока(НомерЗаписи) Тогда
					ТекОбъект.Код	= НомерЗаписи;
				КонецЕсли;
				
				Если ТипКонтрагента="SUPPLIER" Тогда
					ТекОбъект.ВидКонтрагента	= Перечисления.ВидыКонтрагентов.Поставщик;	
				ИначеЕсли ТипКонтрагента="CUSTOMER" Тогда
					ТекОбъект.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Покупатель;	
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(СтрокаКонтрагент.matchcode) Тогда
					ПараметрыПреобразования		= Новый Структура();
					ПараметрыПреобразования.Вставить("Имя", "");
					ПараметрыПреобразования.Вставить("ОбратнаяТранслитерация", ИспользоватьТранслитерациюНаименований);
					ТекОбъект.Наименование	= ПривестиКТипу(СтрокаКонтрагент.matchcode, "Строка", ПараметрыПреобразования);					
				КонецЕсли;
				
				Если ТипЗнч(СтрокаКонтрагент.ТаблицаИмен)=Тип("ТаблицаЗначений") Тогда
					ТекИмя				= "";
					ТекОтчество			= "";
					ТекФамилия			= "";
					Для Каждого СтрокаИмя Из СтрокаКонтрагент.ТаблицаИмен Цикл
						Если СтрокаИмя.Тип="FIRST" Тогда							
							ТекИмя		= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
						ИначеЕсли СтрокаИмя.Тип="MIDDLE" Тогда
							ПараметрыПреобразования		= Новый Структура();
							ТекОтчество	= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
						ИначеЕсли СтрокаИмя.Тип="" Тогда
							ТекФамилия	= ПривестиКТипу(СтрокаИмя.Значение, "Строка", ПараметрыПреобразования);
						КонецЕсли;
					КонецЦикла;
					
					Если НЕ ПустаяСтрока(ТекИмя) ИЛИ НЕ ПустаяСтрока(ТекФамилия) Тогда
						ТекОбъект.НаименованиеПолное	=?(ПустаяСтрока(ТекФамилия),"",ТекФамилия+" ")+?(ПустаяСтрока(ТекИмя),"",ТекИмя+" ")+?(ПустаяСтрока(ТекОтчество),"",ТекОтчество);
					КонецЕсли;
				КонецЕсли;
				
				  ДеньРождения	= ПривестиКТипу(СтрокаКонтрагент.date_of_birth, "Дата");
				Если ЗначениеЗаполнено(ДеньРождения) Тогда
					ТекОбъект.ДеньРождения	= ДеньРождения;	
				КонецЕсли;

				ДатаПоследнегоИзменения	= ПривестиКТипу(СтрокаКонтрагент.ДатаПоследнегоИзменения, "Дата");
				Если ЗначениеЗаполнено(ДатаПоследнегоИзменения) Тогда
					ТекОбъект.Дата	= ДатаПоследнегоИзменения;	
				КонецЕсли;				
				
				ТекОбъект.ОбменДанными.Загрузка	= Истина;
				
				Попытка
					ТекОбъект.Записать();
					СсылкаНаКонтрагента	= ТекОбъект.Ссылка;
				Исключение
					ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
				КонецПопытки;				
				
				НаборКонтактнойИнформацииКонтрагента = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
				ПочтовыйАдрес	= СтрокаКонтрагент.zip;
				ФактическийАдрес= ПривестиКТипу(СтрокаКонтрагент.adress, "Строка", ПараметрыПреобразования);
				Страна			= ПривестиКТипу(СтрокаКонтрагент.country, "Строка", ПараметрыПреобразования);
				Город			= ПривестиКТипу(СтрокаКонтрагент.city, "Строка", ПараметрыПреобразования);
				
				Если ТипЗнч(СтрокаКонтрагент.ТаблицаКонтактов)=Тип("ТаблицаЗначений") Тогда
					ТелефонРабочий	= "";
					ТелефонДомашний	= "";
					ЭлектронныйАдрес= "";
					
					Для Каждого СтрокаКонтакт Из СтрокаКонтрагент.ТаблицаКонтактов Цикл
						Если СтрокаКонтакт.Тип="PHONE" И СтрокаКонтакт.Признак="HOME" Тогда
							ТелефонДомашний	= ПривестиКТипу(СтрокаКонтакт.Значение, "Строка", ПараметрыПреобразования);
						ИначеЕсли СтрокаКонтакт.Тип="PHONE" И СтрокаКонтакт.Признак="BUSINESS" Тогда
							ТелефонРабочий	= ПривестиКТипу(СтрокаКонтакт.Значение, "Строка", ПараметрыПреобразования);	
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;

				Если НЕ ПустаяСтрока(ПочтовыйАдрес) Тогда
					НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
					НаборКонтактнойИнформацииКонтрагента.Прочитать();
					
					Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
						СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
						СтрокаНабора.Объект	= СсылкаНаКонтрагента;
						СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Адрес;
						СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.АдресПочтовый;
					Иначе
						СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
					КонецЕсли;
					
					СтрокаНабора.Представление	= ПочтовыйАдрес;
					Попытка
						НаборКонтактнойИнформацииКонтрагента.Записать();
					Исключение
						#Если Клиент Тогда
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ФактическийАдрес) ИЛИ НЕ ПустаяСтрока(Город) ИЛИ НЕ ПустаяСтрока(Страна) Тогда
					НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Адрес);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
					НаборКонтактнойИнформацииКонтрагента.Прочитать();
					
					Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
						СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
						СтрокаНабора.Объект	= СсылкаНаКонтрагента;
						СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Адрес;
						СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.АдресФактический;
					Иначе
						СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
					КонецЕсли;
					
					Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
						СтрокаНабора.Представление	= ФактическийАдрес;
					КонецЕсли;
					
					Если НЕ ПустаяСтрока(Страна) Тогда
						СтрокаНабора.Поле2			= Страна;
					КонецЕсли;
					
					Если НЕ ПустаяСтрока(Город) тогда
						СтрокаНабора.Поле4			= Город;
					КонецЕсли;
					
					Попытка
						НаборКонтактнойИнформацииКонтрагента.Записать();
					Исключение
						#Если Клиент Тогда
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ТелефонДомашний) Тогда
					НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
					НаборКонтактнойИнформацииКонтрагента.Прочитать();
					
					Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
						СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
						СтрокаНабора.Объект	= СсылкаНаКонтрагента;
						СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Телефон;
						СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонДомашний;
					Иначе
						СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
					КонецЕсли;
					
					СтрокаНабора.Представление	= ТелефонДомашний;
					Попытка
						НаборКонтактнойИнформацииКонтрагента.Записать();
					Исключение
						#Если Клиент Тогда
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ТелефонРабочий) Тогда
					НаборКонтактнойИнформацииКонтрагента.Отбор.Объект.Установить(СсылкаНаКонтрагента);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Тип.Установить(Перечисления.ТипыКонтактнойИнформации.Телефон);
					НаборКонтактнойИнформацииКонтрагента.Отбор.Вид.Установить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
					НаборКонтактнойИнформацииКонтрагента.Прочитать();
					
					Если НаборКонтактнойИнформацииКонтрагента.Количество()=0 Тогда
						СтрокаНабора		= НаборКонтактнойИнформацииКонтрагента.Добавить();
						СтрокаНабора.Объект	= СсылкаНаКонтрагента;
						СтрокаНабора.Тип	= Перечисления.ТипыКонтактнойИнформации.Телефон;
						СтрокаНабора.Вид	= Справочники.ВидыКонтактнойИнформации.ТелефонРабочий;
					Иначе
						СтрокаНабора	= НаборКонтактнойИнформацииКонтрагента[0];	
					КонецЕсли;
					
					СтрокаНабора.Представление	= ТелефонРабочий;
					Попытка
						НаборКонтактнойИнформацииКонтрагента.Записать();
					Исключение
						#Если Клиент Тогда
						Сообщить(ОписаниеОшибки());
						#КонецЕсли
					КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
			
			МассивСтруктур	= ПолучитьСтруктуруКонтрагента(Новый Структура("СсылкаНаКонтрагента", СсылкаНаКонтрагента));	
			Для Каждого ТекущаяСтруктураКонтрагента Из МассивСтруктур Цикл
				Сформировать_Business_Partner(ЗаписьXML, ТекущаяСтруктураКонтрагента);
			КонецЦикла;
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		КонецЦикла;
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);		
		
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
	ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод DeleteContent
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодDeleteContent(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);		
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаЗаказ		= Неопределено;
			
			ПараметрыПреобразования	= Новый Структура();
			ПараметрыПреобразования.Вставить("ПроверкаКодировки", Истина);
			НомерЗаказа				= ПривестиКТипу(СокрЛП(СтрокаШапкаЗаказа.Номер), "Строка", ПараметрыПреобразования);			
			
			ОграничениеЗаказа	= ВРег(СтрокаШапкаЗаказа.Ограничение);
			СтранаЗаказа		= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа		= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа			= СтрокаШапкаЗаказа.ДилерDMS;
			
			// Поиск указанного заказа
			ЗапросЗаказа	= Новый Запрос();
			ЗапросЗаказа.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
			
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
			                  	  |	Заказы.Ссылка КАК Ссылка
			                  	  |ИЗ
			                  	  |	Документ.ЗаказНаряд КАК Заказы
			                  	  |ГДЕ
			                  	  |	Заказы.Номер = &НомерЗаказа";
								  
			ВыборкаЗапроса	= ЗапросЗаказа.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				СсылкаНаЗаказ	= ВыборкаЗапроса.Ссылка;						
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаЗаказ)=Тип("ДокументСсылка.ЗаказНаряд") Тогда
				ТекОбъект	= СсылкаНаЗаказ.ПолучитьОбъект();
			Иначе
				ТекОбъект	= Неопределено;
			КонецЕсли;
			
			Если ТекОбъект=Неопределено Тогда
				Продолжить;
			Иначе
				ТекОбъект.ОбменДанными.Загрузка	= Истина;
			КонецЕсли;
			
			Если ОграничениеЗаказа="SPAREPART" Тогда
				ТекОбъект.Товары.Очистить();
				
			ИначеЕсли ОграничениеЗаказа="LABOUR_OPERATION" Тогда
				ТекОбъект.Работы.Очистить();
				
			Иначе
				
				ТекОбъект.Товары.Очистить();
				ТекОбъект.Работы.Очистить();
			КонецЕсли;
			
			Попытка
				ТекОбъект.Записать();
				СсылкаНаЗаказ	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	ИначеЕсли ТекущийТипЗапроса="SPAREPARTORDER" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);		
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Для Каждого СтрокаШапкаЗаказа Из ДеревоЗапроса.Строки Цикл
			
			СсылкаНаЗаказ		= Неопределено;
			НомерЗаказа			= СтрокаШапкаЗаказа.Номер;
			СтранаЗаказа		= СтрокаШапкаЗаказа.СтранаDMS;
			РегионЗаказа		= СтрокаШапкаЗаказа.РегионDMS;
			ДилерЗаказа			= СтрокаШапкаЗаказа.ДилерDMS;
			
			// Поиск указанного заказа
			ЗапросЗаказа	= Новый Запрос();
			ЗапросЗаказа.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
			
			ЗапросЗаказа.Текст	= "ВЫБРАТЬ
									|	Заказы.Ссылка КАК Ссылка
									|ИЗ
									|	Документ.ЗаказПокупателя КАК Заказы
									|ГДЕ
									|	Заказы.Номер = &НомерЗаказа";
			ВыборкаЗапроса	= ЗапросЗаказа.Выполнить().Выбрать();
			Если ВыборкаЗапроса.Следующий() Тогда
				СсылкаНаЗаказ	= ВыборкаЗапроса.Ссылка;						
			КонецЕсли;
			
			Если ТипЗнч(СсылкаНаЗаказ)=Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				ТекОбъект	= СсылкаНаЗаказ.ПолучитьОбъект();
			Иначе
				ТекОбъект	= Неопределено;
			КонецЕсли;
			
			Если ТекОбъект=Неопределено Тогда
				Продолжить;
			Иначе
				ТекОбъект.ОбменДанными.Загрузка	= Истина;
			КонецЕсли;
			
			ТекОбъект.Товары.Очистить();
			
			Попытка
				ТекОбъект.Записать();
				СсылкаНаЗаказ	= ТекОбъект.Ссылка;
			Исключение
				ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание :"+ИнформацияОбОшибке().Описание;
			КонецПопытки;			
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция формирует ответ на полученный от DMSBB метод GetStockInformation
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодGetStockInformation(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОтвета			= "";
	ТекстОшибки			= "";
	ТекущееИмяЗапроса	= ВРег(ИмяЗапроса);
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML			= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="SHOPDATA" Тогда
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);		
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
		
		Запчасть	= "";
		Для Каждого ТекСтрока Из ДеревоЗапроса.Строки Цикл
			Для Каждого ТекЗапчасть Из ТекСтрока.Строки Цикл
				Запчасть	= СокрЛП(ТекЗапчасть.sparepart_no);
				Если НЕ ПустаяСтрока(Запчасть) Тогда
					ПараметрыПреобразования	= Новый Структура();
					ПараметрыПреобразования.Вставить("Запчасть", 					Запчасть);
					ПараметрыПреобразования.Вставить("СоздаватьНовуюНоменклатуру",	Ложь);
					МассивЗапчастей	= ПолучитьСтруктуруЗапчасти(ПараметрыПреобразования);
					Для Каждого СтруктураЗапчасти Из МассивЗапчастей Цикл
						Сформировать_Sparepart(ЗаписьXML, СтруктураЗапчасти);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);	
	
	Возврат ТекстОтвета;
	
КонецФункции

// Функция обрабатывает подписку на события и формирует ответ на запрос
// Параметры:
//	ДеревоЗапроса	- дерево значений, содержащее разобранный запрос
//	ИмяЗапроса		- имя разбираемого запроса
//	ТипЗапроса		- тип рабираемого запроса
//	ВерсияЗапроса	- версия разбираемого запроса
//	ИдЗапроса		- идентификатор разбирамеого запроса
//
// Возвращаемое значение - ответ на запрос
//
Функция ОтветитьНаМетодSubscription(ДеревоЗапроса, ИмяЗапроса, ТипЗапроса, ВерсияЗапроса, ИдЗапроса)
	
	ТекстОшибки	= "";
	ТекстОтвета	= "";		
	ТекущийТипЗапроса	= ВРег(ТипЗапроса);
	ЗаписьXML	= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);
	
	Если ТекущийТипЗапроса="WORKSHOPORDER" ИЛИ ТекущийТипЗапроса="SPAREPARTORDER"
		ИЛИ ТекущийТипЗапроса="BUSINESSPARTNERDATA" ИЛИ ТекущийТипЗапроса="CUSTOMERVEHICLEDATA" Тогда
		
		// Сохранение данных о подписчике
		Для Каждого СтрокаЗапроса Из ДеревоЗапроса.Строки Цикл
			ТекСлужба	= ТипЗапроса;
			ТекСтрана	= СтрокаЗапроса.СтранаDMS;
			ТекРегион	= СтрокаЗапроса.РегионDMS;
			ТекДилер	= СтрокаЗапроса.ДилерDMS;
			ТекПодписчик= СтрокаЗапроса.ПодписчикЗапроса;
			ТекСобытие	= СтрокаЗапроса.СобытиеЗапроса;
			ТекОпция	= СтрокаЗапроса.Опция;
				
			НаборЗаписей	= РегистрыСведений.СведенияОСобытияхDMSBB.СоздатьНаборЗаписей();
			
			Если ЗначениеЗаполнено(ТекСтрана) Тогда
				НаборЗаписей.Отбор.Страна.Установить(ТекСтрана);
			Иначе
				ТекСтрана	= "";
			КонецЕсли;
		
			НаборЗаписей.Отбор.Регион.Установить(ТекРегион);
			НаборЗаписей.Отбор.Дилер.Установить(ТекДилер);
			НаборЗаписей.Отбор.Служба.Установить(ТекСлужба);
			НаборЗаписей.Отбор.Подписчик.Установить(ТекПодписчик);
			НаборЗаписей.Отбор.Событие.Установить(ТекСобытие);
			НаборЗаписей.Прочитать();
			
			Если ВРег(ТекОпция)="UNSUBSCRIBE" Тогда
				НаборЗаписей.Очистить();
				Попытка
					НаборЗаписей.Записать();
				Исключение
					ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание: "+ИнформацияОбОшибке().Описание;
				КонецПопытки;				
			Иначе
				Если НаборЗаписей.Количество()=0 Тогда					
					НоваяСтрока				= НаборЗаписей.Добавить();
				Иначе
					НоваяСтрока				= НаборЗаписей[0];	
				КонецЕсли;
				
				НоваяСтрока.Страна		= ТекСтрана;
				НоваяСтрока.Регион		= ТекРегион;
				НоваяСтрока.Дилер		= ТекДилер;
				НоваяСтрока.Служба		= ТекСлужба;
				НоваяСтрока.Подписчик	= ТекПодписчик;
				НоваяСтрока.Событие		= ТекСобытие;
				
				Попытка
					НаборЗаписей.Записать();
				Исключение
					ТекстОшибки	= "Причина: "+ИнформацияОбОшибке().Причина+Символы.ПС+"Описание: "+ИнформацияОбОшибке().Описание;
				КонецПопытки;								
			КонецЕсли;
		
		КонецЦикла;
		
		// Формирование ответа
		ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
		ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
		ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESULT");
		ЗаписьXML.ЗаписатьНачалоЭлемента("RESPONSE");
		ЗаписьXML.ЗаписатьАтрибут("NAME",	ИмяЗапроса);		
		ЗаписьXML.ЗаписатьАтрибут("DTD",	ТипЗапроса);
		ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");		
		ЗаписьXML.ЗаписатьАтрибут("ID",		Строка(ИдЗапроса));		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESPONSE
		ЗаписьXML.ЗаписатьКонецЭлемента();	// RESULT
		
		Сформировать_Exception(ЗаписьXML, ТекстОшибки, ИдЗапроса);
		
		ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE		
	КонецЕсли;
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);
	
	Возврат ТекстОтвета;	
КонецФункции

// Функция осуществляет передачу изменных данных подписчикам
// Параметры:
//	ТекОбъект	- объект, данные которого подлежат передаче
//	Служба		- служба в рамках отправляется сообщение
//	ПОдписчик	- сервис-подписчик на событие
//	Событие		- событие объекта
//
// Возвращаемое значение - текст сообщения об измененных данных
//
Функция Сформировать_SubscriptionData(ТекОбъект, Служба, Подписчик, Событие) Экспорт
	
	ТекстОтвета = "";
	
	Если НЕ (ТипЗнч(ТекОбъект)=Тип("ДокументОбъект.ЗаказНаряд")
		ИЛИ ТипЗнч(ТекОбъект)=Тип("ДокументОбъект.ЗаказПокупателя")
		ИЛИ ТипЗнч(ТекОбъект)=Тип("СправочникОбъект.Контрагенты")
		ИЛИ ТипЗнч(ТекОбъект)=Тип("СправочникОбъект.Автомобили")) Тогда		
		Возврат ТекстОтвета;
	КонецЕсли;
	
	Если СерверHTTP=Неопределено ИЛИ ПустаяСтрока(СерверHTTP) Тогда
		СерверHTTP	= обПраво("АдресСервераDMSBB", Права);
	КонецЕсли;
		
	ТекстОтвета	= "";
	
	ЗаписьXML	= Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку(КодировкаПоУмолчанию);	
	
	Если ВРег(Служба)="BUSINESSPARTNERDATA" Тогда
		МассивСтруктур		= ПолучитьСтруктуруКонтрагента(Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "ACCOUNT_NO", ТекОбъект.Код));				
		
	ИначеЕсли ВРег(Служба)="CUSTOMERVEHICLEDATA" Тогда
		МассивСтруктур	= ПолучитьСтруктуруАвтомобиля(Новый Структура("ИмяПоляПоиска, ЗначениеПоляПоиска", "VIN", ТекОбъект.VIN));
		
	Иначе
		МассивСтруктур		= Новый Массив();
		СтруктураОбъекта	= ПолучитьСтруктуруЗаказа(Новый Структура("СсылкаНаЗаказ, ТипЗапроса", ТекОбъект.Ссылка, Служба));
		МассивСтруктур.Добавить(СтруктураОбъекта);
	КонецЕсли;	
	
	// Формирование сообщение подписичикам
	ЗаписьXML.ЗаписатьНачалоЭлемента("MESSAGE");            
	ЗаписьXML.ЗаписатьАтрибут("DTD", "XMLMSG");
	ЗаписьXML.ЗаписатьАтрибут("VERSION", ВерсияДанных);	
	ЗаписьXML.ЗаписатьНачалоЭлемента("COMMAND");
	ЗаписьXML.ЗаписатьНачалоЭлемента("REQUEST");
	ЗаписьXML.ЗаписатьАтрибут("NAME",	"SubscriptionData");
	ЗаписьXML.ЗаписатьАтрибут("DTD",	Подписчик);
	ЗаписьXML.ЗаписатьАтрибут("VERSION","1.0");
	ЗаписьXML.ЗаписатьАтрибут("ID",		СформироватьСтрокуXML(ПолучитьИдентификаторПоВремени()));
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("COUNTRY_CODE"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(СтранаDMS));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("REGION"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(РегионDMS));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("DEALER"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(ДилерDMS));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("SERVICE"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(Служба));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("VERSION"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML("1.0"));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PARAM");
	ЗаписьXML.ЗаписатьАтрибут("NAME", 	СформироватьСтрокуXML("SUBJECT"));
	ЗаписьXML.ЗаписатьАтрибут("VALUE",	СформироватьСтрокуXML(Событие));
	ЗаписьXML.ЗаписатьКонецЭлемента();	// PARAM
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("DATA");
	
	Для Каждого ТекущаяСтруктура Из МассивСтруктур Цикл
		Если ВРег(Служба)="BUSINESSPARTNERDATA" Тогда
			Сформировать_Business_Partner(ЗаписьXML, ТекущаяСтруктура);	
		ИначеЕсли ВРег(Служба)="CUSTOMERVEHICLEDATA" Тогда
			Сформировать_Vehicle(ЗаписьXML, ТекущаяСтруктура);	
		Иначе
			Сформировать_Order(ЗаписьXML, СтруктураОбъекта);
			Сформировать_Order_Item(ЗаписьXML, ТекущаяСтруктура);
		КонецЕсли;	
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();	// DATA
	ЗаписьXML.ЗаписатьКонецЭлемента();	// REQUEST
	ЗаписьXML.ЗаписатьКонецЭлемента();	// COMMAND
	ЗаписьXML.ЗаписатьКонецЭлемента();	// MESSAGE
	
	ТекстОтвета	= ПроверитьХМЛ(ЗаписьXML);
		
	Возврат ТекстОтвета;
	
КонецФункции

// Функция возвращает таблицу подписчиков на указанное событие сервиса.
//
Функция ПолучитьСписокПодписчиков(Знач Служба, Знач Событие) Экспорт
	
	ТаблицаПодписчиков	= Новый ТаблицаЗначений;
	ТаблицаПодписчиков.Колонки.Добавить("Служба");
	ТаблицаПодписчиков.Колонки.Добавить("Подписчик");
	ТаблицаПодписчиков.Колонки.Добавить("Событие");
	ТаблицаПодписчиков.Колонки.Добавить("АдресСлужбы");
	ТаблицаПодписчиков.Колонки.Добавить("Успешно");
	
	
	СтрокиПодписки	= РегистрыСведений.СведенияОСобытияхDMSBB.СоздатьНаборЗаписей();
	СтрокиПодписки.Прочитать();	
		
	Для Каждого НайденнаяСтрока Из СтрокиПодписки Цикл
		Если НайденнаяСтрока.Служба=Служба И (НайденнаяСтрока.Событие="AllEvents" ИЛИ НайденнаяСтрока.Событие=Событие) Тогда

			СтрокиТаблицы	= ТаблицаПодписчиков.НайтиСтроки(Новый Структура("Служба, Подписчик", НайденнаяСтрока.Служба, НайденнаяСТрока.Подписчик));
			Если СтрокиТаблицы.Количество()>0 Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверим доступность подписчика
			ЗапросПодписчику	= "<?xml version=""1.0"" encoding=""utf-8""?>
									|	<MESSAGE DTD=""XMLMSG"" VERSION="""+ВерсияДанных+""">
									|		<COMMAND>
									|			<REQUEST NAME=""AliveTest"" DTD="""" VERSION="""" ID="""+ПолучитьИдентификаторПоВремени()+"""></REQUEST>
									|		</COMMAND>
									|	</MESSAGE>";			
			АдресСлужбы			= СерверHTTP+"/"+НайденнаяСтрока.Подписчик+".bb";
			ОтветСервера		= ПередатьДанныеНаСервер(АдресСлужбы, ЗапросПодписчику);
	
			СтруктураОшибок		= Новый Структура("Ид,Код,Описание","",0,"");
			ПараметрыРазбора	= Новый Структура("ИмяЗапроса,ТипЗапроса,ВерсияЗапроса,ИдЗапроса,ЭтоЗапрос","","","","",Ложь);
			ДеревоЗапроса		= РазобратьОтветСервера(ОтветСервера, СтруктураОшибок, ПараметрыРазбора);
			
			Если ТипЗнч(ДеревоЗапроса)<>Тип("ДеревоЗначений") ИЛИ ДеревоЗапроса.Строки.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;			
			
			Если Найти(ВРег(НайденнаяСтрока.Подписчик),"ORDERSERVICEPARTS")>0 Тогда
				ТекущийПодписчик	= "OrderServiceParts"	
			ИначеЕсли Найти(ВРег(НайденнаяСтрока.Подписчик),"ORDERSERVICE")>0 Тогда
				ТекущийПодписчик	= "OrderService";
			Иначе
				ТекущийПодписчик	= НайденнаяСтрока.Подписчик;
			КонецЕсли;
			
			НайденныйПодписчик	= ДеревоЗапроса.Строки.НайтиСтроки(Новый Структура("Имя", ТекущийПодписчик), Истина);
			Если НайденныйПодписчик.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока				= ТаблицаПодписчиков.Добавить();
			НоваяСтрока.Служба		= НайденнаяСтрока.Служба;
			НоваяСтрока.Подписчик	= НайденнаяСтрока.Подписчик;
			НоваяСтрока.Событие		= Событие;
			НоваяСтрока.АдресСлужбы	= АдресСлужбы;
			НоваяСтрока.Успешно		= Ложь;
		КонецЕсли;
	КонецЦикла;								
		
	Возврат ТаблицаПодписчиков;
КонецФункции

// Процедура осуществляет отправку данных подписки
//
Процедура ОтправитьДанныеПодписки(ТекОбъект) Экспорт
	
	Если обЗначениеНеЗаполнено(ТекОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОтправлятьЗаказВDMSBB	= Неопределено;
	Если ТипЗнч(ТекОбъект.ДополнительныеСвойства)=Тип("Структура") Тогда
		ТекОбъект.ДополнительныеСвойства.Свойство("ОтправлятьЗаказВDMSBB", ОтправлятьЗаказВDMSBB);
	КонецЕсли;
	
	ПередаватьДанныеDMSBB	= обПраво("ПередаватьДанныеDMSBB", Права);
	Если НЕ ПередаватьДанныеDMSBB Тогда
		Возврат;
	КонецЕсли;
	
	СобытиеПодписки	= "";
	
	Если ТипЗнч(ТекОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
		
		СлужбаПодписки		= "WorkshopOrder";
		СформироватьДанные	= (ТекОбъект.Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт) И ОтправлятьЗаказВDMSBB=Истина;	
		
		Если ТекОбъект.ЭтоНовый() Тогда
			СобытиеПодписки		= "New";
		ИначеЕсли ТекОбъект.ПометкаУдаления Тогда
			СобытиеПодписки		= "Delete";
		ИначеЕсли ТекОбъект.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен
			ИЛИ ТекОбъект.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			СобытиеПодписки		= "Close";
		Иначе
			СобытиеПодписки		= "Update";
		КонецЕсли;				
		
	ИначеЕсли ТипЗнч(ТекОбъект)=Тип("ДокументОбъект.ЗаказПокупателя")Тогда
		
		СлужбаПодписки		= "SparepartOrder";
		СформироватьДанные	= ОтправлятьЗаказВDMSBB=Истина;
		
		Если ТекОбъект.ЭтоНовый() Тогда
			СобытиеПодписки		= "New";
		ИначеЕсли ТекОбъект.ПометкаУдаления Тогда
			СобытиеПодписки		= "Delete";
		ИначеЕсли ТекОбъект.Проведен Тогда
			СобытиеПодписки		= "Close";
		Иначе
			СобытиеПодписки		= "Update";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекОбъект)=Тип("СправочникОбъект.Контрагенты")Тогда
		
		СлужбаПодписки		= "BusinessPartnerData";
		СформироватьДанные	= ОтправлятьЗаказВDMSBB=Истина;
		
		Если ТекОбъект.ЭтоНовый() Тогда
			СобытиеПодписки		= "New";
		ИначеЕсли ТекОбъект.ПометкаУдаления Тогда
			СобытиеПодписки		= "Delete";
		Иначе
			СобытиеПодписки		= "Update";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекОбъект)=Тип("СправочникОбъект.Автомобили")Тогда
		
		СлужбаПодписки		= "CustomerVehicleData";
		СформироватьДанные	= ОтправлятьЗаказВDMSBB=Истина;
		
		Если ТекОбъект.ЭтоНовый() Тогда
			СобытиеПодписки		= "New";
		ИначеЕсли ТекОбъект.ПометкаУдаления Тогда
			СобытиеПодписки		= "Delete";
		Иначе
			СобытиеПодписки		= "Update";
		КонецЕсли;
			
	КонецЕсли;
	
	ТаблицаПодписчиков		= ПолучитьСписокПодписчиков(СлужбаПодписки, СобытиеПодписки);
	
	Если НЕ ПустаяСтрока(СобытиеПодписки) И СформироватьДанные
		И Типзнч(ТаблицаПодписчиков)=Тип("ТаблицаЗначений") И ТаблицаПодписчиков.Количество()>0 Тогда
						
		ТекстОтвета			= Сформировать_SubscriptionData(ТекОбъект, СлужбаПодписки, "XXXSUBSCRIBERXXX", СобытиеПодписки);
				
		Для СчетчикПопыток=1 По 2 Цикл
			
			Для Каждого СтрокаПодписчика Из ТаблицаПодписчиков Цикл
				Если Найти(ВРег(СтрокаПодписчика.Подписчик),"ORDERSERVICEPARTS")>0 Тогда
					ТекущийПодписчик	= "OrderServiceParts";
				ИначеЕсли Найти(ВРег(СтрокаПодписчика.Подписчик),"ORDERSERVICE")>0 Тогда
					ТекущийПодписчик	= "OrderService";
				Иначе
					ТекущийПодписчик	= СтрокаПодписчика.Подписчик;
				КонецЕсли;

				Если НЕ СтрокаПодписчика.Успешно Тогда
					ТекстДляПередачи		= СтрЗаменить(ТекстОтвета, "XXXSUBSCRIBERXXX", ТекущийПодписчик);
					ОтветСервера			= ПередатьДанныеНаСервер(СтрокаПодписчика.АдресСлужбы, ТекстДляПередачи);	
					СтрокаПодписчика.Успешно= (Найти(ОтветСервера,"RESULT")>0);
					
					Попытка
						ЗаписьЖурналаРегистрации("ОбменСDMSBB.ОтправитьДанныеПодписки", УровеньЖурналаРегистрации.Информация, , ,ОтветСервера);
					Исключение КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////
//	ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ИмяОбработки							= "ОбменСDMSBB";
ИмяМикросервера							= "PCWeb";

// Признак перевода кирилицы в транслит для номеров и наименований
ИспользоватьТранслитерациюНомеров		= Ложь;
ИспользоватьТранслитерациюНаименований	= Ложь;

// Данные, подставляемые в ответ на запрос от DMSBB
ВерсияДанных				= "1.3.0.0";
КодировкаПоУмолчанию		= "UTF-8";
СерверHTTP					= обПраво("АдресСервераDMSBB", Права);
СтранаDMS					= обПраво("СтранаDMS", Права);
РегионDMS					= обПраво("РегионDMS", Права);
ДилерDMS					= обПраво("ДилерDMS", Права);

// Иерархия авторабот
ДеревоАвторабот	= Новый ДеревоЗначений();
ДеревоАвторабот.Колонки.Добавить("Код");
ДеревоАвторабот.Колонки.Добавить("Наименование");
ДеревоАвторабот.Колонки.Добавить("Ссылка");

// Признак создания групп авторабот при загрузке автоработы
ЗаполнятьРодителяАвтоработы	= Истина;

// Признак создания новых объектов справочника ВариантыКомплектации и нНормочасы
СоздаватьНовыйЗаказ			= Ложь;
СоздаватьНовыйОбъект		= Ложь;

// Свойства
НазначениеЗаказаСсылка			= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Документ_ЗаказНаряд;
СвойствоТипЗаказа				= НайтиСоздатьСвойствоОбъекта(НазначениеЗаказаСсылка, "TYPE");
СвойствоНомерГарантийнойЗаявки	= НайтиСоздатьСвойствоОбъекта(НазначениеЗаказаСсылка, "CLAIM_REF");

НазначениеЗаказаЗапчастейСсылка	= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Документ_ЗаказПокупателя;
СвойствоТипЗаказаЗапчастей		= НайтиСоздатьСвойствоОбъекта(НазначениеЗаказаСсылка, "TYPE");
СвойствоНомерГарантийнойЗаявкиЗапчастей	= НайтиСоздатьСвойствоОбъекта(НазначениеЗаказаСсылка, "CLAIM_REF");

НазначениеАвтомобиляСсылка		= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Справочник_Автомобили;
СвойствоКодДвигателяАвтомобиля	= НайтиСоздатьСвойствоОбъекта(НазначениеАвтомобиляСсылка, "ENGINE_CODE");
СвойствоКодКППАвтомобиля		= НайтиСоздатьСвойствоОбъекта(НазначениеАвтомобиляСсылка, "TRANSMISSION_CODE");

НазначениеЗапчастиСсылка		= ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Справочник_Номенклатура;
СвойствоЦеноваяГруппаЗапчасти	= НайтиСоздатьСвойствоОбъекта(НазначениеЗапчастиСсылка, "PRICE_GR");