#Область Настройки
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Настройки были изменены. Записать настройки?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		    Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Да тогда
			СохранитьНастройкиНаСервере();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.СохранитьНастройки();
	ЗначениеВРеквизитФормы(Обр,"Объект");
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ВосстановитьНастройки();
	ЗначениеВРеквизитФормы(Обр,"Объект");	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьМодифицированность()
	ЭтаФорма.Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьВыбираетсяПриИзменении(Элемент)
	УстановитьМодифицированность();
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьHTTPПриИзменении(Элемент)
	УстановитьМодифицированность();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры
#КонецОбласти 

#Область СвязанныеРегистры
&НаСервере
Функция КомандаОткрытьРегистрСопоставленияНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	ИмяРегистра = Обр.ПолучитьИмяРегистра(Обр.ПолучитьРегистрСопоставления());
	ЗначениеВРеквизитФормы(Обр,"Объект");
	Возврат ИмяРегистра;
КонецФункции

&НаСервере
Функция КомандаОткрытьРегистрСопоставленияПодразделенийНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	ИмяРегистра = Обр.ПолучитьИмяРегистра(Обр.ПолучитьРегистрСопоставленияПодразделений());
	ЗначениеВРеквизитФормы(Обр,"Объект");
	Возврат ИмяРегистра;
КонецФункции

&НаСервере
Функция КомандаОткрытьРегистрСопоставленияВидовРемонтаНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	ИмяРегистра = Обр.ПолучитьИмяРегистра(Обр.ПолучитьРегистрСопоставленияВидовРемонта());
	ЗначениеВРеквизитФормы(Обр,"Объект");
	Возврат ИмяРегистра;
КонецФункции

&НаКлиенте
Процедура КомандаОткрытьРегистрСопоставления(Команда)
	ИмяРегистра = КомандаОткрытьРегистрСопоставленияНаСервере();
	ОткрытьФорму("РегистрСведений."+ИмяРегистра+".ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьРегистрСопоставленияПодразделений(Команда)
	ИмяРегистра = КомандаОткрытьРегистрСопоставленияПодразделенийНаСервере();
	ОткрытьФорму("РегистрСведений."+ИмяРегистра+".ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьРегистрСопоставленияВидовРемонта(Команда)
	ИмяРегистра = КомандаОткрытьРегистрСопоставленияВидовРемонтаНаСервере();
	ОткрытьФорму("РегистрСведений."+ИмяРегистра+".ФормаСписка");
КонецПроцедуры
#КонецОбласти  

#Область ПолучениеДанных
&НаКлиенте
Процедура КомандаПолучитьДанные(Команда)
	КомандаПолучитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПолучитьДанныеНаСервере()
	СтруктураОчередиЗагрузки = Новый Структура;
	СтруктураОчередиЗагрузки.Вставить("УчетнаяЗапись",			ЭтаФорма.ПолучитьУчетнаяЗапись);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьБренды",			ЭтаФорма.ПолучитьБренды);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьМодели",			ЭтаФорма.ПолучитьМодели);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьЦеха",			ЭтаФорма.ПолучитьЦеха);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьТипыОплат",		ЭтаФорма.ПолучитьТипыОплат);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьВидыРемонта",	ЭтаФорма.ПолучитьВидыРемонта);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьДолжности",		ЭтаФорма.ПолучитьДолжности);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьКлиенты",		ЭтаФорма.ПолучитьКлиенты);
	СтруктураОчередиЗагрузки.Вставить("ПолучитьСотрудников",	ЭтаФорма.ПолучитьСотрудников);

	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ЗагрузитьДанные(СтруктураОчередиЗагрузки);
	ЗначениеВРеквизитФормы(Обр,"Объект");
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура КомандаОтправить(Команда)
	КомандаОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаОтправитьНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ОбновитьАвтомобиль = ЭтаФорма.ОбновитьАвтомобиль;
	Обр.ОбновитьКонтрагента = ЭтаФорма.ОбновитьКонтрагента;
	Обр.ОбновитьТоварыИУслуги = ЭтаФорма.ОбновитьТоварыИУслуги;
	Обр.ВыгрузитьКакОткрытый = ЭтаФорма.ВыгрузитьКакОткрытый;
	Обр.ВыгрузитьОдинЗаказНаряд(ЭтаФорма.ЗаказНаряд);
	ЗначениеВРеквизитФормы(Обр,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьРегламентноеЗадание(Команда)
	КомандаВыполнитьРегламентноеЗаданиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьРегламентноеЗаданиеНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ВыгрузитьВсеЗаказНаряды();
	ЗначениеВРеквизитФормы(Обр,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройкиПодмены(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделениямиО2НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПодразделенияКомпании.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|ГДЕ
	|	ПодразделенияКомпании.Наименование ПОДОБНО ""%О2%""";
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Для каждого Стр Из РезультатЗапроса Цикл 
		СтруктураОтбора = Новый Структура("ПодменяемоеЗначение", Стр);
		Если НЕ Объект.ПодменяемыеДанные.НайтиСтроки(СтруктураОтбора).Количество() Тогда
			НоваяСтрока = Объект.ПодменяемыеДанные.Добавить();
			НоваяСтрока.ПодменяемоеЗначение = Стр;
		КонецЕсли;
	КонецЦикла; 
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделениямиО2(Команда)
	ЗаполнитьПодразделениямиО2НаСервере();
КонецПроцедуры

