
Процедура ВычислениеОтветственного(ТочкаМаршрутаБизнесПроцесса)
	
	ЗаписатьПоРоли = Истина;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьБухгалтерия Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия;

	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьГенеральныйДиректорДЦ Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ ;  
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьГенеральныйДиректорУК Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК ;  
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьКазначей Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Казначей ;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьРуководительЦФО Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО ;
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>	
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьСотрудникЦФО Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО ;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьФинансовыйДиректор Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор ;
	////<<ЧалапАЮ БизТех 13.11.2023 
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ВычеслитьГенеральныйДиректорИД Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД ;
	////ЧалапАЮ БизТех 13.11.2023 >>
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>	
	КонецЕсли;
	
	БТ_БизнесПроцессы.ЗаписатьТаблицуОтветственныхВРегистр_Нов(Ссылка, Адресат);
	
КонецПроцедуры

Функция УзнатьПолучателей(Роль)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Согласующий,
	|	ОтветственныеПоЗаявкамПользователей.Согласующий.Наименование КАК СогласующийНаименование,
	|	КонтактнаяИнформация.Представление КАК ЭлектронныйАдресс
	|ИЗ
	|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ОтветственныеПоЗаявкамПользователей.Согласующий.Сотрудник = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий))";    
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, Ссылка);
	Запрос.УстановитьПараметр("Роль"				, Роль); 
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции   

Функция ОтправитЭлПисьмо(Роль) Экспорт
	
	СписокПолучателей 	= УзнатьПолучателей(Роль);           
	
	СписокПолучателейРассылки = Новый СписокЗначений;
	
	Пока СписокПолучателей.Следующий() Цикл                                  
		
		СписокПолучателейРассылки.Добавить(СписокПолучателей.ЭлектронныйАдресс);
		
	КонецЦикла;           
	
	Тема						= СтрШаблон("Поступила %1 на согласование, для роли: %2", Ссылка, Роль);
	
	Попытка
		
		ТекстПисьма				= БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьСообщение(Ссылка);
		
	Исключение                                                                      
		
		ТекстПисьма				= "";
		
	КонецПопытки; 
	
	БТ_СлужебныеФункции.ОтправитьЭлПисьмо(Тема, ТекстПисьма, СписокПолучателейРассылки);
		
КонецФункции

Процедура Оповещение(ТочкаМаршрутаБизнесПроцесса) Экспорт
	
	Если РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ДДС_ОтключитьРассылкуУведомлений") = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Адресат = Неопределено;
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеБухгалтерия Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеГенеральныйДиректорДЦ Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ ;
	//	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеГенеральныйДиректорУК Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК ; 
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеКазначей Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Казначей ;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеРуководительЦФО Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО ;
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>	
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеСотрудникЦФО Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО ;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеФинансовыйДиректор Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор;   
	//	
	////<<ЧалапАЮ БизТех 13.11.2023
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеГенеральныйДиректорИД Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД ;
	////ЧалапАЮ БизТех 13.11.2023>>	   
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ОповещениеПользователяОВыполненииЗаявки Тогда
		
		Тема		= СтрШаблон("Произведено полное согласование Документы: %1", БТ_СлужебныеФункции.ПолучитьЗначениеРеквизита(Ссылка, "ЗаявкаНаРасходДС"));
		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьПисьмо(Ссылка, Тема);
		Возврат;
		
	КонецЕсли; 
	
	Если не Адресат = Неопределено Тогда
		
		Тема = СтрШаблон("Поступила %1 на согласование, для роли: %2", Ссылка, Адресат);
		БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СформироватьПисьмо(Ссылка, Тема, Адресат)
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаСтатусаВыполненаОбработка(ТочкаМаршрутаБизнесПроцесса)
	НачатьТранзакцию();
	Попытка
		БТ_БизнесПроцессы.УстановитьСтатусСтрокиЗаявки(Ссылка, ПредопределенноеЗначение("Перечисление.БТ_СтатусыЗаявок.Утверждена"),, ПредопределенноеЗначение("Перечисление.БТ_РолиАдресатовЗаявок.Казначей"), ТочкаМаршрутаБизнесПроцесса);
		
		РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(Ссылка.ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.Утверждена);
		
		ЗафиксироватьТранзакцию();
	Исключение
		Сообщить(ОписаниеОшибки());
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

Процедура ПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.ВидЗаявки = Перечисления.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС;    
		
		//<<ЧалапАю БизТех 01.11.2023
		Если Задача.ОтправленаНаДоработку тогда     
			Адресат =  Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО ;
		//ЧалапАю БизТех 01.11.2023 >>
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеБухгалтерия Тогда
		
			Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия;
			
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорДЦ Тогда
			
			Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ ;      
		//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		//	
		//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорУК Тогда
		//	
		//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК ;   
		//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
			
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеКазначей Тогда
			
			Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Казначей ;
		//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
		//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеРуководительЦФО Тогда
		//	
		//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО ;    
		//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
			
		ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеСотрудникЦФО Тогда
			
			Адресат = Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО ;
			
		//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеФинансовыйДиректор Тогда
		//	
		//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор ; 
		//	
		////<<ЧалапАЮ БизТех 13.11.2023
		//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеИсполнительныйДиректор Тогда
		//	
		//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД ;
		////ЧалапАЮ БизТех 13.11.2023>>  
		//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
			
		КонецЕсли;

		
		Задача.Роль	= Адресат;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		БТ_БизнесПроцессы.УстановитьСтатусСтрокиЗаявки(Ссылка, БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПолучитьСтатусПоРоли(Задача.Роль), , Задача.Роль, ТочкаМаршрутаБизнесПроцесса);
		ЗафиксироватьТранзакцию();
	Исключение                   
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Процедура ПередСозданиемВложенныхБизнесПроцессов(ТочкаМаршрутаБизнесПроцесса, ФормируемыеБизнесПроцессы, Отказ)
	Перем РольАдресатаЗаявок;
	
	
	МожетЛиМенятьЗаявку				= Ложь;
	УтверждаетВсеСтрокиТЧ			= Ложь;
	ДанныеПоДопОпции				= Неопределено;
	ИндивидуальныеЗадачиУтверждения = Ложь;

	БТ_БизнесПроцессы.СоздатьНовыеБизнесПроцессы(	Ссылка,
																	ТочкаМаршрутаБизнесПроцесса,
																	ФормируемыеБизнесПроцессы,
																	РольАдресатаЗаявок,
																	ДанныеПоДопОпции,
																	МожетЛиМенятьЗаявку,
																	УтверждаетВсеСтрокиТЧ,
																	ИндивидуальныеЗадачиУтверждения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	
	Если Завершен = Ложь Тогда
		
		Отклонил 			= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		Согласовал 			= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		ДатаЗакрытия 		= Дата(1,1,1);
		ПричинаОтменыЗаявки	= "";          
		Пользователь		= ПараметрыСеанса.Пользователь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрописатьПроверенныхВендеровНаСанкции(Согласованно)
	
		
КонецПроцедуры 

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
КонецПроцедуры

Процедура ЗаписатьВТаблицуОтветсвтвенныхКонкретногоПользователя(ЗаявкаСсылка, Роль, Адресат)
	
	//ТаблицаСогласующих = ПолучитьЗаместителей(ЗаявкаСсылка, Роль, Адресат);
	
	//ТаблицаСогласующих = Новый 
	
	//НоваяСтрокаТЗ = ТаблицаСогласующих.Добавить();
	//НоваяСтрокаТЗ.Согласующий = Адресат;
	//НоваяСтрокаТЗ.НеУведомлятьПоПочте = Ложь;
	//НоваяСтрокаТЗ.ЗаявкаПользователя = ЗаявкаСсылка;
	//НоваяСтрокаТЗ.НомерСтрокиТЧ = 0;
	//НоваяСтрокаТЗ.Роль = Роль;
	//
	//СписокОтветственных=РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	//СписокОтветственных.Отбор.ЗаявкаПользователя.Установить(ЗаявкаСсылка);
	//СписокОтветственных.Отбор.Роль.Установить(Роль);
	//
	//СписокОтветственных.Загрузить(ТаблицаСогласующих);
	//СписокОтветственных.Записать();
	
	а = 0;
	
КонецПроцедуры

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)

КонецПроцедуры

Функция ЕстьОтветветственные(Роль)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Согласующий
	|ИЗ
	|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	|ГДЕ
	|	ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = &ЗаявкаПользователя
	|	И ОтветственныеПоЗаявкамПользователей.Роль = &Роль";    
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, Ссылка);
	Запрос.УстановитьПараметр("Роль"				, Роль);    
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ЕстьКазначейПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)

	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьБухгалтерия Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия;
	
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьГенеральныйДиректорДЦ Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ ;
		
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьГенеральныйДиректорУК Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК ;  
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьКазначей Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.Казначей ;
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута	
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьРуководительЦФО Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО ; 
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьСотрудникЦФО Тогда
		
		Адресат = Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО ;
		
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьФинансовыйДиректор Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор ;  
	//	
	////<<чалапАЮ БизТех 13.11.2023
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.ЕстьГенеральныйДиректорИД Тогда
	//	
	//	Адресат = Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД ; 
	////чалапАЮ БизТех 13.11.2023>>
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>

	КонецЕсли;
			
	Результат = ЕстьОтветветственные(Адресат);	
	
КонецПроцедуры

//ЧалапАю БизТех 02.11.2023
Процедура ЕстьДоработкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)   
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.Период КАК Период,
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.Статус КАК Статус
	                      |ИЗ
						  |	РегистрСведений.БТ_СтатусыЗаявкиДДС.СрезПоследних КАК СтатусыЗаявокПоСтрокамСрезПоследних
	                      |ГДЕ
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.ЗаявкаДДС = &ЗаявкаПользователя");  					  
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, Ссылка.ЗаявкаНаРасходДС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПоследнийСтатус = Выборка.Статус;
		Если ПоследнийСтатус =  Перечисления.БТ_СтатусыЗаявки.ОтправленоНаДоработку тогда
			Адресат = Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО;
			Результат = ЕстьОтветветственные(Адресат);
			//вернем статус согласования
           	РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(Ссылка.ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.НаСогласовании);
		иначе
			ЕстьКазначейПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
