Перем НоменклатураНаличиеЗамен;

// Проверяет наличие замен у данной номенклатуры
//
// Параметры
//  НоменклатураЗамены  - СправочникСсылка.Номенклатура - Номенклатура,
//					наличие замен которой требуется проверить
//
// Возвращаемое значение:
//   Булево   - Наличие замен у данной номенклатуры
//
Функция ПроверитьНаличиеЗамен(НоменклатураЗамены) Экспорт
	
	Если ТипЗнч(НоменклатураЗамены)=Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
							//|	Замены.Артикул КАК Артикул,
							//|	Замены.АртикулЗамены КАК АртикулЗамены,
							|	Замены.АртикулДляПоиска КАК Артикул,
		                    |	Замены.АртикулЗаменыДляПоиска КАК АртикулЗамены,
							|	Замены.Производитель КАК Производитель,
		                    |	Замены.Количество КАК Количество,
		                    |	Замены.ДатаЗамены КАК ДатаЗамены,
		                    |	Замены.ДатаОбновления КАК ДатаОбновления,
		                    |	Замены.Описание КАК Описание
		                    |ИЗ
		                    |	РегистрСведений.Замены КАК Замены
		                    |ГДЕ
							//|	Замены.Артикул = &Артикул И
							|	Замены.АртикулДляПоиска = &АртикулДляПоиска И
							|	Замены.Производитель = &Производитель
		                    |
		                    |ОБЪЕДИНИТЬ ВСЕ
		                    |
							|ВЫБРАТЬ ПЕРВЫЕ 1
							//|	Замены.Артикул КАК Артикул,
							//|	Замены.АртикулЗамены КАК АртикулЗамены,
							|	Замены.АртикулДляПоиска КАК Артикул,
		                    |	Замены.АртикулЗаменыДляПоиска КАК АртикулЗамены,
							|	Замены.Производитель КАК Производитель,
		                    |	Замены.Количество КАК Количество,
		                    |	Замены.ДатаЗамены КАК ДатаЗамены,
		                    |	Замены.ДатаОбновления КАК ДатаОбновления,
		                    |	Замены.Описание КАК Описание
		                    |ИЗ
		                    |	РегистрСведений.Замены КАК Замены
		                    |ГДЕ
							//|	Замены.АртикулЗамены = &Артикул И
							|	Замены.АртикулЗаменыДляПоиска = &АртикулДляПоиска И
							|	Замены.Производитель = &Производитель");
		Если обЗначениеНеЗаполнено(НоменклатураЗамены) Тогда
			Возврат Ложь;
		КонецЕсли; 
		//Если ПустаяСтрока(НоменклатураЗамены.Артикул) Тогда
		Если ПустаяСтрока(НоменклатураЗамены.АртикулДляПоиска) Тогда
			Возврат Ложь;
		КонецЕсли; 
		Если НоменклатураНаличиеЗамен.НайтиПоЗначению(НоменклатураЗамены)<>Неопределено Тогда
			Возврат Истина;
		КонецЕсли; 
		//Запрос.УстановитьПараметр("Артикул",НоменклатураЗамены.Артикул);
		Запрос.УстановитьПараметр("АртикулДляПоиска",НоменклатураЗамены.АртикулДляПоиска);
		Запрос.УстановитьПараметр("Производитель",НоменклатураЗамены.Производитель);
		ВыборкаЗапроса=Запрос.Выполнить().Выбрать();
		Если ВыборкаЗапроса.Следующий() Тогда
			НоменклатураНаличиеЗамен.Добавить(НоменклатураЗамены);
			Возврат Истина;
		КонецЕсли; 
		Возврат Ложь;
		
	ИначеЕсли ТипЗнч(НоменклатураЗамены)=Тип("ТаблицаЗначений") Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ
							|	НоменклатураЗамены.Номенклатура КАК Номенклатура
							|ПОМЕСТИТЬ ВременнаяТаблицаНоменклатуры
							|ИЗ
							|	&НоменклатураЗамены КАК НоменклатураЗамены
							|;
							|
							|////////////////////////////////////////////////////////////////////////////////
							|ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	ВременнаяТаблицаНоменклатуры.Номенклатура КАК Номенклатура
							|ИЗ
							|	ВременнаяТаблицаНоменклатуры КАК ВременнаяТаблицаНоменклатуры
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Замены КАК Замены
							//|		ПО (ВременнаяТаблицаНоменклатуры.Номенклатура.Артикул = Замены.Артикул
							//|				ИЛИ ВременнаяТаблицаНоменклатуры.Номенклатура.Артикул = Замены.АртикулЗамены)
							|		ПО (ВременнаяТаблицаНоменклатуры.Номенклатура.АртикулДляПоиска = Замены.АртикулДляПоиска
							|				ИЛИ ВременнаяТаблицаНоменклатуры.Номенклатура.АртикулДляПоиска = Замены.АртикулЗаменыДляПоиска)
							|			И ВременнаяТаблицаНоменклатуры.Номенклатура.Производитель = Замены.Производитель");

		Запрос.УстановитьПараметр("НоменклатураЗамены",НоменклатураЗамены);
		МассивНоменклатуры=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		НоменклатураНаличиеЗамен.ЗагрузитьЗначения(МассивНоменклатуры);
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции // ПроверитьНаличиеЗамен()

Функция ПолучитьТаблицуЗамен(Артикул=Неопределено,Производитель=Неопределено) Экспорт
	Если Артикул=Неопределено Тогда
		//АртикулПоиска=Номенклатура.Артикул;
		АртикулПоиска=Номенклатура.АртикулДляПоиска;
	Иначе
		АртикулПоиска=Артикул;
	КонецЕсли; 
	Если обЗначениеНеЗаполнено(Производитель) Тогда
		ПроизводительПоиска=Номенклатура.Производитель;
	Иначе
		ПроизводительПоиска=Производитель;
	КонецЕсли; 
	ЗаполнитьЗамены(АртикулПоиска,ПроизводительПоиска);
	ТаблицаЗамен.Сортировать("Шаг");
	Возврат ТаблицаЗамен.Выгрузить();
КонецФункции  

Процедура ЗаполнитьЗамены(Артикул,Производитель) Экспорт
	тзТаблицаЗамен=ТаблицаЗамен.Выгрузить();
	зфЗащищенныеФункцииСервер.ЗаполнитьЗамены(Артикул,Производитель,тзТаблицаЗамен);
	ТаблицаЗамен.Загрузить(тзТаблицаЗамен);
КонецПроцедуры

//Получение таблиц замен номенклатуры
Процедура ПолучитьЗаменыНоменклатуры(ЗаменыНовые) Экспорт 
	тзТаблицаЗамен=ТаблицаЗамен.Выгрузить();
	Если ЗаменыНовые Тогда
		тзТаблицаЗаменНовыеСтарые=ТаблицаЗаменНовые.Выгрузить();
	Иначе
		тзТаблицаЗаменНовыеСтарые=ТаблицаЗаменСтарые.Выгрузить();
	КонецЕсли; 
	зфЗащищенныеФункцииСервер.ПолучитьЗаменыНоменклатуры(ЗаменыНовые,тзТаблицаЗамен,тзТаблицаЗаменНовыеСтарые,НаличиеВСправочнике,ВНаличииНаСкладе,НаДату,СкладКомпании);
	Если ЗаменыНовые Тогда
		ТаблицаЗаменНовые.Загрузить(тзТаблицаЗаменНовыеСтарые);
	Иначе
		ТаблицаЗаменСтарые.Загрузить(тзТаблицаЗаменНовыеСтарые);
	КонецЕсли; 
КонецПроцедуры

НоменклатураНаличиеЗамен=Новый СписокЗначений;
