Процедура ЗаписатьОшибкуВЖурнал(Событие, Описание, Данные = Неопределено, ВыводитьСообщение = Истина) Экспорт
	
	НоваяЗапись = РегистрыСведений.ns_ЖурналАвито.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Событие = Событие;
	НоваяЗапись.Описание = Описание;
	НоваяЗапись.Данные = Данные;
	НоваяЗапись.Записать();

	Если ВыводитьСообщение Тогда
		ns_ОбщегоНазначения.СообщениеПользователю("Событие: " + Событие + " смотрите журнал Авито.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьЖурнал() Экспорт
	НаборЗаписей = РегистрыСведений.ns_ЖурналАвито.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
КонецПроцедуры
