Перем НаборЗаписей Экспорт;		// Записан для формирования записей
Перем ДокументОбъект Экспорт;	// Документ объект для записи

// Формирует движения по регистру
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция Проведение() Экспорт
	ЕстьОшибки = Ложь;
	
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Значение = ДокументОбъект.Ссылка;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Использование = Истина;
	НаборЗаписейГрафикРаботыРесурсов.Прочитать();
	
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
		СтрокаГрафикаРаботыРесурсов = НаборЗаписейГрафикРаботыРесурсов.Добавить();
		СтрокаГрафикаРаботыРесурсов.Ресурс1 = СтрокаНабораЗаписей.Ресурс1;
		СтрокаГрафикаРаботыРесурсов.Ресурс2 = СтрокаНабораЗаписей.Ресурс2;
		СтрокаГрафикаРаботыРесурсов.Объект = СтрокаНабораЗаписей.Объект;
		СтрокаГрафикаРаботыРесурсов.Дата = СтрокаНабораЗаписей.Дата;
		СтрокаГрафикаРаботыРесурсов.НачалоРабочегоВремени = СтрокаНабораЗаписей.НачалоРабочегоВремени;
		СтрокаГрафикаРаботыРесурсов.КонецРабочегоВремени = СтрокаНабораЗаписей.КонецРабочегоВремени;
		СтрокаГрафикаРаботыРесурсов.Продолжительность = СтрокаНабораЗаписей.Продолжительность;
		СтрокаГрафикаРаботыРесурсов.КоличествоНатуральныхЕдиниц = СтрокаНабораЗаписей.КоличествоНатуральныхЕдиниц;
		СтрокаГрафикаРаботыРесурсов.НапомнитьЗа = СтрокаНабораЗаписей.НапомнитьЗа;   
		СтрокаГрафикаРаботыРесурсов.Авторабота = СтрокаНабораЗаписей.Авторабота;   
		// KRAA ++ заполняем значение реквизита
		Попытка
			СтрокаГрафикаРаботыРесурсов.ХозОперация = СтрокаНабораЗаписей.ХозОперация;
		Исключение
			СтрокаГрафикаРаботыРесурсов.ХозОперация = ДокументОбъект.ХозОперация;
		КонецПопытки;
		// KRAA --
		
		// SHMI ++
		СтрокаГрафикаРаботыРесурсов.Авторабота = СтрокаНабораЗаписей.Авторабота;
		// SHMI --
		
	КонецЦикла;
	
	НаборЗаписейГрафикРаботыРесурсов.Записать();
	
	Возврат ЕстьОшибки;
КонецФункции

// Удаляет движения по регистру
// Возвращаемое значение: Булево. Истина - все хорошо, Ложь - чего-то не так.
Функция ОтменаПроведения() Экспорт
	ЕстьОшибки = Ложь;
	
	// Очистим регистр ГрафикРаботыРесурсов
	НаборЗаписейГрафикРаботыРесурсов = РегистрыСведений.ГрафикРаботыРесурсов.СоздатьНаборЗаписей();
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Значение = ДокументОбъект.Ссылка;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.ВидСравнения = ВидСравнения.Равно;
	НаборЗаписейГрафикРаботыРесурсов.Отбор.Объект.Использование = Истина;
	НаборЗаписейГрафикРаботыРесурсов.Прочитать();
	
	// получим значения измерений старого набора записей
	СтарыйНаборЗначенияИзмерений = одОбменДанными.ПолучитьПоНаборуЗаписейРазличныеЗначенияИзмерений(НаборЗаписейГрафикРаботыРесурсов);
	НаборЗаписейГрафикРаботыРесурсов.ДополнительныеСвойства.Вставить("ЗначенияИзмерений", СтарыйНаборЗначенияИзмерений);

	НаборЗаписейГрафикРаботыРесурсов.Очистить();
	НаборЗаписейГрафикРаботыРесурсов.Записать();
	
	Возврат ЕстьОшибки;
КонецФункции


Процедура ПриЗаписи(Отказ, Замещение)
	
	// Регистрация изменений
	ЗначенияИзмерений = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗначенияИзмерений", ЗначенияИзмерений);
    Если ЗначенияИзмерений = Неопределено Тогда
		
		// получим значения измерений текущего набора записей
		ЗначенияИзмерений = одОбменДанными.ПолучитьПоНаборуЗаписейРазличныеЗначенияИзмерений(ЭтотОбъект);

	КонецЕсли; 
	
	Если ЗначенияИзмерений.Количество() <> 0 Тогда

		РезультатРегистрации = одОбменДанными.РегистрацияИзмененийНабораЗаписей(ЭтотОбъект, ЗначенияИзмерений, "УдаленныеПодразделения");
		
   КонецЕсли;
	
КонецПроцедуры

