Перем Логин;
Перем Пароль;
Перем ВидРемонтаДляОбмена;
Перем Токен;


//Вызываемая регламентом Функция
Функция ОбменДанными() Экспорт
	Если НЕ Авторизация() тогда
		Сообщить("Ошибка авторизации");
		Возврат Ложь;
	КонецЕсли;
	
	МассивПодразделений = Новый Массив;
	МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000376")); //Сервис ОПТИМА СЕЛЕКТ
	МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.НайтиПоКоду("ЦБ000351")); //Сервис ОПТИМА АСП 
	
	//Подразделение = Справочники.ПодразделенияКомпании.НайтиПоНаименованию("Сервис ОПТИМА СЕЛЕКТ");
	ВидРемонта = Справочники.ВидыРемонта.НайтиПоНаименованию("Предпродажная подготовка авто с пробегом");
	Если НЕ ЗначениеЗаполнено(МассивПодразделений) ИЛИ НЕ ЗначениеЗаполнено(ВидРемонта) тогда
		Сообщить("Не найдены подразделения и/или вид ремонта");
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуПоЗаказНарядам(видРемонта,МассивПодразделений);
	Пока Выборка.Следующий() Цикл
		VIN = Выборка.Автомобиль.VIN;
		VIN = СтрЗаменить(VIN,"-","");
		Если ЗначениеЗаполнено(VIN) Тогда
			АвтомобильCME = ПолучитьАвтомобильПоVIN(VIN);
			Если АвтомобильCME = Неопределено Тогда
				Сообщить("Не найден автомобиль по VIN. Поиск по номеру двигателя.");
				АвтомобильCME = ПолучитьАвтомобильПоНомеруДвигателя(VIN);	
			КонецЕсли;
			Если АвтомобильCME = Неопределено Тогда
				Сообщить("Не найден на портале автомобиль по VIN и номеру двигателя " + VIN);
				Продолжить;
			КонецЕсли;
		Иначе
			Сообщить("Не заполнен VIN в карточке автомобиля. Код " + Выборка.Автомобиль.Код);
			Продолжить;
		КонецЕсли;
		Если АвтомобильCME.Количество() = 1 Тогда
			АвтомобильCME = АвтомобильCME[0];
			DMSID 	= ПолучитьЗначениеЕслиСуществуетИЗаполнено(АвтомобильCME,"dmsCarId");
			IDДилер = ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(АвтомобильCME,"dealer.id");
			repairCost = ПолучитьЗначениеЕслиСуществуетИЗаполнено(АвтомобильCME,"repairCost"); 
			СуммаПодготовки = Окр(Выборка.СуммаДокумента);
			Если repairCost = СуммаПодготовки Тогда
				Сообщить("repairCost не изменился для " + VIN);
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(DMSID) И ЗначениеЗаполнено(IDДилер) Тогда
				ОбновитьПараметрАвтомобиля(IDДилер,DMSID,"repairCost",СуммаПодготовки);
				Сообщить("Обновили repairCost на "+строка(СуммаПодготовки)+" для " + VIN);
			Иначе
				Сообщить("Не распознаны dmsCarId и dealerID для автомобиля VIN " + VIN);
				Продолжить;
			КонецЕсли;
		ИначеЕсли АвтомобильCME.Количество() > 1 Тогда
			Сообщить("Неопределено! Найдено несколько автомобилей по VIN " + VIN);
			Продолжить;
		КонецЕсли;		
	КонецЦикла;
	Сообщить("Выполнено!");
КонецФункции

#Область Логирование
Функция СообщитьИВЖурнал(НаименованиеМеханизма, Сообщение, Ошибка = Ложь, ТолькоВЖурнал = Ложь) Экспорт                               
	Если НаименованиеМеханизма <> Неопределено И Сообщение <> Неопределено Тогда
		Если Ошибка Тогда
			ЗаписьЖурналаРегистрации(НаименованиеМеханизма,УровеньЖурналаРегистрации.Ошибка,НаименованиеМеханизма,,Сообщение);
		Иначе
			ЗаписьЖурналаРегистрации(НаименованиеМеханизма,УровеньЖурналаРегистрации.Информация,НаименованиеМеханизма,,Сообщение);	
		КонецЕсли;
		Если Не ТолькоВЖурнал Тогда
			Сообщить(Сообщение);
		КонецЕсли;
	КонецЕсли;
КонецФункции
#КонецОбласти

#Область HTTPЗапросы
// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = СтрНайти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = СтрНайти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = СтрНайти(СтрокаСоединения, "@", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = СтрНайти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = СтрНайти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции
//HTTP запрос
Функция ВыполнитьHTTPЗапрос(URL, МетодЗапроса = "GET", ТелоЗапроса = "", Заголовки = Неопределено, Авторизация = Неопределено) Экспорт
	
	СтруктураURL = СтруктураURI(URL);
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураURL.Хост,,,,,,SSL);
	HTTPЗапрос = Новый HTTPЗапрос(СтруктураURL.ПутьНаСервере);
	
	//Заголовки
	Если ЗначениеЗаполнено(Заголовки) И ТипЗнч(Заголовки) = Тип("Соответствие") тогда
		HTTPЗапрос.Заголовки = Заголовки;		
	КонецЕсли;
	//Обяз хост
	Если HTTPЗапрос.Заголовки.Получить("Host") = Неопределено Тогда
		HTTPЗапрос.Заголовки.Вставить("Host",СтруктураURL.Хост);	
	КонецЕсли;
	//Обяз ассерт
	Если HTTPЗапрос.Заголовки.Получить("Accept") = Неопределено Тогда
		HTTPЗапрос.Заголовки.Вставить("Accept","*/*");	
	КонецЕсли;
	
	//Авторизация
	Если ЗначениеЗаполнено(Авторизация) Тогда
		Если ТипЗнч(Авторизация) = тип("ТокенДоступа") Тогда
			HTTPЗапрос.ДобавитьТокенДоступа(Авторизация);			
		ИначеЕсли ТипЗнч(Авторизация) = тип("Строка") Тогда
			 HTTPЗапрос.Заголовки.Вставить("Authorization",Авторизация);
		КонецЕсли;
	КонецЕсли;
	
	//Тело запроса
	Если ЗначениеЗаполнено(ТелоЗапроса) И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	ИначеЕсли ЗначениеЗаполнено(ТелоЗапроса) И ТипЗнч(ТелоЗапроса) = Тип("Структура") Тогда
		ЗаписьJSON = Новый ЗаписьJSON;			
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON,ТелоЗапроса);
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
		HTTPЗапрос.Заголовки.Вставить("Content-Type","application/json");
	КонецЕсли;
	
	//Выполнение запроса 
	Попытка
		ОтветHTTP = HTTPСоединение.ВызватьHTTPМетод(МетодЗапроса, HTTPЗапрос); 
		
		КодСостояния = ОтветHTTP.КодСостояния;
		ТекстОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		//тестовые данные
		//ТекстОтвета = "[{""order_id"":21,""user"":{""phone"":""+79180492049"",""name"":""Сергей""},""car"":""Audi Q7 4M рестайлинг (2019—2024) 45 TDI 3.0 quattro Tiptronic (249 л.с.)"",""modification_id"":10580,""license_plate"":"""",""vin"":null,""service_datetime"":""2024-11-21T12:00:00+03:00"",""works"":[{""eid"":""41"",""name"":""Колодки тормозные задние - замена"",""details"":null,""unit_price"":1500,""price"":1200,""quantity"":0.8}],""parts"":[{""part_number"":""JQ101380"",""part_make"":""KAMOKA"",""provider"":""Berg"",""quantity"":2,""price"":3593.48,""selling_unit_price"":3593.48,""purchase_unit_price"":3266.8}],""comments"":""Клиент: Сергей +79180492049\nАвто: Audi Q7 4M рестайлинг (2019—2024) 45 TDI 3.0 quattro Tiptronic (249 л.с.) \nСервисный центр: ServiceMe, Тимашевск, ул. Котляра, д. 2А\nРаботы: Колодки тормозные задние - замена\nЗапчасти: JQ101380 KAMOKA Berg 3593.48\nДата и время визита: 21.11.2024 12:00"",""service_center"":""ServiceMe, Тимашевск, ул. Котляра, д. 2А""}]";
		ДанныеСтруктура = Неопределено;
		
		//Попытаемся прочитать JSON
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(ТекстОтвета);
		ДанныеСтруктура = ПрочитатьJSON(ЧтениеJson);
		
		Если ЗначениеЗаполнено(ДанныеСтруктура) Тогда
			Возврат ДанныеСтруктура;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		//Сообщить(ТекстОшибки);
		
		ВторойТекстОшибки = "";
		ВторойТекстОшибки = ВторойТекстОшибки + ?(ЗначениеЗаполнено(КодСостояния),"КодСостояния - " + Строка(КодСостояния) + Символы.ПС,"");
		ВторойТекстОшибки = ВторойТекстОшибки + ?(ЗначениеЗаполнено(ТекстОтвета),"ТекстОтвета - " + Строка(ТекстОтвета) + Символы.ПС,"");
		Если ЗначениеЗаполнено(ВторойТекстОшибки) Тогда
			//Сообщить(ВторойТекстОшибки);
		КонецЕсли;
	КонецПопытки;
КонецФункции
//Получает данные из структуры если ключ существует
Функция ПолучитьЗначениеЕслиСуществуетИЗаполнено(Данные,Наименование) Экспорт
	Если Данные.Свойство(Наименование) И ЗначениеЗаполнено(Данные[Наименование]) Тогда
		Возврат Данные[Наименование];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
//Получает данные из структуры по пути "ключ1.ключ2" если ключи сущестуют
Функция ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Данные,Путь) Экспорт
	МассивПути = СтрРазделить(Путь,".",Ложь);
	ТекущиеДанные = Данные;
	Для Каждого ТекущийКлюч из МассивПути Цикл
		ТекущиеДанные = ПолучитьЗначениеЕслиСуществуетИЗаполнено(ТекущиеДанные,ТекущийКлюч); 		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	Возврат ТекущиеДанные;
КонецФункции
Функция ПолучитьПоПути(Данные,Путь) Экспорт
	Возврат ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Данные,Путь);
КонецФункции
//Возвращает Basic Base64(Логин:Пароль) 
Функция ПолучитьАвторизациюКакBASIC(Логин,Пароль)
	Возврат "Basic "+Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(Логин + ":" + Пароль));	
КонецФункции
//добавляет к url структуру в виде ?param1=1&param2=2
Функция ДобавитьBodyURLEncoded(URL, Params)
	URL = URL + "?";
	Для Каждого Параметр из Params Цикл
		URL = URL + Параметр.Ключ + "=" + Параметр.Значение + "&";
	КонецЦикла;
	Возврат URL;
КонецФункции
Функция Дата_ВФормате_RFC_3339(Дата) Экспорт
	Возврат СериализаторXDTO.XMLСтрока(Дата)+"+"+Прав("0"+СмещениеСтандартногоВремени()/3600,2)+":00";
КонецФункции
Функция КодироватьСтрокуВEncoding(Строка) Экспорт
	//Кодирование в encoding
	Строка = СтрЗаменить(Строка,"%","%25");
	Строка = СтрЗаменить(Строка,"!","%21");
	Строка = СтрЗаменить(Строка,"#","%23");
	Строка = СтрЗаменить(Строка,"$","%24");
	Строка = СтрЗаменить(Строка,"'","%27");
	Строка = СтрЗаменить(Строка,"(","%28");
	Строка = СтрЗаменить(Строка,")","%29");
	Строка = СтрЗаменить(Строка,"*","%2A");
	Строка = СтрЗаменить(Строка,"+","%2B");
	Строка = СтрЗаменить(Строка,",","%2C");
	Строка = СтрЗаменить(Строка,"/","%2F");
	Строка = СтрЗаменить(Строка,":","%3A");
	Строка = СтрЗаменить(Строка,";","%3B");
	Строка = СтрЗаменить(Строка,"=","%3D");
	Строка = СтрЗаменить(Строка,"?","%3F");
	Строка = СтрЗаменить(Строка,"@","%40");
	Строка = СтрЗаменить(Строка,"[","%5B");
	Строка = СтрЗаменить(Строка,"]","%5D");
	Строка = КодироватьСтроку(Строка, СпособКодированияСтроки.URLВКодировкеURL);
	Возврат Строка;
КонецФункции
#КонецОбласти   

#Область ОсновныеФункцииОбмена
Функция Авторизация() Экспорт
	URL = "https://lk.cm.expert/oauth/token";
		
	Авторизация = ПолучитьАвторизациюКакBASIC("client4529","Cen5zN828HBy6IUxggbW"); //Живая
	//Авторизация = ПолучитьАвторизациюКакBASIC("client7387","ZPhvX5gbA3IpvGYh30Xx"); //Тестовая
		
	Ответ = ВыполнитьHTTPЗапрос(URL,"POST",,,Авторизация);
	
	Токен = ПолучитьЗначениеЕслиСуществуетИЗаполнено(Ответ,"access_token");
	
	Возврат ЗначениеЗаполнено(Токен);				
КонецФункции 
Функция ПолучитьВыборкуПоЗаказНарядам(видРемонта,ПодразделениеКомпании) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Партия.Дата КАК ПартияДата,
		|	СУММА(ЗаказНаряд.СуммаДокумента) КАК СуммаДокумента
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки КАК ОстаткиАвтомобилейОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
		|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = ЗаказНаряд.Автомобиль
		|			И ОстаткиАвтомобилейОстатки.Партия.Дата <= ЗаказНаряд.Дата
		|ГДЕ
		|	ЗаказНаряд.Состояние = &Состояние
		|	И ЗаказНаряд.ПодразделениеКомпании В (&ПодразделениеКомпании)
		|	И ЗаказНаряд.ВидРемонта = &ВидРемонта
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОстатки.Автомобиль,
		|	ОстаткиАвтомобилейОстатки.Партия.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаДокумента";
	
	Запрос.УстановитьПараметр("ВидРемонта", видРемонта);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Состояние", Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Сообщить("Будет обработано "+ Запрос.Выполнить().Выгрузить().Количество() + " автомобилей.");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции
//Поиск автомобиля ++
Функция НайтиАвтомобильПоVIN(VIN,ИдДилера=Неопределено,ТребуемыеПараметры="vin,dmsCarId,dealer,stockState,outAt") Экспорт 
	АвтомобильCME = ПолучитьАвтомобильПоVIN(VIN,ИдДилера,ТребуемыеПараметры);
	Если АвтомобильCME = Неопределено Тогда
		Сообщить("Не найден автомобиль по VIN. Поиск по номеру двигателя.");
		АвтомобильCME = ПолучитьАвтомобильПоНомеруДвигателя(VIN,ИдДилера,ТребуемыеПараметры);	
	КонецЕсли;
	Если АвтомобильCME = Неопределено Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Не найден на портале автомобиль по VIN и номеру двигателя " + VIN, Истина);
		Возврат Неопределено;
	КонецЕсли;
	Если АвтомобильCME.Количество() = 1 Тогда
		АвтомобильCME = АвтомобильCME[0];
		Возврат АвтомобильCME;
	ИначеЕсли АвтомобильCME.Количество() > 1 Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Неопределено! Найдено несколько автомобилей по VIN " + VIN, Истина);
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
Функция ПолучитьАвтомобильПоVIN(VIN,ИдДилера=Неопределено,ТребуемыеПараметры="vin,dmsCarId,dealer,repairCost") Экспорт
	URL = "https://lk.cm.expert/api/v1/dealers/dms/cars";
	params = новый Соответствие;
	params.Вставить("filter[vin]",VIN);
	Если ЗначениеЗаполнено(ИдДилера) Тогда
		params.Вставить("filter[dealerId]",ИдДилера);
	КонецЕсли;
	params.Вставить("fields",ТребуемыеПараметры);
	ДобавитьBodyURLEncoded(URL, params);
	
	Авторизация = "Bearer " + Токен;
	
	Ответ = ВыполнитьHTTPЗапрос(URL,"GET",,,Авторизация);
    Возврат ответ;
КонецФункции 
Функция ПолучитьАвтомобильПоНомеруДвигателя(VIN,ИдДилера=Неопределено,ТребуемыеПараметры="vin,dmsCarId,dealer,repairCost") Экспорт
	URL = "https://lk.cm.expert/api/v1/dealers/dms/cars";
	params = новый Соответствие;
	params.Вставить("filter[bodyNumber]",VIN);
	Если ЗначениеЗаполнено(ИдДилера) Тогда
		params.Вставить("filter[dealerId]",ИдДилера);
	КонецЕсли;
	params.Вставить("fields",ТребуемыеПараметры);
	ДобавитьBodyURLEncoded(URL, params);
	
	Авторизация = "Bearer " + Токен;
	
	Ответ = ВыполнитьHTTPЗапрос(URL,"GET",,,Авторизация);
    Возврат ответ;
КонецФункции
//Поиск автомобиля --
Функция ОбновитьПараметрАвтомобиля(IDДилер,DMSID,Параметр="",Значение="",СоответствиеПараметров=Неопределено) Экспорт
	                                                                          
	IDДилер	= СтрЗаменить(Строка(IDДилер)," ","");
	DMSID	= СтрЗаменить(Строка(DMSID)," ","");
	
	URL = "https://lk.cm.expert/api/v1/dealers/" + IDДилер + "/dms/cars/" + DMSID;
	
	params = новый Структура;
	Если СоответствиеПараметров=Неопределено Тогда
		params.Вставить(Параметр,Значение);
	Иначе
		Для Каждого Параметр из СоответствиеПараметров Цикл
			params.Вставить(Параметр.Ключ,Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	Авторизация = "Bearer " + Токен;
	
	Ответ = ВыполнитьHTTPЗапрос(URL,"PATCH",params,,Авторизация);
    Возврат ответ;
КонецФункции
Функция ПолучитьПользователяпоФИ(Имя,Фамилия) Экспорт
	URL = "https://lk.cm.expert/api/v1/users";
	params = новый Соответствие;
	params.Вставить("filter[firstName][like]",Имя);
	params.Вставить("filter[lastName][like]",Фамилия);
	ДобавитьBodyURLEncoded(URL, params);
	
	Авторизация = "Bearer " + Токен;
	
	Ответ = ВыполнитьHTTPЗапрос(URL,"GET",,,Авторизация);
	Возврат ответ;
КонецФункции
Функция ПолучитьIDПользователяПоКарточкеПользователя1С(ПользовательИлиСотрудник)
	Если НЕ ЗначениеЗаполнено(ПользовательИлиСотрудник) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Наименование = ПользовательИлиСотрудник.Наименование;
	МассивНаименования = СтрРазделить(Наименование," ",Ложь);
	Имя = "";
	Фамилия = "";
	Если МассивНаименования.Количество() >= 2 Тогда
		Фамилия = СокрЛП(МассивНаименования[0]);
		Имя 	= СокрЛП(МассивНаименования[1]);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПользователя = Неопределено;
	Если ЗначениеЗаполнено(Имя) и ЗначениеЗаполнено(Фамилия) Тогда
		СтруктураПользователя = ПолучитьПользователяпоФИ(Имя,Фамилия);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПользователя) И ТипЗнч(СтруктураПользователя) = Тип("Массив") И СтруктураПользователя.Количество() Тогда
		СтруктураПользователя = СтруктураПользователя[0];
		Если СтруктураПользователя.state = "active" Тогда
			Возврат СтруктураПользователя.id;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#Область ВызываемыеФункции
Функция УстановитьВыбытиеАвтомобиля(VIN,Ссылка,Сумма,Дата,Пользователь,Менеджер) Экспорт
	Если НЕ Авторизация() тогда
		Сообщить("Интеграция CMExpert - Ошибка авторизации");
		Возврат Ложь;
	КонецЕсли;
	
	Автомобиль = ЭтотОбъект.НайтиАвтомобильПоVIN(VIN,"14094");
	Если Автомобиль = Неопределено Тогда
		Сообщить("Интеграция CMExpert - Автомобиль не найден!");
		Возврат Ложь;
	КонецЕсли;
	DMSID 	= ПолучитьЗначениеЕслиСуществуетИЗаполнено(Автомобиль,"dmsCarId");
	IDДилер = ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Автомобиль,"dealer.id");
	//Кодирование в encoding
	DMSID = СтрЗаменить(DMSID,"%","%25");
	DMSID = СтрЗаменить(DMSID,"!","%21");
	DMSID = СтрЗаменить(DMSID,"#","%23");
	DMSID = СтрЗаменить(DMSID,"$","%24");
	DMSID = СтрЗаменить(DMSID,"'","%27");
	DMSID = СтрЗаменить(DMSID,"(","%28");
	DMSID = СтрЗаменить(DMSID,")","%29");
	DMSID = СтрЗаменить(DMSID,"*","%2A");
	DMSID = СтрЗаменить(DMSID,"+","%2B");
	DMSID = СтрЗаменить(DMSID,",","%2C");
	DMSID = СтрЗаменить(DMSID,"/","%2F");
	DMSID = СтрЗаменить(DMSID,":","%3A");
	DMSID = СтрЗаменить(DMSID,";","%3B");
	DMSID = СтрЗаменить(DMSID,"=","%3D");
	DMSID = СтрЗаменить(DMSID,"?","%3F");
	DMSID = СтрЗаменить(DMSID,"@","%40");
	DMSID = СтрЗаменить(DMSID,"[","%5B");
	DMSID = СтрЗаменить(DMSID,"]","%5D");
	DMSID = КодироватьСтроку(DMSID, СпособКодированияСтроки.URLВКодировкеURL);
	//Кодирование в encoding

	ДатаСтрокой = ЭтотОбъект.Дата_ВФормате_RFC_3339(Дата);
	СуммаСтрокой = СтрЗаменить(СокрЛП(Строка(Сумма)),Символы.НПП,""); 
	ДокументСтрокой = Строка(Ссылка);
	ПользовательСтрокой = СокрЛП(Пользователь.Наименование);
	
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("sellingPrice",	СуммаСтрокой);
	Параметры.Вставить("stockState",	"out");
	Параметры.Вставить("outAt",			ДатаСтрокой);
	Параметры.Вставить("outReason",		"selling");
	Если ЗначениеЗаполнено(Менеджер) Тогда
		idМенеджера = ПолучитьIDПользователяПоКарточкеПользователя1С(Менеджер);
		Если idМенеджера = Неопределено Тогда
			Сообщить("Не получилось найти менеджера в CMExpert! Менеджер не будет передан!");
		Иначе
			Параметры.Вставить("soldById", idМенеджера);
		КонецЕсли;
	Иначе
		Сообщить("Менеджер не заполнен в документе! Менеджер не будет передан!");
	КонецЕсли;
	Параметры.Вставить("outReasonDescription",ДокументСтрокой+Символы.ПС+"Пользователь - "+ПользовательСтрокой+Символы.ПС+"Сумма реализации - "+ СуммаСтрокой +" руб.");
	
	Ответ = ЭтотОбъект.ОбновитьПараметрАвтомобиля(IDДилер,DMSID,,,Параметры);
	
	// БИЗТЕХ КОВАЛЬ ++ 07.07.2025
	// Проверка на слэш в DMSID Автомобиля
	Если СтрНайти(DMSID, "%2F") > 0 ИЛИ СтрНайти(DMSID, "%20") > 0 Тогда
		Сообщить("В CMExpert в карточке автомобиля в поле ""№ на складе"" присутствует слэш ""/"" или пробел!! Его требуется убрать для корректной работы.");
		Ответ = Неопределено;
	КонецЕсли;
	
	Если Ответ = Неопределено или Ответ.Свойство("errors") Тогда
		Сообщить("Интеграция CMExpert - Произошла ошибка при установке статуса!");
	Иначе
		Сообщить("Интеграция CMExpert - Статус ""Выбыл"" успешно установлен!");
	КонецЕсли;
КонецФункции
Функция УстановитьПоказателиКуммаржиАвтомобиля(СсылкаНаКум) Экспорт
	
	Если 1=2 Тогда
		СсылкаНаКум = Документы.ЭМ_КумулятивнаяМаржа.СоздатьДокумент();
	КонецЕсли;
	
	// VIN
	VIN = СсылкаНаКум.Автомобиль.VIN;
	Если НЕ ЗначениеЗаполнено(VIN) Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - VIN не заполнен!",Истина);
		Возврат Ложь;
	КонецЕсли;
	
	// Показатели которые будут переданы
	revenueInsurance = 0; ////Выручка страховка
	revenueCredit = 0; //Выручка кредит
	revenueOtherFinanceInsurance = 0; //Прочая выручка F&I

	// Проверим что показатели существуют
	ПоказательАВКредитЛизинг = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000011");
	ПоказательКВОСАГО = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000012");
	ПоказательКВКАСКО = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000013");
	ПоказательКВГЭП = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000014");
	ПоказательКВСЖ = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000015");
	ПоказательКВКартапомощи = Справочники.ЭМ_ПоказателиКумулятивнойМаржи.НайтиПоКоду("00000018");
	
	Если ЗначениеЗаполнено(ПоказательАВКредитЛизинг) И 
		ЗначениеЗаполнено(ПоказательКВОСАГО) И 
		ЗначениеЗаполнено(ПоказательКВКАСКО) И 
		ЗначениеЗаполнено(ПоказательКВГЭП) И 
		ЗначениеЗаполнено(ПоказательКВСЖ) И 
		ЗначениеЗаполнено(ПоказательКВКартапомощи) Тогда
		revenueInsurance = 0;
	Иначе
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Не все показатели куммаржи определены!",Истина);
		Возврат Ложь;
	КонецЕсли;
	
	//Получим строки
	СтрокаАВКредитЛизинг = СсылкаНаКум.Показатели.Найти(ПоказательАВКредитЛизинг,"Показатель");
	СтрокаКВОСАГО = СсылкаНаКум.Показатели.Найти(ПоказательКВОСАГО,"Показатель");
	СтрокаКВКАСКО = СсылкаНаКум.Показатели.Найти(ПоказательКВКАСКО,"Показатель");
	СтрокаКВГЭП = СсылкаНаКум.Показатели.Найти(ПоказательКВГЭП,"Показатель");
	СтрокаКВСЖ = СсылкаНаКум.Показатели.Найти(ПоказательКВСЖ,"Показатель");
	СтрокаКВКартапомощи = СсылкаНаКум.Показатели.Найти(ПоказательКВКартапомощи,"Показатель");

	// Распределим суммы
	Если СтрокаАВКредитЛизинг <> Неопределено Тогда
		revenueCredit = revenueCredit + СтрокаАВКредитЛизинг.Сумма;
	КонецЕсли;

	Если СтрокаКВОСАГО <> Неопределено Тогда
		revenueInsurance = revenueInsurance + СтрокаКВОСАГО.Сумма;
	КонецЕсли;

	Если СтрокаКВКАСКО <> Неопределено Тогда
		revenueInsurance = revenueInsurance + СтрокаКВКАСКО.Сумма;
	КонецЕсли;

	Если СтрокаКВГЭП <> Неопределено Тогда
		revenueInsurance = revenueInsurance + СтрокаКВГЭП.Сумма;
	КонецЕсли;

	Если СтрокаКВСЖ <> Неопределено Тогда
		revenueInsurance = revenueInsurance + СтрокаКВСЖ.Сумма;
	КонецЕсли;

	Если СтрокаКВКартапомощи <> Неопределено Тогда
		revenueOtherFinanceInsurance = revenueOtherFinanceInsurance + СтрокаКВКартапомощи.Сумма;
	КонецЕсли;

	// Проверим что есть что либо выгружать
	Если revenueCredit = 0 И revenueInsurance = 0 И revenueOtherFinanceInsurance = 0 Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Нет показателей для выгрузки");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ Авторизация() тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Ошибка авторизации",Истина);
		Возврат Ложь;
	КонецЕсли;
	
	Автомобиль = ЭтотОбъект.НайтиАвтомобильПоVIN(VIN,"14094");
	Если Автомобиль = Неопределено Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Автомобиль не найден!",Истина);
		Возврат Ложь;
	КонецЕсли;
	DMSID 	= ПолучитьЗначениеЕслиСуществуетИЗаполнено(Автомобиль,"dmsCarId");
	IDДилер = ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Автомобиль,"dealer.id");
	//Кодирование в encoding
	DMSID = СтрЗаменить(DMSID,"%","%25");
	DMSID = СтрЗаменить(DMSID,"!","%21");
	DMSID = СтрЗаменить(DMSID,"#","%23");
	DMSID = СтрЗаменить(DMSID,"$","%24");
	DMSID = СтрЗаменить(DMSID,"'","%27");
	DMSID = СтрЗаменить(DMSID,"(","%28");
	DMSID = СтрЗаменить(DMSID,")","%29");
	DMSID = СтрЗаменить(DMSID,"*","%2A");
	DMSID = СтрЗаменить(DMSID,"+","%2B");
	DMSID = СтрЗаменить(DMSID,",","%2C");
	DMSID = СтрЗаменить(DMSID,"/","%2F");
	DMSID = СтрЗаменить(DMSID,":","%3A");
	DMSID = СтрЗаменить(DMSID,";","%3B");
	DMSID = СтрЗаменить(DMSID,"=","%3D");
	DMSID = СтрЗаменить(DMSID,"?","%3F");
	DMSID = СтрЗаменить(DMSID,"@","%40");
	DMSID = СтрЗаменить(DMSID,"[","%5B");
	DMSID = СтрЗаменить(DMSID,"]","%5D");
	DMSID = КодироватьСтроку(DMSID, СпособКодированияСтроки.URLВКодировкеURL);

	Параметры = Новый Соответствие;
	Параметры.Вставить("revenueInsurance",					revenueInsurance);
	Параметры.Вставить("revenueCredit",						revenueCredit);
	Параметры.Вставить("revenueOtherFinanceInsurance",		revenueOtherFinanceInsurance);	
	Ответ = ЭтотОбъект.ОбновитьПараметрАвтомобиля(IDДилер,DMSID,,,Параметры);
	
	// БИЗТЕХ КОВАЛЬ ++ 07.07.2025
	// Проверка на слэш в DMSID Автомобиля
	Если СтрНайти(DMSID, "%2F") > 0 ИЛИ СтрНайти(DMSID, "%20") > 0 Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","В CMExpert в карточке автомобиля в поле ""№ на складе"" присутствует слэш ""/"" или пробел!! Его требуется убрать для корректной работы.",Истина);
		Ответ = Неопределено;
	КонецЕсли;
	
	Если Ответ = Неопределено или Ответ.Свойство("errors") Тогда
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Произошла ошибка при выгрузке показателей!",Истина);
	Иначе
		СообщитьИВЖурнал("Интеграция CMExpert","Интеграция CMExpert - Показатели кумулятивной маржи выгружены!");
	КонецЕсли;
КонецФункции
Функция НайтиАвтомобильНаОценкеИВыполнитьЕгоПоступление(Автомобиль,Ссылка) Экспорт
	
	Если 1=2 Тогда
		Ссылка = Документы.ПоступлениеАвтомобилей.НайтиПоКоду(Ссылка.Код);
		РабочийЛистТрейдИн = Документы.тт_РабочийЛистТрейдИн.НайтиПоНомеру();
	КонецЕсли;
	
	VIN = Автомобиль.VIN;
	
	РабочийЛистТрейдИн = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тт_РабочийЛистТрейдИн.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|ГДЕ
		|	тт_РабочийЛистТрейдИн.ДокументПоступленияНаСклад = &Ссылка
		|	И тт_РабочийЛистТрейдИн.Автомобиль.VIN = &VIN
		|
		|УПОРЯДОЧИТЬ ПО
		|	тт_РабочийЛистТрейдИн.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РабочийЛистТрейдИн = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	
	
	// Определим отправляемые параметры
	ДатаПриемаАвтомобиля = Дата_ВФормате_RFC_3339(Ссылка.Дата);
	ЦенаВыкупа = Ссылка.Автомобили.Итог("СуммаВсего");
	ЦенаВыкупаСтрокой = СтрЗаменить(СокрЛП(Строка(ЦенаВыкупа)),Символы.НПП,"");

	Если НЕ Авторизация() тогда
		Сообщить("Интеграция CMExpert - Ошибка авторизации");
		Возврат Ложь;
	КонецЕсли;
	
	КарточкаАвтомобиля = ЭтотОбъект.НайтиАвтомобильПоVIN(VIN,"14094");
	Если КарточкаАвтомобиля = Неопределено Тогда
		// Найти автомобиль на оценке
		URL = "https://lk.cm.expert/api/v1/cars/appraisals/find-last-by-car?vin=" + VIN;		
		Авторизация = "Bearer " + Токен;
		Ответ = ВыполнитьHTTPЗапрос(URL,"GET",,,Авторизация);
		
		ЕстьЛиСообщение = ПолучитьПоПути(Ответ,"message");
		
		//Если есть сообщение значит оценка не найдена
		Если ЗначениеЗаполнено(ЕстьЛиСообщение) Тогда
			Сообщить("Интеграция CMExpert - Не найдена оценка автомобиля или сам автомобиль. Статус на складе не будет установлен!");
			Возврат Ложь;
		КонецЕсли;
		
		IDДилер = ПолучитьПоПути(Ответ,"dealer.id");
		IDДилер = СтрЗаменить(Строка(IDДилер)," ","");
		IDДилер = "14094";
		//Если IDДилер <> "14094" Тогда
		//	Сообщить("Интеграция CMExpert - Найденная оценка не в Автосалоне <ОПТИМА АСП>");
		//	Возврат Ложь;
		//КонецЕсли;
		
		//Создадим новую карточку автомобиля
		URL = "https://lk.cm.expert/api/v1/dealers/"+IDДилер+"/dms/cars/" + Автомобиль.Код;
		Авторизация = "Bearer " + Токен;
		Параметры = Новый Структура;
		Параметры.Вставить("vin", VIN);
		Параметры.Вставить("stockState", "in");
		Параметры.Вставить("contractType", "tradeinnew");
		Параметры.Вставить("isNew", False);
		
		
		ОтветПоСозданиюКарточки = ВыполнитьHTTPЗапрос(URL,"PUT",Параметры,,Авторизация);
		Если НЕ  ЗначениеЗаполнено(ПолучитьПоПути(ОтветПоСозданиюКарточки,"dmsCarId")) Тогда
			Сообщить("Интеграция CMExpert - Ошибка при создании карточки автомобиля. Статус на складе не будет установлен!");
			Возврат Ложь;
		Иначе
			Сообщить("Интеграция CMExpert - Создана новая карточка автомобиля под кодом <"+Автомобиль.Код+">!");
		КонецЕсли;
		
		КарточкаАвтомобиля = ОтветПоСозданиюКарточки;
		
	КонецЕсли;
	// Изменим параметры автомобиля
	DMSID 	= ПолучитьЗначениеЕслиСуществуетИЗаполнено(КарточкаАвтомобиля,"dmsCarId");
	Если НЕ ЗначениеЗаполнено(IDДилер) Тогда
		IDДилер = ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(КарточкаАвтомобиля,"dealer.id");
	КонецЕсли;

	//Кодирование в encoding
	DMSIDСтрока = КодироватьСтрокуВEncoding(DMSID);

	Параметры = Новый Соответствие;
	Параметры.Вставить("stockState",						"in");
	Параметры.Вставить("arrivedAt",							ДатаПриемаАвтомобиля);
	Параметры.Вставить("buyoutPrice",						ЦенаВыкупаСтрокой);
	Если ЗначениеЗаполнено(РабочийЛистТрейдИн) И ЗначениеЗаполнено(РабочийЛистТрейдИн.ГарМаржа) Тогда
		Параметры.Вставить("recommendedRetailPrice",			СтрЗаменить(СокрЛП(Строка(РабочийЛистТрейдИн.ГарМаржа)),Символы.НПП,""));
	КонецЕсли;
	
	Ответ = ЭтотОбъект.ОбновитьПараметрАвтомобиля(IDДилер,DMSID,,,Параметры);
	
	Если Ответ = Неопределено или Ответ.Свойство("errors") Тогда
		Сообщить("Интеграция CMExpert - Произошла ошибка при установке статуса!");
	Иначе
		Сообщить("Интеграция CMExpert - Статус ""На Складе"" успешно установлен!");
	КонецЕсли;

КонецФункции

#КонецОбласти 

#Область СозданиеДокументов

#КонецОбласти 

#Область ПоискЭлементов

#КонецОбласти