// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	СтруктураПредопределенных = Новый Структура("Болезнь,ВынужденыйПростой,Выходной,Отпуск,Работа,ОбеденныйПерерыв,ТехническийПерерыв","Б","ВП","В","О","Р","ОП","ТП");
	Для Каждого РеквизитСтруктуры Из СтруктураПредопределенных Цикл
		ОбъектРадакт = Справочники.ВидыИнтервалов[РеквизитСтруктуры.Ключ].ПолучитьОбъект();
		Если обЗначениеНеЗаполнено(ОбъектРадакт.Мнемоника) Тогда
			ОбъектРадакт.Мнемоника = РеквизитСтруктуры.Значение;
		КонецЕсли;
		Если ОбъектРадакт.Ссылка = Справочники.ВидыИнтервалов.Работа И НЕ ОбъектРадакт.РабочийИнтервал Тогда
			ОбъектРадакт.РабочийИнтервал = Истина;
		КонецЕсли;
		Если ОбъектРадакт.Модифицированность() Тогда
			Попытка
				ОбъектРадакт.Записать();
				Сообщить("Справочник ""Виды интервалов"" обновлен элемент """ + ОбъектРадакт.Наименование +"""",);
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
