
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПараметрыСеанса.атКодСостояния%10 <> 3 Тогда // Не авторизован
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОбъекта(СтруктураСловаря)
	
	ТаблицаРеквизитов.Очистить();
	
	ДанныеОбъекта = атСервер.ПолучитьОбъект(СтруктураСловаря);
	
	Для Каждого КлючЗначение ИЗ ДанныеОбъекта Цикл
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.Реквизит = КлючЗначение.Ключ;
		НоваяСтрока.Значение = КлючЗначение.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "атПомощникПродаж_ОбъектСервиса_ПриОткрытии" Тогда
		// Параметр = СтруктураСловаря
		ЗаполнитьДанныеОбъекта(Параметр);
	КонецЕсли;
КонецПроцедуры
