Процедура УстановитьВидимостьЭлементовШиныДиски(Элементы, TypeId) Экспорт
	Элементы.ГруппаШиныДиски.Видимость = ns_ЗапчастиИАксессуарыВалидация.ЭтоПодкатегорияШиныДиски(TypeId);
	Если Элементы.ГруппаШиныДиски.Видимость = Ложь Тогда
		Возврат;
	КонецЕсли; 
	
	ВсеПоля = ns_ЗапчастиИАксессуарыВалидация.ПолучитьПоляШиныДиски();
	ОбязательныеПоля = ns_ЗапчастиИАксессуарыВалидация.ПолучитьДополнительныеОбязательныеПоля(TypeId);
	ДополнительныеПоля = ns_ЗапчастиИАксессуарыВалидация.ПолучитьНеобязательныеПоляШиныДиски(TypeId);
	
	Для каждого ПолеФормы Из ВсеПоля Цикл
		Элементы[ПолеФормы].Видимость = Ложь;	
	КонецЦикла; 
	
	Для каждого ПолеШиныДиски Из ОбязательныеПоля Цикл
		Элементы[ПолеШиныДиски].Видимость = Истина;
	КонецЦикла;  
	
	Для каждого ПолеШиныДиски Из ДополнительныеПоля Цикл
		Элементы[ПолеШиныДиски].Видимость = Истина;
	КонецЦикла;  
	
КонецПроцедуры

Процедура УстановитьТипыДляМножественныхПолей(Объект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.Brand) Тогда
		Если Объект.TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьШины() Тогда
			Объект.Brand = ПредопределенноеЗначение("Справочник.ns_ПроизводителиШин.ПустаяСсылка");
		Иначе
			Объект.Brand = ПредопределенноеЗначение("Справочник.ns_ПроизводителиЗапчастей.ПустаяСсылка");
		КонецЕсли; 	
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Объект.RimType) Тогда
		Если Объект.TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьДиски() Тогда
			Объект.RimType = ПредопределенноеЗначение("Перечисление.ns_RimTypeDisk.ПустаяСсылка");
		Иначе
			Объект.RimType = ПредопределенноеЗначение("Перечисление.ns_RimTypeWheels.ПустаяСсылка");
		КонецЕсли; 	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.TireSectionWidth) Тогда
		Если Объект.TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьШины() Тогда
			Объект.TireSectionWidth = ПредопределенноеЗначение("Перечисление.ns_TireSectionWidthШины.ПустаяСсылка");
		ИначеЕсли Объект.TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьКолеса() Тогда 
			Объект.TireSectionWidth = ПредопределенноеЗначение("Перечисление.ns_TireSectionWidthКолёса.ПустаяСсылка");
		ИначеЕсли Объект.TypeId = ns_ЗапчастиИАксессуарыПовтИсп.ПолучитьМотошины() Тогда 
			Объект.TireSectionWidth = ПредопределенноеЗначение("Перечисление.ns_TireSectionWidthМотошины.ПустаяСсылка");
		КонецЕсли; 	
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьМассивОчищаемыхПолейTypeId() Экспорт
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("RimBolts");
	МассивПолей.Добавить("RimBoltsDiameter");
	МассивПолей.Добавить("RimDiameter");
	МассивПолей.Добавить("RimOffset");
	МассивПолей.Добавить("RimType");
	МассивПолей.Добавить("RimWidth");
	МассивПолей.Добавить("TireAspectRatio");
	МассивПолей.Добавить("TireSectionWidth");
	МассивПолей.Добавить("TireType");
	МассивПолей.Добавить("WheelAxle");
	МассивПолей.Добавить("RunFlat");
	МассивПолей.Добавить("Homologation");
	МассивПолей.Добавить("Model");
	МассивПолей.Добавить("SpeedIndex");
	МассивПолей.Добавить("LoadIndex");
	МассивПолей.Добавить("ResidualTread");
	МассивПолей.Добавить("TiresModels");
	МассивПолей.Добавить("Quantity");
	
	Возврат МассивПолей;
КонецФункции









