
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.БТ_ПланДДС.Записывать = Истина;
	Движения.БТ_ПланДДС.Очистить();
	Для Каждого ТекСтрокаДонор Из Донор Цикл        
		
		Движение = Движения.БТ_ПланДДС.Добавить();   
		
		Движение.Период 				= Дата;
		Движение.Организация 			= ТекСтрокаДонор.Организация;
		Движение.Сценарий 				= ТекСтрокаДонор.Сценарий;
		Движение.СтатьяДДС 				= ТекСтрокаДонор.СтатьяДДС;
		Движение.ПодразделениеКомпании 	= ТекСтрокаДонор.Подразделение;
		Движение.Сумма 					= -ТекСтрокаДонор.Сумма; 
		
	КонецЦикла;

	Для Каждого ТекСтрокаДонор Из Реципиент Цикл    
		
		Движение = Движения.БТ_ПланДДС.Добавить(); 
		
		Движение.Период 				= Дата;
		Движение.Сценарий 				= ТекСтрокаДонор.Сценарий;
		Движение.СтатьяДДС 				= ТекСтрокаДонор.СтатьяДДС;
		Движение.ПодразделениеКомпании 	= ТекСтрокаДонор.Подразделение; 
		Движение.Организация 			= ТекСтрокаДонор.Организация;
		Движение.Сумма 					= ТекСтрокаДонор.Сумма; 
		
	КонецЦикла;

КонецПроцедуры      

Функция РольКазначея()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.БТ_АдресатыЗаявок КАК БТ_АдресатыЗаявок
		|ГДЕ
		|	БТ_АдресатыЗаявок.Согласующий = &Согласующий
		|	И БТ_АдресатыЗаявок.Роль = ЗНАЧЕНИЕ(Перечисление.БТ_РолиАдресатовЗаявок.Казначей)";
	
	Запрос.УстановитьПараметр("Согласующий", ПараметрыСеанса.Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение и не РольКазначея() Тогда
		
		Сообщить("Проведение документа разрешено только пользователю с ролью Казначей");
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
