// Поиск Ссылок на данный объект из других объектов
//
// Параметры:
//  ЭтаФорма - ссылка на форму
//
Процедура НайтиВходящие(ЭтаФорма = Неопределено) Экспорт 
	Если ЭтаФорма = Неопределено Тогда
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму();			
	Иначе
		ФормаОтчета = Неопределено;
	КонецЕсли;
	СписокСсылокИспользуется = Новый ТаблицаЗначений;
	СписокСсылокИспользуется.Колонки.Добавить("Объект",Новый ОписаниеТипов(),"Объект");
	СписокСсылокИспользуется.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"),"Тип");	
	
	Если ОбъектСсылка<>Неопределено Тогда
		МассивПоиска=Новый Массив(1);
		МассивПоиска[0]=ОбъектСсылка.Ссылка;
		//БИЗТЕХ МАМОНОВ 12.11.2025 ++
		//Добавил исключение. Теперь будет происходить поиск ссылок на все объекты кроме тех, у которых не стоит право "Чтение"
		МассивИсключений = Новый Массив;
		Для Каждого ОбМетаданных Из Метаданные.РегистрыСведений Цикл
			Если НЕ ПравоДоступа("Чтение", ОбМетаданных, ПараметрыСеанса.Пользователь) Тогда
				МассивИсключений.Добавить(ОбМетаданных);
			КонецЕсли;
		КонецЦикла;
		ТаблицаСсылок = НайтиПоСсылкам(МассивПоиска,,,МассивИсключений);
		//БИЗТЕХ МАМОНОВ 12.11.2025 --
		СписокСсылокИспользуется.Очистить();
		Для Каждого Элемент Из ТаблицаСсылок Цикл
		  Если Элемент.Данные<>ОбъектСсылка Тогда   		                               		  	
		  	Строка = СписокСсылокИспользуется.Добавить();
			Строка.Объект = Элемент[1];			
			Строка.Тип = ТипЗнч(Элемент[1]);
		  КонецЕсли; 		
		КонецЦикла; 		
	КонецЕсли;
	Если ФормаОтчета <> Неопределено И НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;	 
КонецПроцедуры // НайтиВходящие()

// Поиск Ссылок которые используются в данном объекте
//
// Параметры:
//  ЭтаФорма - ссылка на форму
//
Процедура НайтиИсходящие(ЭтаФорма = Неопределено) Экспорт 
	Если ЭтаФорма = Неопределено Тогда
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму();			
	Иначе
		ФормаОтчета = Неопределено;
	КонецЕсли;
    
	СписокСсылокИспользует = Новый ТаблицаЗначений;
	СписокСсылокИспользует.Колонки.Добавить("Объект",Новый ОписаниеТипов(),"Объект");
	СписокСсылокИспользует.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"),"Тип");

    Если ОбъектСсылка<>Неопределено Тогда		
		ВидДок = ОбъектСсылка.Метаданные().Имя;		
		МассивТипов=Новый Массив;
		МассивТипов.Добавить(Тип("Строка"));
		МассивТипов.Добавить(Тип("Число"));
		МассивТипов.Добавить(Тип("Дата"));
		МассивТипов.Добавить(Тип("Булево"));
		ОписаниеТиповДок = Новый ОписаниеТипов(МассивТипов,,,);    
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) ИЛИ
				  ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
			КоллекцияРеквизитов=ОбъектСсылка.Метаданные().Реквизиты
		Иначе 
			Сообщить("Поиск по данному типу ссылки не определен");
			Возврат;
		КонецЕсли;
		Для Каждого Реквизит Из КоллекцияРеквизитов Цикл
			ЗнРеквизит = ОбъектСсылка[Реквизит.Имя];
			Если НЕ обЗначениеНеЗаполнено(ЗнРеквизит) И (Не ОписаниеТиповДок.СодержитТип(ТипЗнч(ЗнРеквизит))) Тогда
				    Строка = СписокСсылокИспользует.Добавить();
					Строка.Объект = ЗнРеквизит;
					Строка.Тип = ТипЗнч(ЗнРеквизит);
			КонецЕсли;
		КонецЦикла; 			
	КонецЕсли;
	Если ФормаОтчета <> Неопределено И НЕ ФормаОтчета.Открыта() Тогда
		ФормаОтчета.Открыть();
	КонецЕсли;
КонецПроцедуры // НайтиИсходящие()
