
&НаКлиенте
Процедура ЗаполнитьОрганиченияИспользованияРекурсивно(ДоступныеПоляВыбора, ОграниченияИспользованияПолей)
	
	СистемноеПоле = Новый ПолеКомпоновкиДанных("СистемныеПоля");
	Для Каждого ТекПоле Из ДоступныеПоляВыбора.Элементы Цикл
		Если ТекПоле.Ресурс Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекПоле.Папка Тогда
			ЗаполнитьОрганиченияИспользованияРекурсивно(ТекПоле, ОграниченияИспользованияПолей);
		Иначе
			НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
			НовоеОграничение.Поле        = ТекПоле.Поле;
			НовоеОграничение.Доступность = Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Событие") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Вставить содержимое обработчика.
	Если Параметры.Свойство("СхемаКомпоновки") Тогда
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.СхемаКомпоновки));
		СхемаКомпоновки = Параметры.СхемаКомпоновки;
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкиОтчета);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоРесурсы") Тогда
		ТолькоРесурсы = Параметры.ТолькоРесурсы;
	КонецЕсли;
	
	// Получим настройки для текущей строки структуры настроек
	СтрокаНастроек = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока = КомпоновщикНастроек.Настройки.ПолучитьИдентификаторПоОбъекту(СтрокаНастроек);
	
	Событие = Параметры.Событие;
	Если Событие = "Выбор" Тогда
		
		ЭтаФорма.Заголовок = "Реквизиты группировки";
		Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаВыбор;
		
		Если Параметры.Свойство("ПоляВыбора") Тогда
			ОтчетыКлиентСервер.ЗаполнитьНастройкиОтчета(ЭтаФорма, СтрокаНастроек.Выбор, Параметры.ПоляВыбора.Элементы, СтрокаНастроек.Выбор.ДоступныеПоляВыбора);
		КонецЕсли;
		
	ИначеЕсли Событие = "Порядок" Тогда
		
		ЭтаФорма.Заголовок = "Порядок группировки";
		Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаПорядок;
		
		Если Параметры.Свойство("ПоляПорядка") Тогда
			ОтчетыКлиентСервер.ЗаполнитьНастройкиОтчета(ЭтаФорма, СтрокаНастроек.Порядок, Параметры.ПоляПорядка.Элементы, СтрокаНастроек.Порядок.ДоступныеПоляПорядка);
		КонецЕсли;
		
	ИначеЕсли Событие = "ПоляГруппировки" Тогда
		
		ЭтаФорма.Заголовок = "Поля группировки";
		Элементы.ГруппаПоляВыбора.ТекущаяСтраница = Элементы.ГруппаПоляГруппировки;
		
		Если Параметры.Свойство("ПоляГруппировки") Тогда
			ОтчетыКлиентСервер.ЗаполнитьНастройкиОтчета(ЭтаФорма, СтрокаНастроек.ПоляГруппировки, Параметры.ПоляГруппировки.Элементы, СтрокаНастроек.ПоляГруппировки.ДоступныеПоляПолейГруппировок);
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Свойство("ТекущееПоле", ТекущееПоле);
	
	Если Параметры.Свойство("ГруппировкиСтруктуры") Тогда
		ГруппировкиСтруктуры.ЗагрузитьЗначения(Параметры.ГруппировкиСтруктуры);
	КонецЕсли;
	
	Если ГруппировкиСтруктуры.Количество() = 0 Тогда
		Элементы.ДоступныеПоляВыбора.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
		Элементы.ДоступныеПоляПорядка.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ТекущееПоле) = Тип("ПолеКомпоновкиДанных") Тогда
		Если Событие = "Выбор" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ТекущееПоле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				Элементы.ДоступныеПоляВыбора.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
		ИначеЕсли Событие = "Порядок" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.НайтиПоле(ТекущееПоле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				Элементы.ДоступныеПоляПорядка.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
		ИначеЕсли Событие = "ПоляГруппировки" Тогда
			ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ТекущееПоле);
			Если НЕ ДоступноеПоле = Неопределено Тогда
				ИдентификаторСтроки = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.ПолучитьИдентификаторПоОбъекту(ДоступноеПоле);
				Элементы.ДоступныеПоляГруппировок.ТекущаяСтрока = ИдентификаторСтроки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Событие = "Выбор" Тогда
		ДоступныеПоляВыбора = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляВыбора.ОграниченияИспользования;
		
		Для Каждого ЭлементСписка Из ГруппировкиСтруктуры Цикл
			
			ПолеГруппировки = ЭлементСписка.Значение;
			
			ПоляВетки = КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.НайтиПоле(ПолеГруппировки);
			
			РодительГруппировки = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки);
			Пока НЕ РодительГруппировки = Неопределено Цикл
				Если РодительГруппировки.Родитель = Неопределено Тогда
					Для Каждого ТекПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
						
						Если НЕ ГруппировкиСтруктуры.НайтиПоЗначению(ТекПоле.Поле) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				Иначе
					Для Каждого ТекПоле Из РодительГруппировки.Родитель.Элементы Цикл
						
						Если НЕ ГруппировкиСтруктуры.НайтиПоЗначению(ТекПоле.Поле) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				КонецЕсли;
				РодительГруппировки = РодительГруппировки.Родитель;
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Событие = "Порядок" И ТолькоРесурсы Тогда
		
		ДоступныеПоляПорядка          = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляПорядка.ОграниченияИспользования;
		
		ЗаполнитьОрганиченияИспользованияРекурсивно(ДоступныеПоляПорядка, ОграниченияИспользованияПолей);
		
	ИначеЕсли Событие = "Порядок" Тогда
		
		ДоступныеПоляПорядка          = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка;
		ОграниченияИспользованияПолей = Элементы.ДоступныеПоляПорядка.ОграниченияИспользования;
		
		Для Каждого ЭлементСписка Из ГруппировкиСтруктуры Цикл
			
			ПолеГруппировки = ЭлементСписка.Значение;
			
			ПоляВетки = КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.НайтиПоле(ПолеГруппировки);
			
			РодительГруппировки = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(ПолеГруппировки);
			Пока НЕ РодительГруппировки = Неопределено Цикл
				Если РодительГруппировки.Родитель = Неопределено Тогда
					Для Каждого ТекПоле Из КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.Элементы Цикл
						
						Если НЕ ГруппировкиСтруктуры.НайтиПоЗначению(ТекПоле.Поле) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				Иначе
					Для Каждого ТекПоле Из РодительГруппировки.Родитель.Элементы Цикл
						
						Если НЕ ГруппировкиСтруктуры.НайтиПоЗначению(ТекПоле.Поле) = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						НовоеОграничение = ОграниченияИспользованияПолей.Добавить();
						НовоеОграничение.Поле        = ТекПоле.Поле;
						НовоеОграничение.Доступность = Ложь;
					КонецЦикла;
				КонецЕсли;
				РодительГруппировки = РодительГруппировки.Родитель;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура;
	
	ИдентификаторОбъекта = Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока;
	
	Если ИдентификаторОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получим строку структуры
	СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
	
	Если Событие = "Выбор" Тогда
		
		Результат.Вставить("Выбор", СтрокаСтруктуры.Выбор);
		
	ИначеЕсли Событие = "Порядок" Тогда
		
		Результат.Вставить("Порядок", СтрокаСтруктуры.Порядок);
		
	ИначеЕсли Событие = "ПоляГруппировки" Тогда
		
		Результат.Вставить("ПоляГруппировки", СтрокаСтруктуры.ПоляГруппировки);
		
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОповещенияВыбораПоля(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
//	
//	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
//		
//		Если Событие = "Выбор" Тогда
//			
//			ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиЭлементВыбор.ТекущаяСтрока;
//			Если ТекущаяСтрока = Неопределено Тогда
//				Возврат;
//			КонецЕсли;
//			// Получим строку структуры
//			СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока);
//			// Получим строку реквизитов
//			СтрокаРеквизита = СтрокаСтруктуры.Выбор.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
//			// Заменим поле порядка
//			СтрокаРеквизита.Поле = РезультатЗакрытия.Поле;
//			
//		ИначеЕсли Событие = "Порядок" Тогда
//			
//			ТекущаяСтрока = Элементы.КомпоновщикНастроекНастройкиЭлементПорядок.ТекущаяСтрока;
//			Если ТекущаяСтрока = Неопределено Тогда
//				Возврат;
//			КонецЕсли;
//			// Получим строку структуры
//			СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока);
//			// Получим строку порядка
//			СтрокаПорядка   = СтрокаСтруктуры.Порядок.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
//			// Заменим поле порядка
//			СтрокаПорядка.Поле = РезультатЗакрытия.Поле;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомпоновщикНастроекНастройкиЭлементПорядокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	СтруктураПараметров = Новый Структура();
//	СтруктураПараметров.Вставить("СхемаКомпоновки",      СхемаКомпоновки);
//	СтруктураПараметров.Вставить("Событие",             "Порядок");
//	СтруктураПараметров.Вставить("ГруппировкиСтруктуры", ГруппировкиСтруктуры.ВыгрузитьЗначения());
//	
//	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("ОповещенияВыбораПоля", ЭтаФорма);
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомпоновщикНастроекНастройкиЭлементПорядокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	СтруктураПараметров = Новый Структура();
//	СтруктураПараметров.Вставить("СхемаКомпоновки",      СхемаКомпоновки);
//	//СтруктураПараметров.Вставить("Поле",           ТекущаяСтрока.Поле);
//	СтруктураПараметров.Вставить("Событие",             "Порядок");
//	СтруктураПараметров.Вставить("ГруппировкиСтруктуры", ГруппировкиСтруктуры.ВыгрузитьЗначения());
//	
//	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("ОповещенияВыбораПоля", ЭтаФорма);
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомпоновщикНастроекНастройкиЭлементВыборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	СтруктураПараметров = Новый Структура();
//	СтруктураПараметров.Вставить("СхемаКомпоновки",      СхемаКомпоновки);
//	//СтруктураПараметров.Вставить("Поле",           ТекущаяСтрока.Поле);
//	СтруктураПараметров.Вставить("Событие",             "Выбор");
//	СтруктураПараметров.Вставить("ГруппировкиСтруктуры", ГруппировкиСтруктуры.ВыгрузитьЗначения());
//	
//	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("ОповещенияВыбораПоля", ЭтаФорма);
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомпоновщикНастроекНастройкиЭлементВыборПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	СтруктураПараметров = Новый Структура();
//	СтруктураПараметров.Вставить("СхемаКомпоновки",      СхемаКомпоновки);
//	СтруктураПараметров.Вставить("Событие",             "Выбор");
//	СтруктураПараметров.Вставить("ГруппировкиСтруктуры", ГруппировкиСтруктуры.ВыгрузитьЗначения());
//	
//	ОписаниеОповещенияВыбораПоля = Новый ОписаниеОповещения("ОповещенияВыбораПоля", ЭтаФорма);
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораПолейОтчета", СтруктураПараметров, Элемент,,,, ОписаниеОповещенияВыбораПоля, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьРеквизиты(Команда)
//	
//	ИдентификаторОбъекта = Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока;
//	
//	Если ИдентификаторОбъекта = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Получим строку структуры
//	СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
//	СтрокаСтруктуры.Выбор.Элементы.Очистить();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьПорядок(Команда)
//	
//	ИдентификаторОбъекта = Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока;
//	
//	Если ИдентификаторОбъекта = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Получим строку структуры
//	СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
//	СтрокаСтруктуры.Порядок.Элементы.Очистить();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОчиститьПоляГруппировки(Команда)
//	
//	ИдентификаторОбъекта = Элементы.КомпоновщикНастроекНастройки.ТекущаяСтрока;
//	
//	Если ИдентификаторОбъекта = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	// Получим строку структуры
//	СтрокаСтруктуры = КомпоновщикНастроек.Настройки.ПолучитьОбъектПоИдентификатору(ИдентификаторОбъекта);
//	СтрокаСтруктуры.ПоляГруппировки.Элементы.Очистить();
//	
//КонецПроцедуры
