Функция КорректностьРезультатаПроверкиСведенийОТоваре(РезультатПроверкиСведенийОТоваре) Экспорт
	
	// Корректный статус = 15
	КорректностьРезультатаПроверки = Ложь;
	
	Если РезультатПроверкиСведенийОТоваре < 0 Тогда
		Возврат КорректностьРезультатаПроверки;
	КонецЕсли;
	
	РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, 0);
	Если РезультатПроверки Тогда
		КорректностьРезультатаПроверки = Истина;
	КонецЕсли;
	Если КорректностьРезультатаПроверки Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, 1);
		КорректностьРезультатаПроверки = РезультатПроверки;
	КонецЕсли;
	Если КорректностьРезультатаПроверки Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, 2);
		КорректностьРезультатаПроверки = РезультатПроверки;
	КонецЕсли;
	Если КорректностьРезультатаПроверки Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, 3);
		КорректностьРезультатаПроверки = РезультатПроверки;
	КонецЕсли;
	Если КорректностьРезультатаПроверки Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, 4);
		КорректностьРезультатаПроверки = НЕ РезультатПроверки;
	КонецЕсли;
	
	Возврат КорректностьРезультатаПроверки;
		
КонецФункции

Функция РасшифровкаРезультатаПроверкиСведенийОТоваре(РезультатПроверкиСведенийОТоваре, НомерБита) Экспорт
	
	Если НомерБита = 0 ИЛИ НомерБита = 1 ИЛИ НомерБита = 2 ИЛИ НомерБита = 3 ИЛИ НомерБита = 4 Тогда
		Попытка
			РезультатПроверки = ПроверитьБит(РезультатПроверкиСведенийОТоваре, НомерБита);
		Исключение
			РезультатПроверки = Ложь;
		КонецПопытки;
		Если НомерБита = 0 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Код маркировки проверен.";
			Иначе 
				РезультатПроверкиТекст = "Код маркировки не был проверен ФН и (или) ОИСМ.";
			КонецЕсли;
		ИначеЕсли НомерБита = 1 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Результат проверки КП КМ положительный.";
			Иначе 
				РезультатПроверкиТекст = "Результат проверки КП КМ отрицательный или код маркировки не был проверен.";
			КонецЕсли;
		ИначеЕсли НомерБита = 2 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Проверка статуса ОИСМ выполнена.";
			Иначе 
				РезультатПроверкиТекст = "Сведения о статусе товара от ОИСМ не получены.";
			КонецЕсли;
		ИначеЕсли НомерБита = 3 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "От ОИСМ получены сведения, что планируемый статус товара корректен.";
			Иначе 
				РезультатПроверкиТекст = "От ОИСМ получены сведения, что планируемый статус товара некорректен или сведения о статусе товара от ОИСМ не получены.";
			КонецЕсли;
		ИначеЕсли НомерБита = 4 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Результат проверки КП КМ сформирован ККТ, работающей в автономном режиме.";
			Иначе 
				РезультатПроверкиТекст = "Результат проверки КП КМ и статуса товара сформирован ККТ, работающей в режиме передачи данных.";
			КонецЕсли;
		КонецЕсли;
	Иначе	
		РезультатПроверкиТекст = "Недопустимый код проверки сведений о товаре.";
	КонецЕсли;
	
	Возврат РезультатПроверкиТекст;
		
КонецФункции
