
&НаСервере
Процедура ПривязатьТранзакциюНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьТранзакцию(Команда)
	ПривязатьТранзакциюНаСервере();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	//ПараметрыФормы.Вставить("ТекущийДокумент",Объект.Ссылка);
	//ЭтаФорма.ТолькоПросмотр = Истина; 
	ФормаТерминалов = ПолучитьФорму("Обработка.AB_НеобработанныеТранзакции.Форма.ФормаВыбораТерминала",ПараметрыФормы,ЭтаФорма);
	ФормаТерминалов.Открыть();
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораНаСервере(Терминал,Транзакция)
	Успешно = AB_ОбщийМодульАльфаБанкСервер.ПривязатьТранзакциюПринудительно(Транзакция,Терминал);
	Если Успешно Тогда
		Сообщить("Успешно");
	Иначе
		Сообщить("Ошибка привязки транзакции");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ID = Элементы.ТаблицаТранзакций.ТекущиеДанные.UUID1;
	Если ЗначениеЗаполнено(ID) Тогда
		ОбработкаВыбораНаСервере(ВыбранноеЗначение,Элементы.ТаблицаТранзакций.ТекущиеДанные.UUID1);
	Иначе
		Сообщить("Не выбрана транзакция");
	КонецЕсли;
КонецПроцедуры
