//Область Category

Функция ПолучитьРодителя() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Личные вещи");
КонецФункции

Функция ПолучитьСписокКатегорий() Экспорт
	СписокКатегорий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_Category.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_Category КАК ns_Category
	|ГДЕ
	|	ns_Category.Родитель = &Родитель";
	Запрос.УстановитьПараметр("Родитель", ПолучитьРодителя());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокКатегорий;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКатегорий.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СписокКатегорий;
КонецФункции

Функция ПолучитьОдеждаОбувьАксессуары() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Одежда, обувь, аксессуары");
КонецФункции

Функция ПолучитьДетскаяОдеждаИОбувь() Экспорт
	Возврат Справочники.ns_Category.НайтиПоНаименованию("Детская одежда и обувь");
КонецФункции

//КонецОбласти 

//Область GoodsType

Функция ПолучитьСписокПодкатегорий(Категория) Экспорт
	СписокПодкатегорий = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Категория) Тогда
		Возврат СписокПодкатегорий;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GoodsType.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_GoodsType_ЛичныеВещи КАК GoodsType
	|ГДЕ
	|	GoodsType.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Категория);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокПодкатегорий;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокПодкатегорий.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат СписокПодкатегорий;
КонецФункции

Функция ПолучитьЖенскаяОдежда() Экспорт
	Возврат Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию("Женская одежда");
КонецФункции

Функция ПолучитьМужскаяОдежда() Экспорт
	Возврат Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию("Мужская одежда");
КонецФункции

Функция ПолучитьДляДевочек() Экспорт
	Возврат Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию("Для девочек");
КонецФункции

Функция ПолучитьДляМальчиков() Экспорт
	Возврат Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию("Для мальчиков");
КонецФункции

Функция ПолучитьАксессуары() Экспорт
	Возврат Справочники.ns_GoodsType_ЛичныеВещи.НайтиПоНаименованию("Аксессуары");
КонецФункции

//КонецОбласти 

//Область Apparel

//Область Женская

Функция ПолучитьЖенскаяОдежда_ВерхняяОдежда() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Верхняя одежда",,, ns_ЛичныеВещиПовтИсп.ПолучитьЖенскаяОдежда());
КонецФункции

Функция ПолучитьЖенскаяОдежда_Обувь() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Обувь",,, ns_ЛичныеВещиПовтИсп.ПолучитьЖенскаяОдежда());
КонецФункции

Функция ПолучитьЖенскаяОдежда_Джинсы() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Джинсы",,, ns_ЛичныеВещиПовтИсп.ПолучитьЖенскаяОдежда());
КонецФункции

//КонецОбласти 

//Область Мужская

Функция ПолучитьМужскаяОдежда_ВерхняяОдежда() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Верхняя одежда",,, ns_ЛичныеВещиПовтИсп.ПолучитьМужскаяОдежда());
КонецФункции

Функция ПолучитьМужскаяОдежда_Обувь() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Обувь",,, ns_ЛичныеВещиПовтИсп.ПолучитьМужскаяОдежда());
КонецФункции
 
Функция ПолучитьМужскаяОдежда_Джинсы() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Джинсы",,, ns_ЛичныеВещиПовтИсп.ПолучитьМужскаяОдежда());
КонецФункции

//КонецОбласти 

//Область Детская

Функция ПолучитьДляДевочек_Обувь() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Обувь",,, ns_ЛичныеВещиПовтИсп.ПолучитьДляДевочек());
КонецФункции

Функция ПолучитьДляМальчиков_Обувь() Экспорт
	Возврат Справочники.ns_Apparel.НайтиПоНаименованию("Обувь",,, ns_ЛичныеВещиПовтИсп.ПолучитьДляМальчиков());
КонецФункции

//КонецОбласти 

Функция ПолучитьСписокApparel(Подкатегория) Экспорт
	МассивДанных = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Подкатегория) Тогда
		Возврат МассивДанных;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Apparel.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_Apparel КАК Apparel
	|ГДЕ
	|	Apparel.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Apparel.Наименование";
	Запрос.УстановитьПараметр("Владелец", Подкатегория);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивДанных;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДанных.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

Функция ПолучитьСписокApparelType(Apparel) Экспорт
	МассивДанных = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Apparel) Тогда
		Возврат МассивДанных;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ApparelType.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ns_ApparelType КАК ApparelType
	|ГДЕ
	|	ApparelType.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	ApparelType.Наименование";
	Запрос.УстановитьПараметр("Владелец", Apparel);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивДанных;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивДанных.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

//КонецОбласти 

//Область Size

Функция ПолучитьСписокSize(GoodsType, Apparel) Экспорт
	
	Если GoodsType = ПолучитьЖенскаяОдежда() Тогда
		Если НЕ ЗначениеЗаполнено(Apparel) Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_ЖенскаяОдежда();
		ИначеЕсли Apparel = ПолучитьЖенскаяОдежда_Джинсы() Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_ЖенскаяОдежда_Джинсы();
		ИначеЕсли Apparel = ПолучитьЖенскаяОдежда_Обувь() Тогда	
			Возврат ns_ЛичныеВещи.ПолучитьSize_ЖенскаяОдежда_Обувь();
		Иначе
			Возврат ns_ЛичныеВещи.ПолучитьSize_ЖенскаяОдежда();
		КонецЕсли;
	ИначеЕсли GoodsType = ПолучитьМужскаяОдежда() Тогда	
		Если НЕ ЗначениеЗаполнено(Apparel) Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_МужскаяОдежда(); 
		ИначеЕсли Apparel = ПолучитьМужскаяОдежда_Джинсы() Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_МужскаяОдежда_Джинсы();
		ИначеЕсли Apparel = ПолучитьМужскаяОдежда_Обувь() Тогда	
			Возврат ns_ЛичныеВещи.ПолучитьSize_МужскаяОдежда_Обувь();
		Иначе	
			Возврат ns_ЛичныеВещи.ПолучитьSize_МужскаяОдежда(); 
		КонецЕсли;
	ИначеЕсли GoodsType = ПолучитьДляДевочек() ИЛИ GoodsType = ПолучитьДляМальчиков() Тогда	
		Если НЕ ЗначениеЗаполнено(Apparel) Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_ДляДевочекИМальчиков();	
		ИначеЕсли Apparel = ПолучитьДляДевочек_Обувь() ИЛИ Apparel = ПолучитьДляМальчиков_Обувь() Тогда
			Возврат ns_ЛичныеВещи.ПолучитьSize_ДляДевочекИМальчиков_Обувь();
		Иначе
			Возврат ns_ЛичныеВещи.ПолучитьSize_ДляДевочекИМальчиков();	
		КонецЕсли;
	КонецЕсли; 
	
	СписокSize = Новый Массив;
	Возврат СписокSize;
КонецФункции
 
//КонецОбласти 














