// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра  сведений "Операции прослеживаемых товаров".
//
// Возвращаемое значение:
//  Строка - текст запроса
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
	|	ОстаткиАвтомобилей.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОстаткиАвтомобилей.ГТД.РНПТ
	|	И ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратПоставщикуАвтомобилей";
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ВозвратПоставщикуАвтомобилей" , "Возвратная накладная");
	СтруктураМакетов.Вставить("ТОРГ12"                       , "ТОРГ-12 (Товарная накладная)");
	СтруктураМакетов.Вставить("МХ3"                          , "МХ-3 (Акт о возврате ТМЦ)");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецОбласти