
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.атКодСостояния%10 <> 3 Тогда // Не авторизован
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьФорму(Параметры);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорму(ПараметрыОткрытия)
	Если ПараметрыОткрытия.Свойство("Описание") Тогда
		Описание = ПараметрыОткрытия.Описание;
	Иначе
		Описание = "";
	КонецЕсли;
	
	Если ПараметрыОткрытия.Свойство("ПодключатьУслуги") Тогда
		Элементы.ПодключитьУслугу.Видимость = ПараметрыОткрытия.ПодключатьУслуги;
	Иначе
		Элементы.ПодключитьУслугу.Видимость = Ложь;
	КонецЕсли;
	
	ТаблицаЛимитов.Очистить();
	Если ПараметрыОткрытия.Свойство("ТаблицаЛимитов") Тогда
		//Элементы.ТаблицаЛимитов.Видимость = Истина;
		
		Для каждого СтрокаСервиса Из ПараметрыОткрытия.ТаблицаЛимитов Цикл
			НоваяСтрока = ТаблицаЛимитов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСервиса);
			НоваяСтрока.Наименование = СтрокаСервиса.Сервис.Наименование;
		КонецЦикла;
	Иначе
		//Элементы.ТаблицаЛимитов.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУслугу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "атПомощникПродаж_ОписаниеОбъекта_ПриОткрытии" Тогда
		ЗаполнитьФорму(Параметр);
	КонецЕсли;
КонецПроцедуры
