
Процедура ЗаполнитьПоляТабличнойЧасти(Объект, ИмяТабличнойЧасти, ДанныеЗаполнения, ОтборТабличнойЧаст = Неопределено) Экспорт
	
	Строки = ?(ОтборТабличнойЧаст <> Неопределено, Объект[ИмяТабличнойЧасти].НайтиСтроки(ОтборТабличнойЧаст), Объект[ИмяТабличнойЧасти]);
	Для Каждого Строка Из Строки Цикл
		ЗаполнитьЗначенияСвойств(Строка, ДанныеЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

Функция НомерДляСФ(НомерДекларации, Дополнение) Экспорт
	
	Возврат НомерДекларации +"/"+ Дополнение;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти