
//возвращает по значению перечисления картинку из библиотеки                
Функция ПолучитьИмяКартинки(ВыбЗначение) Экспорт
	
	Если ТипЗнч(ВыбЗначение) <> ТипЗнч(Перечисления.ВидыСобытий.ПустаяСсылка()) Тогда
		Возврат "ПрочееСобытие";
	КонецЕсли;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.Анкетирование, 			"Клиенты16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ВыдачаАвтомобиля, 		"АвтомобильВыдача16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЗаменаАвтомобиля, 		"Автосалон16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЛичнаяВстреча, 			"СобытияВстреча16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ОтказОтАвтомобиля, 		"АвтомобильОтказ16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ПереуступкаАвтомобиля, 	"АвтомобильПодбор16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ПочтовоеПисьмо, 			"КонтактнаяИнформацияДругое");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.Прочее, 					"ПрочееСобытие");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ТелефонныйЗвонок, 		"СобытияЗвонок16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ТестДрайв, 				"АвтомобильТестДрайв16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ЭлектронноеПисьмо, 		"КонтактнаяИнформацияЭлектроннаяПочта");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.SMS, 					"СобытияSMS16");
	СоответствиеКартинки.Вставить(Перечисления.ВидыСобытий.ИнтернетЗапрос, 			"КонтактнаяИнформацияВебСтраница");
	
 	ИмяКартинки = СоответствиеКартинки.Получить(ВыбЗначение);
	Если ИмяКартинки = Неопределено Тогда
		Возврат "ПрочееСобытие";
	КонецЕсли;
	
	Возврат ИмяКартинки;
КонецФункции


//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	Список = Новый СписокЗначений;

	//Для Каждого ТекПеречисление Из Метаданные.Перечисления.ВидыСобытий.ЗначенияПеречисления Цикл
	//	ТекЗначение = Перечисления.ВидыСобытий[ТекПеречисление.Имя];
	//	Список.Добавить(ТекЗначение,ТекПеречисление.Синоним,,ПолучитьКартинкуСобытия(ТекЗначение));	
	//КонецЦикла;
	
	//перегруппируем события
	Список.Добавить(Перечисления.ВидыСобытий.ВыдачаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ЗаменаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ОтказОтАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ПереуступкаАвтомобиля);
	Список.Добавить(Перечисления.ВидыСобытий.ТестДрайв);
	Список.Добавить(Перечисления.ВидыСобытий.Анкетирование);
	Список.Добавить(Перечисления.ВидыСобытий.ЛичнаяВстреча);
	Список.Добавить(Перечисления.ВидыСобытий.ПочтовоеПисьмо);
	Список.Добавить(Перечисления.ВидыСобытий.ТелефонныйЗвонок);
	Список.Добавить(Перечисления.ВидыСобытий.ЭлектронноеПисьмо);
	Список.Добавить(Перечисления.ВидыСобытий.SMS);
	Список.Добавить(Перечисления.ВидыСобытий.ИнтернетЗапрос);
	Список.Добавить(Перечисления.ВидыСобытий.Прочее);
	
	Для Каждого ТекВид Из Список Цикл
		ТекВид.Представление = СокрЛП(Строка(ТекВид.Значение));
		ИмяКартинки = ПолучитьИмяКартинки(ТекВид.Значение);
		ТекВид.Картинка = БиблиотекаКартинок[ИмяКартинки];
	КонецЦикла;
	
	Возврат Список;
КонецФункции
#КонецЕсли

