
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("СкладКомпании");
	СтруктураСвойств.Вставить("Подразделение");
	СтруктураСвойств.Вставить("Номенклатура");
	СтруктураСвойств.Вставить("Организация");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура УстановитьПараметры()
	
	ЕстьОтборПоПодразделению          = (ОтчетыСервер.КомпоновщикСчетчикУсловийПоля(Новый ПолеКомпоновкиДанных("Подразделение"), КомпоновщикНастроек.Настройки.Отбор) = 1);
	ЕстьОтборПоПодразделениюИлиСкладу = (ОтчетыСервер.КомпоновщикСчетчикУсловийПоля(Новый ПолеКомпоновкиДанных("СкладКомпании"), КомпоновщикНастроек.Настройки.Отбор) > 0);
	ЕстьПодразделение                 = ОтчетыСервер.КомпоновщикЕстьПолеВСтруктуре(Новый ПолеКомпоновкиДанных("Подразделение"),  КомпоновщикНастроек.Настройки.Структура);
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьПодразделение",                 ЕстьПодразделение);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьОтборПоПодразделениюИлиСкладу", ЕстьОтборПоПодразделениюИлиСкладу);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЕстьОтборПоПодразделению",          ЕстьОтборПоПодразделению);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	УстановитьПараметры();
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЕстьОтборПоПодразделению = (ОтчетыСервер.КомпоновщикСчетчикУсловийПоля(Новый ПолеКомпоновкиДанных("Подразделение"), КомпоновщикНастроек.Настройки.Отбор) = 1);
	ЕстьПодразделение        = ОтчетыСервер.КомпоновщикЕстьПолеВСтруктуре(Новый ПолеКомпоновкиДанных("Подразделение"), КомпоновщикНастроек.Настройки.Структура);
	
	Если (НЕ ЕстьПодразделение) И (НЕ ЕстьОтборПоПодразделению) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не задано подразделение! Будут выбраны минимальные остатки по компании.";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
