////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ДОКУМЕНТАМИ
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Выводит накопленные результаты (ошибки) обработки проведения документа
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, документ, для которого производится действие
// Отказ 		 – булево, признак отказа от действия
// СтрСообщения - строка, строка сообщения
//
Процедура дкВыводРезультатовОбработки(ЭтотОбъект,Отказ,СтрСообщения = "") Экспорт
	
	Если Отказ И ЭтотОбъект.Метаданные().УдалениеДвижений = Метаданные.СвойстваОбъектов.УдалениеДвижений.НеУдалятьАвтоматически Тогда
		дкУдалениеДвиженийДокумента(ЭтотОбъект);
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.РезультатОбработки) = Тип("Строка") Тогда
		Если НЕ ПустаяСтрока(ЭтотОбъект.РезультатОбработки) Тогда
			Если Отказ Тогда
				Сообщить("При проведении < " + СокрЛП(ЭтотОбъект ) + " > обнаружены ошибки:", СтатусСообщения.Внимание);
			Иначе
				Сообщить("При проведении < " + СокрЛП(ЭтотОбъект) + " > зафиксированы предупреждения:", СтатусСообщения.Информация);
			КонецЕсли;
			Сообщить(ЭтотОбъект.РезультатОбработки);
			#Если Клиент Тогда
				СтрСообщения = ЭтотОбъект.РезультатОбработки;
			#КонецЕсли
		КонецЕсли;
		Если Отказ Тогда
			Сообщить("Из-за возникших ошибок процедура проведения " + ?(НЕ ПустаяСтрока(ЭтотОбъект.РезультатОбработки), "", " < " + СокрЛП(ЭтотОбъект) + " > ") + " была прервана!", СтатусСообщения.Внимание);
		КонецЕсли;
	Иначе
		Если Отказ Тогда
			ЭтотОбъект.РезультатОбработки.ЗаголовокФормы = "При проведении < " + СокрЛП(ЭтотОбъект) + " > обнаружены ошибки:";
		Иначе
			ЭтотОбъект.РезультатОбработки.ЗаголовокФормы = "При проведении < " + СокрЛП(ЭтотОбъект) + " > зафиксированы предупреждения:";
		КонецЕсли;
		// выведем
		Если ЭтотОбъект.РезультатОбработки.Сообщения.Количество() > 0 Тогда
			ЭтотОбъект.РезультатОбработки.ПолучитьФорму().Открыть();
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Попытка
			ЭтотОбъект.ДополнительныеСвойства.ВыведеныСообщенияОбОшибке=Истина;
		Исключение
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ВыведеныСообщенияОбОшибке",Истина);
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		дкРегистрацияИзмененийДокументов(ЭтотОбъект);
	КонецЕсли; 
КонецПроцедуры // дкВыводРезультатовОбработки()

// Регистрация изменений документов в планах обмена
//
// Параметры
//  ЭтотОбъект  - Документ Объект - Объект документа, который требуется зарегистрировать в плане обмена
//
Процедура дкРегистрацияИзмененийДокументов(ЭтотОбъект)
	Загрузка = ЭтотОбъект.ОбменДанными.Загрузка;
	Если ПараметрыСеанса.ИспользованиеРБД Тогда
		Отправитель = ЭтотОбъект.ОбменДанными.Отправитель;
		ДопЗагрузка = Неопределено;
		Если НЕ Загрузка Тогда
			ЭтотОбъект.ДополнительныеСвойства.Свойство("Загрузка",ДопЗагрузка);
			Загрузка = ?(НЕ ДопЗагрузка = Неопределено,ДопЗагрузка,Загрузка); 
		КонецЕсли;
		ДопОтправитель = Неопределено;
		Если Отправитель = Неопределено Тогда
			ЭтотОбъект.ДополнительныеСвойства.Свойство("Отправитель",ДопОтправитель);
			Отправитель = ?(НЕ ДопОтправитель = Неопределено,ДопОтправитель,Отправитель); 
		КонецЕсли;	
		
		// определим, что это - загружается новый документ или 
		// пришло удаление объекта и сделать отмену проведения
		ЭтоУдалениеОбъекта = Ложь;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("УдалениеОбъекта",ЭтоУдалениеОбъекта);
		ЭтоУдалениеОбъекта = ?(ЭтоУдалениеОбъекта = неопределено,Ложь,ЭтоУдалениеОбъекта);
		
		// выполним регистрацию изменений для документа
		МассивУзловОбмена = неопределено;
		// попробуем получить тз кэша объекты метаданные, если там их нет они будут получены самостоятельно
		ПланОбменаМетаданные = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("ПланОбменаМетаданные",ПланОбменаМетаданные);
		МетаданныеОбъекта = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("МетаданныеОбъекта",МетаданныеОбъекта);
		МетаданныеДвижений = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("МетаданныеДвижений",МетаданныеДвижений);
		РежимЗаписи = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи",РежимЗаписи);
		Если РежимЗаписи = Неопределено Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли; 
		
		орРегистрацияИзмененийДокументов(ЭтотОбъект,ЭтоУдалениеОбъекта,МассивУзловОбмена,,Отправитель,
			ПланОбменаМетаданные,МетаданныеОбъекта,МетаданныеДвижений,РежимЗаписи);
	
	КонецЕсли;
КонецПроцедуры // дкРегистрацияИзмененийДокументов()

#Если Клиент Тогда
	
// Процедура формирует MXL-таблицу движений документа
	//
	// Параметры:
	// ДокументСсылка - ДокументСсылка, документ, для которого производится действие
	//
Процедура дкДвиженияДокумента(ДокументСсылка) Экспорт
	Если ДокументСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДокументСсылка)) Тогда
		ТекущийДокументСсылка = ДокументСсылка;
	Иначе
		ТекущийДокументСсылка = ДокументСсылка.Ссылка;
	КонецЕсли;	
	
	// может, ссылки еще не существует? надо сначала записать документ
	Если обЗначениеНеЗаполнено(ТекущийДокументСсылка) Тогда
		Предупреждение("Сначала запишите документ!");
		Возврат;
	КонецЕсли;
	
	// а вдруг документ в принципе не делает движений 	
	Если ТекущийДокументСсылка.Метаданные().Движения.Количество() = 0 Тогда
		Предупреждение("Документ не формирует движений!");
		Возврат;
	КонецЕсли;	
	
	Движ = Обработки.ДвиженияДокумента.Создать();
	Движ.ВыбранныйДокумент = ТекущийДокументСсылка;
	Движ.Переформировать();		
КонецПроцедуры // НапечататьДвиженияДокумента()
	
#КонецЕсли                              

Функция дкПроверитьВозможностьОперацийСНоменклатурой(ТекСтрока,ЭтаФорма=Неопределено, Знач ЭтотОбъект) Экспорт
	СтруктураРезультат = Новый Структура("Сообщение,ЕстьБлок,ЕстьПредупреждение","",Ложь,Ложь);
	Если ТипЗнч(ЭтотОбъект) = Тип("ОбработкаОбъект.ОбработкаТабличнойЧастиТовары") Тогда
		ЭтотОбъект = ЭтаФорма.ВладелецФормы.ЭтотОбъект;
	КонецЕсли;
	
	Номенклатура = ?(ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.Номенклатура"), ТекСтрока, ТекСтрока.Номенклатура);
	Если ЭтаФорма = Неопределено ИЛИ обЗначениеНеЗаполнено(Номенклатура) ИЛИ Номенклатура.ЭтоГруппа Тогда Возврат СтруктураРезультат; КонецЕсли;
	
	ТипОбъекта = ТипЗнч(ЭтотОбъект);
	
	// проверим на длок для продаж
	Если Номенклатура.ЗапретПродажи И
		(ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказПокупателя") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаявкаНаРемонт") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваров") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаРеализации") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаЗаказаПокупателя") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаменаВЗаказеПокупателя")) Тогда
		
		СтруктураРезультат.Сообщение = "Номенклатура < " + Номенклатура + " > блокированна для реализации!";
		СтруктураРезультат.ЕстьБлок  = Истина;
		
	ИначеЕсли Номенклатура.ЗапретЗакупки И
		(ТипОбъекта = Тип("ДокументОбъект.ЗаказПоставщику") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказПокупателя") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаЗаказаПоставщику") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаЗаказаПокупателя") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаменаВЗаказеПокупателя")) Тогда
		
		СтруктураРезультат.Сообщение = "Номенклатура < " + Номенклатура + " > блокированна для закупки!";
		СтруктураРезультат.ЕстьБлок  = Истина;
		
	ИначеЕсли (Номенклатура.ЗапретПродажи ИЛИ Номенклатура.ЗапретЗакупки) И
		(ТипОбъекта = Тип("ДокументОбъект.ВводОстатковТоваров") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ПеремещениеТоваров") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ПоступлениеТоваров")) ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаПоступления") Тогда
		
		СтруктураРезультат.Сообщение = "Номенклатура < " + Номенклатура + " > блокированна для " + ?(Номенклатура.ЗапретЗакупки,"закупки","")
		+ ?(Номенклатура.ЗапретПродажи И Номенклатура.ЗапретЗакупки ," и ", "") + ?(Номенклатура.ЗапретПродажи, "продажи","") + "!";
		СтруктураРезультат.ЕстьПредупреждение = Истина;
		
	ИначеЕсли (Номенклатура.СнятаСПроизводства) И
		(ТипОбъекта = Тип("ДокументОбъект.ПоступлениеТоваров") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.РеализацияТоваров") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказПокупателя") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказПоставщику") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказНаряд") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.ЗаказВнутренний") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаПоступления") ИЛИ
		ТипОбъекта = Тип("ДокументОбъект.КорректировкаРеализации")) Тогда
		
		СтруктураРезультат.Сообщение          = "Номенклатура <" +Номенклатура+ "> снята с производства.";
		СтруктураРезультат.ЕстьПредупреждение = Истина;
		
	КонецЕсли;
	
	Возврат СтруктураРезультат;
КонецФункции

// функция дополняет строку многострочного сообщения новым сообщением
//
// Параметры:
// Ошибки - строка, описание ошибок
// ЕщеСтрока – строка, дополнительная строка описания ошибки
//
// Возвращаемое значение:
// Строка - сформированная строка ошибки
//
Функция дкДобавитьОшибку(Ошибки = "",ЕщеСтрока = "") Экспорт 
	Ошибки = ?(Ошибки = "",ЕщеСтрока, Ошибки + Символы.ПС + ЕщеСтрока);
	Возврат(Ошибки);
КонецФункции // ДобавитьОшибку()

// Допроводит документ по партионным регистрам 
//
// Параметры:
// Ссылка - ДокументСсылка. Передается если надо провести только указанный документ
//
Процедура дкДопровестиПоПартиям(Ссылка = Неопределено) Экспорт
	// проверим можно ли в этом узле допроводить по партиям
	РежимПроведенияПоПартиям = одОбменДанными.ПолучитьРежимПроведенияПоПартиям();
	Если НЕ РежимПроведенияПоПартиям = Перечисления.РежимыПроведенияПартий.ПервичнымиДокументамиДопроведение Тогда
		// допроведение выполняем только если партии используются и допроведение выполняется в этом узле
		Возврат;
	КонецЕсли; 
	
	// определим, нужно ли вручную регистрировать записи регистра ДопроведениеПоПартиям
	РегистрироватьДопроведение = Ложь;
	ИспользованиеРБД = ПараметрыСеанса.ИспользованиеРБД;
	ЭтотУзел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел();
	Если ИспользованиеРБД Тогда
		ПланОбменаМетаданные = ЭтотУзел.Метаданные();
		ЭлементСостава = ПланОбменаМетаданные.Состав.Найти(Метаданные.РегистрыСведений.ДопроведениеПоПартиям);
		Если НЕ ЭлементСостава = Неопределено Тогда
			Если ЭлементСостава.АвтоРегистрация = АвтоРегистрацияИзменений.Запретить Тогда
				РегистрироватьДопроведение = Истина; // есть в составе плана обмена и стоит запрет авторегистрации
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	// сначала попытаемся произвести корректировку ошибок, которые могли возникнуть при обмене
	Для Каждого Док Из Метаданные.Документы Цикл
		// посмотрим проводится ли документ по регистру ДопроведениеПоПартиям
		ЕстьДопроведение = Ложь;
		Для Каждого Рег Из Док.Движения Цикл
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ДопроведениеПоПартиям") Тогда
				ЕстьДопроведение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОстаткиТоваровКомпании = Ложь;
		Для Каждого Рег Из Док.Движения Цикл
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ОстаткиТоваровКомпании") Тогда
				ЕстьОстаткиТоваровКомпании = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьОстаткиТоваровКомпании Тогда
			Продолжить;
		КонецЕсли;
		
		
		// пропустим то что не будем рассматривать
		Если НЕ ЕстьДопроведение Тогда
			Продолжить;
		КонецЕсли;
		// уберем из корректировки ошибок те документы по которым может быть, а может и не быть
		// движений по регистру "ПартииТоваровКомпании"
		Если орДокументНеВсегдаПроводитьсяПоПартиям(Док) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			// ищем проведенные документы, у которых не пустая табл. часть и нет движений по регистру партий
			// и нет записей в регистре допроведения
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	Док.Ссылка,
			|	Док.Дата,
			|	Док.ПодразделениеКомпании
			|ИЗ
			|	Документ." + Док.Имя + " КАК Док
			|	
			|ГДЕ
			|	НЕ Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Док.Имя + ") ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор = Док.Ссылка)
			|	И Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Док.Имя + ") ИЗ РегистрНакопления.ОстаткиТоваровКомпании ГДЕ Регистратор = Док.Ссылка)
			|	И НЕ Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Док.Имя + ") ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор = Док.Ссылка)
			|	И Док.Проведен
			|	И НЕ 0 В (ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК КоличествоСтрок ИЗ Документ." + Док.Имя + ".Товары ГДЕ Ссылка = Док.Ссылка)		
			|");
			Рез = Запрос.Выполнить();
			Если Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			// для таких документов создадим запись в регистре допроведения
			Выборка = Рез.Выбрать();
			
			МассивУзловПолучателей = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				ТекРегистратор = Выборка.Ссылка;
				НаборЗаписейДопроведение = РегистрыСведений.ДопроведениеПоПартиям.СоздатьНаборЗаписей();
				НаборЗаписейДопроведение.Отбор.Регистратор.Значение = ТекРегистратор;
				НаборЗаписейДопроведение.Отбор.Регистратор.Использование = Истина;
				НоваяЗапись = НаборЗаписейДопроведение.Добавить();
				НоваяЗапись.Период = Выборка.Дата;
				НоваяЗапись.Регистратор = ТекРегистратор;
				НоваяЗапись.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
				Попытка НаборЗаписейДопроведение.Записать(Истина);
				Исключение
				КонецПопытки;
				
				// SUIG + - Пишем отдельно от документа, Авторегистрация отключена, соот-но, необходимо самостоятельно
				// зарегистрировать изменения
				Если РегистрироватьДопроведение Тогда
					Если МассивУзловПолучателей = Неопределено Тогда // вызовем только 1 раз
						МассивУзловПолучателей = одОбменДанными.ПолучитьМассивУзловОбмена(ТекРегистратор.ПолучитьОбъект(),,,
						ПланОбменаМетаданные,ТекРегистратор.Метаданные(), Ложь);
					КонецЕсли; 
					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловПолучателей, НаборЗаписейДопроведение);
				КонецЕсли; 
				// SUIG -
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// массив партионных регистров
	МассивПартионныхРегистров = орПолучитьПартионныеРегистры();
	// нам пригодятся метаданные этих регистров
	Для Инд = 0 По МассивПартионныхРегистров.ВГраница() Цикл
		МассивПартионныхРегистров[Инд] = Метаданные.РегистрыНакопления[МассивПартионныхРегистров[Инд]];
	КонецЦикла; 
	
	// выберем все документы которые надо допровести
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДопроведениеПоПартиям.Регистратор
	|ИЗ
	|	РегистрСведений.ДопроведениеПоПартиям КАК ДопроведениеПоПартиям
	|" + ?(обЗначениеНеЗаполнено(Ссылка), "", "ГДЕ ДопроведениеПоПартиям.Регистратор = &Ссылка") + "
	|УПОРЯДОЧИТЬ ПО Регистратор.Дата Возр, Регистратор");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// если работает робот, то все документы в которых были ошибки, запишем в лог
	ЭтотУзелОбъект = ЭтотУзел.ПолучитьОбъект();
	ЭтотУзелОбъект.ФиксироватьПоОбъекту = Истина;
	ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Начало допроведения партионных движений");
	
	КешМетаданныхОбъектов = Новый Соответствие;
	КешУзловПолучателей = Новый Соответствие; 
	// идем по документам которые надо допровести
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию(); // начнем
		ВыбранныйДокумент = Выборка.Регистратор;
		ТипДанных = ТипЗнч(ВыбранныйДокумент);
		// создадим пустой документ-объект того же вида что и допроводимый документ
		ДокОбъект = Документы[ВыбранныйДокумент.Метаданные().Имя].СоздатьДокумент();
		ДокОбъект.ДополнительныеСвойства.Вставить("МоментВремениБыл");
		// инициализируем начало проведения
		дкОбработкаПроведения(ДокОбъект,Ложь,РежимПроведенияДокумента.Неоперативный);
		// обновим кэш метаданных
		МетаданныеОбъекта = одОбменДанными.ОбновитьКешМетаданныхОбъектов(ТипДанных, ВыбранныйДокумент, КешМетаданныхОбъектов);
		// обновим кэш массивов узлов обмена 
		МассивУзловПолучателей = одОбменДанными.ОбновитьКешУзловПолучателей(ТипДанных, ВыбранныйДокумент, КешУзловПолучателей, КешМетаданныхОбъектов, ПланОбменаМетаданные);
		
		Представление = одОбменДанными.ПредставлениеДанных(ТипДанных,ВыбранныйДокумент, ложь);
		// вызываем функцию ПровестиПоПартиям(...), пустого документа, передав в нее ссылку на документ для
		// которого хотим сформировать движения
		Попытка
			Если НЕ ДокОбъект.ПровестиПоПартиям(РежимПроведенияДокумента.Неоперативный, ВыбранныйДокумент) Тогда
				СтрЛога = "";
				дкВыводРезультатовОбработки(ДокОбъект, Истина, СтрЛога);
				ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Ошибка допроведения: "
				 + Представление + ": " + СтрЛога, ВыбранныйДокумент, Истина);
				ОтменитьТранзакцию();
				Продолжить;
				
			Иначе
				ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Допроведен по партионным регистрам: "
				 + Представление, ВыбранныйДокумент);
			КонецЕсли;
		Исключение
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		// сформированные движения "сидят" в пустом документе. Надо их взять оттуда и дописать к тому
		// документу, который хотим допровести.
		Для Каждого Рег Из МассивПартионныхРегистров Цикл
			Попытка
				НаборЗаписейОбъекта = ДокОбъект.Движения[Рег.Имя];
			Исключение
				Продолжить;
			КонецПопытки;			
			НаборЗаписей = РегистрыНакопления[Рег.Имя].СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(НаборЗаписейОбъекта.Выгрузить());
			НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			
			// если имеем дело с доходами и расходами, то там не все так просто
			// надо взять из допроводимого документа уже сформированные движения по ДиР,
			// исключив статью "Себестоимость неоприходованных партий"
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ДоходыИРасходы") Тогда
				ЗапросДиР = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрНакопления.ДоходыИРасходы ГДЕ Регистратор = &Ссылка И СтатьяДоходовИРасходов <> &СебестоимостьНеоприходованныхПартий");
				ЗапросДиР.УстановитьПараметр("Ссылка",ВыбранныйДокумент);
				ЗапросДиР.УстановитьПараметр("СебестоимостьНеоприходованныхПартий", Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий);
				РезультатДиР = ЗапросДиР.Выполнить();
				Если НЕ РезультатДиР.Пустой() Тогда
					ВыборкаДиР = РезультатДиР.Выбрать();
					Пока ВыборкаДиР.Следующий() Цикл
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДиР);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			// дописываем движения к допроводимому документу
			Регистрировать = Ложь;
			Если ИспользованиеРБД Тогда
				ЭлементСостава = ПланОбменаМетаданные.Состав.Найти(Рег);
				Если НЕ ЭлементСостава = Неопределено Тогда
					Если ЭлементСостава.АвтоРегистрация = АвтоРегистрацияИзменений.Запретить Тогда
						Регистрировать = Истина; // есть в составе плана обмена и стоит запрет авторегистрации
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			Попытка 
				НаборЗаписей.Записать(Истина);
				// регистрация изменений
				Если Регистрировать Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловПолучателей,НаборЗаписей);
				КонецЕсли; 
			Исключение
				СтрОшибки = ОписаниеОшибки();
				ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Ошибка дописывания движений регистра < " + Рег.Имя + " > для документа " + Представление
				 + ": " + СтрОшибки, ВыбранныйДокумент.Ссылка, Истина);
				ОтменитьТранзакцию(); Прервать;
			КонецПопытки;
			
			// на всякий... почистим движения пустого документа
			НаборЗаписейОбъекта.Очистить();
		КонецЦикла;
		
		// в инвентаризации еще сидят и взаиморасчеты = (
		Если ТипЗнч(ВыбранныйДокумент) = Тип("ДокументСсылка.Инвентаризация") Тогда
			НаборЗаписейОбъекта = ДокОбъект.Движения.ВзаиморасчетыКомпании;
			НаборЗаписей = РегистрыНакопления.ВзаиморасчетыКомпании.СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(НаборЗаписейОбъекта.Выгрузить());
			НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			
			Регистрировать = Ложь;
			Если ИспользованиеРБД Тогда
				ЭлементСостава = ПланОбменаМетаданные.Состав.Найти(Метаданные.РегистрыНакопления.ВзаиморасчетыКомпании);
				Если НЕ ЭлементСостава = Неопределено Тогда
					Если ЭлементСостава.АвтоРегистрация = АвтоРегистрацияИзменений.Запретить Тогда
						Регистрировать = Истина; // есть в составе плана обмена и стоит запрет авторегистрации
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			Попытка 
				НаборЗаписей.Записать(Истина);
				// регистрация изменений
				Если Регистрировать Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловПолучателей, НаборЗаписей);
				КонецЕсли;
			Исключение
				СтрОшибки = ОписаниеОшибки();
				ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Ошибка дописывания движений регистра < ВзаиморасчетыКомпании > для документа " + Представление
				 + ": " + СтрОшибки, ВыбранныйДокумент.Ссылка, Истина);
				ОтменитьТранзакцию();
				Продолжить;
			КонецПопытки;
			НаборЗаписейОбъекта.Очистить();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ДопроведениеПоПартиям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
		НаборЗаписей.Отбор.Регистратор.Использование = Истина;
		НаборЗаписей.Записать(Истина);
		// Пишем отдельно от документа, Авторегистрация отключена, соот-но, необходимо самостоятельно
		// зарегистрировать изменения
		Если РегистрироватьДопроведение Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловПолучателей,НаборЗаписей);
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию(); // кончим
		ДокОбъект = Неопределено;
	КонецЦикла;
	
	ЭтотУзелОбъект.ЗаписьЛога("Обмен.ДопроведениеПоПартионнымРегистрам", "Конец допроведения партионных движений");
	
КонецПроцедуры // дкДопровестиПоПартиям()

// Стандартная процедура проверки корректности заполнения элемента
// по заполнености обязательных реквизитов и уникальности уникальных индексированных
//
// Параметры:
// ЭтотОбъект	 - ДокументОбъект, обрабатываемый документ
// Ошибки 	 - строка, описание ошибок
// ДопРеквизиты – список значений, список дополнительных реквизитов
// Заполнение 	 - булево, признак проверки заполнения
// Уникальность - булево, признак проверки уникальности
// ДопПараметры – список значений, список дополнительных параметров печати
//
// Возвращаемое значение:
// булево - признак успешности проверки
//
Функция дкПроверитьКорректность(ЭтотОбъект, Ошибки = "", ДопРеквизиты = Неопределено, Заполнение = Истина, Уникальность = Истина, Приход = Ложь, ДопПараметры = Неопределено) Экспорт
	Результат = Истина;
	Если НЕ обПраво("ПроверкаЗаполненияСправочниковИДокументов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	// сначала получим список обязательных у нашего объекта....
	Реквизиты = ЭтотОбъект.ПолучитьОбязательныеРеквизиты();
	// и его метаданные
	ЭтотОбъектМетаданные = ЭтотОбъект.Метаданные();
	// добавим дополнительные реквизиты
	Если ДопРеквизиты <> Неопределено Тогда
		Для каждого ДопРеквизит Из ДопРеквизиты Цикл
			Реквизиты.Вставить(ДопРеквизит.Ключ, ДопРеквизит.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ИмяКолонкиНоменклатуры = "Номенклатура";
	ИмяКолонкиХарактеристики = "ХарактеристикаНоменклатуры";
	Если ДопПараметры <> Неопределено Тогда
		Если НЕ ДопПараметры.Свойство("ИмяКолонкиНоменклатуры", ИмяКолонкиНоменклатуры) Тогда
			ИмяКолонкиХарактеристики = "Номенклатура";
		КонецЕсли; 
		Если НЕ ДопПараметры.Свойство("ИмяКолонкиХарактеристики", ИмяКолонкиХарактеристики) Тогда
			ИмяКолонкиХарактеристики = "ХарактеристикаНоменклатуры";
		КонецЕсли; 
	КонецЕсли; 
	
	Для каждого Реквизит Из Реквизиты Цикл
		Если ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда
			// имеем табличную часть
			ТабличнаяЧасть = ЭтотОбъект[Реквизит.Ключ];
			ЕстьХарактеристика = (ЭтотОбъект.Метаданные().ТабличныеЧасти[Реквизит.Ключ].Реквизиты.Найти(ИмяКолонкиХарактеристики) <> Неопределено);	
			ЕстьНоменклатура = (ЭтотОбъект.Метаданные().ТабличныеЧасти[Реквизит.Ключ].Реквизиты.Найти(ИмяКолонкиНоменклатуры) <> Неопределено);	
			ЕстьПартия = (ЭтотОбъект.Метаданные().ТабличныеЧасти[Реквизит.Ключ].Реквизиты.Найти("Партия") <> Неопределено);	
			Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ПересортицаТоваров") Тогда
				ЕстьГТД = Истина;
				ИмяРеквизитаГТД="ГТДРасход";
			Иначе
				ЕстьГТД = (ЭтотОбъект.Метаданные().ТабличныеЧасти[Реквизит.Ключ].Реквизиты.Найти("ГТД") <> Неопределено);	
				ИмяРеквизитаГТД="ГТД";
			КонецЕсли;
		
			Если ЕстьХарактеристика И (Реквизит.Ключ = "Товары") Тогда
				// кэшируем тип номенклатуры				
				ЗапросПоНоменклатуре = Новый Запрос;
				ЗапросПоНоменклатуре.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Номенклатура,
				|	ВЫБОР
				|		КОГДА Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = ЗНАЧЕНИЕ(Перечисление.РежимыАвтоСписанияХарактеристик.РучноеСписание)
				|				ИЛИ Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = ЗНАЧЕНИЕ(Перечисление.РежимыАвтоСписанияХарактеристик.ПустаяСсылка)
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК РучноеСписаниеХарактеристик,
				|	ВЫБОР
				|		КОГДА Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1
				|				ИЛИ Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК УчетВедется
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокНоменклатуры)";
				ЗапросПоНоменклатуре.УстановитьПараметр("СписокНоменклатуры", ЭтотОбъект[Реквизит.Ключ].ВыгрузитьКолонку(ИмяКолонкиНоменклатуры));
				тзКэшТипНоменклатуры = ЗапросПоНоменклатуре.Выполнить().Выгрузить();				
			КонецЕсли;
			
			СписокНайденныхДублей = Новый СписокЗначений();
			// идем по табличной части
			Для каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
				// создадим структуру отбора для проверки уникальности реквизитов
				Если Уникальность Тогда
					СтруктураОтбора = Новый Структура();
				КонецЕсли;
				// переберем обязательные реквизиты
				Для каждого РеквизитТаблицы Из Реквизит.Значение Цикл
					Если (Заполнение) И (РеквизитТаблицы.Значение <> 2) И (РеквизитТаблицы.Значение > 0)
						И обЗначениеНеЗаполнено(СтрокаТаблицы[РеквизитТаблицы.Ключ]) Тогда
						Результат = Ложь;
						дкДобавитьОшибку(Ошибки, "Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные, , Реквизит.Ключ)
						 + " > значение колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные, РеквизитТаблицы.Ключ, Реквизит.Ключ)
						 + " > не заполнено ! Строка номер " + СокрЛП(СтрокаТаблицы.НомерСтроки));
						Продолжить; // Если реквизит таблицы не заполнен, проверять его уникальность нет смысла
					КонецЕсли;
					// заполним структуру отбора для проверки уникальности реквизитов
					Если Уникальность И РеквизитТаблицы.Значение > 1 Тогда
						СтруктураОтбора.Вставить(СокрЛП(РеквизитТаблицы.Ключ),СтрокаТаблицы[РеквизитТаблицы.Ключ]);
					КонецЕсли;
				КонецЦикла;
				// проверка уникальности
				Если Уникальность И СтруктураОтбора.Количество() > 0 И СписокНайденныхДублей.НайтиПоЗначению(СтрокаТаблицы) = Неопределено Тогда
					
					// проверим есть ли в строке номенклатура и является ли она сотовым платежом
					ЭтоПлатеж = Ложь;
					Если ЕстьНоменклатура И Реквизит.Ключ = "Товары" Тогда
						Если ТипЗнч(СтрокаТаблицы[ИмяКолонкиНоменклатуры]) = Тип("СправочникСсылка.Номенклатура") Тогда
							Если НЕ ПустаяСтрока(СтрокаТаблицы[ИмяКолонкиНоменклатуры].ВидПлатежа) Тогда
								ЭтоПлатеж = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					// необходимо исключить проверку уникальности для сотовых платежей 
					Если НЕ ЭтоПлатеж И НЕ обПраво("ОтключитьКонтрольУникальностиСтрок") Тогда  
						// поищем строки удовлетворяющие структуре отбора
						НайденныеСтроки = ТабличнаяЧасть.НайтиСтроки(СтруктураОтбора);
						// если нашли и их больше 1, то строки не уникальные
						Если НайденныеСтроки.Количество() > 1 Тогда
							// добавим строку в список найденных дублей, что бы не сообщать о ней еще раз
							Результат = Ложь;
							ДублирующиесяСтроки = ""; 
							// выведем строку сообщения...
							Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
								ДублирующиесяСтроки = ДублирующиесяСтроки + "," + СокрЛП(НайденнаяСтрока.НомерСтроки);
								// добавим строку в список найденных дублей, что бы не сообщать о ней еще раз
								СписокНайденныхДублей.Добавить(НайденнаяСтрока);
							КонецЦикла;
							СтрокаРеквизитов = "";
							Для каждого РеквизитТаблицы Из СтруктураОтбора Цикл
								СтрокаРеквизитов = СтрокаРеквизитов + ?(ПустаяСтрока(СтрокаРеквизитов),"",",") + РеквизитТаблицы.Ключ;
							КонецЦикла;
							дкДобавитьОшибку(Ошибки,"Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,,Реквизит.Ключ) + " > значения колон" + ?(СтруктураОтбора.Количество() > 1,"ок","ки") + " < " + СтрокаРеквизитов + " > не уникальны ! Строки: " + Сред(ДублирующиесяСтроки,2));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ЕстьХарактеристика Тогда
					// Попробуем вызвать приватную проверку характеристики
					Попытка
						Если НЕ ЭтотОбъект.ПроверитьЗаполнениеХарактеристики(СтрокаТаблицы, Ошибки) Тогда
							Результат = Ложь;
							дкДобавитьОшибку(Ошибки, "Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные, , Реквизит.Ключ) 
							 + " > значение колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,ИмяКолонкиХарактеристики,Реквизит.Ключ)
							 + " > не заполнено ! Строка номер " + СокрЛП(СтрокаТаблицы.НомерСтроки));
						КонецЕсли;		
						// Проверяем стандартно	
					Исключение	
						Попытка
							ТекСтрокаКэшТипНоменклатуры = тзКэшТипНоменклатуры.Найти(СтрокаТаблицы[ИмяКолонкиНоменклатуры], ИмяКолонкиНоменклатуры);
							
							Если ТекСтрокаКэшТипНоменклатуры.УчетВедется
								И (Приход Или ТекСтрокаКэшТипНоменклатуры.РучноеСписаниеХарактеристик)
								И СтрокаТаблицы[ИмяКолонкиХарактеристики].Пустая() Тогда
								Результат = Ложь;
								дкДобавитьОшибку(Ошибки,"Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные, , Реквизит.Ключ)
								 + " > значение колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,ИмяКолонкиХарактеристики,Реквизит.Ключ)
								 + " > не заполнено ! Строка номер " + СокрЛП(СтрокаТаблицы.НомерСтроки));
							КонецЕсли;
						Исключение
						КонецПопытки; 
					КонецПопытки;	
				КонецЕсли;
				Если ЕстьПартия И ЕстьГТД Тогда
					Если ТипЗнч(ЭтотОбъект)<>Тип("ДокументОбъект.СчетФактураВыданный") Тогда
						Если (НЕ обЗначениеНеЗаполнено(СтрокаТаблицы[ИмяРеквизитаГТД])) И обЗначениеНеЗаполнено(СтрокаТаблицы.Партия) Тогда
							Результат = Ложь;
							дкДобавитьОшибку(Ошибки,"Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные, , Реквизит.Ключ)
							 + " > значение колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,"Партия",Реквизит.Ключ)
							 + " > не заполнено"
							 + " при заполненной колонке < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,ИмяРеквизитаГТД,Реквизит.Ключ)
							 + " > ! Строка номер " + СокрЛП(СтрокаТаблицы.НомерСтроки));
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			
		ИначеЕсли Реквизит.Значение > 0 Тогда
			// обычный реквизит. реквизиты шапки запросом проверять смысла нет...
			Если (Заполнение) и обЗначениеНеЗаполнено(ЭтотОбъект[Реквизит.Ключ]) Тогда
				Результат = Ложь;
				дкДобавитьОшибку(Ошибки,"Реквизит < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ) + " > не заполнен !");
			КонецЕсли;
			// уникальность для реквизитов документа не проверяется
		КонецЕсли;
	КонецЦикла;
	
	РежимЗаписи = Неопределено;
	ЭтотОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи",РежимЗаписи);	
	РежимЗаписи = ?(РежимЗаписи<>Неопределено, РежимЗаписи, РежимЗаписиДокумента.Проведение);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ обПраво("ПроведениеНезаполненныхДокументов", ЭтотОбъект.Права, , ЭтотОбъект) Тогда
		РезультатПроверки = Неопределено;
		
		//пытаемся вызвать метод документа, который выполнит проверку
		Попытка 
			РезультатПроверки = ЭтотОбъект.ПроверитьЗаполненностьТЧ();
		Исключение
		КонецПопытки; 

		Если обЗначениеНеЗаполнено(РезультатПроверки) Тогда
			//если метод документа не прописан, проверяем все ТЧ на заполненность
			ТабличныеЧастиДокумента = ЭтотОбъект.Метаданные().ТабличныеЧасти;
			Если ТабличныеЧастиДокумента.Количество() > 0 Тогда
				ФлагЗаполнения = Ложь;
				Для Каждого ИмяТабличнойЧасти Из ТабличныеЧастиДокумента Цикл
					Если ЭтотОбъект[ИмяТабличнойЧасти.Имя].Количество() > 0 Тогда
	                	ФлагЗаполнения = Истина;
						Прервать;
					КонецЕсли;		
				КонецЦикла;
				Если ФлагЗаполнения=Ложь Тогда
					Результат = Ложь;
					дкДобавитьОшибку(Ошибки,"Документ заполнен некорректно! Табличные части документа не содержат данных!");
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(РезультатПроверки) = Тип("Булево") Тогда
			//если метод прописан и возвращает значение типа "булево"
			Если НЕ РезультатПроверки Тогда
				Результат = Ложь;
				дкДобавитьОшибку(Ошибки,"Документ заполнен некорректно! Табличные части документа не содержат данных!");
			КонецЕсли;
		ИначеЕсли ТипЗнч(РезультатПроверки) = Тип("СписокЗначений") Тогда
			//если метод прописан и возвращает значение типа "список значений", проверим полученные ТЧ на заполненность
			ТабличныеЧастиДокумента = РезультатПроверки;
			Если ТабличныеЧастиДокумента.Количество() > 0 Тогда
				ФлагЗаполнения = Ложь;
				Для Каждого ИмяТабличнойЧасти Из ТабличныеЧастиДокумента Цикл
					Если ЭтотОбъект[ИмяТабличнойЧасти.Значение.Имя].Количество() > 0 Тогда
	                	ФлагЗаполнения = Истина;
						Прервать;
					КонецЕсли;		
				КонецЦикла;
				Если ФлагЗаполнения=Ложь Тогда
					Результат = Ложь;
					дкДобавитьОшибку(Ошибки,"Документ заполнен некорректно! Табличные части документа не содержат данных!");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Если обПраво("КонтролироватьСоответствиеОрганизацииПодразделения", ЭтотОбъект.Права, , ЭтотОбъект) Тогда
		Если (НЕ ЭтотОбъект.ПодразделениеКомпании.Пустая()) И
			 (ЭтотОбъект.ПодразделениеКомпании.Организация <> ЭтотОбъект.Организация) Тогда
			 //Если подразделение не соответствует организации - ошибка
			 Результат = Ложь;
			 дкДобавитьОшибку(Ошибки,"Подразделение < " + ЭтотОбъект.ПодразделениеКомпании.Наименование +
			 " > не принадлежит организации < " + ЭтотОбъект.Организация.Наименование + " > !");
		КонецЕсли;
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти("ДоговорВзаиморасчетов")<>Неопределено Тогда
			Если (НЕ ЭтотОбъект.ДоговорВзаиморасчетов.Пустая()) И
				 (ЭтотОбъект.ДоговорВзаиморасчетов.Организация <> ЭтотОбъект.Организация) Тогда
				 //Если договор не соответствует организации - ошибка
				 Результат = Ложь;
				 дкДобавитьОшибку(Ошибки,"Договор взаиморасчетов < " + ЭтотОбъект.ДоговорВзаиморасчетов.Наименование +
				 " > не принадлежит организации < " + ЭтотОбъект.Организация.Наименование + " > !");
			КонецЕсли;
		КонецЕсли;  
	КонецЕсли; 
	
	ТекущийВидыКонтроля = обПраво("ПроверятьУникальностьВхНомеровПоступлениеТоваров", ЭтотОбъект.Права, , ЭтотОбъект);
	Если ТекущийВидыКонтроля <> Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		Если ЭтотОбъектМетаданные.Реквизиты.Найти("ВхДокНомер") <> Неопределено И ЗначениеЗаполнено(ЭтотОбъект.ВхДокНомер) Тогда
			// Уникальность номера будем отслеживать в пределах выбранного контрагента.
			ТекстЗапроса = "ВЫБРАТЬ
			|	ТаблицаДокументов.Ссылка КАК Ссылка
			|ИЗ
			|	Документ." + ЭтотОбъектМетаданные.Имя + " КАК ТаблицаДокументов
			|ГДЕ
			|	ТаблицаДокументов.ВхДокНомер = &ВхДокНомер
			|	И ТаблицаДокументов.Ссылка <> &Ссылка
			|	И ТаблицаДокументов.ВхДокДата МЕЖДУ &НачВхДокДата И &КонВхДокДата 
			| И ТаблицаДокументов.Контрагент = &Контрагент
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокументов.ВхДокДата";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка",  ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ВхДокНомер", ЭтотОбъект.ВхДокНомер);
			Запрос.УстановитьПараметр("НачВхДокДата", НачалоГода(ЭтотОбъект.ВхДокДата));
			Запрос.УстановитьПараметр("КонВхДокДата", КонецГода(ЭтотОбъект.ВхДокДата));
			Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ТекущийВидыКонтроля = Перечисления.ВидыКонтроля.Предупреждать Тогда
					Сообщить("Внимание! Повторение номеров входящих документов в пределах контрагента < " + ЭтотОбъект.Контрагент + " > :" + Символы.ПС + 
					" < " + Строка(ЭтотОбъект) + " > " + Символы.ПС + " < " + Строка(Выборка.Ссылка) + " > ",СтатусСообщения.Внимание);
				Иначе
					дкДобавитьОшибку(Ошибки, "Повторение номеров входящих документов в пределах контрагента < " + ЭтотОбъект.Контрагент + " > :" + Символы.ПС + 
					" < " + Строка(ЭтотОбъект) + " > " + Символы.ПС + " < " + Строка(Выборка.Ссылка) + " > ");
					Результат = Ложь;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЭтотОбъектМетаданные.Реквизиты.Найти("ВнешнийНомерЗаказа") <> Неопределено И ЗначениеЗаполнено(ЭтотОбъект.ВнешнийНомерЗаказа) Тогда
			// Уникальность номера будем отслеживать в пределах выбранного контрагента.
			ТекстЗапроса = "ВЫБРАТЬ
			|	ТаблицаДокументов.Ссылка КАК Ссылка
			|ИЗ
			|	Документ." + ЭтотОбъектМетаданные.Имя + " КАК ТаблицаДокументов
			|ГДЕ
			|	ТаблицаДокументов.ВнешнийНомерЗаказа = &ВнешнийНомерЗаказа
			|	И ТаблицаДокументов.Ссылка <> &Ссылка
			|	И ТаблицаДокументов.Контрагент = &Контрагент
			|УПОРЯДОЧИТЬ ПО
			|	ТаблицаДокументов.Дата";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка",             ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("ВнешнийНомерЗаказа", ЭтотОбъект.ВнешнийНомерЗаказа);
			Запрос.УстановитьПараметр("Контрагент",         ЭтотОбъект.Контрагент);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ТекущийВидыКонтроля = Перечисления.ВидыКонтроля.Предупреждать Тогда
					Сообщить("Внимание! Повторение внешних номеров заказов в пределах контрагента < " + ЭтотОбъект.Контрагент + " > :" + Символы.ПС + 
					" < " + Строка(ЭтотОбъект) + " > " + Символы.ПС + " < " + Строка(Выборка.Ссылка) + " > ",СтатусСообщения.Внимание);
				Иначе
					дкДобавитьОшибку(Ошибки, "Повторение внешних номеров заказов в пределах контрагента < " + ЭтотОбъект.Контрагент + " > :" + Символы.ПС + 
					" < " + Строка(ЭтотОбъект) + " > " + Символы.ПС + " < " + Строка(Выборка.Ссылка) + " > ");
					Результат = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Для документам с договорами, проверим на соответствие вида договора Хоз. операции
	// Если результат уже отрицательный дополнительно не будем проверять договор чтобы
	// не вызывать объект справочника и на пустой договор уже тоже не нужно проверять
	Если Результат И Реквизиты.Свойство("ДоговорВзаиморасчетов") Тогда
		Попытка // на случай если совсем ничего не заполнено или в новом документе процедуры не прописали
			Если НЕ ЭтотОбъект.ДоговорВзаиморасчетов.ПолучитьОбъект().СоответствуетХозОперации(ЭтотОбъект.ХозОперация) Тогда
				Результат = Ложь;
				дкДобавитьОшибку(Ошибки,"Вид договора не соответствует Хоз. операции.");
			КонецЕсли;	
		Исключение
			Результат = Ложь;
			дкДобавитьОшибку(Ошибки,"Ошибка при проверка договора взаиморасчетов: " + ОписаниеОшибки());
		КонецПопытки;
		Попытка
			Если ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект <> ЭтотОбъект.Проект Тогда
				
				//сформируем строку - представление проекта для вывода в сообщении
				Если ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект = Справочники.Проекты.ПустаяСсылка() Тогда
					ПредставлениеПроектаДоговора = "пустой";
				Иначе	
					ПредставлениеПроектаДоговора = СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект);
				КонецЕсли;
				
				Если ЭтотОбъект.Проект = Справочники.Проекты.ПустаяСсылка() Тогда
					ПредставлениеПроектаДокумента = "пустой";
				Иначе	
					ПредставлениеПроектаДокумента = СокрЛП(ЭтотОбъект.Проект);
				КонецЕсли;
				
				Если обПраво("КонтролироватьСоответствиеПроектов",ЭтотОбъект.Права,,ЭтотОбъект) = Перечисления.ВидыКонтроля.Предупреждать Тогда
					Сообщить("Проект < " + ПредставлениеПроектаДоговора + " > договора < " + СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов)
					 + " > отличается от проекта < " + ПредставлениеПроектаДокумента + " > документа!");
				ИначеЕсли обПраво("КонтролироватьСоответствиеПроектов",ЭтотОбъект.Права,,ЭтотОбъект) = Перечисления.ВидыКонтроля.Запрещать Тогда 
					Результат = Ложь;
					дкДобавитьОшибку(Ошибки,"Проект < " + ПредставлениеПроектаДоговора + " > договора < "
					 + СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов) + " > отличается от проекта < " + ПредставлениеПроектаДокумента + " > документа!");
				КонецЕсли;	
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// !!!_Переход на ставку НДС 20%
	РаботаСоСтавкамиНДСКлиентСервер.ПроверкиКорректностьСтавкиНДС(ЭтотОбъект, Ошибки, Результат);
	
	//
	Возврат Результат;
КонецФункции // дкПроверитьКорректность()

//Проверяем тип номенклатуры строки, если контролируется уникальность серийного номера,
//заполнена характеристика и количество больше 1, то выдаем предупреждение и устанавливаем количество в 1
//
// Параметры:
// ЭтотОбъект	 - ДокументОбъект, обрабатываемый документ
// ДопПараметры – список значений, список дополнительных параметров проверки
// ТекСтрока 	 - СтрокаТабличнойЧасти, обрабатываемая строка табличной части
// ЭтаФорма 	 - форма, форма обрабатываемого документа
//
Процедура дкПроверитьКорректностьКоличества(ЭтотОбъект, ТекСтрока, ЭтаФорма = Неопределено, ДопПараметры = Неопределено)
	Попытка
		ИзменятьКоличество = (НЕ обЗначениеНеЗаполнено(ТекСтрока.Номенклатура)) 
		И (НЕ обЗначениеНеЗаполнено(ТекСтрока.ХарактеристикаНоменклатуры))
		И (ТекСтрока.Количество > 1)
		И ТекСтрока.Номенклатура.ТипНоменклатуры.УникальностьСерийногоНомера;
	Исключение
		ИзменятьКоличество = Ложь;
	КонецПопытки;
	Если ИзменятьКоличество Тогда
		ТекСтрока.Количество = 1;
		#Если Клиент Тогда
			Сообщить("Строка " + ТекСтрока.НомерСтроки + ". Для характеристик номенклатуры """ + спПолучитьНаименование(ТекСтрока.Номенклатура) + """ установлена уникальность серийного номера. Количество не может быть больше 1.");
		#КонецЕсли
		ЭтотОбъект.ОбработкаРеквизита("Товары.Количество", ТекСтрока, ЭтаФорма, ДопПараметры);
	КонецЕсли; 
КонецПроцедуры // дкПроверитьКорректностьКоличества()

Процедура дкУстановитьЗначениеДополнительногоСвойства(ЭтотОбъект,Отказ,Свойство="ВыведеныСообщенияОбОшибке") Экспорт
	Если Свойство="ВыведеныСообщенияОбОшибке" Тогда
		Если Отказ Тогда
			Попытка
				ЭтотОбъект.ДополнительныеСвойства.ВыведеныСообщенияОбОшибке=Истина;
			Исключение
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ВыведеныСообщенияОбОшибке",Истина);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//#Если Клиент Тогда
#Если ТолстыйКлиентОбычноеПриложение Тогда
	
// Процедура установки корректного номера документа (вызывается при смене даты и номера)
//
// Параметры: 
// ЭтаФорма - форма документа, который редактируется
//
Процедура дкПроверитьКорректностьНомераИДаты(ЭтаФорма, Элемент = Неопределено) Экспорт
	//БИЗТЕХ КОВАЛЬ 20.10.2024 ++
	//Для предотвращения возможности менять номер документа в ЗаказНаряде
	Если Не ТипЗнч(ЭтаФорма.ЭтотОбъект) = Тип("ДокументОбъект.ЗаказНаряд") Тогда //+
		зфПроверитьКорректностьНомераИДаты(ЭтаФорма, Элемент);
	КонецЕсли;                                                        //+
КонецПроцедуры // дкПроверитьКорректностьНомераИДаты()
	
Процедура дкСообщитьОЗаметках(ЭтотОбъект,Значение,ЭтаФорма=Неопределено) Экспорт
	Если ЭтаФорма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) <> Тип("СправочникСсылка.Автомобили") И ТипЗнч(Значение) <> Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	// составим список документов
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаРемонт"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказНаАвтомобиль"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаказНаряд"));
	СписокТипов.Добавить(Тип("ДокументСсылка.РабочийЛист"));
	СписокТипов.Добавить(Тип("ДокументСсылка.Событие"));
	СписокТипов.Добавить(Тип("ДокументСсылка.СчетНаОплату"));
	СписокТипов.Добавить(Тип("ДокументСсылка.СчетНаОплатуЗаАвтомобили"));
	СписокТипов.Добавить(Тип("ДокументСсылка.РеализацияАвтомобилей"));
	СписокТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПоступлениеАвтомобилей"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	СписокТипов.Добавить(Тип("ДокументСсылка.РеализацияТоваров"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаХранениеШин"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ТестДрайв"));
	СписокТипов.Добавить(Тип("ОбработкаОбъект.АРМКорзина"));
	
	Попытка
		Если Тип("ОбработкаОбъект.АРМКорзина") = ТипЗнч(ЭтотОбъект) Тогда
			ТипОбъекта = ТипЗнч(ЭтотОбъект);
		Иначе
			ТипОбъекта = ТипЗнч(ЭтотОбъект.Ссылка);
		КонецЕсли;
	Исключение
		//ТипОбъекта = ТипЗнч(ЭтотОбъект);
		Возврат;
	КонецПопытки;
	
	Если СписокТипов.НайтиПоЗначению(ТипОбъекта) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// посмотрим есть ли заметки
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаметкиПользователей.Объект,
	|	ЗаметкиПользователей.Автор,
	|	ЗаметкиПользователей.Дата,
	|	ЗаметкиПользователей.ТекстЗаметки,
	|	ЗаметкиПользователей.Напоминать
	|ИЗ
	|	РегистрСведений.ЗаметкиПользователей КАК ЗаметкиПользователей
	|ГДЕ
	|	ЗаметкиПользователей.Напоминать = ИСТИНА
	|	И ЗаметкиПользователей.Объект = &Значение";
	Запрос.УстановитьПараметр("ПустаяСтрока" , "");
	Запрос.УстановитьПараметр("Значение"     , Значение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		РегистрыСведений.ЗаметкиПользователей.СоздатьНаборЗаписей().СообщитьПользователю(Значение,РезультатЗапроса.Выгрузить().Количество());
	КонецЕсли;
КонецПроцедуры
#КонецЕсли

// Стандартная процедура проверки корректности заполнения документа по соответствию организации
//
// Параметры:
// ЭтотОбъект	 - ДокументОбъект, обрабатываемый документ
// Ошибки 	 - строка, описание ошибок
// КонтролируемыеРеквизиты – структура для проверки соответствия необходимых реквизитов организации документа
// имеет следующую структуру:
// -КонтролируемыеРеквизитыШапки – структура для проверки соответствия реквизитов шапки организации документа
// -КонтролируемыеРеквизитыТабличныхЧастей – структура для проверки соответствия реквизитов табличных
//  частей организации документа
// -КонтролируемыеРеквизитыКассыККМ – структура для проверки соответствия касс ККМ организации документа
// -КонтролируемыеРеквизитыБанковскиеСчета – структура для проверки соответствия банковских счетов организации документа
//
Функция дкПроверитьКорректностьПоОрганизации(ЭтотОбъект, КонтролируемыеРеквизиты, Ошибки = "") Экспорт
	Результат = Истина;
	// если не надо ничего проверять то и не будем
	Если НЕ обПраво("ПроверкаЗаполненияСправочниковИДокументов", ЭтотОбъект.Права,,ЭтотОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Получим организацию документа
	Организация = ЭтотОбъект.Организация;
	Подразделение = ЭтотОбъект.ПодразделениеКомпании;
	
	// и его метаданные
	ЭтотОбъектМетаданные = ЭтотОбъект.Метаданные();
	
	// сначала проверим соответствие подразделения	
	Если Не Организация = ЭтотОбъект.ПодразделениеКомпании.Организация Тогда
		Результат = Ложь;
		дкДобавитьОшибку(Ошибки, "Организация подразделения не соответствует организации документа");
	КонецЕсли;
	
	Для Каждого КонтролируемыйНабор Из КонтролируемыеРеквизиты Цикл
		Если ТипЗнч(КонтролируемыйНабор.Значение) = Тип("Структура") Тогда
			// имеем набор реквизитов. Определимся что это за набор
			Реквизиты = КонтролируемыйНабор.Ключ;
			Если Реквизиты = "КонтролируемыеРеквизитыШапки" Тогда
				Для Каждого Реквизит Из КонтролируемыйНабор.Значение Цикл
					// Выясним, необходимо ли проверять дополнительно соответствие подразделений.
					ПроверятьПоПодразделению = ?(Реквизит.Значение = Неопределено, Ложь, Реквизит.Значение);
					
					// обычный реквизит
					ЗначениеРеквизита = ЭтотОбъект[Реквизит.Ключ];
					// возможно проверяемый реквизит необязательный, да еще к тому же нетипизированный,
					// поэтому проверим на заполненность  
					
					//bizteh++
					Если НЕ обЗначениеНеЗаполнено(ЗначениеРеквизита) Тогда
						Если ЗначениеРеквизита.Организация <> Организация Тогда
							Результат = Ложь;
							дкДобавитьОшибку(Ошибки,"Организация реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ) + " > не соответствует организации документа !");
						КонецЕсли;
						Если ПроверятьПоПодразделению И (ЗначениеРеквизита.Подразделение <> Подразделение) Тогда
							Результат = Ложь;
							дкДобавитьОшибку(Ошибки,"Подразделение реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ) + " > не соответствует подразделению документа !");
						КонецЕсли;
					КонецЕсли;
					
//						Если ТипЗнч(ЗначениеРеквизита.Владелец) = Тип("СправочникСсылка.Организации") И НЕ ЗначениеРеквизита.Владелец = Организация Тогда
////						Если НЕ дкПроверитьКорректностьБанковскогоСчета(ЗначениеРеквизита, Организация, Подразделение, ЭтотОбъект.ДополнительныеСвойства) Тогда
//							Результат = Ложь;
//							дкДобавитьОшибку(Ошибки,"Организация реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ)
//							+ " > не соответствует организации документа !");
////							дкДобавитьОшибку(Ошибки,"Владелец реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ)
////							+ " > не соответствует организации/подразделению документа !");
//						ИначеЕсли ТипЗнч(ЗначениеРеквизита.Владелец) = Тип("СправочникСсылка.ПодразделенияКомпании") И НЕ ЗначениеРеквизита.Владелец = Подразделение Тогда
//							Результат = Ложь;
//							дкДобавитьОшибку(Ошибки,"Подразделение реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ)
//							+ " > не соответствует Подразделению документа !");
//						КонецЕсли;					
					//bizteh++

					
				КонецЦикла;	
			ИначеЕсли Реквизиты = "КонтролируемыеРеквизитыБанковскиеСчета" Тогда
				Для Каждого Реквизит Из КонтролируемыйНабор.Значение Цикл
					// обычный реквизит
					ЗначениеРеквизита = ЭтотОбъект[Реквизит.Ключ];
					// возможно проверяемый реквизит необязательный
					// поэтому проверим на заполненность
					Если НЕ обЗначениеНеЗаполнено(ЗначениеРеквизита) Тогда
						Если НЕ дкПроверитьКорректностьБанковскогоСчета(ЗначениеРеквизита, Организация, Подразделение, ЭтотОбъект.ДополнительныеСвойства) Тогда
							Результат = Ложь;
							дкДобавитьОшибку(Ошибки,"Владелец реквизита < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,Реквизит.Ключ)
							+ " > не соответствует организации/подразделению документа !");
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли Реквизиты = "КонтролируемыеРеквизитыТабличныхЧастей" Тогда
				// здесь должна быть структура с наименованиями табличных частей
				Для Каждого Реквизит Из КонтролируемыйНабор.Значение Цикл
					// табличная часть
					ТабличнаяЧасть = ЭтотОбъект[Реквизит.Ключ];
					// идем по табличной части
					Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
						Для Каждого РеквизитТаблицы Из Реквизит.Значение Цикл
							// Выясним, необходимо ли проверять дополнительно соответствие подразделений.
							ПроверятьПоПодразделению = ?(РеквизитТаблицы.Значение = Неопределено, Ложь, РеквизитТаблицы.Значение);
							// Получаем значение реквизита строки табличной части.
							ЗначениеРеквизита = СтрокаТаблицы[РеквизитТаблицы.Ключ];
							// возможно проверяемый реквизит необязательный, да еще к тому же нетипизированный,
							// поэтому проверим на заполненность
							Если НЕ обЗначениеНеЗаполнено(ЗначениеРеквизита) Тогда
								Если ЗначениеРеквизита.Организация <> Организация Тогда
									Результат = Ложь;
									дкДобавитьОшибку(Ошибки,"Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,,Реквизит.Ключ)
									 + " > значение организации колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,РеквизитТаблицы.Ключ,Реквизит.Ключ)
									 + " > не соответствует организации документа ! Строка номер " + СокрЛП(СтрокаТаблицы.НомерСтроки));
								КонецЕсли;
								Если ПроверятьПоПодразделению И (ЗначениеРеквизита.Подразделение <> Подразделение) Тогда
									Результат = Ложь;
									дкДобавитьОшибку(Ошибки,"Таблица < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,,Реквизит.Ключ)
									 + " > значение подразделения колонки < " + обПолучитьСинонимРеквизита(ЭтотОбъектМетаданные,РеквизитТаблицы.Ключ,Реквизит.Ключ)
									 + " > не соответствует подразделению документа ! Строка номер "
									 + СокрЛП(СтрокаТаблицы.НомерСтроки));
								КонецЕсли;
							КонецЕсли;
						КонецЦикла	
					КонецЦикла;						
				КонецЦикла;					
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции // дкПроверитьКорректностьПоОрганизации()

// Проверяет документы на право редактирования, чтения или доступности текущего
// вида документа, а так же на право, если оно установлено, редактирования или
// чтения объекта текущего вида документа, по автору или подразделению компании
//
//Параметры:
//
// Объект		 - текущий ДокументОбъект. Обязательный для заполнения.
// Отказ 		 - результат работы процедуры, т.е. определяет текущую доступность данного объекта
// ЭтаФорма 	 - форма текущего объекта. Передается для проверки на редактирование или чтение 
//     объекта и соответственно для разрешения или запрещения редактирования формы объекта.
// ЗначенияПрав - Кеш прав текущего пользователя. тип соответствие.
//
Процедура дкПроверкаПраваДоступа(Объект, Отказ, ЭтаФорма = Неопределено, ЗначенияПрав = Неопределено) Экспорт
	
	//если уже отказ, то не проверяем
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Результат = обПраво("Право доступа " + Объект.Метаданные().Имя, ЗначенияПрав);
	
	Если Результат = Перечисления.ВидыПравДляДокументов.РедактированиеВсе Тогда
		//если редактируем, то ничего не делаем
	ИначеЕсли Результат = Перечисления.ВидыПравДляДокументов.НетДоступа Тогда
		Сообщить("Нет доступа к объектам вида " + Объект.Метаданные().Представление(), СтатусСообщения.Важное); 
		Отказ = Истина;
	ИначеЕсли Результат = Перечисления.ВидыПравДляДокументов.ЧтениеВсе тогда
		// ЧТЕНИЕ
		Сообщить("Нет прав на редактирование объектов вида " + Объект.Метаданные().Представление(), СтатусСообщения.Важное); 	
		// проверка на редактирование или просмотр объекта
		Если ЭтаФорма = Неопределено Тогда
			Отказ = Истина;
		Иначе
			ЭтаФорма.ТолькоПросмотр = Истина;
		КонецЕсли;
	ИначеЕсли Результат = Перечисления.ВидыПравДляДокументов.РедактированиеПоПодразделениям Тогда
		//получаем значения доступа
		Если ((НЕ Объект.ЭтоНовый()) ИЛИ ЭтаФорма = Неопределено) 
			И (НЕ обЗначениеНеЗаполнено(Объект.ПодразделениеКомпании))
			И ПараметрыСеанса.ПодразделениеКомпании <> Объект.ПодразделениеКомпании Тогда
			Результат = Неопределено;
			ЗначениеДоступа = обПраво("Значения Право доступа " + Объект.Метаданные().Имя, ЗначенияПрав);
			Если ЗначениеДоступа <> Неопределено Тогда
				Результат = ЗначениеДоступа[Объект.ПодразделениеКомпании];
			КонецЕсли;
			Если (Результат = Неопределено) ИЛИ (Не Результат) Тогда
				Сообщить("Нет прав на редактирование объектов вида " + Объект.Метаданные().Представление() + " по подразделению: " + Объект.ПодразделениеКомпании, СтатусСообщения.Важное);
				Если ЭтаФорма = Неопределено Тогда
					Отказ = Истина;
				Иначе
					ЭтаФорма.ТолькоПросмотр = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Результат = Перечисления.ВидыПравДляДокументов.РедактированиеПоПользователям Тогда
		//получаем значения доступа
		Если ((НЕ Объект.ЭтоНовый()) ИЛИ ЭтаФорма = Неопределено) И (НЕ обЗначениеНеЗаполнено(Объект.Автор)) И ПараметрыСеанса.Пользователь <> Объект.Автор Тогда
			Результат = Неопределено;
			ЗначениеДоступа = обПраво("Значения Право доступа " + Объект.Метаданные().Имя, ЗначенияПрав);
			Если ЗначениеДоступа <> Неопределено Тогда
				Результат = ЗначениеДоступа[Объект.Автор];
			КонецЕсли;
			Если (Результат = Неопределено) ИЛИ (Не Результат) Тогда
				Сообщить("Нет прав на редактирование объектов вида " + Объект.Метаданные().Представление()
				 + " по автору: " + Объект.Автор, СтатусСообщения.Важное);
				Если ЭтаФорма = Неопределено Тогда
					Отказ = Истина;
				Иначе
					ЭтаФорма.ТолькоПросмотр = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе //можно все
		
	КонецЕсли;
КонецПроцедуры // дкПроверкаПраваДоступа() 

// Проверяет документы, загруженные из другого узла РБД на право редактирования, чтения
// по виду документа и по подразделению компании
//
//Параметры:
//
// Объект		 - текущий ДокументОбъект. Обязательный для заполнения.
// Отказ 		 - результат работы процедуры, т.е. определяет текущую доступность данного объекта
// ЭтаФорма 	 - форма текущего объекта. Передается для проверки на редактирование или чтение 
//     объекта и соответственно для разрешения или запрещения редактирования формы объекта.
// ЗначенияПрав - Кеш прав текущего пользователя. тип соответствие.
//
Процедура дкПроверкаПраваДоступаКДокументамМиграции(Объект, Отказ, ЭтаФорма = Неопределено, ЗначенияПрав = Неопределено) Экспорт
	
	//если уже отказ, то не проверяем
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПланОбменаМетаданные = Метаданные.ПланыОбмена.УдаленныеПодразделения;
	ЭлементСостава = ПланОбменаМетаданные.Состав.Найти(Объект.Метаданные());
	Если ЭлементСостава = Неопределено Тогда
		Отказ = Ложь;
		Возврат;
	КонецЕсли;
	
	Результат = обПраво("Правило миграции документа " + Объект.Метаданные().Имя, ЗначенияПрав);
	Если Результат = Неопределено Тогда 
		Отказ = Ложь;
		Возврат;
	КонецЕсли;
	
	// при полной миграции ничего не проверяем
	ВариантНастройки = Результат.ВариантНастройки; 
	Если ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.ПолнаяМиграция Тогда
		Отказ = Ложь;
		Возврат;
		// в базе не могут быть документы других подразделений
	ИначеЕсли ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.МиграцияЗапрещена Тогда
		Отказ = Ложь;
		Возврат;
		// пока под вопросом
	ИначеЕсли ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.МиграцияПоПодразделениямУзлов Тогда
		Отказ = Ложь;
		Возврат;
		//если редактируем, то ничего не делаем
	ИначеЕсли ВариантНастройки = Перечисления.СпособыМиграцииОбъектов.ИндивидуальнаяНастройкаПоПодразделениямИУзлам Тогда
		Если Объект.Метаданные().Реквизиты.Найти("ПодразделениеКомпании") <> Неопределено Тогда
			ПодразделениеОбъекта = Объект.ПодразделениеКомпании;
		Иначе
			Отказ = Ложь;
			Возврат; // нет подразделения - проверять нечего
		КонецЕсли;
		// текущая ИБ
		Узел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел();
		
		СтруктураДоступа = одОбменДанными.НайтиУзелОбменаПоПодразделениюУзла(Результат,ПодразделениеОбъекта,Узел); 
		Если СтруктураДоступа = Неопределено Тогда
			Отказ = Ложь;
			Возврат;
		КонецЕсли;
		
		УзелИБИсточника = одОбменДанными.ПолучитьУзелИБПоПодразделению(ПодразделениеОбъекта);
		Если УзелИБИсточника = неопределено Тогда
			ПредставлениеИсточника = СокрЛП(УзелИБИсточника);
		Иначе	
			ПредставлениеИсточника = СокрЛП(ПодразделениеОбъекта);
		КонецЕсли; 
		
		// в порядке приоритета - или доступ закрыт или только редактирование
		Если СтруктураДоступа.ЗапретитьПросмотр Тогда
			Сообщить("Нет доступа к документам вида " + Объект.Метаданные().Синоним
			 + ", созданным в информационной базе " + СокрЛП(ПредставлениеИсточника), СтатусСообщения.Важное); 
			Отказ = Истина;
		ИначеЕсли СтруктураДоступа.ЗапретитьИзменение Тогда	
			// ЧТЕНИЕ
			Сообщить("Нет прав на редактирование документам вида " + Объект.Метаданные().Синоним
			 + ", созданным в информационной базе " + СокрЛП(ПредставлениеИсточника), СтатусСообщения.Важное); 	
			// проверка на редактирование или просмотр объекта
			Если ЭтаФорма = Неопределено Тогда
				Отказ = Истина;
			Иначе
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;	
	
КонецПроцедуры // дкПроверкаПраваДоступаКДокументамМиграции()         

#Если Сервер Тогда
	
	// Проводит документ на сервере 1С:Предприятия 
	//
	//Параметры:
	// Ссылка 			- ДокументСсылка. Ссылка на проводимый документ
	// РежимПроведения - режим проведения документа (оперативный/неоперативный). По умолчанию - неоперативный.
	//
	//Возвращаемое значение:
	// Истина - документ провелся нормально. Ложь - что-то не так.
	//
	Функция дкПровестиНаСервере(Ссылка,РежимПроведения = Неопределено) Экспорт
		// определим режим проведения
		Режим = ?(РежимПроведения = Неопределено, РежимПроведенияДокумента.Неоперативный, РежимПроведения);
		// проверим переданную ссылку
		Если обЗначениеНеЗаполнено(Ссылка) Тогда 
			Возврат Ложь;
		КонецЕсли;
		// попытаемся получить объект
		Попытка ТекОбъект = Ссылка.ПолучитьОбъект(); 
		Исключение 
			Возврат Ложь; 
		КонецПопытки;
		// пытаемся провести документ
		Попытка ТекОбъект.Записать(РежимЗаписиДокумента.Проведение,Режим); 
		Исключение 
			Возврат Ложь; 
		КонецПопытки;
		// все хорошо
		Возврат Истина;
	КонецФункции // дкПровестиНаСервере()
	
#КонецЕсли

// Проверка на наличие реквизита документа
//
// Параметры:
// ИмяРеквизита - строковое имя реквизита, наличие которого определяем
// ВидДокумента - строковое имя документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
// Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция дкДокументЕстьРеквизитШапки(ИмяРеквизита, ВидДокумента) Экспорт
	Попытка
		ЕстьРеквизит = Метаданные.Документы[ВидДокумента].Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
		Возврат ЕстьРеквизит;
	Исключение // Неверное имя документа
		Попытка
			// Возможно это обработка
			ЕстьРеквизит = Метаданные.Обработки[ВидДокумента].Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
			Возврат ЕстьРеквизит;
		Исключение // Неверное имя обработки
			Возврат Ложь;
		КонецПопытки; 
	КонецПопытки; 
КонецФункции // ДокументЕстьРеквизитШапки()

// Проверка на наличие реквизита табличной части документа
//
// Параметры:
// ИмяРеквизита - строковое имя реквизита, наличие которого определяем
// ВидДокумента - строковое имя документа, среди реквизитов которого производится поиск.
// ИмяТабЧасти - строковое имя табличной части документа, среди реквизитов которого производится поиск,
//				 по умолчанию равно "Товары".
//
// Возвращаемое значение:
// Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция дкДокументЕстьРеквизитТабЧасти(ИмяРеквизита, ВидДокумента, ИмяТабЧасти = "Товары") Экспорт
	ТабЧасть = Метаданные.Документы[ВидДокумента].ТабличныеЧасти.Найти(ИмяТабЧасти);
	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;
	Иначе
		Если ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли; 
	КонецЕсли; 
КонецФункции // дкДокументЕстьРеквизитТабЧасти()

// Проверка на наличие реквизита табличной части документа
//
// Параметры:
//  ВидДокумента - 	 - строковое имя документа, среди реквизитов которого производится поиск.
//  ИмяТабЧасти	 - 	 - строковое имя табличной части документа, среди реквизитов которого производится поиск,
//  	по умолчанию равно "Товары".
// 
// Возвращаемое значение:
//  Истина - нашли табчасть с таким именем, Ложь - не нашли.
//
Функция дкДокументЕстьТабЧасть(ВидДокумента, ИмяТабЧасти = "Товары") Экспорт
	ТабЧасть = Метаданные.Документы[ВидДокумента].ТабличныеЧасти.Найти(ИмяТабЧасти);
	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 
КонецФункции // дкДокументЕстьРеквизитТабЧасти()

//Процедура заполнения табличной части документа при вводе на основании
//
//Параметры:
// ТекущийДокумент 	- текущий документ; тип: ДокументОбъект. Обязательный для заполнения.
// ДокументОснование 	- ссылка на документ-основание; тип: ДокументСсылка. Обязательный для заполнения.
// СтруктураОснования 	- тип: Строка с именами реквизитов табличных частей основания в порядке соответствия
// 	реквизитам табличных частей подчиненных документов, разделенных запятыми.
//		Первыми обязательно идут имена реквизитов, обозначающих количество и единицу измерения товара.
// 		Они нужны для правильного пересчета товара.
//  После идут имена других реквизитов в порядке соответствия.
//		Например: СтрокаОснования = "Количество,ЕдиницаИзмерения,Ячейка"
//		Не обязателен для заполнения. По умолчанию - Неопределено. 
// СтруктураПодчиненных - тип: Структура, Ключами которой являются имена ВСЕХ видов подчиненных документов,
//		введенных до текущего документа и участвующих в вычетах,
// 	а значениями - строки с именами реквизитов табличных частей этих документов в порядке соответствия
// 	 	реквизитам табличных частей основания, разделенные запятыми.
//		Первыми обязательно идут имена реквизитов, обозначающих количество и единицу измерения товара.
// 		Они нужны для правильного пересчета товара.
//  После идут имена других реквизитов в порядке соответствия.
//		Например: СтруктураСоответствий = Новый Структура();
//				 СтруктураСответствий.Вставить( < ИмяПодчиненногоДокумента > ,"Количество,ЕдиницаИзмеренияСтарая,ЯчейкаСтарая");
//		Не обязателен для заполнения. По умолчанию - Неопределено. 
// ТолькоПроведенные - признак проверки только проведенных подчиненных документов.
// Не обязательный для заполнения. По-умолчанию = Истина.
//
Процедура дкЗаполнитьТабличнуюЧастьПоОснованию(ТекущийДокумент,ДокументОснование, СтруктураОснования = Неопределено, СтруктураПодчиненных = Неопределено, ТолькоПроведенные = Истина)Экспорт
	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;		
	Если НЕ ДокументОснование.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено И
		НЕ ТекущийДокумент.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено Тогда
		ОсновнаяТаблица = ДокументОснование.Товары.Выгрузить();
		ТаблицаДокумента = ТекущийДокумент.Товары.Выгрузить();
		
		Если СтруктураПодчиненных = Неопределено Тогда
			СтруктураПодчиненных = Новый Структура();
		КонецЕсли;
		
		//В параметре СтруктураСоответствияРеквизитовТЧ должен быть обязательно вид текущего документа
		Если Не (СтруктураПодчиненных.Свойство(ТекущийДокумент.Метаданные().Имя)) Тогда
			СтруктураПодчиненных.Вставить(ТекущийДокумент.Метаданные().Имя,"Количество,ЕдиницаИзмерения");
		КонецЕсли;	
		
		МассивВидов = Новый Массив(СтруктураПодчиненных.Количество());
		Для Каждого ЭлементСтруктуры Из СтруктураПодчиненных Цикл
			ТекЗначение = СтрЗаменить(ЭлементСтруктуры.Значение, " ", "");
			СтруктураПодчиненных.Вставить(ЭлементСтруктуры.Ключ, ТекЗначение);
			МассивВидов.Добавить(ЭлементСтруктуры.Ключ);
		КонецЦикла;
		МассивПодчиненныхДокументов = дкПолучитьМассивПодчиненных(ДокументОснование,МассивВидов);
		МассивВычитаемыхТаблиц = Новый Массив;
		
		Для Каждого ТекДокумент Из МассивПодчиненныхДокументов Цикл
			Если НЕ ТекДокумент.Метаданные().ТабличныеЧасти.Найти("Товары") = Неопределено И ТекДокумент.Проведен Тогда
				МассивВычитаемыхТаблиц.Добавить(ТекДокумент.Товары.Выгрузить());
			КонецЕсли;
		КонецЦикла;
		
		ТекущийДокумент.Товары.Загрузить(дкВычитаниеТаблиц(ОсновнаяТаблица, МассивВычитаемыхТаблиц)); 		
	КонецЕсли;	
	
	// Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
	// 	Возврат;
	// КонецЕсли;	
	// //Создаем таблицу вычетов
	// ТаблицаВычетов = Новый ТаблицаЗначений;
	// ТаблицаВычетов.Колонки.Добавить("Номенклатура");
	// ТаблицаВычетов.Колонки.Добавить("ЕдиницаИзмерения");
	// ТаблицаВычетов.Колонки.Добавить("КоличествоБазовое");
	// 
	// ИмяДокументаОснования = ДокументОснование.Метаданные().Имя;
	// ИмяТекущегоДокумента = ТекущийДокумент.Метаданные().Имя;
	// 
	// //Проверяем заполнение СтруктураОснования
	// Если СтруктураОснования = Неопределено Тогда
	// 	СтруктураОснования = "Количество,ЕдиницаИзмерения";
	// Иначе
	// 	СтруктураОснования = СтрЗаменить(СтруктураОснования, " ", "");
	// КонецЕсли;
	// 
	// Если СтруктураПодчиненных = Неопределено Тогда
	// 	СтруктураПодчиненных = Новый Структура();
	// КонецЕсли;
	// 
	// //В параметре СтруктураСоответствияРеквизитовТЧ должен быть обязательно вид текущего документа
	// Если Не (СтруктураПодчиненных.Свойство(ИмяТекущегоДокумента)) Тогда
	// 	СтруктураПодчиненных.Вставить(ИмяТекущегоДокумента,"Количество,ЕдиницаИзмерения");
	// КонецЕсли;	
	
	////	//Создаем массив подчиненных документов
	// МассивВидов = Новый Массив(СтруктураПодчиненных.Количество());
	// Для Каждого ЭлементСтруктуры Из СтруктураПодчиненных Цикл
	// 	ТекЗначение = СтрЗаменить(ЭлементСтруктуры.Значение, " ", "");
	// 	СтруктураПодчиненных.Вставить(ЭлементСтруктуры.Ключ, ТекЗначение);
	// 	МассивВидов.Добавить(ЭлементСтруктуры.Ключ);
	// КонецЦикла;	
	// 
	// МассивПодчиненныхДокументов = дкПолучитьМассивПодчиненных(ДокументОснование,МассивВидов);
	// Для Каждого ТабличнаяЧастьОснование Из ДокументОснование.Метаданные().ТабличныеЧасти Цикл
	// 	ИмяТЧ = ТабличнаяЧастьОснование.Имя;
	// 	//Обрабатываем только табличную часть Товары
	// 	Если НЕ (ИмяТЧ = "Товары") Тогда
	// 		Продолжить;
	// 	КонецЕсли;
	// 	ТЗ = ДокументОснование[ИмяТЧ].Выгрузить();
	// 	
	// 	СписокРеквизитовОснования = СтруктураОснования;
	// 	//Первым получаем Количество
	// 	Разделитель = Найти(СписокРеквизитовОснования,",");
	// 	КоличествоОснования = Лев(СписокРеквизитовОснования,Разделитель-1);
	// 	//Вторым получаем Единицу Измерения
	// 	СписокРеквизитовОснования = Сред(СписокРеквизитовОснования,Разделитель + 1);
	// 	Разделитель = Найти(СписокРеквизитовОснования,",");
	// 	Если Разделитель = 0 Тогда
	// 		ЕдиницаОснования = СписокРеквизитовОснования;
	// 	Иначе	
	// 		ЕдиницаОснования = Лев(СписокРеквизитовОснования,Разделитель-1);
	// 	КонецЕсли;
	// 	
	// 	//Добавляем колонку КоличествоБазовое, чтобы вычислять остаток по базовой единице измерения товара
	// 	Если ТЗ.Колонки.Найти("КоличествоБазовое") = Неопределено Тогда
	// 		ТЗ.Колонки.Добавить("КоличествоБазовое");
	// 	КонецЕсли;
	// 	Для Н = 1 По ТЗ.Количество() Цикл
	// 		СтрокаТЗ = ТЗ.Получить(Н-1);
	// 		//вычисляем базовое количество товара
	// 		СтрокаТЗ.КоличествоБазовое = СтрокаТЗ[КоличествоОснования] * СтрокаТЗ[ЕдиницаОснования].Коэффициент;
	// 	КонецЦикла;
	// 	
	// 	ТекИндекс = 0;
	// 	//перебираем массив подчиненных документов, введенных ранее на основании ДокументОснование
	// 	Пока ТекИндекс <= МассивПодчиненныхДокументов.ВГраница() Цикл
	// 		ТекущийПодчиненныйДок = МассивПодчиненныхДокументов[ТекИндекс];
	// 		//проверяем условие и проведенность документа
	// 		Если ТолькоПроведенные И НЕ ТекущийПодчиненныйДок.Проведен Тогда
	// 			Продолжить
	// 		КонецЕсли;
	// 		СписокРеквизитовПодчиненного = "";
	// 		СтруктураПодчиненных.Свойство(ТекущийПодчиненныйДок.Метаданные().Имя,СписокРеквизитовПодчиненного);
	// 		//Первым получаем Количество
	// 		Разделитель = Найти(СписокРеквизитовПодчиненного,",");
	// 		КоличествоПодчиненного = Лев(СписокРеквизитовПодчиненного,Разделитель-1);
	// 		//Вторым получаем Единицу Измерения
	// 		СписокРеквизитовПодчиненного = Сред(СписокРеквизитовПодчиненного,Разделитель + 1);
	// 		Разделитель = Найти(СписокРеквизитовПодчиненного,",");
	// 		Если Разделитель = 0 Тогда
	// 			ЕдиницаПодчиненного = СписокРеквизитовПодчиненного;
	// 		Иначе	
	// 			ЕдиницаПодчиненного = Лев(СписокРеквизитовПодчиненного,Разделитель-1);
	// 		КонецЕсли;
	// 		//Получаем количество подчиненного документа
	// 		//накапливаем количество уже введенных товаров
	// 		Для Н = 0 По ТекущийПодчиненныйДок.Товары.Количество()-1 Цикл
	// 			ТекСтрокаПД = ТекущийПодчиненныйДок.Товары.Получить(Н);
	// 			НоваяСтрокаВычетов = ТаблицаВычетов.Добавить();
	// 			НоваяСтрокаВычетов.Номенклатура = ТекСтрокаПД.Номенклатура;
	// 			НоваяСтрокаВычетов.ЕдиницаИзмерения = ТекСтрокаПД[ЕдиницаПодчиненного];
	// 			НоваяСтрокаВычетов.КоличествоБазовое = ТекСтрокаПД[ЕдиницаПодчиненного].Коэффициент *
	//			ТекСтрокаПД[КоличествоПодчиненного];
	// 		КонецЦикла;	
	// 		ТекИндекс = ТекИндекс + 1;
	// 	КонецЦикла;
	// 	ТаблицаВычетов.Свернуть("Номенклатура","КоличествоБазовое");
	// 	
	// 	спрЕдиницыИзмерения = Справочники.ЕдиницыИзмерения;
	// 	Индекс = 0;
	// 	Пока Индекс < ТЗ.Количество() Цикл
	// 		ТекСтрокаТЗ = ТЗ.Получить(Индекс);
	// 		КоличествоБазовоеОснования = ТекСтрокаТЗ.КоличествоБазовое;
	// 		КоэффициентОснования = ТекСтрокаТЗ[ЕдиницаОснования].Коэффициент;
	// 		//вычисляем количество невыбранных товаров по данной номенклатуре
	// 		СтрокаВычетов = ТаблицаВычетов.Найти(ТекСтрокаТЗ.Номенклатура,"Номенклатура");
	// 		Если Не (СтрокаВычетов = Неопределено) Тогда
	// 			ТекСтрокаТЗ.КоличествоБазовое = ТекСтрокаТЗ.КоличествоБазовое - СтрокаВычетов.КоличествоБазовое;
	// 		КонецЕсли;
	// 		//все значения по данной номенклатуре были выбраны в предыдущих документах
	// 		Если ТекСтрокаТЗ.КоличествоБазовое <= 0 Тогда
	// 			ТЗ.Удалить(Индекс);
	// 			Продолжить;
	// 		Иначе
	// 			Индекс = Индекс + 1;
	// 		КонецЕсли;	
	// 		Если ТекСтрокаТЗ.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 1 Тогда
	//      // подчинены типу номенклатуры
	// 			Владелец = ТекСтрокаТЗ.Номенклатура.ТипНоменклатуры;
	// 		Иначе // подчинены номенклатуре
	// 			Владелец = ТекСтрокаТЗ.Номенклатура;
	// 		КонецЕсли;
	// 		//ищем подходящую единицу измерения
	// 		ЕдиницыИзмеренияНоменклатуры = спрЕдиницыИзмерения.Выбрать(,Владелец,,"Коэффициент Убыв");
	// 		ПодходящаяЕдиницаИзмерения = Неопределено;
	// 		Пока (ЕдиницыИзмеренияНоменклатуры.Следующий())и(ПодходящаяЕдиницаИзмерения = Неопределено) Цикл
	// 			КоличествоЕИ = ТекСтрокаТЗ.КоличествоБазовое/ЕдиницыИзмеренияНоменклатуры.Коэффициент;
	// 			Если Цел(КоличествоЕИ) = КоличествоЕИ Тогда
	// 				ПодходящаяЕдиницаИзмерения = ЕдиницыИзмеренияНоменклатуры.Ссылка;
	// 			КонецЕсли;
	// 		КонецЦикла;
	// 		//Если нет, берем базовую
	// 		Если ПодходящаяЕдиницаИзмерения = Неопределено Тогда
	// 			ПодходящаяЕдиницаИзмерения = обПолучитьЕдиницуИзмеренияПоБазовой(ТекСтрокаТЗ.Номенклатура);
	// 			КоличествоЕИ = ТекСтрокаТЗ.КоличествоБазовое/ПодходящаяЕдиницаИзмерения.Коэффициент;
	// 		КонецЕсли;	
	// 		Попытка
	// 			ТекСтрокаТЗ[КоличествоОснования] = КоличествоЕИ;
	// 		Исключение
	// 		КонецПопытки;	
	// 		Попытка
	// 			ТекСтрокаТЗ[ЕдиницаОснования] = ПодходящаяЕдиницаИзмерения;
	// 		Исключение
	// 		КонецПопытки;	
	// 		Попытка
	// 			ТекСтрокаТЗ.Коэффициент = ПодходящаяЕдиницаИзмерения.Коэффициент;
	// 		Исключение
	// 		КонецПопытки;
	// 		//вычисляем суммовые реквизиты
	// 		Попытка
	// 			ТекСтрокаТЗ.Цена = ТекСтрокаТЗ.Цена/КоэффициентОснования*ТекСтрокаТЗ.Коэффициент;
	// 		Исключение
	// 		КонецПопытки;
	// 		Попытка
	// 			ТекСтрокаТЗ.Сумма = ТекСтрокаТЗ.Сумма/КоличествоБазовоеОснования*ТекСтрокаТЗ.КоличествоБазовое;
	// 		Исключение
	// 		КонецПопытки;
	// 		Попытка
	// 			ТекСтрокаТЗ.СуммаСкидки = ТекСтрокаТЗ.СуммаСкидки/КоличествоБазовоеОснования*ТекСтрокаТЗ.КоличествоБазовое;
	// 		Исключение
	// 		КонецПопытки;
	// 		Попытка
	// 			ТекСтрокаТЗ.СуммаНДС = ТекСтрокаТЗ.СуммаНДС/КоличествоБазовоеОснования*ТекСтрокаТЗ.КоличествоБазовое;
	// 		Исключение
	// 		КонецПопытки;
	// 		Попытка
	// 			ТекСтрокаТЗ.СуммаВсего = ТекСтрокаТЗ.СуммаВсего/КоличествоБазовоеОснования*ТекСтрокаТЗ.КоличествоБазовое;
	// 		Исключение
	// 		КонецПопытки;
	// 	КонецЦикла;
	// 	//заменяем названия колонок
	// 	
	// 	СписокРеквизитовОснования = СтруктураОснования;
	// 	СписокРеквизитовПодчиненного = "";
	// 	СтруктураПодчиненных.Свойство(ИмяТекущегоДокумента,СписокРеквизитовПодчиненного);
	// 	
	// 	//Первым получаем Количество
	// 	//Для инициации цикла
	// 	Пока НЕ (СписокРеквизитовОснования = "") Цикл
	// 		РазделительОснования = Найти(СписокРеквизитовОснования,",");
	// 		РазделительПодчиненного = Найти(СписокРеквизитовПодчиненного,",");
	// 		Если РазделительОснования = 0 Тогда
	// 			ТекущееИмяКолонки = СписокРеквизитовОснования;
	// 			НовоеИмяКолонки = СписокРеквизитовПодчиненного;
	// 			СписокРеквизитовОснования = "";
	// 		Иначе	
	// 			ТекущееИмяКолонки = Лев(СписокРеквизитовОснования,РазделительОснования-1);
	// 			НовоеИмяКолонки = Лев(СписокРеквизитовПодчиненного,РазделительПодчиненного-1);
	// 			СписокРеквизитовОснования = Сред(СписокРеквизитовОснования,РазделительОснования + 1);
	// 			СписокРеквизитовПодчиненного = Сред(СписокРеквизитовПодчиненного,РазделительПодчиненного + 1);
	// 		КонецЕсли;
	// 		Если НЕ(ТекущееИмяКолонки = НовоеИмяКолонки) Тогда
	// 			КолонкиТаблицыЗначения = ТЗ.Колонки;
	// 			Для Каждого КолонкаТЗ из КолонкиТаблицыЗначения Цикл
	// 				Если КолонкаТЗ.Имя = ТекущееИмяКолонки Тогда
	// 					// если колонка с таким именем уже есть - удаляем ее
	// 					КолонкаДляУдаления = КолонкиТаблицыЗначения.Найти(НовоеИмяКолонки);
	// 					Если Не КолонкаДляУдаления = Неопределено Тогда
	// 						КолонкиТаблицыЗначения.Удалить(КолонкаДляУдаления);
	// 					КонецЕсли;
	// 					КолонкаТЗ.Имя = НовоеИмяКолонки;
	// 					Прервать;
	// 				КонецЕсли;
	// 			КонецЦикла;
	// 		КонецЕсли;	
	// 	КонецЦикла;
	// 	Попытка	
	// 		ТекущийДокумент[ИмяТЧ].Загрузить(ТЗ);
	// 	Исключение
	// 	КонецПопытки;
	// КонецЦикла;	
КонецПроцедуры // дкЗаполнитьТабличнуюЧастьПоОснованию()

Функция дкПроверкаСуммовыхПоказателейДокумента(ДокументОбъект, ИмяТабличнойЧасти = "Товары", ИмяРеквизитаЦены = "Цена") Экспорт
	
	// Проверка введенных сумм для оплаты.
	Если ДокументОбъект.ВидОплаты = Перечисления.ВидыОплаты.НаличныйРасчет Тогда
		
		// 1. Проверка типа цен.
		Если НЕ ДокументОбъект.ТипЦен.ЦенаВключаетНДС Тогда
			#Если Клиент Тогда
				Сообщить("Указанный тип цен не включает НДС! Запись документа отменена.", СтатусСообщения.Важное);
			#КонецЕсли
			Возврат Истина;
		КонецЕсли;
		
		// 2. Проверим соответствие цен и сумм в ТЧ Товары.
		Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
			ТекстСообщения = дкПерерасчитатьСуммуТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ИмяРеквизитаЦены);
			
			Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
				#Если Клиент Тогда
					Сообщить(ТекстСообщения, СтатусСообщения.Информация);
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//Процедура пересчета табличной части документа для корректной оплаты на фискальном регистраторе
//
//Параметры:
// ДокументОбъект    - текущий документ пересчета; тип: ДокументОбъект. Обязательный для заполнения.
// ИмяТабличнойЧасти - имя табличной части пересчета; тип: Строка. Не обязателен для заполнения. По умолчанию - "Товары".
// ИмяРеквизитаЦены  - имя реквизита цены в табличной части; тип: Строка. Не обязателен для заполнения. По умолчанию - "Цена".
//
// Возвращаемое значение:
//  Строка с информацией о полях, в которых произошли изменения.
//
Функция дкПерерасчитатьСуммуТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти = "Товары", ИмяРеквизитаЦены = "Цена") Экспорт
	
	// Проверим, что документ объект был передан в функцию
	Если ДокументОбъект = Неопределено ИЛИ обЗначениеНеЗаполнено(ДокументОбъект) Тогда
		Возврат "Ошибка при пересчете табличной части документа: документ не найден.";
	КонецЕсли;
	
	// Проверим наличие табличной части в документе
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументОбъект));
	Если НЕ дкДокументЕстьТабЧасть(МетаданныеДокумента.Имя, ИмяТабличнойЧасти) Тогда
		Возврат "Ошибка при пересчете табличной части документа: табличная часть <" + ИмяТабличнойЧасти + "> не найдена.";
	КонецЕсли;
	
	// Проверим наличие реквизита цены в табличной части документа
	Если НЕ дкДокументЕстьРеквизитТабЧасти(ИмяРеквизитаЦены, МетаданныеДокумента.Имя, ИмяТабличнойЧасти) Тогда
		Возврат "Ошибка при пересчете табличной части документа: реквизит <" + ИмяРеквизитаЦены + "> не найден.";
	КонецЕсли;
	
	// Скопируем табличную часть, чтобы потом проверить наличие изменений после пересчета
	ТабличнаяЧастьКопия = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
	
	РезультатПоСтрокам = "";
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("НеРассчитыватьСкидки", Истина);
	
	// на время включем блокировку перерасчета скидок
	БлокироватьПерерасчетСкидок = Ложь;
	ЕстьБлокироватьПерерасчетСкидок = дкДокументЕстьРеквизитШапки("БлокироватьПерерасчетСкидок", МетаданныеДокумента.Имя);
	
	Если ЕстьБлокироватьПерерасчетСкидок Тогда
		БлокироватьПерерасчетСкидок = ДокументОбъект.БлокироватьПерерасчетСкидок;
		ДокументОбъект.БлокироватьПерерасчетСкидок = Истина;
	КонецЕсли;
	
	// Выполним пересчет по цене для каждой строки
	Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект[ИмяТабличнойЧасти] Цикл
		ДокументОбъект.ОбработкаРеквизита(ИмяТабличнойЧасти+"."+ИмяРеквизитаЦены, СтрокаТабличнойЧасти,,ДопПараметры);
	КонецЦикла;
	
	Если ЕстьБлокироватьПерерасчетСкидок Тогда
		ДокументОбъект.БлокироватьПерерасчетСкидок = БлокироватьПерерасчетСкидок;
	КонецЕсли;
	
	Если дкДокументЕстьРеквизитШапки("КоличествоКСписанию", МетаданныеДокумента.Имя) Тогда
		ДокументОбъект.ОбработкаРеквизита("КоличествоКСписанию", СтрокаТабличнойЧасти);
	КонецЕсли;
	
	// Сравним новые рассчитанные значения с предыдущими
	Для Каждого СтрокаТабличнойЧасти Из ДокументОбъект[ИмяТабличнойЧасти] Цикл
		СледующаяСтрока = Истина;
		// Сравним новые рассчитанные значения с предыдущими
		Для Каждого Колонка Из ТабличнаяЧастьКопия.Колонки Цикл
			Если ТабличнаяЧастьКопия[СтрокаТабличнойЧасти.НомерСтроки-1][Колонка.Имя] = СтрокаТабличнойЧасти[Колонка.Имя] Тогда
				Продолжить;
			Иначе
				Если СледующаяСтрока Тогда
					РезультатПоСтрокам = РезультатПоСтрокам + Символы.ПС + "Строка " + СтрокаТабличнойЧасти.НомерСтроки + ": ";
				КонецЕсли;
				РезультатПоСтрокам = РезультатПоСтрокам + Колонка.Имя + " (с " + ТабличнаяЧастьКопия[СтрокаТабличнойЧасти.НомерСтроки-1][Колонка.Имя] + " на " + СтрокаТабличнойЧасти[Колонка.Имя] + "); ";
				СледующаяСтрока = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ?(ПустаяСтрока(РезультатПоСтрокам), "",
		"При пересчете табличной части <" + ИмяТабличнойЧасти + "> документа <" + ДокументОбъект + "> произошли изменения:" + Лев(РезультатПоСтрокам, СтрДлина(РезультатПоСтрокам)-2) + ".");
	
КонецФункции // дкПерерассчитатьТабличнуюЧастьОтЦены()

//Процедура проверки заполнения (и заполнения незаполненных) параметров перед выполнением процедуры дкВычитаниеТаблиц
//
//Параметры:
// ОсновнаяТаблица 		- Таблица из которой будет выполнено вычитание; Тип: ТаблицаЗначений; Обязательный для заполнения.
// МассивВычитаемыхТаблиц 	- Массив ТаблицЗначений которые будут вычитаться из ОсновнойТаблицы; Тип: Массив;
//							 Необязательный для заполнения (если не заполнен дкВычитание таблиц возвращает значение ОсновнаяТаблица).
// СтруктураОснования 		- Имена реквизитов ОсновнойТаблицы в порядке соответствия;
//							  Тип: Структура; Необязательный для заполнения.
// 						 Может содержать ключи: Измерения; Тип значения: Строка (или Массив Строк)
//													 Количество; Тип значения: Строка
//													 ЕдиницаИзмерения; Тип значения: Строка
//							 Заполняется по-умолчанию: Измерения: "Номенклатура", "ХарактеристикаНоменклатуры"
//													 Количество: "Количество"
//													 ЕдиницаИзмерения: "ЕдиницаИзмерения"
//	МассивСтруктурВычитаемыхТаблиц - Массив структур реквизитов вычитаемых таблиц; Тип: Массив;
//									 Необязательный для заполнения.
// 									 Структуры аналогичны СтруктуреОснования, заполняются по-умолчанию так же		
//
Функция дкВычитаниеТаблицПроверкаЗаполнения(ОсновнаяТаблица, МассивВычитаемыхТаблиц, СтруктураОсновнойТаблицы = Неопределено, МассивСтруктурВычитаемыхТаблиц = Неопределено)
	
	// Проверяем заполнение реквизитов (незаполненные заполняем по умолчанию)
	// Основную таблицу
	Если обЗначениеНеЗаполнено(ОсновнаяТаблица) ИЛИ НЕ ТипЗнч(ОсновнаяТаблица) = Тип("ТаблицаЗначений") Тогда
		Возврат Ложь; //ОШИБКА! Не указана основная таблица
	КонецЕсли;
	
	// Структуру основной таблицы
	Если СтруктураОсновнойТаблицы = Неопределено ИЛИ НЕ ТипЗнч(ОсновнаяТаблица) = Тип("Структура") Тогда
		СтруктураОсновнойТаблицы = Новый Структура;
	Иначе
		Если НЕ (СтруктураОсновнойТаблицы.Свойство("Измерения") И СтруктураОсновнойТаблицы.Свойство("Количество") И СтруктураОсновнойТаблицы.Свойство("ЕдиницаИзмерения")) Тогда
			Возврат Ложь; //ОШИБКА! Неверно заполнена структура основной таблицы
		КонецЕсли;
	КонецЕсли;
	
	ИзмеренияТаблицы = Неопределено;
	Если СтруктураОсновнойТаблицы.Свойство("Измерения", ИзмеренияТаблицы) И НЕ ИзмеренияТаблицы = Неопределено И
		(ТипЗнч(ИзмеренияТаблицы) = Тип("Строка") ИЛИ ТипЗнч(ИзмеренияТаблицы) = Тип("Массив")) Тогда
		Если ТипЗнч(ИзмеренияТаблицы) = Тип("Строка") Тогда
			Если ОсновнаяТаблица.Колонки.Найти(ИзмеренияТаблицы) = Неопределено Тогда
				Возврат Ложь; //ОШИБКА! Неверный параметр структуры основной таблицы (параметр Измерения)
			КонецЕсли;
			Измерения = Новый Массив;
			Измерения.Добавить(ИзмеренияТаблицы);
			СтруктураОсновнойТаблицы.Вставить("Измерения",Измерения);
		КонецЕсли;
	Иначе
		Измерения = Новый Массив;
		Если НЕ ОсновнаяТаблица.Колонки.Найти("Номенклатура") = Неопределено Тогда
			Измерения.Добавить("Номенклатура");
		КонецЕсли;	
		Если НЕ ОсновнаяТаблица.Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
			Измерения.Добавить("ХарактеристикаНоменклатуры");
		КонецЕсли;	
		Если Измерения.Количество() = 0 Тогда
			Возврат Ложь; //ОШИБКА! Структуру основной таблицы не удалось заполнить по умолчанию (параметр Измерения)
		КонецЕсли;
		СтруктураОсновнойТаблицы.Вставить("Измерения",Измерения);
	КонецЕсли;
	
	Если НЕ СтруктураОсновнойТаблицы.Свойство("Количество") Тогда
		Если НЕ ОсновнаяТаблица.Колонки.Найти("Количество") = Неопределено Тогда
			СтруктураОсновнойТаблицы.Вставить("Количество","Количество");
		Иначе
			Возврат Ложь; //ОШИБКА! Структуру основной таблицы не удалось заполнить по умолчанию (параметр Количество)
		КонецЕсли;
	Иначе
		Если ОсновнаяТаблица.Колонки.Найти(СтруктураОсновнойТаблицы.Количество) = Неопределено Тогда
			Возврат Ложь; //ОШИБКА! Неверный параметр структуры основной таблицы (параметр Количество)
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтруктураОсновнойТаблицы.Свойство("ЕдиницаИзмерения") Тогда
		Если НЕ ОсновнаяТаблица.Колонки.Найти("ЕдиницаИзмерения") = Неопределено Тогда
			СтруктураОсновнойТаблицы.Вставить("ЕдиницаИзмерения","ЕдиницаИзмерения");
		Иначе
			Возврат Ложь; //ОШИБКА! Структуру основной таблицы не удалось заполнить по умолчанию (параметр Количество)
		КонецЕсли;
	Иначе
		Если ОсновнаяТаблица.Колонки.Найти(СтруктураОсновнойТаблицы.ЕдиницаИзмерения) = Неопределено Тогда
			Возврат Ложь; //ОШИБКА! Неверный параметр структуры основной таблицы (параметр ЕдиницаИзмерения)
		КонецЕсли;
	КонецЕсли;
	
	//Вычитаемые таблицы
	Если НЕ ТипЗнч(МассивВычитаемыхТаблиц) = Тип("Массив") Тогда
		Возврат Ложь; //ОШИБКА! Не указаны вычитаемые таблицы
	ИначеЕсли МассивВычитаемыхТаблиц.Количество() = 0 Тогда
	КонецЕсли;
	
	Если МассивСтруктурВычитаемыхТаблиц = Неопределено Тогда
		МассивСтруктурВычитаемыхТаблиц = Новый Массив;
	КонецЕсли;
	
	Для Индекс = 0 По МассивВычитаемыхТаблиц.ВГраница() Цикл
		
		Если Индекс < МассивСтруктурВычитаемыхТаблиц.Количество() Тогда
			СтруктураТаблицы = МассивСтруктурВычитаемыхТаблиц[Индекс];
			Если НЕ (СтруктураТаблицы.Свойство("Измерения") И СтруктураТаблицы.Свойство("Количество") И СтруктураТаблицы.Свойство("ЕдиницаИзмерения")) Тогда
				Возврат Ложь; //ОШИБКА! Неверно заполнена структура вычитаемой таблицы
			КонецЕсли;
		Иначе
			СтруктураТаблицы = Новый Структура;
		КонецЕсли;
		
		ИзмеренияТаблицы = Неопределено;
		Если СтруктураТаблицы.Свойство("Измерения", ИзмеренияТаблицы) И НЕ ИзмеренияТаблицы = Неопределено И
			(ТипЗнч(ИзмеренияТаблицы) = Тип("Строка") ИЛИ ТипЗнч(ИзмеренияТаблицы) = Тип("Массив")) Тогда
			Если ТипЗнч(ИзмеренияТаблицы) = Тип("Строка") Тогда
				Если МассивВычитаемыхТаблиц[Индекс].Колонки.Найти(ИзмеренияТаблицы) = Неопределено Тогда
					Возврат Ложь; //ОШИБКА! Неверный параметр структуры вычитаемой таблицы (параметр Измерения)
				КонецЕсли;
				Измерения = Новый Массив;
				Измерения.Добавить(ИзмеренияТаблицы);
				СтруктураТаблицы.Вставить("Измерения",Измерения);
			КонецЕсли;
		Иначе
			Измерения = Новый Массив;
			Если НЕ МассивВычитаемыхТаблиц[Индекс].Колонки.Найти("Номенклатура") = Неопределено Тогда
				Измерения.Добавить("Номенклатура");
			КонецЕсли;	
			Если НЕ МассивВычитаемыхТаблиц[Индекс].Колонки.Найти("ХарактеристикаНоменклатуры") = Неопределено Тогда
				Измерения.Добавить("ХарактеристикаНоменклатуры");
			КонецЕсли;	
			Если Измерения.Количество() = 0 Тогда
				Возврат Ложь; //ОШИБКА! Структуру вычитаемой таблицы не удалось заполнить по умолчанию (параметр Измерения)
			КонецЕсли;
			СтруктураТаблицы.Вставить("Измерения",Измерения);
		КонецЕсли;
		
		Если НЕ СтруктураТаблицы.Свойство("Количество") Тогда
			Если НЕ МассивВычитаемыхТаблиц[Индекс].Колонки.Найти("Количество") = Неопределено Тогда
				СтруктураТаблицы.Вставить("Количество","Количество");
			Иначе
				Возврат Ложь; //ОШИБКА! Структуру вычитаемой таблицы не удалось заполнить по умолчанию (параметр Количество)
			КонецЕсли;
		Иначе
			Если МассивВычитаемыхТаблиц[Индекс].Колонки.Найти(СтруктураТаблицы.Количество) = Неопределено Тогда
				Возврат Ложь; //ОШИБКА! Неверный параметр структуры вычитаемой таблицы (параметр Количество)
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СтруктураТаблицы.Свойство("ЕдиницаИзмерения") Тогда
			Если НЕ МассивВычитаемыхТаблиц[Индекс].Колонки.Найти("ЕдиницаИзмерения") = Неопределено Тогда
				СтруктураТаблицы.Вставить("ЕдиницаИзмерения","ЕдиницаИзмерения");
			Иначе
				Возврат Ложь; //ОШИБКА! Структуру вычитаемой таблицы не удалось заполнить по умолчанию (параметр Количество)
			КонецЕсли;
		Иначе
			Если МассивВычитаемыхТаблиц[Индекс].Колонки.Найти(СтруктураТаблицы.ЕдиницаИзмерения) = Неопределено Тогда
				Возврат Ложь; //ОШИБКА! Неверный параметр структуры вычитаемой таблицы (параметр ЕдиницаИзмерения)
			КонецЕсли;
		КонецЕсли;
		
		МассивСтруктурВычитаемыхТаблиц.Вставить(Индекс, СтруктураТаблицы); 		
	КонецЦикла;
	
	Возврат Истина; 	
КонецФункции

//Процедура вычитания из одной таблицы других с учетом реквизитов, указанных в параметрах
//
//Параметры:
// ОсновнаяТаблица 		- Таблица из которой будет выполнено вычитание; Тип: ТаблицаЗначений; Обязательный для заполнения.
// МассивВычитаемыхТаблиц 	- Массив ТаблицЗначений которые будут вычитаться из ОсновнойТаблицы;
//							  Тип: Массив; Необязательный для заполнения
// СтруктураОснования 		- Имена реквизитов ОсновнойТаблицы в порядке соответствия; Тип: Структура;
//							  Необязательный для заполнения.
// 						 Может содержать ключи: Измерения; Тип значения: Строка (или Массив Строк)
//													 Количество; Тип значения: Строка
//													 ЕдиницаИзмерения; Тип значения: Строка
//	МассивСтруктурВычитаемыхТаблиц - Массив структур реквизитов вычитаемых таблиц; Тип: Массив;
//	Необязательный для заполнения.
// 									 Структуры аналогичны СтруктуреОснования, заполняются по-умолчанию так же		
//
Функция дкВычитаниеТаблиц(Знач ОсновнаяТаблица, МассивВычитаемыхТаблиц, СтруктураОсновнойТаблицы = Неопределено, МассивСтруктурВычитаемыхТаблиц = Неопределено) Экспорт
	
	Если НЕ дкВычитаниеТаблицПроверкаЗаполнения(ОсновнаяТаблица, МассивВычитаемыхТаблиц, СтруктураОсновнойТаблицы, МассивСтруктурВычитаемыхТаблиц) Тогда
		#Если Клиент Тогда
			Сообщить("Вычитание таблиц не было выполнено, т.к. были обнаружены ошибки в параметрах");
		#КонецЕсли	
		Возврат ОсновнаяТаблица;
	КонецЕсли;
	
	Если МассивВычитаемыхТаблиц.Количество() = 0 Тогда
		Возврат ОсновнаяТаблица;
	КонецЕсли;
	
	Измерения        = СтруктураОсновнойТаблицы.Измерения;
	ЕдиницаИзмерения = СтруктураОсновнойТаблицы.ЕдиницаИзмерения;
	Количество       = СтруктураОсновнойТаблицы.Количество;
	
	ТекстИзмерений = "";
	ТекстСгруппировать = "";
	Для Каждого ТекИзмерение Из Измерения Цикл
		ТекстИзмерений = ТекстИзмерений + "ВнешнийИсточник." + ТекИзмерение + " КАК " + ТекИзмерение + ",
		|	";
		ТекстСгруппировать = ТекстСгруппировать + "ВнешнийИсточник." + ТекИзмерение + ",
		|	";
	КонецЦикла;
	
	//Выгружаем все таблицы в менеджер таблиц
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	" + ТекстИзмерений + "
	|	ВнешнийИсточник." + ЕдиницаИзмерения + " КАК ЕдиницаИзмерения,
	|	ВнешнийИсточник." + Количество + " КАК Количество
	|ПОМЕСТИТЬ
	|	Таблица0
	|ИЗ
	|	&ВнешнийИсточник КАК ВнешнийИсточник
	|;
	|
	|ВЫБРАТЬ
	|	" + ТекстИзмерений + "
	|	ВнешнийИсточник.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВнешнийИсточник.Количество) КАК Количество
	|ПОМЕСТИТЬ
	|	ОсновнаяТаблица
	|ИЗ
	|	Таблица0 КАК ВнешнийИсточник
	|СГРУППИРОВАТЬ ПО
	|	" + ТекстСгруппировать + "
	|	ВнешнийИсточник.ЕдиницаИзмерения
	|;
	|";
	Запрос.УстановитьПараметр("ВнешнийИсточник", ОсновнаяТаблица);
	
	//Перебираем массив вычитаемых таблиц и выгружаем их в менеджер таблиц
	Индекс = 0;
	ТекстЗапросаТаблиц = "";
	Для Каждого ТекВычитаемаяТаблица Из МассивВычитаемыхТаблиц Цикл
		ТекСтруктура = МассивСтруктурВычитаемыхТаблиц[Индекс];
		
		ТекстИзмерений = "";
		Для Индекс1 = 0 По Измерения.ВГраница() Цикл
			ТекстИзмерений = ТекстИзмерений + "
			|	ВнешнийИсточник." + ТекСтруктура.Измерения[Индекс1] + " КАК " + Измерения[Индекс1] + ","
		КонецЦикла;
		
		ИндексСтрока = Формат(Индекс + 1,"ЧН = 0; ЧГ = ");
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	" + ТекстИзмерений + "
		|	ВнешнийИсточник." + ТекСтруктура.ЕдиницаИзмерения + " КАК ЕдиницаИзмерения,
		|	ВнешнийИсточник." + ТекСтруктура.Количество       + " КАК Количество" + "
		|ПОМЕСТИТЬ
		|	ВнешнийИсточник" + ИндексСтрока + " 
		|ИЗ
		|	&ВнешнийИсточник" + ИндексСтрока + " КАК ВнешнийИсточник
		|;
		|";
		
		ТекстЗапросаТаблиц = ТекстЗапросаТаблиц + ?(Индекс = 0 ,"","
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|") + "
		|ВЫБРАТЬ
		|	" + ТекстИзмерений + "
		|	ВнешнийИсточник." + ТекСтруктура.ЕдиницаИзмерения + " КАК ЕдиницаИзмерения,
		|	ВнешнийИсточник." + ТекСтруктура.Количество       + " КАК Количество
		|ИЗ
		|	ВнешнийИсточник" + ИндексСтрока + " КАК ВнешнийИсточник";
		
		Запрос.УстановитьПараметр("ВнешнийИсточник" + ИндексСтрока, ТекВычитаемаяТаблица);
		Индекс = Индекс + 1;
	КонецЦикла;
	
	//Объединяем все помещенные таблицы и группируем по Измерениям и ЕдиницеИзмерения
	//Результат помещаем в менеджер
	ТекстИзмерений = "";
	ТекстСоединения = "";
	Для Каждого ТекИзмерение Из Измерения Цикл
		
		ТекстИзмерений = ТекстИзмерений + "ВнешнийИсточник." + ТекИзмерение + ",
		|	";
		
		ТекстСоединения = ТекстСоединения + "ВнешнийИсточник." + ТекИзмерение + " = ОсновнаяТаблица." + ТекИзмерение + " И 
		|	";
		
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
	|ВЫБРАТЬ
	|	" + ТекстИзмерений   + "
	|	ВнешнийИсточник.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ЕСТЬNULL(ЕИ.Коэффициент, 1)) КАК Коэффициент,
	|	СУММА(ВнешнийИсточник.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА ЕИ.Коэффициент ЕСТЬ NULL ТОГДА
	|			ВнешнийИсточник.Количество
	|		ИНАЧЕ
	|			ВнешнийИсточник.Количество*ЕИ.Коэффициент
	|	КОНЕЦ) КАК КоличествоБаза
	|ПОМЕСТИТЬ
	|	ТаблицаСВычетами
	|ИЗ
	|	("+ТекстЗапросаТаблиц+") КАК ВнешнийИсточник
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ЕдиницыИзмерения КАК ЕИ
	|ПО
	|	ВнешнийИсточник.ЕдиницаИзмерения = ЕИ.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	" + ТекстИзмерений + "
	|	ВнешнийИсточник.ЕдиницаИзмерения
	|;
	|
	|ВЫБРАТЬ
	|	" + ТекстИзмерений   + "
	|	ВнешнийИсточник.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВнешнийИсточник.Коэффициент КАК Коэффициент,
	|	ВнешнийИсточник.Количество КАК Количество,
	|	ВнешнийИсточник.КоличествоБаза КАК КоличествоБаза,
	|	ВЫБОР
	|		КОГДА ОсновнаяТаблица.Количество ЕСТЬ NULL ТОГДА
	|			ВнешнийИсточник.Количество*ВнешнийИсточник.Коэффициент
	|		КОГДА ВнешнийИсточник.Количество > ОсновнаяТаблица.Количество ТОГДА
	|			(ВнешнийИсточник.Количество - ОсновнаяТаблица.Количество)*ВнешнийИсточник.Коэффициент
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ СвободноеКоличество
	|ИЗ
	|	ТаблицаСВычетами КАК ВнешнийИсточник
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ОсновнаяТаблица КАК ОсновнаяТаблица
	|ПО
	|	" + ТекстСоединения + "
	|	ВнешнийИсточник.ЕдиницаИзмерения = ОсновнаяТаблица.ЕдиницаИзмерения
	|";
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаСВычетами = Запрос.Выполнить().Выгрузить();
	
	ЕстьКоличествоБазовое  = (НЕ ОсновнаяТаблица.Колонки.Найти("КоличествоБазовое")  = Неопределено);
	ЕстьКоэффициент        = (НЕ ОсновнаяТаблица.Колонки.Найти("Коэффициент")        = Неопределено);
	ЕстьСумма              = (НЕ ОсновнаяТаблица.Колонки.Найти("Сумма")              = Неопределено);
	ЕстьСуммаСкидки        = (НЕ ОсновнаяТаблица.Колонки.Найти("СуммаСкидки")        = Неопределено);
	ЕстьСуммаСкидкиСтроки  = (НЕ ОсновнаяТаблица.Колонки.Найти("СуммаСкидкиСтроки")  = Неопределено);
	ЕстьСуммаНДС           = (НЕ ОсновнаяТаблица.Колонки.Найти("СуммаНДС")           = Неопределено);
	ЕстьСуммаВсего         = (НЕ ОсновнаяТаблица.Колонки.Найти("СуммаВсего")         = Неопределено);
	
	Результат = ОсновнаяТаблица.СкопироватьКолонки();
	СтруктураПоиска = Новый Структура();
	СтруктураПоискаПоЕдинице = Новый Структура();
	Для Каждого ТекИзмерение Из Измерения Цикл
		СтруктураПоиска.Вставить(ТекИзмерение);
		СтруктураПоискаПоЕдинице.Вставить(ТекИзмерение);
	КонецЦикла;
	СтруктураПоискаПоЕдинице.Вставить("ЕдиницаИзмерения");
	// Вычитание с поиском по единице
	Для Каждого ТекСтрока Из ОсновнаяТаблица Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураПоискаПоЕдинице,    ТекСтрока);
		СтруктураПоискаПоЕдинице.Вставить("ЕдиницаИзмерения", СтруктураПоискаПоЕдинице[ЕдиницаИзмерения]);
		
		КоличествоВТаблице = ТекСтрока[Количество];
		НайденныеСтроки = ТаблицаСВычетами.НайтиСтроки(СтруктураПоискаПоЕдинице);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если КоличествоВТаблице = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если КоличествоВТаблице < НайденнаяСтрока.Количество Тогда
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КоличествоВТаблице;
				КоличествоВТаблице         = 0;
			Иначе
				КоличествоВТаблице = КоличествоВТаблице - НайденнаяСтрока.Количество;
				ТаблицаСВычетами.Удалить(НайденнаяСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоВТаблице > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
			НайденныеСтрокиБезЕдиниц = ТаблицаСВычетами.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтрокиБезЕдиниц.Количество()>0 Тогда
				
				Если ЕстьКоэффициент Тогда
					Коэффициент = ТекСтрока.Коэффициент;
				Иначе
					Коэффициент = ТекСтрока[ЕдиницаИзмерения].Коэффициент;
				КонецЕсли;
				
				КоличествоВТаблицеБаза = КоличествоВТаблице * Коэффициент;
				
				// Поиск свободного количества у других единиц
				Для Каждого СтрокаТаблицы Из НайденныеСтрокиБезЕдиниц Цикл
					
					Если КоличествоВТаблице = 0 Тогда
						Прервать;
					КонецЕсли;
					
					Если СтрокаТаблицы.СвободноеКоличество = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если КоличествоВТаблицеБаза < СтрокаТаблицы.СвободноеКоличество Тогда
						СтрокаТаблицы.СвободноеКоличество = СтрокаТаблицы.СвободноеКоличество - КоличествоВТаблицеБаза;
						СтрокаТаблицы.Количество          = СтрокаТаблицы.Количество          - Окр(КоличествоВТаблицеБаза/СтрокаТаблицы.Коэффициент, 3, 1);
						КоличествоВТаблицеБаза = 0;
					Иначе
						КоличествоВТаблицеБаза = КоличествоВТаблицеБаза - СтрокаТаблицы.СвободноеКоличество;
						// количество под данную единицу в вычитаемых таблицах не задействована
						Если СтрокаТаблицы.СвободноеКоличество = СтрокаТаблицы.Количество*СтрокаТаблицы.Коэффициент Тогда
							ТаблицаСВычетами.Удалить(СтрокаТаблицы);
						Иначе
							СтрокаТаблицы.СвободноеКоличество = 0;
							СтрокаТаблицы.Количество          = СтрокаТаблицы.Количество     - Окр(СтрокаТаблицы.СвободноеКоличество/СтрокаТаблицы.Коэффициент, 3, 1);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				// Здесь можно добавить код полного вычитания без учета свободного остатка по вычитаемым единицам.
				
				КоличествоВТаблице = КоличествоВТаблицеБаза / Коэффициент;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КоличествоВТаблице = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если ТекСтрока[Количество] = 0 Тогда
			КоэффициентКоличества = 0;
		Иначе
			КоэффициентКоличества = КоличествоВТаблице/ТекСтрока[Количество];
		КонецЕсли;
		
		Если ЕстьСумма Тогда
			НоваяСтрока.Сумма       = ?(КоэффициентКоличества = 0, 0, ТекСтрока.Сумма*КоэффициентКоличества);
		КонецЕсли;
		
		Если ЕстьСуммаСкидки Тогда
			НоваяСтрока.СуммаСкидки = ?(КоэффициентКоличества = 0, 0, ТекСтрока.СуммаСкидки*КоэффициентКоличества);
		КонецЕсли;
		
		Если ЕстьСуммаНДС Тогда
			НоваяСтрока.СуммаНДС    = ?(КоэффициентКоличества = 0, 0, ТекСтрока.СуммаНДС*КоэффициентКоличества);
		КонецЕсли;
		
		Если ЕстьСуммаВсего Тогда
			НоваяСтрока.СуммаВсего  = ?(КоэффициентКоличества = 0, 0, ТекСтрока.СуммаВсего*КоэффициентКоличества);
		КонецЕсли;
		
		Если ЕстьКоличествоБазовое Тогда
			НоваяСтрока.КоличествоБазовое  = ?(КоэффициентКоличества = 0, 0, ТекСтрока.КоличествоБазовое*КоэффициентКоличества);
		КонецЕсли;
		
		Если ЕстьСуммаСкидкиСтроки Тогда
			НоваяСтрока.СуммаСкидкиСтроки  = ?(КоэффициентКоличества = 0, 0, ТекСтрока.СуммаСкидкиСтроки*КоэффициентКоличества);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // дкВычитаниеТаблиц()

// Процедура заполнения ГТД табличной части документов оплаты
//
Процедура дкЗаполнитьГТД(Объект, ТаблицаТоваров, ТаблицаСделок = Неопределено,ЭтаФорма=Неопределено) Экспорт
	
	ФормаСобственностиКонтрагента = Объект.Контрагент.ФормаСобственности;
	ЮрЛицоИП = ФормаСобственностиКонтрагента = Перечисления.ФормыСобственности.ЮридическоеЛицо
		ИЛИ ФормаСобственностиКонтрагента = Перечисления.ФормыСобственности.ЧастныйПредприниматель;
	
	// Определим наличие колонки
	Если ТипЗнч(ТаблицаТоваров) = Тип("ТаблицаЗначений") Тогда
		ЕстьИдентификаторТовара = ТаблицаТоваров.Колонки.Найти("ИдентификаторТовара") <> Неопределено;
	Иначе
		Попытка
			МассивИдентификатора = ТаблицаТоваров.ВыгрузитьКолонку("ИдентификаторТовара");
		Исключение
			МассивИдентификатора = Неопределено;
		КонецПопытки;
		ЕстьИдентификаторТовара = (МассивИдентификатора <> Неопределено);
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнятьТоварами", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнятьПоГТД", ЮрЛицоИП);
	ПараметрыЗаполнения.Вставить("ЗаполнятьПоПартиям", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнятьПоГТДПартий", Ложь);
	ПараметрыЗаполнения.Вставить("РезультатЗапросаПоТоварам", Неопределено);
	ПараметрыЗаполнения.Вставить("РезультатЗапросаПоГТД", Неопределено);
	ПараметрыЗаполнения.Вставить("РезультатЗапросаПоПартиям", Неопределено);
	
	Основание = Неопределено;
	Если ТаблицаСделок = Неопределено Тогда
		Основание = 
			?((ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату")
			И НЕ обЗначениеНеЗаполнено(Объект.ДокументОснование.ДокументОснование)
			И (ТипЗнч(Объект.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров")
			ИЛИ ТипЗнч(Объект.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд")))
			ИЛИ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СчетОтПоставщика")
			И ТипЗнч(Объект.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров")),
			Объект.ДокументОснование.ДокументОснование,
			Объект.ДокументОснование);
	Иначе
		Если (ТипЗнч(ТаблицаСделок) = Тип("ДокументСсылка.СчетНаОплату")
			И НЕ обЗначениеНеЗаполнено(ТаблицаСделок.ДокументОснование)
			И (ТипЗнч(ТаблицаСделок.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров")
			ИЛИ ТипЗнч(ТаблицаСделок.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд")))
			ИЛИ (ТипЗнч(ТаблицаСделок) = Тип("ДокументСсылка.СчетОтПоставщика")
			И ТипЗнч(ТаблицаСделок.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров")) Тогда
			Основание = ТаблицаСделок.ДокументОснование;
		ИначеЕсли ТипЗнч(ТаблицаСделок) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
			Возврат;
		Иначе
			Основание = ТаблицаСделок;
		КонецЕсли;
	КонецЕсли;
	
	// запрос по документу
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Номенклатура КАК Номенклатура,
	               |	Товары.Количество * Товары.Коэффициент КАК Количество,
	               |	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Товары.Коэффициент КАК Коэффициент,
	               |	Товары.Цена КАК Цена,
	               |	Товары.Сумма КАК Сумма,
	               |	Товары.ПроцентСкидки КАК ПроцентСкидки,
	               |	Товары.СуммаСкидки КАК СуммаСкидки,
	               |	Товары.СкидкаНаТовар КАК СкидкаНаТовар,
	               |	Товары.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
	               |	Товары.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
	               |	Товары.СтавкаНДС КАК СтавкаНДС,
	               |	Товары.СуммаНДС КАК СуммаНДС,
	               |	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	Товары.СуммаВсего КАК СуммаВсего,
	               |	Товары.СуммаСкидкиБонусами КАК СуммаСкидкиБонусами,
	               |	Товары.СуммаОплаты КАК СуммаОплаты,
	               |	Товары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	               |	" + ?(ЕстьИдентификаторТовара, " Товары.ИдентификаторТовара КАК ИдентификаторТовара,", "") + "
	               |	Товары.ГТД КАК ГТД
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	&Товары КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Товары.Номенклатура КАК Номенклатура,
	               |	Товары.Количество КАК Количество,
	               |	Товары.Количество КАК КоличествоОсталось,
	               |	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Товары.Коэффициент КАК Коэффициент,
	               |	Товары.Цена КАК Цена,
	               |	Товары.ПроцентСкидки КАК ПроцентСкидки,
	               |	Товары.СуммаСкидки КАК СуммаСкидки,
	               |	Товары.СуммаСкидки КАК СуммаСкидкиОсталось,
	               |	Товары.СкидкаНаТовар КАК СкидкаНаТовар,
	               |	Товары.ПроцентСкидкиСтроки КАК ПроцентСкидкиСтроки,
	               |	Товары.СуммаСкидкиСтроки КАК СуммаСкидкиСтрокиОсталось,
	               |	Товары.СуммаСкидкиСтроки КАК СуммаСкидкиСтроки,
	               |	Товары.СтавкаНДС КАК СтавкаНДС,
				   |	Товары.СуммаНДС КАК СуммаНДС,
				   |	Товары.СуммаНДС КАК СуммаНДСОсталось,
				   |	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				   |	Товары.СуммаСкидкиБонусами КАК СуммаСкидкиБонусами,
				   |	Товары.СуммаСкидкиБонусами КАК СуммаСкидкиБонусамиОсталось,
				   |	Товары.Сумма КАК Сумма,
				   |	Товары.Сумма КАК СуммаОсталось,
				   |	Товары.СуммаОплаты КАК СуммаОплаты,
				   |	Товары.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
				   |	Товары.ГТД.Страна.Код КАК КодСтраныПроисхожденияТовара,
				   |	Товары.ГТД.Наименование КАК НомерТаможеннойДекларации,
				   |	" + ?(ЕстьИдентификаторТовара, " Товары.ИдентификаторТовара КАК ИдентификаторТовара,", "") + "
				   |	Товары.ГТД КАК ГТД
				   |ИЗ
				   |	Товары КАК Товары";
	Запрос.УстановитьПараметр("Товары",ТаблицаТоваров);
	ПараметрыЗаполнения.РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
		
	// запрос по ГТД
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваров")
		И Основание.ХозОперация = Справочники.ХозОперации.РеализацияАгентскихУслуг Тогда
		
		// Заполним договор агента
		ДоговорАгента = Основание.ДоговорКомитента;
		Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
			ТекущаяСтрока.ДоговорВзаиморасчетов = ДоговорАгента;
		КонецЦикла;
		
		Возврат;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		ЗакрытЗН = (Основание.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт);
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.ГТД,
		|	СУММА(ТоварыВПроизводстве.Количество * ВЫБОР
		|			КОГДА ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И НЕ &ЗакрытЗН
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ТоварыВПроизводстве.Количество * ВЫБОР
		|			КОГДА ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И НЕ &ЗакрытЗН
		|				ТОГДА -1
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоОсталось,
		|	ТоварыВПроизводстве.ГТД.Страна.Код КАК КодСтраныПроисхожденияТовара,
		|	ТоварыВПроизводстве.ГТД.Наименование КАК НомерТаможеннойДекларации,
		|	ТоварыВПроизводстве.СтатусПартии,
		|	ТоварыВПроизводстве.Партия
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	"+?(ЗакрытЗН, "ТоварыВПроизводстве.Регистратор = &Основание", "ТоварыВПроизводстве.ЗаказНаряд = &Основание") + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.ГТД,
		|	ТоварыВПроизводстве.ГТД.Страна.Код,
		|	ТоварыВПроизводстве.ГТД.Наименование,
		|	ТоварыВПроизводстве.СтатусПартии,
		|	ТоварыВПроизводстве.Партия";
		
		Запрос.УстановитьПараметр("ЗакрытЗН", ЗакрытЗН);
		
		ПараметрыЗаполнения.ЗаполнятьПоГТДПартий = Истина;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	РеализованныеТовары.Номенклатура,
		|	РеализованныеТовары.ХарактеристикаНоменклатуры,
		|	РеализованныеТовары.ГТД,
		|	СУММА(ВЫБОР
		|			КОГДА РеализованныеТовары.Количество > 0
		|				ТОГДА РеализованныеТовары.Количество
		|			ИНАЧЕ -РеализованныеТовары.Количество
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА РеализованныеТовары.Количество > 0
		|				ТОГДА РеализованныеТовары.Количество
		|			ИНАЧЕ -РеализованныеТовары.Количество
		|		КОНЕЦ) КАК КоличествоОсталось,
		|	РеализованныеТовары.ГТД.Страна.Код,
		|	РеализованныеТовары.ГТД.Наименование,
		|	РеализованныеТовары.ДокументПередачи КАК Партия,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварПринятыйКомиссия) КАК СтатусПартии
		|ИЗ
		|	РегистрНакопления.РеализованныеТовары КАК РеализованныеТовары
		|ГДЕ
		|	РеализованныеТовары.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализованныеТовары.Номенклатура,
		|	РеализованныеТовары.ХарактеристикаНоменклатуры,
		|	РеализованныеТовары.ГТД,
		|	РеализованныеТовары.ДокументПередачи,
		|	РеализованныеТовары.ГТД.Страна.Код,
		|	РеализованныеТовары.ГТД.Наименование";
		
		ПараметрыЗаполнения.ЗаполнятьПоГТДПартий = Истина;
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура КАК Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД КАК ГТД,
		|	СУММА(ВЫБОР
		|			КОГДА ГТДПартийТоваровКомпании.Количество > 0
		|				ТОГДА ГТДПартийТоваровКомпании.Количество
		|			ИНАЧЕ -ГТДПартийТоваровКомпании.Количество
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ГТДПартийТоваровКомпании.Количество > 0
		|				ТОГДА ГТДПартийТоваровКомпании.Количество
		|			ИНАЧЕ -ГТДПартийТоваровКомпании.Количество
		|		КОНЕЦ) КАК КоличествоОсталось,
		|	ГТДПартийТоваровКомпании.ГТД.Страна.Код КАК КодСтраныПроисхожденияТовара,
		|	ГТДПартийТоваровКомпании.ГТД.Наименование КАК НомерТаможеннойДекларации,
		|	ГТДПартийТоваровКомпании.Партия
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор В(&Основание)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ГТД.Страна.Код,
		|	ГТДПартийТоваровКомпании.ГТД.Наименование,
		|	ГТДПартийТоваровКомпании.Партия";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Основание",Основание);
	
	ПараметрыЗаполнения.РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
	
	Если НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд")
		И НЕ ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ПартииТоваровКомпании.Номенклатура,
		|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ПартииТоваровКомпании.Партия,
		|	СУММА(ВЫБОР
		|			КОГДА ПартииТоваровКомпании.Количество > 0
		|				ТОГДА ПартииТоваровКомпании.Количество
		|			ИНАЧЕ -ПартииТоваровКомпании.Количество
		|		КОНЕЦ) КАК Количетство,
		|	СУММА(ВЫБОР
		|			КОГДА ПартииТоваровКомпании.Количество > 0
		|				ТОГДА ПартииТоваровКомпании.Количество
		|			ИНАЧЕ -ПартииТоваровКомпании.Количество
		|		КОНЕЦ) КАК КоличествоОсталось
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
		|ГДЕ
		|	ПартииТоваровКомпании.Регистратор = &Основание
		|	И ПартииТоваровКомпании.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварПринятыйКомиссия)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпании.Номенклатура,
		|	ПартииТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ПартииТоваровКомпании.Партия";
		
		ПараметрыЗаполнения.РезультатЗапросаПоПартиям = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.РезультатЗапросаПоГТД) 
		И НЕ ЗначениеЗаполнено(ПараметрыЗаполнения.РезультатЗапросаПоПартиям) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТаблицаТоваров) = Тип("ТаблицаЗначений") Тогда
		ТаблицаТоваровКопия =  ТаблицаТоваров.Скопировать();                                  
	Иначе
		ТаблицаТоваровКопия =  ТаблицаТоваров.Выгрузить();                                  
	КонецЕсли;
	
	ЕстьПризнакПредметаРасчета = НЕ ТаблицаТоваровКопия.Колонки.Найти("ПризнакПредметаРасчета") = Неопределено;
	Если ЕстьПризнакПредметаРасчета Тогда
		ТоварыПризнакиПредметаРасчета =  ТаблицаТоваровКопия.Скопировать(, "Номенклатура, ХарактеристикаНоменклатуры, ПризнакПредметаРасчета");                                  
	КонецЕсли;

	ТаблицаТоваров.Очистить();
	
	ТаблицаТоваровКопия.Очистить();
	
	Если ТаблицаСделок <> Неопределено Тогда
		Попытка
			ПараметрыЗаполнения.Вставить("ТипЦен", ТаблицаСделок.ТипЦен);
		Исключение
		КонецПопытки;
	КонецЕсли;
	дкПерезаполнитьСУчетомГТДПартий(Объект,ТаблицаТоваровКопия,ПараметрыЗаполнения,ЭтаФорма);
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.Выписка") Тогда
		СуммаДокумента = Объект.СуммаДокументаПриход + Объект.СуммаДокументаРасход;
		СуммаДокумента = ?(СуммаДокумента<0,-СуммаДокумента, СуммаДокумента);
	Иначе
		СуммаДокумента = ?(Объект.СуммаДокумента<0,-Объект.СуммаДокумента, Объект.СуммаДокумента);
	КонецЕсли;
	Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты(СуммаДокумента, ТаблицаТоваровКопия);
	
	// Перенесем в Товары
	Для Каждого ТекущаяСтрокаНоменклатуры Из ТаблицаТоваровКопия Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаНоменклатуры);
		Если ТоварыПризнакиПредметаРасчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Отбор = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
		ЗаполнитьЗначенияСвойств(ОТбор, НоваяСтрока);
		Результат = ТоварыПризнакиПредметаРасчета.НайтиСтроки(Отбор);
		Если Результат.Количество() > 0 Тогда
			НоваяСтрока.ПризнакПредметаРасчета = Результат[0].ПризнакПредметаРасчета;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // дкЗаполнитьГТД()

Процедура дкПерезаполнитьСУчетомГТДПартий(ДокументОбъект,ТаблицаТоваров,Параметры,ЭтаФорма=Неопределено) Экспорт
	
	Попытка
		Если Параметры.Свойство("ТипЦен") Тогда
			ТипЦен = Параметры.ТипЦен;
		Иначе
			ТипЦен = ДокументОбъект.ДокументОснование.ТипЦен;
		КонецЕсли;
	Исключение
		ТипЦен = Справочники.ТипыЦен.ПустаяСсылка();
	КонецПопытки;
	
	ДопПараметры = Новый Структура("ТипЦен", ТипЦен);
	
	СтратегияСписанияПартийТоваровПоСредней=(Константы.СтратегияСписанияПартийТоваровПоДатам.Получить()=Перечисления.СтратегияСписанияПартийТоваровПоДатам.Средняя);
	ПартияТоваровОтрицательныхОстатков=Константы.ПартияТоваровОтрицательныхОстатков.Получить();
	
	Если Параметры.ЗаполнятьТоварами И ЗначениеЗаполнено(Параметры.РезультатЗапросаПоТоварам) Тогда
		
		ЕстьСкидки = НЕ Параметры.РезультатЗапросаПоТоварам.Колонки.Найти("СуммаСкидки") = Неопределено;
		ЕстьСкидкиСтроки = НЕ Параметры.РезультатЗапросаПоТоварам.Колонки.Найти("СуммаСкидкиСтроки") = Неопределено;
		ЕстьСуммаСкидкиБонусами = НЕ Параметры.РезультатЗапросаПоТоварам.Колонки.Найти("СуммаСкидкиБонусами") = Неопределено;
		ЕстьГТДРасшифровка = НЕ ТаблицаТоваров.Колонки.Найти("КодСтраныПроисхожденияТовара") = Неопределено;
		ЕстьПартия = НЕ Параметры.РезультатЗапросаПоТоварам.Колонки.Найти("Партия") = Неопределено;
		ЕстьНомерСтроки = НЕ ТаблицаТоваров.Колонки.Найти("НомерСтроки") = Неопределено;
		ЕстьИдентификатор = НЕ ТаблицаТоваров.Колонки.Найти("ИдентификаторТовара") = Неопределено;
		
		НеПересчитыватьСуммуДокумента = Неопределено;
		Попытка
			Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("НеПересчитыватьСуммуДокумента",НеПересчитыватьСуммуДокумента) Тогда
				ДокументОбъект.ДополнительныеСвойства.Вставить("НеПересчитыватьСуммуДокумента",Истина);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если Параметры.ЗаполнятьПоГТДПартий Тогда
			
			Для Каждого стрМассива Из Параметры.РезультатЗапросаПоТоварам Цикл
				
				Если стрМассива.КоличествоОсталось = 0 Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
				ЗаполнитьЗначенияСвойств(Отбор, стрМассива);
				МассивПоиска = Параметры.РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
				
				Для Каждого ТекСтрока Из МассивПоиска Цикл
					
					Если СтратегияСписанияПартийТоваровПоСредней И НЕ Параметры.ЗаполнятьПоГТД Тогда
						Прервать;
					ИначеЕсли (НЕ ТекСтрока.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия
						ИЛИ ТекСтрока.Партия = ПартияТоваровОтрицательныхОстатков)
						И ((Параметры.ЗаполнятьПоГТД И обЗначениеНеЗаполнено(ТекСтрока.ГТД))
						ИЛИ НЕ Параметры.ЗаполнятьПоГТД) Тогда
						Продолжить;
					КонецЕсли;
					
					Если стрМассива.КоличествоОсталось = 0 Тогда
						
						Прервать;
						
					КонецЕсли;
					
					Если ТекСтрока.КоличествоОсталось = 0 Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					
					СписываемКоличество = Мин(стрМассива.КоличествоОсталось, ТекСтрока.КоличествоОсталось);
					СписываемСумма = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаОсталось,
						Окр((стрМассива.Сумма / стрМассива.Количество) * СписываемКоличество, 2));
					СписываемСуммаНДС = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаНДСОсталось,
						Окр((стрМассива.СуммаНДС / стрМассива.Количество) * СписываемКоличество, 2));
					
					НоваяСтрока = ТаблицаТоваров.Добавить();
					НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
					ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
					Попытка
						Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
							НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
						КонецЕсли;
					Исключение
					КонецПопытки;
					НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество = СписываемКоличество / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
					
					Если Параметры.ЗаполнятьПоГТД Тогда
						НоваяСтрока.ГТД = ТекСтрока.ГТД;
						Если ЕстьГТДРасшифровка Тогда
							НоваяСтрока.КодСтраныПроисхожденияТовара = ТекСтрока.КодСтраныПроисхожденияТовара;
							НоваяСтрока.НомерТаможеннойДекларации = ТекСтрока.НомерТаможеннойДекларации;
						КонецЕсли;
					КонецЕсли;
					Если НЕ СтратегияСписанияПартийТоваровПоСредней И ТекСтрока.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия
						И НЕ ТекСтрока.Партия = ПартияТоваровОтрицательныхОстатков Тогда
						Попытка
							НоваяСтрока.ДоговорВзаиморасчетов = ТекСтрока.Партия.ДоговорВзаиморасчетов;
						Исключение
						КонецПопытки;
					КонецЕсли;
					НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
					НоваяСтрока.СуммаВсего = СписываемСумма;
					НоваяСтрока.СуммаНДС = СписываемСуммаНДС;
					дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
					
					Если ЕстьСкидки Тогда 
						СписываемСуммаСкидки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаСкидкиОсталось, Окр((стрМассива.СуммаСкидки / стрМассива.Количество) * СписываемКоличество, 2));
						НоваяСтрока.СуммаСкидки = СписываемСуммаСкидки;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
						стрМассива.СуммаСкидкиОсталось = стрМассива.СуммаСкидкиОсталось - СписываемСуммаСкидки;
					КонецЕсли;
					Если ЕстьСкидкиСтроки Тогда 
						СписываемСуммаСкидкиСтроки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаСкидкиСтрокиОсталось,Окр((стрМассива.СуммаСкидкиСтроки / стрМассива.Количество) * СписываемКоличество, 2));
						НоваяСтрока.СуммаСкидкиСтроки = СписываемСуммаСкидкиСтроки;
						НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
						стрМассива.СуммаСкидкиСтрокиОсталось = стрМассива.СуммаСкидкиСтрокиОсталось - СписываемСуммаСкидкиСтроки;
					КонецЕсли;
					Если ЕстьСуммаСкидкиБонусами Тогда 
						СписываемСуммаСкидкиБонусами   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаСкидкиБонусамиОсталось, Окр((стрМассива.СуммаСкидкиБонусами / стрМассива.Количество) * СписываемКоличество, 2));
						НоваяСтрока.СуммаСкидкиБонусами = СписываемСуммаСкидкиБонусами;
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-СписываемСуммаСкидкиБонусами;
						НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
						стрМассива.СуммаСкидкиБонусамиОсталось = стрМассива.СуммаСкидкиБонусамиОсталось - СписываемСуммаСкидкиБонусами;
					КонецЕсли;
					
					// уменьшим нераспределенное количество
					стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
					ТекСтрока.КоличествоОсталось = ТекСтрока.КоличествоОсталось - СписываемКоличество;
					стрМассива.СуммаОсталось = стрМассива.СуммаОсталось - СписываемСумма;
					стрМассива.СуммаНДСОсталось = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
					
				КонецЦикла;
				
				// если осталось еще допишем без гтд
				Если стрМассива.КоличествоОсталось > 0 Тогда
					
					НоваяСтрока = ТаблицаТоваров.Добавить();
					НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
					ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
					Попытка
						Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
							НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
						КонецЕсли;
					Исключение
					КонецПопытки;
					НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество = стрМассива.КоличествоОсталось / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
					НоваяСтрока.ГТД = Справочники.ГТД.ПустаяСсылка();
					НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
					НоваяСтрока.СуммаВсего = стрМассива.СуммаОсталось;
					НоваяСтрока.СуммаНДС = стрМассива.СуммаНДСОсталось;
					
					дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
					Если ЕстьСкидки Тогда 
						НоваяСтрока.СуммаСкидки = стрМассива.СуммаСкидкиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСкидкиСтроки Тогда 
						НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
						НоваяСтрока.СуммаСкидкиСтроки = стрМассива.СуммаСкидкиСтрокиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСуммаСкидкиБонусами Тогда 
						НоваяСтрока.СуммаСкидкиБонусами = стрМассива.СуммаСкидкиБонусамиОсталось;
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-НоваяСтрока.СуммаСкидкиБонусами;
						НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
					КонецЕсли;	
					
				ИначеЕсли стрМассива.СуммаОсталось <> 0 ИЛИ стрМассива.СуммаНДСОсталось <> 0 Тогда
					
					НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего + стрМассива.СуммаОсталось;
					СтараяСуммаНДС = НоваяСтрока.СуммаНДС;
					НоваяСтрока.СуммаНДС = СтараяСуммаНДС + стрМассива.СуммаНДСОсталось;
					
					дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
					Если ЕстьСкидки Тогда 
						НоваяСтрока.СуммаСкидки = НоваяСтрока.СуммаСкидки + стрМассива.СуммаСкидкиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСкидкиСтроки Тогда 
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + стрМассива.СуммаСкидкиСтрокиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСуммаСкидкиБонусами Тогда 
						НоваяСтрока.СуммаСкидкиБонусами = стрМассива.СуммаСкидкиБонусамиОсталось;
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-НоваяСтрока.СуммаСкидкиБонусами;
						НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Параметры.ЗаполнятьПоГТД ИЛИ Параметры.РезультатЗапросаПоПартиям.Количество() > 0 Тогда
			
			// простой обход
			Если ЕстьГТДРасшифровка Тогда
				Параметры.РезультатЗапросаПоГТД.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ГТД,Партия,КодСтраныПроисхожденияТовара,НомерТаможеннойДекларации", "Количество,КоличествоОсталось");
			Иначе
				Параметры.РезультатЗапросаПоГТД.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ГТД,Партия", "Количество,КоличествоОсталось");
			КонецЕсли;
			
			Для Каждого стрМассива Из Параметры.РезультатЗапросаПоТоварам Цикл
				
				Если стрМассива.КоличествоОсталось = 0 Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
				ЗаполнитьЗначенияСвойств(Отбор, стрМассива);
				МассивПоиска = Параметры.РезультатЗапросаПоПартиям.НайтиСтроки(Отбор);
				
				Для Каждого ТекСтрока Из МассивПоиска Цикл
					
					Если СтратегияСписанияПартийТоваровПоСредней Тогда
						Прервать;
					ИначеЕсли ТекСтрока.Партия = ПартияТоваровОтрицательныхОстатков Тогда
						Продолжить;
					КонецЕсли;
					
					Если стрМассива.КоличествоОсталось = 0 Тогда
						
						Прервать;
						
					КонецЕсли;
					
					Если ТекСтрока.КоличествоОсталось = 0 Тогда
						
						Продолжить;
						
					КонецЕсли;
					
					Если Параметры.ЗаполнятьПоГТД Тогда
						Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,Партия");
						ЗаполнитьЗначенияСвойств(Отбор, ТекСтрока);
						МассивПоискаГТД = Параметры.РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
						
						Для Каждого ТекСтрокаГТД Из МассивПоискаГТД Цикл
							
							Если стрМассива.КоличествоОсталось = 0 Тогда
								Прервать;
							КонецЕсли;
							
							Если ТекСтрока.КоличествоОсталось = 0 Тогда
								Прервать;
							КонецЕсли;
							
							Если ТекСтрокаГТД.КоличествоОсталось = 0 Тогда
								Продолжить;
							КонецЕсли;
							СписываемКоличество = Мин(стрМассива.КоличествоОсталось, ТекСтрока.КоличествоОсталось,ТекСтрокаГТД.КоличествоОсталось);
							СписываемСумма = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
								стрМассива.СуммаОсталось,
								Окр((стрМассива.Сумма / стрМассива.Количество) * СписываемКоличество, 2));
							СписываемСуммаНДС = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
								стрМассива.СуммаНДСОсталось,
								Окр((стрМассива.СуммаНДС / стрМассива.Количество) * СписываемКоличество, 2));
							
							НоваяСтрока = ТаблицаТоваров.Добавить();
							НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
							ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
							Попытка
								Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
									НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
								КонецЕсли;
							Исключение
							КонецПопытки;
							НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
							НоваяСтрока.Количество = СписываемКоличество / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
							
							Если Параметры.ЗаполнятьПоГТД Тогда
								НоваяСтрока.ГТД = ТекСтрокаГТД.ГТД;
								Если ЕстьГТДРасшифровка Тогда
									НоваяСтрока.КодСтраныПроисхожденияТовара = ТекСтрокаГТД.КодСтраныПроисхожденияТовара;
									НоваяСтрока.НомерТаможеннойДекларации = ТекСтрокаГТД.НомерТаможеннойДекларации;
								КонецЕсли;
							КонецЕсли;
							Попытка
								НоваяСтрока.ДоговорВзаиморасчетов = ТекСтрока.Партия.ДоговорВзаиморасчетов;
							Исключение
							КонецПопытки;
							НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
							НоваяСтрока.СуммаВсего = СписываемСумма;
							НоваяСтрока.СуммаНДС = СписываемСуммаНДС;
							дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
							
							Если ЕстьСкидки Тогда 
								СписываемСуммаСкидки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
								стрМассива.СуммаСкидкиОсталось, Окр((стрМассива.СуммаСкидки / стрМассива.Количество) * СписываемКоличество, 2));
								НоваяСтрока.СуммаСкидки = СписываемСуммаСкидки;
								ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
								стрМассива.СуммаСкидкиОсталось = стрМассива.СуммаСкидкиОсталось - СписываемСуммаСкидки;
							КонецЕсли;
							Если ЕстьСкидкиСтроки Тогда 
								СписываемСуммаСкидкиСтроки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
								стрМассива.СуммаСкидкиСтрокиОсталось,Окр((стрМассива.СуммаСкидкиСтроки / стрМассива.Количество) * СписываемКоличество, 2));
								НоваяСтрока.СуммаСкидкиСтроки = СписываемСуммаСкидкиСтроки;
								НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
								ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
								стрМассива.СуммаСкидкиСтрокиОсталось = стрМассива.СуммаСкидкиСтрокиОсталось - СписываемСуммаСкидкиСтроки;
							КонецЕсли;
							Если ЕстьСуммаСкидкиБонусами Тогда 
								СписываемСуммаСкидкиБонусами   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
								стрМассива.СуммаСкидкиБонусамиОсталось, Окр((стрМассива.СуммаСкидкиБонусами / стрМассива.Количество) * СписываемКоличество, 2));
								НоваяСтрока.СуммаСкидкиБонусами = СписываемСуммаСкидкиБонусами;
								НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-СписываемСуммаСкидкиБонусами;
								НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
								стрМассива.СуммаСкидкиБонусамиОсталось = стрМассива.СуммаСкидкиБонусамиОсталось - СписываемСуммаСкидкиБонусами;
							КонецЕсли;
							
							// уменьшим нераспределенное количество
							стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
							ТекСтрока.КоличествоОсталось = ТекСтрока.КоличествоОсталось - СписываемКоличество;
							ТекСтрокаГТД.КоличествоОсталось = ТекСтрокаГТД.КоличествоОсталось - СписываемКоличество;
							стрМассива.СуммаОсталось = стрМассива.СуммаОсталось - СписываемСумма;
							стрМассива.СуммаНДСОсталось = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
						КонецЦикла;
					КонецЕсли;
					
					
					Если стрМассива.КоличествоОсталось > 0 И ТекСтрока.КоличествоОсталось > 0 Тогда
						СписываемКоличество = Мин(стрМассива.КоличествоОсталось, ТекСтрока.КоличествоОсталось);
						СписываемСумма = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаОсталось,
						Окр((стрМассива.Сумма / стрМассива.Количество) * СписываемКоличество, 2));
						СписываемСуммаНДС = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаНДСОсталось,
						Окр((стрМассива.СуммаНДС / стрМассива.Количество) * СписываемКоличество, 2));
						
						НоваяСтрока = ТаблицаТоваров.Добавить();
						НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
						ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
						Попытка
							Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
								НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
							КонецЕсли;
						Исключение
						КонецПопытки;
						НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяСтрока.Количество = СписываемКоличество / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
						НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
						НоваяСтрока.СуммаВсего = СписываемСумма;
						НоваяСтрока.СуммаНДС = СписываемСуммаНДС;
						дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
						Попытка
							НоваяСтрока.ДоговорВзаиморасчетов = ТекСтрока.Партия.ДоговорВзаиморасчетов;
						Исключение
						КонецПопытки;
						
						Если ЕстьСкидки Тогда 
							СписываемСуммаСкидки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиОсталось, Окр((стрМассива.СуммаСкидки / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидки = СписываемСуммаСкидки;
							ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
							стрМассива.СуммаСкидкиОсталось = стрМассива.СуммаСкидкиОсталось - СписываемСуммаСкидки;
						КонецЕсли;
						Если ЕстьСкидкиСтроки Тогда 
							СписываемСуммаСкидкиСтроки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиСтрокиОсталось,Окр((стрМассива.СуммаСкидкиСтроки / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидкиСтроки = СписываемСуммаСкидкиСтроки;
							НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
							ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
							стрМассива.СуммаСкидкиСтрокиОсталось = стрМассива.СуммаСкидкиСтрокиОсталось - СписываемСуммаСкидкиСтроки;
						КонецЕсли;
						Если ЕстьСуммаСкидкиБонусами Тогда 
							СписываемСуммаСкидкиБонусами   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиБонусамиОсталось, Окр((стрМассива.СуммаСкидкиБонусами / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидкиБонусами = СписываемСуммаСкидкиБонусами;
							НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-СписываемСуммаСкидкиБонусами;
							НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
							стрМассива.СуммаСкидкиБонусамиОсталось = стрМассива.СуммаСкидкиБонусамиОсталось - СписываемСуммаСкидкиБонусами;
						КонецЕсли;
						
						// уменьшим нераспределенное количество
						стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
						ТекСтрока.КоличествоОсталось = ТекСтрока.КоличествоОсталось - СписываемКоличество;
						стрМассива.СуммаОсталось = стрМассива.СуммаОсталось - СписываемСумма;
						стрМассива.СуммаНДСОсталось = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
					КонецЕсли;
					
				КонецЦикла;
				
				Если стрМассива.КоличествоОсталось > 0 И Параметры.ЗаполнятьПоГТД Тогда
					
					Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
					ЗаполнитьЗначенияСвойств(Отбор, стрМассива);
					МассивПоиска = Параметры.РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
					
					Для Каждого ТекСтрока Из МассивПоиска Цикл
						
						Если стрМассива.КоличествоОсталось = 0 Тогда
							
							Прервать;
							
						КонецЕсли;
						
						Если ТекСтрока.КоличествоОсталось = 0 Тогда
							
							Продолжить;
							
						КонецЕсли;
						
						СписываемКоличество = Мин(стрМассива.КоличествоОсталось, ТекСтрока.КоличествоОсталось);
						СписываемСумма = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаОсталось,
						Окр((стрМассива.Сумма / стрМассива.Количество) * СписываемКоличество, 2));
						СписываемСуммаНДС = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
						стрМассива.СуммаНДСОсталось,
						Окр((стрМассива.СуммаНДС / стрМассива.Количество) * СписываемКоличество, 2));
						
						НоваяСтрока = ТаблицаТоваров.Добавить();
						НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
						ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
						Попытка
							Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
								НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
							КонецЕсли;
						Исключение
						КонецПопытки;
						НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяСтрока.Количество = СписываемКоличество / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
						НоваяСтрока.ГТД = ТекСтрока.ГТД;
						Если ЕстьГТДРасшифровка Тогда
							НоваяСтрока.КодСтраныПроисхожденияТовара = ТекСтрока.КодСтраныПроисхожденияТовара;
							НоваяСтрока.НомерТаможеннойДекларации = ТекСтрока.НомерТаможеннойДекларации;
						КонецЕсли;	
						НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
						НоваяСтрока.СуммаВсего = СписываемСумма;
						НоваяСтрока.СуммаНДС = СписываемСуммаНДС;
						дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
						
						Если ЕстьСкидки Тогда 
							СписываемСуммаСкидки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиОсталось, Окр((стрМассива.СуммаСкидки / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидки = СписываемСуммаСкидки;
							ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
							стрМассива.СуммаСкидкиОсталось = стрМассива.СуммаСкидкиОсталось - СписываемСуммаСкидки;
						КонецЕсли;
						Если ЕстьСкидкиСтроки Тогда 
							СписываемСуммаСкидкиСтроки   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиСтрокиОсталось,Окр((стрМассива.СуммаСкидкиСтроки / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидкиСтроки = СписываемСуммаСкидкиСтроки;
							НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
							ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
							стрМассива.СуммаСкидкиСтрокиОсталось = стрМассива.СуммаСкидкиСтрокиОсталось - СписываемСуммаСкидкиСтроки;
						КонецЕсли;
						Если ЕстьСуммаСкидкиБонусами Тогда 
							СписываемСуммаСкидкиБонусами   = ?(стрМассива.КоличествоОсталось = СписываемКоличество,
							стрМассива.СуммаСкидкиБонусамиОсталось, Окр((стрМассива.СуммаСкидкиБонусами / стрМассива.Количество) * СписываемКоличество, 2));
							НоваяСтрока.СуммаСкидкиБонусами = СписываемСуммаСкидкиБонусами;
							НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-СписываемСуммаСкидкиБонусами;
							НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
							стрМассива.СуммаСкидкиБонусамиОсталось = стрМассива.СуммаСкидкиБонусамиОсталось - СписываемСуммаСкидкиБонусами;
						КонецЕсли;
						
						// уменьшим нераспределенное количество
						стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
						ТекСтрока.КоличествоОсталось = ТекСтрока.КоличествоОсталось - СписываемКоличество;
						стрМассива.СуммаОсталось = стрМассива.СуммаОсталось - СписываемСумма;
						стрМассива.СуммаНДСОсталось = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
						
					КонецЦикла;
					
				КонецЕсли;
				
				
				// если осталось еще допишем без гтд
				Если стрМассива.КоличествоОсталось > 0 Тогда
					
					НоваяСтрока = ТаблицаТоваров.Добавить();
					НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
					ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
					Попытка
						Если ЕстьИдентификатор И ЗначениеЗаполнено(стрМассива.ИдентификаторТовара) Тогда
							НоваяСтрока.ИдентификаторТовара = стрМассива.ИдентификаторТовара;
						КонецЕсли;
					Исключение
					КонецПопытки;
					НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество = стрМассива.КоличествоОсталось / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
					НоваяСтрока.ГТД = Справочники.ГТД.ПустаяСсылка();
					НоваяСтрока.СтавкаНДС = стрМассива.СтавкаНДС;
					НоваяСтрока.СуммаВсего = стрМассива.СуммаОсталось;
					НоваяСтрока.СуммаНДС = стрМассива.СуммаНДСОсталось;
					
					дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
					Если ЕстьСкидки Тогда 
						НоваяСтрока.СуммаСкидки = стрМассива.СуммаСкидкиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСкидкиСтроки Тогда 
						НоваяСтрока.СкидкаНаТовар = стрМассива.СкидкаНаТовар;
						НоваяСтрока.СуммаСкидкиСтроки = стрМассива.СуммаСкидкиСтрокиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСуммаСкидкиБонусами Тогда 
						НоваяСтрока.СуммаСкидкиБонусами = стрМассива.СуммаСкидкиБонусамиОсталось;
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-НоваяСтрока.СуммаСкидкиБонусами;
						НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
					КонецЕсли;	
					
				ИначеЕсли стрМассива.СуммаОсталось <> 0 ИЛИ стрМассива.СуммаНДСОсталось <> 0 Тогда
					
					НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего + стрМассива.СуммаОсталось;
					СтараяСуммаНДС = НоваяСтрока.СуммаНДС;
					НоваяСтрока.СуммаНДС = СтараяСуммаНДС + стрМассива.СуммаНДСОсталось;
					
					дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
					Если ЕстьСкидки Тогда 
						НоваяСтрока.СуммаСкидки = НоваяСтрока.СуммаСкидки + стрМассива.СуммаСкидкиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСкидкиСтроки Тогда 
						НоваяСтрока.СуммаСкидкиСтроки = НоваяСтрока.СуммаСкидкиСтроки + стрМассива.СуммаСкидкиСтрокиОсталось;
						ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
					Если ЕстьСуммаСкидкиБонусами Тогда 
						НоваяСтрока.СуммаСкидкиБонусами = стрМассива.СуммаСкидкиБонусамиОсталось;
						НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-НоваяСтрока.СуммаСкидкиБонусами;
						НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			Для Каждого ТекущаяСтрока Из Параметры.РезультатЗапросаПоТоварам Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
				ДокументОбъект.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
				Попытка
					Если ЕстьИдентификатор И ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторТовара) Тогда
						НоваяСтрока.ИдентификаторТовара = ТекущаяСтрока.ИдентификаторТовара;
					КонецЕсли;
				Исключение
				КонецПопытки;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				НоваяСтрока.Количество = ТекущаяСтрока.КоличествоОсталось / ?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
				НоваяСтрока.ГТД = ТекущаяСтрока.ГТД;
				Если ЕстьГТДРасшифровка Тогда
					НоваяСтрока.КодСтраныПроисхожденияТовара = ТекущаяСтрока.КодСтраныПроисхожденияТовара;
					НоваяСтрока.НомерТаможеннойДекларации = ТекущаяСтрока.НомерТаможеннойДекларации;
				КонецЕсли;	
				НоваяСтрока.СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
				НоваяСтрока.СуммаВсего = ТекущаяСтрока.Сумма;
				НоваяСтрока.СуммаНДС = ТекущаяСтрока.СуммаНДС;
				дкПересчитатьСумму(ДокументОбъект,НоваяСтрока,ТипЦен);
				
				Если ЕстьСкидки Тогда 
					СписываемСуммаСкидки   = ТекущаяСтрока.СуммаСкидкиОсталось;
					НоваяСтрока.СуммаСкидки = СписываемСуммаСкидки;
					ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", НоваяСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
				Если ЕстьСкидкиСтроки Тогда 
					СписываемСуммаСкидкиСтроки   = ТекущаяСтрока.СуммаСкидкиСтрокиОсталось;
					НоваяСтрока.СуммаСкидкиСтроки = СписываемСуммаСкидкиСтроки;
					НоваяСтрока.СкидкаНаТовар = ТекущаяСтрока.СкидкаНаТовар;
					ДокументОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", НоваяСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
				Если ЕстьСуммаСкидкиБонусами Тогда 
					СписываемСуммаСкидкиБонусами   = ТекущаяСтрока.СуммаСкидкиБонусамиОсталось;
					НоваяСтрока.СуммаСкидкиБонусами = СписываемСуммаСкидкиБонусами;
					НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего-СписываемСуммаСкидкиБонусами;
					НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаВсего*НоваяСтрока.СтавкаНДС.Ставка/(100+НоваяСтрока.СтавкаНДС.Ставка);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Избавимся от дублей
		Если НЕ ЕстьПартия Тогда
			КолонкиГрупировки = "Номенклатура,ЕдиницаИзмерения,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры,ДоговорВзаиморасчетов,ГТД,Цена";
			КолонкиСуммирования = "Количество,Сумма,СуммаНДС,СуммаВсего,СуммаОплаты,СебестоимостьАвтомобиля";
			Если ЕстьСкидки Тогда
				КолонкиГрупировки = КолонкиГрупировки + ",ПроцентСкидки";
				КолонкиСуммирования = КолонкиСуммирования + ",СуммаСкидки";
			КонецЕсли;
			Если ЕстьСкидкиСтроки Тогда
				КолонкиГрупировки = КолонкиГрупировки + ",ПроцентСкидкиСтроки,СкидкаНаТовар";
				КолонкиСуммирования = КолонкиСуммирования + ",СуммаСкидкиСтроки";
			КонецЕсли;
			Если ЕстьСуммаСкидкиБонусами Тогда
				КолонкиСуммирования = КолонкиСуммирования + ",СуммаСкидкиБонусами";
			КонецЕсли;
			Если ЕстьГТДРасшифровка Тогда
				КолонкиГрупировки = КолонкиГрупировки + ",КодСтраныПроисхожденияТовара,НомерТаможеннойДекларации";
			КонецЕсли;
			Если ЕстьИдентификатор Тогда
				КолонкиГрупировки = КолонкиГрупировки + ",ИдентификаторТовара";
			КонецЕсли;
			ТаблицаТоваров.Свернуть(КолонкиГрупировки,КолонкиСуммирования);
			Если ЕстьНомерСтроки Тогда
				ТаблицаТоваров.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
				НомерСтроки = 1;
				Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
					ТекущаяСтрока.НомерСтроки = НомерСтроки;
					НомерСтроки = НомерСтроки + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		Если НеПересчитыватьСуммуДокумента = Неопределено Тогда
			ДокументОбъект.ДополнительныеСвойства.Удалить("НеПересчитыватьСуммуДокумента");
		Иначе
			ДокументОбъект.ДополнительныеСвойства.Вставить("НеПересчитыватьСуммуДокумента",НеПересчитыватьСуммуДокумента);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры // дкПерезаполнитьСУчетомГТДПартий()

Процедура дкПересчитатьСумму(ДокументОбъект, Строка, ТипЦен) Экспорт
	
	ЦенаВключаетНДС = ТипЦен.Пустая() ИЛИ ТипЦен.ЦенаВключаетНДС;
	
	СуммаРасчетная = Строка.СуммаВсего;
	Строка.Сумма = Окр(СуммаРасчетная, 2);
	
	Если Строка.Количество = 0 Тогда
		Строка.Цена = Строка.СуммаВсего;
		Строка.СуммаВсего = 0;
		Строка.Сумма = 0;
		Строка.СуммаНДС = 0;
	Иначе
		Строка.Цена = Окр(Строка.Сумма/Строка.Количество, 2);
	КонецЕсли;
	
	Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
		
		СтавкаНДС       = ?(ЗначениеЗаполнено(Строка.СтавкаНДС.Ставка), Строка.СтавкаНДС.Ставка, 0);
		
		Если СтавкаНДС = 0 Тогда
			Себестоимость = 0;
		Иначе
			ДокументОбъектСтруктура = Новый Структура();
			ДокументОбъектСтруктура.Вставить("Дата",ДокументОбъект.Дата);
			ДокументОбъектСтруктура.Вставить("ХозОперация",ДокументОбъект.ХозОперация);
			ДокументОбъектСтруктура.Вставить("ВалютаДокумента",ДокументОбъект.ВалютаДокумента);
			ДокументОбъектСтруктура.Вставить("КурсДокумента",ДокументОбъект.КурсДокумента);
			ДокументОбъектСтруктура.Вставить("КешСебестоимостиАвтомобилейКупленныхУФизЛица",Неопределено);
			ДокументОбъектСтрока = Новый Структура();
			Для каждого РеквизитТабличнойЧасти Из ДокументОбъект.Метаданные().ТабличныеЧасти.Автомобили.Реквизиты Цикл
				ДокументОбъектСтрока.Вставить(РеквизитТабличнойЧасти.Имя,Строка[РеквизитТабличнойЧасти.Имя]);
			КонецЦикла; 
			Себестоимость=зфЗащищенныеФункцииСервер.РеализацияАвтомобилейПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(ДокументОбъектСтруктура,ДокументОбъектСтрока);
		КонецЕсли;
		СуммаНДС        = Окр((Макс(Строка.СуммаВсего - Себестоимость, 0) * СтавкаНДС)/(100 + СтавкаНДС),2);
		ЦенаВключаетНДС = ?(ЗначениеЗаполнено(ТипЦен), ТипЦен.ЦенаВключаетНДС, Истина);
		СуммаРасчетная  = ?(ЦенаВключаетНДС, Строка.СуммаВсего, Строка.СуммаВсего - СуммаНДС);
		Строка.Сумма    = СуммаРасчетная;
		СуммаРасчетная  = Макс(СуммаРасчетная - Себестоимость, 0);
		
		Если ЦенаВключаетНДС Тогда
			Строка.СуммаНДС = Окр((СуммаРасчетная * СтавкаНДС)/(100 + СтавкаНДС),2);
		Иначе
			Строка.СуммаНДС = Окр(СуммаРасчетная * СтавкаНДС / 100,2);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // дкПересчитатьСумму()

#Если Клиент Тогда
Процедура дкПодготовитьТаблицуТоваров(ДокументОплаты, ЭтаФорма=Неопределено) Экспорт
	дкПодготовитьТаблицуТоваровСервер(ДокументОплаты, ЭтаФорма);
КонецПроцедуры // дкПодготовитьТаблицуТоваров()
#КонецЕсли

// перенес с клиента текст процедуры "дкПодготовитьТаблицуТоваров"
Процедура дкПодготовитьТаблицуТоваровСервер(ДокументОплаты, ЭтаФорма=Неопределено) Экспорт
	
	Если ТипЗнч(ДокументОплаты.Ссылка) = Тип("ДокументСсылка.Выписка") Тогда
		
		// Получим сумму оплаты и сделки
		ТаблицаСделок = ДокументОплаты.Состав.Выгрузить(, "Сделка,СуммаПриход,СуммаРасход");
		ТаблицаСделок.Свернуть("Сделка", "СуммаПриход,СуммаРасход");
		ТаблицаСделок.Сортировать("Сделка");
		
		// Подготовим данные для получение номенклатуры по сделке
		СтрукутраСделки = Новый Структура("ДокументОснование,ВалютаДокумента,КурсДокумента");
		ЗаполнитьЗначенияСвойств(СтрукутраСделки, ДокументОплаты,, "ДокументОснование");
		
		КопияТовары = ДокументОплаты.Товары.Выгрузить();
		
		// Добавим строку для формирование без сделки
		НоваяСтрока = ДокументОплаты.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.Предоплата;
		ДокументОплаты.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока, ЭтаФорма);
		НоваяСтрока.СтавкаНДС = ДокументОплаты.СтавкаНДС;
		КурсДокументаОплаты = ДокументОплаты.КурсДокумента;
		
		ДокументОплаты.КодыМаркировки.Очистить();
		
		СтруктураОбъекта = Новый Структура("КодыМаркировки, Товары");
		СтруктураОбъекта.КодыМаркировки = ДокументОплаты.КодыМаркировки.Выгрузить();
		
		// Распределим сумму оплаты/возрата по товарам сделки
		Для Каждого ТекущаяСтрока Из ТаблицаСделок Цикл
			СтрукутраСделки.ДокументОснование = ТекущаяСтрока.Сделка;
			ТабличнаяЧастьДокументаОснования=Документы.ПриходныйКассовыйОрдер.ПолучитьТабличнуюЧастьДокументаОснования(СтрукутраСделки);
			
			// Укажем сумму сделки как предоплата
			Если ТабличнаяЧастьДокументаОснования=Неопределено ИЛИ ТабличнаяЧастьДокументаОснования.Количество()=0 Тогда
				ДокументОплаты.Товары[0].Цена = ДокументОплаты.Товары[0].Цена + (ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход) * ДокументОплаты.КурсДокумента;
			Иначе
				
				Для Каждого ТекущаяСтрокаТоваров Из ТабличнаяЧастьДокументаОснования Цикл
					НоваяСтрока = КопияТовары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрокаТоваров);
					НоваяСтрока.Цена = ТекущаяСтрокаТоваров.Цена * КурсДокументаОплаты;
					НоваяСтрока.Сумма = ТекущаяСтрокаТоваров.Сумма * КурсДокументаОплаты;
					НоваяСтрока.СуммаНДС = ТекущаяСтрокаТоваров.СуммаНДС * КурсДокументаОплаты;
					НоваяСтрока.СуммаСкидки = ТекущаяСтрокаТоваров.СуммаСкидки * КурсДокументаОплаты;
					НоваяСтрока.СуммаВсего = ТекущаяСтрокаТоваров.СуммаВсего * КурсДокументаОплаты;
					НоваяСтрока.СуммаСкидкиСтроки = ТекущаяСтрокаТоваров.СуммаСкидкиСтроки * КурсДокументаОплаты;
					НоваяСтрока.СуммаСкидкиБонусами = ТекущаяСтрокаТоваров.СуммаСкидкиБонусами * КурсДокументаОплаты;
				КонецЦикла;
				
				дкЗаполнитьГТД(ДокументОплаты,КопияТовары,ТекущаяСтрока.Сделка,ЭтаФорма);
				
				// Распределим текущую сумму оплат на сделку
				Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты((ТекущаяСтрока.СуммаПриход + ТекущаяСтрока.СуммаРасход) * КурсДокументаОплаты, КопияТовары);
				
				// Заполним маркировку
				СтруктураОбъекта.Товары = КопияТовары;
				дкЗаполнитьКодыМаркировкиТоваров(СтруктураОбъекта, ТекущаяСтрока.Сделка);
				
				// Перенесем в Товары
				Для Каждого ТекущаяСтрокаНоменклатуры Из КопияТовары Цикл
					ЗаполнитьЗначенияСвойств(ДокументОплаты.Товары.Добавить(), ТекущаяСтрокаНоменклатуры,, "НомерСтроки");
				КонецЦикла;
				
				// Перенесем в КодыМаркировки
				Для Каждого ТекущаяСтрокаМаркировки Из СтруктураОбъекта.КодыМаркировки Цикл
					ЗаполнитьЗначенияСвойств(ДокументОплаты.КодыМаркировки.Добавить(), ТекущаяСтрокаМаркировки);
				КонецЦикла;
				
				КопияТовары.Очистить();
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверим наличие предоплат
		Если ДокументОплаты.Товары[0].Цена = 0 Тогда
			ДокументОплаты.Товары.Удалить(0);
		Иначе
			ДокументОплаты.ОбработкаРеквизита("Товары.Цена", ДокументОплаты.Товары[0], ЭтаФорма);
			ДокументОплаты.Товары[0].СуммаОплаты = ДокументОплаты.Товары[0].Цена;
		КонецЕсли;
		
	Иначе
		ДокументОплатыОснование = ?(ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер"), ДокументОплаты.ДокументОснование, ДокументОплаты);
		ТаблицаТоваров = Документы.ПриходныйКассовыйОрдер.ПолучитьТабличнуюЧастьДокументаОснования(ДокументОплатыОснование);
		Если НЕ ТаблицаТоваров = Неопределено Тогда
			ДокументОплаты.Товары.Загрузить(ТаблицаТоваров);
			
			Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты(ДокументОплаты.СуммаДокумента, ДокументОплаты.Товары);
			
			Если ТаблицаТоваров.Количество()>0 И
				ЗначениеЗаполнено(ДокументОплаты.ДокументОснование) И (ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") ИЛИ 
				ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.ВозвратПоставщику") ИЛИ
				ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ
				ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.ВозвратОтПокупателя") ИЛИ
				ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитенту") ИЛИ
				(ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.СчетНаОплату") И НЕ обЗначениеНеЗаполнено(ДокументОплаты.ДокументОснование.ДокументОснование) И
				(ТипЗнч(ДокументОплаты.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") ИЛИ
				ТипЗнч(ДокументОплаты.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд"))) ИЛИ
				(ТипЗнч(ДокументОплаты.ДокументОснование) = Тип("ДокументСсылка.СчетОтПоставщика") И НЕ обЗначениеНеЗаполнено(ДокументОплаты.ДокументОснование.ДокументОснование) И
				ТипЗнч(ДокументОплаты.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваров"))) Тогда
				
				дкЗаполнитьГТД(ДокументОплаты, ДокументОплаты.Товары,, ЭтаФорма);
			КонецЕсли;
			дкЗаполнитьКодыМаркировкиТоваров(ДокументОплаты, ДокументОплаты.ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Заполнение реквизитов комиссионера
//
Функция дкЗаполнитьДоговорКомисси(Документ, Автомобили) Экспорт
	
	МассивАвтомобилей = Новый Массив;
	Если НЕ ТипЗнч(Автомобили) = Тип("Массив") Тогда
		МассивАвтомобилей.Добавить(Автомобили);
	Иначе
		МассивАвтомобилей = Автомобили;
	КонецЕсли;
	
	Если МассивАвтомобилей.Количество() = 0 Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиАвтомобилей.Автомобиль КАК Автомобиль,
	|	ОстаткиАвтомобилей.Период КАК Период,
	|	ОстаткиАвтомобилей.СтатусПартии КАК СтатусПартии,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).ДоговорВзаиморасчетов
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратОтПокупателяАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВозвратОтПокупателяАвтомобилей).ДоговорВзаиморасчетов
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).ДоговорВзаиморасчетов
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ИнвентаризацияАвтомобилей).ДоговорВзаиморасчетов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	|	КОНЕЦ КАК ДоговорВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).ДоговорВзаиморасчетов.ПризнакАгента
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратОтПокупателяАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВозвратОтПокупателяАвтомобилей).ДоговорВзаиморасчетов.ПризнакАгента
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).ДоговорВзаиморасчетов.ПризнакАгента
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ИнвентаризацияАвтомобилей).ДоговорВзаиморасчетов.ПризнакАгента
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ПризнакиАгента.ПустаяСсылка)
	|	КОНЕЦ КАК ПризнакАгента,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).ДоговорВзаиморасчетов.ТелефонПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратОтПокупателяАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВозвратОтПокупателяАвтомобилей).ДоговорВзаиморасчетов.ТелефонПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).ДоговорВзаиморасчетов.ТелефонПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ИнвентаризацияАвтомобилей).ДоговорВзаиморасчетов.ТелефонПоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Телефон,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).ДоговорВзаиморасчетов.ИННПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратОтПокупателяАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВозвратОтПокупателяАвтомобилей).ДоговорВзаиморасчетов.ИННПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).ДоговорВзаиморасчетов.ИННПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ИнвентаризацияАвтомобилей).ДоговорВзаиморасчетов.ИННПоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).ДоговорВзаиморасчетов.НаименованиеПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВозвратОтПокупателяАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВозвратОтПокупателяАвтомобилей).ДоговорВзаиморасчетов.НаименованиеПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).ДоговорВзаиморасчетов.НаименованиеПоставщика
	|		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей
	|			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ИнвентаризацияАвтомобилей).ДоговорВзаиморасчетов.НаименованиеПоставщика
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Наименование
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Автомобиль В(&Автомобили)
	|	И ОстаткиАвтомобилей.Период <= &Момент
	|	И ОстаткиАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилей.Регистратор) В (ТИП(Документ.ВводОстатковАвтомобилей), ТИП(Документ.ПоступлениеАвтомобилей), ТИП(Документ.ВозвратОтПокупателяАвтомобилей), ТИП(Документ.ИнвентаризацияАвтомобилей))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Период)
	|ПО
	|	Автомобиль");
	Запрос.УстановитьПараметр("Автомобили", МассивАвтомобилей);
	Запрос.УстановитьПараметр("Момент", Документ.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Результат = Новый Соответствие;
	ДанныеДоговора = Новый Структура("ДоговорВзаиморасчетов,ПризнакАгента,Телефон,ИНН,Наименование");
	
	ВыборкаАвтомобили = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАвтомобили.Следующий() Цикл
		
		Если ВыборкаАвтомобили.Период = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаАвтомобили.Выбрать();
		Выборка.Следующий();
		
		Если НЕ Выборка.СтатусПартии = Перечисления.СтатусыПартий.ТоварПринятыйКомиссия
			ИЛИ Выборка.ДоговорВзаиморасчетов.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеДоговора, Выборка);
		Результат.Вставить(Выборка.Автомобиль, ДанныеДоговора);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // дкЗаполнитьДоговорКомисси()

//Функция возвращает информацию об ответственном лице компании
//если реквизит отв. лицо присутствует в документе в качестве свойств или реквизита информация берется из документа,
//иначе из регистра сведений СведенияКомпании
//
//Параметры:
// ЭтотОбъект - ДокументОбъект, документ, из которого получаются данные
// ВидОтветственногоЛица - Строка или ПеречислениеСсылка.ВидыОбъектовСведений, вид ответственного лица компании 
//       (ГлБухгалтер, Руководитель и т.п.)
// Организация - СправочникСсылка.Организация, переданная организация, что которой определяем ответственное
// лицо переданного типа
//
// Возвращаемое значение:
// Структура, содержащая данные полученного ответственного лица
//
Функция дкОтветственноеЛицо(ЭтотОбъект, ВидОтветственногоЛица, Знач Организация = Неопределено) Экспорт
	Если Организация = Неопределено Тогда
		Организация = ЭтотОбъект.Организация;
	КонецЕсли; 
	стрВидОтветственногоЛица = ?(ТипЗнч(ВидОтветственногоЛица) = Тип("Строка"), ВидОтветственногоЛица, Метаданные.Перечисления.ВидыОбъектовСведений.ЗначенияПеречисления[Перечисления.ВидыОбъектовСведений.Индекс(ВидОтветственногоЛица)].Имя);
	//сначала попробуем получить из свойств документа
	ОтветственноеЛицо = обПолучитьЗначениеСвойства(ЭтотОбъект,стрВидОтветственногоЛица);
	//пробуем получить из документа
	Если ОбЗначениеНеЗаполнено(ОтветственноеЛицо) Тогда
		Попытка
			ОтветственноеЛицо = ЭтотОбъект[стрВидОтветственногоЛица];
		Исключение	
		КонецПопытки;
	КонецЕсли;
	
	//если есть в документе
	Если обЗначениеНеЗаполнено(ОтветственноеЛицо) Тогда
		СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(ЭтотОбъект.Дата, Новый Структура("Организация,Объект", Организация, ВидОтветственногоЛица));
		ОтветственноеЛицо = СтруктураСведений.Значение;
	КонецЕсли;
	
	//bizteh
	// попробуем достать из документа-основания
	//Если обЗначениеНеЗаполнено(ОтветственноеЛицо) Тогда
	//	Попытка
	//		ОтветственноеЛицо = ЭтотОбъект.ДокументОснование[стрВидОтветственногоЛица];
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	//положим все в структуру
	СтруктураВозврата = Новый Структура;
	//если не заполнено
	Попытка
		СтруктураВозврата.Вставить(стрВидОтветственногоЛица + "Должность", ОтветственноеЛицо.Должность);
	Исключение
		СтруктураВозврата.Вставить(стрВидОтветственногоЛица + "Должность", );
	КонецПопытки;
	СтруктураВозврата.Вставить(стрВидОтветственногоЛица + "Представление", Строка(ОтветственноеЛицо));
	СтруктураВозврата.Вставить(стрВидОтветственногоЛица, ОтветственноеЛицо);
	Возврат СтруктураВозврата;
КонецФункции // дкОтветственноеЛицо()

//функция, осуществляет приведение цены с соотв. со ставками ндс
//параметры:
// Цена 		 - Число, исходная цена
// ТипЦенНач - СправочникСсылка.ТипыЦен или Булево, во втором случае передается значение флага "Цена включает НДС"
// ТипЦенКон - СправочникСсылка.ТипыЦен или Булево, во втором случае передается значение флага "Цена включает НДС"
//	СтавкаНДСНач - СправочникСсылка.СтавкиНДС
//	СтавкаНДСКон - СправочникСсылка.СтавкиНДС
//
// Возвращаемое значение:
// Число - пересчитанная цена
//
Функция дкПересчетЦены(Цена,ТипЦенНач,СтавкаНДСНач = Неопределено,ТипЦенКон,СтавкаНДСКон = Неопределено) Экспорт
	//определяем типы параметров
	ЦенаКон = Цена;
	Если ТипЗнч(ТипЦенНач) = Тип("СправочникСсылка.ТипыЦен") Тогда
		ЦенаНачСНДС = ТипЦенНач.ЦенаВключаетНДС;
	Иначе
		ЦенаНачСНДС = ТипЦенНач;
	КонецЕсли;
	Если ТипЗнч(ТипЦенКон) = Тип("СправочникСсылка.ТипыЦен") Тогда
		ЦенаКонСНДС = ТипЦенКон.ЦенаВключаетНДС;
	Иначе
		ЦенаКонСНДС = ТипЦенКон;
	КонецЕсли;
	Если ЦенаНачСНДС = ЦенаКонСНДС Тогда
		//если параметры цены равны, пересчитываем, когда
		//обе цены включают НДС и все параметры заполнены
		Если ЦенаНачСНДС И ЦенаКонСНДС И СтавкаНДСНач <> Неопределено И СтавкаНДСКон <> Неопределено И СтавкаНДСНач.Ставка <> СтавкаНДСКон.Ставка Тогда
			ЦенаКон = Цена /(1 + СтавкаНДСНач.Ставка / 100) * (1 + СтавкаНДСКон.Ставка / 100);
		КонецЕсли;
	Иначе
		//пересчитываем цены
		Если ЦенаНачСНДС И СтавкаНДСНач <> Неопределено Тогда
			ЦенаКон = Цена/(1 + СтавкаНДСНач.Ставка/100);
		КонецЕсли;
		Если ЦенаКонСНДС И СтавкаНДСКон <> Неопределено Тогда
			ЦенаКон = Цена*(1 + СтавкаНДСКон.Ставка/100);
		КонецЕсли;
	КонецЕсли;
	Возврат ЦенаКон;
КонецФункции // дкПересчетЦены()

// Функция обхода табличной части документа по ячейкам и возвращения длины маршрута обхода
// с учетом расстояний от точек входа и выхода склада
//
// Параметры:
//	ЭтотОбъект	– ДокументОбъект – Документ, маршрут по которому подсчитывается
// Товары		– ТабличнаяЧасть – Табличная часть документа, ячейки которой обходятся
//
// Возвращаемое значение:
// Число		– Длина маршрута
//
Функция дкПолучитьДлинуМаршрута(ЭтотОбъект, Товары = Неопределено) Экспорт
	ДлинаМаршрута = 0;
	СкладКомпании = ЭтотОбъект.СкладКомпании;
	Если СкладКомпании.ВидСклада <> Перечисления.ВидыСкладов.Ячеистый Тогда
	Иначе
		НачалоОтрезка 	 = Новый Структура("X,Y,Z", СкладКомпании.ВходX, СкладКомпании.ВходY, СкладКомпании.ВходУровень);
		ТочкаВыхода 	 = Новый Структура("X,Y,Z", СкладКомпании.ВыходX, СкладКомпании.ВыходY, СкладКомпании.ВыходУровень);
		// проверим есть ли ТЧ Товары. если ее не передали
		Если Товары = Неопределено Тогда
			Попытка
				ТаблицаТоваров = ЭтотОбъект.Товары;
			Исключение
				ТаблицаТоваров = Неопределено;
			КонецПопытки; 
		Иначе
			ТаблицаТоваров = Товары;
		КонецЕсли; 
		ЕстьЯчейка = Ложь;
		Если ТаблицаТоваров <> Неопределено Тогда
			Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
				Если Не обЗначениеНеЗаполнено(СтрокаТЧ.Ячейка) Тогда
					ЕстьЯчейка = Истина;
					ТекЯчейка = СтрокаТЧ.Ячейка;
					// длина отрезка через координаты его точек
					ДлинаОтрезкаМаршрута = Sqrt((ТекЯчейка.КоординатаX - НачалоОтрезка.X)*(ТекЯчейка.КоординатаX - НачалоОтрезка.X) + (ТекЯчейка.КоординатаY-НачалоОтрезка.Y)*(ТекЯчейка.КоординатаY-НачалоОтрезка.Y) + (ТекЯчейка.Уровень-НачалоОтрезка.Z)*(ТекЯчейка.Уровень-НачалоОтрезка.Z));
					НачалоОтрезка.X = ТекЯчейка.КоординатаX;
					НачалоОтрезка.Y = ТекЯчейка.КоординатаY;
					НачалоОтрезка.Z = ТекЯчейка.Уровень;
					ДлинаМаршрута = ДлинаМаршрута + ДлинаОтрезкаМаршрута;
				КонецЕсли;
			КонецЦикла; 
			// расстояние от последней точки до выхода
			ДлинаМаршрута = ДлинаМаршрута + Sqrt((ТочкаВыхода.X - НачалоОтрезка.X)*(ТочкаВыхода.X - НачалоОтрезка.X) + (ТочкаВыхода.Y-НачалоОтрезка.Y)*(ТочкаВыхода.Y-НачалоОтрезка.Y) + (ТочкаВыхода.Z-НачалоОтрезка.Z)*(ТочкаВыхода.Z-НачалоОтрезка.Z));
			Если Не ЕстьЯчейка Тогда
				//если ячеек в ТЧ нет, длина маршрута от входа к выходу нам не нужна
				ДлинаМаршрута = 0;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	Возврат ДлинаМаршрута;
КонецФункции // дкПолучитьДлинуМаршрута()

// Получить ссылку на документ в цепочке подчиненных документов по его типу
//
// Параметры :
//	ЭтотОбъект 			 - ДокументСсылка - ссылка на документ, в котором производится поиск документа основания
// ТипДокументаОснования – Тип – Тип искомого документа основания в цепочке подчиненных документов
//
// Возвращаемое значение:
// ДокументСсылка – Ссылка на документ основание
//
Функция дкПолучитьДокументОснование(ЭтотОбъект,ТипДокументаОснования) Экспорт
	Попытка
		Документ = ЭтотОбъект.ДокументОснование;
		Пока Истина Цикл
			Если ТипЗнч(Документ) = ТипДокументаОснования Тогда
				Возврат Документ;
			КонецЕсли; 
			Документ = Документ.ДокументОснование;
		КонецЦикла; 
	Исключение
		Возврат Неопределено;
	КонецПопытки; 
КонецФункции // ПолучитьДокументОснование()

//Получение кода номенклатуры в зависимости от права режима вывода кода
//
//Параметры:
// Номенклатура  - СправочникСсылка.Номенклатура - Номенклатура, код которой требуется получить
// РежимыВыводаКодаВДокументах	- Строка - Имя реквизита номенклатуры, выступающее в качестве кода
//								- ПеречислениеСсылка.РежимыВыводаКодаВДокументах - Настройка режим отображения кода
// ПраваПользователя - Права пользователя или объект документа
// ВыводитьПроизводителя - Булево - При значении параметра в "Истина" добавление к артикулу номенклатуры производителя, если заполнен соответствующий реквизит у номенклатуры
//Возвращаемое значение:
// Строка - значение кода номенклатуры в зависимости от настройки режима вывода
//
Функция дкПолучитьЗначениеКолонкиКода(Номенклатура, Знач РежимыВыводаКодаВДокументах = Неопределено, ПраваПользователя = Неопределено, ВыводитьПроизводителя = Ложь) Экспорт
	КодНоменклатуры = "";
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если РежимыВыводаКодаВДокументах = Неопределено ИЛИ ТипЗнч(РежимыВыводаКодаВДокументах) = Тип("ПеречислениеСсылка.РежимыВыводаКодаВДокументах") Тогда
			РежимыВыводаКодаВДокументах = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(РежимыВыводаКодаВДокументах, ПраваПользователя).Имя;
		КонецЕсли; 
		//Закомментированное условие потребуется, 
		//когда кроме реквизитов справочника номенклатуры 
		//будем использовать что нибудь еще (например ШК)
		Если РежимыВыводаКодаВДокументах="КодИАртикул" Тогда
			КодНоменклатуры = Номенклатура["Код"]+" / "+Номенклатура["Артикул"];
		Иначе
			Попытка
				КодНоменклатуры = Номенклатура[РежимыВыводаКодаВДокументах];
			Исключение
				Попытка
					КодНоменклатуры = Номенклатура.Код;
				Исключение
				КонецПопытки; 
			КонецПопытки; 
		КонецЕсли;
		
		Если ВыводитьПроизводителя И Найти(РежимыВыводаКодаВДокументах, "Артикул") > 0 Тогда
			Производитель = ?(ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") И НЕ Номенклатура.Производитель.Пустая(), " ["+Номенклатура.Производитель+"]", "");
			КодНоменклатуры = КодНоменклатуры + Производитель;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КодНоменклатуры;
КонецФункции // дкПолучитьЗначениеКолонкиКода()

// Возвращает значение курса валюты взаиморасчетов для документа
// Параметры:
// ЭтотОбъект	-	ДокументСсылка или ДокументОбъект		- документ для которого рассчитывается курс
// Договор		-	СправочникСсылка.ДоговорыВзаиморасчетов	- договор взаиморасчетов
// Основание	-	ДокументСсылка							- документ основание
//
// Возвращаемое значение:
// Число - значение курса валюты взаимозачетов
//
Функция дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, Знач Договор = Неопределено, Основание = Неопределено) Экспорт
	Курс = 0;
	ДатаДокумента = ЭтотОбъект.Дата;
	
	// в документах договор взаиморасчетов может называться по-разному
	МассивДопустимыеИменаДоговорВзаиморасчетов = Новый Массив;
	МассивДопустимыеИменаДоговорВзаиморасчетов.Добавить("ДоговорВзаиморасчетов");
	МассивДопустимыеИменаДоговорВзаиморасчетов.Добавить("ДоговорВзаиморасчетовИнкассатор");
	
	ЭтотОбъектДоговорИмя = "";
	ОснованиеДоговорИмя = "";
	Для Индекс = 0 По МассивДопустимыеИменаДоговорВзаиморасчетов.ВГраница() Цикл
		Если ПустаяСтрока(ЭтотОбъектДоговорИмя) Тогда
			Если ЭтотОбъект.Ссылка.Метаданные().Реквизиты.Найти(МассивДопустимыеИменаДоговорВзаиморасчетов[Индекс]) <> Неопределено Тогда
				ЭтотОбъектДоговорИмя = МассивДопустимыеИменаДоговорВзаиморасчетов[Индекс];
			КонецЕсли;
		КонецЕсли;
		Если Не обЗначениеНеЗаполнено(Основание) Тогда
			Если ПустаяСтрока(ОснованиеДоговорИмя) Тогда
				Если Основание.Ссылка.Метаданные().Реквизиты.Найти(МассивДопустимыеИменаДоговорВзаиморасчетов[Индекс]) <> Неопределено Тогда
					ОснованиеДоговорИмя = МассивДопустимыеИменаДоговорВзаиморасчетов[Индекс];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// если не передан Договор, значит в документе или в документе основании реквизит договора
	// назван "не стандартно", попробуем получить договор сами
	Если обЗначениеНеЗаполнено(Договор) Тогда
		Если Не ПустаяСтрока(ЭтотОбъектДоговорИмя) Тогда
			Договор = ЭтотОбъект[ЭтотОбъектДоговорИмя];
			Если обЗначениеНеЗаполнено(Договор) Тогда
				Если Не обЗначениеНеЗаполнено(Основание) Тогда
					// считаем, что происходит ввод на основании, берем договор из основания
					Если Не ПустаяСтрока(ОснованиеДоговорИмя) Тогда
						Договор = Основание[ОснованиеДоговорИмя];
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Договор) Тогда
		// без договора взаиморасчетов курс не получить
		Возврат 0;
	КонецЕсли;
	
	спрВалютаДоговора = Договор.ВалютаВзаиморасчетов;
	
	Если (НЕ обЗначениеНеЗаполнено(Основание))
		И (Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Основание)))
		И (Не (ПустаяСтрока(ЭтотОбъектДоговорИмя) ИЛИ ПустаяСтрока(ОснованиеДоговорИмя)))
		И (Основание[ОснованиеДоговорИмя] = Договор) Тогда
		// если определен документ основание и договор основания совпадает с договором документа
		спрВалютаОснования = Основание.ВалютаДокумента;
		спрВалютаДоговораОснования = Основание[ОснованиеДоговорИмя].ВалютаВзаиморасчетов;
		Если спрВалютаОснования = спрВалютаДоговораОснования Тогда
			// если валюта документа основания совпадает с его валютой расчетов
			// попытаемся получить курс валюты расчетов из реквизита документа КурсВалютыВзаиморасчетов,
			// реквизита может не быть у документа
			Попытка
				Курс = Основание.КурсВалютыВзаиморасчетов;
			Исключение
				Курс = 0;
			КонецПопытки;
			
			// если курс все еще равен нулю, значит попытка получить его была неудачная,
			// возьмем курс валюты взаиморасчетов на дату основания
			Если Курс = 0 Тогда
				СтруктураКурса = обКурсДляВалюты(Договор.ВалютаВзаиморасчетов, Основание.Дата);
				Курс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			КонецЕсли;
		Иначе
			// если валюты не совпадают, берем курс валюты взаиморасчетов на дату основания
			СтруктураКурса = обКурсДляВалюты(спрВалютаДоговора, Основание.Дата);
			Курс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;
	Иначе
		// если основание не определено или договоры документа и основания не совпадают
		СтруктураКурса = обКурсДляВалюты(спрВалютаДоговора, ДатаДокумента);
		Курс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
	КонецЕсли;
	
	Возврат Курс;
КонецФункции // дкПолучитьКурсВалютыВзаиморасчетов()

// Возвращает массив подчиненных документов.
//
// Параметры: Основание	 - ДокументСсылка. Тот документ подчиненных для которого ищем
//	МассивВидов			 - Массив. Массив строк с видами подчиненных документов. Если МассивВидов не определен,
//						 то возвращаются все подчиненные документы
//
// Возвращаемое значение: 
// Массив ссылок документов
//
Функция дкПолучитьМассивПодчиненных(Основание,МассивВидов = Неопределено, ТолькоНеПомеченные = Ложь) Экспорт
	// проверим на пустое основание
	Если обЗначениеНеЗаполнено(Основание) Тогда
		Возврат Неопределено;
	КонецЕсли;
	// получим массив подчиненных документов
	//МассивПодчиненных = КритерииОтбора.ПодчиненныеДокументы.Найти(Основание);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодчиненныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы";
	Запрос.УстановитьПараметр("Основание", Основание);
	МассивПодчиненных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// если задан фильтр на виды документов, то пропустим полученный массив через этот фильтр
	Если (МассивВидов <> Неопределено) И (МассивПодчиненных.Количество() > 0) Тогда
		ТекИндекс = 0;
		Пока ТекИндекс <= МассивПодчиненных.ВГраница() Цикл
			НайденВФильтре = Ложь;
			Для Сч = 0 По МассивВидов.ВГраница() Цикл
				Если МассивПодчиненных[ТекИндекс].Ссылка.Метаданные().Имя = МассивВидов[Сч] Тогда
					НайденВФильтре = Истина; Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НайденВФильтре И (НЕ ТолькоНеПомеченные ИЛИ НЕ МассивПодчиненных[ТекИндекс].Ссылка.ПометкаУдаления) Тогда 
				ТекИндекс = ТекИндекс + 1; 
			Иначе 
				МассивПодчиненных.Удалить(ТекИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивПодчиненных;
КонецФункции // дкЗаполнитьТабличнуюЧастьПоОснованию()

// предназначена для получения таблицы номенклатуры, в типе которой, стоит признак ручного списания характеристик
// либо этот признак не заполнен. Вызывается при проведении документов.
//
// Параметры:
// Ссылка - ДокументСсылка. Ссылка на проводимый документ
// ИмяРеквизитаНоменклатура - Строка. Имя реквизита, содержащего номенклатуру
//
// Возвращаемое значение:
// ТаблицаЗначений - таблица товаров с ручным списанием характеристик
//
Функция дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик(Ссылка,ИмяРеквизитаНоменклатура = "Номенклатура") Экспорт
	// возвращаем в виде таблицы значений
	ТаблицаНоменклатуры = Неопределено;
	// получаем данные
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДокТовары." + ИмяРеквизитаНоменклатура + " КАК Номенклатура
	|ИЗ
	|	Документ." + Ссылка.Метаданные().Имя + ".Товары КАК ДокТовары
	|
	|ГДЕ
	|	ДокТовары.Ссылка = &Ссылка
	|	И (ДокТовары." + ИмяРеквизитаНоменклатура + ".ТипНоменклатуры.АвтоСписаниеХарактеристик = &РучноеСписание ИЛИ ДокТовары." + ИмяРеквизитаНоменклатура + ".ТипНоменклатуры.АвтоСписаниеХарактеристик = &ПустойРежим)
	|
	|СГРУППИРОВАТЬ ПО 
	|	ДокТовары." + ИмяРеквизитаНоменклатура + "
	|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("РучноеСписание", Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание);
	Запрос.УстановитьПараметр("ПустойРежим", Перечисления.РежимыАвтоСписанияХарактеристик.ПустаяСсылка());
	Попытка
		РезультатПоиска = Запрос.Выполнить();
	Исключение
		Возврат ТаблицаНоменклатуры;
	КонецПопытки;
	
	Если НЕ РезультатПоиска.Пустой() Тогда
		ТаблицаНоменклатуры = РезультатПоиска.Выгрузить();
	КонецЕсли;
	
	Возврат ТаблицаНоменклатуры;
КонецФункции // дкПолучитьНоменклатуруСРучнымСписаниемХарактеристик()

// Возвращает текущий режим вывода кода в табличных частях документа - код или артикул
//
// Параметры:
// РежимыВыводаКодаВДокументах - ПеречислениеСсылка.РежимыВыводаКодаВДокументах, значение режима вывода
// ДокументОбъект - Структура прав пользователя или объект документа
//         
// Возвращаемое значение:
// ОбъектМетаданных - значения перечисления, полученное через метаданные.
//
Функция дкПолучитьПараметрыРежимаВыводаКодаВДокументах(Знач РежимыВыводаКодаВДокументах = Неопределено, ДокументОбъект = Неопределено) Экспорт
	Попытка
		ПраваПользователя=ДокументОбъект.Права;
		ЭтотОбъект=ДокументОбъект;
	Исключение
		ПраваПользователя=ДокументОбъект;
		ЭтотОбъект=Неопределено;
	КонецПопытки; 
	
	Если ТипЗнч(РежимыВыводаКодаВДокументах) <> Тип("ПеречислениеСсылка.РежимыВыводаКодаВДокументах") Тогда
		РежимыВыводаКодаВДокументах = обПраво("РежимВыводаКодаВДокументах",ПраваПользователя,,ЭтотОбъект);
	КонецЕсли; 
	Индекс = Перечисления.РежимыВыводаКодаВДокументах.Индекс(РежимыВыводаКодаВДокументах);
	МД = Метаданные.Перечисления.РежимыВыводаКодаВДокументах;
	Возврат МД.ЗначенияПеречисления[Индекс];
КонецФункции // дкПолучитьПараметрыРежимаВыводаКодаВДокументах()

// Возвращает из структуры печатную форму ключ по значению (или ключу)
//
// Параметры:
// СтруктураПечатныхФорм - структура, перечень доступных печ. форм
// НазваниеПечатнойФормы - строка, название получаемой печ. формы
//
// Возвращаемое значение:
// Ключ структуры либо Неопределено
//
Функция дкПолучитьПечатнуюФорму(СтруктураПечатныхФорм,НазваниеПечатнойФормы) Экспорт 
	// Ищем название печ. формы по значению структуры
	Для Каждого ПечатнаяФорма Из СтруктураПечатныхФорм Цикл
		Если ПечатнаяФорма.Значение = НазваниеПечатнойФормы Тогда
			Возврат ПечатнаяФорма.Ключ;
		КонецЕсли;
	КонецЦикла;
	// не нашли - пробуем найти название печ. формы по ключу структуры
	Для Каждого ПечатнаяФорма Из СтруктураПечатныхФорм Цикл
		Если ПечатнаяФорма.Ключ = НазваниеПечатнойФормы Тогда
			Возврат ПечатнаяФорма.Ключ;
		КонецЕсли;
	КонецЦикла;
КонецФункции // дкПолучитьПечатнуюФорму()

// Возвращает представление для документа
//
// Параметры:
// ЭтотОбъект - ДокументСсылка или ДокументОбъект
// АльтернативноеНазвание - Строка, используется, если хотим заменить синоним документа 
//
// Возвращаемое значение:
// Строка - Строка представления документа
//
Функция дкПолучитьПредставление(ЭтотОбъект, АльтернативноеНазвание = "") Экспорт
	Попытка
		ЭтотОбъектНомер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ТекстПредставления = ?(ПустаяСтрока(АльтернативноеНазвание), ЭтотОбъект.Метаданные().Синоним, АльтернативноеНазвание) + " № " + ЭтотОбъектНомер + " от " + Формат(ЭтотОбъект.Дата,"ДФ = dd.MM.yyyy");
	Исключение 
		ТекстПредставления = "Неправильный тип объекта!";
	КонецПопытки;
	Возврат ТекстПредставления;
КонецФункции // ПолучитьПредставление()

//функция, подготавливает структуру строки документа для вывода в печ. формы
//
// Параметры:
// ТекСтрока - СтрокаТабличнойЧасти, строка ТЧ документа
// ДокументОбъект - Структура прав пользователя или объект документа
//
// Возвращаемое значение:
// Структура - формат структуры:
// НомерСтроки
// ТоварНаименование - полное наименование товара с характеристикой, если есть
// Номенклатура - значение номенклатуры для расшифровки
// Код - код, вид определяется настройкой
// Количество - если Количество*Коэффициент <> КоличествоБазовое, то выводится базовое
// Единица измерения - если Количество*Коэффициент <> КоличествоБазовое, то выводится базовая единица измерения
// Цена
// СуммаНДС
// СуммаВсего
// СуммаБезНДС
// ЦенаБезНДС
// ЦенаРозничная
// СуммаРозничная
// ПредставлениеСкидки - определяется настройкой пользователя
// 
Функция дкПолучитьПредставлениеДанныхТоварнойСтроки(ТекСтрока,ДокументОбъект) Экспорт
	Попытка
		ПраваПользователя=ДокументОбъект.Права;
		ЭтотОбъект=ДокументОбъект;
	Исключение
		ПраваПользователя=ДокументОбъект;
		ЭтотОбъект=Неопределено;
	КонецПопытки; 
	
	СтруктураСтроки = Новый Структура;
	
	//ТоварНаименование = спПолучитьНаименование(ТекСтрока.Номенклатура);  
	
	//Bizteh++ 01.10.2022
	Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("Строка") тогда
		ТоварНаименование = ТекСтрока.Номенклатура;
	Иначе  //Bizteh--
		ТоварНаименование = спПолучитьНаименование(ТекСтрока.Номенклатура);
	КонецЕсли;
	
	//получаем характеристику
	Попытка
		Характеристика = ТекСтрока.ХарактеристикаНоменклатуры;
	Исключение
		Характеристика = Неопределено;
	КонецПопытки;
	//характеристику выводим в строке с наименованием
	ТоварНаименование = ТоварНаименование + ?(НЕ обЗначениеНеЗаполнено(Характеристика),", " + спПолучитьНаименование(Характеристика),"");
	
	//заполняем структуру строки
	СтруктураСтроки.Вставить("НомерСтроки",ТекСтрока.НомерСтроки);
	СтруктураСтроки.Вставить("ТоварНаименование",ТоварНаименование);
	//для расшифровки                                               
	СтруктураСтроки.Вставить("Номенклатура",ТекСтрока.Номенклатура);    
	
	
	
	ВыводитьПроизводителя = обПраво("ВыводитьПроизводителяВПечатныхФормах",ПраваПользователя,,ЭтотОбъект);
	
	//получаем код номенклатуры в зависимости от настройки прав
	Код = дкПолучитьЗначениеКолонкиКода(ТекСтрока.Номенклатура, , ?(ЭтотОбъект=Неопределено,ПраваПользователя,ЭтотОбъект), ВыводитьПроизводителя);
	СтруктураСтроки.Вставить("Код",Код);
	
	//форматы вывода
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", ПраваПользователя,,ЭтотОбъект);
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", ПраваПользователя,,ЭтотОбъект);
	
	//если количество не равно базовому, корректируем вывод
	Попытка
		Если ТекСтрока.Количество * ТекСтрока.Коэффициент <> ТекСтрока.КоличествоБазовое Тогда
			СтруктураСтроки.Вставить("Количество",Формат(ТекСтрока.КоличествоБазовое, ФорматВыводаКоличества));
			Попытка
				ЕдиницаИзмерения = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения;
			Исключение
				ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			КонецПопытки; 
			СтруктураСтроки.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
			Количество = ТекСтрока.КоличествоБазовое;
			Попытка
				Коэффициент = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения.Коэффициент;
			Исключение
				Коэффициент = ТекСтрока.Коэффициент;
			КонецПопытки; 
		Иначе
			СтруктураСтроки.Вставить("Количество", Формат(ТекСтрока.Количество, ФорматВыводаКоличества));
			СтруктураСтроки.Вставить("ЕдиницаИзмерения", ТекСтрока.ЕдиницаИзмерения);
			Количество = ТекСтрока.Количество;
			Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
		КонецЕсли;
	Исключение
		Попытка 
			Количество = ТекСтрока.Количество;
			СтруктураСтроки.Вставить("Количество",Формат(ТекСтрока.Количество, ФорматВыводаКоличества)); 
		Исключение
			Количество = 0;
		КонецПопытки;
		
		Попытка
			Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
			СтруктураСтроки.Вставить("ЕдиницаИзмерения",ТекСтрока.ЕдиницаИзмерения);
		Исключение
			Попытка
				Коэффициент = ТекСтрока.Коэффициент;
			Исключение
				Коэффициент = 0;
			КонецПопытки; 
		КонецПопытки; 
	КонецПопытки;
	
	Попытка 
		Цена = ?(Коэффициент = 0, ТекСтрока.Цена, ТекСтрока.Цена * Коэффициент);
		СтруктураСтроки.Вставить("Цена", Формат(Цена, ФорматВыводаСуммы)) 
	Исключение
	КонецПопытки;
	
	Попытка
		СтруктураСтроки.Вставить("СтавкаНДС", дкПолучитьПредставлениеСтавкиНДС(ТекСтрока.СтавкаНДС));
	Исключение
	КонецПопытки; 
	
	Попытка 
		СтруктураСтроки.Вставить("СуммаНДС",Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы));
		Если ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда	// вместо пустой суммы выведем прочерк
			СтруктураСтроки.СуммаНДС = "- ";
		КонецЕсли; 
	Исключение
	КонецПопытки;
	
	Попытка СтруктураСтроки.Вставить("СуммаВсего", Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы))
	Исключение
	КонецПопытки; 
	
	Попытка
		СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
		СтруктураСтроки.Вставить("СуммаБезНДС", Формат(СуммаБезНДС, ФорматВыводаСуммы));
	Исключение 
		Попытка 
			СуммаБезНДС = ТекСтрока.СуммаВсего; 
			СтруктураСтроки.Вставить("СуммаБезНДС", Формат(СуммаБезНДС, ФорматВыводаСуммы));
		Исключение 
			Попытка 
				СуммаБезНДС = ТекСтрока.Сумма; 
				СтруктураСтроки.Вставить("СуммаБезНДС", Формат(СуммаБезНДС, ФорматВыводаСуммы));
			Исключение 
			КонецПопытки; 
		КонецПопытки; 
	КонецПопытки;
	
	Попытка
		Количество = Количество * Коэффициент;
		ЦенаБезНДС = ?(Количество = 0, 0, СуммаБезНДС / Количество);
		СтруктураСтроки.Вставить("ЦенаБезНДС", Формат(ЦенаБезНДС, ФорматВыводаСуммы));
	Исключение
	КонецПопытки;
	
	Попытка СтруктураСтроки.Вставить("ЦенаРозничная", Формат(ТекСтрока.ЦенаРозничная, ФорматВыводаСуммы))
	Исключение
	КонецПопытки;
	
	Попытка СтруктураСтроки.Вставить("СуммаРозничная", Формат(ТекСтрока.СуммаРозничная, ФорматВыводаСуммы))
	Исключение
	КонецПопытки;
	
	ПредставлениеСкидки = дкПолучитьПредставлениеСкидкиДляПечати(ТекСтрока, ПраваПользователя);
	СтруктураСтроки.Вставить("ПредставлениеСкидки", Формат(ПредставлениеСкидки, ФорматВыводаСуммы));
	
	Возврат СтруктураСтроки;
КонецФункции // дкПолучитьПредставлениеДанныхТоварнойСтроки()

//функция возвращает представление скидки по строке документа
//для вывода в печ. формы
//
// Параметры:
// ТекСтрока - СтрокаТабличнойЧасти - обрабатываемая строка
// Права 	 – Структура, кеш прав (зарезервировано на будущее)
//
// Возвращаемое значение:
// Число - найденная сумма скидки
//
Функция дкПолучитьПредставлениеСкидкиДляПечати(ТекСтрока, Права) Экспорт
	Попытка
		ПредставлениеСкидки = ТекСтрока.СуммаСкидки;
	Исключение
		ПредставлениеСкидки = 0;
	КонецПопытки;
	Попытка
		ПредставлениеСкидки = ПредставлениеСкидки + ТекСтрока.СуммаСкидкиСтроки;
	Исключение
	КонецПопытки;
	Попытка
		ПредставлениеСкидки = ПредставлениеСкидки + ТекСтрока.СуммаСкидкиБонусами;
	Исключение
	КонецПопытки;
	Возврат ПредставлениеСкидки;
КонецФункции // дкПолучитьПредставлениеСкидкиДляПечати()

// Возвращающей текстовое представление ставки НДС
//
// Параметры
// СтавкаНДС – СправочникСсылка.СтавкиНДС – ставка НДС для которой получаем текстовое представление
// Процент – Строка – Для печати Счетов-фактур передается символ "%", во всех остальных случаях пустая строка
//
// Возвращаемое значение:
// Строка - текстовое представление ставки НДС
Функция дкПолучитьПредставлениеСтавкиНДС(СтавкаНДС, Процент = "") Экспорт 	
	Если СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.БезНДС") Тогда
		
		Возврат НСтр("ru = 'Без НДС'");
		
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Справочник.СтавкиНДС.ОсновнаяСтавкаНДСРасчетная") Тогда
		
		ПредставлениеСтавкиНДС = Строка(СтавкаНДС);
		Если СтрНайти(ПредставлениеСтавкиНДС, Процент) = 0 Тогда
			ПредставлениеСтавкиНДС = ПредставлениеСтавкиНДС + Процент;
		КонецЕсли;
		Возврат ПредставлениеСтавкиНДС;
		
	КонецЕсли;
	
	Возврат СокрЛП(СтавкаНДС.Ставка) + Процент;
КонецФункции // дкПолучитьПредставлениеСтавкиНДС(СтавкаНДС)

//Получение разрешенных типов сделок для документа
// 
// Параметры: 
// ЭтотОбъект			– ДокументОбъект, обрабатываемый документ
// ЭтоДебетоваяСделка	- Булево, признак что это дебетовая сделка
// ЭтоКредитоваяСделка - Булево, признак что это кредитовая сделка
// 
// Возвращаемое значение: 
// СписокЗначений - список разрешенных типов сделок для документа.
Функция дкПолучитьРазрешенныеТипыСделок(ЭтотОбъект,ЭтоДебетоваяСделка,ЭтоКредитоваяСделка) Экспорт
	СписокТиповСделок = Новый СписокЗначений;
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТипыСделок.Ссылка,
	|	ТипыСделок.ТипЗначения
	|ИЗ
	|	ПланВидовХарактеристик.ТипыСделок КАК ТипыСделок";
	//будем отбирать
	Если (ЭтоДебетоваяСделка) И (НЕ ЭтоКредитоваяСделка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ТипыСделок.Кредитовый = ИСТИНА";
	ИначеЕсли (ЭтоКредитоваяСделка) И (НЕ ЭтоДебетоваяСделка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ТипыСделок.Дебетовый = ИСТИНА";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	ВыборкаТиповСделок = Запрос.Выполнить().Выбрать();
	Пока ВыборкаТиповСделок.Следующий() Цикл
		МассивТипов = ВыборкаТиповСделок.ТипЗначения.Типы();
		Для Сч = 0 По МассивТипов.ВГраница() Цикл
			ПустоеЗначение = Новый (МассивТипов[Сч]);
			Если СписокТиповСделок.НайтиПоЗначению(ПустоеЗначение.Метаданные().Имя) = Неопределено Тогда
				СписокТиповСделок.Добавить(ПустоеЗначение.Метаданные().Имя,ПустоеЗначение.Метаданные().Синоним);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	// упорядочим
	СписокТиповСделок.СортироватьПоПредставлению();
	Возврат СписокТиповСделок;
КонецФункции // дкПолучитьРазрешенныеТипыСделок()

// Функция возвращает список связных документов,
// связными по отношению к текущему являются те документы, которые введены на
// основании текущего или на основании которого введен текущий.
//
// Параметры:
//	ДанныеСтроки - ТекущиеДанные - Данные строки списка
//
// Возвращаемое значение:
// СписокЗначений - Список значений связных документов
//
Функция дкПолучитьСписокСвязныхДокументов(ДанныеСтроки) Экспорт
	СписокСвязныхДокументов = Новый СписокЗначений;
	СвязныйДокумент = Неопределено;
	Попытка
		СвязныйДокумент = ДанныеСтроки.Ссылка.ДокументОснование;
		Если СвязныйДокумент.Ссылка.Пустая() Тогда
			СвязныйДокумент = Неопределено;
		КонецЕсли;	
	Исключение
		СвязныйДокумент = Неопределено;
	КонецПопытки;
	Если Не СвязныйДокумент = Неопределено Тогда
		Если Не СвязныйДокумент.ПометкаУдаления Тогда
			СписокСвязныхДокументов.Добавить(СвязныйДокумент);
		КонецЕсли;	
	КонецЕсли;	
	МассивПодчиненныхДокументов = дкПолучитьМассивПодчиненных(ДанныеСтроки.Ссылка);
	Если МассивПодчиненныхДокументов.Количество() > 0 Тогда
		Для Каждого СтрДокумент Из МассивПодчиненныхДокументов Цикл
			Если (СтрДокумент.Ссылка.Пустая())
				ИЛИ (СтрДокумент.Метаданные().Реквизиты.Найти("ДокументОснование") <> Неопределено
				И СтрДокумент.ДокументОснование <> ДанныеСтроки.Ссылка)
				ИЛИ (СтрДокумент.ПометкаУдаления) Тогда
				Продолжить;
			КонецЕсли;
			СписокСвязныхДокументов.Добавить(СтрДокумент);
		КонецЦикла;	
	КонецЕсли;
	Возврат СписокСвязныхДокументов;
КонецФункции // дкПолучитьСписокСвязныхДокументов()

//Функция, формирует строку по свойствам документа вида:
//Вид свойства : ЗначениеСвойства
//
//Параметры:
// ЭтотОбъект - документ для которого получим свойства
// ВидПолучаемыхСвойств - число, 0 - только пользовательские, 1 - только предопределенные, 2 - все
//
Функция дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект, ВидПолучаемыхСвойств = 2) Экспорт
	ОбработкаЗначенияСвойств = Обработки.ЗначенияСвойствОбъекта.Создать();
	ОбработкаЗначенияСвойств.ОбъектОтбораЗначений = ЭтотОбъект.Ссылка;
	ОбработкаЗначенияСвойств.ПрочитатьЗаполнитьСвойстваИЗначения();
	СтрокаСвойств = "";
	Для Каждого СтрокаТаблицыСвойств Из ОбработкаЗначенияСвойств.СвойстваИЗначения Цикл
		Если Не обЗначениеНеЗаполнено(СтрокаТаблицыСвойств.Значение) Тогда
			Если СтрокаТаблицыСвойств.Свойство.Предопределенный И ВидПолучаемыхСвойств > 0 Тогда
				//только предопределенные или все
				Добавить = Истина;
			ИначеЕсли НЕ СтрокаТаблицыСвойств.Свойство.Предопределенный И ВидПолучаемыхСвойств <> 1 Тогда
				//только пользовательские или все
				Добавить = Истина;
			Иначе //не добавляем
				Добавить = Ложь;
			КонецЕсли;
			Если Добавить Тогда
				СтрокаСвойств = СтрокаСвойств + ?(ПустаяСтрока(СтрокаСвойств),"",Символы.ПС)
				 + СокрЛП(СтрокаТаблицыСвойств.Свойство) + ": " + СокрЛП(СтрокаТаблицыСвойств.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаСвойств;
КонецФункции // дкПолучитьСтрокуСвойствДокумента()

// Функция получения суммы списания документа.
//
// Параметры:
// Документ 	 - текущий документ. Тип: ДокументОбъект. Обязательный для заполнения.
// ИмяРегистра - имя регистра накопления, по которому получается сумма. Тип - Строка.
//     Обязательный для заполнения.
// Номенклатура - номенклатура или актив в разрезе которой получается сумма.
// ХарактеристикаНоменклатуры - характеристика номенклатуры в разрезе которой получается сумма.
//     Тип: СправочникСсылка.ХарактеристикиНоменклатуры. Не обязательный
//     для заполнения.
// КэшТаблица - таблица значений, в которой кэшируются данные. Тип: ТаблицаЗначений.
//     Не обязательный для заполнения. Если не заполнено, данные каждый раз
//     будут читаться с регистра.
//
// Возвращаемое значение:
// Рассчитанная сумма списания. Тип: число;
//
Функция дкПолучитьСуммуСписания(Документ, ИмяРегистра, КэшТаблица = Неопределено, Номенклатура = Неопределено, ХарактеристикаНоменклатуры = Неопределено, НомерСтроки = Неопределено) Экспорт
//Функция дкПолучитьСуммуСписания(Документ, ИмяРегистра, Номенклатура = Неопределено, ХарактеристикаНоменклатуры = Неопределено, КэшТаблица = Неопределено) Экспорт
	Если Не Документ.Проведен Тогда
		Возврат 0;
	КонецЕсли;
	
	ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Неопределено;
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	Если Метаданные.РегистрыНакопления[ИмяРегистра].Ресурсы.Найти("БалансоваяСтоимость") <> Неопределено Тогда
		ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Истина;
		ИменаРесурсовСумм = "БалансоваяСтоимость,БалансоваяСтоимостьУпр";
		Если Документ.ВалютаДокумента = ВалютаРегл Тогда
			ИмяРесурса = "БалансоваяСтоимость";
			ТребуетсяПересчет = Ложь;
		ИначеЕсли Документ.ВалютаДокумента = ВалютаУпр Тогда
			ИмяРесурса = "БалансоваяСтоимостьУпр"; 
			ТребуетсяПересчет = Ложь;
		Иначе
			ИмяРесурса = "БалансоваяСтоимостьУпр";
			ТребуетсяПересчет = Истина;
		КонецЕсли;
	Иначе
		ИспользоватьРегистрПрочиеАктивыВЭксплуатации = Ложь;
		ИменаРесурсовСумм = "Сумма,СуммаУпр";
		Если Документ.ВалютаДокумента = ВалютаРегл Тогда
			ИмяРесурса = "Сумма"; ТребуетсяПересчет = Ложь;
		ИначеЕсли Документ.ВалютаДокумента = ВалютаУпр Тогда
			ИмяРесурса = "СуммаУпр"; ТребуетсяПересчет = Ложь;
		Иначе
			ИмяРесурса = "СуммаУпр"; ТребуетсяПересчет = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	Если ТребуетсяПересчет Тогда
		Попытка
			КурсВалютыУпр = Документ.КурсВалютыУпр;
		Исключение
			КурсВалютыУпр = 0;
		КонецПопытки;
		Если обЗначениеНеЗаполнено(КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,Документ.Дата);
			КурсУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр = КурсВалютыУпр; 
		КонецЕсли; 
	КонецЕсли; 
	
	СуммаРезультат = 0;
	Отбор = Новый Структура;
	
	Если ИспользоватьРегистрПрочиеАктивыВЭксплуатации Тогда
	    // регистры "ПрочиеАктивыВЭксплуатации"
		Если КэшТаблица = Неопределено Тогда
			СтрокаСгруппировать = "ВидДвижения";
			Если Метаданные.РегистрыНакопления[ИмяРегистра].Измерения.Найти("Номенклатура") <> Неопределено Тогда
				СтрокаСгруппировать = СтрокаСгруппировать + ",Номенклатура";
				Если Метаданные.РегистрыНакопления[ИмяРегистра].Измерения.Найти("ХарактеристикаНоменклатуры") <> Неопределено Тогда
					СтрокаСгруппировать = СтрокаСгруппировать + ",ХарактеристикаНоменклатуры";
				КонецЕсли;	
			ИначеЕсли Метаданные.РегистрыНакопления[ИмяРегистра].Измерения.Найти("ПрочийАктив") <> Неопределено Тогда
				СтрокаСгруппировать = СтрокаСгруппировать + ",ПрочийАктив";
			КонецЕсли;	
			
			Если Документ.Движения[ИмяРегистра].Количество() = 0 Тогда
				НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение = Документ.Ссылка; НаборЗаписей.Отбор.Регистратор.Использование = Истина;
				НаборЗаписей.Прочитать();
			Иначе
				НаборЗаписей = Документ.Движения[ИмяРегистра];
			КонецЕсли;
			
			КэшТаблица = НаборЗаписей.Выгрузить();
			КэшТаблица.Свернуть(СтрокаСгруппировать,ИменаРесурсовСумм);
			СтуктураОтбора = Новый Структура("ВидДвижения",ВидДвиженияНакопления.Приход);
			МассивНайденныхСтрок = КэшТаблица.НайтиСтроки(СтуктураОтбора);
			Для Сч = 0 По МассивНайденныхСтрок.ВГраница() Цикл
				КэшТаблица.Удалить(МассивНайденныхСтрок[Сч]);
			КонецЦикла;
			СтрокаСгруппировать = СтрЗаменить(СтрокаСгруппировать,"ВидДвижения,","");
			СтрокаСгруппировать = СтрЗаменить(СтрокаСгруппировать,"ВидДвижения","");
			КэшТаблица.Свернуть(СтрокаСгруппировать,ИменаРесурсовСумм);
		КонецЕсли;
		
		СуммаРезультат = 0;
		Отбор = Новый Структура;
		Если Не обЗначениеНеЗаполнено(Номенклатура) Тогда
			Если КэшТаблица.Колонки.Найти("Номенклатура") <> Неопределено Тогда
				Отбор.Вставить("Номенклатура", Номенклатура);
			ИначеЕсли КэшТаблица.Колонки.Найти("ПрочийАктив") <> Неопределено Тогда
				Отбор.Вставить("ПрочийАктив", Номенклатура);
			КонецЕсли; 
		КонецЕсли;	
		Если Не обЗначениеНеЗаполнено(ХарактеристикаНоменклатуры) Тогда
			Отбор.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		 Если Отбор.Количество() > 0 Тогда
			МассивСумм = КэшТаблица.НайтиСтроки(Отбор);
			Если МассивСумм.Количество() > 0 Тогда
				СуммаРезультат = 0;
				Для Каждого СтрМассивСумм Из МассивСумм Цикл
					СуммаРезультат = СуммаРезультат + СтрМассивСумм[ИмяРесурса];
				КонецЦикла;
			КонецЕсли;
		Иначе
			СуммаРезультат = КэшТаблица.Итог(ИмяРесурса);
		КонецЕсли;
		
	Иначе
	    // регистры "ПартииТоваровОтданные", "ПартииТоваровКомпании"
		Если КэшТаблица = Неопределено Тогда
			КэшТаблица = дкПолучитьТаблицуСуммСписания(Документ.Ссылка, Истина, ИмяРегистра, Новый Структура(ИмяРесурса), ВидДвиженияНакопления.Расход, , , , Истина);
		КонецЕсли;
		
		//если изменилась валюта документа, могло поменяться имя ресурса суммы (Сумма, СуммаУпр)
		//в этом случае нужно обновить кэш
		Если КэшТаблица <> Неопределено И КэшТаблица.Количество() > 0 Тогда
			Попытка 
				Результат = КэшТаблица[0][ИмяРесурса];
			Исключение 
				КэшТаблица = дкПолучитьТаблицуСуммСписания(Документ.Ссылка, Истина, ИмяРегистра, Новый Структура(ИмяРесурса), ВидДвиженияНакопления.Расход, , , , Истина);
			КонецПопытки;
		КонецЕсли;
		
		Если НомерСтроки <> Неопределено Тогда
			Отбор.Вставить("НомерСтроки", НомерСтроки);
		КонецЕсли;

		Если Отбор.Количество() > 0 Тогда
			МассивСумм = КэшТаблица.НайтиСтроки(Отбор);
			Если МассивСумм.Количество() > 0 Тогда
				СуммаРезультат = 0;
				Для Каждого СтрМассивСумм Из МассивСумм Цикл
					СуммаРезультат = СуммаРезультат + СтрМассивСумм[ИмяРесурса];
				КонецЦикла;
			КонецЕсли;
		Иначе
			СуммаРезультат = КэшТаблица.Итог(ИмяРесурса);
		КонецЕсли;		
		
	КонецЕсли;
	
	Если ТребуетсяПересчет Тогда
		СуммаРезультат = обПересчет(СуммаРезультат, ВалютаУпр, КурсУпр, Документ.ВалютаДокумента, Документ.КурсДокумента);
	КонецЕсли; 
	
	Возврат СуммаРезультат;		
		
КонецФункции // дкПолучитьСуммуСписания()

// накапливает сообщения об ошибках в переменной "РезультатОбработки", объекта.
// Сообщение - Строка. Само сообщение. 
// СтатусСообщения - Строка. Формата "СтатусСообщения&Группировка". 
//		СтатусСообщения - строка совпадающая с глобальным перечислением "СтатусыСообщения"
//  Группировка - некоторая строковая группировка сообщений
// Объект - сам объект.
// ОбъектДетализации - ссылка на некий объект для дополнительной детализации сообщения
// Возвращает накопленное сообщение
//
Функция дкСообщитьРезультат(Сообщение, СтатусСообщения = "Важное", Объект = Неопределено, ОбъектДетализации = Неопределено) Экспорт
	Если Объект = Неопределено Тогда
		// в очень редких случаях, объект может быть неопределен
		// возвращаем то, что пришло
		Возврат Сообщение;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("Строка") Тогда
		Если ПустаяСтрока(Объект) Тогда
			Объект = Сообщение;
		Иначе
			Объект = Объект + "
			|" + Сообщение;
		КонецЕсли;
		Возврат Объект;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ОбработкаОбъект.ИнформационноеПоле") Тогда                                                 
		Объект.ДобавитьСтрокуСообщения(Сообщение, СтатусСообщения, Неопределено, Неопределено);
		
	ИначеЕсли ТипЗнч(Объект.РезультатОбработки) = Тип("Строка") Тогда
		Если ПустаяСтрока(Объект.РезультатОбработки) Тогда
			Объект.РезультатОбработки = Сообщение;
		Иначе
			Объект.РезультатОбработки = Объект.РезультатОбработки + "
			|" + Сообщение;
		КонецЕсли;
		Возврат Объект.РезультатОбработки;
		
	Иначе
		Объект.РезультатОбработки.ДобавитьСтрокуСообщения(Сообщение, СтатусСообщения, Объект, ОбъектДетализации);
	КонецЕсли;
КонецФункции // дкСообщитьРезультат()

// Производит обновление структуры файла, который хранит данные автосохранения
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
//
Процедура ОбновитьСтруктуруФайла(ЭтаФорма)
	// по праву
	Если НЕ обПраво("АвтоСохранениеДокументов",ЭтаФорма.Права,,ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	// получим объект и вид документ
	ДокументОбъект = ЭтаФорма.ЭтотОбъект;
	ВидДокумента = ДокументОбъект.Метаданные().Имя;
	
	Если Метаданные.Документы.Найти(ВидДокумента) = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	// получим коллекции реквизитов шапки и табличных частей документа
	ДокументРеквизитыШапки = Метаданные.Документы[ВидДокумента].Реквизиты;
	ДокументТабличныеЧасти = Метаданные.Документы[ВидДокумента].ТабличныеЧасти;
	
	// сформируем структуру файла
	СтруктураФайла = Новый Структура();
	//вид документа
	СтруктураФайла.Вставить("ВидДокумента", ВидДокумента);
	//номер и дата документа
	СтруктураФайла.Вставить("Номер", ДокументОбъект.Номер);
	СтруктураФайла.Вставить("Дата", ДокументОбъект.Дата);
	Если Не ДокументОбъект.Ссылка.Пустая() Тогда
		СтруктураФайла.Вставить("Ссылка", ЗначениеВСтрокуВнутр(ДокументОбъект.Ссылка));
	КонецЕсли;
	//реквизиты шапки
	Для каждого ТекРеквизитШапки Из ДокументРеквизитыШапки Цикл
		СтруктураФайла.Вставить(ТекРеквизитШапки.Имя, ДокументОбъект[ТекРеквизитШапки.Имя]);
	КонецЦикла;
	//реквизиты табличных частей
	Для каждого ТекТабличнаяЧасть Из ДокументТабличныеЧасти Цикл
		СтруктураФайла.Вставить(ТекТабличнаяЧасть.Имя, ДокументОбъект[ТекТабличнаяЧасть.Имя].Выгрузить());
	КонецЦикла;
	
	//Компьютер = Справочники.Компьютеры.НайтиПоНаименованию(ИмяКомпьютера(), Истина);
	Компьютер = ПараметрыСеанса.Компьютер;
	GUIDКонфигурации = СтрЗаменить(Сред(ЗначениеВСтрокуВнутр(Метаданные), 6, 36), "-", "");
	Попытка
		ЗначениеВФайл(Компьютер.ЛокальныйКаталог + "\" + GUIDКонфигурации + "_" + СокрЛП(ВидДокумента) + "_" + ДокументОбъект.Номер + "_" + Формат(ДокументОбъект.Дата, "ДФ = ддММгггг") + "_" + СокрЛП(ПараметрыСеанса.Пользователь.Код) + ".dct", СтруктураФайла);
	Исключение
		Сообщить("Ошибка записи в файл: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры // ОбновитьСтруктуруФайла()

// Производит списание разницы сумм активной и пассивной части движений документа,
// возникшей в результате округления.
//
// Параметры:
// ОбъектДокумент – "ОбъектДокумент" - Документ.
//
// Возвращаемое значение:
// Истина - если списание успешно произведено, в противном случае - Ложь.
// 
Функция дкСписаниеКопейкиПриОкругленииВалютныхСчетов(ОбъектДокумент) Экспорт
	
	// Определяем способ ведения баланса
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить() = Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// Создаем таблицу значений, в которой будет происходит накопление сумм.
	ТаблицаАктивовИПассивов = Новый ТаблицаЗначений;
	ТаблицаАктивовИПассивов.Колонки.Добавить("ПодразделениеКомпании", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаАктивовИПассивов.Колонки.Добавить("СуммаАктива", 		  Новый ОписаниеТипов("Число"));
	ТаблицаАктивовИПассивов.Колонки.Добавить("СуммаПассива",   		  Новый ОписаниеТипов("Число"));
	
	// 1. Взаиморасчеты.
	// Движения вида "Расход" образуют пассивную часть, "Приход" - активную часть.
	Попытка
		СуммаВзаиморасчетовИтого = 0;
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ВзаиморасчетыКомпании Цикл 	
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;				
			Иначе
				НоваяСтрока.СуммаПассива = ТекДвижение.СуммаУпр;
			КонецЕсли;
		КонецЦикла;		
	Исключение
	КонецПопытки;
	
	// 2. Партии товаров компании
	// Партии являются активом. Отрицательное значение остатка по этому регистру - ошибочное состояние.
	// Особенность: учитываются только партии, имеющие статус "ТоварКупленный".
	Попытка
		СуммаПартийТоваровКомпанииИтого = 0;
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ПартииТоваровКомпании Цикл 	
			Если ТекДвижение.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СкладКомпании.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
				Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;					
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр; 
				КонецЕсли; 				
			КонецЕсли;
		КонецЦикла; 			
	Исключение
	КонецПопытки;
	
	// 3. Доходы и расходы.
	// Ресурс "Расходы" отражает активную часть, "Доход" - пассивную часть.
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ДоходыИРасходы Цикл 	
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива  = ТекДвижение.РасходУпр;
				НоваяСтрока.СуммаПассива = ТекДвижение.ДоходУпр;
			Иначе
				НоваяСтрока.СуммаАктива  = - ТекДвижение.РасходУпр;
				НоваяСтрока.СуммаПассива = - ТекДвижение.ДоходУпр;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	// 4. Денежные средства компании.
	// Является активом. Движени вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ДенежныеСредстваКомпании Цикл 	
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СтруктурнаяЕдиница.Подразделение, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива  = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаАктива  = - ТекДвижение.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	// 5. Касса ККМ.
	// Является активом. Движени вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	// Особенность: неоходимо учитывать "способ оплаты". Только способы "Наличными" и "Безналичными" 
	// учитываются в балансе.
	Попытка
		СпособОплатыНаличными = Перечисления.ТипыОплатыВРознице.Наличные;
		СпособОплатыБезНаличными = Перечисления.ТипыОплатыВРознице.Безналичные;
		
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.КассыККМ Цикл 	
			Если (ТекДвижение.СпособОплаты.Объект = СпособОплатыНаличными) Или (ТекДвижение.СпособОплаты.Объект = СпособОплатыБезНаличными) Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.КассаККМ.Подразделение, ОбъектДокумент.ПодразделениеКомпании);			
				Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива  = ТекДвижение.СуммаУпр;
				Иначе
					НоваяСтрока.СуммаАктива  = -ТекДвижение.СуммаУпр;
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	// 6. Партии товаров отданные.
	// Является активом. Движени вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	// Особенность: ресурсом, влияющих на баланс является "СуммаСебестоимостиУпр"
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ПартииТоваровОтданные Цикл			
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.Подразделение, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива  = ТекДвижение.СуммаСебестоимостиУпр;
			Иначе
				НоваяСтрока.СуммаАктива  = - ТекДвижение.СуммаСебестоимостиУпр;
			КонецЕсли; 			
		КонецЦикла;
	Исключение
	КонецПопытки; 	
	
	// 7. Реализованные товары.
	// Является пассивом. Движени вида "Приход" увеличивают пассив, "Расход" - актив уменьшают.
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.РеализованныеТовары Цикл			
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.Подразделение, ОбъектДокумент.ПодразделениеКомпании);			
			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаПассива = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаПассива = - ТекДвижение.СуммаУпр;
			КонецЕсли; 			
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	// 8. Прочие активы в эксплуатации.
	// Является активом. Движени вида "Приход" увеличивают пассив, "Расход" - актив уменьшают.
	// Особенность: показателем, влияющим на баланс является разница ресурсов 
	// (БалансоваяСтоимостьУпрПриход-СуммаАмортизацииУпрПриход)
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ПрочиеАктивыВЭксплуатации Цикл			
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			
			ОстаточнаяСтоимость = ТекДвижение.БалансоваяСтоимостьУпр - ТекДвижение.СуммаАмортизацииУпр;
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива  = ОстаточнаяСтоимость;
			Иначе
				НоваяСтрока.СуммаАктива  = - ОстаточнаяСтоимость;
			КонецЕсли; 			
		КонецЦикла;
	Исключение
	КонецПопытки;

	//////////////////////////////////////////////////
	//Начало секции Альфа-Авто:Автосервис+Автозапчасти
	//////////////////////////////////////////////////
	
	// 9. Товары компании в производстве
	// Партионный регистр является активом. Отрицательное значение остатка по этому регистру - ошибочное состояние.
	// Особенность: учитываются только партии, имеющие статус "ТоварКупленный".
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ТоварыВПроизводстве Цикл  	
			Если ТекДвижение.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.Цех.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
				Если ТекДвижение.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр;
				КонецЕсли; 				
			КонецЕсли;
		КонецЦикла; 			
	Исключение
	КонецПопытки;
	
	/////////////////////////////////////////////////
	//Конец секции Альфа-Авто:Автосервис+Автозапчасти
	/////////////////////////////////////////////////
	
	////////////////////////////////////////////////////////////
	//Начало секции Альфа-Авто:Автосалон+Автосервис+Автозапчасти
	////////////////////////////////////////////////////////////
	
	// 10. Остатки автомобилей
	// Автомобили являются активом. Отрицательное значение остатка по этому регистру - ошибочное состояние.
	// Особенность: учитываются только партии, имеющие статус "ТоварКупленный".
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.ОстаткиАвтомобилей Цикл  	
			Если ТекДвижение.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СкладКомпании.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
				Если ТекДвижение.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;					
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр;  
				КонецЕсли; 				
			КонецЕсли;
		КонецЦикла; 			
	Исключение
	КонецПопытки;
	
	// 11. Комплектация автомобилей
	// Комплектация автомобилей являются активом. Отрицательное значение остатка по этому регистру - ошибочное состояние.
	// Особенность: учитываются только партии, имеющие статус "ТоварКупленный".
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.КомплектацияАвтомобилей Цикл  	
			Если ТекДвижение.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СкладКомпании.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
				Если ТекДвижение.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;					
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр;  
				КонецЕсли; 				
			КонецЕсли;
		КонецЦикла; 			
	Исключение
	КонецПопытки;
	
	// 12. Автомобили отданные
	// Является активом. Движени вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	// Особенность: ресурсом, влияющих на баланс является "СуммаСебестоимостиУпр"
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.АвтомобилиОтданные Цикл			
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.Подразделение, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ТекДвижение.СуммаСебестоимостиУпр;
			Иначе
				НоваяСтрока.СуммаАктива = - ТекДвижение.СуммаСебестоимостиУпр;
			КонецЕсли;  			
		КонецЦикла;
	Исключение
	КонецПопытки;  	
	
	// 13. Реализованные автомобили
	// Является пассивом. Движени вида "Приход" увеличивают пассив, "Расход" - актив уменьшают.
	Попытка
		Для каждого ТекДвижение Из ОбъектДокумент.Движения.РеализованныеАвтомобили Цикл			
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.Подразделение, ОбъектДокумент.ПодразделениеКомпании);
			Если ТекДвижение.ВидДвижения=ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаПассива = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаПассива = - ТекДвижение.СуммаУпр;
			КонецЕсли;  			
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	///////////////////////////////////////////////////////////
	//Конец секции Альфа-Авто:Автосалон+Автосервис+Автозапчасти
	///////////////////////////////////////////////////////////
	
	Результат = Истина;
	
	// Сворачиваем таблицу.
	ТаблицаАктивовИПассивов.Свернуть("ПодразделениеКомпании", "СуммаАктива, СуммаПассива"); 
	
	// Если баланс ведется по подразделениям, то необходимо еще раз пройти таблицу и заменить подразделения, на 
	// соответствующие им балансовые подразделения.	
	Если БалансВедетсяПоПодразделениям Тогда
		Для каждого ТекСтрока Из ТаблицаАктивовИПассивов Цикл 	
			ТекСтрока.ПодразделениеКомпании = обПолучитьБалансовоеПодразделение(ТекСтрока.ПодразделениеКомпании);	
		КонецЦикла;
		
		// Повторно сворачиваем таблицу.
		ТаблицаАктивовИПассивов.Свернуть("ПодразделениеКомпании", "СуммаАктива, СуммаПассива"); 
	КонецЕсли; 	   
	
	Для каждого ТекСтрока Из ТаблицаАктивовИПассивов Цикл 	
		
		// Сравниваем Пассив и Актив.
		Разница = ТекСтрока.СуммаАктива - ТекСтрока.СуммаПассива;
		
		Если (Разница > - 1) И (Разница < 1) Тогда
			НаборЗаписейДиР = ОбъектДокумент.Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект   = ОбъектДокумент;
			НаборЗаписейДиР.Подразделение    = ТекСтрока.ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КопейкиОтОкругленияПриПересчетах;
			НаборЗаписейДиР.ВУпрВалюте		 = Истина;
			Если Разница > 0 Тогда
				// Необходимо увеличить пассив.
				НаборЗаписейДиР.Доход = Разница;
			Иначе
				// Необходимо увеличить актив.
				НаборЗаписейДиР.Расход = -Разница; 
			КонецЕсли;
			
			Результат = Результат и НаборЗаписейДиР.Приход();		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции // дкСписаниеКопейкиПриОкругленииВалютныхСчетов() 

// удаляет движения документа по тем регистрам, по которым действительно были движения
Процедура дкУдалениеДвиженийДокумента(ДокументОбъект) Экспорт
	// новые не чистим
	Если ДокументОбъект.Движения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// чистим движения
	ТекстЗапроса = "";	
	Для Каждого Движение Из ДокументОбъект.Движения Цикл
		
		ДвижениеМетаданные = Движение.Метаданные();
		ИмяРегистра  = ДвижениеМетаданные.Имя;
		
		Если ИмяРегистра = "СостоянияДокументов" Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьРегистра = ДвижениеМетаданные.ПолноеИмя();
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + ИмяРегистра + """ КАК ИмяРегистра ИЗ " + ПутьРегистра + " ГДЕ Регистратор = &Ссылка
		|";
		
	КонецЦикла;
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос = Новый Запрос("//" + ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Движение = ДокументОбъект.Движения[Выборка.ИмяРегистра];
			Движение.Очистить();
			Движение.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#Если Клиент Тогда
// Процедура управляет доступностью колонок табличной части документов отгрузки, отвечающих за скидки.
	//
	// Параметры
	// ЭтаФорма – < Форма > – Форма текущего документа.
	//     
	// ТекущаяСкидкаШапки – < СправочникСсылка.ТипыСкидок > – Текущая скидка шапки документа.
	// 
	// ИмяТабличнойЧасти – < Текст > – Имя табличной части, доступность колонок которой необходимо определить.
	//
	// Возвращаемое значение:
	// НЕТ
	// 	
Процедура дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма, ТекущаяСкидкаШапки, ИмяТабличнойЧасти = "Товар") Экспорт
	
	Попытка
		// кэшируем доступности к колонкам ТЧ
		Если ТипЗнч(ЭтаФорма.СтруктураДоступностиКолонокТЧ) <> Тип("Структура") Тогда
			ЭтаФорма.СтруктураДоступностиКолонокТЧ = Новый Структура();
		КонецЕсли;
	Исключение
	КонецПопытки; 
	
	Если ЭтаФорма.ЭлементыФормы.Найти(ИмяТабличнойЧасти)=Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СпособВыбораСкидки = обПраво("СпособВыбораСкидки",ЭтаФорма.Права,,ЭтаФорма);
	
	РедактированиеСкидокРазрешено = Истина;
	РедактированиеСкидокРазрешено = (СпособВыбораСкидки = Перечисления.СкидкиСпособыВыбора.РучныеСкидкиИРедактированиеПроцентов);
	РедактированиеСкидокРазрешено = РедактированиеСкидокРазрешено И (Не ТекущаяСкидкаШапки.Пустая()) И (ТекущаяСкидкаШапки.РучнаяСкидка);
	РедактированиеСкидокРазрешено = РедактированиеСкидокРазрешено И (ТекущаяСкидкаШапки.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная);
	
	КолонкиТЧ = ЭтаФорма.ЭлементыФормы[ИмяТабличнойЧасти].Колонки;
	
	Попытка
		КолонкиТЧ.ПроцентСкидки.ТолькоПросмотр = Не РедактированиеСкидокРазрешено;			
	Исключение
	КонецПопытки; 
	Попытка
		КолонкиТЧ.СуммаСкидки.ТолькоПросмотр = Не РедактированиеСкидокРазрешено;			
	Исключение
	КонецПопытки;
	
	Если (Не ТекущаяСкидкаШапки.Пустая()) И (ТекущаяСкидкаШапки.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная) Тогда
		КолонкиТЧ.СуммаВсего.ТолькоПросмотр = Истина;		
	Иначе
		КолонкиТЧ.СуммаВсего.ТолькоПросмотр = Ложь;	
	КонецЕсли;
	
	// Теперь доступность редактирования колонок, отвечающих за строчные скидки.
	РедактированиеСкидкиСтрокиРазрешено = (СпособВыбораСкидки <> Перечисления.СкидкиСпособыВыбора.СкидкиЗапрещены
	И СпособВыбораСкидки <> Перечисления.СкидкиСпособыВыбора.АвтоматическиеСкидки); 		
	
	РедактированиеЗначенияСкидкиСтрокиРазрешено = (СпособВыбораСкидки = Перечисления.СкидкиСпособыВыбора.РучныеСкидкиИРедактированиеПроцентов);
	
	Попытка
		КолонкиТЧ.СкидкаНаТовар.ТолькоПросмотр  	 = Не РедактированиеСкидкиСтрокиРазрешено;	
		КолонкиТЧ.ПроцентСкидкиСтроки.ТолькоПросмотр = Не РедактированиеЗначенияСкидкиСтрокиРазрешено;
		КолонкиТЧ.СуммаСкидкиСтроки.ТолькоПросмотр 	 = Не РедактированиеЗначенияСкидкиСтрокиРазрешено;
	Исключение КонецПопытки;
	
	Попытка
		СтруктураДоступностиКолонокТЧ = Новый Структура();
		СтруктураКолонокТЧ = Новый Структура("ПроцентСкидки, СуммаСкидки, СуммаВсего, СкидкаНаТовар, ПроцентСкидкиСтроки, СуммаСкидкиСтроки");
		Для Каждого ТекЭлемент Из СтруктураКолонокТЧ Цикл
			ТекКолонка = КолонкиТЧ.Найти(ТекЭлемент.Ключ);
			Если ТекКолонка <> Неопределено Тогда
				СтруктураДоступностиКолонокТЧ.Вставить(ТекЭлемент.Ключ, ТекКолонка.ТолькоПросмотр);
			КонецЕсли;
		КонецЦикла;
		ЭтаФорма.СтруктураДоступностиКолонокТЧ.Вставить(ИмяТабличнойЧасти, СтруктураДоступностиКолонокТЧ);
	Исключение КонецПопытки;
	
КонецПроцедуры // дкУправлениеДоступностьюКолонокСкидок()
#КонецЕсли

// Функция для получения сумм списания, по регистрам в разрезе уникальных реквизитов табличной части документа.
//
// Параметры
// Ссылка < ссылка документа >					– ссылка на документ.
// ЕстьПартия < булево >						- учитывать партии.
// ИмяРегистра < Текст >						– имя регистра движений.
// ИспользуемыеРесурсы < Структура >			– Список ресурсов регистра, которые необходимо рассчитать.
// ВидДвиженияПриход < ВидДвиженияНакопления >	– Вид движения регистра(Приход/Расход).
// ТекстЗапроса < Текст > 						– если требуется нестандартный текст запроса для получения данных из документа.
// ТекстОтбора < Текст > 						– Текст отбора для регистра.
// ПараметрыОтбора < Структура > 				– Описание дополнительных отборов для регистра.
// 
// Возвращаемое значение < ТаблицаЗначений >	- таблица сумм списания
// 	
Функция дкПолучитьТаблицуСуммСписания(Ссылка, ЕстьПартия = Истина, 
	ИмяРегистра = "ПартииТоваровКомпании", ИспользуемыеРесурсы = Неопределено, 
	ВидДвиженияПриход = Неопределено, ТекстЗапроса = "", ТекстОтбора="", ПараметрыОтбора=Неопределено, ДобавлятьНомерСтроки = Ложь) Экспорт
	
	Если Ссылка.Пустая() Тогда
		//если документ еще не записан - никаких сумм списания еще нет
		//в документах дальше выполняется свертка - поэтому нужны соответствующие колонки
		//возвращаем в документы пустую таблицу, создав нужные колонки
		ПустаяТЗ = Новый ТаблицаЗначений;
		ПустаяТЗ.Колонки.Добавить("Номенклатура");
		ПустаяТЗ.Колонки.Добавить("ЕдиницаИзмерения");
		ПустаяТЗ.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ПустаяТЗ.Колонки.Добавить("СтавкаНДС");
		ПустаяТЗ.Колонки.Добавить("Количество");
		ПустаяТЗ.Колонки.Добавить("КоличествоБазовое");
		ПустаяТЗ.Колонки.Добавить("Сумма");
		ПустаяТЗ.Колонки.Добавить("СуммаНДС");
		ПустаяТЗ.Колонки.Добавить("СуммаУпр");
		ПустаяТЗ.Колонки.Добавить("СуммаРозн");
		Возврат ПустаяТЗ;
	КонецЕсли;
	
	Если ИспользуемыеРесурсы = Неопределено Тогда
		ИспользуемыеРесурсы = Новый Структура("Сумма" + ?(ИмяРегистра = "ОстаткиТоваровКомпании","Розн",""));
	КонецЕсли;
	
	Если ВидДвиженияПриход = Неопределено Тогда
		ВидДвиженияПриход = ВидДвиженияНакопления.Расход;
	КонецЕсли;
	
	Если ПараметрыОтбора=Неопределено Тогда
		ПараметрыОтбора = Новый Структура;
	КонецЕсли;
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	СтруктураОбязательныхРеквизитов = ДокументОбъект.ПолучитьОбязательныеРеквизиты();
	
	МетаДанныеДокумента = ДокументОбъект.Метаданные();
	ПоБазовомуКоличеству = МетаДанныеДокумента.ТабличныеЧасти.Товары.Реквизиты.Найти("КоличествоБазовое") <> Неопределено;
	
	СтрокаВыборкиКолонок = "";
	СтрокаГруппировокКолонок = "";
	СтрокаПорядкаКолонок = "";
	УчитыватьПартии = Ложь;
	Для Каждого Реквизит Из СтруктураОбязательныхРеквизитов Цикл
		Если (Реквизит.Ключ = "Товары") И ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда
			Для Каждого ТекКолонка Из Реквизит.Значение Цикл
				Если ТекКолонка.Ключ = "Количество" Тогда
					Продолжить;
				КонецЕсли;
				Если ТекКолонка.Значение = 1 ИЛИ ТекКолонка.Значение = 3 ИЛИ (ТекКолонка.Ключ = "ХарактеристикаНоменклатуры") Тогда
					СтрокаВыборкиКолонок = СтрокаВыборкиКолонок + Символы.ПС + "ДокТовары." + ТекКолонка.Ключ + " КАК " + ТекКолонка.Ключ + ",";
					СтрокаГруппировокКолонок = СтрокаГруппировокКолонок + ?(СтрокаГруппировокКолонок = "", "", ",") + Символы.ПС + "ДокТовары." + ТекКолонка.Ключ;
					Если ТекКолонка.Ключ = "Партия" Тогда
						УчитыватьПартии = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	СтрокаГруппировокКолонок = СтрокаГруппировокКолонок;
	
	Если ДобавлятьНомерСтроки Тогда
		СтрокаВыборкиКолонок = СтрокаВыборкиКолонок + Символы.ПС  + "ДокТовары.НомерСтроки КАК НомерСтроки,";
		СтрокаГруппировокКолонок = СтрокаГруппировокКолонок + ?(СтрокаГруппировокКолонок = "", "", ",") + Символы.ПС  + "ДокТовары.НомерСтроки";		
	КонецЕсли;
	
	УчитыватьПартии = Мин(ЕстьПартия, УчитыватьПартии);
	
	СтрокаСуммСписанияРегистра = "";
	Для Каждого ТекРесурс Из ИспользуемыеРесурсы Цикл
		СтрокаСуммСписанияРегистра = СтрокаСуммСписанияРегистра + "," + Символы.ПС + "	РегистрОстатков." + ТекРесурс.Ключ + " КАК " + ТекРесурс.Ключ;
		СтрокаВыборкиКолонок = СтрокаВыборкиКолонок + Символы.ПС + "	ВЫРАЗИТЬ(0 КАК Число(15,2)) КАК " + ТекРесурс.Ключ + ",";
		ИспользуемыеРесурсы.Вставить(ТекРесурс.Ключ, 0);
	КонецЦикла;
	
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		// Получим таблицу товаров Документа
		ТекстЗапроса = "ВЫБРАТЬ " + СтрокаВыборкиКолонок + "
		|	СУММА(ДокТовары.Количество) КАК Количество,
		|	СУММА(ДокТовары.Количество" + ?(ПоБазовомуКоличеству, "Базовое","*ДокТовары.Коэффициент") + ") КАК КоличествоБазовое 
		|ИЗ
		|	Документ." + МетаДанныеДокумента.Имя + ".Товары КАК ДокТовары
		|ГДЕ
		|	ДокТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО " + СтрокаГруппировокКолонок;
	КонецЕсли;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	ТаблицаТоваровДокумента = Запрос.Выполнить().Выгрузить();
	ТаблицаТоваровДокумента.Сортировать("Номенклатура Возр,ХарактеристикаНоменклатуры Убыв" + ?(УчитыватьПартии,",Партия Убыв",""));
	
	Для Каждого ТекОтбор Из ПараметрыОтбора Цикл
		Запрос.УстановитьПараметр("Выб"+ТекОтбор.Ключ, ТекОтбор.Значение);
	КонецЦикла;
	
	// Получим таблицу движений списания по документу
	ТекстЗапроса = "ВЫБРАТЬ
	| РегистрОстатков.Номенклатура КАК Номенклатура,
	| РегистрОстатков.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	| " + ?(УчитыватьПартии, "РегистрОстатков.Партия КАК Партия,","") + "
	| РегистрОстатков.Количество КАК Количество " + СтрокаСуммСписанияРегистра + "
	|
	|ИЗ
	| РегистрНакопления." + ИмяРегистра + " КАК РегистрОстатков
	|ГДЕ РегистрОстатков.Регистратор = &ВыбРегистратор
	| И РегистрОстатков.ВидДвижения = &ВидДвиженияПриход 
	| "+?(ТекстОтбора="","","И ")+ТекстОтбора+"
	|УПОРЯДОЧИТЬ ПО
	|	РегистрОстатков.НомерСтроки";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбРегистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияПриход);
	ТаблицаДвиженийПоПартиям = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТабличнойЧасти Из ТаблицаТоваровДокумента Цикл
		
		Попытка
			СтруктураПоиска = Новый Структура("Номенклатура", СтрокаТабличнойЧасти.НоменклатураРасход);
			ИмяКоличество = "КоличествоРасход";
		Исключение
			СтруктураПоиска = Новый Структура("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
			ИмяКоличество = "КоличествоБазовое";
		КонецПопытки;
		
		Если УчитыватьПартии И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партия) Тогда
			СтруктураПоиска.Вставить("Партия", СтрокаТабличнойЧасти.Партия);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
			СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		СтрокиДвижений = ТаблицаДвиженийПоПартиям.НайтиСтроки(СтруктураПоиска);
		НужноеКоличество = СтрокаТабличнойЧасти[ИмяКоличество];
		Если НужноеКоличество = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекСтрока Из СтрокиДвижений Цикл
			Если ТекСтрока.Количество > НужноеКоличество Тогда
				Для Каждого ТекРесурс Из ИспользуемыеРесурсы Цикл
					//получим сумму списания
					СуммаСписания = Окр(ТекСтрока[ТекРесурс.Ключ] / ТекСтрока.Количество, 2, 1) * НужноеКоличество;
					СтрокаТабличнойЧасти[ТекРесурс.Ключ] = СтрокаТабличнойЧасти[ТекРесурс.Ключ] + СуммаСписания;
					ТекСтрока[ТекРесурс.Ключ] = ТекСтрока[ТекРесурс.Ключ] - СуммаСписания;
				КонецЦикла;
				ТекСтрока.Количество = ТекСтрока.Количество - НужноеКоличество;
				Прервать;
			Иначе
				Для Каждого ТекРесурс Из ИспользуемыеРесурсы Цикл
					СтрокаТабличнойЧасти[ТекРесурс.Ключ] = СтрокаТабличнойЧасти[ТекРесурс.Ключ] + ТекСтрока[ТекРесурс.Ключ];
				КонецЦикла;
				НужноеКоличество = НужноеКоличество - ТекСтрока.Количество;
				ТаблицаДвиженийПоПартиям.Удалить(ТекСтрока);
				Если НужноеКоличество = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаТоваровДокумента;
	
КонецФункции

// Из файла XML попытаемся извлечь нужные реквизиты и заполнить ими документ
// Параметры:
// ДокументОбъект		- Загружаемый документ
// ПараметрыИмени		- структура параметров шаблона:
//		.Объект			- пользователь
// 		.Идентификатор	- уникальное имя шаблона
Функция дкЗагрузитьРеквизитыДокументаИзШаблона(ДокументОбъект,ПараметрыИмени) Экспорт
	ОбъектXML = Новый ЧтениеXML;
	
	// сделаем в попытке, а вдруг уже удалили файл к этому времени
	Попытка
		Шаблон = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
		Шаблон.Объект = ПараметрыИмени.Объект;
		Шаблон.Идентификатор = ПараметрыИмени.Идентификатор;
		Шаблон.Прочитать();
		СтрокаXML = Шаблон.Данные.Получить();
		ОбъектXML.УстановитьСтроку(СтрокаXML);
	Исключение
		ОбъектXML.Закрыть();
		#Если Клиент Тогда
			Предупреждение("Ошибка чтения файла данных из строки регистра");
		#КонецЕсли
		Возврат Ложь;
	КонецПопытки;
	
	
	//Читаем файл последовательно в цикле, формируя полное имя (путь) для элемента
	ПолноеИмяУровня = "";
	
	РеквизитыШапки = Новый Структура();
	ТабличныеЧасти = Новый Структура();
	РеквизитыШапкиУзелОткрыт = Ложь;
	РеквизитыШапкиУзелЗакрыт = Ложь;
	ТабличныеЧастиУзелОткрыт = Ложь;
	ТабличныеЧастиУзелЗакрыт = Ложь;
	ИмяОткрытойТабличнойЧасти = "";
	
	Пока ОбъектXML.Прочитать() Цикл
		
		ТипУзла = ОбъектXML.ТипУзла;
		ИмяУзла = ОбъектXML.Имя;
		
		//Сначала определимся с реквизитами подлежащими загрузке
		
		// работаем только с началом элемента
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			// началась структура реквизитов
			Если ИмяУзла = "РеквизитыШапки" Тогда
				РеквизитыШапкиУзелОткрыт = Истина;
				ОбъектXML.Прочитать();
				ИмяУзла = ОбъектXML.Имя;
			ИначеЕсли ИмяУзла = "ТабличныеЧасти" Тогда
				ТабличныеЧастиУзелОткрыт = Истина;
				ОбъектXML.Прочитать();
				ИмяУзла = ОбъектXML.Имя;
			КонецЕсли;	
			
			Если РеквизитыШапкиУзелОткрыт Тогда
				РеквизитыШапки.Вставить(ИмяУзла);
			КонецЕсли;	
			
			Если ТабличныеЧастиУзелОткрыт И ИмяОткрытойТабличнойЧасти = "" Тогда
				ИмяОткрытойТабличнойЧасти = ИмяУзла;
				РеквизитыТабличнойЧасти = Новый Структура();
				ТабличныеЧасти.Вставить(ИмяУзла,РеквизитыТабличнойЧасти);
			ИначеЕсли ТабличныеЧастиУзелОткрыт И ИмяОткрытойТабличнойЧасти <> "" Тогда
				РеквизитыТабличнойЧасти.Вставить(ИмяУзла);
			КонецЕсли;	
			
			// посмотри а не наступило ли счастье в виде объекта
			Если ВозможностьЧтенияXML(ОбъектXML) Тогда
				// если наступило то загружаем его
				
				// Определим тип текущего объекта
				ТипЭлемента = ИзXMLТипа(ПолучитьXMLТип(ОбъектXML));
				
				// Определим объект метаданных к которому относится загружаемый тип
				МетаданныеЭлемента = Метаданные.НайтиПоТипу(ТипЭлемента);
				
				// Определим менеджер загружаемого объекта
				ИмяМенеджера = СтрЗаменить(МетаданныеЭлемента.ПолноеИмя(), "." + МетаданныеЭлемента.Имя, "");
				ИмяТаблицы	 = МетаданныеЭлемента.Имя;
				
				// Создадим документ
				Если ИмяМенеджера = "Документ" Тогда
					Если ДокументОбъект = Неопределено тогда
						ДокументОбъект = Новый (ТипЭлемента);
						ДокументОбъект = Документы[ДокументОбъект.Метаданные().Имя].СоздатьДокумент();
						// а вдруг шаблон другого вида чем шаблон
					ИначеЕсли НЕ ТипЗнч(ДокументОбъект) = ТипЭлемента Тогда
						Сообщить("Тип загружаемого документа не совпадает с типом выбранного шаблона");
						Возврат Ложь;
					КонецЕсли;	
					// Считываем данные текущего объекта
					Если НЕ ВыгрузкаЗагрузкаШаблоновПрочитатьДанныеУзла(ОбъектXML, ДокументОбъект, МетаданныеЭлемента,РеквизитыШапки, , ТабличныеЧасти) Тогда
						Возврат Ложь;
					КонецЕсли;	
				Иначе
					Сообщить("Встречен неизвестный тип объекта для шаблона");
				КонецЕсли;	
			КонецЕсли;
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если ИмяУзла = "РеквизитыШапки" Тогда
				РеквизитыШапкиУзелЗакрыт = Истина;
				РеквизитыШапкиУзелОткрыт = Ложь;
			ИначеЕсли ИмяУзла = "ТабличныеЧасти" Тогда
				ТабличныеЧастиУзелЗакрыт = Истина;	
				ТабличныеЧастиУзелОткрыт = Ложь; 
			КонецЕсли;					
			
			Если ТабличныеЧастиУзелОткрыт И ИмяУзла = ИмяОткрытойТабличнойЧасти Тогда
				ИмяОткрытойТабличнойЧасти = "";
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	ОбъектXML.Закрыть();
	
	Возврат Истина;
КонецФункции

// Формирует XML файл, схожий по структуре с форматом сериализованного объекта
// Параметры:
// ДокументДляВыгрузки 			- выгружаемый документ
// ПараметрыИмени					- структура параметров шаблона
//		.Объект						- пользователь
// 		.ИмяШаблона					- уникальное имя шаблона
//		.ХозОперация				- хозоперация
//		.СохранятьКакОбщийШаблон	- признак сохранения как общего шаблона
// СписокРеквизитов				- структура реквизитов для сохранения в шаблон
Процедура дкВыгрузитьРеквизитыДокументаВШаблон(ДокументДляВыгрузки,ПараметрыИмени,СписокРеквизитов) Экспорт
	УзелРеквизитыОткрыт 	 = Ложь;
	УзелТабличныеЧастиОткрыт = Ложь;
	УзелРеквизитыЗакрыт 	 = Ложь;
	УзелТабличныеЧастиЗакрыт = Ложь;
	
	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.УстановитьСтроку();
	ОбъектXML.ЗаписатьОбъявлениеXML();
	ОбъектXML.ЗаписатьНачалоЭлемента("ШаблонДокумента");
	ОбъектXML.ЗаписатьНачалоЭлемента("ВыгружаемыеРеквизиты");
	
	Для Каждого Строка Из СписокРеквизитов.Строки Цикл
		// посмотрим значение текущего элемента
		Если НЕ Строка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		// если есть подчиненные строки значит это табличная часть
		Если Строка.Строки.Количество() > 0 Тогда
			// закроем реквизитный узел
			Если УзелРеквизитыОткрыт Тогда
				ОбъектXML.ЗаписатьКонецЭлемента();
				УзелРеквизитыЗакрыт = Истина;
				УзелРеквизитыОткрыт = Ложь;
			КонецЕсли;	
			
			//открываем узел табличных частей
			Если Не УзелТабличныеЧастиОткрыт Тогда
				ОбъектXML.ЗаписатьНачалоЭлемента("ТабличныеЧасти");
				УзелТабличныеЧастиОткрыт = Истина;
			КонецЕсли;
			
			ИмяТабличнойЧасти = Строка.ИмяРеквизита;
			ОбъектXML.ЗаписатьНачалоЭлемента(ИмяТабличнойЧасти);
			Для Каждого СтрокаРеквизитовТабличнойЧасти Из Строка.Строки Цикл
				Если Не СтрокаРеквизитовТабличнойЧасти.Пометка Тогда
					Продолжить;
				КонецЕсли;	
				
				ИмяРеквизита = СтрокаРеквизитовТабличнойЧасти.ИмяРеквизита;
				ОбъектXML.ЗаписатьНачалоЭлемента(ИмяРеквизита);
				ОбъектXML.ЗаписатьКонецЭлемента();
			КонецЦикла;	
			ОбъектXML.ЗаписатьКонецЭлемента();
		Иначе
			// на всякий случай закроем табличный узел
			Если УзелТабличныеЧастиОткрыт Тогда
				ОбъектXML.ЗаписатьКонецЭлемента();
				УзелТабличныеЧастиЗакрыт = Истина;
			КонецЕсли;	
			
			//открываем узел реквизитов
			Если Не УзелРеквизитыОткрыт Тогда
				ОбъектXML.ЗаписатьНачалоЭлемента("РеквизитыШапки");
				УзелРеквизитыОткрыт = Истина;
			КонецЕсли;
			
			ИмяРеквизита = Строка.ИмяРеквизита;
			ОбъектXML.ЗаписатьНачалоЭлемента(ИмяРеквизита);
			ОбъектXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЦикла;	
	
	Если УзелРеквизитыОткрыт и Не УзелРеквизитыЗакрыт Тогда
		ОбъектXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	
	Если УзелТабличныеЧастиОткрыт и Не УзелТабличныеЧастиЗакрыт Тогда	
		ОбъектXML.ЗаписатьКонецЭлемента();
	КонецЕсли;		
	
	// закрываем узел имен реквизитов
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	// объект в серализованном виде
	ЗаписатьXML(ОбъектXML, ДокументДляВыгрузки);
	
	// закрываем весь шаблон
	ОбъектXML.ЗаписатьКонецЭлемента();
	СтрокаРезултата = ОбъектXML.Закрыть();	
	Шаблон = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
	Если Не ПараметрыИмени.СохранятьКакОбщийШаблон Тогда
		Шаблон.Объект = ПараметрыСеанса.Пользователь;
	Иначе
		Шаблон.Объект = "ОбщийШаблон";
	КонецЕсли;
	Шаблон.Идентификатор = "ШД:" + ПараметрыИмени.ИмяШаблона;
	Шаблон.ИмяФайла = Справочники.ХозОперации.ПолучитьИмяПредопределенного(ПараметрыИмени.ХозОперация) + ":" + ПараметрыИмени.ИмяШаблона;
	
	Шаблон.Данные = Новый ХранилищеЗначения(СтрокаРезултата,Новый СжатиеДанных(9));
	Шаблон.Записать();
	
	ШаблонныеРеквизиты = ВыгрузкаЗагрузкаШаблоновСформироватьСтруктуруВыбранныхРеквизитов(СписокРеквизитов);
	ИмяДокумента = ДокументДляВыгрузки.Метаданные().Имя;
	#Если Клиент тогда
		СохранитьЗначение("ШД:" + ИмяДокумента, ШаблонныеРеквизиты);
		Сообщить("Выгрузка шаблона успешно завершена!");
	#КонецЕсли
КонецПроцедуры	

// Возвращает полное представление объекта
// Параметры:
// Данные - объект, представление которого надо сформировать
// Возвращаемое значение
// Полное представление объекта
Функция ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Данные)
	
	Если ТипЗнч(Данные) = Тип("УдалениеОбъекта") Тогда
		Представление = "Удаление объекта: " + Строка(Данные.Ссылка.Метаданные()) + ": " + Строка(Данные.Ссылка);
	Иначе					
		Попытка
			Представление = Строка(Данные.Метаданные()) + ": " + Строка(Данные);
		Исключение
			Представление = Строка(ТипЗнч(Данные)) + ": " + Строка(Данные);
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		Если Строка(Данные.Метаданные().ОсновноеПредставление) = "ВВидеНаименования" Тогда
			Представление = Представление + ", (" + СокрЛП(Данные.Код) + ")";
		ИначеЕсли Строка(Данные.Метаданные().ОсновноеПредставление) = "ВВидеКода" Тогда
			Представление = Представление + ", (" + СокрЛП(Данные.Наименование) + ")";
		КонецЕсли;
	Исключение КонецПопытки;
	
	Возврат Представление;
	
КонецФункции	//	ПредставлениеДанных()

// Читаем даные объекта Шаблон документа
// Параметры:
// ЧтениеXML - текущее чтение XML строки
// Объект - текущий объект загрузки
// ОбъектМетаданных - метаданные текущего объекта загрузки
// ПроверяемыеРеквизиты - реквизиты для загрузки
// ЭтоСсылочныйТипДанных - флаг, определяющий что Объект является ссылочным типом
// ТабличныеЧасти - табличные части загружаемого документа
Функция ВыгрузкаЗагрузкаШаблоновПрочитатьДанныеУзла(ЧтениеXML, Объект, ОбъектМетаданных,ПроверяемыеРеквизиты,ЭтоСсылочныйТипДанных = Истина, ТабличныеЧасти)
	Перем Ссылка; // Ссылка на документ
	
	// Запомним имя узла, конец которого нужно будет "поймать", и переходим на следующий
	ИмяУзла = ЧтениеXML.Имя;
	ЧтениеXML.Прочитать();
	
	// Начинаем последовательное чтение узлов данного уровня
	Пока НЕ (ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = ИмяУзла) Цикл
		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			// Нас интересуют только узлы описывающие начало реквизитов
			//ЧтениеXML.Пропустить();
			ЧтениеXML.Прочитать();
		Иначе
			// Определим, существует ли такой реквизит у объекта и какого он типа
			Попытка
				ИмяРеквизита = ЧтениеXML.Имя;
				ТипРеквизита = ТипЗнч(Объект[ИмяРеквизита]);
				РеквизитЕсть = ИСТИНА;
			Исключение
				РеквизитЕсть = ЛОЖЬ;
			КонецПопытки;
			
			// Уточним чем именно является данный узел
			Попытка
				ЭтоТабличнаяЧасть = ЛОЖЬ;
				ЭтоТабличнаяЧасть = РеквизитЕсть И (ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяРеквизита) <> Неопределено);
			Исключение КонецПопытки;
			Попытка
				ЭтоПредопределенный = ЛОЖЬ;
				ЭтоПредопределенный = ЭтоСсылочныйТипДанных И Объект.Предопределенный;
			Исключение КонецПопытки;
			
			// Производим загрузку значения реквизита
			Если РеквизитЕсть И НЕ ЭтоТабличнаяЧасть Тогда
				// Есть очень важные особенности при загрузке некоторых реквизитов. Обработаем их отдельно
				// ссылка как таковая нас мало интересует
				Если ЭтоСсылочныйТипДанных И ИмяРеквизита = "Ref" Тогда
					// Получаем значение ссылки загружаемого объекта
					//оставлено для демонстрации того что значения поднимаем именно из файлового шаблона а не из объекта базы
					//Ссылка = ПрочитатьXML(ЧтениеXML, ТипЗнч(Объект.Ссылка));
					ЧтениеXML.Прочитать();
				Иначе
					// поймем нужно ли нам вообще загружать этот реквизит
					Если Не ПроверяемыеРеквизиты.Свойство(ИмяРеквизита) Тогда
						ЧтениеXML.Пропустить();
						Продолжить;
					КонецЕсли;	
					
					// Определим переменную указывающую на то что значение успешно прочитано
					ЗначениеПрочитано = ЛОЖЬ;
					
					// Проверим, не содержит ли текущий реквизит значение "Неопределено", если это так то и делать нечего
					Если НРег(ЧтениеXML.ПолучитьАтрибут("xsi:nil")) = "true" Тогда
						Значение = Неопределено;
						ЗначениеПрочитано = ИСТИНА;
						ЧтениеXML.Пропустить();
					Иначе
						// Прочее реквизиты объекта
						МассивТипов = Новый Массив(1);
						МассивТипов[0] = ТипРеквизита;
						
						// Определим возможные типы реквизита
						Если НЕ ТипРеквизита = Тип("ХранилищеЗначения") Тогда
							// Посмотрим, указан ли тип в атрибуте узла
							ТипРеквизитаXML	 = ?(ПолучитьXMLТип(ЧтениеXML) = Неопределено, Неопределено, ИзXMLТипа(ПолучитьXMLТип(ЧтениеXML)));
							
							// Произведем уточнение типа реквизита
							Если ТипРеквизитаXML = Неопределено И (НЕ ЧтениеXML.ПолучитьАтрибут("xsi:type") = Неопределено) Тогда
								ТипРеквизитаXML = ЧтениеXML.ПолучитьАтрибут("xsi:type");
								МассивТипов.Очистить();
								
							ИначеЕсли ТипРеквизитаXML = Неопределено Тогда
								Если ТипРеквизита = Тип("ЭлементОтбора") Тогда
									МассивТипов = Объект[ИмяРеквизита].ТипЗначения.Типы();
								Иначе
									Попытка
										МассивТипов = ОбъектМетаданных.Реквизиты[ИмяРеквизита].Тип.Типы();
									Исключение
									КонецПопытки;
								КонецЕсли;
							Иначе
								МассивТипов[0] = ТипРеквизитаXML;
							КонецЕсли;
						КонецЕсли;
						
						// Осуществим чтение значения реквизита из XML файла
						Если МассивТипов.Количество() = 1 Тогда
							Попытка
								Значение = ПрочитатьXML(ЧтениеXML, МассивТипов[0]);
								ЗначениеПрочитано = ИСТИНА;
							Исключение
								ТекстСобытия = ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Объект) + ": значение реквизита < " + ИмяРеквизита + " > не соответствует ожидаемому типу";
							КонецПопытки;
						Иначе
							Если МассивТипов.Количество() > 1 Тогда
								ТекстСобытия = ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Объект) + ": невозможно определить к какому типу относится загружаемый реквизит < " + ИмяРеквизита + " > ";
							Иначе
								ТекстСобытия = ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Объект) + ": невозможно определить тип реквизита < " + ИмяРеквизита + " > ";
							КонецЕсли;
							
							// Нет информации о типе загружаемого реквизита
							ЧтениеXML.Пропустить();
						КонецЕсли;
					КонецЕсли;
					
					// Произведем установку полученного значения
					Если НЕ ЗначениеПрочитано Тогда
						// Прочитать значение реквизита не удалось
					Иначе
						Попытка
							// а вот тут надо определиться с объектом если это ссылка
							Попытка
								ОбъектРеквизита = Значение.ПолучитьОбъект();
								Если ОбъектРеквизита = Неопределено ИЛИ ОбъектРеквизита.ПометкаУдаления Тогда
									// ну если объекта к этому времени уже нет или его пометили на удаление то
									// не станем присваивать битую или удаленную ссылку	
								Иначе	
									Объект[ИмяРеквизита] = Значение;
								КонецЕсли;
							Исключение
								Объект[ИмяРеквизита] = Значение;
							КонецПопытки; 
							
						Исключение
							Инфо = ИнформацияОбОшибке();
							ТекстСобытия = ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Объект) + ": ошибка при установке значения реквизита < " + ИмяРеквизита + " > (" + Инфо.Описание + ")";
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ЭтоТабличнаяЧасть Тогда
				// а нужно ли с этой табличной частью работать
				Если Не ТабличныеЧасти.Свойство(ИмяРеквизита,ПроверяемыеРеквизиты) Тогда
					ЧтениеXML.Пропустить();
					Продолжить;
				КонецЕсли;
				
				// Перед загрузкой новых данных произведем очистку табличной части
				Попытка
					Объект[ИмяРеквизита].Очистить();
					ВыгрузкаЗагрузкаШаблоновПрочитатьДанныеУзла(ЧтениеXML, Объект[ИмяРеквизита], ОбъектМетаданных.ТабличныеЧасти[ИмяРеквизита],ПроверяемыеРеквизиты, ЛОЖЬ, ТабличныеЧасти);
				Исключение
					ЧтениеXML.Пропустить();
				КонецПопытки;
				
			ИначеЕсли ИмяРеквизита = "Row" Тогда
				ВыгрузкаЗагрузкаШаблоновПрочитатьДанныеУзла(ЧтениеXML, Объект.Добавить(), ОбъектМетаданных,ПроверяемыеРеквизиты,ЭтоСсылочныйТипДанных, ТабличныеЧасти);
				
			Иначе
				ТекстСобытия = ВыгрузкаЗагрузкаШаблоновПредставлениеДанных(Объект) + ": у объекта информационной базы отсутствует реквизит < " + ИмяРеквизита + " > ";
				
				// Такого реквизита у объекта нет. Пропускаем его.
				ЧтениеXML.Пропустить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции // ПрочитатьДанныеУзла()

// формирование структуры выбранных реквизитов
Функция ВыгрузкаЗагрузкаШаблоновСформироватьСтруктуруВыбранныхРеквизитов(СписокРеквизитов)
	ШаблонныеРеквизиты = Новый Структура();
	Для каждого Строка из СписокРеквизитов.Строки цикл
		// пропустим невыбранные
		Если Не Строка.Пометка тогда
			Продолжить;
		КонецЕсли;
		
		// это реквизит или табличная часть?
		Если Строка.Строки.Количество() = 0 тогда
			ШаблонныеРеквизиты.Вставить(Строка.ИмяРеквизита, Строка.Пометка);
		Иначе
			ШаблонныеРеквизиты.Вставить(Строка.ИмяРеквизита, ВыгрузкаЗагрузкаШаблоновСформироватьСтруктуруВыбранныхРеквизитов(Строка));
		КонецЕсли;
	КонецЦикла;
	Возврат ШаблонныеРеквизиты;
КонецФункции

// Функция предназначена для проверки принадлежности указанной хоз. операции 
// хаданной группе операций.
// Параметры:
//	ЭтотОбъект		- текущий объект проверки
//  Группа			- группа хоз. операций
//
// Возвращаемое значение < Булево >	- результат проверки
//
Функция дкПроверитьПринадленостьХозОперации(Знач ЭтотОбъект, Группа="") Экспорт
	Результат	= Ложь;
	
	ЭтаСсылка	= Неопределено;
	Если ЭтотОбъект<>Неопределено Тогда
		Попытка
			ЭтаСсылка	= ЭтотОбъект.Ссылка;
		Исключение КонецПопытки;
	КонецЕсли;
	
	// Необходимо проверить переданный документ на наличие реквизита ХозОперация
	Если (НЕ Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭтаСсылка))) ИЛИ
		ЭтотОбъект.Метаданные().Реквизиты.Найти("ХозОперация")=Неопределено ИЛИ
		обЗначениеНеЗаполнено(ЭтотОбъект.ХозОперация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Группа="Поступление" Тогда
		Результат	= (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ) ИЛИ
			(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей) ИЛИ
			(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку) ИЛИ
			(ЭтотОбъект.ХозОперация=Справочники.ХозОперации.АвансовыйОтчет);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

// Формирует текстовый документ для фиксации изменений в системном журнале 
// регистрации и помещает его в дополнительный свойства документа
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкСформироватьЗаписьЖурналаРегистрации(ЭтаФорма) Экспорт
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	МетаданныеДокумент = ЭтаФорма.Метаданные();
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	| *
	|ИЗ
	| Документ." + МетаданныеДокумент.Имя + "
	|ГДЕ
	| Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",ЭтаФорма.Ссылка);
	ДокументДоЗаписи = Запрос.Выполнить().Выбрать(); ДокументДоЗаписи.Следующий();
	ТД = Новый ТекстовыйДокумент();
	
	// реквизиты документа
	ДобавленЗаголовок = Ложь;
	НуженПереносСтроки = Ложь;
	Для Каждого Реквизит Из МетаданныеДокумент.Реквизиты Цикл
		Если ДокументДоЗаписи[Реквизит.Имя] <> ЭтаФорма[Реквизит.Имя] Тогда
			Если НЕ ДобавленЗаголовок Тогда 
				ТД.ДобавитьСтроку("Реквизиты шапки до записи:");
				ДобавленЗаголовок = Истина;
			КонецЕсли;
			ТД.ДобавитьСтроку(" < " + Реквизит.Имя + " > : " + СокрЛП(ДокументДоЗаписи[Реквизит.Имя]));
			НуженПереносСтроки = Истина;
		КонецЕсли;
	КонецЦикла;

	//табличные части документа
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумент.ТабличныеЧасти Цикл
		Если НуженПереносСтроки Тогда
			НуженПереносСтроки = Ложь;
			ТД.ДобавитьСтроку("");
		КонецЕсли;
		СтрокиДоЗаписи = ДокументДоЗаписи[ТабличнаяЧасть.Имя].Выбрать();
		ДобавленЗаголовок = Ложь;
		ЧислоСтрокНаФорме = ЭтаФорма[ТабличнаяЧасть.Имя].Количество();
		ЧислоСтрокДоЗаписи = СтрокиДоЗаписи.Количество();
        //обходим все строки табличной части до записи в поисках различий
		Пока СтрокиДоЗаписи.Следующий() Цикл
			НайденыРазличия = Ложь;
			ИндексСтроки = СтрокиДоЗаписи.НомерСтроки; 
			//если индекс больше количества строк на форме, значит были удалены строки
			Если ЧислоСтрокНаФорме < ИндексСтроки Тогда
				НайденыРазличия = Истина;
			КонецЕсли;   
			//ищем различия в текущей строке
			Если НЕ НайденыРазличия Тогда
				СтрокаФормы = ЭтаФорма[ТабличнаяЧасть.Имя][ИндексСтроки-1];
				Для Каждого РеквизитТабличнойЧасти Из ТабличнаяЧасть.Реквизиты Цикл
					Если СтрокиДоЗаписи[РеквизитТабличнойЧасти.Имя] <> СтрокаФормы[РеквизитТабличнойЧасти.Имя] Тогда
						НайденыРазличия = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла
			КонецЕсли;
			//если найдены различия, добавим все реквизиты строки
			Если НайденыРазличия Тогда 
				Если НЕ ДобавленЗаголовок Тогда 
					ТД.ДобавитьСтроку("Реквизиты таблицы """ + ТабличнаяЧасть.Имя +  """ до записи:");
					ДобавленЗаголовок = Истина;
				КонецЕсли;
				Стр = " < НомерСтроки > : " + СокрЛП(СтрокиДоЗаписи.НомерСтроки);
				Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
					Стр = Стр + " " + " < " + Реквизит.Имя + " > : " + СокрЛП(СтрокиДоЗаписи[Реквизит.Имя]);
				КонецЦикла;
				ТД.ДобавитьСтроку(Стр);
				НуженПереносСтроки = Истина;
			КонецЕсли;
		КонецЦикла;
		//возможно были добавлены новые строки
		Если ЧислоСтрокНаФорме > ЧислоСтрокДоЗаписи Тогда
			Если НЕ ДобавленЗаголовок Тогда 
				ТД.ДобавитьСтроку("Реквизиты таблицы """ + ТабличнаяЧасть.Имя +  """ до записи:");
				ДобавленЗаголовок = Истина;
			КонецЕсли;
			РазностьСтрок = ЧислоСтрокНаФорме - ЧислоСтрокДоЗаписи;
			Для Сч = 1 По РазностьСтрок Цикл
				Стр = " < НомерСтроки > : " + (ЧислоСтрокДоЗаписи + Сч) + " (добавлена строка)";
				ТД.ДобавитьСтроку(Стр);
				НуженПереносСтроки = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//запись в журнал будем выполнять после успешной записи объекта в базу
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьЖурналаРегистрации") Тогда
		ЭтотОбъект.ДополнительныеСвойства.ЗаписьЖурналаРегистрации = ТД;
	Иначе
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаписьЖурналаРегистрации", ТД);	
	КонецЕсли;
КонецПроцедуры

// Получает запись об изменениях в документе из дополнительных свойств
// и помещает её в системный журнал регистрации
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкЗафиксироватьЗаписьВЖурналеРегистрации(ЭтаФорма) Экспорт
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьЖурналаРегистрации") Тогда
		ЗаписьЖурналаРегистрации = ЭтотОбъект.ДополнительныеСвойства.ЗаписьЖурналаРегистрации;
		ЭтотОбъект.ДополнительныеСвойства.Удалить("ЗаписьЖурналаРегистрации");
		Попытка
			ЗаписьЖурналаРегистрации("Журнал изменений документов",
			УровеньЖурналаРегистрации.Информация,
			ЭтаФорма.Метаданные(),
			ЭтаФорма.Ссылка,
			ЗаписьЖурналаРегистрации.ПолучитьТекст());
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

// Процедура автоматического штрих-кодирования документов
//
// Параметры
//  Документ  - <ДокументСсылка, ДокументОбъект> - ссылка или объект документа для штрихкодирования
//  Права  - <Структура> - кеш прав
//
Процедура дкШтрихКодированиеДокументов(Документ,Права=Неопределено) Экспорт
	//Проверим возможность штрих-кодирования документа
	Если обПраво("АвтоматическоеШтрихКодированиеДокументов",Права,,Документ) Тогда
		ОбъектыШК=Метаданные.РегистрыСведений.ШтрихКоды.Измерения.Объект.Тип;
		Если ОбъектыШК.СодержитТип(ТипЗнч(Документ.Ссылка)) Тогда
			//Документ может быть штрихкодирован
			ОбработкаОбъектШтрихКоды=Обработки.ШтрихКоды.Создать();
			ОбработкаОбъектШтрихКоды.Объект=Документ;
			ОбработкаОбъектШтрихКоды.ПрочитатьЗаполнитьШтрихКоды();
			Если ОбработкаОбъектШтрихКоды.Состав.Количество()>0 Тогда
				ШтрихКод=ОбработкаОбъектШтрихКоды.Состав[0].ШтрихКод;
			Иначе
				ШтрихКод="";
			КонецЕсли; 
			Если ПустаяСтрока(ШтрихКод) Тогда
				//Штрих-код не задан, создадим новый
				ШтрихКод=ОбработкаОбъектШтрихКоды.СформироватьШтрихКодТовара(Ложь);
				Если ОбработкаОбъектШтрихКоды.Состав.Количество()=0 Тогда
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав.Добавить();
					СтрокаШК.Объект=Документ;
					СтрокаШК.Запрещен=Ложь;
				Иначе
					СтрокаШК=ОбработкаОбъектШтрихКоды.Состав[0];
				КонецЕсли; 
				СтрокаШК.ШтрихКод=ШтрихКод;
				//Запишем автоматически сформированный штрих-код
				Если НЕ ОбработкаОбъектШтрихКоды.ЗаписатьШтрихКоды() Тогда
					//Произошла ошибка
					ТекстОшибки = "Ошибка записи штрих-кода документа.";
					Сообщить(ТекстОшибки);
					ВызватьИсключение ТекстОшибки;
				Иначе
					Сообщить("Документу <"+Документ+"> присвоен штрих-код """+ШтрихКод+"""",СтатусСообщения.Информация);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры // дкШтрихКодированиеДокументов()

#Если Клиент Тогда
// Процедура альтернатиного редактирование документов
Процедура дкАльтернативноеРедактированиеДокумента(ЭтаФорма,ЭтотОбъект) Экспорт
	// посмотрим имеется или дополнительная форма
	МетаданныеОбъекта=Метаданные.НайтиПоТипу(ТипЗнч(ЭтотОбъект));
	
	Если НЕ(МетаданныеОбъекта.Формы.Найти("ФормаДокументаДополнительная") = Неопределено) Тогда
		ФормаРедактирования = ЭтотОбъект.ПолучитьФорму("ФормаДокументаДополнительная",ЭтаФорма,ЭтаФорма);
	Иначе
		ФормаРедактирования = ПолучитьОбщуюФорму("РедактированиеКомментария",ЭтаФорма,ЭтаФорма);
	КонецЕсли;
	
	Попытка
		ФормаРедактирования.ДокументОбъект = ЭтотОбъект;
	Исключение
	КонецПопытки;
	
	ФормаРедактирования.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаРедактирования.Открыть();
КонецПроцедуры
#КонецЕсли

// Возращает этот объект для документов или основной объект для АРМ
//
Функция дкПолучитьТекущийОбъект(ЭтотОбъект) Экспорт
	//основной объект используется в АРМ	
	ОсновнойОбъект = Неопределено; 
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ОсновнойОбъект",ОсновнойОбъект);
	Если ЗначениеЗаполнено(ОсновнойОбъект) Тогда
		Возврат ОсновнойОбъект.ПолучитьОбъект();
	Иначе
		Возврат ЭтотОбъект;
	КонецЕсли;
КонецФункции

// Возращает ссылку на этот объект для документов или основной объект для АРМ
//
Функция дкПолучитьСсылкуНаТекущийОбъект(ЭтотОбъект) Экспорт
	//основной объект используется в АРМ	
	ОсновнойОбъект = Неопределено; 
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ОсновнойОбъект",ОсновнойОбъект);
	Если ЗначениеЗаполнено(ОсновнойОбъект) Тогда
		Возврат ОсновнойОбъект;
	Иначе
		Возврат ЭтотОбъект.Ссылка;
	КонецЕсли;
КонецФункции

// Определяет, записан ли документ в базу данных
//
Функция дкЭтоНовыйОбъект(ЭтотОбъект) Экспорт
	//основной объект используется в АРМ	
	ОсновнойОбъект = Неопределено; 
	ЭтотОбъект.ДополнительныеСвойства.Свойство("ОсновнойОбъект",ОсновнойОбъект);
	Если ЗначениеЗаполнено(ОсновнойОбъект) Тогда
		Возврат Ложь;
	Иначе
		Возврат ЭтотОбъект.Ссылка.Пустая();
	КонецЕсли;
КонецФункции

// Получает номер версии документа из базы данных
//
Функция дкПрочитатьВерсиюДанныхОбъекта(Ссылка) Экспорт
	
	ВерсияДанных = "";
	
	МетаданныеПоСсылке = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
	Если МетаданныеПоСсылке <> Неопределено Тогда
		ПолноеИмя = МетаданныеПоСсылке.ПолноеИмя();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Документ.ВерсияДанных
		               |ИЗ
		               |	" + ПолноеИмя + " КАК Документ
		               |ГДЕ
		               |	Документ.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВерсияДанных = Выборка.ВерсияДанных;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВерсияДанных;
	
КонецФункции

// Проверяет наличие признаков отмены ввода документа
//
Функция дкПроверитьОтменуВводаДокумента(Объект) Экспорт
	
	ОтменитьВвод = Ложь;
	
	Попытка
		ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	Исключение
		Возврат ОтменитьВвод;
	КонецПопытки;
	
	Если обЭтотТип(ДополнительныеСвойства, "Структура") И ДополнительныеСвойства.Свойство("ОтменитьВвод") Тогда
		ОтменитьВвод = ДополнительныеСвойства.ОтменитьВвод;
	КонецЕсли;
	
	Возврат ОтменитьВвод;
	
КонецФункции

// Процедура устанавливает признак отмены ввода документа
//
Процедура дкОтменаВводаДокумента(Объект) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ОтменитьВвод") Тогда
		Объект.ДополнительныеСвойства.ОтменитьВвод = Истина;
	Иначе
		Объект.ДополнительныеСвойства.Вставить("ОтменитьВвод", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Функция для получения ставки НДС и суммы НДС по документу
//
Процедура дкСформироватьСуммуНДСДокументаОтгрузки(Объект, Сделка, СуммаОплаты) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Сделка) Тогда
		Объект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		Объект.СуммаНДС = Окр((СуммаОплаты * Объект.СтавкаНДС.Ставка)/(100 + Объект.СтавкаНДС.Ставка),2);
		Возврат;
	КонецЕсли;
	
	ОдинаковаяСтавкаНДС = Истина;
	СтавкаНДС           = Неопределено;
	СуммаНДС            = 0;
	
	Для Каждого ТабличнаяЧастьДокумента Из Сделка.Метаданные().ТабличныеЧасти Цикл
		
		// Проверим есть ли в ТЧ Ставка\Сумма НДС
		ЕстьСтавкаНДС = (ТабличнаяЧастьДокумента.Реквизиты.Найти("СтавкаНДС") <> Неопределено);
		ЕстьСуммаНДС  = (ТабличнаяЧастьДокумента.Реквизиты.Найти("СуммаНДС") <> Неопределено);
		
		// Получим ставку НДС
		Если ОдинаковаяСтавкаНДС И ЕстьСтавкаНДС Тогда
			Для Каждого ТекущаяСтрока Из Сделка[ТабличнаяЧастьДокумента.Имя] Цикл
				Если СтавкаНДС = Неопределено Тогда
					СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
				ИначеЕсли СтавкаНДС <> ТекущаяСтрока.СтавкаНДС Тогда
					ОдинаковаяСтавкаНДС = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Получим сумму НДС
		Если ЕстьСуммаНДС Тогда
			СуммаНДС = СуммаНДС + Сделка[ТабличнаяЧастьДокумента.Имя].Итог("СуммаНДС");
		КонецЕсли;
		
	КонецЦикла;
	
	// Сумма документа по сделке
	СуммаСделки = Сделка.СуммаДокумента;
	
	Если ТипЗнч(Сделка) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		Если СтавкаНДС = Неопределено Тогда
			СтавкаНДС = Сделка.СтавкаНДСНаАвтомобиль;
		Иначе
			ОдинаковаяСтавкаНДС = ОдинаковаяСтавкаНДС И (СтавкаНДС = Сделка.СтавкаНДСНаАвтомобиль);
		КонецЕсли;
		
		СуммаНДС = СуммаНДС    + Сделка.СуммаНДСНаАвтомобиль;
	КонецЕсли;
	
	// Перерасчитаем суммы
	Если НЕ Сделка.ВалютаДокумента=Объект.ВалютаДокумента Тогда
		СуммаОплатыДокумента = Окр(обПересчет(СуммаОплаты, Объект.ВалютаДокумента, Объект.КурсДокумента, Сделка.ВалютаДокумента, Сделка.КурсДокумента), 2);
	Иначе
		СуммаОплатыДокумента = СуммаОплаты;
	КонецЕсли;
	
	// пропорционально установим сумму НДС
	Если СуммаСделки > СуммаОплатыДокумента Тогда
		СуммаНДС = (СуммаОплатыДокумента * СуммаНДС) / СуммаСделки;
	КонецЕсли;
	
	СуммаНДС = обПересчет(СуммаНДС, Сделка.ВалютаДокумента, Сделка.КурсДокумента, Объект.ВалютаДокумента, Объект.КурсДокумента);
	
	Если ОдинаковаяСтавкаНДС Тогда
		Объект.СтавкаНДС = СтавкаНДС;
	Иначе
		Объект.СтавкаНДС = Неопределено;
	КонецЕсли;
	Объект.СуммаНДС = СуммаНДС;
	
КонецПроцедуры // дкСформироватьСуммуНДСДокументаОтгрузки()

// Процедура выполняет удаление корзин, которые были перемещены в документ
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - Форма записываемого документа.
//
Процедура дкУдалитьКорзиныПеремещенныеВДокумент(ЭтаФорма)
	
	ДопСвойства = ЭтаФорма.ДополнительныеСвойства;
	Если ДопСвойства.Свойство("ДобавленныеКорзиныВДокумент") Тогда
		ДобавленныеКорзиныВДокумент = ДопСвойства.ДобавленныеКорзиныВДокумент;
	Иначе
		Возврат;
	КонецЕсли;
	
	Для Каждого Корзина Из ДобавленныеКорзиныВДокумент Цикл
		НаборЗаписей = РегистрыСведений.Корзина.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номер.Установить(Корзина.Номер);
		НаборЗаписей.Отбор.Дата.Установить(Корзина.Дата);
		НаборЗаписей.Отбор.Клиент.Установить(Корзина.Клиент);
		НаборЗаписей.Отбор.ПодразделениеКомпании.Установить(Корзина.ПодразделениеКомпании);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Попытка
			НаборЗаписей.Записать();
			Сообщить("Корзина №" + Корзина.Номер + " удалена.");
		Исключение
			Сообщить("Не удалось удалить корзину №" + Корзина.Номер + ". " + ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Производит проверку соответствия банковского счета документа и организации либо подразделению компании.
//
Функция дкПроверитьКорректностьБанковскогоСчета(Счет, Организация, Подразделение, ДополнительныеСвойства=Неопределено) Экспорт
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		
		ГрупповаяОбработкаДокументов=Ложь;
		
		Если НЕ ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов",ГрупповаяОбработкаДокументов) Тогда
			ГрупповаяОбработкаДокументов=Ложь;
		КонецЕсли;
		
		Если ГрупповаяОбработкаДокументов Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Счет.Владелец = Организация Тогда
		Возврат Истина;
	КонецЕсли;
	
	Родитель = Подразделение;
	Пока НЕ обЗначениеНеЗаполнено(Родитель) Цикл
		Если Счет.Владелец = Родитель Тогда
			Возврат Истина;
		КонецЕсли;
		Родитель = Родитель.Родитель;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьКорректностьБанковскогоСчета()

// Получить автоматически тип расчета для чека.
//
// Параметры:
//  Документ - ДокументСсылка - ПКО, РКО или банковская выписка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами - Полученный тип расчета.
//
Функция дкТипРасчетаДокумента(Документ) Экспорт
	
	// Определимся с типом документа
	ЭтоПКО = (ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер"));
	ЭтоРКО = (ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.РасходныйКассовыйОрдер"));
	ЭтоБанковскаяВыписка = (ТипЗнч(Документ) = Тип("ДокументСсылка.Выписка")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.Выписка"));
	
	// Если ПКО/РКО введено на основании РКО/ПКО, то считаем, что это возврат ДС.
	Если ЭтоПКО И ЗначениеЗаполнено(Документ.ДокументОснование)
		И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств;
	КонецЕсли;
	Если ЭтоРКО И ЗначениеЗаполнено(Документ.ДокументОснование)
		И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	КонецЕсли;
	
	// Получим типы сделок
	ДокументыВозвратаПрихода = Новый Массив;
	ДокументыВозвратаПрихода.Добавить(Тип("ДокументСсылка.ВозвратПоставщику"));
	ДокументыВозвратаПрихода.Добавить(Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей"));
	
	ДокументыВозвратаРасхода = Новый Массив;
	ДокументыВозвратаРасхода.Добавить(Тип("ДокументСсылка.ВозвратОтПокупателя"));
	ДокументыВозвратаРасхода.Добавить(Тип("ДокументСсылка.ВозвратОтПокупателяАвтомобилей"));
	
	СделкиПрихода = дкПолучитьРазрешенныеТипыСделок(Неопределено,Истина,Ложь);
	
	// Дополним документы возврата прихода
	Для Каждого ТекущаяСделка Из СделкиПрихода Цикл
		Если ТекущаяСделка.Значение = "ЗаказПоставщикуНаАвтомобиль"
			ИЛИ ТекущаяСделка.Значение = "АвансовыйОтчет"
			ИЛИ ТекущаяСделка.Значение = "Инкассация"
			ИЛИ ТекущаяСделка.Значение = "КорректировкаДолга"
			ИЛИ ТекущаяСделка.Значение = "Выписка"
			ИЛИ ТекущаяСделка.Значение = "ПереоценкаВалютныхСредств" Тогда
			Продолжить;
		КонецЕсли;
		ДокументыВозвратаРасхода.Добавить(Тип("ДокументСсылка."+ТекущаяСделка.Значение));
	КонецЦикла;
	
	
	// Определим вид выписки (расход/приход) и если указаны возвраты, то возврат
	ЭтоРасходВыписки = Ложь;
	ВозвратПоВыписке = Истина;
	Если ЭтоБанковскаяВыписка Тогда
		
		ЭтоРасходВыписки = (Документ.СуммаДокументаРасход <> 0 ИЛИ Документ.СтатьяДДС.ВидДвижения=Перечисления.ВидыДвижений.Расход);
		
		ЗаполненыСделки = Ложь;
		ВозвратПоВыписке = НЕ Документ.Состав.Количество() = 0;
		
		Для Каждого ТекущаяСтрока Из Документ.Состав Цикл
			ЗаполненыСделки = ЗаполненыСделки ИЛИ ЗначениеЗаполнено(ТекущаяСтрока.Сделка);
			Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Сделка) ИЛИ
				ЭтоРасходВыписки И ДокументыВозвратаРасхода.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено ИЛИ
				НЕ ЭтоРасходВыписки И ДокументыВозвратаПрихода.Найти(ТипЗнч(ТекущаяСтрока.Сделка)) = Неопределено)
				И ВозвратПоВыписке Тогда
				ВозвратПоВыписке = Ложь;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ЗаполненыСделки = ЗначениеЗаполнено(Документ.Сделка);
	КонецЕсли;
	
	// Сделки не заполнены - определим по статье
	Если НЕ ЗаполненыСделки И ЗначениеЗаполнено(Документ.СтатьяДДС) Тогда
		Если ЭтоРКО ИЛИ ЭтоБанковскаяВыписка И Документ.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
			Возврат ?(Документ.СтатьяДДС = Справочники.СтатьиДДС.ВозвратПокупателю,
				Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств,
				Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств);
		КонецЕсли;
		Если ЭтоПКО ИЛИ ЭтоБанковскаяВыписка И Документ.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
			Возврат ?(Документ.СтатьяДДС = Справочники.СтатьиДДС.ВозвратОтПоставщика
				ИЛИ Документ.СтатьяДДС = Справочники.СтатьиДДС.ВозвратИзПодОтчета,
			Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств,
			Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств);
		КонецЕсли;
	КонецЕсли;
	
	Если (ЭтоПКО И ДокументыВозвратаПрихода.Найти(ТипЗнч(Документ.Сделка)) <> Неопределено) ИЛИ
		(ЭтоБанковскаяВыписка И НЕ ЭтоРасходВыписки И ВозвратПоВыписке) Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств;
	ИначеЕсли (ЭтоРКО И ДокументыВозвратаРасхода.Найти(ТипЗнч(Документ.Сделка)) <> Неопределено) ИЛИ 
		(ЭтоБанковскаяВыписка И ЭтоРасходВыписки И ВозвратПоВыписке) Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
	ИначеЕсли ЭтоРКО ИЛИ (ЭтоБанковскаяВыписка И ЭтоРасходВыписки) Тогда
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств;
	Иначе
		Возврат Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	КонецЕсли;
	
КонецФункции

// Проверяет для коммисионных документов использоваение прослеживаемого или маркируемого товара 
// для текущей строки документа при изменении номенклатуры.
// Если товар прослеживаемый или маркируемый - очищает выбранное значение и выводит предупреждение.
//
// Параметры:
//  ХозОперация - СправочникСсылка.ХозОперация - хозоперация документа;
//  ТекСтрока   - СтрокаТабличнойЧасти - обрабатываемая строка.
//
Процедура дкПроверитьНоменклатуруДляКомиссионныхДокументов(ХозОперация, ТекСтрока) Экспорт
	
	Если ПрослеживаемостьТоваровСервер.ЭтоХозОперацияКомиссии(ХозОперация)
		И (дкЭтоПрослеживаемыйТовар(ТекСтрока.Номенклатура) ИЛИ дкЭтоМаркируемаяНоменклатура(ТекСтрока.Номенклатура)) Тогда
		#Если Клиент Тогда
			Предупреждение("В таблицу нельзя вводить прослеживаемую номенклатуру или номенклатуру, по которой ведется учет по маркировке",10);
		#КонецЕсли
		ТекСтрока.Номенклатура = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет для коммисионных документов использоваение прослеживаемого товара для текущей строки документа при изменении номенклатуры.
// Если товар прослеживаемый - очищает выбранное значение и выводит предупреждение.
//
// Параметры:
//  ХозОперация - СправочникСсылка.ХозОперация - хозоперация документа;
//  ТекСтрока   - СтрокаТабличнойЧасти - обрабатываемая строка.
//
// Возвращаемое значение:
//  Булево - Истина, если товар прослеживаемый, Ложь - в противном случае.
//
Функция дкПроверитьАвтомобильДляКомиссионныхДокументов(ХозОперация, ТекСтрока) Экспорт
	
	Если ПрослеживаемостьТоваровСервер.ЭтоХозОперацияКомиссии(ХозОперация) И дкЭтоПрослеживаемыйТовар(ТекСтрока.Автомобиль) Тогда
		#Если Клиент Тогда
			Предупреждение("В таблицу нельзя вводить прослеживаемый товар",5);
		#КонецЕсли
		ТекСтрока.Автомобиль = Неопределено;
		Возврат Истина
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет для коммисионных документов использоваение прослеживаемого или маркируемого товара для всей ТЧ документа.
// Если встречается такой товар - выводится предупреждение и документ не записывается.
//
// Параметры:
//  Объект - ДокументОбъект - проверяемый документ.
//  Ошибки - Строка - массив ошибок.
//  ИмяТЧ - Строка - имя проверяемой табличной части документа.
//  ИмяНоменклатуры - Строка - имя проверяемого реквизита.
//  ПроверятьМаркировку - Булево - признак проверки на маркироуемый товар.
//
// Возваращемое значение:
//  Булево - признак продолжения операции. Истина - если нет запрещенных товаров, Ложь - в противном случае.
//
Функция дкПроверитьКорректностьТоваровКомиссионныхДокументов(Объект,Ошибки,ИмяТЧ="Товары",ИмяНоменклатуры="Номенклатура",ПроверятьМаркировку=Истина) Экспорт
	Попытка
		Если Объект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов")
			И Объект.ДополнительныеСвойства.ГрупповаяОбработкаДокументов Тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ЕстьОшибки = Ложь;
	Если ПрослеживаемостьТоваровСервер.ЭтоХозОперацияКомиссии(Объект.ХозОперация) Тогда
		Для Каждого ТекСтрока Из Объект[ИмяТЧ] Цикл
			ЭтоПрослеживаемыйТовар = дкЭтоПрослеживаемыйТовар(ТекСтрока[ИмяНоменклатуры]);
			ЭтоМаркируемыйТовар = ПроверятьМаркировку И дкЭтоМаркируемаяНоменклатура(ТекСтрока[ИмяНоменклатуры]);
			Если НЕ (ЭтоПрослеживаемыйТовар ИЛИ ЭтоМаркируемыйТовар) Тогда
				Продолжить;
			КонецЕсли;
			ЕстьОшибки = Истина;
			Если ЭтоПрослеживаемыйТовар Тогда
				дкДобавитьОшибку(Ошибки, "Для хозяйственной операции <" + Объект.ХозОперация + "> не должно быть прослеживаемого товара в табличной части. Номер строки :" + ТекСтрока.НомерСтроки);
			ИначеЕсли ЭтоМаркируемыйТовар Тогда
				дкДобавитьОшибку(Ошибки, "Для хозяйственной операции <" + Объект.ХозОперация + "> не должно быть маркируемого товара в табличной части. Номер строки :" + ТекСтрока.НомерСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат НЕ ЕстьОшибки;
КонецФункции

#Область МаркировкаТоваров

// Получение признака маркируемого товара.
//
// Параметры:
//  ТипНоменклатуры	 - СправочникСсылка.ТипыНоменклатуры - Тип номенклатуры, для которого идет проверка.
// 
// Возвращаемое значение:
//  Булево - Признак того что тип номенклатуры маркирован.
//
Функция дкМаркированныйТипНоменклатуры(ТипНоменклатуры) Экспорт
	
	Возврат ТипНоменклатуры.ВедетсяМаркировка;
	
КонецФункции // дкМаркированныйТипНоменклатуры()

// Получение признака обязательного маркируемого товара.
//
// Параметры:
//  ТипНоменклатуры	 - СправочникСсылка.ТипыНоменклатуры - Тип номенклатуры, для которого идет проверка.
// 
// Возвращаемое значение:
//  Булево - Признак того что номенклатура должно обязательно маркирована.
//
Функция дкОбязательнаДляМаркировкиТоваров(ТипНоменклатуры) Экспорт
	
	Возврат ТипНоменклатуры.МаркировкаОбязательная;
	
КонецФункции // дкСписокМарируемыхВидовНоменклатуры()

// Проверяем наличие в табличной части документа маркировочный товар.
//
// Параметры:
//  Товары			 - ТаблицаЗначений - Табличная часть документа, которая проверяется.
//  ИмяНоменклатуры	 - Строка - Имя колонки с номенклатурой в таблице.
// 
// Возвращаемое значение:
//  Булево - Признак того что табличная часть содержит маркировочный товар (Истина) или нет (Ложь).
//
Функция дкЕстьМаркируемыйТовар(Товары, ИмяНоменклатуры = "Номенклатура") Экспорт
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТипЗнч(ТекущаяСтрока[ИмяНоменклатуры]) = Тип("СправочникСсылка.Номенклатура")
			И ЗначениеЗаполнено(ТекущаяСтрока[ИмяНоменклатуры]) 
			И дкМаркированныйТипНоменклатуры(ТекущаяСтрока[ИмяНоменклатуры].ТипНоменклатуры) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Определяем, что для данной номенклатуры должна быть указана маркировка.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Проверяемая номенклатура.
// 
// Возвращаемое значение:
//  Булево - Признак того, что для данная номенклатура маркирируемая.
//
Функция дкЭтоМаркируемаяНоменклатура(Номенклатура) Экспорт
	
	Возврат ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(Номенклатура)
		И дкМаркированныйТипНоменклатуры(Номенклатура.ТипНоменклатуры);
	
КонецФункции

Функция дкСписокМаркировкиНоменклатуры(Объект, СтрокаТоваров, ТаблицаМаркировки = "КодыМаркировки") Экспорт
	
	// БИЗТЕХ КОВАЛЬ 28.11.2025 ++
	Попытка
		Идентификатор = СтрокаТоваров.ИдентификаторТовара;
	Исключение
		Возврат Новый Массив();
	КонецПопытки;
	// БИЗТЕХ КОВАЛЬ 28.11.2025 --
	
	СписокМаркировки = Новый Массив;
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара", СтрокаТоваров.ИдентификаторТовара);
	
	НайденныеСтроки = Объект[ТаблицаМаркировки].НайтиСтроки(СтруктураПоиска);
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		
		СписокМаркировки.Добавить(ТекущаяСтрока.КодМаркировки);
		
	КонецЦикла;
	
	Возврат СписокМаркировки;
	
КонецФункции

// Проверка того, что количество строк в ТЧ маркировки соответствует количеству в строке товара
//
// Параметры:
//  Объект				 - ДокументОбъект - Объект проверки.
//  ТаблицаТоваров		 - Строка		  - Имя табличной части с товарами.
//  ТаблицаМаркировки	 - Строка		  - Имя табличной части с маркировкой.
//  ТолькоПроверкаКоличества	 - Булево - Признак того, что проветить только на превышение считанной маркировки и количество товара
// 
// Возвращаемое значение:
//  Булево - Истина: корректно введено маркировок; Ложь: имеются отличия.
//
Функция дкПроверитьКорректностьМаркировки(Объект, ТаблицаТоваров = "Товары", ТаблицаМаркировки = "КодыМаркировки", Ошибки, ТолькоПроверкаКоличества = Ложь) Экспорт

	// Проверим на групповое перепроведение документов
	//ГрупповаяОбработкаДокументов = Ложь;
	//Если Объект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов", ГрупповаяОбработкаДокументов) Тогда
	//	Если ГрупповаяОбработкаДокументов = Истина Тогда
	//		Возврат Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	// Очистим ТЧ Маркировки от лишних строк
	СписокИдентификаторовТоваров = Объект[ТаблицаТоваров].ВыгрузитьКолонку("ИдентификаторТовара");
	
	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	
	Попытка
		Если Объект.ДополнительныеСвойства.Свойство("РежимЗаписи") Тогда
			РежимЗаписи = Объект.ДополнительныеСвойства.РежимЗаписи;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	СтрокиУдалить = Новый Массив;
	ЭтоПоступление = (ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеТоваров"));
	Для Каждого ТекущаяСтрока Из Объект[ТаблицаМаркировки] Цикл
		Если СписокИдентификаторовТоваров.Найти(ТекущаяСтрока.ИдентификаторТовара) = Неопределено
			И НЕ (ЭтоПоступление И ПустаяСтрока(ТекущаяСтрока.ИдентификаторТовара)) Тогда
			СтрокиУдалить.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из СтрокиУдалить Цикл
		Объект[ТаблицаМаркировки].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Если НЕ обПраво("ПроверкаЗаполненияСправочниковИДокументов",,,Объект) Тогда
		Возврат Истина;
	КонецЕсли; 
	
	НетОшибокЗаполнения = Истина;
	СписокОшибокКоличества = Новый Массив;
	СписокОшибокОбязательногоВвода = Новый Массив;
	СписокОшибокНеРазобраны = Новый Массив;
	
	// Проверим, что отсканирована маркировка
	ОбработкаОбъектШтрихКоды=Обработки.ШтрихКоды.Создать();
	
	// Переберем каждую строку товара.
	Для Каждого ТекущаяСтрока Из Объект[ТаблицаТоваров] Цикл
		
		// Найдем маркировку данной товарной строки
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ИдентификаторТовара", ТекущаяСтрока.ИдентификаторТовара);
		
		НайденныеСтроки = Объект[ТаблицаМаркировки].НайтиСтроки(СтруктураПоиска);
		
		//Если ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент < НайденныеСтроки.Количество() Тогда
		//	СписокОшибокКоличества.Добавить("В строке <"+ТекущаяСтрока.НомерСтроки+"> табличной части "+ ТаблицаТоваров + " заполнено кодов маркировки больше, чем указано номенклатуры.");
		//	НетОшибокЗаполнения = Ложь;
		//КонецЕсли;
		
		Если НЕ ТолькоПроверкаКоличества Тогда
			Если ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка
				И ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ДатаВведенияМаркировки < Объект.Дата
				И дкОбязательнаДляМаркировкиТоваров(ТекущаяСтрока.Номенклатура.ТипНоменклатуры)
				И ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент > НайденныеСтроки.Количество()
				И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				СписокОшибокОбязательногоВвода.Добавить("Для строки <"+ТекущаяСтрока.НомерСтроки+"> табличной части "+ ТаблицаТоваров + " заполнено кодов маркировки меньше, чем указано номенклатуры.");
				НетОшибокЗаполнения = Ложь;
			КонецЕсли;
			
			// Проверка все маркировки разобраны.
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				СтруктураМаркировки = ОбработкаОбъектШтрихКоды.РазобратьСтрокуШтрихкодаGS1(ТекущаяМаркировка.КодМаркировки);
				
				Если НЕ СтруктураМаркировки.Разобран Тогда
					СписокОшибокНеРазобраны.Добавить("Для строки <"+ТекущаяСтрока.НомерСтроки+"> табличной части "+ ТаблицаТоваров + " имеется некорректный код маркировки "+ ТекущаяМаркировка.КодМаркировки);
					НетОшибокЗаполнения = Ложь
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСообщение Из СписокОшибокКоличества Цикл
		дкДобавитьОшибку(Ошибки, ТекСообщение);
	КонецЦикла;
	
	Для Каждого ТекСообщение Из СписокОшибокОбязательногоВвода Цикл
		дкДобавитьОшибку(Ошибки, ТекСообщение);
	КонецЦикла;
	
	Для Каждого ТекСообщение Из СписокОшибокНеРазобраны Цикл
		дкДобавитьОшибку(Ошибки, ТекСообщение);
	КонецЦикла;
	
	Возврат НетОшибокЗаполнения;
	
КонецФункции

// Производим заполнение кодов маркировки на основании документов.
//
Процедура дкЗаполнитьКодыМаркировкиТоваров(Объект, Основание, ИмяТаблицыМаркировки = "КодыМаркировки") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	ТипОснования = ТипЗнч(Основание);
	
	ТекстЗапроса = "";
	
	// Заполним если вели на основании Заказ-Наряда
	Если ТипОснования = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		// Для заполнения маркировки: ЗН - закрыт, по движению ЗН, иначе - по остаткам
		Если Основание.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	МаркировкаТоваровВПроизводстве.Номенклатура КАК Номенклатура,
			|	МаркировкаТоваровВПроизводстве.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	МаркировкаТоваровВПроизводстве.КодМаркировки КАК КодМаркировки,
			|	МаркировкаТоваровВПроизводстве.ГТД КАК ГТД,
			|	МаркировкаТоваровВПроизводстве.КодМаркировкиBase64 КАК КодМаркировкиBase64
			|ИЗ
			|	РегистрНакопления.МаркировкаТоваровВПроизводстве КАК МаркировкаТоваровВПроизводстве
			|ГДЕ
			|	МаркировкаТоваровВПроизводстве.Регистратор = &Основание";
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ
			|	МаркировкаТоваровВПроизводствеОстатки.Номенклатура КАК Номенклатура,
			|	МаркировкаТоваровВПроизводствеОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	""(01)"" + МаркировкаТоваровВПроизводствеОстатки.GTIN + ""(21)"" + МаркировкаТоваровВПроизводствеОстатки.СерийныйНомер КАК КодМаркировки,
			|	МаркировкаТоваровВПроизводствеОстатки.ГТД КАК ГТД,
			|	МаркировкаТоваровВПроизводствеОстатки.КодМаркировкиBase64 КАК КодМаркировкиBase64
			|ИЗ
			|	РегистрНакопления.МаркировкаТоваровВПроизводстве.Остатки(, ЗаказНаряд = &Основание) КАК МаркировкаТоваровВПроизводствеОстатки";
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.РеализацияТоваров")
		ИЛИ ТипОснования = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		
		ИмяДокумента = Основание.Метаданные().Имя;
		ЕстьГТД=Основание.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("ГТД")<>Неопределено;
		ЕстьКодМаркировкиBase64 = Основание.Метаданные().ТабличныеЧасти.КодыМаркировки.Реквизиты.Найти("КодМаркировкиBase64")<>Неопределено;
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДокументКодыМаркировки.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ДокументКодыМаркировки.КодМаркировки КАК КодМаркировки,
		|	"+?(ЕстьКодМаркировкиBase64, "ДокументКодыМаркировки.КодМаркировкиBase64", """")+" КАК КодМаркировкиBase64
		|ПОМЕСТИТЬ КодыМаркировок
		|ИЗ
		|	Документ."+ИмяДокумента+".КодыМаркировки КАК ДокументКодыМаркировки
		|ГДЕ
		|	ДокументКодыМаркировки.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументТовары.Номенклатура КАК Номенклатура,
		|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДокументТовары.ИдентификаторТовара КАК ИдентификаторТовара,
		|	"+?(ЕстьГТД, "ДокументТовары.ГТД", "ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)")+" КАК ГТД
		|ПОМЕСТИТЬ ТаблицаТоваров
		|ИЗ
		|	Документ."+ИмяДокумента+".Товары КАК ДокументТовары
		|ГДЕ
		|	ДокументТовары.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КодыМаркировок.КодМаркировки КАК КодМаркировки,
		|	КодыМаркировок.КодМаркировкиBase64 КАК КодМаркировкиBase64,
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаТоваров.ИдентификаторТовара КАК ИдентификаторТовара,
		|	ТаблицаТоваров.ГТД КАК ГТД
		|ИЗ
		|	КодыМаркировок КАК КодыМаркировок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
		|		ПО КодыМаркировок.ИдентификаторТовара = ТаблицаТоваров.ИдентификаторТовара";
		
	Иначе
		// Для остальных объектов никаких действий выполнять не будем
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект[ИмяТаблицыМаркировки].Очистить();
	Исключение
		// ТЧ с кодами маркировки нет у документа
		Возврат;
	КонецПопытки;
	
	// Заполним доп. поля для товарной строки
	Для Каждого СтрокаТовар Из Объект.Товары Цикл
		Если ПустаяСтрока(СтрокаТовар.ИдентификаторТовара) Тогда
			СтрокаТовар.ИдентификаторТовара = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстЗапроса = "" Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Основание", Основание);
	
	МаркировкаТоваров = Запрос.Выполнить().Выгрузить();
	
	// Поля поиска строки в ТЧ Товары
	СтруктураОтбораСГТД = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
	СтруктураОтбораБезГТД = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры");
	
	// Занесем маркировку в ТЧ документа с привязкой к строкам
	Для Каждого ТекущаяСтрока Из МаркировкаТоваров Цикл
		
		// Найдем строки в ТЧ Товары документа
		Попытка
			ЗаполнитьЗначенияСвойств(СтруктураОтбораСГТД, ТекущаяСтрока);
			СтрокиТоваров = Объект.Товары.НайтиСтроки(СтруктураОтбораСГТД);
		Исключение
			// Не во всех документа есть ГТД
			СтрокиТоваров = Новый Массив;
		КонецПопытки;
		
		// Для данной маркировки нет строки в ТЧ Товары
		Если СтрокиТоваров.Количество() = 0 Тогда
			
			// Поищем стороки без ГТД
			ЗаполнитьЗначенияСвойств(СтруктураОтбораБезГТД, ТекущаяСтрока);
			СтрокиТоваров = Объект.Товары.НайтиСтроки(СтруктураОтбораБезГТД);
			
			Если СтрокиТоваров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИдентификаторТовара = "";
		Если ПустаяСтрока(СтрокиТоваров[0].ИдентификаторТовара) Тогда
			СтрокиТоваров[0].ИдентификаторТовара = Новый УникальныйИдентификатор;
			ИдентификаторТовара = СтрокиТоваров[0].ИдентификаторТовара;
		Иначе
			// Проверим что для строки товара еще не привышено количество маркировок
			// Для ситуации когда в ТЧ есть несколько строк с одинаковой номенклатуры
			Для Каждого СтрокаТоваров Из СтрокиТоваров Цикл
				СтруктураПоиска = Новый Структура();
				СтруктураПоиска.Вставить("ИдентификаторТовара", СтрокаТоваров.ИдентификаторТовара);
				НайденныеКодыМаркировки = Объект[ИмяТаблицыМаркировки].НайтиСтроки(СтруктураПоиска);
				
				// Количество товара в строке меньше, чем маркировок - туда и добавим
				Если СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент > НайденныеКодыМаркировки.Количество() Тогда
					ИдентификаторТовара = СтрокаТоваров.ИдентификаторТовара;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		// Нашли строку товаров маркировки, добавляем маркировку
		Если НЕ ПустаяСтрока(ИдентификаторТовара) Тогда
			НоваяСтрока = Объект[ИмяТаблицыМаркировки].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверка наличия у номенклатуры остатов на регистрих при установке признака обязательности маркировки.
//
Функция дкПроверитьОстатокНоменклатуры(ТипНоменклатуры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТипНоменклатуры.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ТоварыВПроизводствеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ТаблицаОстатоковВПроизводстве
	               |ИЗ
	               |	РегистрНакопления.ТоварыВПроизводстве.Остатки(, Номенклатура.ТипНоменклатуры = &ТипНоменклатуры) КАК ТоварыВПроизводствеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВПроизводствеОстатки.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МаркировкаТоваровВПроизводствеОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(МаркировкаТоваровВПроизводствеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	               |ПОМЕСТИТЬ ТаблицаОстатковКодовМаркировки
	               |ИЗ
	               |	РегистрНакопления.МаркировкаТоваровВПроизводстве.Остатки(, Номенклатура.ТипНоменклатуры = &ТипНоменклатуры) КАК МаркировкаТоваровВПроизводствеОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаркировкаТоваровВПроизводствеОстатки.Номенклатура
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаОстатковКодовМаркировки.Номенклатура КАК Номенклатура,
	               |	ТаблицаОстатковКодовМаркировки.КоличествоОстаток КАК КоличествоОстатокаВПроизводстве,
	               |	ТаблицаОстатоковВПроизводстве.КоличествоОстаток КАК КоличествоОстатокМаркировки
	               |ИЗ
	               |	ТаблицаОстатоковВПроизводстве КАК ТаблицаОстатоковВПроизводстве
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКодовМаркировки КАК ТаблицаОстатковКодовМаркировки
	               |		ПО ТаблицаОстатоковВПроизводстве.Номенклатура = ТаблицаОстатковКодовМаркировки.Номенклатура
	               |			И ТаблицаОстатоковВПроизводстве.КоличествоОстаток <> ТаблицаОстатковКодовМаркировки.КоличествоОстаток";
	Запрос.УстановитьПараметр("ТипНоменклатуры", ТипНоменклатуры.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Поиск соответствия ГТИН из кода маркировки для номенклатуры и запись в регистр Штрихкодов
//
// Параметры:
//  Объект				 - ДокументСсылка - Документ, на основании которого проверяем
//  ИмяТаблицыТоваров	 - Строка - Имя табличной части документа с товарами
//  ИмяТаблицыМаркировки - Строка - Имя табличной части документа с кодами маркировки
//
Процедура дкПроверитьИДобавитьГТИННоменклатуры(
		Объект,
		ИмяТаблицыТоваров = "Товары",
		ИмяТаблицыМаркировки = "КодыМаркировки") Экспорт
	
	ГрупповаяОбработкаДокументов=Ложь;
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов", ГрупповаяОбработкаДокументов) Тогда
		ГрупповаяОбработкаДокументов=Ложь;
	КонецЕсли;
	
	// При восстановлении последовательности не выполняем
	Если ГрупповаяОбработкаДокументов Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ПраваПользователя=Объект.Права;
		ЭтотОбъект=Объект;
	Исключение
		ПраваПользователя=Объект;
		ЭтотОбъект=Неопределено;
	КонецПопытки;
	
	// Проверим наличие настройки для выполнения операции
	ДобавитьНовыйШтрихкодПриПоступленииТовара = обПраво("ДобавитьНовыйШтрихкодПриПоступленииТовара", ПраваПользователя,, ЭтотОбъект);
	
	Если НЕ ДобавитьНовыйШтрихкодПриПоступленииТовара Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТаблицаТоваров = Объект[ИмяТаблицыТоваров].Выгрузить();
	Исключение
		// У документа нет ТЧ Товары
		Возврат;
	КонецПопытки;
	
	Попытка
		ТаблицаКодовМаркировки = Объект[ИмяТаблицыМаркировки].Выгрузить();
	Исключение
		// У документа нет ТЧ Коды маркировки
		Возврат;
	КонецПопытки;
	
	// Заполним таблицу номенклатурой и ГТИН
	ТаблицаКодов = Новый ТаблицаЗначений;
	ТаблицаКодов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКодов.Колонки.Добавить("ХарактеристикаНоменклатуры",
		Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаКодов.Колонки.Добавить("ШтрихКод", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(13)));
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		// Найдем коды маркировки товара
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТовара);
		НайденныеКодыМаркировки = ТаблицаКодовМаркировки.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого СтрокаМаркировки Из НайденныеКодыМаркировки Цикл
			
			СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(СтрокаМаркировки.КодМаркировки);
			
			Если НЕ СтруктураМаркировки.Разобран Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаКодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
			СтрокаGTIN = Строка(Число(СтруктураМаркировки.ДанныеШтрихкода["01"].Значение));
			НоваяСтрока.ШтрихКод = СтрЗаменить(СтрокаGTIN, Символы.НПП, "");
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Найдем соответствие в регистре штрихкодов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТаблицаШК.Номенклатура КАК Номенклатура,
	               |	ТаблицаШК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТаблицаШК.ШтрихКод КАК ШтрихКод
	               |ПОМЕСТИТЬ ТаблицаШК
	               |ИЗ
	               |	&ТаблицаШК КАК ТаблицаШК
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаШК.Номенклатура КАК Номенклатура,
	               |	ТаблицаШК.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ТаблицаШК.ШтрихКод КАК ШтрихКод
	               |ИЗ
	               |	ТаблицаШК КАК ТаблицаШК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	               |		ПО ТаблицаШК.Номенклатура = Штрихкоды.Объект
	               |			И ТаблицаШК.ШтрихКод = Штрихкоды.Штрихкод
	               |ГДЕ
	               |	ЕСТЬNULL(Штрихкоды.GTIN, ИСТИНА)
	               |	И Штрихкоды.Объект ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ТаблицаШК", ТаблицаКодов);
	
	Если НЕ ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяЗапись = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
		НоваяЗапись.Штрихкод = Выборка.Штрихкод;
		НоваяЗапись.Объект = Выборка.Номенклатура;
		НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
		НоваяЗапись.GTIN = Ложь; // чтоб не появлялся при заказах
		НоваяЗапись.Запрет = Ложь;
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьИДобавитьГТИННоменклатуры()

#Если Клиент Тогда

// Открыие формы для сканирования маркировки
//
// Параметры:
//  ЭтаФорма	 - Форма – Форма текущего документа.
//  СтрокаТовара - СтрокаТабличнойЧасти – Ссылка на строку табличной части документа.
//
Процедура дкОткрытьФормуСканированияМаркировки(ЭтаФорма, СтрокаТовара) Экспорт
	
	Если СтрокаТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
		ФормаСканированияМаркировки = ПолучитьФорму("ОбщаяФорма.ФормаСканированияМаркировки",,ЭтаФорма);
		ФормаСканированияМаркировки.Номенклатура = СтрокаТовара.Номенклатура;
		ФормаСканированияМаркировки.СписокСчитаннойМаркировки = ЭтаФорма.КодыМаркировки.ВыгрузитьКолонку("КодМаркировки");
		
		КодМаркировки = ФормаСканированияМаркировки.ОткрытьМодально();
		
		Если КодМаркировки <> Неопределено Тогда
			НоваяСтрока = ЭтаФорма.КодыМаркировки.Добавить();
			НоваяСтрока.ИдентификаторТовара = СтрокаТовара.ИдентификаторТовара;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, КодМаркировки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Отрытие и запись сканированных кодов маркировки номенклатуры
//
// Параметры:
//  ЭтаФорма - Форма - Форма текущего документа.
//
Процедура дкОткрытьФормуСпискаКодовМаркировки(ЭтаФорма, ИмяКолонки = "КодыМаркировки", ТолькоПросмотр = Ложь, ДопПараметры = Неопределено) Экспорт
	
	ЭтоКорректировка = (ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("Корректировка"));
	ИмяТЧ = ?(ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ИмяТаблицы"), ДопПараметры.ИмяТаблицы, "Товары");
	ТекущиеДанные = ЭтаФорма.ЭлементыФормы[ИмяТЧ].ТекущиеДанные;
	
	Если ИмяКолонки = "КодыМаркировки"
		И (НЕ ТекущиеДанные = Неопределено)
		И дкЭтоМаркируемаяНоменклатура(ТекущиеДанные.Номенклатура) Тогда
		
		ФормаКодовМаркировки = ПолучитьФорму("ОбщаяФорма.ФормаСпискаМаркировок",, ЭтаФорма);
		ФормаКодовМаркировки.ТолькоПросмотр      = ЭтаФорма.ТолькоПросмотр ИЛИ ТолькоПросмотр;
		ФормаКодовМаркировки.ЭтоКорректировка    = ЭтоКорректировка;
		ФормаКодовМаркировки.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторТовара;
		ФормаКодовМаркировки.СчитанныеМаркировки = ЭтаФорма.КодыМаркировки.Выгрузить();
		
		//++СнимченкоАА_бизтех++
		ФормаКодовМаркировки.ВедетсяУчетРозлива = ТекущиеДанные.Номенклатура.ТипНоменклатуры.ТипМаркировки.ВедетсяУчетРозлива;
		//--СнимченкоАА_бизтех--
		
		Результат = ФормаКодовМаркировки.ОткрытьМодально();
		
		Если Результат <> Неопределено Тогда
			
			ИдентификаторТовара = ?(Результат.Свойство("ИдентификаторТовара"),
				Результат.ИдентификаторТовара,
				ТекущиеДанные.ИдентификаторТовара);
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ИдентификаторТовара", ИдентификаторТовара);
			
			// Найдем всю маркировку товарной строки.
			НайденныеСтроки = ЭтаФорма.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
			
			// Очистим предыдущие данные о маркировке.
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
				ЭтаФорма.КодыМаркировки.Удалить(ТекущаяСтрока);
			КонецЦикла;
			
			// Добавим заполненную маркировку 
			Для Каждого ТекущаяСтрока Из Результат.КодыМаркировки Цикл
				НоваяСтрока = ЭтаФорма.КодыМаркировки.Добавить();
				НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЦикла;
			
			// Проверим количество маркировки и количество товара в строке
			НайденнаяСтрока = ЭтаФорма[ИмяТЧ].НайтиСтроки(СтруктураПоиска)[0];
			
			Если ЭтоКорректировка Тогда
				КоличествоМаркировки = Результат.КодыМаркировки.НайтиСтроки(Новый Структура("Возврат", Ложь)).Количество();
			Иначе
				КоличествоМаркировки = Результат.КодыМаркировки.Количество();
			КонецЕсли;
			
			Если НайденнаяСтрока.Количество * НайденнаяСтрока.Коэффициент < КоличествоМаркировки и НЕ ФормаКодовМаркировки.ВедетсяУчетРозлива Тогда
				
				Коэффициент = ?(НайденнаяСтрока.Коэффициент = 0, 1, НайденнаяСтрока.Коэффициент);
				ДобавитьКоличество = Окр((КоличествоМаркировки - НайденнаяСтрока.Количество * Коэффициент) / Коэффициент, 3);
				
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + ДобавитьКоличество;
				ЭтаФорма.ОбработкаРеквизита("Товары.Количество", НайденнаяСтрока, ЭтаФорма, ДопПараметры);
				Если ЭтоКорректировка Тогда
					ЭтаФорма.ОбработкаРеквизита("Товары.РасчетРазницы", НайденнаяСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // дкОткрытьФормуСпискаКодовМаркировки()

Процедура дкУдалитьКодыМаркировкиСтроки(ЭтаФорма, Строка, ТаблицаМаркировки = "КодыМаркировки") Экспорт
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара", Строка.ИдентификаторТовара);
	СтрокиМаркировки = ЭтаФорма[ТаблицаМаркировки].НайтиСтроки(СтруктураПоиска);
	
	Для Каждого ТекущаяСтрока Из СтрокиМаркировки Цикл
		ЭтаФорма[ТаблицаМаркировки].Удалить(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры // дкУдалитьКодыМаркировкиСтроки()

#КонецЕсли

// Проверка соответствия номенклатуры товарной группе документа.
//
// Параметры:
//  Объект	 - ДокументОбъект - Проверяемый документ.
//  ТаблицыТоваров - Строка - (необязательный). Табличные части документа, содержащие Номенклатуру (если несколько - через ",").
//  ИмяРеквизита - Строка - необязательный). Имена реквизитов Номенклатуры (если несколько - через ",").
//
// Возвращаемое значение:
//  Булево - Истина, если нет ошибок. ЛОжь - в противном случае.
//
Функция дкПроверитьСоответствиеНоменклатурыТоварнойГруппе(Объект, ТаблицыТоваров = "Товары", ИмяРеквизита = "Номенклатура", Ошибки) Экспорт
	
	Если НЕ обПраво("ПроверкаЗаполненияСправочниковИДокументов",,,Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		Если Объект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов")
			И Объект.ДополнительныеСвойства.ГрупповаяОбработкаДокументов Тогда
			Возврат Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	НоменклатурыВТаблицах = Новый Структура;
	ОбщийСписокНоменклатуры = Новый Массив;
	
	ТабличныеЧасти = СтрРазделить(ТаблицыТоваров, ",");
	РеквизитыНоменклатуры = СтрРазделить(ИмяРеквизита, ",");
	
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
			НоменклатураВТаблице = Объект[ТабличнаяЧасть].Выгрузить().ВыгрузитьКолонку(Реквизит);
			Если НоменклатураВТаблице.Количество() Тогда
				НоменклатурыВТаблицах.Вставить(ТабличнаяЧасть, НоменклатураВТаблице);
				Для Каждого Значение Из НоменклатурыВТаблицах[ТабличнаяЧасть] Цикл
					Если ОбщийСписокНоменклатуры.Найти(Значение) = Неопределено Тогда
						ОбщийСписокНоменклатуры.Добавить(Значение);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если НЕ ОбщийСписокНоменклатуры.Количество() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТипыНоменклатуры = дкТипыНоменклатурыТоварнойГруппы(Объект.ТоварнаяГруппа);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.Ссылка КАК НоменклатураНовая,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Ссылка) КАК НоменклатураПредставление
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)
	|	И НЕ Номенклатура.ТипНоменклатуры В (&ТипыНоменклатуры)");
	Запрос.УстановитьПараметр("СписокНоменклатуры", ОбщийСписокНоменклатуры);
	Запрос.УстановитьПараметр("ТипыНоменклатуры", ТипыНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	НетОшибокЗаполнения = Истина;
	ПлохаяНоменклатура = РезультатЗапроса.Выгрузить();
	ТоварнаяГруппаПредставление = Строка(Объект.ТоварнаяГруппа);
	
	Для Каждого Строка Из ПлохаяНоменклатура Цикл
		Для Каждого КлючЗначение Из НоменклатурыВТаблицах Цикл
			Для Каждого Реквизит Из РеквизитыНоменклатуры Цикл
				СтрокиВТаблице = Объект[КлючЗначение.Ключ].НайтиСтроки(Новый Структура(Реквизит, Строка[Реквизит]));
				Если НЕ СтрокиВТаблице.Количество() Тогда
					Продолжить;
				КонецЕсли;
				НетОшибокЗаполнения = Ложь;
				Для Каждого СтрокаВТаблице Из СтрокиВТаблице Цикл
					дкДобавитьОшибку(Ошибки, "В строке <" + СтрокаВТаблице.НомерСтроки + "> тип номенклатуры <" + Строка.НоменклатураПредставление + "> недопустим для выбранной группы товаров <" + ТоварнаяГруппаПредставление + ">");
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат НетОшибокЗаполнения;
	
КонецФункции

Функция дкТипыНоменклатурыТоварнойГруппы(ТоварнаяГруппа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТипыНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры
	|ГДЕ
	|	ТипыНоменклатуры.ТипМаркировки = &ТоварнаяГруппа
	|	И ТипыНоменклатуры.ВедетсяМаркировка";
	Запрос.УстановитьПараметр("ТоварнаяГруппа", ТоварнаяГруппа);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Получение доступного списка товарных групп
//
// Параметры:
//  УсловиеВыбора	 - Строка - Условие выбора товарных групп
// 
// Возвращаемое значение:
//  Массив - Список товарных групп
//
Функция дкСписокТоварныхГрупп(УсловиеВыбора = "") Экспорт
	
	УсловиеОтбора = УсловиеВыбора;
	Если НЕ ЗначениеЗаполнено(УсловиеОтбора) Тогда
		УсловиеОтбора = "ТипыМаркировки.ТоварнаяГруппа <> """"";
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТипыМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыМаркировки КАК ТипыМаркировки
	|ГДЕ
	|	ТипыМаркировки.ДоступноСозданиеДокументов
	|	И #УсловиеОтбора";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#УсловиеОтбора", УсловиеОтбора);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

// Возвращает тованрую группу из перечня номенклатуры.
//
// Параметры:
//  Номенклатура - Массив из СправочникСсылка.Номенклатура - номенклатура из табличной части.
//  УсловиеВыбора - Строка - условие отбора товарных групп в зависимости от документа.
//
// Возвращаемое значение:
//  СправочникСсылка.ТипыМаркировки - товарная группа.
//
Функция дкТоварнаяГруппа(Номенклатура, УсловиеВыбора = "") Экспорт
	
	УсловиеОтбора = УсловиеВыбора;
	Если НЕ ЗначениеЗаполнено(УсловиеОтбора) Тогда
		УсловиеОтбора = "ТипыМаркировки.ТоварнаяГруппа <> """"";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ПОМЕСТИТЬ ТипыНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ТипыМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	ТипыНоменклатуры КАК ТипыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыМаркировки КАК ТипыМаркировки
	|		ПО ТипыНоменклатуры.ТипНоменклатуры.ТипМаркировки = ТипыМаркировки.Ссылка
	|ГДЕ
	|	#УсловиеОтбора";
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "#УсловиеОтбора", УсловиеОтбора);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ТипыМаркировки.ПустаяСсылка();
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	
КонецФункции

#КонецОбласти

#Область ПрослеживаемыйТовар

Функция дкЭтоПрослеживаемыйТовар(Номенклатура) Экспорт
	
	Попытка
		Возврат Номенклатура.Прослеживаемый;
	Исключение
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция дкДокументСПрослеживаемымиТоварами(Объект) Экспорт
	
	СписокДокументов = дкСписокДокументовСПрослеживаемымиТоварами();
	
	Возврат СписокДокументов.Найти(Объект.Метаданные()) <> Неопределено;
	
КонецФункции

Функция дкСписокДокументовСПрослеживаемымиТоварами() Экспорт
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураВыданный);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураПолученный);
	СписокДокументов.Добавить(Метаданные.Документы.ИзвлечениеТоваровИзПроизводства);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеТоваровВПроизводство);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеНезавершенногоПроизводства);
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.ЗаказНаряд);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаПоступления);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаПоступленияАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаРеализации);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаРеализацииАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.ТаможеннаяДекларацияИмпорт);
	СписокДокументов.Добавить(Метаданные.Документы.АвансовыйОтчет);
	СписокДокументов.Добавить(Метаданные.Документы.ВводОстатковАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.ВводОстатковТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.ВводОстатковТоваровВПроизводстве);
	СписокДокументов.Добавить(Метаданные.Документы.ВозвратОтПокупателя);
	СписокДокументов.Добавить(Метаданные.Документы.ВозвратПоставщику);
	СписокДокументов.Добавить(Метаданные.Документы.Инвентаризация);
	СписокДокументов.Добавить(Метаданные.Документы.ОбслуживаниеАктива);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.ПересортицаТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.СписаниеТоваров);
	
	Возврат СписокДокументов;
	
КонецФункции

Процедура дкПроверитьКорректностьРНПТ(Объект, ИмяТабличнойЧасти = "Товары", ИмяНоменклатуры = "Номенклатура", ИмяГТД = "ГТД") Экспорт
	
	Если Объект.Дата < Дата("20210701000000") Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента = Объект.Метаданные().Имя;
	Если НЕ дкДокументЕстьТабЧасть(ВидДокумента, ИмяТабличнойЧасти)
		ИЛИ НЕ дкДокументЕстьРеквизитТабЧасти(ИмяГТД, ВидДокумента, ИмяТабличнойЧасти)
		ИЛИ НЕ дкДокументЕстьРеквизитТабЧасти(ИмяНоменклатуры, ВидДокумента, ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = обПолучитьСинонимРеквизита(Объект.Метаданные(), , ИмяТабличнойЧасти);
	
	Для Каждого ТекущаяСтрока Из Объект[ИмяТабличнойЧасти] Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока[ИмяГТД]) Тогда
			Продолжить;
		КонецЕсли;
		
		ПрослеживаемыйТовар = дкЭтоПрослеживаемыйТовар(ТекущаяСтрока[ИмяНоменклатуры]);
		ЭтоРНПТ = ТекущаяСтрока[ИмяГТД].РНПТ;
		
		Если ПрослеживаемыйТовар И НЕ ЭтоРНПТ Тогда
			Сообщить("Таблица <"+ИмяТаблицы+">. У прослеживаемого товара <"
				+ ТекущаяСтрока[ИмяНоменклатуры] +"> указан номер ГТД вместо РНПТ. Строка номер " + СокрЛП(ТекущаяСтрока.НомерСтроки));
		ИначеЕсли НЕ ПрослеживаемыйТовар И ЭтоРНПТ Тогда
			Сообщить("Таблица <"+ИмяТаблицы+">. У номенклатуры <"
				+ ТекущаяСтрока[ИмяНоменклатуры] +"> указан РНПТ вместо номера ГТД. Строка номер " + СокрЛП(ТекущаяСтрока.НомерСтроки));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция дкЕстьВведенныеДокументыПрослеживаемости(Объект, ИмяДокумента = "УведомлениеОВвозеПрослеживаемыхТоваров") Экспорт
	
	Попытка
		Если Объект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов")
			И Объект.ДополнительныеСвойства.ГрупповаяОбработкаДокументов Тогда
			Возврат Ложь;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументПрослеживаемости.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ."+ИмяДокумента+" КАК ДокументПрослеживаемости
	               |ГДЕ
	               |	ДокументПрослеживаемости.ДокументОснование = &ДокументОснование
	               |	И ДокументПрослеживаемости.Проведен";
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	#Если Клиент Тогда
		Пока Выборка.Следующий() Цикл
			Сообщить("На основании документа введен <" + Выборка.Ссылка + ">. Необходимо сначала отменить его проведение.");
		КонецЦикла;
	#КонецЕсли
	
	Возврат Истина;
	
КонецФункции

#Если Клиент Тогда

// Начало выбора "ГТД/РНПТ номенклатуры". 
//
// Параметры:
// ЭтаФорма  - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент  - поле ввода колонки табличной части документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыГТДНачалоВыбора(ЭтаФорма,ТабличноеПоле,Элемент,СтандартнаяОбработка, ИмяРеквизита = "Номенклатура") Экспорт
	
	// получим текущую строку
	ТекСтрока = ТабличноеПоле.ТекущиеДанные;
	// если нет текущей строки или не выбрана номенклатура, то выходим
	Если (ТекСтрока = Неопределено) или (обЗначениеНеЗаполнено(ТекСтрока[ИмяРеквизита])) Тогда
		Возврат;
	КонецЕсли;
	
	// перекрываем стандартный обработчик
	СтандартнаяОбработка = Ложь;
	
	// получим форму из которой будем выбирать хар-ки
	ФормаВыбора = Справочники.ГТД.ПолучитьФорму("ФормаСписка", Элемент);
	ФормаВыбора.ПараметрТекущаяСтрока = Элемент.Значение;
	
	ФормаВыбора.Отбор.РНПТ.ВидСравнения = ВидСравнения.Равно;
	ФормаВыбора.Отбор.РНПТ.Значение = дкЭтоПрослеживаемыйТовар(ТекСтрока[ИмяРеквизита]);
	ФормаВыбора.Отбор.РНПТ.Использование = Истина;
	
	// установим режим для выбора	
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.ЗакрыватьПриВыборе = Истина;
	ФормаВыбора.МножественныйВыбор = Ложь;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТОВ

#Если Клиент Тогда

// Функция возвращает список печатных форм документа, основных и внешних
//
// Параметры
//  Документ - ДокументСсылка - Ссылка на документ, у которого получается список печатных форм
//
// Возвращаемое значение:
//   СписокЗначений – Список печатных форм документа
//
Функция дкПолучитьСписокВнешнихПечатныхФорм(Документ,ПечатныеФормы) Экспорт
	ИмяМетаданного = Документ.Метаданные().Имя;
	
	Если ТипЗнч(ПечатныеФормы)<>Тип("Структура") И ТипЗнч(ПечатныеФормы)<>Тип("СписокЗначений")Тогда
		ПечатныеФормы = Новый СписокЗначений;
	КонецЕсли;
	
	// добавим внешние печатные формы
	Попытка
		ФормыЕстьВСправочнике = Ложь;
		ТипОбъекта = "Документ." + ИмяМетаданного;
		ЗапросПоВнешнимФормам=Новый Запрос("ВЫБРАТЬ
		                                   |	ВнешниеПечатныеФормы.Ссылка КАК ВнешняяОбрабтка,
		                                   |	ВнешниеПечатныеФормы.Наименование КАК Наименование,
		                                   |	ВнешниеПечатныеФормы.Код КАК Код,
		                                   |	ВнешниеПечатныеФормыПринадлежность.НастройкиПостроителяОтбор КАК НастройкиПостроителяОтбор,
		                                   |	ВнешниеПечатныеФормы.ДляВсехДокументов КАК ДляВсех,
		                                   |	ВнешниеПечатныеФормы.ВидОбработки
		                                   |ИЗ
		                                   |	Справочник.ВнешниеПечатныеФормы КАК ВнешниеПечатныеФормы
		                                   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнешниеПечатныеФормы.Принадлежность КАК ВнешниеПечатныеФормыПринадлежность
		                                   |		ПО (ВнешниеПечатныеФормыПринадлежность.Ссылка = ВнешниеПечатныеФормы.Ссылка)
		                                   |ГДЕ
		                                   |	ВнешниеПечатныеФормы.ПометкаУдаления = ЛОЖЬ
		                                   |	И ВнешниеПечатныеФормы.ЭтоГруппа = ЛОЖЬ
		                                   |	И (ВнешниеПечатныеФормы.ДляВсехДокументов = ИСТИНА
		                                   |			ИЛИ ЕСТЬNULL(ВнешниеПечатныеФормыПринадлежность.ИмяОбъекта, """") = &ТипОбъекта)
		                                   |	И ВнешниеПечатныеФормы.ВидОбработки В(&ВидОбработки)
		                                   |УПОРЯДОЧИТЬ ПО
		                                   |	Наименование");
		ЗапросПоВнешнимФормам.УстановитьПараметр("ТипОбъекта",ТипОбъекта);
		ВидОбработки = Новый СписокЗначений;
		ВидОбработки.Добавить(Перечисления.ВидыВнешнихОбработок.ПечатнаяФорма);
		ВидОбработки.Добавить(Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы);
		ЗапросПоВнешнимФормам.УстановитьПараметр("ВидОбработки",ВидОбработки);
		Выборка=ЗапросПоВнешнимФормам.Выполнить().Выбрать();
		Если Выборка.Количество()>0 Тогда
			ФормыЕстьВСправочнике=Истина;
			Пока Выборка.Следующий() Цикл
				ПостроительОтбора=обИнициализироватьПостроительПечатныхФорм(ТипОбъекта, "");
				ПостроительОтбора.Параметры.Вставить("Ссылка", Документ);
				Попытка
					ЗначениеХранилища = Выборка.НастройкиПостроителяОтбор.Получить();
				Исключение
					ЗначениеХранилища = Неопределено;
				КонецПопытки;
				Если (НЕ Выборка.ДляВсех) И (НЕ обЗначениеНеЗаполнено(ЗначениеХранилища)) Тогда
					Если ТипЗнч(ЗначениеХранилища) = Тип("НастройкиПостроителяОтчета") Тогда
						ПостроительОтбора.УстановитьНастройки(ЗначениеХранилища,Истина,Ложь,Ложь,Ложь,Ложь);
					КонецЕсли;
					ПостроительОтбора.Выполнить();
					Если ПостроительОтбора.Результат.Пустой() Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				Если Выборка.ВидОбработки = Перечисления.ВидыВнешнихОбработок.ПечатнаяФорма Тогда
					ПечатныеФормы.Вставить("_"+СокрЛП(Выборка.Код),Выборка.Наименование+" (внешняя)");
				ИначеЕсли Выборка.ВидОбработки = Перечисления.ВидыВнешнихОбработок.ШаблонПечатнойФормы  Тогда
					ПечатныеФормы.Вставить("_"+СокрЛП(Выборка.Код),Выборка.Наименование+" (шаблон)");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат ПечатныеФормы;
КонецФункции // дкПолучитьСписокВнешнихПечатныхФорм() 

Функция дкПолучитьСписокПечатныхФорм(СсылкаДокумента, Знач ИмяОбъекта = Неопределено, ВернутьТаблицу = Истина) Экспорт
	
	// получим имя объекта если не задано
	Если ИмяОбъекта = Неопределено Тогда
		ИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(СсылкаДокумента)).Имя;
	КонецЕсли;
	
	// получим стандартные печатные формы
	Попытка
		ПечатныеФормыСтандартные = Документы[ИмяОбъекта].ПолучитьСписокПечатныхФорм(?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента, Документы[ИмяОбъекта].ПустаяСсылка()));
	Исключение
		Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
			ПечатныеФормыСтандартные = СсылкаДокумента.ПолучитьОбъект().ПолучитьСписокПечатныхФорм(СсылкаДокумента);
		Иначе
			ПечатныеФормыСтандартные = Новый Структура();
		КонецЕсли;			
		//ПечатныеФормыСтандартные = ?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента.ПолучитьОбъект(), Документы[ИмяОбъекта].СоздатьДокумент()).ПолучитьСписокПечатныхФорм();
	КонецПопытки;
	
	//БИЗТЕХ КОВАЛЬ ++ Отключение печатных форм для скорости
	Попытка
		ОтключитьПечатныеФормы = Справочники.БТ_СписокКонстантныхЗначений.НайтиПоНаименованию("ОтключитьПечатныеФормыВДокументах").ТаблицаДанных[0].Значение;
	Исключение
		ОтключитьПечатныеФормы = Ложь;
	КонецПопытки;
	Если (ПараметрыСеанса.Пользователь.Код = "БизТех                                            " 
		ИЛИ
		ПараметрыСеанса.Пользователь.Код = "Салай А.А.                                        ") И ОтключитьПечатныеФормы = Истина Тогда 
		ПечатныеФормы = новый Структура();
	Иначе
		ПечатныеФормы = дкПолучитьСписокВнешнихПечатныхФорм(?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента, Документы[ИмяОбъекта].ПустаяСсылка()), ПечатныеФормыСтандартные);
	КонецЕсли;
	//ПечатныеФормы = дкПолучитьСписокВнешнихПечатныхФорм(?(ЗначениеЗаполнено(СсылкаДокумента), СсылкаДокумента, Документы[ИмяОбъекта].ПустаяСсылка()), ПечатныеФормыСтандартные);
	//БИЗТЕХ КОВАЛЬ --
	
	// получим текущую печатную форму
	ПечатнаяФорма = "";
	ИмяСохраненнойПечатнойФормы = ВосстановитьЗначение(ИмяОбъекта + "ПечатнаяФорма");
	Если ИмяСохраненнойПечатнойФормы <> Неопределено Тогда
		Попытка
			ПечатнаяФорма = дкПолучитьПечатнуюФорму(ПечатныеФормы, ИмяСохраненнойПечатнойФормы);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	// если у нас нет текущей печатной формы, то пометим первую
	Если ПечатнаяФорма = Неопределено Тогда
		Для каждого врПечатнаяФорма Из ПечатныеФормы Цикл Прервать; КонецЦикла;
		Если врПечатнаяФорма <> Неопределено Тогда
			ПечатнаяФорма = врПечатнаяФорма.Ключ;
		КонецЕсли; 
	КонецЕсли;
	
	Если НЕ ВернутьТаблицу Тогда
		Возврат ПечатныеФормы;
	КонецЕсли;
	
	// таблица печатных форм
	ПечатныеФормыРезультат = Новый ТаблицаЗначений;
	ПечатныеФормыРезультат.Колонки.Добавить("Ключ");
	ПечатныеФормыРезультат.Колонки.Добавить("Значение");
	ПечатныеФормыРезультат.Колонки.Добавить("Пометка");
	
	// заполним итоговою страницу
	Для Каждого ТекМакет Из ПечатныеФормы Цикл
		НоваяПечатнаяФорма = ПечатныеФормыРезультат.Добавить();
		НоваяПечатнаяФорма.Ключ     = ТекМакет.Ключ;
		НоваяПечатнаяФорма.Значение = ТекМакет.Значение;
		НоваяПечатнаяФорма.Пометка  = (ПечатнаяФорма = ТекМакет.Ключ);
	КонецЦикла;
	
	Возврат ПечатныеФормыРезультат;
	
КонецФункции

// Формирование меню со списком печатных форм документа
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Процедура дкСформироватьМенюВыбораПечатнойФормы(Форма, СсылкаДокумента = Неопределено, КнопкаПечатьВыбор = Неопределено) Экспорт
	
	// Формируем меню со списком доступных печатных форм
	// заполним подменю выбора печатных форм
	Попытка
		ТипЗначенияДокумента = ТипЗнч(Форма.ДокументСписок);
	Исключение
		Попытка
			ТипЗначенияДокумента = ТипЗнч(Форма.ДокументОбъект);
		Исключение
			Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
				ТипЗначенияДокумента = ТипЗнч(СсылкаДокумента);
			Иначе
				Возврат;
			КонецЕсли;
		КонецПопытки;
	КонецПопытки;
	
	// получим имя документа в методанных
	ИмяОбъекта = Метаданные.НайтиПоТипу(ТипЗначенияДокумента).Имя;
	
	Если КнопкаПечатьВыбор = Неопределено Тогда
		Попытка
			КнопкаПечатьВыбор = Форма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПечатьВыбор;
		Исключение Возврат; КонецПопытки;
	КонецЕсли;
	
	КнопкаПечатьВыбор.Кнопки.Очистить();
	
	ТаблицаПечатныхФорм = дкПолучитьСписокПечатныхФорм(СсылкаДокумента, ИмяОбъекта);
	
	Для Каждого ТекМакет Из ТаблицаПечатныхФорм Цикл
		НовоеДействие = КнопкаПечатьВыбор.Кнопки.Добавить(ТекМакет.Ключ,ТипКнопкиКоманднойПанели.Действие,ТекМакет.Значение,Новый Действие("ОсновныеДействияФормыПечатьВыбор"));
		НовоеДействие.Пометка = ТекМакет.Пометка;
	КонецЦикла;
	
	//Добавим кнопку пакетной печати
	Попытка
		Если КнопкаПечатьВыбор.Кнопки.Найти("ПакетнаяПечатьРазделитель")=Неопределено Тогда
			КнопкаПечатьВыбор.Кнопки.Добавить("ПакетнаяПечатьРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
		КонецЕсли; 
		Если КнопкаПечатьВыбор.Кнопки.Найти("ПакетнаяПечать")=Неопределено Тогда
			КнопкаПечатьВыбор.Кнопки.Добавить("ПакетнаяПечать",ТипКнопкиКоманднойПанели.Действие,"Пакетная печать",Новый Действие("ДополнительныеДействияФормы"));
		КонецЕсли;
	Исключение КонецПопытки;
	
КонецПроцедуры // дкСформироватьМенюВыбораПечатнойФормы()

//функция, добавляет итоги по странице печатной формы
//
// Параметры:
// ТекСтрока - СтрокаТабличнойЧасти - обрабатываемая строка
//
Процедура дкДобавитьИтогиПоСтранице(ТекСтрока,СтруктураИтоговПоСтранице) Экспорт
	Для Каждого ЭлементСтруктуры Из СтруктураИтоговПоСтранице Цикл
		Если ЭлементСтруктуры.Ключ = "ВалютаДокумента" Тогда
			Продолжить;
		КонецЕсли;
		НовоеЗначение = ЭлементСтруктуры.Значение + ТекСтрока[ЭлементСтруктуры.Ключ];
		Если ЭлементСтруктуры.Ключ = "СуммаСкидки" Тогда
			Попытка
				НовоеЗначение = НовоеЗначение + ТекСтрока["СуммаСкидкиСтроки"];
			Исключение
			КонецПопытки; 
		КонецЕсли; 
		СтруктураИтоговПоСтранице.Вставить(ЭлементСтруктуры.Ключ,НовоеЗначение);
	КонецЦикла;
КонецПроцедуры // дкДобавитьИтогиПоСтранице()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект						- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 			- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров			- Число				- Количество экземпляров документа
//	НаПринтер						- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  					- ТабличныйДокумент	- Макет печатной формы
// 	ДопПараметры					– Структура			– Содержит дополнительные параметры печати
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция дкПечать(ЭтотОбъект, НазваниеПечатнойФормы = "", КоличествоЭкземпляров = 0, НаПринтер = Ложь, Документ = Неопределено, ДопПараметры = Неопределено) Экспорт
		
	// БИЗТЕХ КОВАЛЬ 10.01.2026 ++
	// Статистика печатных форм
	Попытка
		МодульСтатистики = Вычислить("БТ_СтатистикаПечатныхФорм");
	Исключение
	КонецПопытки;
	
	Если ТипЗнч(МодульСтатистики) = Тип("ОбщийМодуль") Тогда
		Попытка
			МодульСтатистики.ЗаписатьСтатистикуПечатнойФормы(ЭтотОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	// БИЗТЕХ КОВАЛЬ 10.01.2026 --
	
	//БИЗТЕХ КОВАЛЬ 29.08.2025 ++
	//Подмена объекта документа для печати для заказов на авто, реализаций, и счет фактур для О2
	НовыйОбъектсПодразделением = БТ_СлужебныеФункции.ПодменитьПодразделениеДокументаДляПечатиО2(ЭтотОбъект);
	//
	
	Попытка
		//БИЗТЕХ КОВАЛЬ 29.08.2025 ++
		Если НовыйОбъектсПодразделением <> Неопределено Тогда
			Возврат зфПечать(НовыйОбъектсПодразделением, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ, ДопПараметры);
		Иначе
			Возврат зфПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ, ДопПараметры);
		КонецЕсли;
		//Возврат зфПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ, ДопПараметры);
		//БИЗТЕХ КОВАЛЬ 29.08.2025 --
	Исключение
		Предупреждение("При печати документа произошла ошибка! Возможно ошибка во внешней печатной форме.");
		Возврат Документ;
	КонецПопытки;
КонецФункции // дкПечать()

// Процедура вызова обработчика печати этикеток и ценников
//
// Параметры:
// ЭтотОбъект 		 – ДокументСсылка – Ссылка на документ, товары которого мы хотим напечатать на ценниках
// ТабличнаяЧастьОбъекта – ДокументТабличнаяЧасть – Табличная часть документа, которую надо напечатать
//
Процедура дкПечатьЭтикетокИЦенников(ЭтотОбъект,СтруктураПараметров = Неопределено) Экспорт
	ОбработкаПечатиЭтикетокИЦенников = Обработки.ПечатьЭтикетокИЦенников.Создать();
	ВыполнитьОткрытиеОбработки = ОбработкаПечатиЭтикетокИЦенников.ЗаполнитьПоДокументу(ЭтотОбъект,СтруктураПараметров);
	Если ВыполнитьОткрытиеОбработки Тогда
		ФормаОбработки = ОбработкаПечатиЭтикетокИЦенников.ПолучитьФорму();
		ФормаОбработки.Открыть();
	КонецЕсли; 
КонецПроцедуры // дкПечатьЭтикетокИЦенников()

//приводит макет печ. формы в соответствие с данными документа
//
// Параметры:
// ЭтотОбъект - ДокументОбъект - документ, для которого производится действие
// Макет	 - макет печ. формы
//
// Возвращаемое значение:
// Область шапки таблицы с заполненными параметрами
//
Функция дкПривестиМакетПечатнойФормы(ЭтотОбъект,Макет) Экспорт
	
	//получим права
	Попытка ПраваПользователя = ЭтотОбъект.Права;
	Исключение ПраваПользователя = Неопределено;
	КонецПопытки;
	
	ОбластьТовар = Макет.Область("Товар");
	//определяем есть ли скидки
	ЕстьСкидка = Ложь;
	Попытка
		Если ЭтотОбъект.Товары.Итог("СуммаСкидки") <> 0 ИЛИ ЭтотОбъект.Товары.Итог("СуммаСкидкиСтроки") <> 0 ИЛИ ЭтотОбъект.Товары.Итог("СуммаСкидкиБонусами") <> 0 Тогда
			ЕстьСкидка = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		Если Не ЕстьСкидка Тогда
			ОбластьСкидка = Макет.Область("Скидка");
			ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьСкидка.ШиринаКолонки;
			Макет.УдалитьОбласть(ОбластьСкидка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ЕстьКод = обПраво("ВыводитьКодВПечатныхФормах",ПраваПользователя,,ЭтотОбъект);
	
	//если код не выводим
	Если НЕ ЕстьКод Тогда
		ОбластьКод = Макет.Область("Код");
		ОбластьТовар.ШиринаКолонки = ОбластьТовар.ШиринаКолонки + ОбластьКод.ШиринаКолонки;
		Макет.УдалитьОбласть(ОбластьКод,ТипСмещенияТабличногоДокумента.ПоВертикали);		
	КонецЕсли;
	
	//anton
	Попытка
		//теперь запишем параметры шапки
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		Если ЕстьКод Тогда
			КолонкаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(,ПраваПользователя);
			ОбластьМакета.Параметры.ИмяКолонкиКод = КолонкаКода.Синоним;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//anton
	
	//заполняем заголовок колонки НДС по типу цен
	Попытка
		ОбластьМакета.Параметры.НДС = "НДС";
		ТипЦен = ЭтотОбъект.ТипЦен;
		Если ТипЦен.ЦенаВключаетНДС Тогда	// Если НДС включен
			Если НЕ (ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ ЭтотОбъект.Организация.ОсвобожденОтНДС) Тогда	// Однако не все организации - плательщики НДС
				ОбластьМакета.Параметры.НДС = "в т.ч. НДС";
			КонецЕсли; 
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат ОбластьМакета;
КонецФункции // дкПривестиМакетПечатнойФормы()

// печать новой печатной формы ТТН
// Параметры:
//	ДокументОбъект - Документ объект печати
//	ТабДокумент    - начальный табличный документ
//
Функция дкПечатьНовойТТН(ДокументОбъект, ТабДокумент) Экспорт
	ИмяРеквизитаОтправителя = "СкладКомпании";
	ИмяРеквизитаПолучателя  = "СкладПолучатель";
	
	ТипДок = ТипЗнч(ДокументОбъект);
	
	Если ТипДок = Тип("ДокументОбъект.ИзвлечениеТоваровИзПроизводства") Тогда
		ИмяРеквизитаОтправителя = "Цех";
		ИмяРеквизитаПолучателя  = "СкладКомпании";
	ИначеЕсли ТипДок = Тип("ДокументОбъект.ПеремещениеТоваровВПроизводство") Тогда
		ИмяРеквизитаОтправителя = "СкладКомпании";
		ИмяРеквизитаПолучателя  = "Цех";
	ИначеЕсли ТипДок = Тип("ДокументОбъект.РеализацияТоваров") ИЛИ ТипДок = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
		ИмяРеквизитаОтправителя = "СкладКомпании";
		ИмяРеквизитаПолучателя  = "Контрагент";
	ИначеЕсли ТипДок = Тип("ДокументОбъект.ПеремещениеНезавершенногоПроизводства")  Тогда
		ИмяРеквизитаОтправителя = "Цех";
		ИмяРеквизитаПолучателя  = "ЦехПолучатель";
	КонецЕсли;
	
	Если ДокументОбъект.Дата < '20120313' Тогда
		Макет = ПолучитьОбщийМакет("ТТН25072011");
	ИначеЕсли ДокументОбъект.Дата < '20210101' Тогда
		Макет = ПолучитьОбщийМакет("ТТН30122011_Приложение4");
	ИначеЕсли ДокументОбъект.Дата < '20220301'  Тогда
		Макет = ПолучитьОбщийМакет("ТТН21122020_Приложение4");
	Иначе 
		Макет = ПолучитьОбщийМакет("ТН01032022_Приложение4");
	КонецЕсли;
	
	Если  ДокументОбъект.Дата < '20220301' Тогда
		СтруктураОбластей = Новый Структура("Шапка,Пункт12,Пункт3,Пункт4,Пункт5,Пункт67,Пункт8,Пункт9,Пункт10,Пункт11,Пункт12,Пункт_12,Пункт13,Пункт14,Пункт15,Пункт16,Пункт17");
	Иначе 
		СтруктураОбластей = Новый Структура("Шапка,Пункт1, Пункт2, Пункт3,Пункт4,Пункт5,Пункт6,Пункт7,Пункт8,Пункт9,Пункт10,Пункт11,Пункт12");
	КонецЕсли;
		
	// заполним шапку
	СтруктураПредставления=Новый Структура(
	"Наименование,ИНН,КПП,АдресФактический,ТелефонРабочий,БанковскийСчет,Банк,БИК,КоррСчет",
	"","ИНН ","КПП ","","тел.: ","р/с ","в банке ","БИК ","к/с ");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ВесьМакет");
	
	ОбщийВес = 0;
	КоличествоМест = 0;
	
	Для Каждого ИмяТабличнойЧасти Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
		Если ИмяТабличнойЧасти.Имя = "Товары" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				Попытка
					КоличествоМест = КоличествоМест + ТекСтрока.Количество;
				Исключение
				КонецПопытки;
				Попытка
					ОбщийВес = ОбщийВес + ТекСтрока.Количество*Справочники.Номенклатура.ПолучитьВесНоменклатуры(ТекСтрока.Номенклатура, ТекСтрока.ЕдиницаИзмерения);
				Исключение
				КонецПопытки;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Автомобили" Тогда
			Для Каждого ТекСтрока Из ДокументОбъект[ИмяТабличнойЧасти.Имя] Цикл
				КоличествоМест = КоличествоМест + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// заполение параметров
	ДатаДляПечати    = Формат(ДокументОбъект.Дата,"ДФ=dd.MM.yyyy");
	Грузоотправитель = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузоотправитель",ДокументОбъект[ИмяРеквизитаОтправителя]);
	Грузополучатель  = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель",ДокументОбъект[ИмяРеквизитаПолучателя]);
	
	Если ДокументОбъект.Дата >= '20210101' Тогда
		ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата = ДатаДляПечати;
	КонецЕсли;
	
	// заполним адреса
	Если ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.СкладыКомпании")
		ИЛИ ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.Цеха") Тогда
		
		ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
		ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
		ДополнительныеПараметры.Вставить("ПодразделениеКомпании", Грузоотправитель.Подразделение);
		ОбластьМакета.Параметры.Грузоотправитель = спПолучитьПредставление(Грузоотправитель.Организация,
			СтруктураПредставления, ДополнительныеПараметры);
		
	ИначеЕсли ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		ОбластьМакета.Параметры.Грузоотправитель = спПолучитьПредставление(Грузоотправитель, СтруктураПредставления);
		
	Иначе
		
		ОбластьМакета.Параметры.Грузоотправитель = Грузоотправитель.Наименование;
		
	КонецЕсли;
	
	Если ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Цеха")
		ИЛИ ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.СкладыКомпании") Тогда
		
		ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
		ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
		ДополнительныеПараметры.Вставить("ПодразделениеКомпании", Грузополучатель.Подразделение);
		
		ОбластьМакета.Параметры.Грузополучатель = спПолучитьПредставление(Грузополучатель.Организация,
			СтруктураПредставления, ДополнительныеПараметры);
		
	ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		
		ОбластьМакета.Параметры.Грузополучатель = спПолучитьПредставление(Грузополучатель, СтруктураПредставления);
		
	ИначеЕсли ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		ОбластьМакета.Параметры.Грузополучатель = спПолучитьПредставление(Грузополучатель, СтруктураПредставления);
		
	Иначе
		
		ОбластьМакета.Параметры.Грузополучатель = Грузополучатель.Наименование;
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.МассаГруза      = "Масса брутто груза: " + ОбщийВес;
	ОбластьМакета.Параметры.КоличествоГруза = "Количество грузовых мест: " + КоличествоМест;
	
	// заполним дату
	Если ДокументОбъект.Дата < '20120313' Тогда
			ОбластьМакета.Параметры.ДатаСоставления = ДатаДляПечати + " /" ;
	ИначеЕсли  ДокументОбъект.Дата >= '20120313' И  ДокументОбъект.Дата < '20220301' Тогда
			ОбластьМакета.Параметры.ДатаСоставления = ДатаДляПечати;
	КонецЕсли;

	НачалоВторогоЛиста = Макет.ПолучитьОбласть("ВторойЛист");
	НомерСтраницы = 2;
	НомерСтраницыПред = 2;
	Для Каждого Обл Из СтруктураОбластей Цикл
		ОбластьПункт = ОбластьМакета.ПолучитьОбласть(Обл.Ключ);
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент,ОбластьПункт,НачалоВторогоЛиста,,НомерСтраницы);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

 // печать новой печатной формы УПД
// Параметры:
//	ДокументОбъект - Документ объект печати
//	ТабДокумент    - начальный табличный документ
//
Функция дкПечатьУПД(ДокументОбъект, ТабДокумент) Экспорт
	
	// Вначале надо получить таблицу товаров с ГТД
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ВыборкаТабличнаяЧасть = Неопределено;
	ТаблицаГТД = Неопределено;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		
		// Для сче-фактуры возьмем всю ТЧ как есть
		ВыборкаТабличнаяЧасть = ДокументОбъект.Товары.Выгрузить();
		ТаблицаГТД = ДокументОбъект.ТаблицаДвиженийПоГТД(ДокументОбъект.ДокументОснование);
		
	ИначеЕсли Метаданные.Документы.СчетФактураВыданный.ВводитсяНаОсновании.Содержит(МетаданныеДокумента) Тогда
		
		// Получим ТЧ документа из заполнения счета-фактуры
		ДокументСф = Документы.СчетФактураВыданный.СоздатьДокумент();
		ДокументСф.ДополнительныеСвойства.Вставить("НеИскатьСчетФактуру", Истина);
		ДокументСф.Заполнить(ДокументОбъект.Ссылка);
		ВыборкаТабличнаяЧасть = ДокументСф.Товары.Выгрузить();
		ТаблицаГТД = ДокументСф.ТаблицаДвиженийПоГТД(ДокументОбъект.Ссылка);

	ИначеЕсли Метаданные.Документы.СчетФактураПолученный.ВводитсяНаОсновании.Содержит(МетаданныеДокумента) Тогда
		
		// Получим ТЧ документа из заполнения счета-фактуры
		ДокументСф = Документы.СчетФактураПолученный.СоздатьДокумент();
		ДокументСф.ДополнительныеСвойства.Вставить("НеИскатьСчетФактуру", Истина);
		ДокументСф.Заполнить(ДокументОбъект.Ссылка);
		ВыборкаТабличнаяЧасть = ДокументСф.Товары.Выгрузить();
		ТаблицаГТД = ДокументСф.ТаблицаДвиженийПоГТД(ДокументОбъект.Ссылка);
		
	КонецЕсли;
	Если ТаблицаГТД <> Неопределено Тогда 
		ТаблицаГТД.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ГТД", "Количество");
	КонецЕсли;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ДокументОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//формат вывода суммы и количества
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", ДокументОбъект.Права,,ДокументОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", ДокументОбъект.Права,,ДокументОбъект);
	//
	ТипДок = ТипЗнч(ДокументОбъект);
	
	// Для печати межценовой разницы.
	ЕстьМежценоваяРазница             = Ложь;
	ТаблицаАвтомобилейССебестоимостью = Неопределено;
	
	Если ТипДок = Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
		
		ТаблицаАвтомобилейССебестоимостью = ДокументОбъект.Автомобили.Выгрузить();
		ИмяСебестоимость = "СебестоимостьАвтомобиля";
		
	ИначеЕсли ТипДок = Тип("ДокументОбъект.СчетФактураВыданный")
		И ДокументОбъект.КешСебестоимостиАвтомобилейКупленныхУФизЛица <> Неопределено Тогда
		
		ТаблицаАвтомобилейССебестоимостью = ДокументОбъект.КешСебестоимостиАвтомобилейКупленныхУФизЛица;
		ИмяСебестоимость = "Себестоимость";
		
	КонецЕсли;
	
	Если ТаблицаАвтомобилейССебестоимостью <> Неопределено Тогда
		
		Для Каждого СтрокаТоваров Из ТаблицаАвтомобилейССебестоимостью Цикл
				
			Если СтрокаТоваров[ИмяСебестоимость] > 0 Тогда
					
				ЕстьМежценоваяРазница = Истина;
				Прервать;
					
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЕсли;
	
	ВыводитьКодВидаТовара = (ДокументОбъект.Дата >= Дата('20171001'));
	ВыводитьКодТНВЭД      = обПраво("ВыводитьКодТНВЭД");
	ЕстьПрослеживаемыйТовар = Ложь;
	Если ДокументОбъект.Дата >= Дата('20231001') Тогда
		ЕстьСтоимостьТовараПрослеживания = Истина;
	Иначе
		ЕстьСтоимостьТовараПрослеживания = Ложь;
	КонецЕсли;
	
	//формируем таблицу для вывода на печать
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("ТоварКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ТоварНаименование", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("КодВидаТовара", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Акциз", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("Всего", Новый ОписаниеТипов("Число"));
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхожденияКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ПредставлениеСтраны", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ПредставлениеГТД", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияПрослежКод", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияПрослеж", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("КоличествоПрослеж", Новый ОписаниеТипов("Строка"));
	ТаблицаТоваров.Колонки.Добавить("СтоимПрослеж", Новый ОписаниеТипов("Строка"));
	
	// Для печати межценовой разницы.
	Если ЕстьМежценоваяРазница Тогда
		ТаблицаТоваров.Колонки.Добавить("Себестоимость", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Ном = 1;
	ЕстьТовары=Ложь;
	МассивТабличныхЧастей = Новый Массив;
	МассивТабличныхЧастей.Добавить("Товары");
	МассивТабличныхЧастей.Добавить("Автомобили");
	МассивТабличныхЧастей.Добавить("Работы");
	МассивТабличныхЧастей.Добавить("Опции");
	ЕдиницаИзмеренияАвтоработВПечатныхФормах = ДокументОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
	
	ТабличныеЧастиДокумента = Новый Массив;
	Если ВыборкаТабличнаяЧасть <> Неопределено Тогда
		ТабличныеЧастиДокумента.Добавить(Новый Структура("Имя", "Товары"));
	Иначе
		Для Каждого ТабличнаяЧасть Из ДокументОбъект.Метаданные().ТабличныеЧасти Цикл
			ТабличныеЧастиДокумента.Добавить(ТабличнаяЧасть);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИмяТабличнойЧасти Из ТабличныеЧастиДокумента Цикл
		
		Если ВыборкаТабличнаяЧасть = Неопределено Тогда
			ЕстьСкидкиБонусов = (ИмяТабличнойЧасти.Реквизиты.Найти("СуммаСкидкиБонусами") <> Неопределено);
			ТабличнаяЧастьДокумента = ДокументОбъект[ИмяТабличнойЧасти.Имя].Выгрузить();
			Если МассивТабличныхЧастей.Найти(ИмяТабличнойЧасти.Имя) <> Неопределено Тогда
				ТипЦен = Неопределено;
				Если ИмяТабличнойЧасти.Имя = "Работы" Тогда
					Попытка
						ТипЦен = ДокументОбъект.ТипЦенРабот;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				зфПерерасчетТаблицыТоваров(ТабличнаяЧастьДокумента,ДокументОбъект,ВалютаПечатногоДокумента,,ТипЦен);
			КонецЕсли;
		Иначе
			ЕстьСкидкиБонусов = Ложь;
			ТабличнаяЧастьДокумента = ВыборкаТабличнаяЧасть;
			зфПерерасчетТаблицыТоваров(ТабличнаяЧастьДокумента,ДокументОбъект,ВалютаПечатногоДокумента,,ТипЦен);
		КонецЕсли;
		
		Если ИмяТабличнойЧасти.Имя = "Товары" Тогда
			//для документов товаров
			Для Каждого ТекСтрока Из ТабличнаяЧастьДокумента Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Номенклатура);
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/?(ТекСтрока.Количество = 0, 1, ТекСтрока.Количество);
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод	 = ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
					НоваяСтрока.ЕдиницаИзмерения	 = спПолучитьНаименование(ТекСтрока.ЕдиницаИзмерения);
					НоваяСтрока.ТоварКод			 = ТекСтрока.Номенклатура.Артикул;
					ЕстьТовары = ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга ИЛИ ЕстьТовары;
					Если НЕ дкДокументЕстьРеквизитШапки("ТипЦен", МетаданныеДокумента.Имя)
						ИЛИ ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
						Стоимость = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
						Попытка
							НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
						Исключение
							НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
						КонецПопытки;
					Иначе
						Стоимость = ЦенаБезНДС * ТекСтрока.Количество;
						НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					КонецЕсли;
					
					КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД
						И ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
						НоваяСтрока.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						НоваяСтрока.КодВидаТовара = "--";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекСтрока.ГТД) И ТекСтрока.ГТД.РНПТ И ТаблицаГТД <> Неопределено Тогда
						
						ЕстьПрослеживаемыйТовар = Истина;
						
						СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
						СрокиРНПТ = ТаблицаГТД.НайтиСтроки(СтруктураПоиска);
						
						НоваяСтрока.ЕдиницаИзмеренияПрослежКод = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения.Код;
						НоваяСтрока.ЕдиницаИзмеренияПрослеж = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
						
						Если СрокиРНПТ.Количество() > 0 Тогда
							НоваяСтрока.КоличествоПрослеж = Формат(СрокиРНПТ[0].Количество, ФорматВыводаКоличества);
						Иначе
							НоваяСтрока.КоличествоПрослеж = Формат(ТекСтрока.Количество * ТекСтрока.Коэффициент, ФорматВыводаКоличества);
						КонецЕсли;
						
						Если ЕстьСтоимостьТовараПрослеживания Тогда 
							НоваяСтрока.СтоимПрослеж = Формат(Стоимость, "ЧЦ=15; ЧН=");
						КонецЕсли;
						
					Иначе
						НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
						НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
						НоваяСтрока.КоличествоПрослеж = "--";
						Если ЕстьСтоимостьТовараПрослеживания Тогда 
							НоваяСтрока.СтоимПрослеж = "--";
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "796";
					НоваяСтрока.ЕдиницаИзмерения	 = "шт";
					КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						НоваяСтрока.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						НоваяСтрока.КодВидаТовара = "--";
					КонецЕсли;
					ЕстьТовары=Истина;
					Если НЕ дкДокументЕстьРеквизитШапки("ТипЦен", МетаданныеДокумента.Имя)
						ИЛИ ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
						Стоимость = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
						Попытка
							Стоимость = Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0);
						Исключение
						КонецПопытки;
					Иначе
						Стоимость = ЦенаБезНДС * ТекСтрока.Количество;
					КонецЕсли;
					НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					// Для печати межценовой разницы из документа СФ Выданной.
					Если ЕстьМежценоваяРазница Тогда
						СтрокаАвто = ТаблицаАвтомобилейССебестоимостью.НайтиСтроки(Новый Структура("Автомобиль", ТекСтрока.Номенклатура));
						Если СтрокаАвто <> Неопределено Тогда
							НоваяСтрока.Себестоимость = Формат(СтрокаАвто[0][ИмяСебестоимость], ФорматВыводаСуммы);
						Иначе
							НоваяСтрока.Себестоимость = 0;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекСтрока.ГТД) И ТекСтрока.ГТД.РНПТ Тогда
						НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "796";
						НоваяСтрока.ЕдиницаИзмеренияПрослеж = "шт";
						НоваяСтрока.КоличествоПрослеж = 1;
						Если ЕстьСтоимостьТовараПрослеживания Тогда 
							НоваяСтрока.СтоимПрослеж = Формат(Стоимость, "ЧЦ=15; ЧН=");
						КонецЕсли;
						ЕстьПрослеживаемыйТовар = Истина;
					Иначе
						НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
						НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
						НоваяСтрока.КоличествоПрослеж = "--";
						Если ЕстьСтоимостьТовараПрослеживания Тогда 
							НоваяСтрока.СтоимПрослеж = "--";
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Автоработы") Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод = "356";
					НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
					НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
					НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
				Иначе
					
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "--";
					НоваяСтрока.ЕдиницаИзмерения	 = "--";
					НоваяСтрока.КодВидаТовара = "--";
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
					НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
					НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
				КонецЕсли;
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = ТекСтрока.СтавкаНДС;
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				
				Попытка
					Если НЕ обЗначениеНеЗаполнено(ТекСтрока.ГТД) Тогда
						НоваяСтрока.ПредставлениеГТД		 = спПолучитьНаименование(ТекСтрока.ГТД);
						НоваяСтрока.ПредставлениеСтраны		 = ТекСтрока.ГТД.Страна.Наименование;
						НоваяСтрока.СтранаПроисхожденияКод	 = ТекСтрока.ГТД.Страна.Код;
					Иначе
						НоваяСтрока.ПредставлениеГТД		 = "--";
						НоваяСтрока.ПредставлениеСтраны		 = "--";
						НоваяСтрока.СтранаПроисхожденияКод	 = "--";
					КонецЕсли;
				Исключение
					НоваяСтрока.ПредставлениеГТД		 = "--";
					НоваяСтрока.ПредставлениеСтраны		 = "--";
					НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				КонецПопытки;
				
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Автомобили" Тогда
			Для Каждого ТекСтрока Из ТабличнаяЧастьДокумента Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Автомобиль);
				НоваяСтрока.ЕдиницаИзмеренияКод	 = "796";
				НоваяСтрока.ЕдиницаИзмерения	 = "шт";
				НоваяСтрока.КодВидаТовара = "--";
				ТекСтрокаКоличество=1;
				Попытка
					ТекСтрокаКоличество=ТекСтрока.Количество;
				Исключение
				КонецПопытки; 
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/ ?(ТекСтрокаКоличество = 0, 1, ТекСтрокаКоличество);
				НоваяСтрока.Количество			 = Формат(ТекСтрокаКоличество, ФорматВыводаКоличества);
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ДокументОбъект.ТипЦен.ЦенаВключаетНДС = Истина Тогда
					Стоимость		 = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
					Попытка
						НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки, ФорматВыводаСуммы);
					Исключение
						НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					КонецПопытки;
				Иначе
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрокаКоличество, ФорматВыводаСуммы);
				КонецЕсли;
				
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = ТекСтрока.СтавкаНДС;
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
				НоваяСтрока.КоличествоПрослеж = "--";
				Если ЕстьСтоимостьТовараПрослеживания Тогда 
					НоваяСтрока.СтоимПрослеж = "--";
				КонецЕсли;
				
				// Для печати межценовой разницы из документа РеализацияАвтомобилей.
				Если ЕстьМежценоваяРазница Тогда
					НоваяСтрока.Себестоимость = Формат(ТекСтрока.СебестоимостьАвтомобиля, ФорматВыводаСуммы);
				КонецЕсли;
				
				ЕстьТовары=Истина;
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Опции" Тогда
			ТаблицаОпцийПоАвтомобилям = ТабличнаяЧастьДокумента.Выгрузить();
			ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
			//перебор строк
			Для Каждого СтрокаТабличнойЧасти Из ТаблицаТоваров Цикл
				//предварительная обработка строки ТЧ
				СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТабличнойЧасти.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
				Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
					СтрокаТабличнойЧасти.Сумма		= СтрокаТабличнойЧасти.Сумма		+ СтрокаТабличнойЧастиОпции.Сумма;
					СтрокаТабличнойЧасти.СуммаНДС	= СтрокаТабличнойЧасти.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
					СтрокаТабличнойЧасти.СуммаВсего	= СтрокаТабличнойЧасти.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Активы" Тогда
			Для Каждого ТекСтрока Из ТабличнаяЧастьДокумента Цикл
				НоваяСтрока = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.ПрочийАктив);
				НоваяСтрока.ЕдиницаИзмеренияКод	 = ТекСтрока.ПрочийАктив.Номенклатура.БазоваяЕдиницаИзмерения.Код;
				НоваяСтрока.ЕдиницаИзмерения	 = ТекСтрока.ПрочийАктив.Номенклатура.БазоваяЕдиницаИзмерения;
				НоваяСтрока.КодВидаТовара		 = "--";
				НоваяСтрока.ТоварКод			 = ТекСтрока.ПрочийАктив.Код;
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				
				Если ДокументОбъект.ВалютаДокумента = ВалютаПечатногоДокумента Тогда
					Сумма = ТекСтрока.Сумма;
					СуммаНДС = ТекСтрока.СуммаНДС;
				Иначе
					Сумма = Окр(обПересчет(ТекСтрока.Сумма, ДокументОбъект.ВалютаДокумента, ДокументОбъект.КурсДокумента, ВалютаПечатногоДокумента, ДокументОбъект.Дата), 2);
					СуммаНДС = Окр(обПересчет(ТекСтрока.СуммаНДС, ДокументОбъект.ВалютаДокумента, ДокументОбъект.КурсДокумента, ВалютаПечатногоДокумента, ДокументОбъект.Дата), 2);
				КонецЕсли;
				Стоимость			 = Сумма - СуммаНДС;
				Попытка
					НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
				Исключение
					НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
				КонецПопытки;
				НоваяСтрока.Цена				 = НоваяСтрока.Стоимость;
				НоваяСтрока.Акциз				 = "без акциза";
				НоваяСтрока.СтавкаНДС			 = ТекСтрока.СтавкаНДС;
				НоваяСтрока.СуммаНДС			 = Формат(СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(Сумма, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
				НоваяСтрока.КоличествоПрослеж = "--";
				Если ЕстьСтоимостьТовараПрослеживания Тогда 
					НоваяСтрока.СтоимПрослеж = "--";
				КонецЕсли;
				Ном = Ном + 1;
			КонецЦикла;
		ИначеЕсли ИмяТабличнойЧасти.Имя = "Работы" Тогда
			Для Каждого ТекСтрока Из ТабличнаяЧастьДокумента Цикл
				НоваяСтрока						 = ТаблицаТоваров.Добавить();
				НоваяСтрока.НомерСтроки			 = Ном;
				НоваяСтрока.ТоварКод			 = ТекСтрока.Работа.Артикул;
				НоваяСтрока.ТоварНаименование	 = спПолучитьНаименование(ТекСтрока.Работа);
				Если  ЕдиницаИзмеренияАвтоработВПечатныхФормах = 
					     Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "356";
				Иначе
					НоваяСтрока.ЕдиницаИзмеренияКод	 = "--";
				КонецЕсли;
				НоваяСтрока.ЕдиницаИзмерения	 = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
				НоваяСтрока.КодВидаТовара		 = "--";
				НоваяСтрока.Количество			 = Формат(ТекСтрока.Количество, ФорматВыводаКоличества);
				СуммаБезНДС = ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС;
				ЦенаБезНДС = СуммаБезНДС/ТекСтрока.Количество;
				НоваяСтрока.Цена				 = Формат(ЦенаБезНДС, ФорматВыводаСуммы);
				Если ДокументОбъект.ТипЦенРабот.ЦенаВключаетНДС = Истина Тогда
					Стоимость = ТекСтрока.Сумма - ТекСтрока.СуммаНДС;
					Попытка
						НоваяСтрока.Стоимость = Формат(Стоимость - ТекСтрока.СуммаСкидки - ТекСтрока.СуммаСкидкиСтроки - ?(ЕстьСкидкиБонусов, ТекСтрока.СуммаСкидкиБонусами, 0), ФорматВыводаСуммы);
					Исключение
						НоваяСтрока.Стоимость = Формат(Стоимость, ФорматВыводаСуммы);
					КонецПопытки;
				Иначе
					НоваяСтрока.Стоимость = Формат(ЦенаБезНДС * ТекСтрока.Количество, ФорматВыводаСуммы);
				КонецЕсли;
				
				НоваяСтрока.Акциз				 = "--";
				НоваяСтрока.СтавкаНДС			 = ТекСтрока.СтавкаНДС;
				НоваяСтрока.СуммаНДС			 = Формат(ТекСтрока.СуммаНДС, ФорматВыводаСуммы);
				НоваяСтрока.Всего				 = Формат(ТекСтрока.СуммаВсего, ФорматВыводаСуммы);
				НоваяСтрока.ПредставлениеГТД		 = "--";
				НоваяСтрока.ПредставлениеСтраны		 = "--";
				НоваяСтрока.СтранаПроисхожденияКод	 = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослежКод = "--";
				НоваяСтрока.ЕдиницаИзмеренияПрослеж = "--";
				НоваяСтрока.КоличествоПрослеж = "--";
				Если ЕстьСтоимостьТовараПрослеживания Тогда 
					НоваяСтрока.СтоимПрослеж = "--";
				КонецЕсли;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		ДатаПечатная = ?(обЗначениеНеЗаполнено(ДокументОбъект.ДатаЗакрытия), ДокументОбъект.Дата, ДокументОбъект.ДатаЗакрытия);
	Иначе
		ДатаПечатная = ДокументОбъект.Дата;
	КонецЕсли;
	
	МакетДо01072021 = Ложь;
	Если ДатаПечатная < Дата("20210701000000") Тогда

		Макет = ПолучитьОбщийМакет("УПД");
		МакетДо01072021 = Истина;

	Иначе
		
		Если ЕстьПрослеживаемыйТовар Тогда
			Если ЕстьСтоимостьТовараПрослеживания Тогда
				ИмяМакета = "УПД_01_10_2023_Прослеж";
			Иначе
				ИмяМакета = "УПД_02_04_2021_Прослеж";
			КонецЕсли;
			Макет = ПолучитьОбщийМакет(ИмяМакета);
		Иначе        
			
			//Бизтех_СнимченкоАА 09.01.2026--
			Если ДатаПечатная >= Дата('20260101') Тогда
				Макет = ПолучитьОбщийМакет("УПД_02_04_2021_2026");
			Иначе
				Макет = ПолучитьОбщийМакет("УПД_02_04_2021");
			КонецЕсли;
			//Бизтех_СнимченкоА 09.01.2026++
			
		КонецЕсли;

		Если ДатаПечатная >= Дата('20241001') Тогда
			НомерРедакции = 1096;
		Иначе
			НомерРедакции = 534;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.ДляПечати = Истина;
	Если ТипДок = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
		ОбластьМакетаШапка.Параметры.Поставщик = ДокументОбъект.Контрагент;
		ОбластьМакетаШапка.Параметры.АдресПоставщика = спПолучитьПредставление(ДокументОбъект.Контрагент,
		Новый Структура("АдресЮридический", " "), ДополнительныеПараметры);
		КПП = ДокументОбъект.Контрагент.КПП;
		ОбластьМакетаШапка.Параметры.ИННПоставщика 					= ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.ИНН),ДокументОбъект.Контрагент.ИНН, "--") +"/"+?(ЗначениеЗаполнено(КПП), КПП, "--");
		ОбластьМакетаШапка.Параметры.Грузоотправитель 				= ДокументОбъект.Контрагент;
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= "он же";
		ОбластьМакетаШапка.Параметры.Покупатель						= ДокументОбъект.Организация;
		ОбластьМакетаШапка.Параметры.Грузополучатель				= ДокументОбъект.Организация;
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя	= ДокументОбъект.Организация;
		ОбластьМакетаШапка.Параметры.ИННПокупателя 					= ?(ЗначениеЗаполнено(ДокументОбъект.Организация.ИНН), ДокументОбъект.Организация.ИНН, "--") +"/"+?(ЗначениеЗаполнено(ДокументОбъект.Организация.КПП), ДокументОбъект.Организация.КПП, "--");
	Иначе
		ОбластьМакетаШапка.Параметры.Поставщик = ДокументОбъект.Организация;
		ОбластьМакетаШапка.Параметры.АдресПоставщика = спПолучитьПредставление(ДокументОбъект.ПодразделениеКомпании,
		Новый Структура("АдресЮридический", " "), ДополнительныеПараметры);
		КПП = спПолучитьКППДляПечати(ДокументОбъект.Организация, ДокументОбъект.ПодразделениеКомпании);
		ОбластьМакетаШапка.Параметры.ИННПоставщика = ?(ЗначениеЗаполнено(ДокументОбъект.Организация.ИНН),ДокументОбъект.Организация.ИНН, "--") +"/"+?(ЗначениеЗаполнено(КПП), КПП, "--");
		ОбластьМакетаШапка.Параметры.Грузоотправитель = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузоотправитель",ДокументОбъект.ПодразделениеКомпании);
		Если ТипЗнч(ОбластьМакетаШапка.Параметры.Грузоотправитель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
			ОргДляСравнения=ОбластьМакетаШапка.Параметры.Грузоотправитель.Организация;
		Иначе
			ОргДляСравнения=ОбластьМакетаШапка.Параметры.Грузоотправитель;
		КонецЕсли;
		Если ОргДляСравнения=ДокументОбъект.Организация Тогда
			
			//<<БТ_20211124	
			//ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= "он же";
			ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= Строка(ДокументОбъект.Организация.НаименованиеПолное) + ", " + Строка(спПолучитьПредставление(ДокументОбъект.ПодразделениеКомпании,
			Новый Структура("АдресФактический", " "), ДополнительныеПараметры));
			//>>БТ_20211124  
			
		Иначе
			ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя	= спПолучитьПредставление(
			ОбластьМакетаШапка.Параметры.Грузоотправитель, Новый Структура("Наименование,АдресФактический", " ", ""));
		КонецЕсли;
		Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			ОбластьМакетаШапка.Параметры.Покупатель				= ДокументОбъект.Контрагент.ГоловнойКонтрагент;	
		Иначе
			ОбластьМакетаШапка.Параметры.Покупатель				= ДокументОбъект.Контрагент;	
		КонецЕсли;
		Если обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный") Тогда
			Грузополучатель = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель", ДокументОбъект.Грузополучатель);
		ИначеЕсли обЭтотТип(ДокументОбъект, "ДокументОбъект.ЗаказНаряд") Тогда
			Грузополучатель = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель", ДокументОбъект.Заказчик);
		Иначе
			Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
				Грузополучатель = ДокументОбъект.Контрагент;
			Иначе
				Грузополучатель = обПолучитьЗначениеСвойства(ДокументОбъект,"Грузополучатель");
			КонецЕсли;
		КонецЕсли;
		ОбластьМакетаШапка.Параметры.Грузополучатель = Грузополучатель;
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = спПолучитьПредставление(Грузополучатель, Новый Структура("Наименование,АдресФактический", " ", ""));
		
		Если ДокументОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			ИННПокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.ГоловнойКонтрагент.ИНН), ДокументОбъект.Контрагент.ГоловнойКонтрагент.ИНН, "--");
			КПППокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.КПП), ДокументОбъект.Контрагент.КПП, "--");
		Иначе
			ИННПокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.ИНН), ДокументОбъект.Контрагент.ИНН, "--");
			Если ЗначениеЗаполнено(Грузополучатель) И Грузополучатель.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
				КПППокупателя = ?(ЗначениеЗаполнено(Грузополучатель.КПП), Грузополучатель.КПП, "--");
			Иначе
				КПППокупателя = ?(ЗначениеЗаполнено(ДокументОбъект.Контрагент.КПП), ДокументОбъект.Контрагент.КПП, "--");
			КонецЕсли;
		КонецЕсли;
		
		ОбластьМакетаШапка.Параметры.ИННПокупателя = ИННПокупателя + "/" + КПППокупателя;
		
	КонецЕсли;
	ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(ОбластьМакетаШапка.Параметры.Поставщик,
		Новый Структура("Наименование", " "));
	ОбластьМакетаШапка.Параметры.АдресПоставщика = ?(ЗначениеЗаполнено(ОбластьМакетаШапка.Параметры.АдресПоставщика), ОбластьМакетаШапка.Параметры.АдресПоставщика, "--");	
	КоличествоСтрок = ТаблицаТоваров.Количество();
	Если НЕ ЕстьТовары Тогда
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузоотправителя = "--";
		ОбластьМакетаШапка.Параметры.ПредставлениеГрузополучателя = "--";
	КонецЕсли; 
	
	Если ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		ОбластьМакетаШапка.Параметры.ПоДокументу = ?(ЗначениеЗаполнено(ДокументОбъект.ПлатежноРасчетныеДокументы), ДокументОбъект.ПлатежноРасчетныеДокументы, "--");
	КонецЕсли;
	
	ДокументФактура = Документы.СчетФактураВыданный.НайтиПоРеквизиту("ДокументОснование", ДокументОбъект.Ссылка);
	
	ОбластьМакетаШапка.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(
		ОбластьМакетаШапка.Параметры.Покупатель, Новый Структура("Наименование", ""));
	ОбластьМакетаШапка.Параметры.АдресПокупателя = спПолучитьПредставление(
		ОбластьМакетаШапка.Параметры.Покупатель, Новый Структура("АдресЮридический", ""));
	
	//если документ вводится на основании счет-фактуры или счет-фактура - статус 1
	ДатаСФ = Дата(1,1,1);
	Если ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") ИЛИ (ДокументФактура <> Документы.СчетФактураВыданный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления) Тогда
		ОбластьМакетаШапка.Параметры.СтатусУПД = 1;
		//заполним номер и дату
		ДокументСчетФактура = ?(ДокументФактура = Документы.СчетФактураВыданный.ПустаяСсылка(), ДокументОбъект.ссылка, ДокументФактура);
		Если ДокументСчетФактура.ХозОперация = Справочники.ХозОперации.СчетФактураВыданный Тогда
			ОбластьМакетаШапка.Параметры.Номер    = дкПолучитьНомерДляПечати(ДокументСчетФактура);
			ДатаСФ = ДокументСчетФактура.Дата;
			ОбластьМакетаШапка.Параметры.Дата = Формат(ДокументСчетФактура.Дата, "ДФ=""дд ММММ гггг""");
			ОбластьМакетаШапка.Параметры.НомерИсправления = "--";
			ОбластьМакетаШапка.Параметры.ДатаИсправления = "--";
		Иначе
			ОбластьМакетаШапка.Параметры.НомерИсправления = ?(ЗначениеЗаполнено(ДокументСчетФактура.НомерИсправления), ДокументСчетФактура.НомерИсправления, "--");
			ОбластьМакетаШапка.Параметры.ДатаИсправления = Формат(ДокументСчетФактура.Дата, "ДФ=""дд ММММ гггг""");
			// найдем изначальную счет фактуру
			ДокументОсн = ДокументСчетФактура.ДокументОснование;
			Пока ТипЗнч(ДокументОсн) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
				ДокументОсн = ДокументОсн.ДокументОснование;
			КонецЦикла;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	СчетФактураВыданный.Ссылка
			|ИЗ
			|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
			|ГДЕ
			|	СчетФактураВыданный.ДокументОснование = &ДокументОсн";
			Запрос.УстановитьПараметр("ДокументОсн",ДокументОсн);
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаЗапроса.Следующий() Тогда 
				ОбластьМакетаШапка.Параметры.Номер    = дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект());
				ОбластьМакетаШапка.Параметры.Дата = Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
				ДатаСФ = ВыборкаЗапроса.Ссылка.Дата;
			Иначе
				ОбластьМакетаШапка.Параметры.Номер    = "--";
				ОбластьМакетаШапка.Параметры.Дата = "--";
			КонецЕсли;
		КонецЕсли;
	//БИЗТЕХ МАМОНОВ 05.12.2025 ++
	//При печати из ЗН сразу ставим статус 1, потому что теперь УПД печатается только из закрытого состояния
	ИначеЕсли ТипДок = Тип("ДокументОбъект.ЗаказНаряд") Тогда
		ОбластьМакетаШапка.Параметры.СтатусУПД = 1;
	//БИЗТЕХ МАМОНОВ 05.12.2025 --
	Иначе
		Если ТипДок = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
			ДокументФактура = Документы.СчетФактураПолученный.НайтиПоРеквизиту("ДокументОснование", ДокументОбъект.Ссылка);
			Если ДокументФактура <> Документы.СчетФактураВыданный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления И ЗначениеЗаполнено(ДокументФактура) Тогда
				ОбластьМакетаШапка.Параметры.СтатусУПД = 1;
			Иначе
				ОбластьМакетаШапка.Параметры.СтатусУПД = 2;
			КонецЕсли;
		Иначе
			ОбластьМакетаШапка.Параметры.СтатусУПД = 2;
		КонецЕсли;
		//заполним номер и дату
		ОбластьМакетаШапка.Параметры.Номер			  = дкПолучитьНомерДляПечати(ДокументОбъект);
		ДатаСФ = ?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.ЗаказНаряд"), ДокументОбъект.Дата, ?(обЗначениеНеЗаполнено(ДокументОбъект.ДатаЗакрытия), ДокументОбъект.Дата, ДокументОбъект.ДатаЗакрытия));
		ОбластьМакетаШапка.Параметры.Дата			  = Формат(ДатаСФ, "ДФ=""дд ММММ гггг""");
		
		ОбластьМакетаШапка.Параметры.НомерИсправления = "--";
		ОбластьМакетаШапка.Параметры.ДатаИсправления  = "--";
	КонецЕсли;
	
	Если НЕ МакетДо01072021 Тогда
		
		НомерДокументаОтгрузки = "        ";
		ДатаДокументаОтгрузки = "";
		
		Если ОбластьМакетаШапка.Параметры.СтатусУПД = 1 Тогда
			НомерДокументаОтгрузки = ОбластьМакетаШапка.Параметры.Номер;
			Если ДатаСФ <> Дата(1,1,1) Тогда
				ДатаДокументаОтгрузки = Формат(ДатаСФ, "ДФ=""дд.ММ.гггг""");
			КонецЕсли;
		ИначеЕсли ТипДок = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
			НомерДокументаОтгрузки = ДокументОбъект.ВхДокНомер;
			ДатаДокументаОтгрузки = Формат(ДокументОбъект.ВхДокДата, "ДФ=""дд.ММ.гггг""");
		ИначеЕсли ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
			НомерДокументаОтгрузки = дкПолучитьНомерДляПечати(ДокументОбъект.ДокументОснование);
			
			Если ТипЗнч(ДокументОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
				ДатаДокументаОтгрузки = ?(обЗначениеНеЗаполнено(ДокументОбъект.ДокументОснование.ДатаЗакрытия), ДокументОбъект.ДокументОснование.Дата, ДокументОбъект.ДокументОснование.ДатаЗакрытия);
			Иначе
				ДатаДокументаОтгрузки = ДокументОбъект.ДокументОснование.Дата;
			КонецЕсли;
			
			ДатаДокументаОтгрузки = Формат(ДатаДокументаОтгрузки, "ДФ=""дд.ММ.гггг""");
		Иначе
			НомерДокументаОтгрузки = дкПолучитьНомерДляПечати(ДокументОбъект);
			ДатаДокументаОтгрузки = Формат(ДатаПечатная, "ДФ=""дд.ММ.гггг""");
		КонецЕсли;
		
		НомераСтрок = "";
		НаименованиеДокумента = "";

		Если НомерРедакции = 1096 Тогда 

			ШаблонПодстрокиДокументаОбОтгрузке = "%1, № %2 от %3 г.";
			НаименованиеДокумента = Документы.СчетФактураВыданный.ПолучитьНаименованиеДокументаОтгрузки(Истина, ТаблицаТоваров);

		Иначе

			ШаблонПодстрокиДокументаОбОтгрузке = "№ п/п %1 № %2 от %3 г.";
			Если КоличествоСтрок = 1  Тогда
				НомераСтрок = "1";
			Иначе 
				НомераСтрок = "1 - " + Строка(КоличествоСтрок);
			КонецЕсли;

		КонецЕсли;

		ОбластьМакетаШапка.Параметры.ДокументыОбОтгрузке = СтрШаблон(ШаблонПодстрокиДокументаОбОтгрузке,
			?(НомерРедакции = 1096, НаименованиеДокумента, НомераСтрок),
			?(ЗначениеЗаполнено(НомерДокументаОтгрузки), НомерДокументаОтгрузки, "      "),
			?(ЗначениеЗаполнено(ДатаДокументаОтгрузки), ДатаДокументаОтгрузки, "      ")
		);
		
		Если ТипДок = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
			ОбластьМакетаШапка.Параметры.ИдентификаторГосударственногоКонтракта = ДокументОбъект.ИдентификаторГосударственногоКонтракта;
		ИначеЕсли ДокументФактура <> Документы.СчетФактураВыданный.ПустаяСсылка() И НЕ ДокументФактура.ПометкаУдаления Тогда
			ОбластьМакетаШапка.Параметры.ИдентификаторГосударственногоКонтракта = ДокументФактура.ИдентификаторГосударственногоКонтракта;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьМакетаШапка.Параметры.Валюта = ?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) + ", " + ВалютаПечатногоДокумента.Код;
	
	// если дата документа позднее 01.07.2017
	Если МакетДо01072021 Тогда
		Если ВыводитьКодВидаТовара Тогда
			ОбластьМакетаШапка.Параметры.Редакция =
				НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
		ИначеЕсли ДокументОбъект.Дата >= Дата('20170701') Тогда
			ОбластьМакетаШапка.Параметры.Редакция =
				НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
		КонецЕсли;
	Иначе
		Если НомерРедакции = 1096 Тогда 
			ОбластьМакетаШапка.Параметры.Редакция =
				НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 16 августа 2024 г. № 1096)'");
		Иначе 
			ОбластьМакетаШапка.Параметры.Редакция =
				НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 2 апреля 2021 г. № 534)'");
		КонецЕсли;
	КонецЕсли;
	
	// Выводим область шапки
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	// если дата документа позднее 01.07.2017
	Если МакетДо01072021 И ДокументОбъект.Дата >= Дата('20170701') Тогда
		ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
		ЗаголовокИдентификатораГосударственногоКонтракта = "Идентификатор государственного контракта, договора (соглашения)" + ?(ВыводитьКодВидаТовара, " (при наличии)", "")+": ";
		Попытка
			ИдентификаторГосударственногоКонтракта = ДокументОбъект.ИдентификаторГосударственногоКонтракта;
		Исключение
			ИдентификаторГосударственногоКонтракта = "";
		КонецПопытки;
		ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = ЗаголовокИдентификатораГосударственногоКонтракта + ИдентификаторГосударственногоКонтракта;
		ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
	КонецЕсли;
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");

	Если НЕ МакетДо01072021 И ЕстьПрослеживаемыйТовар И ЕстьСтоимостьТовараПрослеживания Тогда 
		Если НомерРедакции = 1096 Тогда 
			ОбластьЗаголовокТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога на добавленную стоимость, в рублях'");
		Иначе 
			ОбластьЗаголовокТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога'");
		КонецЕсли;
	КонецЕсли;
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если МакетДо01072021 Тогда
		ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
		Если НЕ ВыводитьКодВидаТовара Тогда
			
			НовыйТекст = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Лево-1).Текст;
			
			ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Право);
			ОбластьВыреза.Объединить();
			ОбластьВыреза.Текст = НовыйТекст;
			
			ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(5,ОбластьКодВидаТовара.Лево-1,5,ОбластьКодВидаТовара.Право);
			ОбластьВыреза.Объединить();
			
			ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Номер таможенной декларации";
		Иначе
			
			ОбластьЗаголовокТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Регистрацион- ный номер таможенной декларации";
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Область = ТабДокумент.Область(?(ДокументОбъект.Дата >= Дата('20170701'),"R17","R16"));
	ТабДокумент.УдалитьОбласть(Область, Смещать); 
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;

	//заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Лист " + НомерСтраницы;
	Если ОбластьМакетаШапка.Параметры.Номер <> "--" И ОбластьМакетаШапка.Параметры.Дата <> "--" Тогда
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Универсальный передаточный документ №"+ОбластьМакетаШапка.Параметры.Номер+" от "+ОбластьМакетаШапка.Параметры.Дата;
	Иначе
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = "Универсальный передаточный документ №"+ОбластьМакетаШапка.Параметры.НомерИсправления+" от "+ОбластьМакетаШапка.Параметры.ДатаИсправления;
	КонецЕсли;
	
	Ном = 0;
	
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если МакетДо01072021 И НЕ ВыводитьКодВидаТовара Тогда
		НовыйПараметр = ОбластьМакетаСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Лево-1).Параметр;
		ОбластьВыреза = ОбластьМакетаСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Параметр = НовыйПараметр;
	КонецЕсли;
	
	ОбластьМакетаИтог = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвалНакладной = Макет.ПолучитьОбласть("ПодвалНакладной");
	
	//доп. области
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаИтог);
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьМакетаПодвалНакладной);
	
	ОбщаяСтоимость = 0;
	Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
		Ном = Ном + 1;
		
		ОбластьМакетаСтрока.Параметры.Заполнить(ТекСтрока);
		Если ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
			ОбластьМакетаСтрока.Параметры.СуммаНДС = "без НДС";
		КонецЕсли;
		// Для печати межценовой разницы.
		Если ЕстьМежценоваяРазница Тогда
			
			Себестоимость = ТекСтрока.Себестоимость;
			
			Если Себестоимость > 0 Тогда                                                                                                  
				//БизТех Аляль 14.07.2025г. по ТЗ При реализации автомобилей в убыток в табличную часть в пятую графу должно отражаться 0 
				//ОбластьМакетаСтрока.Параметры.ТоварНаименование = "Межценовая разница " + ОбластьМакетаСтрока.Параметры.ТоварНаименование;
				//ОбластьМакетаСтрока.Параметры.Стоимость = Формат(ТекСтрока.Всего - Себестоимость, ФорматВыводаСуммы); 
				ОбластьМакетаСтрока.Параметры.Стоимость = Формат(?((ТекСтрока.Всего - Себестоимость)<0, 0, ТекСтрока.Всего - Себестоимость), ФорматВыводаСуммы);
				ТекстСтавкаНДС = СокрЛП(ТекСтрока.СтавкаНДС);
				Если Найти(ТекстСтавкаНДС, "/") = 0 Тогда
					ТекстСтавкаНДС = СтрЗаменить(ТекстСтавкаНДС, "%", "");
					ОбластьМакетаСтрока.Параметры.СтавкаНДС = ТекстСтавкаНДС + "/1" + ТекстСтавкаНДС + "%";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		ОбщаяСтоимость = ОбщаяСтоимость + ОбластьМакетаСтрока.Параметры.Стоимость;
		//выводим строку, делая проверку попадания на лист		
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакетаСтрока, ОбластьЗаголовокТаблицы, , НомерСтраницы, , ДокументОбъект, ?((Ном=КоличествоСтрок И Ном<>1) ,мсвДопОбластиПодвала,Неопределено));
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			НомерСтраницыПред = НомерСтраницы;
			ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Лист " + НомерСтраницы;
		КонецЕсли;
	КонецЦикла;
	
	ОбластьМакетаИтог.Параметры.ИтогоСтоимость = Формат(ОбщаяСтоимость, ФорматВыводаСуммы);
	ОбластьМакетаИтог.Параметры.ИтогоСуммаНДС = Формат(ТаблицаТоваров.Итог("СуммаНДС"), ФорматВыводаСуммы);
	ОбластьМакетаИтог.Параметры.ИтогоВсего = Формат(ТаблицаТоваров.Итог("Всего"), ФорматВыводаСуммы);
	
	//выводим область Итого
	ТабДокумент.Вывести(ОбластьМакетаИтог);
	
	//выводим подвал печатной формы
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ДокументОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если ДокументОбъект.Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьМакетаПодвал.Параметры.ФИОПБОЮЛ=Руководитель.Руководитель;
		
		//Бизтех_СнимченкоАА 12.01.2026--
		Если ДатаПечатная >= Дата('20260101') Тогда
			ОбластьМакетаПодвал.Параметры.Свидетельство = "ОГРНИП " + ДокументОбъект.Организация.ОГРН + " , дата регистрации "+Формат(ДокументОбъект.Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьМакетаПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(ДокументОбъект.Организация,Перечисления.ВидыДокументов.Свидетельство);
		КонецЕсли;
		//Бизтех_СнимченкоАА 12.01.2026++
		
	Иначе
		ОбластьМакетаПодвал.Параметры.ФИОРуководителя = Руководитель.РуководительПредставление;
	КонецЕсли;
	
	ГлавныйБухгалтер = дкОтветственноеЛицо(ДокументОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
	ОбластьМакетаПодвал.Параметры.ФИОГлавногоБухгалтера = ГлавныйБухгалтер.ГлавныйБухгалтерПредставление;
	
	Попытка
		КоличествоСтраниц = ТабДокумент.КоличествоСтраниц();
	Исключение
		КоличествоСтраниц = "__";
	КонецПопытки;
	
	ОбластьМакетаПодвал.Параметры.КоличествоЛистов ="Документ 
	|составлен на
	|"+ КоличествоСтраниц +" листах";
	
	Если МакетДо01072021 Тогда
		ОбластьМакетаПодвал.Параметры.ТекстИндивидуальныйПредприниматель = ?(ВыводитьКодВидаТовара, "Индивидуальный предприниматель или иное уполномоченное лицо", "Индивидуальный предприниматель");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(ЗначениеЗаполнено(ДокументОбъект.ДоговорВзаиморасчетов), ДокументОбъект.ДоговорВзаиморасчетов, "");
	Попытка
		Доверенность = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Доверенность");
		Если ЗначениеЗаполнено(Доверенность) Тогда
			ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.Основание), "", Строка(ОбластьМакетаПодвалНакладной.Параметры.Основание) + ", ") + Доверенность;
		КонецЕсли;
	Исключение
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.Основание), "--", ОбластьМакетаПодвалНакладной.Параметры.Основание);
	
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Отпустил (сотрудник)");
	Исключение
		ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = "";
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика = ?(ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика), ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика, "");
	Если Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика) <> "" Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьКладовщика = ОбластьМакетаПодвалНакладной.Параметры.ФИОКладовщика.Должность.Наименование;
	Иначе
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьКладовщика = "";
	КонецЕсли;
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"Дата отгрузки");
	Исключение
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи) Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.ЗаказНаряд"), ДокументОбъект.Дата, ДокументОбъект.ДатаОкончания);
	КонецЕсли;
	ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = Формат(ОбластьМакетаПодвалНакладной.Параметры.ДатаОтгрузкиПередачи, "ДЛФ=ДД");
	
	Попытка
		Менеджер = дкОтветственноеЛицо(ДокументОбъект,"Менеджер");
		ОбластьМакетаПодвалНакладной.Параметры.ФИОМенеджера = Менеджер.МенеджерПредставление;
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьМенеджера = Менеджер.МенеджерДолжность;
	Исключение
	КонецПопытки;
	
	ОбластьМакетаПодвалНакладной.Параметры.ПредставлениеОрганизации = ОбластьМакетаШапка.Параметры.ПредставлениеПоставщика+", ИНН/КПП "+ОбластьМакетаШапка.Параметры.ИННПоставщика;
	Попытка
		ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = обПолучитьЗначениеСвойства(?(НЕ обЭтотТип(ДокументОбъект, "ДокументОбъект.СчетФактураВыданный"), ДокументОбъект, ДокументОбъект.ДокументОснование),"ПолучилКонтрагент");
	Исключение
		ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = "";
	КонецПопытки;
	ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя = ?(ЗначениеЗаполнено(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя), ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя, "");
	Если Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя) <> "" Тогда
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьГрузополучателя = Строка(ОбластьМакетаПодвалНакладной.Параметры.ФИОГрузополучателя.Должность.Наименование);
	Иначе
		ОбластьМакетаПодвалНакладной.Параметры.ДолжностьГрузополучателя = "";
	КонецЕсли;
	
	ОбластьМакетаПодвалНакладной.Параметры.ПредставлениеКонтрагента = ОбластьМакетаШапка.Параметры.ПредставлениеПокупателя+", ИНН/КПП "+ ОбластьМакетаШапка.Параметры.ИННПокупателя;
	ТабДокумент.Вывести(ОбластьМакетаПодвалНакладной);
	
	#Область бизтех                     
	ТабДокумент.АвтоМасштаб = Истина;
	#КонецОбласти
	
	Возврат ТабДокумент;
	
КонецФункции

// печать новой печатной формы УКД
// Параметры:
//	ДокументОбъект - Документ объект печати
//	ТабДокумент    - начальный табличный документ
//
Функция дкПечатьУКД(ДокументОбъект, ТабДокумент) Экспорт
	
	ДанныеДокумента = ДокументОбъект.ПолучитьДанныеДляПечатиУКД();
	ВыборкаТабличнойЧасти = ДанныеДокумента.Товары.Скопировать();

	БезУдаленияСтрок = Истина;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Количество") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("КоличествоПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьКоличество = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьКоличество = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("ЕдиницаИзмерения") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("ЕдиницаИзмеренияПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьЕдиницаИзмерения = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьЕдиницаИзмерения = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Коэффициент") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("КоэффициентПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьКоэффициент = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьКоэффициент = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СтавкаНДС") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СтавкаНДСПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСтавкаНДС = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСтавкаНДС = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СуммаНДС") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СуммаНДСПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСуммаНДС = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСуммаНДС = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СуммаВсего") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СуммаВсегоПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСуммаВсего = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСуммаВсего = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Партия") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("ПартияПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьПартия = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьПартия = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("ГТД") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("ГТДДоКорректировки") <> Неопределено Тогда 
    	 ЕстьГТД = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьГТД = Ложь;
	КонецЕсли;
	
    Если БезУдаленияСтрок = Ложь Тогда
		НомерСтроки = ВыборкаТабличнойЧасти.Количество();
		Пока НомерСтроки > 0 Цикл
			УдалитьСтроку = Истина;
			НомерСтроки = НомерСтроки - 1;
			
			СтрокаТабличнойЧасти = ВыборкаТабличнойЧасти[НомерСтроки];
			
			Если УдалитьСтроку И ЕстьКоличество Тогда
				Если СтрокаТабличнойЧасти.Количество <> СтрокаТабличнойЧасти.КоличествоПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьЕдиницаИзмерения Тогда
				Если СтрокаТабличнойЧасти.ЕдиницаИзмерения <> СтрокаТабличнойЧасти.ЕдиницаИзмеренияПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьКоэффициент Тогда
				Если СтрокаТабличнойЧасти.Коэффициент <> СтрокаТабличнойЧасти.КоэффициентПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСтавкаНДС Тогда
				Если СтрокаТабличнойЧасти.СтавкаНДС <> СтрокаТабличнойЧасти.СтавкаНДСПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСуммаНДС Тогда
				Если СтрокаТабличнойЧасти.СуммаНДС <> СтрокаТабличнойЧасти.СуммаНДСПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСуммаВсего Тогда
				Если СтрокаТабличнойЧасти.СуммаВсего <> СтрокаТабличнойЧасти.СуммаВсегоПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьПартия Тогда
				Если СтрокаТабличнойЧасти.Партия <> СтрокаТабличнойЧасти.ПартияПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьГТД Тогда
				Если СтрокаТабличнойЧасти.ГТД <> СтрокаТабличнойЧасти.ГТДДоКорректировки Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если УдалитьСтроку Тогда
				ВыборкаТабличнойЧасти.Удалить(НомерСтроки);
			КонецЕсли;
				
		КонецЦикла;
	КонецЕсли;
		
	ЕстьРНПТ = Ложь;
	
	// Проверим, что есть РНПТ в документе
	Попытка
		Для Каждого ТекущаяСтрока Из ВыборкаТабличнойЧасти Цикл
			Если ЗначениеЗаполнено(ТекущаяСтрока.ГТД) И ТекущаяСтрока.ГТД.РНПТ Тогда
				ЕстьРНПТ = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	МакетДо2021 = ДокументОбъект.Дата < Дата(2021, 7, 1);
	Если МакетДо2021 Тогда
		Макет = ПолучитьОбщийМакет("УКД");
	Иначе
		
		Если ЕстьРНПТ Тогда
			Макет = ПолучитьОбщийМакет("УКД_02_04_2021_Прослеж");
		Иначе
			Макет = ПолучитьОбщийМакет("УКД_02_04_2021");
		КонецЕсли;
		
	КонецЕсли;
	
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ДокументОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//формат вывода суммы и количества
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", ДокументОбъект.Права,,ДокументОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества", ДокументОбъект.Права,,ДокументОбъект);
	ФорматВыводаКоличества2021 = обПраво("ПредставлениеНоляВПФУКД", ДокументОбъект.Права,,ДокументОбъект);
	
	ВыводитьКодВидаТовара = (ДокументОбъект.Дата >= Дата('20171001') И МакетДо2021);
	ВыводитьКодТНВЭД      = обПраво("ВыводитьКодТНВЭД");
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента) Тогда
		
		Возврат ТабДокумент;
	КонецЕсли;
	
	ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого 			= Макет.ПолучитьОбласть("Итого");
	ОбластьПодвал 			= Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвалНакладной 	= Макет.ПолучитьОбласть("ПодвалНакладной");
	
	ОбластьЗаголовок.Параметры.Заполнить(ДанныеДокумента);
	ОбластьЗаголовок.Параметры.СтатусУКД = ДанныеДокумента.Статус;
	
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти, ДокументОбъект,ВалютаПечатногоДокумента);
	
	КоличествоСтрок = ВыборкаТабличнойЧасти.Количество();
	
	ОбластьЗаголовок.Параметры.Номер = ДанныеДокумента.Номер;
	ОбластьЗаголовок.Параметры.Дата = Формат(ДанныеДокумента.Дата, "ДЛФ=DD");
	
	Если ДанныеДокумента.Свойство("НомерИсправления") Тогда
		
		ОбластьЗаголовок.Параметры.НомерИсправления = ДанныеДокумента.НомерИсправления;
		ОбластьЗаголовок.Параметры.ДатаИсправления = Формат(ДанныеДокумента.ДатаИсправления, "ДЛФ=DD");
	Иначе
		
		ОбластьЗаголовок.Параметры.НомерИсправления = "--";
		ОбластьЗаголовок.Параметры.ДатаИсправления = "--";
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("НомерИсправленияИсходногоДокумента") Тогда
		
		ОбластьЗаголовок.Параметры.НомерИсправленияКорректировочного = ДанныеДокумента.НомерИсправленияИсходногоДокумента;
		ОбластьЗаголовок.Параметры.ДатаИсправленияКорректировочного = Формат(ДанныеДокумента.ДатаИсправленияИсходногоДокумента, "ДЛФ=DD");
	Иначе
		
		ОбластьЗаголовок.Параметры.НомерИсправленияКорректировочного = "--";
		ОбластьЗаголовок.Параметры.ДатаИсправленияКорректировочного = "--";
	КонецЕсли;
	
	Если ДанныеДокумента.Свойство("НомерИсходногоДокумента") Тогда
		
		ОбластьЗаголовок.Параметры.НомерСчетаФактуры = ДанныеДокумента.НомерИсходногоДокумента;
		ОбластьЗаголовок.Параметры.ДатаСчетаФактуры = Формат(ДанныеДокумента.ДатаИсходногоДокумента, "ДЛФ=DD");
	Иначе
		
		ОбластьЗаголовок.Параметры.НомерСчетаФактуры = "--";
		ОбластьЗаголовок.Параметры.ДатаСчетаФактуры = "--";
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.Валюта = 
			?(ЗначениеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), 
					ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) 
					+ ", " + ВалютаПечатногоДокумента.Код;
	ОбластьЗаголовок.Параметры.Поставщик				= 
			?(ТипЗнч(ДанныеДокумента.Поставщик) = Тип("СправочникСсылка.Контрагенты")
			И ДанныеДокумента.Поставщик.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение,
			ДанныеДокумента.Поставщик.ГоловнойКонтрагент,
			ДанныеДокумента.Поставщик);
	ОбластьЗаголовок.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(
		ОбластьЗаголовок.Параметры.Поставщик, Новый Структура("Наименование", ""));
	ОбластьЗаголовок.Параметры.АдресПоставщика	= спПолучитьПредставление(
		ОбластьЗаголовок.Параметры.Поставщик, Новый Структура("АдресЮридический", ""));
	ОбластьЗаголовок.Параметры.АдресПоставщика = 
		?(ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.АдресПоставщика), ОбластьЗаголовок.Параметры.АдресПоставщика, "--");
	Если ТипЗнч(ОбластьЗаголовок.Параметры.Поставщик) = Тип("СправочникСсылка.Контрагенты") Тогда 
		КПП = ДанныеДокумента.Поставщик.КПП;
	Иначе
		КПП = спПолучитьКППДляПечати(ДанныеДокумента.Организация, ДанныеДокумента.ПодразделениеКомпании);
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ИННПоставщика = 
		?(ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.Поставщик.ИНН),ОбластьЗаголовок.Параметры.Поставщик.ИНН, "--") 
		+"/"+?(ЗначениеЗаполнено(КПП), КПП, "--");
	
	Если КоличествоСтрок>0 Тогда
		ЕстьТовары=Ложь;
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
				Если СтрокаТоваров.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
					ЕстьТовары=Истина;
					Прервать;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.Покупатель	= 
			?(ТипЗнч(ДанныеДокумента.Покупатель) = Тип("СправочникСсылка.Контрагенты")
				И ДанныеДокумента.Покупатель.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение,
			ДанныеДокумента.Покупатель.ГоловнойКонтрагент,
			ДанныеДокумента.Покупатель);
	ОбластьЗаголовок.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(
		ОбластьЗаголовок.Параметры.Покупатель, Новый Структура("Наименование", ""));
	ОбластьЗаголовок.Параметры.АдресПокупателя = спПолучитьПредставление(
		ОбластьЗаголовок.Параметры.Покупатель, Новый Структура("АдресЮридический", ""));
	ОбластьЗаголовок.Параметры.АдресПокупателя = ?(НЕ ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.АдресПокупателя), "--", ОбластьЗаголовок.Параметры.АдресПокупателя);
	Если ТипЗнч(ОбластьЗаголовок.Параметры.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда 
		КПП = ДанныеДокумента.Покупатель.КПП;
	Иначе
		КПП = спПолучитьКППДляПечати(ДанныеДокумента.Организация, ДанныеДокумента.ПодразделениеКомпании);
	КонецЕсли;
	ОбластьЗаголовок.Параметры.ИННПокупателя = 
		?(ЗначениеЗаполнено(ОбластьЗаголовок.Параметры.Покупатель.ИНН), ОбластьЗаголовок.Параметры.Покупатель.ИНН, "--")
		+"/"+?(ЗначениеЗаполнено(КПП), КПП, "--");
	
	// Если дата документа позднее 01.07.2017.
	Если ВыводитьКодВидаТовара Тогда
		ОбластьЗаголовок.Параметры.Редакция = 
			НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
	ИначеЕсли ДанныеДокумента.Дата >= Дата('20170701') И МакетДо2021 Тогда
		ОбластьЗаголовок.Параметры.Редакция = 
			НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
	КонецЕсли;
	
	// Выводим область.
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	// Если дата документа позднее 01.07.2017.
	Если ДанныеДокумента.Дата >= Дата('20170701') Тогда
		ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
		
		Если МакетДо2021 Тогда
			ЗаголовокИдентификатораГосударственногоКонтракта = 
					НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения)'") 
					+ ?(ВыводитьКодВидаТовара, " (" + НСтр("ru = 'при наличии'") + ")", "")+": ";
		Иначе
			ЗаголовокИдентификатораГосударственногоКонтракта = "";
		КонецЕсли;
		
		ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = 
			ЗаголовокИдентификатораГосударственногоКонтракта + ДанныеДокумента.ИдентификаторГосударственногоКонтракта;
		ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
	КонецЕсли;
	
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если МакетДо2021 Тогда
		ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
		Если НЕ ВыводитьКодВидаТовара Тогда
			
			НовыйТекст = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Лево-1).Текст;
			
			ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(3,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Право);
			ОбластьВыреза.Объединить();
			ОбластьВыреза.Текст = НовыйТекст;
			
			ОбластьВыреза = ОбластьЗаголовокТаблицы.Область(5,ОбластьКодВидаТовара.Лево-1,5,ОбластьКодВидаТовара.Право);
			ОбластьВыреза.Объединить();
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	Смещать = ТипСмещенияТабличногоДокумента.ПоВертикали;
	Область = ТабДокумент.Область(?(ДанныеДокумента.Дата >= Дата('20170701'),"R17","R16"));
	ТабДокумент.УдалитьОбласть(Область, Смещать); 
	КоличествоСтраниц = 1;
	НомерСтраницы	= 2;
	НомерСтраницыПред = НомерСтраницы;
	
	// Заполним параметры шапки таблицы для следующего листа
	ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы  = "Лист" + " " + НомерСтраницы;
	Если ОбластьЗаголовок.Параметры.Номер <> "--" И ОбластьЗаголовок.Параметры.Дата <> "--" Тогда
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = НСтр("ru = 'Универсальный корректировочный документ'") + " № " 
				+ ОбластьЗаголовок.Параметры.Номер+" от "+ОбластьЗаголовок.Параметры.Дата;
	Иначе
		ОбластьЗаголовокТаблицы.Параметры.ТекстЗаголовка = НСтр("ru = 'Универсальный корректировочный документ'") + " № " 
				+ ОбластьЗаголовок.Параметры.НомерИсправления+" от "+ОбластьЗаголовок.Параметры.ДатаИсправления;
	КонецЕсли;
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара И МакетДо2021 Тогда
		ОбластьСтрока.Область(1,ОбластьКодВидаТовара.Лево-1,1,ОбластьКодВидаТовара.Право).Объединить();
		ОбластьСтрока.Область(2,ОбластьКодВидаТовара.Лево-1,2,ОбластьКодВидаТовара.Право).Объединить();
		ОбластьСтрока.Область(3,ОбластьКодВидаТовара.Лево-1,3,ОбластьКодВидаТовара.Право).Объединить();
		ОбластьСтрока.Область(4,ОбластьКодВидаТовара.Лево-1,4,ОбластьКодВидаТовара.Право).Объединить();
	КонецЕсли;
	
	ИтогоСтоимостьУвеличение = 0;
	ИтогоСтоимостьУменьшение = 0;
	ИтогоСуммаНДСУвеличение = 0;
	ИтогоСуммаНДСУменьшение = 0;
	ИтогоВсегоУвеличение = 0;
	ИтогоВсегоУменьшение = 0;
	ИтогоКоличествоПрослежУвеличениеВсего = 0;
	ИтогоКоличествоПрослежУменьшениеВсего = 0;
	//НомерСтраницы = 1;
	//НомерСтраницыПред = НомерСтраницы;
	СтруктураИтоговПоСтранице = Новый Структура("Сумма", 0);
	НомерСтроки = 1;
	
	Если ВыборкаТабличнойЧасти.Количество() > 0 Тогда
		
		Ном = 0;
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьИтого);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвалНакладной);
		
		ЕдиницаИзмеренияАвтоработВПечатныхФормах = ДокументОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
		Для Каждого ТекСтрока Из ВыборкаТабличнойЧасти Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
			
			Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				
				ОбластьСтрока.Параметры.ТоварКод = ТекСтрока.Номенклатура.Артикул;
				
				Если ВыводитьКодВидаТовара ИЛИ НЕ МакетДо2021 Тогда
					
					КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
					
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						
						ОбластьСтрока.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						
						ОбластьСтрока.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
				
				Если ВыводитьКодВидаТовара ИЛИ НЕ МакетДо2021 Тогда
					
					КодТНВЭД = ТекСтрока.Номенклатура.КодТНВЭД;
					
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						
						ОбластьСтрока.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						
						ОбластьСтрока.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				Если ВыводитьКодВидаТовара ИЛИ НЕ МакетДо2021 Тогда
					
					ОбластьСтрока.Параметры.КодВидаТовара = "--";
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаТабличнойЧасти.Колонки.Найти("ТоварНаименование") <> Неопределено Тогда
				
				Наименование = ТекСтрока.ТоварНаименование;
			Иначе
				
				Наименование = ?(ЗначениеЗаполнено(ТекСтрока.Номенклатура.НаименованиеПолное), 
						ТекСтрока.Номенклатура.НаименованиеПолное, ТекСтрока.Номенклатура.Наименование);
			КонецЕсли;
			
			Если ДокументОбъект.Дата >= Дата(2016, 07, 01) И НЕ ВыводитьКодВидаТовара И МакетДо2021 Тогда
				
				Если ТекСтрока.Номенклатура.Метаданные().Реквизиты.Найти("КодТНВЭД") <> Неопределено Тогда
					
					Если ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС 
						И СокрЛП(ТекСтрока.Номенклатура.КодТНВЭД) <> "" Тогда
						
						Наименование = Наименование + ", " + НСтр("ru='код ТН ВЭД'") + " " + ТекСтрока.Номенклатура.КодТНВЭД;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.ТоварНаименование = Наименование;
			
			КоличествоДоИзменения = ТекСтрока.Количество - ТекСтрока.КоличествоРазница;
			КоличествоПослеИзменения = ТекСтрока.Количество;
			
			Если ТекСтрока.Номенклатура.Метаданные().Реквизиты.Найти("ВидНоменклатуры") <> Неопределено И 
				ТекСтрока.Номенклатура <> Перечисления.ВидыНоменклатуры.Услуга Тогда
				
				ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод  = ТекСтрока.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				ОбластьСтрока.Параметры.ЕдиницаИзмерения     = ТекСтрока.ЕдиницаИзмерения;
				
			ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Автоработы") Тогда
				
				ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод = "356";
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
				Если ВыборкаТабличнойЧасти.Колонки.Найти("Коэффициент") <> Неопределено Тогда
					КоличествоДоИзменения = (ТекСтрока.Количество - ТекСтрока.КоличествоРазница)
						* ТекСтрока.КоэффициентПоДокументуРеализации;
					КоличествоПослеИзменения = ТекСтрока.Количество * ТекСтрока.Коэффициент;
				КонецЕсли;
				
			Иначе
				
				ОбластьСтрока.Параметры.ЕдиницаИзмеренияКод = "--";
				ОбластьСтрока.Параметры.ЕдиницаИзмерения = "--";
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Акциз = НСтр("ru = 'без акциза'");
			
			ОбластьСтрока.Параметры.КоличествоДоИзменения = Формат(КоличествоДоИзменения, ФорматВыводаКоличества2021);
			ОбластьСтрока.Параметры.КоличествоПослеИзменения = Формат(КоличествоПослеИзменения, ФорматВыводаКоличества2021);
			
			ОбластьСтрока.Параметры.СуммаНДСДоИзменения = ТекСтрока.СуммаНДС - ТекСтрока.СуммаНДСРазница;
			ОбластьСтрока.Параметры.СуммаНДСПослеИзменения = ТекСтрока.СуммаНДС;
			ОбластьСтрока.Параметры.СуммаНДСУвеличение = 
				?(ОбластьСтрока.Параметры.СуммаНДСПослеИзменения > ОбластьСтрока.Параметры.СуммаНДСДоИзменения,
				ОбластьСтрока.Параметры.СуммаНДСПослеИзменения - ОбластьСтрока.Параметры.СуммаНДСДоИзменения,
				0);
			ОбластьСтрока.Параметры.СуммаНДСУменьшение = 
				?(ОбластьСтрока.Параметры.СуммаНДСДоИзменения > ОбластьСтрока.Параметры.СуммаНДСПослеИзменения,
				ОбластьСтрока.Параметры.СуммаНДСДоИзменения - ОбластьСтрока.Параметры.СуммаНДСПослеИзменения,
				0);
			
			ОбластьСтрока.Параметры.ВсегоДоИзменения = ТекСтрока.СуммаВсего - ТекСтрока.СуммаВсегоРазница;
			ОбластьСтрока.Параметры.ВсегоПослеИзменения = ТекСтрока.СуммаВсего;
			ОбластьСтрока.Параметры.ВсегоУвеличение = 
				?(ОбластьСтрока.Параметры.ВсегоПослеИзменения > ОбластьСтрока.Параметры.ВсегоДоИзменения,
				ОбластьСтрока.Параметры.ВсегоПослеИзменения - ОбластьСтрока.Параметры.ВсегоДоИзменения,
				0);
			ОбластьСтрока.Параметры.ВсегоУменьшение = 
				?(ОбластьСтрока.Параметры.ВсегоДоИзменения > ОбластьСтрока.Параметры.ВсегоПослеИзменения,
				ОбластьСтрока.Параметры.ВсегоДоИзменения - ОбластьСтрока.Параметры.ВсегоПослеИзменения,
				0);
			
			ОбластьСтрока.Параметры.СтоимостьДоИзменения = ОбластьСтрока.Параметры.ВсегоДоИзменения - ОбластьСтрока.Параметры.СуммаНДСДоИзменения;
			ОбластьСтрока.Параметры.СтоимостьПослеИзменения = ОбластьСтрока.Параметры.ВсегоПослеИзменения - ОбластьСтрока.Параметры.СуммаНДСПослеИзменения;
			ОбластьСтрока.Параметры.СтоимостьУвеличение = 
				?(ОбластьСтрока.Параметры.СтоимостьПослеИзменения > ОбластьСтрока.Параметры.СтоимостьДоИзменения, 
					ОбластьСтрока.Параметры.СтоимостьПослеИзменения - ОбластьСтрока.Параметры.СтоимостьДоИзменения, 
					0);
			ОбластьСтрока.Параметры.СтоимостьУменьшение = 
				?(ОбластьСтрока.Параметры.СтоимостьДоИзменения > ОбластьСтрока.Параметры.СтоимостьПослеИзменения,
					ОбластьСтрока.Параметры.СтоимостьДоИзменения - ОбластьСтрока.Параметры.СтоимостьПослеИзменения,
					0);
			
			ОбластьСтрока.Параметры.ЦенаДоИзменения = 
				?(КоличествоДоИзменения <> 0, 
					ОбластьСтрока.Параметры.СтоимостьДоИзменения / КоличествоДоИзменения, 
					0);
			ОбластьСтрока.Параметры.ЦенаПослеИзменения = 
				?(КоличествоПослеИзменения <> 0, 
					ОбластьСтрока.Параметры.СтоимостьПослеИзменения / КоличествоПослеИзменения, 
					0);
			
			// Заполним ГТД и РНПТ
			Если НЕ МакетДо2021 Тогда
				
				ОбластьСтрока.Параметры.НомерСтроки = ?(ТекСтрока.НомерИсходнойСтроки = 0, "--", ТекСтрока.НомерИсходнойСтроки);
				
				Если ВыборкаТабличнойЧасти.Колонки.Найти("ГТДДоКорректировки") <> Неопределено Тогда
					ОбластьСтрока.Параметры.СтранаПроисхожденияКодДо =
					?(ЗначениеЗаполнено(ТекСтрока.ГТДДоКорректировки.Страна.Код), ТекСтрока.ГТДДоКорректировки.Страна.Код, "--");
					ОбластьСтрока.Параметры.ПредставлениеСтраныДо=
					?(ЗначениеЗаполнено(ТекСтрока.ГТДДоКорректировки.Страна.Наименование), ТекСтрока.ГТДДоКорректировки.Страна.Наименование, "--");
					ОбластьСтрока.Параметры.ПредставлениеГТДДо =
					?(ЗначениеЗаполнено(ТекСтрока.ГТДДоКорректировки.Наименование), ТекСтрока.ГТДДоКорректировки.Наименование, "--");
				Иначе
					ОбластьСтрока.Параметры.СтранаПроисхожденияКодДо =
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Страна.Код), ТекСтрока.ГТД.Страна.Код, "--");
					ОбластьСтрока.Параметры.ПредставлениеСтраныДо=
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Страна.Наименование), ТекСтрока.ГТД.Страна.Наименование, "--");
					ОбластьСтрока.Параметры.ПредставлениеГТДДо=
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Наименование), ТекСтрока.ГТД.Наименование, "--");
				КонецЕсли;
				
					ОбластьСтрока.Параметры.СтранаПроисхожденияКодПосле =
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Страна.Код), ТекСтрока.ГТД.Страна.Код, "--");
				ОбластьСтрока.Параметры.ПредставлениеСтраныПосле=
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Страна.Наименование), ТекСтрока.ГТД.Страна.Наименование, "--");
				ОбластьСтрока.Параметры.ПредставлениеГТДПосле=
					?(ЗначениеЗаполнено(ТекСтрока.ГТД.Наименование), ТекСтрока.ГТД.Наименование, "--");

				НомерСтроки = НомерСтроки + 1;
				
				Если ЕстьРНПТ Тогда
					
					Если ЗначениеЗаполнено(ТекСтрока.ГТД) И ТекСтрока.ГТД.РНПТ Тогда
						
						Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
							
							ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослежКод = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения.Код;
							ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослеж = ТекСтрока.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
							ОбластьСтрока.Параметры.КоличествоПрослежДо = Формат(ТекСтрока.ГТДКоличествоДо, ФорматВыводаКоличества2021);
							ОбластьСтрока.Параметры.КоличествоПрослежПосле = Формат(ТекСтрока.ГТДКоличествоПосле, ФорматВыводаКоличества2021);
							КоличествоПрослеж = ТекСтрока.ГТДКоличествоПосле - ТекСтрока.ГТДКоличествоДо;
							
						Иначе
							
							ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослежКод = "796";
							ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослеж = "шт";
							ОбластьСтрока.Параметры.КоличествоПрослежДо = Формат(ТекСтрока.Количество - ТекСтрока.КоличествоРазница, ФорматВыводаКоличества2021);
							ОбластьСтрока.Параметры.КоличествоПрослежПосле = Формат(ТекСтрока.Количество, ФорматВыводаКоличества2021);
							КоличествоПрослеж = ТекСтрока.КоличествоРазница;
							
						КонецЕсли;
						
						ОбластьСтрока.Параметры.КоличествоПрослежУвеличение = Формат(?(КоличествоПрослеж > 0, КоличествоПрослеж, 0), ФорматВыводаКоличества2021);
						ОбластьСтрока.Параметры.КоличествоПрослежУменьшение = Формат(?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0), ФорматВыводаКоличества2021);
						
						ИтогоКоличествоПрослежУвеличениеВсего =
							ИтогоКоличествоПрослежУвеличениеВсего + ?(КоличествоПрослеж > 0, КоличествоПрослеж, 0);
						ИтогоКоличествоПрослежУменьшениеВсего =
							ИтогоКоличествоПрослежУменьшениеВсего + ?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0);
						
					Иначе
						
						ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослежКод = "--";
						ОбластьСтрока.Параметры.ЕдиницаИзмеренияПрослеж = "--";
						ОбластьСтрока.Параметры.КоличествоПрослежДо = "--";
						ОбластьСтрока.Параметры.КоличествоПрослежПосле = "--";
						ОбластьСтрока.Параметры.КоличествоПрослежУвеличение = Формат(0, ФорматВыводаКоличества2021);
						ОбластьСтрока.Параметры.КоличествоПрослежУменьшение = Формат(0, ФорматВыводаКоличества2021);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ИтогоСтоимостьУвеличение = ИтогоСтоимостьУвеличение + ОбластьСтрока.Параметры.СтоимостьУвеличение;
			ИтогоСтоимостьУменьшение = ИтогоСтоимостьУменьшение + ОбластьСтрока.Параметры.СтоимостьУменьшение;
			
			ИтогоСуммаНДСУвеличение = ИтогоСуммаНДСУвеличение + ОбластьСтрока.Параметры.СуммаНДСУвеличение;
			ИтогоСуммаНДСУменьшение = ИтогоСуммаНДСУменьшение + ОбластьСтрока.Параметры.СуммаНДСУменьшение;
			
			ИтогоВсегоУвеличение = ИтогоВсегоУвеличение + ОбластьСтрока.Параметры.ВсегоУвеличение;
			ИтогоВсегоУменьшение = ИтогоВсегоУменьшение + ОбластьСтрока.Параметры.ВсегоУменьшение;
			
			Ном = Ном + 1;
			// Выводим строку, делая проверку попадания на лист.
			НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьСтрока, ОбластьЗаголовокТаблицы, , НомерСтраницы, , ДокументОбъект, ?((Ном=КоличествоСтрок И Ном<>1) ,мсвДопОбластиПодвала,Неопределено));
			
			// Инициализация итогов по странице.
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				
				НомерСтраницыПред = НомерСтраницы;
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Лист:" + " " + НомерСтраницы; 
				КоличествоСтраниц = КоличествоСтраниц +1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьИтого.Параметры.ИтогоСтоимостьУвеличение = ИтогоСтоимостьУвеличение;
	ОбластьИтого.Параметры.ИтогоСтоимостьУменьшение = ИтогоСтоимостьУменьшение;
	
	ОбластьИтого.Параметры.ИтогоСуммаНДСУвеличение = ИтогоСуммаНДСУвеличение;
	ОбластьИтого.Параметры.ИтогоСуммаНДСУменьшение = ИтогоСуммаНДСУменьшение;
	
	ОбластьИтого.Параметры.ИтогоВсегоУвеличение = ИтогоВсегоУвеличение;
	ОбластьИтого.Параметры.ИтогоВсегоУменьшение = ИтогоВсегоУменьшение;
	
	Если НЕ МакетДо2021 И ЕстьРНПТ Тогда
		
		ОбластьИтого.Параметры.КоличествоПрослежУвеличениеВсего = Формат(ИтогоКоличествоПрослежУвеличениеВсего, ФорматВыводаКоличества2021);
		ОбластьИтого.Параметры.КоличествоПрослежУменьшениеВсего = Формат(ИтогоКоличествоПрослежУменьшениеВсего, ФорматВыводаКоличества2021);
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Заполним информацию о руководителях организации.
	Если ДанныеДокумента.Организация.ФормаСобственности =
			Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
			
		ОбластьПодвал.Параметры.ФИОПБОЮЛ = ДанныеДокумента.Руководитель.Руководитель;
		ОбластьПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(ДокументОбъект.Организация,Перечисления.ВидыДокументов.Свидетельство);
	Иначе
		ОбластьПодвал.Параметры.ФИОРуководителя = ДанныеДокумента.Руководитель.Руководитель;
	КонецЕсли;
	ОбластьПодвал.Параметры.ФИОГлавногоБухгалтера = ДанныеДокумента.ГлавныйБухгалтер.ГлавныйБухгалтер;
	ОбластьПодвал.Параметры.КоличествоЛистов = НСтр("ru = 'Документ 
	|составлен на'")
	+ Символы.ПС + КоличествоСтраниц + " " + "листах";
	
	Если МакетДо2021 Тогда
		ОбластьПодвал.Параметры.ТекстИндивидуальныйПредприниматель =
			?(ВыводитьКодВидаТовара,НСтр("ru = 'Индивидуальный предприниматель или иное уполномоченное лицо'"), 
									НСтр("ru = 'Индивидуальный предприниматель'"));
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ОбластьПодвалНакладной.Параметры.Основание = ?(ЗначениеЗаполнено(ДанныеДокумента.ДоговорВзаиморасчетов), 
													ДанныеДокумента.ДоговорВзаиморасчетов, "");
	
	ОбластьПодвалНакладной.Параметры.Основание = ?(НЕ ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.Основание), 
		"--", ОбластьПодвалНакладной.Параметры.Основание);
			
	Попытка
		Менеджер = дкОтветственноеЛицо(ДокументОбъект,"Менеджер");
		ОбластьПодвалНакладной.Параметры.ФИОМенеджера = Менеджер.МенеджерПредставление;
		ОбластьПодвалНакладной.Параметры.ДолжностьМенеджера = Менеджер.МенеджерДолжность;
	Исключение
	КонецПопытки;
	
	ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ДанныеДокумента.ДатаОтгрузки;
	
	Если НЕ ЗначениеЗаполнено(ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи) Тогда
		ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = ДанныеДокумента.Дата;
	КонецЕсли;
	ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи = Формат(ОбластьПодвалНакладной.Параметры.ДатаОтгрузкиПередачи, "ДЛФ=ДД");
	
	ОбластьПодвалНакладной.Параметры.ПредставлениеОрганизации = ОбластьЗаголовок.Параметры.ПредставлениеПоставщика 
			+", " + "ИНН/КПП" +" "+ОбластьЗаголовок.Параметры.ИННПоставщика;
	
	ОбластьПодвалНакладной.Параметры.ПредставлениеКонтрагента = ОбластьЗаголовок.Параметры.ПредставлениеПокупателя
				+", " + "ИНН/КПП" + " " + ОбластьЗаголовок.Параметры.ИННПокупателя;
	ТабДокумент.Вывести(ОбластьПодвалНакладной);
		
	Возврат ТабДокумент;
КонецФункции // дкПечатьУКД()

#КонецЕсли

// Вывод итогов по странице печатной формы документа
//
// Параметры:
// ТабДокумент - табличный документ, печатная форма документа
// ОбластьПодвал - область табличного документа, область куда выводятся итоги
// СтруктураИтоговПоСтранице - структура, сравнит данные для вывода
// Права   - структура, права текущего пользователя или объект документа
//
Процедура дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьПодвал,СтруктураИтоговПоСтранице,Права,Прослеживаемость = Ложь) Экспорт
	Если ОбластьПодвал <> Неопределено Тогда
		Если СтруктураИтоговПоСтранице <> Неопределено Тогда
			Попытка
				ПраваПользователя=Права.Права;
				ЭтотОбъект=Права;
			Исключение
				ПраваПользователя=Права;
				ЭтотОбъект=Неопределено;
			КонецПопытки; 
			ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",ПраваПользователя,,ЭтотОбъект);
			ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",ПраваПользователя,,ЭтотОбъект);
			Если Прослеживаемость Тогда
				ФорматВыводаКоличества2021 = обПраво("ПредставлениеНоляВПФУКД", ПраваПользователя,,ЭтотОбъект);
			КонецЕсли;
			Для Каждого ЭлементИтога Из СтруктураИтоговПоСтранице Цикл
				Если Прослеживаемость И Найти(ЭлементИтога.Ключ,"Прослеж") <> 0 Тогда
					ЗначениеПараметра = Формат(ЭлементИтога.Значение,ФорматВыводаКоличества2021);
				ИначеЕсли Найти(ЭлементИтога.Ключ,"Кол") <> 0 Тогда
					ЗначениеПараметра = Формат(ЭлементИтога.Значение,ФорматВыводаКоличества);
				Иначе
					ЗначениеПараметра = Формат(ЭлементИтога.Значение,ФорматВыводаСуммы);
				КонецЕсли;
				Попытка
					ОбластьПодвал.Параметры[ЭлементИтога.Ключ] = ЗначениеПараметра;
				Исключение
				КонецПопытки; 
			КонецЦикла;
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
КонецПроцедуры // дкДействияФормыСоздатьНапоминание()

// Функция проверяет попадание текущей области и области подвала на страницу
//
// Параметры:
// ТабДокумент 			 - табличный документ, в который выводится информация, подготовленная к печати
// Область 				 - текущая или массив текущих областей, предназначенных для вывода в данный момент
// ОбластьШапка 			 - область или массив областей, выступающих в качестве шапки и
// которые будут выводиться на каждой странице
// ОбластьПодвал 			 - область, которая будет выводиться в качестве подвала на каждой странице
// НомерСтраницы 			 - номер печатаемой страницы
// ТекстЗаголовка 			 - текст, выводимый как подпись к шапке очередного листа
// СтруктураИтоговПоСтранице - структура содержащая, накопленные итоги по текущей странице
//					 	 	 значение ключа структуры должно совпадать с идентификатором реквизита табличной части документа
// мсвДопОбластиПодвала  - подвальная часть макета. Проверка попадания последней строки таблицы на страницу
//							общего подвала Если = Неопределено, то проверка не осуществляется
// ВсегоСтраниц 			 - количество страниц выводимой
//
//Возвращаемое значение:
// Число - текущий номер страницы
//
Функция дкВывестиГоризонтальнуюОбласть(ТабДокумент, Область, ОбластьШапка = Неопределено, ОбластьПодвал = Неопределено, НомерСтраницы = 1,
	СтруктураИтоговПоСтранице = Неопределено, Права = Неопределено, мсвДопОбластиПодвала = Неопределено) Экспорт
	
	Попытка
		ПраваПользователя=Права.Права;
		ЭтотОбъект=Права;
	Исключение
		ПраваПользователя=Права;
		ЭтотОбъект=Неопределено;
	КонецПопытки; 
	
	ИспользоватьРазбиениеНаСтраницы = обПраво("ИспользоватьРазбиениеНаСтраницы",ПраваПользователя,,ЭтотОбъект);
	
	//если не разбиваем, выводим и все
	Если Не ИспользоватьРазбиениеНаСтраницы Тогда
		ТабДокумент.Вывести(Область);
		Возврат НомерСтраницы;
	КонецЕсли;
	
	//запишем их в один массив
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(Область);
	Если ОбластьПодвал <> Неопределено Тогда
		МассивОбластейДляПроверки.Добавить(ОбластьПодвал);
	КонецЕсли;
	Если мсвДопОбластиПодвала <> Неопределено Тогда
		Для Каждого ТекОбласть Из мсвДопОбластиПодвала Цикл
			МассивОбластейДляПроверки.Добавить(ТекОбласть);
		КонецЦикла;
	КонецЕсли;
	
	Попытка
		//проверим, помещаются ли на странице
		РезультатПроверки = ТабДокумент.ПроверитьВывод(МассивОбластейДляПроверки);

		//если не помещаются, то ...
		Если НЕ РезультатПроверки Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьПодвал,СтруктураИтоговПоСтранице,Права); //выводим итог по странице
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); //переходим на следующую страницу
			НомерСтраницы = НомерСтраницы + 1;
			Если ОбластьШапка <> Неопределено Тогда
				ТабДокумент.Вывести(ОбластьШапка); //выводим шапку таблицы
			КонецЕсли;
		КонецЕсли;
	Исключение 		
	КонецПопытки;
	
	//выводим текущую область
	ТабДокумент.Вывести(Область);
	
	Возврат НомерСтраницы;
КонецФункции // дкВывестиГоризонтальнуюОбласть()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ВЫЗОВА ОТЧЕТОВ ДЛЯ ДОКУМЕНТОВ

#Если Клиент Тогда
	
// Вызывает отчет "СверкаТоварногоИОрдерногоУчета"
// Параметры:
//	ТекущийДокумент - документ вызвавший процедуру
//
Процедура дкОтчетСверкаТоварногоИОрдерногоУчета(ТекущийДокумент) Экспорт
	
	Если ТекущийДокумент.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОтчетСверкаТоварногоИОрдерногоУчета = Отчеты.СверкаТоварногоИОрдерногоУчета.Создать();
	ОтчетСверкаТоварногоИОрдерногоУчета.РежимВыводаОтчета	 = Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
	ОтчетСверкаТоварногоИОрдерногоУчета.РежимНастройки		 = Перечисления.РежимыНастройкиОтчетов.Эксперт;
	ОтчетСверкаТоварногоИОрдерногоУчета.ВидОтчета			 = Перечисления.ВидыОтчетов.ПрочиеОстатки; // Устанавливаем вид отчета
	ОтчетСверкаТоварногоИОрдерногоУчета.ИмяФормыНастроек	 = "НастройкиОбороты";
	
	ОтчетСверкаТоварногоИОрдерногоУчета.ЗаполнитьНачальныеНастройки("ТекстЗапросаОбороты");
	ОтчетСверкаТоварногоИОрдерногоУчета.ДатаНачала = ТекущийДокумент.Дата;
	ОтчетСверкаТоварногоИОрдерногоУчета.ДатаКонца = КонецДня(ТекущаяДата());
	
	Отборы = ОтчетСверкаТоварногоИОрдерногоУчета.ПостроительОтчета.Отбор;
	Фильтр = Отборы.Найти("ДокументДвижения");
	Если Фильтр = Неопределено Тогда
		ДеревоДоступныхПолей = ОтчетСверкаТоварногоИОрдерногоУчета.ДеревоДоступныхПолей;
		Фильтр = Отборы.Добавить("ДокументДвижения","ДокументДвижения",ДеревоДоступныхПолей.Строки.Найти("ДокументДвижения", "ПутьКДанным").ПолноеПредставление);
	КонецЕсли;
	Фильтр.Использование = Истина;
	Фильтр.ВидСравнения = ВидСравнения.Равно;
	Фильтр.Значение = ТекущийДокумент;
	
	ОтчетСверкаТоварногоИОрдерногоУчета.ВыводитьТолькоНеНулевуюРазницу = Ложь;
	
	ФормаОтчета = ПолучитьОбщуюФорму("Отчет");
	ФормаОтчета.ОтчетОбъект = ОтчетСверкаТоварногоИОрдерногоУчета;
	ФормаОтчета.Заголовок = "Сверка товарного и ордерного учета";
	ФормаОтчета.Открыть();
	
КонецПроцедуры // дкОтчетСверкаТоварногоИОрдерногоУчета()
	
#КонецЕсли

// Возвращает номер документа для вывода в печатных формах
//
// Параметры
// ЭтотОбъект - ДокументОбъект или ДокументСсылка - документ, для которого производится действие
//
// Возвращаемое значение:
// Строка – Номер документа, для представления в печатных формах
//
Функция дкПолучитьНомерДляПечати(ЭтотОбъект, СокращенныйНомер = Ложь, РеквизитНомер = "Номер") Экспорт
	ЭтотОбъектНомер = ЭтотОбъект[РеквизитНомер];
	
	Если (НЕ СокращенныйНомер) И (обПраво("ПолныйНомерДокументаВПечатныхФормах",,,ЭтотОбъект)) Тогда
		Возврат ЭтотОбъектНомер;
	КонецЕсли; 
	
	//Получим префикс документа для текущего узла РИБ
	ЭтотОбъектПрефикс = обПолучитьПрефиксОбъекта(ЭтотОбъект,"");
	Если Найти(ЭтотОбъектНомер,ЭтотОбъектПрефикс) = 1 Тогда
		ЭтотОбъектНомер = Сред(ЭтотОбъектНомер,СтрДлина(ЭтотОбъектПрефикс) + 1);
		
	Иначе
		//Для текущего узла префикс не найден
		//Попробуем сформировать префикс для других узлов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УдаленныеПодразделения.Ссылка
		|ИЗ
		|	ПланОбмена.УдаленныеПодразделения КАК УдаленныеПодразделения";
		ВыборкаУзлов = Запрос.Выполнить().Выбрать();
		Пока ВыборкаУзлов.Следующий() Цикл
			ЭтотОбъектПрефикс = обПолучитьПрефиксОбъекта(ЭтотОбъект,"",ВыборкаУзлов.Ссылка);
			Если Найти(ЭтотОбъектНомер,ЭтотОбъектПрефикс) = 1 Тогда
				ЭтотОбъектНомер = Сред(ЭтотОбъектНомер,СтрДлина(ЭтотОбъектПрефикс) + 1);
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	// Удалим лидирующие нули в номере
	Пока Лев(ЭтотОбъектНомер, 1) = "0" Цикл
		ЭтотОбъектНомер = Сред(ЭтотОбъектНомер, 2);
	КонецЦикла;
	
	Возврат ЭтотОбъектНомер;
КонецФункции // дкПолучитьНомерДляПечати()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ МОДУЛЕЙ ДОКУМЕНТОВ

// Общий обработчик события ПриУстановкеНовогоНомера документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, обрабатываемый документ
// СтандартнаяОбработка – булево, признак стандартной обработки
// префикс - строка, префикс номера
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Экспорт
	
	Результат = Истина;
	
	НовыйПрефикс = обПолучитьПрефиксОбъекта(ЭтотОбъект,Префикс);
	Если НовыйПрефикс = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		Префикс = НовыйПрефикс;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции // дкПриУстановкеНовогоНомера()

// Общий обработчик события ПриКопировании документа 
//
// Параметры:
// ЭтотОбъект 	 - ДокументОбъект - документ, для которого производится действие
// ОбъектКопирования - ДокументСсылка - ссылка на документ, который копируется
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Экспорт
	
	Результат = Истина;
	
	Попытка
		ДокументОснование = ОбъектКопирования.ДокументОснование;
	Исключение
		ДокументОснование = Неопределено;
	КонецПопытки; 
	
	//получим свойства объекта копирования и запишем их в переменную модуля объекта
	Попытка
		ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов = Обработки.ЗначенияСвойствОбъекта.Создать();
		ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений = ОбъектКопирования.Ссылка;
		ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ПрочитатьЗаполнитьСвойстваИЗначения();
		ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений = ЭтотОбъект.Ссылка;
	Исключение 
	КонецПопытки;
	
	дкОбработкаЗаполнения(ЭтотОбъект,Неопределено,Истина);
	
	Возврат Результат;   	
КонецФункции // дкПриКопировании()

// Заполнение реквизита РегламентированныйУчет 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект - документ, для которого производится действие
// Копирование – булево, признак того что документ скопирован
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкОбработкаЗаполненияРегламентированныйУчет(ЭтотОбъект,Копирование = Ложь) Экспорт
	
	Результат = Истина;
	
	// для новых объектов заполним реквизиты по умолчанию
	Если (ЭтотОбъект.ЭтоНовый()) И (НЕ Копирование) Тогда
		Попытка 	ПраваПользователя = ЭтотОбъект.Права;
		Исключение	ПраваПользователя = Неопределено;
		КонецПопытки;
		Попытка 
			ОтношениеКРегламентированномуУчету = обПраво("ОтношениеКРегламентированномуУчету",ПраваПользователя,,ЭтотОбъект);
			Если ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрТолькоРегламентированныхДокументов Тогда
				ЭтотОбъект.РегламентированныйУчет = Истина; 
			ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрТолькоНеРегламентированныхДокументов Тогда
				ЭтотОбъект.РегламентированныйУчет = Ложь; 
			ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрВсехДокументовИстина Тогда
				ЭтотОбъект.РегламентированныйУчет = Истина; 
			ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрВсехДокументовЛожь Тогда
				ЭтотОбъект.РегламентированныйУчет = Ложь; 
			ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.РедактированиеВсехДокументовИстина Тогда
				ЭтотОбъект.РегламентированныйУчет = Истина; 
			ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.РедактированиеВсехДокументовЛожь Тогда
				ЭтотОбъект.РегламентированныйУчет = Ложь; 	
			КонецЕсли;	
		Исключение 
		КонецПопытки;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции // дкОбработкаЗаполненияРегламентированныйУчет()

// Заполнение реквизитов документа по умолчанию 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект - документ, для которого производится действие
// Основание - ДокументСсылка - ссылка на документ-основание
// Копирование – булево, признак того что документ скопирован
//
Процедура дкОбработкаЗаполненияПоУмолчанию(ЭтотОбъект,Основание = Неопределено,Копирование = Ложь,ЗаполнятьТабличныеЧасти = Истина) Экспорт
	
	Пользователь = ПараметрыСеанса.Пользователь;
	// Получим ссылку на набор прав и переменных окружения
	Попытка 	ПраваПользователя = ЭтотОбъект.Права;
	Исключение	ПраваПользователя = Неопределено;
	КонецПопытки; 
	
	МетаданныеДокумента = ЭтотОбъект.Метаданные();
	// для новых объектов заполним реквизиты по умолчанию
	Если (ЭтотОбъект.ЭтоНовый()) И (НЕ Копирование) Тогда
		// проверим можно ли вводить на основании помеченного на удаление
		Если (Основание <> Неопределено) И (Основание.ПометкаУдаления) И 
			НЕ(обПраво("ВводНаОснованииПомеченногоНаУдаление",ПраваПользователя,,ЭтотОбъект)) Тогда
			Сообщить("Запрещено вводить документы на основании помеченных на удаление объектов! Процедура заполнения прервана.",СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
		// установим хоз. операцию по умолчанию
		Если обЗначениеНеЗаполнено(ЭтотОбъект.ХозОперация) Тогда
			СписокХозОпераций = ЭтотОбъект.ПолучитьСписокХозОпераций();
			Для Каждого ХО Из СписокХозОпераций Цикл
				Если ХО.Пометка Тогда
					Попытка 
						ЭтотОбъект.ХозОперация = Справочники.ХозОперации[ХО.Значение];
					Исключение
					КонецПопытки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// попытаемся заполнить реквизиты по умолчанию
		Попытка ЭтотОбъект.Автор = ?(обЗначениеНеЗаполнено(ЭтотОбъект.Автор),Пользователь,ЭтотОбъект.Автор); Исключение КонецПопытки;
		Попытка ЭтотОбъект.Организация = ?(обЗначениеНеЗаполнено(ЭтотОбъект.Организация),ПараметрыСеанса.Организация,ЭтотОбъект.Организация); Исключение КонецПопытки;
		Попытка ЭтотОбъект.ПодразделениеКомпании = ?(обЗначениеНеЗаполнено(ЭтотОбъект.ПодразделениеКомпании),ПараметрыСеанса.ПодразделениеКомпании,ЭтотОбъект.ПодразделениеКомпании); Исключение КонецПопытки;
		Попытка ЭтотОбъект.СкладКомпании = ?(обЗначениеНеЗаполнено(ЭтотОбъект.СкладКомпании),обПраво("ОсновнойСкладКомпании",ПраваПользователя,,ЭтотОбъект),ЭтотОбъект.СкладКомпании); Исключение КонецПопытки;
		Попытка ЭтотОбъект.КассаКомпании = ?(обЗначениеНеЗаполнено(ЭтотОбъект.КассаКомпании),обПраво("ОсновнаяКассаКомпании",ПраваПользователя,,ЭтотОбъект),ЭтотОбъект.КассаКомпании); Исключение КонецПопытки;
		
		// БИЗТЕХ КОВАЛЬ 23.09.2025 ++
		// Сменили право на право по подразделению
		ЗначениеПраваКассаКомпании = обПраво(ПланыВидовХарактеристик.ПраваИНастройки.НайтиПоКоду("К0006"),ПраваПользователя,,ЭтотОбъект);
		Попытка ЭтотОбъект.КассаКомпании = ?(обЗначениеНеЗаполнено(ЗначениеПраваКассаКомпании), ЭтотОбъект.КассаКомпании, ЗначениеПраваКассаКомпании); Исключение КонецПопытки;
		// БИЗТЕХ КОВАЛЬ 23.09.2025 --
		
		//В документах планирования ДДС реквизит "КассаКомпании" называется "СтруктурнаяЕдиница", попытаемся заполнить его...
		Попытка 
			Если ТипЗнч(ЭтотОбъект.СтруктурнаяЕдиница) = Тип("СправочникСсылка.КассыКомпании") И обЗначениеНеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
				ЭтотОбъект.СтруктурнаяЕдиница = обПраво("ОсновнаяКассаКомпании",ПраваПользователя,,ЭтотОбъект);
			КонецЕсли;
		Исключение
		КонецПопытки;		
		Попытка
			Если обЗначениеНеЗаполнено(ЭтотОбъект.ВалютаДокумента) Тогда
				Если обЗначениеНеЗаполнено(ЭтотОбъект.ВалютаДокумента) И (НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ПодразделениеКомпании)) И (НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ПодразделениеКомпании.Валюта)) Тогда
					ЭтотОбъект.ВалютаДокумента = ЭтотОбъект.ПодразделениеКомпании.Валюта; // заполнение валюты документа из реквизита подразделения
				Иначе // заполнение валюты документа из константы
					ЭтотОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
				КонецЕсли;
			КонецЕсли;
		Исключение КонецПопытки;
		дкОбработкаЗаполненияРегламентированныйУчет(ЭтотОбъект,Копирование);
		
		//заполним валюту, чтоб из шапки потом не копировать и два раза курс не получать
		Если Не обЗначениеНеЗаполнено(Основание) Тогда
			Попытка
				ЭтотОбъект.ВалютаДокумента = Основание.ВалютаДокумента;
			Исключение
				Попытка
					ЭтотОбъект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить()
				Исключение
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			Если обЗначениеНеЗаполнено(ЭтотОбъект.Дата) Тогда
				#Если Клиент Тогда
				НаДату=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
			    НаДату=ТекущаяДата();
				#КонецЕсли
				ЭтотОбъект.Дата = НаДату;
			Иначе
				НаДату = ЭтотОбъект.Дата;
			КонецЕсли; 
		Исключение
			НаДату = ТекущаяДата();
			ЭтотОбъект.Дата = НаДату;
		КонецПопытки;
		
		Попытка
			СтруктураКурса = обКурсДляВалюты(ЭтотОбъект.ВалютаДокумента,НаДату);
			ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Исключение
		КонецПопытки;
		
		Попытка
			СтруктураКурса = обКурсДляВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(),НаДату);
			ЭтотОбъект.КурсВалютыУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);;
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ВводОстатковТоваров") Тогда
				ОсновнойТипЦенЗакупки = обПраво("ОсновнойТипЦенЗакупки",ПраваПользователя,,ЭтотОбъект);
				Если ОсновнойТипЦенЗакупки <> Справочники.ТипыЦен.ПустаяСсылка() Тогда
					 ЭтотОбъект.ТипЦен = ОсновнойТипЦенЗакупки;
				Иначе
					 ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
				КонецЕсли; 
			 ИначеЕсли ЭтотОбъект.СкладКомпании.Розничный Тогда 
					ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
			КонецЕсли;					
		Исключение
		КонецПопытки;
		
		// Здесь только один элемент по умолчанию, остальное в обработчиках заполнения
		// тип цен
		Если МетаданныеДокумента.Реквизиты.Найти("ТипЦен") <> Неопределено И обЗначениеНеЗаполнено(ЭтотОбъект.ТипЦен) Тогда
			ЭтоСалон = Ложь;
			Попытка
				Если Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Документооборот.Подсистемы.Автосалон.Состав.Содержит(ЭтотОбъект.Метаданные()) Тогда
					Если ЭтотОбъект.ХозОперация = Справочники.ХозОперации.РазукомплектацияАвтомобилей Тогда
						ЭтоСалон = Ложь;
					Иначе
						ЭтоСалон = Истина;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
				
			Если ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаТМЦ ИЛИ
				 ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаОтгрузку Тогда
				//Для документов продажи
				Если ЭтоСалон Тогда
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенПродажиАвтомобилей", ПраваПользователя,,ЭтотОбъект);
				Иначе
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенПродажи",ПраваПользователя,,ЭтотОбъект);
				КонецЕсли;
			ИначеЕсли ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаАвтомобилей Тогда
				//Для документов продажи
				ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенПродажиАвтомобилей", ПраваПользователя,,ЭтотОбъект);
			ИначеЕсли ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ ИЛИ
					  ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку Тогда
				//Для документов покупки
				Если ЭтоСалон Тогда
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенЗакупкиАвтомобилей", ПраваПользователя,,ЭтотОбъект);
				Иначе
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенЗакупки",ПраваПользователя,,ЭтотОбъект);
				КонецЕсли;
			ИначеЕсли ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей Тогда
				//Для документов покупки
				ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенЗакупкиАвтомобилей",ПраваПользователя,,ЭтотОбъект);
			Иначе
				//Для прочих документов тип цен покупка
				Если ЭтоСалон Тогда
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенЗакупкиАвтомобилей", ПраваПользователя,,ЭтотОбъект);
				Иначе
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенЗакупки",ПраваПользователя,,ЭтотОбъект);
				КонецЕсли;
				
				//исключение для Рабочего листа отдела страхования
				Если ЭтотОбъект.ХозОперация = Справочники.ХозОперации.РабочийЛистОтделаСтрахования Тогда
					ЭтотОбъект.ТипЦен = обПраво("ОсновнойТипЦенПродажи",ПраваПользователя,,ЭтотОбъект);
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
		
		// Здесь только один элемент по умолчанию, остальное в обработчиках заполнения
		// тип цен
		Если МетаданныеДокумента.Реквизиты.Найти("ТипЦенРабот") <> Неопределено И обЗначениеНеЗаполнено(ЭтотОбъект.ТипЦенРабот) Тогда
			ТипЦенРабот = обПраво("ОсновнойТипЦенРабот",ПраваПользователя,,ЭтотОбъект);
			Если ТипЦенРабот.ДляРабот = Истина Тогда
				ЭтотОбъект.ТипЦенРабот = ТипЦенРабот;
			КонецЕсли;
		КонецЕсли;
		
		Если МетаданныеДокумента.Реквизиты.Найти("Проект") <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Проект) 
				И (обПраво("КонтролироватьСоответствиеПроектов",ПраваПользователя,,ЭтотОбъект) = Перечисления.ВидыКонтроля.НеКонтролировать) Тогда
				//используем основной проект подразделения только если соответствие проектов не контролируется
				//в других случаях пусть подставляется только основной проект договора
				ЭтотОбъект.Проект = обПраво("ОсновнойПроект",ПраваПользователя,,ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
		
		Если (МетаданныеДокумента.Реквизиты.Найти("Контрагент") <> Неопределено) И обЗначениеНеЗаполнено(ЭтотОбъект.Контрагент) Тогда
			Если Основание <> Неопределено Тогда
				Попытка
					ЭтотОбъект.Контрагент = Основание.Контрагент;
				Исключение
					ЭтотОбъект.Контрагент = Неопределено;
				КонецПопытки; 
			Иначе
				ЭтотОбъект.Контрагент = Неопределено;
			КонецЕсли;
			
			Если обЗначениеНеЗаполнено(ЭтотОбъект.Контрагент) Тогда
				текКонтрагент = Неопределено;
				Если //Для документов продажи
					(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаТМЦ)
					ИЛИ (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаАвтомобилей)
					ИЛИ (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаОтгрузку)
					ИЛИ (ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПриходныйКассовыйОрдер)
					Тогда
					текКонтрагент = обПраво("ОсновнойПокупатель",ПраваПользователя,,ЭтотОбъект);
				ИначеЕсли //Для документов покупки
					(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ)
					ИЛИ (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей)
					ИЛИ (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку)
					ИЛИ (ЭтотОбъект.ХозОперация = Справочники.ХозОперации.РасходныйКассовыйОрдер)
					Тогда
					текКонтрагент = обПраво("ОсновнойПоставщик",ПраваПользователя,,ЭтотОбъект);
				КонецЕсли;
				
				Если НЕ обЗначениеНеЗаполнено(текКонтрагент) Тогда
					ЭтотОбъект.Контрагент = текКонтрагент;
				КонецЕсли;
				
				//Если есть договор взаиморасчетов, подставим его из основного договора контрагента
				Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Контрагент) Тогда
					ЭтотОбъект.ОбработкаРеквизита("Контрагент",);
				КонецЕсли;
			КонецЕсли;
			
			Если (МетаданныеДокумента.Реквизиты.Найти("ДоговорВзаиморасчетов") <> Неопределено) И обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
				Если Основание <> Неопределено Тогда
					Попытка
						ЭтотОбъект.ДоговорВзаиморасчетов = Основание.ДоговорВзаиморасчетов;
					Исключение
						ЭтотОбъект.ДоговорВзаиморасчетов = Неопределено;
					КонецПопытки; 
				Иначе
					ЭтотОбъект.ДоговорВзаиморасчетов = Неопределено;
				КонецЕсли;
				
				Если обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
					
					
					ВидДоговора = Неопределено;
					
					Если (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаТМЦ) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаАвтомобилей) ИЛИ
						(ЭтотОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенАвтоработКонтрагента) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаОтгрузку) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПрочиеАктивы) Тогда
						
						ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
						
					ИначеЕсли (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.Ценообразование) ИЛИ
						(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку) Тогда
						
						ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
						
					Иначе
						
						ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
						
					КонецЕсли;
					
					ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ЭтотОбъект.Контрагент, ВидДоговора, ЭтотОбъект,, Истина, Ложь);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда 
					ДопПараметры=Новый Структура;
					ДопПараметры.Вставить("НеПерезаполнятьПоДоговоруВзаиморасчетов",Истина);
					ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов",,,ДопПараметры); 
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		//Установим вид оплаты в соответствии с типом цен
		Попытка
			ЭтотОбъект.ВидОплаты = ?(обЗначениеНеЗаполнено(ЭтотОбъект.ВидОплаты),ЭтотОбъект.ТипЦен.ВидОплаты,ЭтотОбъект.ВидОплаты);
		Исключение
		КонецПопытки; 
		
		//Заполнение ставки НДС
		Если МетаданныеДокумента.Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
			Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
				Если МетаданныеДокумента.Реквизиты.Найти("Контрагент") = Неопределено Тогда
					ОсвобожденОтНДС = Ложь;
				Иначе
					ЭтоЧастноеЛицо = Ложь;
					Если ТипЗнч(ЭтотОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
						ЭтоЧастноеЛицо = ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
					КонецЕсли;
					ОсвобожденОтНДС = ЭтотОбъект.Контрагент.ОсвобожденОтНДС ИЛИ ЭтоЧастноеЛицо;
				КонецЕсли;
			Иначе
				ОсвобожденОтНДС	= (МетаданныеДокумента.Реквизиты.Найти("ПодразделениеКомпании")<>Неопределено И ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС) ИЛИ
					(МетаданныеДокумента.Реквизиты.Найти("Организация")<>Неопределено И ЭтотОбъект.Организация.ОсвобожденОтНДС);
			КонецЕсли;
			Если ОсвобожденОтНДС Тогда
				ЭтотОбъект.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			Иначе
				ЭтотОбъект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли; 
			ЭтотОбъект.ОбработкаРеквизита("СтавкаНДС");
		КонецЕсли; 
		
	ИначеЕсли Копирование Тогда
		Попытка
			ЭтотОбъект.Автор = Пользователь;
			ЭтотОбъект.ДокументОснование = Неопределено;
			ЭтотОбъект.Комментарий = Неопределено;
		Исключение
		КонецПопытки;
		
		//заполним курс
		Попытка
			СтруктураКурса = обКурсДляВалюты(ЭтотОбъект.ВалютаДокумента,НаДату);
			ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Исключение
		КонецПопытки;
		
		Попытка
			СтруктураКурса = обКурсДляВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(),НаДату);
			ЭтотОбъект.КурсВалютыУпр = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);;
		Исключение
		КонецПопытки;
		
		// Обновим договор (возможно сроки скопированного не подходят)
		Попытка
			ЭтотОбъект.Дата = ТекущаяДатаСеанса();
			дкОбработкаРеквизитаДоговорВзаиморасчетов(ЭтотОбъект);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Копирование Тогда
		// затрем даты создания и операции
		Если ЭтотОбъект.ЭтоНовый() Тогда
			Попытка
				ЭтотОбъект.ДатаСоздания = Дата("00010101");
			Исключение
			КонецПопытки;
			
			Попытка
				ЭтотОбъект.ДатаОперации = Дата("00010101");
			Исключение
			КонецПопытки;
		КонецЕсли;
	Иначе
		// попытаемся скопировать одноименные реквизиты шапки
		МетаданныеОснования = Основание.Метаданные();
		
		// Проверим, перезаполнение ли при изменении ДокументОснование для СФВыданный и Счет.
		СписокИсключаемыхРеквизитов = "Дата,Номер,ДокументОснование,Автор,СуммаДокумента,Комментарий,ХозОперация,КурсДокумента,КурсВалютыУпр,ВалютаДокумента,ДатаСоздания,ДатаОперации,БлокироватьПерерасчетСкидок,Контрагент,ДоговорВзаиморасчетов";
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаполнениеПриИзмененииДокументаОснования") Тогда
			Если ЭтотОбъект.ДополнительныеСвойства.ЗаполнениеПриИзмененииДокументаОснования Тогда
				СписокИсключаемыхРеквизитов = "Дата,Номер,ДокументОснование,Комментарий,ХозОперация,ДатаСоздания,ДатаОперации,БлокироватьПерерасчетСкидок";
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого РеквизитШапки Из МетаданныеОснования.Реквизиты Цикл
			Попытка
				// Исключим реквизиты которые не копируются.
				Если Найти(ВРЕГ(СписокИсключаемыхРеквизитов),ВРЕГ(РеквизитШапки.Имя)) > 0 Тогда Продолжить; КонецЕсли;
				ЭтотОбъект[РеквизитШапки.Имя] = Основание[РеквизитШапки.Имя];
			Исключение
			КонецПопытки;
		КонецЦикла;
		
		ЕстьПроектВДокументе = МетаданныеДокумента.Реквизиты.Найти("Проект") <> Неопределено;
		ЕстьДоговорВДокументе = ЭтотОбъект.Метаданные().Реквизиты.Найти("ДоговорВзаиморасчетов") <> Неопределено;
		ОсновнойПроектДоговора = ?(ЕстьДоговорВДокументе,ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект,Справочники.Проекты.ПустаяСсылка());
		
		// проверим корректность проекта документа основания для создаваемого документа
		Если МетаданныеОснования.Реквизиты.Найти("Проект") <> Неопределено И ЕстьПроектВДокументе И ЕстьДоговорВДокументе Тогда
			Если ЗначениеЗаполнено(Основание.Проект) Тогда
				Если Основание.Проект <> ОсновнойПроектДоговора Тогда
					КонтрольПроектов = обПраво("КонтролироватьСоответствиеПроектов", ПраваПользователя,,ЭтотОбъект);
					
					//сформируем строку - представление проекта для вывода в сообщении
					Если ОсновнойПроектДоговора = Справочники.Проекты.ПустаяСсылка() Тогда
						ПредставлениеПроектаДоговора = "пустой";
					Иначе	
						ПредставлениеПроектаДоговора = СокрЛП(ОсновнойПроектДоговора);
					КонецЕсли;
					
					Если Основание.Проект = Справочники.Проекты.ПустаяСсылка() Тогда
						ПредставлениеПроектаДокумента = "пустой";
					Иначе	
						ПредставлениеПроектаДокумента = СокрЛП(Основание.Проект);
					КонецЕсли;
					
					Если КонтрольПроектов = Перечисления.ВидыКонтроля.НеКонтролировать Тогда
						ЭтотОбъект.Проект = Основание.Проект;
					ИначеЕсли КонтрольПроектов = Перечисления.ВидыКонтроля.Предупреждать Тогда
						#Если Клиент Тогда
							Сообщить("Проект < " + ПредставлениеПроектаДоговора + " > договора < " + СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов) + " > отличается от проекта < " + ПредставлениеПроектаДокумента + " > документа основания!");
						#КонецЕсли
						ЭтотОбъект.Проект = Основание.Проект; 
					ИначеЕсли КонтрольПроектов = Перечисления.ВидыКонтроля.Запрещать Тогда
						#Если Клиент Тогда
							Сообщить("Проект < " + ПредставлениеПроектаДоговора + " > договора < " + СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов) + " > отличается от проекта < " + ПредставлениеПроектаДокумента + " > документа основания!");
						#КонецЕсли
						ЭтотОбъект.Проект = ОсновнойПроектДоговора; 
					КонецЕсли;
				Иначе
					ЭтотОбъект.Проект = Основание.Проект;
				КонецЕсли;	
			Иначе
				ЭтотОбъект.Проект = ОсновнойПроектДоговора;
			КонецЕсли;	
		ИначеЕсли ЕстьПроектВДокументе Тогда
			ЭтотОбъект.Проект = ?(ЗначениеЗаполнено(ОсновнойПроектДоговора),ОсновнойПроектДоговора,обПраво("ОсновнойПроект",ЭтотОбъект.Права,,ЭтотОбъект));
		КонецЕсли;
		
		//скорректируем хозоперацию
		СписокХозОпераций = ЭтотОбъект.ПолучитьСписокХозОпераций();
		Для Каждого ХО Из СписокХозОпераций Цикл
			Если Найти(ХО.Значение,"Розницу") > 0 Тогда
				Попытка 
					ЭтотОбъект.ХозОперация = Справочники.ХозОперации[ХО.Значение];
				Исключение
				КонецПопытки;
				Прервать;
			КонецЕсли;
		КонецЦикла;		
		// пройдемся по табличным частям документов
		ТЧДокумента = ЭтотОбъект.Метаданные().ТабличныеЧасти;
		Для Каждого ТЧ Из ТЧДокумента Цикл
			//Очистим все ТЧ документа
			ЭтотОбъект[ТЧ.Имя].Очистить();
		КонецЦикла;
		
		Если ЗаполнятьТабличныеЧасти Тогда
			Для Каждого ТЧОснования Из МетаданныеОснования.ТабличныеЧасти Цикл
				Если ТЧДокумента.Найти(ТЧОснования.Имя) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				// идем по строкам и реквизитам табличной части и заполняем соответствующие
				Для Каждого СтрокаТЧОснования Из Основание[ТЧОснования.Имя] Цикл
					НоваяСтрока = ЭтотОбъект[ТЧОснования.Имя].Добавить();
					Для Каждого РеквизитТЧ Из ТЧОснования.Реквизиты Цикл
						Попытка 
							НоваяСтрока[РеквизитТЧ.Имя] = СтрокаТЧОснования[РеквизитТЧ.Имя];
						Исключение
						КонецПопытки;
					КонецЦикла;
					// в строке создаваемого документа может быть базовое количество, а при простом копировании оно не заполняется
					Попытка
						НоваяСтрока.КоличествоБазовое = СтрокаТЧОснования.КоличествоБазовое;
					Исключение
						// возможно нет базового количества в документе основания, тогда попытаемся рассчитать его
						Попытка НоваяСтрока.КоличествоБазовое = НоваяСтрока.Количество*НоваяСтрока.Коэффициент; Исключение КонецПопытки;
					КонецПопытки;
					// для документа ордерной инвентаризации
					Попытка 
						НоваяСтрока.КоличествоФакт = СтрокаТЧОснования.КоличествоУчет;
					Исключение
					КонецПопытки;
					// Признак предмета расчета для чеков
					Попытка
						НоваяСтрока.ПризнакПредметаРасчета = НоваяСтрока.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета;
					Исключение
					КонецПопытки;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		//фрагмент для прочих активов
		стрТипОснования = МетаданныеОснования.Имя;
		Если стрТипОснования = "ВводВЭксплуатацию" Тогда
			Если ЭтотОбъект.Метаданные().Имя <> "РасходныйСкладскойОрдер" Тогда
				Если ЭтотОбъект.Метаданные().Имя <> "ОбслуживаниеАктива" и ЗаполнятьТабличныеЧасти Тогда
					// идем по строкам и реквизитам табличной части и заполняем соответствующие
					Попытка
						ТЧАктивы = ЭтотОбъект["Активы"]; // Активов может и не быть
						Для Каждого СтрокаТЧОснования Из Основание["Товары"] Цикл
							НоваяСтрока = ТЧАктивы.Добавить();
							Для Каждого РеквизитТЧ Из ТЧОснования.Реквизиты Цикл
								ИмяРеквизита_ = ?(РеквизитТЧ.Имя = "Актив", "ПрочийАктив", РеквизитТЧ.Имя);
								Попытка 
									НоваяСтрока[ИмяРеквизита_] = СтрокаТЧОснования[РеквизитТЧ.Имя];
								Исключение
								КонецПопытки;
							КонецЦикла;
						КонецЦикла;
					Исключение КонецПопытки;
				КонецЕсли;
				Попытка
					ЭтотОбъект.ПодразделениеКомпании = Основание.ПодразделениеПолучатель;
					ЭтотОбъект.Организация = ЭтотОбъект.ПодразделениеКомпании.Организация;
				Исключение
				КонецПопытки;
				Если ЭтотОбъект.Метаданные().Имя = "ПеремещениеАктивов" Тогда
					ЭтотОбъект.ПодразделениеПолучатель = Справочники.ПодразделенияКомпании.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли стрТипОснования = "ВводВЭксплуатациюАвтомобилей" Тогда
			Если (ЭтотОбъект.Метаданные().Имя = "СписаниеАктивов" ИЛИ ЭтотОбъект.Метаданные().Имя = "ПеремещениеАктивов") и ЗаполнятьТабличныеЧасти Тогда
				// идем по строкам и реквизитам табличной части и заполняем соответствующие
				ТЧАктивы = ЭтотОбъект["Активы"]; 
				Для Каждого СтрокаТЧОснования Из Основание["Автомобили"] Цикл
					Если ТЧАктивы.Найти(СтрокаТЧОснования.Актив,"ПрочийАктив") =  Неопределено Тогда
						НоваяСтрока = ТЧАктивы.Добавить();
						Для Каждого РеквизитТЧ Из ТЧОснования.Реквизиты Цикл
							ИмяРеквизита_ = ?(РеквизитТЧ.Имя = "Актив", "ПрочийАктив", РеквизитТЧ.Имя);
							Попытка 
								НоваяСтрока[ИмяРеквизита_] = СтрокаТЧОснования[РеквизитТЧ.Имя];
							Исключение
							КонецПопытки;
						КонецЦикла;
						НоваяСтрока.Количество = 1;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Попытка
				Если ЭтотОбъект.Метаданные().Имя = "СписаниеАктивов" Тогда
					ЭтотОбъект.ПодразделениеКомпании = Основание.ПодразделениеПолучатель;
					ЭтотОбъект.Организация = ЭтотОбъект.ПодразделениеКомпании.Организация;
				ИначеЕсли ЭтотОбъект.Метаданные().Имя = "ПеремещениеАктивов" Тогда
					ЭтотОбъект.ПодразделениеКомпании   = Основание.ПодразделениеПолучатель;
					ЭтотОбъект.ПодразделениеПолучатель = Справочники.ПодразделенияКомпании.ПустаяСсылка();
					ЭтотОбъект.Организация             = ЭтотОбъект.ПодразделениеКомпании.Организация;
				КонецЕсли;
			Исключение
			КонецПопытки;
		ИначеЕсли стрТипОснования = "ПеремещениеАктивов" Тогда
			Попытка
				ЭтотОбъект.ПодразделениеКомпании = Основание.ПодразделениеПолучатель;
				ЭтотОбъект.Организация = ЭтотОбъект.ПодразделениеКомпании.Организация;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// посчитаем общую сумму по таблице товаров
		Попытка
			ЭтотОбъект.СуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
		Исключение	
			Попытка 
				ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Товары.Итог("СуммаВсего");
			Исключение
			КонецПопытки;
		КонецПопытки;
		// заполним документ-основание
		Попытка
			ЭтотОбъект.ДокументОснование = Основание;
		Исключение
		КонецПопытки;
		
		// заполним курс валюты взаиморасчетов документа
		Если (ЭтотОбъект.Метаданные().Реквизиты.Найти("КурсВалютыВзаиморасчетов") <> Неопределено) Тогда
			Попытка
				Если ЭтотОбъект.Метаданные().Реквизиты.Найти("ДоговорВзаиморасчетов") <> Неопределено Тогда
					ЭтотОбъектДоговорВзаиморасчетов = ЭтотОбъект.ДоговорВзаиморасчетов;
				Иначе
					ЭтотОбъектДоговорВзаиморасчетов = Неопределено;
				КонецЕсли;
				ЭтотОбъект.КурсВалютыВзаиморасчетов = дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект,ЭтотОбъектДоговорВзаиморасчетов,Основание);
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Попытка 
		Если обЗначениеНеЗаполнено(ЭтотОбъект.Менеджер) Тогда
			ЭтотОбъект.Менеджер = ЭтотОбъект.Автор.Сотрудник; 
		КонецЕсли; 	
	Исключение КонецПопытки;
	
	// установим номер новому документу, если это необходимо сделать перед открытием формы 			
	РедактированиеНомеров = обПраво("РазрешитьРедактированиеНомеровДокументов",ПраваПользователя,,ЭтотОбъект);
	Если (ЭтотОбъект.ЭтоНовый()) И (НЕ Копирование) И РедактированиеНомеров = Перечисления.ВариантыОтветов.Да Тогда
		ЭтотОбъект.УстановитьНовыйНомер();
	КонецЕсли;
	
КонецПроцедуры // дкОбработкаЗаполненияПоУмолчанию()

// Общий обработчик события ОбработкаЗаполнения документа 
// Совмещен с заполнением реквизитов по умолчанию для новых документов
//
// Параметры:
// ЭтотОбъект - ДокументОбъект - документ, для которого производится действие
// Основание - ДокументСсылка - ссылка на документ-основание
// Копирование – булево, признак того что документ скопирован
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкОбработкаЗаполнения(ЭтотОбъект,Основание = Неопределено,Копирование = Ложь,ЗаполнятьТабличныеЧасти = Истина) Экспорт
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// взведем флаг блокировки перерасчета скидок
	Если НЕ обЗначениеНеЗаполнено(Основание) Тогда
		Попытка   
			
			//Misha//bizteh
			//Если Основание.Метаданные().Реквизиты.Найти("СкидкаНаценка") <> Неопределено Тогда
			Если Основание.Метаданные().Реквизиты.Найти("СкидкаНаценка") <> Неопределено И ТипЗнч(ЭтотОбъект.Ссылка) <> Тип("ДокументСсылка.РеализацияАвтомобилей") И ТипЗнч(ЭтотОбъект.ДокументОснование) <> Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			//Misha
				
				Попытка
					ЭтотОбъект.БлокироватьПерерасчетСкидок = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	//получим свойства документа основания
	Попытка
		Если Основание <> Неопределено И НЕ Копирование Тогда
			СвойстваИЗначенияОснования = Обработки.ЗначенияСвойствОбъекта.Создать();
			СвойстваИЗначенияОснования.ОбъектОтбораЗначений = Основание;
			СвойстваИЗначенияОснования.ПрочитатьЗаполнитьСвойстваИЗначения();
			
			ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов = Обработки.ЗначенияСвойствОбъекта.Создать();
			ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений = ЭтотОбъект.Ссылка;
			ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ПрочитатьЗаполнитьСвойстваИЗначения();
			Для каждого ТекСтрока Из ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.СвойстваИЗначения Цикл
				НайденнаяСтрока = СвойстваИЗначенияОснования.СвойстваИЗначения.Найти(ТекСтрока.Свойство,"Свойство");
				Если НайденнаяСтрока <> Неопределено Тогда
					ТекСтрока.Уникальность = НайденнаяСтрока.Уникальность;
					ТекСтрока.Значение = НайденнаяСтрока.Значение;
					ТекСтрока.Активность = НайденнаяСтрока.Активность;
				КонецЕсли;
			КонецЦикла;
			Попытка 
				ЭтотОбъект.ЗаполнитьСвойстваНаОсновании(Основание);
			Исключение
			КонецПопытки;
		КонецЕсли;
	Исключение 
	КонецПопытки;
	
	// может быть отраслевое переопределение функции модуля...
	Результат = орОбработкаЗаполнения(ЭтотОбъект, Основание, Копирование);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	//Если надо, то вызовем обработчик заполнения по умолчанию
	дкОбработкаЗаполненияПоУмолчанию(ЭтотОбъект,Основание,Копирование,ЗаполнятьТабличныеЧасти);
	
	// проверим ввод на основании контрагента
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Контрагенты") И НЕ Основание.ЭтоГруппа Тогда
		Попытка
			ЭтотОбъект.Контрагент = Основание;
			ЭтотОбъект.ОбработкаРеквизита("Контрагент");
		Исключение
		КонецПопытки;
		
		// производим необходимые действия для в документых
		дкДокументыНаОснованииКонтрагентов(ЭтотОбъект,Основание,Результат);
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Контрагенты") И Основание.ЭтоГруппа Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // дкОбработкаЗаполнения()

// Заполнение документов на основании контрагентов
Процедура дкДокументыНаОснованииКонтрагентов(ЭтотОбъект,Основание,Результат) Экспорт
	Если (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ЗаказНаряд")) ИЛИ (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ЗаявкаНаРемонт")) Тогда
		//Результат = Ложь;
		//ЭтотОбъект.Заказчик = Основание;
		//ЭтотОбъект.ОбработкаРеквизита("Заказчик");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ИзменениеЦен")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенКонтрагента;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ИзменениеЦенАвторабот")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенАвтоработКонтрагента;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.Инвентаризация")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.Переоценка")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПереоценкаТоваровПринятыхНаКомиссию;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.Событие")) Тогда
		Результат = Истина;
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.СписаниеАвтомобилей")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.СписаниеАвтомобилейОтданныхНаКомиссию;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.СписаниеТоваров")) Тогда
		Результат = Ложь;
		ЭтотОбъект.ХозОперация = Справочники.ХозОперации.СписаниеТоваровОтданныхНаКомиссию;
		ЭтотОбъект.ОбработкаРеквизита("ХозОперация");
	ИначеЕсли (ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ТестДрайв")) Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
КонецПроцедуры

// Общий обработчик события ПередЗаписью документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект - документ, для которого производится действие
// Отказ 		- булево, признак отказа от копирования
// Маска 		- разрешение проверки прав
// 1 - проверять / 0 - не проверять
// биты:
// 1 - Проверка периода редактирования 
// 2 - Запись раньше документа основания
// 3 - Редактирование проведенных документов
// 4 - Редактирование при наличие подчиненных
// 5 - Управление проведением
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, ДопРеквизиты = Неопределено,Заполнение = Истина,Уникальность = Истина,Маска = "11111") Экспорт
	
	// SUIG + необходимо запомнить РежимЗаписи документа
	// чтобы при записи не регистрировать движения для уже проведенного и повторно записываемого документа
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи",РежимЗаписи);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ВыведеныСообщенияОбОшибке",Ложь);
	// SUIG-
	
	// обрежем криптохвосты
	Попытка
		ОбъектШК = Обработки.ШтрихКоды.Создать();
		Для Каждого Строка Из ЭтотОбъект.КодыМаркировки Цикл
			ОбъектШК.РазобратьСтрокуШтрихкодаGS1(Строка.КодМаркировки, Истина);
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	Попытка
		// Для редких случаев, когда ЭтотОбъект неопределен
		// проверку на режим обмена данными делаем через попытку
		Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
			// если текущий режим Загрузка, то производим минимум проверок
			// т.к. все проверки были произведены в ИБ источнике
			Возврат Ложь;
		Иначе
			Загрузка = неопределено;
			ЭтотОбъект.ДополнительныеСвойства.Свойство("Загрузка",Загрузка);
			Загрузка = ?(Загрузка = Неопределено,Ложь,Загрузка);
			Если Загрузка Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Результат = орПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, ДопРеквизиты, Заполнение, Уникальность, Маска);
		Если Результат <> Неопределено Тогда
			Возврат Результат;
		Иначе
			Результат = Истина;
		КонецЕсли;
		Если Отказ Тогда
			Возврат Результат;
		КонецЕсли; 
		
		// посмотрим не блокируется ли документ при обмене
		Если орБлокироватьДокументПриОбмене(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения) = Истина Тогда
			Отказ = Истина; Возврат Результат;
		КонецЕсли;
		
		Ошибки = ""; ТекущееВремя = ТекущаяДата();
		
		// Выполним проверки прав доступа к документу
		Если обПраво("ПроверкаДоступаКСправочникамИДокументам",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
			// Проверка на допустимость редактирования документа по текущему пользователю
			дкПроверкаПраваДоступа(ЭтотОбъект, Отказ,, ЭтотОбъект.Права);
		КонецЕсли;
		
		// Проверка на допустимость редактирования по датам запрета и разрешенного интервала редактирования
		Если Булево(Число(Сред(Маска,1,1))) Тогда
			Попытка	// Получим дату запрета редактирования для организации указанной в документе
				Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Организация) Тогда 
					Организация = ЭтотОбъект.Организация;	
				КонецЕсли; 
			Исключение 
			КонецПопытки;
			// если не получилось определить организацию документа то получим ее из настроек пользователя
			Если Организация = НЕОПРЕДЕЛЕНО Тогда
				Организация = ПараметрыСеанса.Организация;
			КонецЕсли;
			ДатаЗапретаРедактирования = КонецДня(орПолучитьДатуЗапретаРедактирования(ЭтотОбъект));
			Если ТипЗнч(ЭтотОбъект)=Тип("ДокументСсылка.ЗаказНаряд") ИЛИ ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
				Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ДатаЗакрытия) И ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия) Тогда
					ЭтотОбъектДата = Мин(ЭтотОбъект.Ссылка.ДатаЗакрытия, ЭтотОбъект.ДатаЗакрытия);
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ДатаЗакрытия) Тогда
					ЭтотОбъектДата = ЭтотОбъект.Ссылка.ДатаЗакрытия;
				ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект.ДатаЗакрытия) Тогда
					ЭтотОбъектДата = ЭтотОбъект.ДатаЗакрытия;
				Иначе
					ЭтотОбъектДата=ЭтотОбъект.Дата;
				КонецЕсли; 
			Иначе
				ЭтотОбъектДата=ЭтотОбъект.Дата;
			КонецЕсли; 
			Если (ЭтотОбъектДата <= ДатаЗапретаРедактирования) И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ ЭтотОбъект.Проведен) Тогда
				//бизтех++
				//БИЗТЕХ КОВАЛЬ А.Д.
				//Список ДокументСcылка и ДокументОбъект для исключения из закрытого периода 
				// Также надо добавить исключение в право "Редактирование документов в закрытом периоде" на шаблон пользователя
				БТ_Исключения = новый СписокЗначений;
				БТ_Исключения.Добавить(ТИП("ДокументСсылка.РабочийЛистОтделаСтрахования"));
				БТ_Исключения.Добавить(ТИП("ДокументОбъект.РабочийЛистОтделаСтрахования"));
				БТ_Исключения.Добавить(ТИП("ДокументСсылка.ЗаказНаАвтомобиль"));
				БТ_Исключения.Добавить(ТИП("ДокументОбъект.ЗаказНаАвтомобиль"));
				БТ_Исключения.Добавить(ТИП("ДокументСсылка.ЗаявкаНаРемонт"));
				БТ_Исключения.Добавить(ТИП("ДокументОбъект.ЗаявкаНаРемонт"));
				
				Если БТ_Исключения.НайтиПоЗначению(ТипЗнч(ЭтотОбъект)) = Неопределено Тогда //Bizteh 20.01.2023
					Отказ = Истина;
					дкДобавитьОшибку(Ошибки,"Дата документа находится в закрытом периоде. Для организации < " + СокрЛП(Организация) + " > дата запрета редактирования " + Формат(ДатаЗапретаРедактирования,"ДФ = ""дд.ММ.гггг"""));
				КонецЕсли; 
				//бизтех--
			Иначе
				СтруктураИнтервалаЗапрета = орПолучитьИнтервалЗапретаРедактирования(ЭтотОбъект, ТекущееВремя);
				Если ((ЭтотОбъектДата > СтруктураИнтервалаЗапрета.ВерхГраница) ИЛИ (ЭтотОбъектДата < СтруктураИнтервалаЗапрета.НижнГраница)) И (РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ ЭтотОбъект.Проведен) Тогда
					Отказ = Истина; 
					дкДобавитьОшибку(Ошибки,"Дата документа находится за пределами разрешенного интервала редактирования.");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// отработаем право "Проведение раньше документа-основания"
		Если Булево(Число(Сред(Маска,2,1))) Тогда
			Если (ЭтотОбъект.Метаданные().Реквизиты.Найти("ДокументОснование") = НЕОПРЕДЕЛЕНО)
				ИЛИ(обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование)) // нет документа основания - нечего проверять
				ИЛИ(РежимЗаписи <> РежимЗаписиДокумента.Проведение)  // проверять будем только, если документ проводится.
				ИЛИ(РежимПроведения = РежимПроведенияДокумента.Оперативный) Тогда
				// или режим проведения оперативный а значит документ будет записан на конец дня
			ИначеЕсли (ЭтотОбъект.Дата < ЭтотОбъект.ДокументОснование.Дата) Тогда
				Если обПраво("ЗаписьРаньшеДокументаОснования",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
					Если обПраво("ВыводитьСообщенияПроверкиПравДоступа",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
						Сообщить("Внимание! Документ < " + Строка(ЭтотОбъект) + " > проводится раньше своего документа-основания: < " + Строка(ЭтотОбъект.ДокументОснование) + " > ",СтатусСообщения.Внимание);
					КонецЕсли;
				Иначе
					Отказ = Истина;
					дкДобавитьОшибку(Ошибки,"Нет прав на проведение документа раньше, чем документ-основание: < " + Строка(ЭтотОбъект.ДокументОснование) + " > ");
				КонецЕсли;
				// +Софтфон
				Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.Событие") И ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
					// игнорируем настройку, т.к. разрешаем записать всегда
					Отказ = Ложь;
				КонецЕсли;
				// -Софтфон
			КонецЕсли;
		КонецЕсли;
		
		// можно ли изменять уже проведенные документы
		Если (Булево(Число(Сред(Маска,3,1)))) И (ЭтотОбъект.Проведен) Тогда
			ГрупповаяОбработкаДокументов=Ложь;
			Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов",ГрупповаяОбработкаДокументов) Тогда
				ГрупповаяОбработкаДокументов=Ложь;
			КонецЕсли;
			Если ГрупповаяОбработкаДокументов=Ложь Тогда
				Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаказНаряд") 
					И ЭтотОбъект.Ссылка.Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
					//Для незакрытых заказ-нарядов проверка не требуется 
					
					//30.03.22 bizteh++	
				ИначеЕсли ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЭМ_КумулятивнаяМаржа") Тогда
					//для документов ЭМ_КумулятивнаяМаржа проверка не требуется    
					//30.03.22 bizteh-- 
					//БизТех 25.04.2023 ЗаказНаАвто можно редактировать <<
				ИначеЕсли ТипЗНЧ(ЭтотОбъект) = Тип("ДокументОбъект.ЗаказНаАвтомобиль") Тогда
					// >>
					
				Иначе
					Если НЕ обПраво("РедактированиеПроведенныхДокументов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
						Отказ = Истина;
						дкДобавитьОшибку(Ошибки,"Нет прав изменять проведенные документы.");
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		// проверим на право проведения не текущей датой и корректность заполнения реквизитов
		Если (Булево(Число(Сред(Маска,5,1)))) И (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
			ГрупповаяОбработкаДокументов=Ложь;
			Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов",ГрупповаяОбработкаДокументов) Тогда
				ГрупповаяОбработкаДокументов=Ложь;
			КонецЕсли;
			Если ГрупповаяОбработкаДокументов=Ложь Тогда
				Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаказНаряд") 
					 И ЭтотОбъект.Состояние<>Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
					 //Для незакрытых заказ-нарядов проверка не требуется        
				ИначеЕсли не ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаявкаНаРасходДС") тогда //Иначе   //ЧалапАЮ Бизтех 24.01.2024
					Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
						ЭтотОбъектДата=ЭтотОбъект.ДатаЗакрытия;
					Иначе
						ЭтотОбъектДата=ЭтотОбъект.Дата;
					КонецЕсли;
					Если (НачалоДня(ЭтотОбъектДата) < НачалоДня(ТекущееВремя))
						И НЕ обПраво("ПроведениеЗаднимЧислом",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
						Отказ = Истина;
						дкДобавитьОшибку(Ошибки,"Нет прав на проведенные документов задним числом.");
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		// проверки на "авторство", наличие в константах и подчиненных документов
		Если НЕ ЭтотОбъект.ЭтоНовый() Тогда // для новых не нужно даже проверять ничего из перечисленного ниже
			
			// указан ли в константах ?
			Если обПраво("РедактированиеОбъектовЗначенийКонстант",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
				// этому пользователю все равно можно так что незачем в константах смотреть
			Иначе
				ИмяКонстанты = "";
				Если обОбъектУказанВКонстантах(ЭтотОбъект,ИмяКонстанты) Тогда
					Отказ = Истина;
					дкДобавитьОшибку(Ошибки,"Нет прав на изменение документа указанного в значении константы < " + ИмяКонстанты + " > ");
				КонецЕсли;
			КонецЕсли;
			
			// Проверим на наличие подчиненных документов
			Если (Булево(Число(Сред(Маска,4,1)))) И (обПраво("РедактированиеДокументовПриНаличииПодчиненных",ЭтотОбъект.Права,,ЭтотОбъект)) Тогда
				// этому пользователю все равно можно редактировать и незачем проверять есть ли подчиненные
			ИначеЕсли НЕ ЭтотОбъект.Ссылка.Пустая() Тогда
				// найдем есть ли подчиненные документы
				МассивСсылок = КритерииОтбора.ПодчиненныеДокументы.Найти(ЭтотОбъект.Ссылка);
				Если МассивСсылок.Количество() > 0 Тогда
					Отказ = Истина;
					дкДобавитьОшибку(Ошибки,"Нет прав на изменение документа имеющего подчиненные. Список подчиненных:");
					Для Каждого ПодчДокумента ИЗ МассивСсылок Цикл
						дкДобавитьОшибку(Ошибки,"-" + Строка(ПодчДокумента));
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	// НЕ ЭтотОбъект.ЭтоНовый()
		
		// Проверка куратора контрагента
		Если НЕ обПраво("ВводДокументовДляВсехКонтрагентов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
			Попытка	// не у всех документов есть контрагент
				Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Контрагент) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					|	Кураторы.Контрагент,
					|	Кураторы.Куратор
					|ИЗ
					|	РегистрСведений.Кураторы КАК Кураторы
					|ГДЕ
					|	Кураторы.Контрагент = &Контрагент
					|	И Кураторы.Куратор = &Куратор";
					Запрос.УстановитьПараметр("Контрагент",ЭтотОбъект.Контрагент);
					Запрос.УстановитьПараметр("Куратор",ПараметрыСеанса.Пользователь.Сотрудник);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Количество() = 0 Тогда
						Отказ = Истина;
						дкДобавитьОшибку(Ошибки,"Нет прав ввод документов контрагента < " + СокрЛП(ЭтотОбъект.Контрагент) + " > ");
					КонецЕсли; 
				КонецЕсли; 
			Исключение
			КонецПопытки; 
		КонецЕсли; 
		
		// Заполним по умолчанию итоговую сумму
		Попытка 	
			ЭтотОбъект.СуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
		Исключение
			Попытка 
				ЭтотОбъект.СуммаДокумента = ЭтотОбъект.Товары.Итог("СуммаВсего");
			Исключение
			КонецПопытки;
		КонецПопытки;
		
		// Выполним проверку права на утверждение (если используется подсистема утверждения)
		// и запретим проведение, если документ еще не проведен.
		ВидДокумента = ЭтотОбъект.Метаданные().Имя;
		Если дкПроверитьИспользованиеУтверждения(ВидДокумента,ЭтотОбъект.Права) Тогда
			СтатусДокумента = дкПолучитьСтатусДокумента(ЭтотОбъект.Ссылка);
			// получаем соответствие действий над объектов из общего кэша прав
			ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента,ЭтотОбъект.Права);
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				Если НЕ ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден] Тогда
					Отказ = Истина; 
					дкДобавитьОшибку(Ошибки,"Нет прав на утверждение документов вида " + СокрЛП(ЭтотОбъект.Метаданные().Синоним) + ".");
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		// если документ не проводится то проверять корректность реквизитов может и не нужно (есть такое право)
		Если ТипЗнч(ЭтотОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ ЭтотОбъект.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Выполнен ИЛИ НЕ обПраво("КонтролироватьЗаполнениеТолькоПриПроведении",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
				Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
					Если НЕ ЭтотОбъект.ПроверитьКорректность(Ошибки,ДопРеквизиты,Заполнение,Уникальность) Тогда
						Отказ = Истина; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение ИЛИ
				НЕ обПраво("КонтролироватьЗаполнениеТолькоПриПроведении",ЭтотОбъект.Права,,ЭтотОбъект) ИЛИ
				ЭтотОбъект.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
				Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
					Если НЕ ЭтотОбъект.ПроверитьКорректность(Ошибки,ДопРеквизиты,Заполнение,Уникальность) Тогда
						Отказ = Истина; 
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		// заполнение дат документа, для ЗН исключение
		Если НЕ ЭтотОбъект.ОбменДанными.Загрузка Тогда
			Если ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ЗаказНаряд") Тогда
				Попытка
					// дата создания документа
					Если ЭтотОбъект.ЭтоНовый() Тогда
						ЭтотОбъект.ДатаСоздания = ТекущаяДата();
					КонецЕсли;
					
					// дата операции
					Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
						ЭтотОбъект.ДатаОперации = ТекущаяДата();
					ИначеЕсли НЕ (ЭтотОбъект.Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
						ЭтотОбъект.ДатаОперации = Дата("00010101");
					КонецЕсли;
				Исключение
					// Упало? Ну и ладно.
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		// проверим документ на утверждение
		ТекПрава = ЭтотОбъект.Права;
		ВидДокумента = ЭтотОбъект.Метаданные().Имя;
		
		Если обПраво(ПланыВидовХарактеристик.ПраваИНастройки.ИспользоватьУтверждениеДокументов, ТекПрава) И (обПраво("Значения Утверждение " + ВидДокумента,ТекПрава) <> Неопределено) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СостоянияДокументовСрезПоследних.СтатусДокумента
			|ИЗ
			|	РегистрСведений.СостоянияДокументов.СрезПоследних(, Регистратор = &Регистратор) КАК СостоянияДокументовСрезПоследних";
			
			Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Если Выборка.СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен ИЛИ Выборка.СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
					Отказ = Истина;
					дкДобавитьОшибку(Ошибки, "Перепроведение или отмена проведения запрещена для утвержденных и отклоненных документов.");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			// Выведем все накопившиеся ошибки 
			Попытка
				СообщениеОбОшибке = ЭтотОбъект.СообщениеОбОшибке; 				
				Если ТипЗнч(СообщениеОбОшибке) <> Тип("Строка") Тогда
					СообщениеОбОшибке = Неопределено;
				КонецЕсли; 
			Исключение
				СообщениеОбОшибке = Неопределено;
			КонецПопытки; 
			Если СообщениеОбОшибке = Неопределено Тогда
				Сообщить("При записи < " + СокрЛП(ЭтотОбъект) + " > обнаружены ошибки :",СтатусСообщения.Внимание);
				Сообщить(Ошибки,СтатусСообщения.БезСтатуса);
				Сообщить("Из-за возникших ошибок операция записи была отменена.",СтатусСообщения.Важное); 
			Иначе
				Если НЕ ПустаяСтрока(СокрЛП(СообщениеОбОшибке)) Тогда
					СообщениеОбОшибке = СообщениеОбОшибке + "
					|";
				КонецЕсли; 
				СообщениеОбОшибке = СообщениеОбОшибке + Ошибки;
				ЭтотОбъект.СообщениеОбОшибке = СообщениеОбОшибке; 
			КонецЕсли; 
			Попытка
				ЭтотОбъект.ДополнительныеСвойства.ВыведеныСообщенияОбОшибке=Истина;
			Исключение
				ЭтотОбъект.ДополнительныеСвойства.Вставить("ВыведеныСообщенияОбОшибке",Истина);
			КонецПопытки;
		КонецЕсли;
	Исключение 
		//ТекстОшибки = ИнформацияОбОшибке().Описание;
		//СтрСообщения = ТекстОшибки + Символы.ВК + "(Имя модуля: " + ИнформацияОбОшибке().ИмяМодуля + ", " + Символы.ВК
		// + "номер строки: " + ИнформацияОбОшибке().НомерСтроки + ")"; 
		СтатусСобытия = Перечисления.СтатусыСобытийСистемногоПротокола.Ошибка;
		//#Если Клиент Тогда
		//	Сообщить(ТекстОшибки,СтатусСообщения.Важное);
		//#КонецЕсли 
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;  	
КонецФункции // дкПередЗаписью()

// Общий обработчик события ПриЗаписи документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, документ, для которого производится действие
// Отказ	 – булево, признак отказа от действия
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкПриЗаписи(ЭтотОбъект, Отказ) Экспорт
	
	Результат = Истина;
	Загрузка = ЭтотОбъект.ОбменДанными.Загрузка;
	дкРегистрацияИзмененийДокументов(ЭтотОбъект);
	
	Если Загрузка Тогда
		Результат = Ложь;
	Иначе
		Попытка //Если есть свойства документа, пронаследованные от основания или при копировании, запишем
			Если ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов <> Неопределено Тогда
				ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ОбъектОтбораЗначений = ЭтотОбъект.Ссылка;
				ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов.ЗаписатьВсеЗначенияСвойств();
				ЭтотОбъект.ОбработкаЗначенияСвойствОбъектов = Неопределено;
			КонецЕсли;
		Исключение 
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции // дкПриЗаписи()

// Общий обработчик события ПередУдалением документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, документ, для которого производится действие
// Отказ	 – булево, признак отказа от действия
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкПередУдалением(ЭтотОбъект, Отказ) Экспорт
	
	Результат = Истина;
	
	Попытка
		// Для редких случаев, когда ЭтотОбъект неопределен
		// проверку на режим обмена данными делаем через попытку
		Загрузка = ЭтотОбъект.ОбменДанными.Загрузка;
		Если Загрузка Тогда
			// если текущий режим Загрузка, то производим минимум проверок
			// т.к. все проверки были произведены в ИБ источнике
			Возврат Ложь;
		КонецЕсли;
		ДопЗагрузка = Неопределено;
		Если НЕ Загрузка Тогда
			ЭтотОбъект.ДополнительныеСвойства.Свойство("Загрузка",ДопЗагрузка);
			Загрузка = ?(НЕ ДопЗагрузка = Неопределено,ДопЗагрузка,Загрузка); 
		КонецЕсли;
		Если Загрузка Тогда
			Возврат Ложь;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Если обПраво("ПроверкаДоступаКСправочникамИДокументам", ЭтотОбъект.Права,,ЭтотОбъект) Тогда	
		// Проверка на допустимость редактирования документа по текущему пользователю
		дкПроверкаПраваДоступа(ЭтотОбъект, Отказ,, ЭтотОбъект.Права);
	КонецЕсли;	
	
	// если документ проведен, то попробуем вычистить его из границ последовательностей
	Если ЭтотОбъект.Проведен Тогда
		Если ЭтотОбъект.Движения.Найти("ПартииТоваровКомпании") <> Неопределено Тогда
			НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
			НаборЗаписейГраницыПартий.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ВзаиморасчетыКомпании") <> Неопределено Тогда
			НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
			НаборЗаписейГраницыВзаиморасчетов.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ЗаказыПокупателей") <> Неопределено ИЛИ
			ЭтотОбъект.Движения.Найти("ЗаказыПоставщикам") <> Неопределено ИЛИ
			ЭтотОбъект.Движения.Найти("ЗаказыРаспределение") <> Неопределено Тогда
			НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
			НаборЗаписейГраницыЗаказы.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ОстаткиТоваровОрдерныйСклад") <> Неопределено Тогда
			НаборЗаписейГраницыОрдерныйСклад = РегистрыСведений.ГраницыОрдерныйСклад.СоздатьНаборЗаписей();
			НаборЗаписейГраницыОрдерныйСклад.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ТоварыВПроизводстве")<>Неопределено Тогда
			НаборЗаписейГраницыПроизводство = РегистрыСведений.ГраницыПроизводство.СоздатьНаборЗаписей();
			НаборЗаписейГраницыПроизводство.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ОстаткиАвтомобилей")<>Неопределено Тогда
			НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
			НаборЗаписейГраницыАвтомобили.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("КомплектацияАвтомобилей")<>Неопределено Тогда
			НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
			НаборЗаписейГраницыКомплектация.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ЗаказыАвтомобилей") <> Неопределено ИЛИ
			ЭтотОбъект.Движения.Найти("ЗаказыПоставщикамНаАвтомобили") <> Неопределено Тогда
			НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьНаборЗаписей();
			НаборЗаписейГраницыЗаказы.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
		Если ЭтотОбъект.Движения.Найти("ОстаткиАвтомобилейОрдерныйСклад") <> Неопределено Тогда
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад = РегистрыСведений.ГраницыАвтомобилиОрдерныйСклад.СоздатьНаборЗаписей();
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.УбратьСсылку(ЭтотОбъект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПланОбменаМетаданные = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("ПланОбменаМетаданные",ПланОбменаМетаданные);
		МетаданныеОбъекта = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("МетаданныеОбъекта",МетаданныеОбъекта);
		орРегистрацияИзмененийДокументов(ЭтотОбъект,Истина,,,,
		ПланОбменаМетаданные,МетаданныеОбъекта); // Регистрируем удаление объекта
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции // дкПередУдалением()

// Проверка доступности складов компании для пользователя
//
// Параметры:
// ЭтотОбъект  - ДокументОбъект - Документ, для которого осуществляется проверка доступа
//
// Возвращаемое значение:
//   Булево   - Признак доступности складов для пользователя.
//
Функция дкПроверитьДоступностьСкладовКомпании(ЭтотОбъект) Экспорт
	СкладыДоступны = Истина;
	
	Попытка
		Если ЭтотОбъект.ОтменитьПроверкуДоступностиСкладов Тогда
			Возврат СкладыДоступны;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ЭтотОбъектМетаданные = ЭтотОбъект.Метаданные();
	Если ЭтотОбъектМетаданные.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		МассивСкладовДокумента = Новый Массив;
		Для Каждого Реквизит Из ЭтотОбъектМетаданные.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(Тип("СправочникСсылка.СкладыКомпании")) Тогда
				СкладКомпании = ЭтотОбъект[Реквизит.Имя];
				Если ЗначениеЗаполнено(СкладКомпании) И ТипЗнч(СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
					МассивСкладовДокумента.Добавить(СкладКомпании);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если МассивСкладовДокумента.Количество()>0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			                    |	ЗапрещенныеСкладыКомпании.СкладКомпании КАК СкладКомпании
			                    |ИЗ
			                    |	РегистрСведений.ЗапрещенныеСкладыКомпании КАК ЗапрещенныеСкладыКомпании
			                    |ГДЕ
			                    |	ЗапрещенныеСкладыКомпании.Пользователь = &Пользователь
			                    |	И ЗапрещенныеСкладыКомпании.СкладКомпании В(&СкладыКомпании)
			                    |
			                    |УПОРЯДОЧИТЬ ПО
			                    |	СкладКомпании");
			Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.Пользователь);
			Запрос.УстановитьПараметр("СкладыКомпании",МассивСкладовДокумента);
			ВыборкаСкладов = Запрос.Выполнить().Выбрать();
			Если ВыборкаСкладов.Количество()>0 Тогда
				СкладыДоступны = Ложь;
				Пока ВыборкаСкладов.Следующий() Цикл
					дкСообщитьРезультат("Пользователю """+ПараметрыСеанса.Пользователь+""" запрещено проведение/распроведение документов со складом """+ВыборкаСкладов.СкладКомпании+""".","Важное&Права доступа:",ЭтотОбъект);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СкладыДоступны;
КонецФункции // дкПроверитьДоступностьСкладовКомпании()

// Общий обработчик события ОбработкаПроведения документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, документ, для которого производится действие
// Отказ 	 – булево, признак отказа от действия
// Режим 	 - режим проведения 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим, НеУдалятьДвижения = Ложь) Экспорт
	
	Результат = Истина;
	
	ЭтотОбъект.РезультатОбработки = "";
	#Если Клиент Тогда
		Если обПраво("ВыводитьСообщениеОбОшибкахВИнформационноеПоле",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
			ЭтотОбъект.РезультатОбработки = Обработки.ИнформационноеПоле.Создать();
			ЭтотОбъект.РезультатОбработки.Ссылка = ЭтотОбъект.Ссылка;
		КонецЕсли;
	#КонецЕсли
	
	Если (НЕ НеУдалятьДвижения) И 
		 ЭтотОбъект.Метаданные().УдалениеДвижений = Метаданные.СвойстваОбъектов.УдалениеДвижений.НеУдалятьАвтоматически Тогда
		// Проверим, есть у документа записи в регистрах:
		дкУдалениеДвиженийДокумента(ЭтотОбъект);
	КонецЕсли;
	
	ГрупповаяОбработкаДокументов=Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов",ГрупповаяОбработкаДокументов) Тогда
		ГрупповаяОбработкаДокументов=Ложь;
	КонецЕсли;
	Если ГрупповаяОбработкаДокументов=Ложь Тогда
		Если НЕ дкПроверитьДоступностьСкладовКомпании(ЭтотОбъект) Тогда
			Отказ=Истина;
			Результат = Ложь;
			дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;  	
КонецФункции // дкОбработкаПроведения()

// Общий обработчик события ОбработкаУдаленияПроведения документа 
//
// Параметры:
// ЭтотОбъект - ДокументОбъект, документ, для которого производится действие
// Отказ 	 – булево, признак отказа от действия
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Экспорт
	
	Результат = Истина;
	
	ЭтотОбъект.РезультатОбработки = "";
	#Если Клиент Тогда
		Если обПраво("ВыводитьСообщениеОбОшибкахВИнформационноеПоле",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
			ЭтотОбъект.РезультатОбработки = Обработки.ИнформационноеПоле.Создать();
			ЭтотОбъект.РезультатОбработки.Ссылка = ЭтотОбъект.Ссылка;
		КонецЕсли;
	#КонецЕсли
	
	ГрупповаяОбработкаДокументов=Ложь;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ГрупповаяОбработкаДокументов",ГрупповаяОбработкаДокументов) Тогда
		ГрупповаяОбработкаДокументов=Ложь;
	КонецЕсли;
	Если ГрупповаяОбработкаДокументов=Ложь Тогда
		Если НЕ дкПроверитьДоступностьСкладовКомпании(ЭтотОбъект) Тогда
			Отказ=Истина;
			дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Попытка
		Загрузка = одОбменДанными.ПолучитьЗагрузку(ЭтотОбъект);
		
		// при получении УдаленияОбъекта документ помечается на удаление,
		// но его движения при этом должны быть удалены в любом случае
		ЭтоУдалениеОбъекта = Неопределено;
		ЭтотОбъект.ДополнительныеСвойства.Свойство("УдалениеОбъекта", ЭтоУдалениеОбъекта);
		Если ЭтоУдалениеОбъекта = Неопределено Тогда
			ЭтоУдалениеОбъекта = Ложь;
		КонецЕсли;
		
		Если Загрузка И НЕ ЭтоУдалениеОбъекта Тогда
			Возврат Ложь;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Попытка
		МоментВремени = ЭтотОбъект.ДополнительныеСвойства.ДатаДокумента;;
	Исключение
		МоментВремени = ЭтотОбъект.Дата;
	КонецПопытки;;
	
	// двигаем границу последовательности партий
	Если ЭтотОбъект.Движения.Найти("ПартииТоваровКомпании") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыПартий = РегистрыСведений.ГраницыПартий.СоздатьНаборЗаписей();
			НаборЗаписейГраницыПартий.СкладКомпании		 = Рез.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			НаборЗаписейГраницыПартий.МоментВремени		 = МоментВремени;
			НаборЗаписейГраницыПартий.ДокументСсылка	 = Неопределено;
			НаборЗаписейГраницыПартий.ИзменитьГраницу();
			
			НаборЗаписейГраницыПартий.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности взаиморасчетов
	Если ЭтотОбъект.Движения.Найти("ВзаиморасчетыКомпании") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ДоговорВзаиморасчетов ИЗ РегистрНакопления.ВзаиморасчетыКомпании ГДЕ Регистратор = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыВзаиморасчетов = РегистрыСведений.ГраницыВзаиморасчетов.СоздатьНаборЗаписей();
			НаборЗаписейГраницыВзаиморасчетов.ДоговорВзаиморасчетов = Рез.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов");
			НаборЗаписейГраницыВзаиморасчетов.МоментВремени = МоментВремени;
			НаборЗаписейГраницыВзаиморасчетов.ДокументСсылка = Неопределено;
			НаборЗаписейГраницыВзаиморасчетов.ИзменитьГраницу();
			
			НаборЗаписейГраницыВзаиморасчетов.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности заказов
	Если ЭтотОбъект.Движения.Найти("ЗаказыПокупателей") <> Неопределено ИЛИ
		ЭтотОбъект.Движения.Найти("ЗаказыПоставщикам") <> Неопределено ИЛИ
		ЭтотОбъект.Движения.Найти("ЗаказыРаспределение") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросЗаказы.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Заказ КАК Заказ
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикам.ЗаказПоставщику
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
		|	ГДЕ
		|		ЗаказыПоставщикам.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПокупателя
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПоставщика
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка) КАК ЗапросЗаказы");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
			НаборЗаписейГраницыЗаказы.Заказ				 = Рез.Выгрузить().ВыгрузитьКолонку("Заказ");
			НаборЗаписейГраницыЗаказы.МоментВремени		 = МоментВремени;
			НаборЗаписейГраницыЗаказы.ДокументСсылка	 = Неопределено;
			НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
			
			НаборЗаписейГраницыЗаказы.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности товаров ордерного склада
	Если ЭтотОбъект.Движения.Найти("ОстаткиТоваровОрдерныйСклад") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиТоваровОрдерныйСклад ГДЕ Регистратор = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыОрдерныйСклад = РегистрыСведений.ГраницыОрдерныйСклад.СоздатьНаборЗаписей();
			НаборЗаписейГраницыОрдерныйСклад.СкладКомпании		 = Рез.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			НаборЗаписейГраницыОрдерныйСклад.МоментВремени		 = МоментВремени;
			НаборЗаписейГраницыОрдерныйСклад.ДокументСсылка	 = Неопределено;
			НаборЗаписейГраницыОрдерныйСклад.ИзменитьГраницу();
			
			НаборЗаписейГраницыОрдерныйСклад.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности производства
	Если ЭтотОбъект.Движения.Найти("ТоварыВПроизводстве")<>Неопределено Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ЗаказНаряд ИЗ РегистрНакопления.ТоварыВПроизводстве ГДЕ Регистратор=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыПроизводство = РегистрыСведений.ГраницыПроизводство.СоздатьНаборЗаписей();
			НаборЗаписейГраницыПроизводство.ЗаказНаряд = Рез.Выгрузить().ВыгрузитьКолонку("ЗаказНаряд");
			НаборЗаписейГраницыПроизводство.МоментВремени = МоментВремени;
			НаборЗаписейГраницыПроизводство.ДокументСсылка = Неопределено;
			НаборЗаписейГраницыПроизводство.ИзменитьГраницу();
			
			НаборЗаписейГраницыПроизводство.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности автомобилей
	Если ЭтотОбъект.Движения.Найти("ОстаткиАвтомобилей")<>Неопределено Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
			НаборЗаписейГраницыАвтомобили.СкладКомпании = Рез.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			НаборЗаписейГраницыАвтомобили.МоментВремени = МоментВремени;
			НаборЗаписейГраницыАвтомобили.ДокументСсылка = Неопределено;
			НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
			
			НаборЗаписейГраницыАвтомобили.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности комплектации автомобилей
	Если ЭтотОбъект.Движения.Найти("КомплектацияАвтомобилей")<>Неопределено Тогда
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Автомобиль ИЗ РегистрНакопления.КомплектацияАвтомобилей ГДЕ Регистратор=&Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыКомплектация = РегистрыСведений.ГраницыКомплектация.СоздатьНаборЗаписей();
			НаборЗаписейГраницыКомплектация.Автомобиль = Рез.Выгрузить().ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыКомплектация.МоментВремени = МоментВремени;
			НаборЗаписейГраницыКомплектация.ДокументСсылка = Неопределено;
			НаборЗаписейГраницыКомплектация.ИзменитьГраницу();
			
			НаборЗаписейГраницыКомплектация.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности заказов на автомобили
	Если ЭтотОбъект.Движения.Найти("ЗаказыАвтомобилей") <> Неопределено ИЛИ
		ЭтотОбъект.Движения.Найти("ЗаказыПоставщикамНаАвтомобили") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗапросЗаказы.Автомобиль КАК Автомобиль
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Автомобиль КАК Автомобиль
		|	ИЗ
		|		РегистрНакопления.ЗаказыАвтомобилей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикам.Автомобиль
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикамНаАвтомобили КАК ЗаказыПоставщикам
		|	ГДЕ
		|		ЗаказыПоставщикам.Регистратор = &Ссылка) КАК ЗапросЗаказы");
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказыНаАвтомобили.СоздатьНаборЗаписей();
			НаборЗаписейГраницыЗаказы.Автомобиль     = Рез.Выгрузить().ВыгрузитьКолонку("Автомобиль");
			НаборЗаписейГраницыЗаказы.МоментВремени  = МоментВремени;
			НаборЗаписейГраницыЗаказы.ДокументСсылка = Неопределено;
			НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
			
			НаборЗаписейГраницыЗаказы.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// двигаем границу последовательности автомобилей ордерного склада
	Если ЭтотОбъект.Движения.Найти("ОстаткиАвтомобилейОрдерныйСклад") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилейОрдерныйСклад ГДЕ Регистратор = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка); Рез = Запрос.Выполнить();
		Если НЕ Рез.Пустой() Тогда
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад = РегистрыСведений.ГраницыАвтомобилиОрдерныйСклад.СоздатьНаборЗаписей();
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.СкладКомпании		 = Рез.Выгрузить().ВыгрузитьКолонку("СкладКомпании");
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.МоментВремени		 = МоментВремени;
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.ДокументСсылка	 = Неопределено;
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.ИзменитьГраницу();
			
			НаборЗаписейГраницыАвтомобилиОрдерныйСклад.УбратьСсылку(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
	КонецЕсли;
	
	// удаление движений
	Если ЭтотОбъект.Метаданные().УдалениеДвижений = Метаданные.СвойстваОбъектов.УдалениеДвижений.НеУдалятьАвтоматически Тогда
		дкУдалениеДвиженийДокумента(ЭтотОбъект);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // дкОбработкаУдаленияПроведения()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ РЕКВИЗИТОВ ФОРМ ДОКУМЕНТОВ   

// Обработка изменения реквизитов документов
//
// Параметры;
// ЭтотОбъект	– ДокументОбъект		– Документ, реквизит которого обрабатывается.
// Имя			– Строка				– Имя реквизита документа с полным путем (например Товары.Номенклатура).
// ЭтаФорма	– Форма						– Ссылка на форму документа. Если значение неопределено,
// производится программная обработка реквизитов.
// ТекСтрока	– СтрокаТабличнойЧасти 	– Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры 						– список значений, список дополнительных параметров печати
//
// Возвращаемое значение:
// Булево – Результат выполнения обработки.
//
Функция дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока = Неопределено,ЭтаФорма = Неопределено,ДопПараметры = Неопределено) Экспорт
	РезультатОбработки = орОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	Если РезультатОбработки <> Неопределено Тогда
		Возврат РезультатОбработки;
	КонецЕсли; 
	РезультатОбработки = Истина;
	
	//<< ЧалапАЮ БизТех 10.09.2024
	Если Имя = "верс_ИсторияИзменений" Тогда
		верс_ВерсионированиеОбъектов.ОткрытьОтчетИсторияИзмененийОбъектов(ЭтаФорма);
	КонецЕсли;
	// ЧалапАЮ БизТех 10.09.2024>>

	
	// ОБРАБОТКА РЕКВИЗИТОВ ШАПКИ ДОКУМЕНТА
	Если Имя = "Дата" Тогда
		
		//Если в доп. параметрах передается дата документа, установим ее
		УстановитьДатуДокумента = Неопределено;
		Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			ДопПараметры.Свойство("УстановитьДатуДокумента",УстановитьДатуДокумента);
		КонецЕсли;
		Если УстановитьДатуДокумента <> Неопределено И ТипЗнч(УстановитьДатуДокумента) = Тип("Дата") Тогда
			ЭтотОбъект.Дата = УстановитьДатуДокумента;
		КонецЕсли; 
		
		// Изменение даты приводит к необходимости пересчета скидок документа (как "шапочных", так и товарных).
		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		// Получаем ссылку на обработку по расчету скидок. Если такой переменной в модуле нет,
		// то документ не поддерживает расчет скидок.
		Попытка
			ОбработкаСкидок  = ЭтотОбъект[ИмяПеременнойОбработки];
			ОбработкаСкидок.Дата = ЭтотОбъект.Дата;	
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
		Исключение
		КонецПопытки;
		
	ИначеЕсли Имя = "Автор" Тогда
		
	ИначеЕсли Имя = "Менеджер" Тогда
		#Если Клиент Тогда
			зфОрганизацияПодразделениеИндикация(ЭтаФорма);
		#КонецЕсли
		
	ИначеЕсли Имя = "Организация" Тогда
		#Если Клиент Тогда
			зфОрганизацияПодразделениеИндикация(ЭтаФорма);
		#КонецЕсли
		// Организация может являются плательщиком НДС, а может и нет.. надо обработать таблицу
		// однако ее может не быть, либо в ней не отражается НДС
		// Помимо этого необходимо учесть особенность документа "Поступление товаров", 
		// т.к. в этом случае контрагент (поставщик) может не является платильщиком НДС.
		// (если контрагент - частное лицо, не смотрим на флаг, проставляем ставку БезНДС)
		МетаданныеДокумента = ЭтотОбъект.Метаданные();
		
		ЕстьСтавкаНДС = Ложь;
		Попытка
			ЕстьСтавкаНДС = (НЕ МетаДанныеДокумента.ТабличныеЧасти.Товары.Реквизиты.Найти("СтавкаНДС") = Неопределено);
		Исключение
		КонецПопытки;
		
		Если ЕстьСтавкаНДС ИЛИ МетаданныеДокумента.Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
			Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
				Если МетаданныеДокумента.Реквизиты.Найти("Контрагент") = Неопределено Тогда
					ОсвобожденОтНДС = Ложь;
				Иначе
					ЭтоЧастноеЛицо = Ложь;
					Если ТипЗнч(ЭтотОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
						ЭтоЧастноеЛицо = ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
					КонецЕсли;
					ОсвобожденОтНДС = ЭтотОбъект.Контрагент.ОсвобожденОтНДС ИЛИ ЭтоЧастноеЛицо;
				КонецЕсли;
			Иначе
				ОсвобожденОтНДС = (МетаданныеДокумента.Реквизиты.Найти("ПодразделениеКомпании")<>Неопределено И ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС) ИЛИ
				(МетаданныеДокумента.Реквизиты.Найти("Организация")<>Неопределено И ЭтотОбъект.Организация.ОсвобожденОтНДС);
			КонецЕсли;
			
			Попытка
				ТаблицаТоваров = ЭтотОбъект.Товары;
				Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
					Если ОсвобожденОтНДС Тогда
						СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					Иначе
						СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
					КонецЕсли; 
					ЭтотОбъект.ОбработкаРеквизита("Товары.Цена",СтрокаТоваров,ЭтаФорма,ДопПараметры);
				КонецЦикла;
			Исключение КонецПопытки; 
			// Обработка опций
			Если МетаданныеДокумента.ТабличныеЧасти.Найти("Опции")<>Неопределено И
				МетаданныеДокумента.ТабличныеЧасти["Опции"].Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
				ТаблицаОпций	= ЭтотОбъект.Опции;
				Для Каждого СтрокаОпций Из ТаблицаОпций Цикл
					Если ОсвобожденОтНДС Тогда
						СтрокаОпций.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					Иначе
						СтрокаОпций.СтавкаНДС = СтрокаОпций.Опция.СтавкаНДС;
					КонецЕсли; 
					ЭтотОбъект.ОбработкаРеквизита("Опции.Цена",СтрокаОпций,ЭтаФорма,ДопПараметры);
				КонецЦикла;
			КонецЕсли;
		
			Попытка
				Если ОсвобожденОтНДС Тогда
					ЭтотОбъект.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				Иначе
					ЭтотОбъект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				КонецЕсли; 
				ЭтотОбъект.ОбработкаРеквизита("СтавкаНДС",ТекСтрока,ЭтаФорма,ДопПараметры);
			Исключение КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли Имя = "ПодразделениеКомпании" Тогда
		#Если Клиент Тогда
			Если ЭтотОбъект.Организация <> ЭтотОбъект.ПодразделениеКомпании.Организация Тогда
				ЭтотОбъект.Организация = ЭтотОбъект.ПодразделениеКомпании.Организация;
				// Вызовем обработку организации для пересчета НДС
				ЭтотОбъект.ОбработкаРеквизита("Организация",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
			
			зфОрганизацияПодразделениеИндикация(ЭтаФорма);
			ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
			Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
				ЭтотОбъект.ТипЦен = ТипЦен;
				Возврат ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма) И ЭтотОбъект.ОбработкаРеквизита("УстановитьРозничныеЦены",, ЭтаФорма);
			КонецЕсли;
			
			//предложим поменять валюту документа на валюту подразделения
			Если ЭтотОбъект.Метаданные().Реквизиты.Найти("ВалютаДокумента")<>Неопределено Тогда
				Если (НЕ ЭтотОбъект.ПодразделениеКомпании.Валюта.Пустая()) И (НЕ ЭтотОбъект.ВалютаДокумента.Пустая())
					И ЭтотОбъект.ВалютаДокумента <> ЭтотОбъект.ПодразделениеКомпании.Валюта Тогда
					Если ЭтаФорма <> Неопределено Тогда //в этом случае считаем, что форма документа открыта и изменяем подразделение интерактивно
						Ответ = Вопрос("Установить валюту документа равной валюте выбранного подразделения?", РежимДиалогаВопрос.ДаНет,
						обПраво("ТаймаутДиалогов", ЭтотОбъект.Права,,ЭтотОбъект), КодВозвратаДиалога.Нет);
						Если Ответ = КодВозвратаДиалога.Да Тогда
							// получим общую форму для валюты
							ФормаВыборВалюты = ПолучитьОбщуюФорму("ВыборВалюты", ЭтаФорма);
							ФормаВыборВалюты.ТребуетсяПересчет = Истина;
							ФормаВыборВалюты.НоваяВалюта = ЭтотОбъект.ПодразделениеКомпании.Валюта;
							//Получаем курс валюты на дату документа
							СтруктураКурса = обКурсДляВалюты(ФормаВыборВалюты.НоваяВалюта, ЭтаФорма.Дата);
							ФормаВыборВалюты.НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
							ФормаВыборВалюты.мРежимВнешнегоЗаполнения = Истина;
							ФормаВыборВалюты.ОткрытьМодально();
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			
			// Если произошло интерактивное изменение подразделения компании, то, возможно, необходимо пересчитать цены,
			ТабличнаяЧастьТовары = Неопределено;
			ИмяТЧ = "";
			
			Попытка
				Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ТабличнаяЧастьТовары",ТабличнаяЧастьТовары) Тогда
					ТабличнаяЧастьТовары = ЭтотОбъект.Товары;
				КонецЕсли;
			Исключение
				Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Количество() > 0 Тогда
					ТабличнаяЧастьТовары = ЭтотОбъект[ЭтотОбъект.Метаданные().ТабличныеЧасти[0].Имя];
				КонецЕсли;	
			КонецПопытки;
			// Документ может не содержать табличной части "Товары", в этом случае ничего не делаем.
			Если ТабличнаяЧастьТовары <> Неопределено Тогда
				// В табличной части "Товары" может не быть реквизита "Цена".
				Цена = Неопределено;
				Номенклатура = Неопределено;
				Если ТабличнаяЧастьТовары.Количество() = 0 Тогда
					Попытка
						Цена = ТабличнаяЧастьТовары.Найти(0, "Цена");
						Номенклатура = ТабличнаяЧастьТовары.Найти(Справочники.Номенклатура.ПустаяСсылка(), "Номенклатура");
					Исключение КонецПопытки;
				Иначе
					Попытка
						Цена = ТабличнаяЧастьТовары[0].Цена;
						Номенклатура = ТабличнаяЧастьТовары[0].Номенклатура;
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если Цена <> Неопределено И Номенклатура <> Неопределено Тогда
					ТипЦен = Неопределено;
					Попытка 
						ТипЦен = ЭтотОбъект.ТипЦен; 
					Исключение 
						Попытка 
							ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
						Исключение
						КонецПопытки;
					КонецПопытки;
					Если ТипЦен <> Неопределено Тогда
						// Зададим вопрос пользователю, хочет ли он пересчитать цены.
						Если Вопрос("Пересчитать цены в табличной части в соответствии с выбранным подразделением?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
							Попытка
								МоментЦены = ?(ЭтотОбъект.ЭтоНовый(),ЭтотОбъект.Дата,ЭтотОбъект.МоментВремени());
							Исключение
								МоментЦены = Неопределено;
							КонецПопытки;
							Для каждого СтрокаТоваров Из ТабличнаяЧастьТовары Цикл
								// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
								Попытка
									ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
								Исключение
									ХарактеристикаНоменклатуры = Неопределено;
								КонецПопытки;
								Попытка
									ЕдиницаИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
								Исключение
									ЕдиницаИзмерения = Неопределено;
								КонецПопытки;
								
								Поставщик = Неопределено;
								Закупка = Неопределено;
								Попытка
									Поставщик = СтрокаТоваров.Поставщик;
									Закупка = Ложь;
								Исключение
									Попытка
										Поставщик = СтрокаТоваров.ПрайсЛист;
										Закупка = Истина;
									Исключение КонецПопытки; 
								КонецПопытки;
								
								Если Закупка <> Неопределено Тогда
									ВариантПоставки = Новый Структура;
									ВариантПоставки.Вставить("Поставщик",            Поставщик);
									ВариантПоставки.Вставить("Закупка",              Закупка);
									ВариантПоставки.Вставить("КлючСтрокиПоставщика", СтрокаТоваров.КлючСтрокиПоставщика);
									ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", СтрокаТоваров.СрокПоставкиВСтроке));
									ВариантПоставки.Вставить("СтавкаНДС",            СтрокаТоваров.СтавкаНДС);
									ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
									
									НоваяЦена = обПолучитьЦену(ТипЦен, СтрокаТоваров.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
									
									СтрокаТоваров.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
									Если Закупка Тогда
										СтрокаТоваров.ПрайсЛист = ВариантПоставки.Поставщик;
									Иначе
										СтрокаТоваров.Поставщик = ВариантПоставки.Поставщик;
										СтрокаТоваров.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
									КонецЕсли;
								Иначе
									НоваяЦена = обПолучитьЦену(ТипЦен, СтрокаТоваров.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
								КонецЕсли;
								
								Если СтрокаТоваров.Цена <> НоваяЦена Тогда
									СтрокаТоваров.Цена = НоваяЦена;
									ДополнительныеПараметры = Новый Структура;
									ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
									РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", СтрокаТоваров, ЭтаФорма, ДополнительныеПараметры) И РезультатОбработки;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		
		// Изменение подразделения приводит к необходимости пересчета скидок документа (как "шапочных", так и товарных).
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		Попытка // Получаем ссылку на обработку по расчету скидок. Если такой переменной в модуле нет, то документ не поддерживает расчет скидок.
			ОбработкаСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			ОбработкаСкидок.ПодразделениеКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаПодразделениеКомпании];
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		Исключение
		КонецПопытки;
		
	ИначеЕсли Имя = "Проект" Тогда
		#Если Клиент Тогда
			зфОрганизацияПодразделениеИндикация(ЭтаФорма);
		#КонецЕсли
		
	ИначеЕсли Имя = "Контрагент" Тогда
		// Проверяем является ли контрагент плательщиком НДС (соответственно проставляем ставки НДС)
		// только для документов поступления
		Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
			Попытка	
				ОсвобожденОтНДС = ЭтотОбъект.Контрагент.ОсвобожденОтНДС;
				
				Для Каждого СтрокаТоваров Из ЭтотОбъект.Товары Цикл
					Если ОсвобожденОтНДС Тогда
						СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					Иначе
						СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
					КонецЕсли; 
					ЭтотОбъект.ОбработкаРеквизита("Товары.СтавкаНДС",СтрокаТоваров,ЭтаФорма,ДопПараметры);
				КонецЦикла;
				// Обработка опций
				Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти("Опции")<>Неопределено И
					ЭтотОбъект.Метаданные().ТабличныеЧасти["Опции"].Реквизиты.Найти("СтавкаНДС")<>Неопределено Тогда
					Для Каждого СтрокаОпций Из ЭтотОбъект.Опции Цикл
						Если ОсвобожденОтНДС Тогда
							СтрокаОпций.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
						Иначе
							СтрокаОпций.СтавкаНДС = СтрокаОпций.Опция.СтавкаНДС;
						КонецЕсли; 
						ЭтотОбъект.ОбработкаРеквизита("Опции.СтавкаНДС",СтрокаОпций,ЭтаФорма,ДопПараметры);
					КонецЦикла;
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
		
		// Произошла смена контрагента, значит необходимо очистить реквизит "карта". 
		Попытка
			Если (Не ЭтотОбъект.Карточка.Пустая()) И (ЭтотОбъект.Карточка.Объект <> ЭтотОбъект.Контрагент) Тогда
				ЭтотОбъект.Карточка = Неопределено;
				Результат = дкОбработкаРеквизита(ЭтотОбъект,"Карточка",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		#Если Клиент Тогда
			дкСообщитьОЗаметках(ЭтотОбъект,ЭтотОбъект[Имя],ЭтаФорма);
		#КонецЕсли
	
		Возврат дкОбработкаРеквизитаКонтрагент(ЭтотОбъект,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя = "ДоговорВзаиморасчетов" Тогда
		Возврат дкОбработкаРеквизитаДоговорВзаиморасчетов(ЭтотОбъект,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя = "Карточка" Тогда
		Попытка Карточка = ЭтотОбъект.Карточка;
		Исключение Возврат Ложь;
		КонецПопытки; 
		
		// Изменение карточки приводит к необходимости пересчета скидок документа. 		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		Попытка // Получаем ссылку на обработку по расчету скидок. Если такой переменной в модуле нет, то документ не поддерживает расчет скидок.
			ОбработкаСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			ОбработкаСкидок.Карточка = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаКарточка];
		Исключение
		КонецПопытки;
		
		РеквизитыШапкиДокумента = ЭтотОбъект.Метаданные().Реквизиты;
		Если (Карточка <> Неопределено) И (НЕ Карточка.Пустая()) Тогда
			//Какая то карточка выбрана
			Если Карточка.ВидКарточки = Перечисления.ВидыКарточек.ДисконтнаяКарта Тогда
				//Выбрана именно дисконтная карта
				Если РеквизитыШапкиДокумента.Найти("Контрагент") <> Неопределено Тогда
					//В документе есть контрагент
					Если ТипЗнч(Карточка.Объект) = Тип("СправочникСсылка.Контрагенты") И
						(НЕ обЗначениеНеЗаполнено(Карточка.Объект)) Тогда
						Если ЭтотОбъект.Контрагент <> Карточка.Объект Тогда
							//Контрагент изменен
							ЭтотОбъект.Контрагент = Карточка.Объект;
							Возврат ЭтотОбъект.ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
		
		Попытка // Получаем ссылку на обработку по расчету скидок. Если такой переменной в модуле нет, то документ не поддерживает расчет скидок.
			РезультатОбработки  = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		Исключение
		КонецПопытки;
		
	ИначеЕсли Имя = "ВалютаДокумента" Тогда
		// Изменение валюты приводит к необходимости пересчета скидок.
		Если ДопПараметры = Неопределено ИЛИ ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли; 
		ДопПараметры.Вставить("НеРассчитыватьСкидки", Ложь); 
		РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		
	ИначеЕсли Имя = "КурсДокумента" Тогда
		МетаданныеОбъекта = ЭтотОбъект.Метаданные();
		спрВалютаДокумента = ЭтотОбъект.ВалютаДокумента;
		спрВалютаУпрУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		ЭтотОбъектКурс  = ЭтотОбъект.КурсДокумента;
		Если дкДокументЕстьРеквизитШапки("КурсВалютыУпр", МетаданныеОбъекта.Имя) Тогда
			Если спрВалютаДокумента = спрВалютаУпрУчета Тогда
				// валюта документа равна валюте упр. учета - выставим курс упр. валюты документа равным курсу документа
				ЭтотОбъект.КурсВалютыУпр = ЭтотОбъектКурс;
				ЭтотОбъект.ОбработкаРеквизита("КурсВалютыУпр",,ЭтаФорма, ДопПараметры);
			Иначе
				Если ТипЗнч(ДопПараметры) <> Тип("Структура") ИЛИ НЕ ДопПараметры.Свойство("КурсУпрУстановленВручную") Тогда
					// валюта документа не равна валюте упр. учета - возьмем курс упр. валюты документа на дату документа
					СтруктураКурса = обКурсДляВалюты(спрВалютаУпрУчета, ЭтотОбъект.Дата);
					КурсУпрНаДату = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
					ЭтотОбъект.КурсВалютыУпр = КурсУпрНаДату;
					ЭтотОбъект.ОбработкаРеквизита("КурсВалютыУпр",,ЭтаФорма, ДопПараметры);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "КассаКомпании" Тогда
		//узнаем как точно называется реквизит, т.к. в документах планирования ДДС он называется "СтруктурнаяЕдиница"
		Попытка
			КассаКомпании = ЭтотОбъект.КассаКомпании;
		Исключение
			КассаКомпании = ЭтотОбъект.СтруктурнаяЕдиница;
		КонецПопытки;
		//если касса не многовалютная, то изменим валюту документа и пересчитаем
		Если Не обЗначениеНеЗаполнено(КассаКомпании) И НЕ КассаКомпании.МноговалютнаяКасса Тогда
			ТекВалютаДокумента = ЭтотОбъект.ВалютаДокумента;
			ТекКурсДокумента = ЭтотОбъект.КурсДокумента;
			ЭтотОбъект.ВалютаДокумента = КассаКомпании.ВалютаДенежныхСредств;
			СтруктураКурса = обКурсДляВалюты(ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.Дата);
			ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс/?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			//если валюта изменилась, то пересчет
			Если ЭтотОбъект.ВалютаДокумента <> ТекВалютаДокумента Тогда
				НуженПересчет = Истина;
				#Если Клиент Тогда
					ЗадаватьВопрос = Истина;
				#Иначе
					ЗадаватьВопрос = Ложь;
				#КонецЕсли
				//если вызываем из модуля, вопрос не нужен
				Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("ЗадаватьВопрос",) Тогда
					ЗадаватьВопрос = ЗадаватьВопрос И ДопПараметры.ЗадаватьВопрос;
				КонецЕсли;
				#Если Клиент Тогда
					Если ЗадаватьВопрос И Вопрос("Были изменены данные влияющие на суммовые показатели документа !
						|Выполнить пересчет ?",РежимДиалогаВопрос.ДаНет,обПраво("ТаймаутДиалогов",ЭтотОбъект.Права,,ЭтотОбъект),КодВозвратаДиалога.Да) = КодВозвратаДиалога.Нет Тогда
						НуженПересчет = Ложь;
					КонецЕсли;
				#КонецЕсли
				Если НуженПересчет Тогда
					ЭтотОбъект.СуммаДокумента = обПересчет(ЭтотОбъект.СуммаДокумента,ТекВалютаДокумента,ТекКурсДокумента,ЭтотОбъект.ВалютаДокумента,ЭтотОбъект.КурсДокумента);
					Попытка // если есть сумма ндс пересчитаем и ее
						ЭтотОбъект.СуммаНДС = обПересчет(ЭтотОбъект.СуммаНДС,ТекВалютаДокумента,ТекКурсДокумента,ЭтотОбъект.ВалютаДокумента,ЭтотОбъект.КурсДокумента);
					Исключение КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#Если Клиент Тогда
			Попытка
				дкВывестиЗаголовокДенежныеСредства(ЭтаФорма,ЭтаФорма.ЭлементыФормы.тДенежныеСредства,КассаКомпании);
			Исключение
			КонецПопытки;
		#КонецЕсли
		Возврат Истина;
		
	ИначеЕсли Имя = "СкидкаНаценка" Тогда
		
		// Выбрана ручная скидка, необходимо пересчитать скидки в табличной части. 		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		Попытка // Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет, значит он не поддерживает скидки.
			ОбработкаСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			ОбработкаСкидок.СкидкаНаценка = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкидкаНаценка];
			
			// Смена скидки\наценки влияет на видимость некоторых колонок в табличной части.
			#Если Клиент Тогда
				Если ЭтаФорма <> Неопределено Тогда
					дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма, ОбработкаСкидок.СкидкаНаценка,ОбработкаСкидок.ИмяТабличнойЧасти);	
				КонецЕсли;
			#КонецЕсли
		Исключение
		КонецПопытки;
		
		РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки; 
		
	ИначеЕсли Имя = "ПрименитьСкидкуКТабличнымЧастям" Тогда // ИСПРАВИТЬ : ПОСЛЕ УДАЛЕНИЯ МОДУЛЯ рсРасчетСкидок, ДАННОЙ СЕКЦИИ БЫТЬ НЕ ДОЛЖНО. 
		РезультатОбработки = рсПрименитьСкидкуШапкиКТабличнойЧасти(ЭтотОбъект, "Товары", , ДопПараметры);
		#Если Клиент Тогда
			Попытка
				дкТоварыПриОкончанииРедактирования(ЭтаФорма,ЭтаФорма.ЭлементыФормы.Товары,ЛОЖЬ,ЛОЖЬ);
			Исключение КонецПопытки;
		#КонецЕсли
		
	ИначеЕсли Имя = "СкладКомпании" Тогда
		Попытка
			Если НЕ ЭтотОбъект.Товары.Количество() = 0 Тогда
				Для Каждого стрТовары Из ЭтотОбъект.Товары Цикл
					Если обЗначениеНеЗаполнено(стрТовары.Номенклатура) ИЛИ обЗначениеНеЗаполнено(ЭтотОбъект.СкладКомпании) Тогда
						стрТовары.Ячейка=Справочники.ЯчейкиХранения.ПустаяСсылка();
					Иначе
						ЯчейкаСсылка=Справочники.Номенклатура.ПолучитьЯчейкуХранения(стрТовары.Номенклатура,ЭтотОбъект.СкладКомпании);
						стрТовары.Ячейка=ЯчейкаСсылка;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти("ТипЦен")<>Неопределено Тогда
			// Посмотрим можно менять валюту или нет
			Попытка 
				ВозможностьИзмененияЦенПоТипуЦен = ДопПараметры.ВозможностьИзмененияЦен И обПраво("ИзменятьВалютуПоКатегорииЦен",ЭтотОбъект.Права,,ЭтотОбъект);
			Исключение
				ВозможностьИзмененияЦенПоТипуЦен = обПраво("ИзменятьВалютуПоКатегорииЦен",ЭтотОбъект.Права,,ЭтотОбъект);
			КонецПопытки;
			#Если Клиент Тогда
				
				Если ВозможностьИзмененияЦенПоТипуЦен Тогда
					Если ЭтаФорма <> Неопределено Тогда 
						Ответ = Вопрос("Произвести изменение типа цен и валюты в соответствии со складом?", РежимДиалогаВопрос.ДаНет, 0);
						Если Ответ = КодВозвратаДиалога.Нет тогда
							Если ТипЗнч(ЭтотОбъект.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
								Если ЭтотОбъект.СкладКомпании.Розничный Тогда 
									Если ЭтотОбъект.ТипЦен <> ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли Тогда
										ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
										ДополнительныеПараметры = Новый Структура;
										ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как у нас идет отказ от выбора склада
										ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры);
									КонецЕсли; 
								КонецЕсли;
								ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
								Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
									ЭтотОбъект.ТипЦен = ТипЦен;
									ДополнительныеПараметры = Новый Структура;
									ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как у нас идет отказ от выбора склада
									Возврат ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры) И ЭтотОбъект.ОбработкаРеквизита("УстановитьРозничныеЦены",,ЭтаФорма);
								КонецЕсли;
								
								// Изменение склада компании приводит к необходимости пересчета скидок документа. 		
								// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
								// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
								Попытка
									ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
								Исключение
									ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
								КонецПопытки;
								
								// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет,
								// значит он не поддерживает скидки.
								Попытка
									ОбработкаСкидок     = ЭтотОбъект[ИмяПеременнойОбработки];
									ОбработкаСкидок.СкладКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкладКомпании];
									РезультатОбработки    = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
								Исключение
								КонецПопытки;
							КонецЕсли;
						ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
							Если ТипЗнч(ЭтотОбъект.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
								Если ЭтотОбъект.СкладКомпании.Розничный Тогда 
									Если ЭтотОбъект.ТипЦен <> ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли Тогда
										ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
										ДополнительныеПараметры = Новый Структура;
										ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как далее их пересчитаем
										ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры);
									КонецЕсли; 
								КонецЕсли;
								ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
								Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
									ЭтотОбъект.ТипЦен = ТипЦен;
								КонецЕсли;
								НовыйТипЦен = ЭтотОбъект.ТипЦен;
								// Изменяем валюту на валюту типа цен
								// Запомним курс и валюту старую
								СтараяВалюта = ЭтотОбъект.ВалютаДокумента;
								СтарыйКурс = ЭтотОбъект.КурсДокумента;
								НоваяВалюта = обВалютаТипаЦены(Неопределено,ЭтотОбъект.ТипЦен,Ложь);
								// Получаем курс валюты на дату документа
								СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтотОбъект.Дата);
								НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
								// Получим курс упр. на дату документа
								спрВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
								СтруктураКурса = обКурсДляВалюты(спрВалютаУпр,ЭтотОбъект.Дата);
								НовыйКурсВалютыУпр = СтруктураКурса.Курс/ ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
								
								// Пытаемся позаписывать изменения 
								
								Попытка
									ЭтотОбъект.ВалютаДокумента = НоваяВалюта;
								Исключение КонецПопытки; 
								Попытка
									ЭтотОбъект.КурсДокумента = НовыйКурс;
								Исключение КонецПопытки;
								Попытка
									ЭтотОбъект.КурсВалютыУпр = НовыйКурсВалютыУпр;
								Исключение КонецПопытки;
								
								дкОбработкаРеквизита(ЭтотОбъект, "ВалютаДокумента", ТекСтрока, ЭтаФорма, ДопПараметры);
								// Пересчитаем таблицы документа, сделано всвязи с тем что в документе может и не быть рализован 
								// пересчет при изменении типа цен
								
								Попытка
									Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Цена") = Неопределено Тогда
										ТаблицаТоваров = Неопределено;
									Иначе
										ТаблицаТоваров = ЭтотОбъект.Товары;
									КонецЕсли;
								Исключение
									ТаблицаТоваров = Неопределено;
								КонецПопытки;
								
								ОбнулятьСуммовыеПоказатели = Неопределено; // Данный признак определяет действия, в случае, если для товара получена нулевая цена
								// или цена не задана (для выбранного типа цен). В случае нахождения таких позиций в табличной части,
								// пользователю будет задан
								// вопрос, о действиях, которые он хочет выполнить. Соответственно: Истина -
								// обнулять суммовые показатели, Ложь - остановить значения как были
								// Неопределено - вопрос пользователю еще не задавался.
								
								Если ТаблицаТоваров <> Неопределено Тогда
									Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
										// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
										Попытка
											ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
										Исключение
											ХарактеристикаНоменклатуры = Неопределено;
										КонецПопытки;
										Попытка
											ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
										Исключение
											ЕдиницаИзмерения = Неопределено;
										КонецПопытки;
										
										Поставщик = Неопределено;
										Закупка = Неопределено;
										Попытка
											Поставщик = ТекСтрока.Поставщик;
											Закупка = Ложь;
										Исключение
											Попытка
												Поставщик = ТекСтрока.ПрайсЛист;
												Закупка = Истина;
											Исключение КонецПопытки; 
										КонецПопытки;
										
										Попытка
											Если Закупка <> Неопределено Тогда
												ВариантПоставки = Новый Структура;
												ВариантПоставки.Вставить("Поставщик",            Поставщик);
												ВариантПоставки.Вставить("Закупка",              Закупка);
												ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
												ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
												ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
												ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
												
												НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
												
												ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
												Если Закупка Тогда
													ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
												Иначе
													ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
													ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
												КонецЕсли;
											Иначе
												НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
											КонецЕсли;
											
											Если НоваяЦена = 0 Тогда
												Если ОбнулятьСуммовыеПоказатели = Неопределено Тогда // Если вопрос еще не задавался, то зададим его.
													Ответ = Вопрос("В табличной части присутствуют товары с нулевой ценой для выбранного типа цен < " + НовыйТипЦен + " > .
													|Обнулить цены для данных позиций?", РежимДиалогаВопрос.ДаНет);
													Если Ответ = КодВозвратаДиалога.Нет Тогда
														ОбнулятьСуммовыеПоказатели = Ложь;
													Иначе
														ОбнулятьСуммовыеПоказатели = Истина;
													КонецЕсли;
												КонецЕсли;
												
												Если ОбнулятьСуммовыеПоказатели Тогда
													ТекСтрока.Цена = 0;
												Иначе
													// Если обнулять цену не нужно, и при этом изменилась валюта,
													// то выполним пересчет значения старой цены.
													ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
												КонецЕсли;
											Иначе // Значит сменилась только валюта и необходимо выполнить пересчет.
												//ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
												ТекСтрока.Цена = НоваяЦена;
											КонецЕсли;
											Попытка
												ДополнительныеПараметры = Новый Структура;
												ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
												ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
											Исключение 
											КонецПопытки;
										Исключение 
											// При возникших проблемах просто пересчитаем цены
											ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);	
											Попытка
												ДополнительныеПараметры = Новый Структура;
												ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
												ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
											Исключение 
											КонецПопытки;
										КонецПопытки;
									КонецЦикла;
									Попытка
										НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
									Исключение
										НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
									КонецПопытки; 
									НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
									Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
										ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
										Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
									КонецЕсли;
								Иначе
									Попытка
										НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
									Исключение
										НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
									КонецПопытки; 
									НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
									Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
										ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
										Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
									КонецЕсли; 
								КонецЕсли;
							КонецЕсли;
							
							// Вызовем обработчики документов
							ДополнительныеПараметры = Новый Структура();
							ДополнительныеПараметры.Вставить("ТребуетсяПересчет",Истина);
							ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
							
							ЭтотОбъект.ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма,ДополнительныеПараметры);
							ЭтотОбъект.ОбработкаРеквизита("КурсДокумента",,ЭтаФорма,ДополнительныеПараметры);
							ЭтотОбъект.ОбработкаРеквизита("КурсВалютыУпр",,ЭтаФорма,ДополнительныеПараметры);
							
							дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
							
							// Изменение склада компании приводит к необходимости пересчета скидок документа. 		
							// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
							// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
							Попытка
								ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
							Исключение
								ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
							КонецПопытки;
							
							// Теперь получаем ссылку на обработку. Если соответствующей переменной
							// в модуле документа нет, значит он не поддерживает скидки.
							Попытка
								ОбработкаСкидок     = ЭтотОбъект[ИмяПеременнойОбработки];
								ОбработкаСкидок.СкладКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкладКомпании];
								РезультатОбработки    = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
							Исключение
							КонецПопытки;
						КонецЕсли;
					Иначе
						Если ТипЗнч(ЭтотОбъект.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
							Если ЭтотОбъект.СкладКомпании.Розничный Тогда 
								Если ЭтотОбъект.ТипЦен <> ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли Тогда
									ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
									ДополнительныеПараметры = Новый Структура;
									ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как далее их пересчитаем
									ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры);
								КонецЕсли; 
							КонецЕсли;
							ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
							Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
								ЭтотОбъект.ТипЦен = ТипЦен;
							КонецЕсли;
							НовыйТипЦен = ЭтотОбъект.ТипЦен;
							// Изменяем валюту на валюту типа цен
							// Запомним курс и валюту старую
							СтараяВалюта = ЭтотОбъект.ВалютаДокумента;
							СтарыйКурс = ЭтотОбъект.КурсДокумента;
							НоваяВалюта = обВалютаТипаЦены(Неопределено,ЭтотОбъект.ТипЦен,Ложь);
							// Получаем курс валюты на дату документа
							СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтотОбъект.Дата);
							НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
							// Получим курс упр. на дату документа
							спрВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
							СтруктураКурса = обКурсДляВалюты(спрВалютаУпр,ЭтотОбъект.Дата);
							НовыйКурсВалютыУпр = СтруктураКурса.Курс/ ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
							
							// Пытаемся позаписывать изменения 
							
							Попытка
								ЭтотОбъект.ВалютаДокумента = НоваяВалюта;
							Исключение КонецПопытки; 
							Попытка
								ЭтотОбъект.КурсДокумента = НовыйКурс;
							Исключение КонецПопытки;
							Попытка
								ЭтотОбъект.КурсВалютыУпр = НовыйКурсВалютыУпр;
							Исключение КонецПопытки;
							
							дкОбработкаРеквизита(ЭтотОбъект, "ВалютаДокумента", ТекСтрока, ЭтаФорма, ДопПараметры);
							// Пересчитаем таблицы документа, сделано всвязи с тем что в документе может и не быть рализован 
							// пересчет при изменении типа цен
							
							Попытка
								Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Цена") = Неопределено Тогда
									ТаблицаТоваров = Неопределено;
								Иначе
									ТаблицаТоваров = ЭтотОбъект.Товары;
								КонецЕсли;
							Исключение
								ТаблицаТоваров = Неопределено;
							КонецПопытки;
							
							ОбнулятьСуммовыеПоказатели = Неопределено; // Данный признак определяет действия, в случае, если для товара получена нулевая цена
							// или цена не задана (для выбранного типа цен). В случае нахождения таких позиций
							// в табличной части, пользователю будет задан
							// вопрос, о действиях, которые он хочет выполнить. Соответственно: Истина -
							// обнулять суммовые показатели, Ложь - остановить значения как были
							// Неопределено - вопрос пользователю еще не задавался.
							
							Если ТаблицаТоваров <> Неопределено Тогда
								Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
									// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
									Попытка
										ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
									Исключение
										ХарактеристикаНоменклатуры = Неопределено;
									КонецПопытки;
									Попытка
										ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
									Исключение
										ЕдиницаИзмерения = Неопределено;
									КонецПопытки;
									
									Поставщик = Неопределено;
									Закупка = Неопределено;
									Попытка
										Поставщик = ТекСтрока.Поставщик;
										Закупка = Ложь;
									Исключение
										Попытка
											Поставщик = ТекСтрока.ПрайсЛист;
											Закупка = Истина;
										Исключение КонецПопытки; 
									КонецПопытки;
									
									Попытка
										Если Закупка <> Неопределено Тогда
											ВариантПоставки = Новый Структура;
											ВариантПоставки.Вставить("Поставщик",            Поставщик);
											ВариантПоставки.Вставить("Закупка",              Закупка);
											ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
											ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
											ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
											ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
											
											НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
											
											ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
											Если Закупка Тогда
												ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
											Иначе
												ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
												ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
											КонецЕсли;
										Иначе
											НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
										КонецЕсли;
										
										Если НоваяЦена = 0 Тогда
											ОбнулятьСуммовыеПоказатели = Ложь;
											
											Если ОбнулятьСуммовыеПоказатели Тогда
												ТекСтрока.Цена = 0;
											Иначе
												// Если обнулять цену не нужно, и при этом изменилась валюта,
												// то выполним пересчет значения старой цены.
												ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
											КонецЕсли;
										Иначе // Значит сменилась только валюта и необходимо выполнить пересчет.
											//ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
											ТекСтрока.Цена = НоваяЦена;
										КонецЕсли;
										
										Попытка
											ДополнительныеПараметры = Новый Структура;
											ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
											ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
										Исключение 
										КонецПопытки;
									Исключение 
										// При возникших проблемах просто пересчитаем цены
										ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
										Попытка
											ДополнительныеПараметры = Новый Структура;
											ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
											ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
										Исключение 
										КонецПопытки;
									КонецПопытки;
								КонецЦикла;
								Попытка
									НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
								Исключение
									НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
								КонецПопытки; 
								НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
								Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
									ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
									Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
								КонецЕсли;
							Иначе
								Попытка
									НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
								Исключение
									НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
								КонецПопытки; 
								НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
								Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
									ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
									Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
								КонецЕсли; 
							КонецЕсли;
						КонецЕсли;
						
						// Вызовем обработчики документов
						ДополнительныеПараметры = Новый Структура();
						ДополнительныеПараметры.Вставить("ТребуетсяПересчет",Истина);
						ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
						
						ЭтотОбъект.ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма,ДополнительныеПараметры);
						ЭтотОбъект.ОбработкаРеквизита("КурсДокумента",,ЭтаФорма,ДополнительныеПараметры);
						ЭтотОбъект.ОбработкаРеквизита("КурсВалютыУпр",,ЭтаФорма,ДополнительныеПараметры);
						
						// Изменение склада компании приводит к необходимости пересчета скидок документа. 		
						// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
						// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
						Попытка
							ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
						Исключение
							ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
						КонецПопытки;
						
						// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле
						// документа нет, значит он не поддерживает скидки.
						Попытка
							ОбработкаСкидок     = ЭтотОбъект[ИмяПеременнойОбработки];
							ОбработкаСкидок.СкладКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкладКомпании];
							РезультатОбработки    = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
						Исключение
						КонецПопытки;
					КонецЕсли;
				Иначе
					Если ТипЗнч(ЭтотОбъект.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
						Если ЭтотОбъект.СкладКомпании.Розничный Тогда 
							Если ЭтотОбъект.ТипЦен <> ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли Тогда
								ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
								ДополнительныеПараметры = Новый Структура;
								ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как не требуется пересчет
								ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры);
							КонецЕсли; 
						КонецЕсли;
						ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
						Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
							ЭтотОбъект.ТипЦен = ТипЦен;
							ДополнительныеПараметры = Новый Структура;
							ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как не требуется пересчет
							Возврат ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры) И ЭтотОбъект.ОбработкаРеквизита("УстановитьРозничныеЦены",, ЭтаФорма);
						КонецЕсли;
						
						// Изменение склада компании приводит к необходимости пересчета скидок документа. 		
						// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
						// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
						Попытка
							ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
						Исключение
							ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
						КонецПопытки;
						
						// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа
						// нет, значит он не поддерживает скидки.
						Попытка
							ОбработкаСкидок     = ЭтотОбъект[ИмяПеременнойОбработки];
							ОбработкаСкидок.СкладКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкладКомпании];
							РезультатОбработки    = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			#Иначе
				Если ТипЗнч(ЭтотОбъект.СкладКомпании) = Тип("СправочникСсылка.СкладыКомпании") Тогда
					Если ЭтотОбъект.СкладКомпании.Розничный Тогда 
						Если ЭтотОбъект.ТипЦен <> ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли Тогда
							ЭтотОбъект.ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли;
							ДополнительныеПараметры = Новый Структура;
							ДополнительныеПараметры.Вставить("ТребуетсяПересчет", Ложь); // Так как далее их пересчитаем
							ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДополнительныеПараметры);
						КонецЕсли; 
					КонецЕсли;
					ТипЦен = орПолучитьТипЦенДокумента(ЭтотОбъект);
					Если ТипЦен <> Неопределено И ЭтотОбъект.ТипЦен <> ТипЦен Тогда
						ЭтотОбъект.ТипЦен = ТипЦен;
					КонецЕсли;
					НовыйТипЦен = ЭтотОбъект.ТипЦен;
					// Изменяем валюту на валюту типа цен
					// Запомним курс и валюту старую
					СтараяВалюта = ЭтотОбъект.ВалютаДокумента;
					СтарыйКурс = ЭтотОбъект.КурсДокумента;
					НоваяВалюта = обВалютаТипаЦены(Неопределено,ЭтотОбъект.ТипЦен,Ложь);
					// Получаем курс валюты на дату документа
					СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтотОбъект.Дата);
					НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
					// Получим курс упр. на дату документа
					спрВалютаУпр = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
					СтруктураКурса = обКурсДляВалюты(спрВалютаУпр,ЭтотОбъект.Дата);
					НовыйКурсВалютыУпр = СтруктураКурса.Курс/ ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
					
					// Пытаемся позаписывать изменения 
					
					Попытка
						ЭтотОбъект.ВалютаДокумента = НоваяВалюта;
					Исключение КонецПопытки; 
					Попытка
						ЭтотОбъект.КурсДокумента = НовыйКурс;
					Исключение КонецПопытки;
					Попытка
						ЭтотОбъект.КурсВалютыУпр = НовыйКурсВалютыУпр;
					Исключение КонецПопытки;
					
					дкОбработкаРеквизита(ЭтотОбъект,"ВалютаДокумента", ТекСтрока, ЭтаФорма, ДопПараметры);
					// Пересчитаем таблицы документа, сделано всвязи с тем что в документе может и не быть реализован 
					// пересчет при изменении типа цен
					
					Попытка
						ТаблицаТоваров = ЭтотОбъект.Товары;
					Исключение
						ТаблицаТоваров = Неопределено;
					КонецПопытки;
					
					ОбнулятьСуммовыеПоказатели = Неопределено; // Данный признак определяет действия, в случае, если для товара получена нулевая цена
					// или цена не задана (для выбранного типа цен). В случае нахождения таких позиций
					// в табличной части, пользователю будет задан
					// вопрос, о действиях, которые он хочет выполнить. Соответственно: Истина -
					// обнулять суммовые показатели, Ложь - остановить значения как были
					// Неопределено - вопрос пользователю еще не задавался.
					
					Если ТаблицаТоваров <> Неопределено Тогда
						Для Каждого ТекСтрока Из ТаблицаТоваров Цикл
							// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
							Попытка
								ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
							Исключение
								ХарактеристикаНоменклатуры = Неопределено;
							КонецПопытки;
							Попытка
								ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
							Исключение
								ЕдиницаИзмерения = Неопределено;
							КонецПопытки;
							
							Поставщик = Неопределено;
							Закупка = Неопределено;
							Попытка
								Поставщик = ТекСтрока.Поставщик;
								Закупка = Ложь;
							Исключение
								Попытка
									Поставщик = ТекСтрока.ПрайсЛист;
									Закупка = Истина;
								Исключение КонецПопытки; 
							КонецПопытки;
							
							Попытка
								Если Закупка <> Неопределено Тогда
									ВариантПоставки = Новый Структура;
									ВариантПоставки.Вставить("Поставщик",            Поставщик);
									ВариантПоставки.Вставить("Закупка",              Закупка);
									ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
									ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
									ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
									ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
									
									НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
									
									ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
									Если Закупка Тогда
										ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
									Иначе
										ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
										ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
									КонецЕсли;
								Иначе
									НоваяЦена = обПолучитьЦену(НовыйТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, НоваяВалюта, НовыйКурс, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
								КонецЕсли;
								
								Если НоваяЦена = 0 Тогда
									ОбнулятьСуммовыеПоказатели = Ложь;
									
									Если ОбнулятьСуммовыеПоказатели Тогда
										ТекСтрока.Цена = 0;
									Иначе
										// Если обнулять цену не нужно, и при этом изменилась валюта,
										// то выполним пересчет значения старой цены.
										ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
									КонецЕсли;
								Иначе
									ТекСтрока.Цена = НоваяЦена;
								КонецЕсли;
								Попытка
									ДополнительныеПараметры = Новый Структура;
									ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
									ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
								Исключение 
								КонецПопытки;
							Исключение 
								// При возникших проблемах просто пересчитаем цены
								ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);	
								Попытка
									ДополнительныеПараметры = Новый Структура;
									ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
									ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтотОбъект, ДополнительныеПараметры);
								Исключение 
								КонецПопытки;
							КонецПопытки;
						КонецЦикла;
						Попытка
							НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
						Исключение
							НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
						КонецПопытки; 
						НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
						Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
							ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
							Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
						КонецЕсли;
					Иначе
						Попытка
							НоваяСуммаДокумента = ЭтотОбъект.РассчитатьСуммуВсего();
						Исключение
							НоваяСуммаДокумента = ЭтотОбъект.СуммаДокумента;
						КонецПопытки; 
						НоваяСуммаДокумента = обПересчет(НоваяСуммаДокумента, СтараяВалюта, СтарыйКурс, НоваяВалюта, НовыйКурс);
						Если НоваяСуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
							ЭтотОбъект.СуммаДокумента = НоваяСуммаДокумента;
							Попытка ЭтотОбъект.ОбработкаРеквизита("СуммаДокумента"); Исключение КонецПопытки;
						КонецЕсли; 
					КонецЕсли;
				КонецЕсли;
				
				// Вызовем обработчики документов
				ДополнительныеПараметры = Новый Структура();
				ДополнительныеПараметры.Вставить("ТребуетсяПересчет",Истина);
				ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
				
				ЭтотОбъект.ОбработкаРеквизита("ВалютаДокумента",,ЭтаФорма,ДополнительныеПараметры);
				ЭтотОбъект.ОбработкаРеквизита("КурсДокумента",,ЭтаФорма,ДополнительныеПараметры);
				ЭтотОбъект.ОбработкаРеквизита("КурсВалютыУпр",,ЭтаФорма,ДополнительныеПараметры);
				
				// Изменение склада компании приводит к необходимости пересчета скидок документа. 		
				// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
				// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
				Попытка
					ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
				Исключение
					ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
				КонецПопытки;
				
				// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет,
				// значит он не поддерживает скидки.
				Попытка
					ОбработкаСкидок     = ЭтотОбъект[ИмяПеременнойОбработки];
					ОбработкаСкидок.СкладКомпании = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкладКомпании];
					РезультатОбработки    = ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
				Исключение
				КонецПопытки;
			#КонецЕсли
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя = "ТипЦен" Тогда
		ТребуетсяПересчет = Истина;
		Если ДопПараметры <> Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("ТребуетсяПересчет",ТребуетсяПересчет) Тогда
				ТребуетсяПересчет = Истина;
			КонецЕсли; 
		КонецЕсли; 
		Попытка
			// А какие табличные части есть у документа?
			ТаблицаТоваров = ЭтотОбъект.Товары;
		Исключение
			ТаблицаТоваров = Неопределено;
		КонецПопытки;
		// пересчитываем
		Если ТребуетсяПересчет И ТаблицаТоваров <> Неопределено Тогда
			Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
				// Если изменились, тип цен, валюта или курс, то получим цену.
				// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
				Попытка
					ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
				Исключение
					ХарактеристикаНоменклатуры = Неопределено;
				КонецПопытки;
				
				Попытка
					ЕдиницаИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
				Исключение
					ЕдиницаИзмерения = Неопределено;
				КонецПопытки;
				
				Поставщик = Неопределено;
				Закупка = Неопределено;
				Попытка
					Поставщик = СтрокаТоваров.Поставщик;
					Закупка = Ложь;
				Исключение
					Попытка
						Поставщик = СтрокаТоваров.ПрайсЛист;
						Закупка = Истина;
					Исключение КонецПопытки;
				КонецПопытки;
				
				Попытка
					Если Закупка <> Неопределено Тогда
						ВариантПоставки = Новый Структура;
						ВариантПоставки.Вставить("Поставщик",            Поставщик);
						ВариантПоставки.Вставить("Закупка",              Закупка);
						ВариантПоставки.Вставить("КлючСтрокиПоставщика", СтрокаТоваров.КлючСтрокиПоставщика);
						ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", СтрокаТоваров.СрокПоставкиВСтроке));
						ВариантПоставки.Вставить("СтавкаНДС",            СтрокаТоваров.СтавкаНДС);
						ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
						
						НоваяЦена = обПолучитьЦену(ЭтотОбъект.ТипЦен, СтрокаТоваров.Номенклатура, ЭтотОбъект.Ссылка,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
						
						СтрокаТоваров.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
						Если Закупка Тогда
							СтрокаТоваров.ПрайсЛист = ВариантПоставки.Поставщик;
						Иначе
							СтрокаТоваров.Поставщик = ВариантПоставки.Поставщик;
							СтрокаТоваров.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
						КонецЕсли;
					Иначе
						НоваяЦена = обПолучитьЦену(ЭтотОбъект.ТипЦен, СтрокаТоваров.Номенклатура, ЭтотОбъект.Ссылка,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
					КонецЕсли;
					
					Если СтрокаТоваров.Цена <> НоваяЦена Тогда 
						СтрокаТоваров.Цена = НоваяЦена; 
						ДополнительныеПараметры = Новый Структура();
						ДополнительныеПараметры.Вставить("НеРассчитыватьСкидки", Истина);
						ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", СтрокаТоваров, ЭтаФорма, ДополнительныеПараметры);
					КонецЕсли;
				Исключение
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	ИначеЕсли Имя = "ТипЦенРабот" Тогда
		ТребуетсяПересчет = Истина;
		Если ДопПараметры <> Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("ТребуетсяПересчет",ТребуетсяПересчет) Тогда
				ТребуетсяПересчет = Истина;
			КонецЕсли;
		КонецЕсли;
		Попытка
			// А какие табличные части есть у документа?
			ТаблицаРабот = ЭтотОбъект.Работы;
		Исключение
			ТаблицаРабот = Неопределено;
		КонецПопытки;
		// пересчитываем
		Если ТребуетсяПересчет И ТаблицаРабот <> Неопределено Тогда
			
			РеквизитыДокумента = ЭтотОбъект.Метаданные().Реквизиты;
			
			Цех                   = Справочники.Цеха.ОсновнойЦех;
			ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ВидРемонта            = Справочники.ВидыРемонта.ПустаяСсылка();
			Автомобиль            = Справочники.Автомобили.ПустаяСсылка();
			
			Если РеквизитыДокумента.Найти("Цех") = Неопределено Тогда
				Попытка
					Цех = ЭтотОбъект.ДокументОснование.Цех;
				Исключение
				КонецПопытки;
			Иначе
				Цех = ЭтотОбъект.Цех;
			КонецЕсли;
			
			Если РеквизитыДокумента.Найти("ДоговорВзаиморасчетов") = Неопределено Тогда
				Попытка
					ДоговорВзаиморасчетов = ЭтотОбъект.ДокументОснование.ДоговорВзаиморасчетов;
				Исключение
				КонецПопытки;
			Иначе
				ДоговорВзаиморасчетов = ЭтотОбъект.ДоговорВзаиморасчетов;
			КонецЕсли;
			
			Если РеквизитыДокумента.Найти("ВидРемонта") = Неопределено Тогда
				Попытка
					ВидРемонта = ЭтотОбъект.ДокументОснование.ВидРемонта;
				Исключение
				КонецПопытки;
			Иначе
				ВидРемонта = ЭтотОбъект.ВидРемонта;
			КонецЕсли;
			
			Если РеквизитыДокумента.Найти("Автомобиль") = Неопределено Тогда
				Попытка
					Автомобиль = ЭтотОбъект.ДокументОснование.Автомобиль;
				Исключение
				КонецПопытки;
			Иначе
				Автомобиль = ЭтотОбъект.Автомобиль;
			КонецЕсли;
			
			Если ТипЗнч(Автомобиль)=Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(Автомобиль) Тогда
				Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
					Модель = Автомобиль.ВариантКомплектации;
				Иначе
					Модель = Автомобиль.Модель;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Автомобиль)=Тип("СправочникСсылка.Модели") Тогда
				Модель              = Автомобиль;
				ВариантКомплектации = Справочники.ВариантыКомплектации.ПустаяСсылка();
				Если РеквизитыДокумента.Найти("ВариантКомплектации") = Неопределено Тогда
					Попытка
						ВариантКомплектации = ЭтотОбъект.ДокументОснование.ВариантКомплектации;
					Исключение
					КонецПопытки;
				Иначе
					ВариантКомплектации = ЭтотОбъект.ВариантКомплектации;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВариантКомплектации) Тогда
					Модель = ВариантКомплектации;
				КонецЕсли;
			Иначе
				Модель = Справочники.Модели.ПустаяСсылка();
			КонецЕсли;
			
			Для Каждого ТекСтрока Из ТаблицаРабот Цикл
				Попытка
					ЦенаРаботы = орПолучитьЦенуАвтоработы(ЭтотОбъект.ТипЦенРабот, ТекСтрока.Работа, Модель, ДоговорВзаиморасчетов, Цех, ВидРемонта,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента);
					Если ЦенаРаботы.Цена <> 0 Тогда
						ТекСтрока.Нормочас = ЦенаРаботы.Нормочас;
						ТекСтрока.Цена     = ЦенаРаботы.Цена;
						ЭтотОбъект.ОбработкаРеквизита("Работы.Цена", ТекСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Имя = "ХозОперация" Тогда
		//Обработка изменения ХО
		Если ЭтотОбъект.Метаданные().Реквизиты.Найти("ДоговорВзаиморасчетов") <> Неопределено И ЭтотОбъект.Метаданные().Реквизиты.Найти("ХозОперация") <> Неопределено Тогда
			Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) И НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ХозОперация) Тогда
				Попытка ПраваПользователя = ЭтотОбъект.Права; Исключение ПраваПользователя = НЕОПРЕДЕЛЕНО; КонецПопытки;
				Попытка
					СоответствуетХоЗОперации=ЭтотОбъект.ДоговорВзаиморасчетов.ПолучитьОбъект().СоответствуетХозОперации(ЭтотОбъект.ХозОперация);
				Исключение
					СоответствуетХоЗОперации=Истина;
					Ошибка=ОписаниеОшибки();
					ТекстСообщения="Не удалось найти договор взаиморасчетов!
									|	-"+ Ошибка;
					#Если Клиент Тогда
						Сообщить(ТекстСообщения, СтатусСообщения.Важное);
					#КонецЕсли
				КонецПопытки;
				Если НЕ СоответствуетХоЗОперации Тогда
					#Если Клиент Тогда
						Предупреждение("Вид договора не соответствует Хоз.операции.",обПраво("ТаймаутДиалогов",ПраваПользователя,,ЭтотОбъект));
					#КонецЕсли
					ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Имя = "Подготовлен" ИЛИ Имя = "Согласован" ИЛИ Имя = "Утвержден" ИЛИ Имя = "Отклонен" ИЛИ Имя = "История" Тогда
		//Обработка изменения статус документа при утверждении
		#Если Клиент Тогда
			дкОсновныеДействияФормыУтверждение(ЭтаФорма,Имя);
		#КонецЕсли
		
	ИначеЕсли Имя = "КурсВалютыВзаиморасчетов" Тогда
		//Обработка изменения курса валюты взаиморасчетов документа
		спрВалютаДокумента = ЭтотОбъект.ВалютаДокумента;
		спрВалютаРасчетов = ЭтотОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		// если валюта документа и валюта взаиморасчетов совпадают, то установим курс документа таким же,
		// как курс взаиморасчетов
		Если спрВалютаДокумента = спрВалютаРасчетов Тогда
			КурсВзаиморасчетов = ЭтотОбъект.КурсВалютыВзаиморасчетов;
			ЭтотОбъект.КурсДокумента = КурсВзаиморасчетов;
		Иначе
			СтруктураКурса = обКурсДляВалюты(спрВалютаДокумента, ЭтотОбъект.Дата);
			ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		КонецЕсли;
		
	ИначеЕсли Имя = "РассчитатьСкидки" Тогда
		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет,
		// значит он не поддерживает скидки.
		Попытка
			ОбработкаРасчетСкидок = ЭтотОбъект[ИмяПеременнойОбработки];	
		Исключение
			// Не поддерживает. Возвращаем ложь.
			Возврат Ложь;
		КонецПопытки;
		
		// Определяем необходимость расчета шапочных скидок. Данный параметр используется в первую очередь
		// в общей форме "ЦеныИВалюта".
		// При смене валюты возникает необходимость пересчета всей ТЧ. Но невыгодно выполнять
		// подбор шапочной скидки при пересчете каждой строки
		// ,особенно когда подбирается абсолютная скидка (т.к. подбор данного типа скидки ведет
		// опять-таки к пересчету ТЧ. Получается цикл в цикле).
		// Поэтому подбор шапочной скидки выполняется уже после пересчета всей ТЧ. Для этого,
		// в общей форме взводится флаг "НеРассчитыватьСкидки", 
		// а после пересчета табличной части флаг сбрасывается уже в секции "ВалютаДокумента" функции
		// "дкОбработкаРеквизита".
		
		Если ДопПараметры = Неопределено Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;

		Если НЕ дкДокументЕстьРеквизитШапки(ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка, ЭтотОбъект.Метаданные().Имя) Тогда
			Возврат Истина;
		КонецЕсли;

		Попытка
			НеРассчитыватьСкидки = ДопПараметры.НеРассчитыватьСкидки;
		Исключение 
			НеРассчитыватьСкидки = Ложь;
		КонецПопытки;

		Попытка
			БлокироватьПерерасчетСкидок = ЭтотОбъект.БлокироватьПерерасчетСкидок;
		Исключение
			БлокироватьПерерасчетСкидок = Ложь;
		КонецПопытки;
		
		НеВыполнятьКонтрольПустойСкидки = Ложь;
		Если ДопПараметры.Свойство("НеВыполнятьКонтрольПустойСкидки") Тогда
			НеВыполнятьКонтрольПустойСкидки = ДопПараметры.НеВыполнятьКонтрольПустойСкидки;
		КонецЕсли;
		
		// Подбираем подходяющую скидку. Если скидка не изменилась, то функция вернет Ложь.
		Если БлокироватьПерерасчетСкидок Тогда
			Если ТекСтрока = Неопределено Тогда
				Попытка
					Если НЕ НеВыполнятьКонтрольПустойСкидки И НЕ ЗначениеЗаполнено(ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка]) Тогда
						Для Каждого стрДок Из ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти] Цикл
							стрДок.ПроцентСкидки = 0;
							ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".ПроцентСкидки", стрДок, ЭтаФорма);
						КонецЦикла;
					КонецЕсли;
				Исключение
				КонецПопытки;
			Иначе
				Если НЕ НеВыполнятьКонтрольПустойСкидки И НЕ ЗначениеЗаполнено(ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка]) Тогда
					ТекСтрока.ПроцентСкидки = 0;
					ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".ПроцентСкидки", ТекСтрока, ЭтаФорма);
				КонецЕсли;
				
				ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".ПроцентСкидки", ТекСтрока, ЭтаФорма);
				Попытка
					ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".ПроцентСкидкиСтроки", ТекСтрока, ЭтаФорма);
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			Возврат Истина;
		ИначеЕсли (НЕ НеРассчитыватьСкидки) И ОбработкаРасчетСкидок.ПодобратьСкидку(ЭтотОбъект) Тогда
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка]   = ОбработкаРасчетСкидок.ТекущаяСкидкаНаценка;
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаЗначениеСкидкиНаценки] = ОбработкаРасчетСкидок.ТекущееЗначениеСкидки;
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = ОбработкаРасчетСкидок.ТекущаяСуммаСкидки;
			
			// Подобралась другая "шапочная" скидка, значит, возможно, придется заблокировать работу с некоторыми колонками 
			// в зависимости от типа скидки.
			#Если Клиент Тогда
				Если ЭтаФорма <> Неопределено Тогда
					дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма, ОбработкаРасчетСкидок.ТекущаяСкидкаНаценка, ОбработкаРасчетСкидок.ИмяТабличнойЧасти);	
					
					// Если это АРМ Продавца, то у него на форме два табличных поля, отображающих ТЧ "Товары".
					Если Не ПустаяСтрока(ОбработкаРасчетСкидок.ИмяДополнительногоТабличногоПоля) Тогда
						дкУправлениеДоступностьюКолонокСкидок(ЭтаФорма, ОбработкаРасчетСкидок.ТекущаяСкидкаНаценка, ОбработкаРасчетСкидок.ИмяДополнительногоТабличногоПоля);			
					КонецЕсли;
				КонецЕсли;
			#КонецЕсли
			
			// Применяем скидку к табличной части. Пересчитываем строчные скидки.
			ОбработкаРасчетСкидок.ПрименитьСкидку(ЭтотОбъект);
			
			// Получаем сумму всех скидок документа (с учетом строчных).
			СуммаИтого = 0;
			Попытка	// Документ может поддерживать только шапочные скидки, а значит в ТЧ не будет реквизита "СуммаСкидкиСтроки".
				СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки")
			Исключение
			КонецПопытки;
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] + СуммаИтого;
			
			#Если Клиент Тогда
				// Формируем строку для отображения на форме.
				Если ЭтаФорма <> Неопределено Тогда
					дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
				КонецЕсли; 
			#КонецЕсли 
		Иначе // Просто пересчитываем значение суммы скидки для текущей строки.
			Если ТекСтрока <> Неопределено Тогда
				// Подбираем скидку для текущей строки (скидка на товар).
				Если Не ОбработкаРасчетСкидок.НеРассчитыватьСтрочныеСкидки Тогда
					ОбработкаРасчетСкидок.ПодобратьСтрочнуюСкидку(ЭтотОбъект, ТекСтрока);
					ТекСтрока.СкидкаНаТовар  = ОбработкаРасчетСкидок.ТекущаяСкидкаСтроки;
					ТекСтрока.ПроцентСкидкиСтроки = ОбработкаРасчетСкидок.ТекущийПроцентСкидкиСтроки;
					ТекСтрока.СуммаСкидкиСтроки = ОбработкаРасчетСкидок.ТекущаяСуммаСкидкиСтроки;
				КонецЕсли; 
				
				// Рассчитываем "шапочную" скидку для текущей строки. За одно рассчитаем общую сумму скидки на документ.
				Если ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка].СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная Тогда
					ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".СуммаСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
				Иначе
					ЭтотОбъект.ОбработкаРеквизита(ОбработкаРасчетСкидок.ИмяТабличнойЧасти + ".ПроцентСкидки", ТекСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
			Иначе
				// Если произошла смена типа скидки, но значение скидки не изменилась, то пересчитывать ТЧ нет необходимости, но
				// сохранить новый тип скидки нужно.
				Если НЕ НеРассчитыватьСкидки Тогда
					ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСкидкаНаценка] = ОбработкаРасчетСкидок.ТекущаяСкидкаНаценка;
				КонецЕсли;
				
				// 
				СуммаИтого = 0;
				СуммаИтого = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидки");
				
				Попытка // Документ может поддерживать только шапочные скидки, а значит в ТЧ не будет реквизита "СуммаСкидкиСтроки".
					СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки")
				Исключение
				КонецПопытки;
				
				ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = СуммаИтого;
			КонецЕсли;
		КонецЕсли;
		
		Возврат Истина;
		
		// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
		//
		// СТЕК ВЫЗОВОВ.
		//	1. Товары.Номенклатура
		//		- Товары.ХарактеристикаНоменклатуры (Если в табличной части используются характеристики)
		//		- Товары.ЕдиницаИзмерения
		//
		// 2. Товары.ХарактеристикаНоменклатуры
		//		- Товары.Цена (Если получена цена, отличающаяся от текущей).
		//
		// 3. Товары.Количество
		//  - Товары.Коэффициент
		//
		// 4. Товары.ЕдиницаИзмерения
		// 	- Товары.Коэффициент
		//
		// 5. Товары.Коэффициент
		//  - Товары.КоличествоБазовое (Если в ТЧ есть реквизит "КоличествоБазовое") ИЛИ Товары.Цена
		//
		// 6. Товары.КоличествоБазовое
		//  - Товары.Цена
		//
		// 7. Товары.Цена 
		//  - Товары.Сумма
		//
		// 8. Товары.Сумма
		//  - РассчитатьСкидки: В данной секции производится подбор и применение шапочных (на весь документ)
		//  и строчных (товарных) скидок.
		//  Если происходит смена шапочной скидки или базы для расчета шапочной скидки,
		//  то выполняется пересчет всей табличной части 
		//  с вызовом "Товары.СтавкаНДС" для каждой строки ТЧ. Если скидка не изменилась
		//  (в т.ч. когда документ не поддерживает работу со скидками),
		//  вызов данной секции вернет ЛОЖЬ и продолжится обработка только текущей строки ТЧ.
		//
		//  - Товары.СтавкаНДС (Если вызов "РассчитатьСкидки" вернет Ложь)
		//
		// 9. Товары.ПроцентСкидки (вызывается в случае ручного редактирования пользователем значения процента скидки)
		//  - Товары.СуммаСкидки
		//
		// 10. Товары.СуммаСкидки
		//  - Товары.СтавкаНДС
		//
		// 11. Товары.СкидкаНаТовар (ручное изменение товарной скидки)
		//  - Товары.СтавкаНДС
		//
		// 12. Товары.ПроцентСкидкиСтроки (вызывается в случае ручного редактирования пользователем
		//     значения процента товарной скидки)
		//  - Товары.СуммаСкидкиСтроки
		//
		// 13. Товары.СуммаСкидкиСтроки
		//  - Товары.СтавкаНДС
		//
		// 14. Товары.СтавкаНДС 
		//  - Товары.СуммаНДС
		//
		// 15. Товары.СуммаНДС
		//
		// 16. Товары.СуммаВсего
		// (последняя секция. Здесь производится обратный расчет суммовых реквизитов ТЧ,
		// НО БЕЗ ВЫЗОВА соответствующих секций функций).
		//
	ИначеЕсли Имя = "Товары.Номенклатура" Тогда
		
		Рез = Истина;
		
		Оповещение = Ложь;
		СтрокиКУдалению = Новый Массив;
		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается от
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет,
		// значит он не поддерживает скидки.
		Попытка
			ОбработкаСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
		Исключение
			ОбработкаСкидок = Неопределено;
		КонецПопытки;
		
		Если ОбработкаСкидок <> Неопределено Тогда
			Попытка
				СкидкаНаценка = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаСкидкаНаценка];
				Если (Не СкидкаНаценка.Пустая()) И (СкидкаНаценка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная) Тогда
					ТекСтрока.ПроцентСкидки = ЭтотОбъект[ОбработкаСкидок.ИмяРеквизитаЗначениеСкидкиНаценки];
				Иначе	
					ТекСтрока.ПроцентСкидки = 0;
				КонецЕсли;
			
				// Сбросим значения скидки строки, если таковые имеются.
				// В ТЧ может не быть реквизитов строчных скидок...
				ТекСтрока.СкидкаНаТовар  = Справочники.ТипыСкидок.ПустаяСсылка();
				ТекСтрока.ПроцентСкидкиСтроки = 0;
				ТекСтрока.СуммаСкидкиСтроки = 0;
			Исключение
			КонецПопытки;
		Конецесли;
		
		// проверим а не набор ли у нас...
		Если ТипЗнч(ТекСтрока.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") ИЛИ ТекСтрока.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Набор Тогда
			Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.ЗаявкаНаХранениеШин") Тогда
				ИмяТабличнойЧасти = "Товары";
				Если ДопПараметры <> Неопределено Тогда
					ДопПараметры.Свойство("ИмяТабличнойЧасти",ИмяТабличнойЧасти);
				КонецЕсли;
				Попытка БлокироватьВидыНоменклатуры = ЭтотОбъект.ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры(ИмяТабличнойЧасти); Исключение БлокироватьВидыНоменклатуры = Неопределено; КонецПопытки;
			Иначе
				Попытка БлокироватьВидыНоменклатуры = ЭтотОбъект.ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры(); Исключение БлокироватьВидыНоменклатуры = Неопределено; КонецПопытки;
			КонецЕсли;
			Если БлокироватьВидыНоменклатуры <> Неопределено И ТипЗнч(БлокироватьВидыНоменклатуры) = Тип("Соответствие") И БлокироватьВидыНоменклатуры.Количество() > 0 Тогда
				Попытка ЕстьОшибка = (БлокироватьВидыНоменклатуры[ТекСтрока.Номенклатура.ВидНоменклатуры] <> Неопределено); Исключение ЕстьОшибка = Ложь; КонецПопытки;
				Если ЕстьОшибка Тогда
					#Если Клиент Тогда
						Оповещение = Истина;
						СтрокиКУдалению.Добавить(ТекСтрока);
						
						Предупреждение("В таблицу нельзя вводить номенклатуру вида """ + СокрЛП(ТекСтрока.Номенклатура.ВидНоменклатуры) + """",5);
					#КонецЕсли
					ТекСтрока.Номенклатура = Неопределено;
				КонецЕсли;
			КонецЕсли;
				
			// проверим возможность операций с номенклатурой
			Попытка
				ЭтоНеМатериалы = (ДопПараметры.ИмяТаблицы <> "МатериалыЗаказчика");
			Исключение
				ЭтоНеМатериалы = Истина;
			КонецПопытки;
			
			Если ЭтоНеМатериалы Тогда
				РезПроверки = дкПроверитьВозможностьОперацийСНоменклатурой(ТекСтрока,ЭтаФорма, ЭтотОбъект);
				
				Если РезПроверки.ЕстьБлок Тогда
					ТекСтрока.Номенклатура = Неопределено;
				КонецЕсли;
				
				Если (РезПроверки.ЕстьПредупреждение ИЛИ РезПроверки.ЕстьБлок) И НЕ ПустаяСтрока(РезПроверки.Сообщение) Тогда
					Сообщить(РезПроверки.Сообщение,СтатусСообщения.Внимание);
				КонецЕсли;
			КонецЕсли;
			
			// установим количество
			Попытка
				Если ТекСтрока.Количество = 0 Тогда ТекСтрока.Количество = 1 КонецЕсли;
			Исключение КонецПопытки;
			
			// Заполним ставку НДС
			Попытка // попробуем получить из вида ремонта значение ОсвобожденОтНДСПоРемонту
				ОсвобожденОтНДСПоРемонту = ЭтотОбъект.ВидРемонта.ОсвобожденОтНДС;
			Исключение
				ОсвобожденОтНДСПоРемонту= Ложь;
			КонецПопытки;
			
			ЕстьСтавкаНДС = Ложь;
			Попытка
				СтавкаНДС = ТекСтрока.СтавкаНДС;
				ЕстьСтавкаНДС = Истина;
			Исключение
			КонецПопытки;
			
			Если ЕстьСтавкаНДС Тогда
				Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
					Если ЭтотОбъект.Метаданные().Реквизиты.Найти("Контрагент") = Неопределено Тогда
						ОсвобожденОтНДС = Ложь;
					Иначе
						ОсвобожденОтНДС = ЭтотОбъект.Контрагент.ОсвобожденОтНДС;
					КонецЕсли;
				Иначе
					ОсвобожденОтНДС = (ЭтотОбъект.Метаданные().Реквизиты.Найти("ПодразделениеКомпании")<>Неопределено И ЭтотОбъект.ПодразделениеКомпании.ОсвобожденОтНДС) ИЛИ
					(ЭтотОбъект.Метаданные().Реквизиты.Найти("Организация")<>Неопределено И ЭтотОбъект.Организация.ОсвобожденОтНДС) ИЛИ
					ОсвобожденОтНДСПоРемонту;
				КонецЕсли;
				Если ОсвобожденОтНДС Тогда
					СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
					СтавкаНДС = ТекСтрока.Номенклатура.СтавкаНДС; 
				ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
					СтавкаНДС = ТекСтрока.Номенклатура.Номенклатура.СтавкаНДС; 
				Иначе
					СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
				КонецЕсли;
				Попытка	// а вдруг в ТЧ документа нет ставки НДС
					ТекСтрока.СтавкаНДС = СтавкаНДС;
				Исключение КонецПопытки;
			КонецЕсли;
			
			// Расчет цены. Цена зависит от трех реквизитов табличной части: номенклатура,
			// характеристика номенклатуры и единица измерения.
			// Изменение одного из них ведет к пересчету цены. Поэтому, чтобы не происходило тройного
			// расчета цен (в худшем случае), в доп. параметры
			// мы передадим признак отказа от пересчета цены.
			ПересчитатьЦену = Истина; // Из заказ наряда может прийти отказ от пересчета цен, так как там самостоятельно получается цена после обработки номенклатуры!
			Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
				Если ДопПараметры.Свойство("ПересчитатьЦену") Тогда
					ПересчитатьЦену = ДопПараметры.ПересчитатьЦену;
					ДопПараметры.ПересчитатьЦену = Ложь;
				Иначе
					ДопПараметры.Вставить("ПересчитатьЦену", Ложь);
				КонецЕсли;
			Иначе
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("ПересчитатьЦену", Ложь);
			КонецЕсли;
			
			// ХАРАКТЕРИСТИКА: сбросим характеристику, если она не подходит
			Попытка	// В ТЧ может не существовать реквизита Характеристика
				Если НЕ ТекСтрока.ХарактеристикаНоменклатуры.Пустая() Тогда
					Если (ТекСтрока.ХарактеристикаНоменклатуры.Владелец <> ТекСтрока.Номенклатура) И (ТекСтрока.ХарактеристикаНоменклатуры.Владелец <> ТекСтрока.Номенклатура.ТипНоменклатуры) Тогда
						ТекСтрока.ХарактеристикаНоменклатуры = Неопределено;
						ЭтотОбъект.ОбработкаРеквизита("Товары.ХарактеристикаНоменклатуры",ТекСтрока,ЭтаФорма,ДопПараметры);
					КонецЕсли;
				КонецЕсли; 
				ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры; 
			Исключение 
				ХарактеристикаНоменклатуры = Неопределено;
			КонецПопытки;
			
			// ЕД. ИЗМЕРЕНИЯ: заполним единицу измерения
			НоваяЕдиницаИзмерения = Неопределено;
			Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
				ДопПараметры.Свойство("ЕдиницаИзмерения",НоваяЕдиницаИзмерения);
			КонецЕсли; 
			Если НоваяЕдиницаИзмерения = Неопределено Тогда
				Попытка
					ТекЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
					Если (ТекЕдиницаИзмерения.Владелец = ТекСтрока.Номенклатура) ИЛИ (ТекЕдиницаИзмерения.Владелец = ТекСтрока.Номенклатура.ТипНоменклатуры) Тогда
						НоваяЕдиницаИзмерения = ТекЕдиницаИзмерения;
					Иначе
						НоваяЕдиницаИзмерения = ТекСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
					КонецЕсли;
				Исключение
					Попытка
						НоваяЕдиницаИзмерения = ТекСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
					Исключение
						НоваяЕдиницаИзмерения = Неопределено;
					КонецПопытки;
				КонецПопытки;
			КонецЕсли; 
			
			// обработаем изменение единицы измерения
			Попытка // В ТЧ может не существовать реквизита ЕдиницаИзмерения
				ТекСтрока.ЕдиницаИзмерения = НоваяЕдиницаИзмерения;
				ЭтотОбъект.ОбработкаРеквизита("Товары.ЕдиницаИзмерения",ТекСтрока,ЭтаФорма,ДопПараметры);
				ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
			Исключение
				ЕдиницаИзмерения = Неопределено;
			КонецПопытки;
			
			ДопПараметры.Удалить("ПересчитатьЦену");
			
			// ЦЕНА: Непосредственно самое получение цены. Сначала пытаемся получить тип цен.
			Если ПересчитатьЦену Тогда
			
				Попытка
					МоментЦены = ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени());
				Исключение
					МоментЦены = Неопределено;
				КонецПопытки;
				
				ТипЦен = Неопределено;
				Попытка 
					ТипЦен = ЭтотОбъект.ТипЦен; 
				Исключение 
					Попытка ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли; Исключение КонецПопытки;
				КонецПопытки;
				
				// ПОСТАВЩИК:
				// В ТЧ может не существовать реквизита Поставщик
				Поставщик = Неопределено;
				Закупка = Неопределено;
				Попытка
					Поставщик = ТекСтрока.Поставщик;
					Закупка = Ложь;
				Исключение
					Попытка
						Поставщик = ТекСтрока.ПрайсЛист;
						Закупка = Истина;
					Исключение КонецПопытки; 
				КонецПопытки;
				
				Попытка
					Если Закупка <> Неопределено Тогда
						ВариантПоставки = Новый Структура;
						ВариантПоставки.Вставить("Поставщик",            Поставщик);
						ВариантПоставки.Вставить("Закупка",              Закупка);
						ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
						ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
						ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
						#Если Клиент Тогда
							ВариантПоставки.Вставить("ИнтерактивныйВвод", Истина);
						#Иначе
							ВариантПоставки.Вставить("ИнтерактивныйВвод", Ложь);
						#КонецЕсли
						
						Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
							ПолученнаяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							Если ПолученнаяЦена = 0 Тогда
								ТекСтрока.Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура,МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							Иначе
								ТекСтрока.Цена = ПолученнаяЦена;
							КонецЕсли
						Иначе
							ТекСтрока.Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
						КонецЕсли;
						
						ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
						Если Закупка Тогда
							ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
						Иначе
							ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
							ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
						КонецЕсли;
					Иначе
						// попытаемся получить цену по типу цены
						Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
							ПолученнаяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							Если ПолученнаяЦена = 0 Тогда
								ТекСтрока.Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура,МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							Иначе
								ТекСтрока.Цена = ПолученнаяЦена;
							КонецЕсли
						Иначе
							ТекСтрока.Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
						КонецЕсли;
					КонецЕсли;
					
					Рез = ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
					
				Исключение КонецПопытки;
			КонецЕсли;
			
			//Обработка отображения интерфейса
			#Если Клиент Тогда
				Если ЭтаФорма <> Неопределено Тогда
					// покажем если надо колонку "характеристика номенклатуры"
					Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
						ТипНоменклатуры = ТекСтрока.Номенклатура.ТипНоменклатуры;
						Если обПраво("АвтоматическиСкрыватьКолонкуХарактеристик",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
							Попытка
								Если НЕ ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость Тогда
									ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость = (ТипНоменклатуры.ИспользованиеХарактеристик = 1 ИЛИ ТипНоменклатуры.ИспользованиеХарактеристик = 2);
								КонецЕсли; 
							Исключение
							КонецПопытки; 
						КонецЕсли;
						//установим свойства колонки характеристик в зависимости от типа номенклатуры
						РучноеСписаниеХарактеристик = (ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание ИЛИ ТипНоменклатуры.АвтоСписаниеХарактеристик.Пустая());
						Попытка  
							ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ЭлементУправления.ОтметкаНезаполненного = РучноеСписаниеХарактеристик;
							ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ПропускатьПриВводе = НЕ РучноеСписаниеХарактеристик;
						Исключение
						КонецПопытки; 
						
						Попытка
							Если ЭтаФорма.ЭлементыФормы.Товары.Колонки.Найти("КодыМаркировки") <> Неопределено
								И НЕ ЭтаФорма.ЭлементыФормы.Товары.Колонки.КодыМаркировки.Видимость Тогда
								ЭтоМаркируемаяНоменклатура = дкЭтоМаркируемаяНоменклатура(ТекСтрока.Номенклатура);
								ЭтаФорма.ЭлементыФормы.Товары.Колонки.КодыМаркировки.Видимость = ЭтоМаркируемаяНоменклатура;
							КонецЕсли;
						Исключение
						КонецПопытки;
						
					Иначе
						Попытка
							Если НЕ ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость Тогда
								ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.Видимость = Ложь;
							КонецЕсли; 
							ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ЭлементУправления.ОтметкаНезаполненного = Ложь;
							ЭтаФорма.ЭлементыФормы.Товары.Колонки.ХарактеристикаНоменклатуры.ПропускатьПриВводе = Истина;
						Исключение
						КонецПопытки; 
					КонецЕсли; 
					
				КонецЕсли; 
			#КонецЕсли
			// Подстановка ячейки
			Попытка
				Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) ИЛИ обЗначениеНеЗаполнено(ЭтотОбъект.СкладКомпании) Тогда
					ТекСтрока.Ячейка=Справочники.ЯчейкиХранения.ПустаяСсылка();
				Иначе
					ЯчейкаСсылка=Справочники.Номенклатура.ПолучитьЯчейкуХранения(ТекСтрока.Номенклатура,ЭтотОбъект.СкладКомпании);
					ТекСтрока.Ячейка=ЯчейкаСсылка;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
		Иначе
			// имеем дело с набором, разложим его...
			Набор = ТекСтрока.Номенклатура; КоличествоНаборов = 1;
			
			ВвестиКоличествоНаборов = Истина;
			Попытка
				Если НЕ ДопПараметры.Свойство("ВвестиКоличествоНаборов",ВвестиКоличествоНаборов) Тогда
					ВвестиКоличествоНаборов = Истина;
				КонецЕсли;
			Исключение
			КонецПопытки;
			ВвестиКоличествоНабора = ?(ВвестиКоличествоНаборов = Неопределено, Истина, ВвестиКоличествоНаборов);
			Попытка
				КоличествоНаборов = ТекСтрока.Количество;
			Исключение
				ВвестиКоличествоНаборов = Ложь;
			КонецПопытки;
			Если ВвестиКоличествоНаборов Тогда
				#Если Клиент Тогда
					Если НЕ ВвестиЧисло(КоличествоНаборов, "Введите количество наборов", 2) Тогда
						КоличествоНаборов = 0;
					КонецЕсли;
				#КонецЕсли
			КонецЕсли;
			
			// Если КоличествоНабора = 0 Тогда КоличествоНаборов = 1; КонецЕсли; 
			// удалим строку из табличной части
			ТабличнаяЧастьТовары = Неопределено;
			Попытка
				Если НЕ ДопПараметры.Свойство("ТабличнаяЧастьТовары",ТабличнаяЧастьТовары) Тогда
					ТабличнаяЧастьТовары = ЭтотОбъект.Товары;
				КонецЕсли;
			Исключение
				ТабличнаяЧастьТовары = ЭтотОбъект.Товары;
			КонецПопытки;
			#Если Клиент Тогда
			Если ЭтаФорма<>Неопределено Тогда
				Попытка
					ЭтаФорма.ЭлементыФормы.Товары.ЗакончитьРедактированиеСтроки(Ложь);
				Исключение
				КонецПопытки; 
			КонецЕсли;
			#КонецЕсли
			ТабличнаяЧастьТовары.Удалить(ТекСтрока);
			Если КоличествоНаборов = 0 Тогда Возврат Ложь; КонецЕсли; 
			// теперь будем рекурсивно добавлять состав набора
			Для Каждого ТоварИзНабора Из Набор.СоставНабора Цикл
				Если ТоварИзНабора.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
					//Вот это да, набор в наборе ... игнорируем
					#Если Клиент Тогда
						Сообщить("В наборе """ + СокрЛП(Набор) + """ присутствует набор """ + СокрЛП(ТоварИзНабора.Номенклатура) + """. Добавление набора """ + СокрЛП(ТоварИзНабора.Номенклатура) + """ отменено.",СтатусСообщения.Внимание);
					#КонецЕсли
				Иначе
					// поищем номенклатуру из набора в таблице товаров
					МассивСтрок = ТабличнаяЧастьТовары.НайтиСтроки(Новый Структура("Номенклатура",ТоварИзНабора.Номенклатура));
					Если МассивСтрок.Количество() > 0 Тогда
						//Если добавляемая номенклатура уже есть в табличной части
						//просто увеличим количество, если его запрашивать не надо
						СтрокаТЧ = МассивСтрок[0];
						Попытка
							СтрокаТЧ.Количество = СтрокаТЧ.Количество + (ТоварИзНабора.Количество*КоличествоНаборов/?(СтрокаТЧ.Коэффициент = 0,1,СтрокаТЧ.Коэффициент));
						Исключение КонецПопытки; // количества может и не быть
					Иначе
						СтрокаТЧ = ТабличнаяЧастьТовары.Добавить();
						СтрокаТЧ.Номенклатура = ТоварИзНабора.Номенклатура;
						ТекРез = ЭтотОбъект.ОбработкаРеквизита("Товары.Номенклатура",СтрокаТЧ,ЭтаФорма,ДопПараметры);
						Если НЕ ТипЗнч(ТекРез) = Тип("Булево") Тогда
							ТекРез = Истина;
						КонецЕсли;
						Рез = ТекРез И Рез;
						Попытка
							Коэффициент = ?(СтрокаТЧ.Коэффициент = 0,1,СтрокаТЧ.Коэффициент);
						Исключение
							Коэффициент = 1;
						КонецПопытки; 
						Попытка
							СтрокаТЧ.Количество = ТоварИзНабора.Количество*КоличествоНаборов/Коэффициент;
						Исключение КонецПопытки; // количества может и не быть
					КонецЕсли; 
					Попытка
						Рез = ЭтотОбъект.ОбработкаРеквизита("Товары.Количество",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					Исключение КонецПопытки; // количества может и не быть
					Попытка
						Рез = ЭтотОбъект.ОбработкаРеквизита("Товары.РасчетРазницы",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					Исключение КонецПопытки; // только для документов Акт разногласий и корректировка реализации
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			НайденнаяМаркировка = ЭтотОбъект.КодыМаркировки.НайтиСтроки(Новый Структура("ИдентификаторТовара", ТекСтрока.ИдентификаторТовара));
			Если НайденнаяМаркировка.Количество() > 0 Тогда
				УдалятьМаркировку = Истина;
				Если дкЭтоМаркируемаяНоменклатура(ТекСтрока.Номенклатура) Тогда
					#Если Клиент Тогда
						Если Вопрос("Для данной строки указаны коды маркировки. Удалить считанные коды маркировки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
							УдалятьМаркировку = Ложь;
							ДопПараметры.Вставить("ОткрытьФормуСканированияМаркировки", Ложь);
						КонецЕсли;
					#КонецЕсли
				КонецЕсли;
				Если УдалятьМаркировку Тогда
					Для Каждого ТекущаяМаркировка Из НайденнаяМаркировка Цикл
						ЭтотОбъект.КодыМаркировки.Удалить(ТекущаяМаркировка);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		// запретим выбор прослеживаемых и маркируемых товаров в документы комиссии
		дкПроверитьНоменклатуруДляКомиссионныхДокументов(ЭтотОбъект.ХозОперация, ТекСтрока);
		
		#Если Клиент Тогда
		// Откроем форму сканирования маркировки
		Попытка
			Если ТипЗнч(ДопПараметры) = Тип("Структура")
				И ДопПараметры.Свойство("ОткрытьФормуСканированияМаркировки")
				И ДопПараметры.ОткрытьФормуСканированияМаркировки Тогда
				дкОткрытьФормуСканированияМаркировки(ЭтаФорма, ТекСтрока);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		// Предложим выбрать связанную номенклатуру
		Если НЕ ТекСтрока = Неопределено Тогда
			Если ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ЗаказКодовМаркировки")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ВводВОборотКодовМаркировки")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ВыводИзОборотаКодовМаркировки")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ОтгрузкаТоваровКодовМаркировки")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ВозвратВОборотКодовМаркировки")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.Перемаркировка")
				И ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.СписаниеКодовМаркировки") Тогда
				ФормаВыбора = Обработки.ПодборРабот.ПолучитьФорму("ФормаПодбораСвязанныхРабот",ЭтаФорма);
				Попытка
					ФормаВыбора.НачальноеЗначениеВыбора=ТекСтрока.Номенклатура;
					ФормаВыбора.КоличествоРабот=?(ДопПараметры.Свойство("Количество"), ДопПараметры.Количество, 1);
					ФормаВыбора.РежимВыбора=Истина;
					ФормаВыбора.Открыть();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

		Если Оповещение Тогда
			Оповестить("УдалитьСтрокиСЗапрещеннымиВидамиНоменклатруыПослеПодбораАвторабот", СтрокиКУдалению, ЭтотОбъект);
		КонецЕсли; 
		#КонецЕсли
		
		Возврат Рез;
		
	ИначеЕсли Имя = "Товары.ХарактеристикаНоменклатуры" Тогда
		РезультатОбработки = орХарактеристикаНоменклатурыПриИзменении(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		РезультатОбработки = ?(РезультатОбработки = Неопределено,Истина,РезультатОбработки);
		дкПроверитьКорректностьКоличества(ЭтотОбъект,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		// ЦЕНА: Пересчитываем цену.
		Попытка // Определяем, а нужно ли вообще пересчитывать цену.
			ПересчитатьЦену = ДопПараметры.ПересчитатьЦену;
		Исключение 
			ПересчитатьЦену = Истина;
		КонецПопытки;
		Если ПересчитатьЦену Тогда
			// Получаем тип цен.
			ТипЦен = Неопределено;
			Попытка 
				ТипЦен = ЭтотОбъект.ТипЦен; 
			Исключение 
				Попытка ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли; Исключение КонецПопытки;
			КонецПопытки;
			Если (ТипЦен <> Неопределено) И (ТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоХарактеристике) Тогда
				Попытка
					МоментЦены = ?(ЭтотОбъект.ЭтоНовый(),ЭтотОбъект.Дата,ЭтотОбъект.МоментВремени());
				Исключение
					МоментЦены = Неопределено;
				КонецПопытки;
				
				ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
				
				Попытка
					ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
				Исключение
					ЕдиницаИзмерения = Неопределено;
				КонецПопытки;
				
				Поставщик = Неопределено;
				Закупка = Неопределено;
				Попытка
					Поставщик = ТекСтрока.Поставщик;
					Закупка = Ложь;
				Исключение
					Попытка
						Поставщик = ТекСтрока.ПрайсЛист;
						Закупка = Истина;
					Исключение КонецПопытки; 
				КонецПопытки;
				
				Попытка
					Если Закупка <> Неопределено Тогда
						ВариантПоставки = Новый Структура;
						ВариантПоставки.Вставить("Поставщик",            Поставщик);
						ВариантПоставки.Вставить("Закупка",              Закупка);
						ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
						ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
						ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
						ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
						
						Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
							НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							Если НоваяЦена = 0 Тогда
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							КонецЕсли
						Иначе
							НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
						КонецЕсли;
						
						ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
						Если Закупка Тогда
							ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
						Иначе
							ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
							ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
						КонецЕсли;
					Иначе
						Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
							НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
							Если НоваяЦена = 0 Тогда
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
							КонецЕсли
						Иначе
							НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
						КонецЕсли; 
					КонецЕсли;
					Если НоваяЦена > 0 И ТекСтрока.Цена <> НоваяЦена Тогда
						ТекСтрока.Цена = НоваяЦена;
						РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
					КонецЕсли;
				Исключение КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
		
		Возврат РезультатОбработки;
		
	ИначеЕсли Имя = "Товары.Количество" Тогда
		дкПроверитьКорректностьКоличества(ЭтотОбъект,ТекСтрока,ЭтаФорма,ДопПараметры);
		РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Коэффициент",ТекСтрока,ЭтаФорма,ДопПараметры) И РезультатОбработки;
		
	ИначеЕсли Имя = "Товары.ЕдиницаИзмерения" Тогда
		Если Не ТекСтрока.ЕдиницаИзмерения.Пустая() Тогда
			ТекСтрока.Коэффициент = ТекСтрока.ЕдиницаИзмерения.Коэффициент;
			
			// ЦЕНА: Пересчитываем цену.
			Попытка // Определяем, а нужно ли вообще пересчитывать цену.
				ПересчитатьЦену = ДопПараметры.ПересчитатьЦену;
			Исключение 
				ПересчитатьЦену = Истина;
			КонецПопытки;
			Если ПересчитатьЦену Тогда
				// Получаем тип цен.
				ТипЦен = Неопределено;
				Попытка 
					ТипЦен = ЭтотОбъект.ТипЦен; 
				Исключение 
					Попытка ТипЦен = ЭтотОбъект.СкладКомпании.ТипЦенРозничнойТорговли; Исключение КонецПопытки;
				КонецПопытки;
				Если (НЕ ТипЦен = Неопределено) И ТипЦен.АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
					Попытка
						МоментЦены = ?(ЭтотОбъект.ЭтоНовый(),ЭтотОбъект.Дата,ЭтотОбъект.МоментВремени());
					Исключение
						МоментЦены = Неопределено;
					КонецПопытки;
					
					Попытка
						ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
					Исключение
						ХарактеристикаНоменклатуры = Неопределено;
					КонецПопытки;
					
					ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
					
					Поставщик = Неопределено;
					Закупка = Неопределено;
					Попытка
						Поставщик = ТекСтрока.Поставщик;
						Закупка = Ложь;
					Исключение
						Попытка
							Поставщик = ТекСтрока.ПрайсЛист;
							Закупка = Истина;
						Исключение КонецПопытки; 
					КонецПопытки;
					
					Попытка
						Если Закупка <> Неопределено Тогда
							ВариантПоставки = Новый Структура;
							ВариантПоставки.Вставить("Поставщик",            Поставщик);
							ВариантПоставки.Вставить("Закупка",              Закупка);
							ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
							ВариантПоставки.Вставить("СрокПоставки",         ?(Закупка, "", ТекСтрока.СрокПоставкиВСтроке));
							ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
							ВариантПоставки.Вставить("ИнтерактивныйВвод",    Ложь);
							
							Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
								Если НоваяЦена = 0 Тогда
									НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
								КонецЕсли
							Иначе
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
							КонецЕсли;
							
							ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
							Если Закупка Тогда
								ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
							Иначе
								ТекСтрока.Поставщик = ВариантПоставки.Поставщик;
								ТекСтрока.СрокПоставкиВСтроке = ВариантПоставки.СрокПоставки;
							КонецЕсли;
						Иначе
							Если ДопПараметры <> Неопределено И ДопПараметры.Свойство("Контрагент") Тогда
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены, ДопПараметры.Контрагент, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
								Если НоваяЦена = 0 Тогда
									НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
								КонецЕсли
							Иначе
								НоваяЦена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании);
							КонецЕсли; 
						КонецЕсли;
						
						Если НоваяЦена > 0 Тогда
							ТекСтрока.Цена = НоваяЦена;
						КонецЕсли;
					Исключение КонецПопытки; 
					
				КонецЕсли;
			КонецЕсли;
			
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Коэффициент", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		КонецЕсли;
		
	ИначеЕсли Имя = "Товары.Коэффициент" Тогда
		Попытка	// Реквизита "КоличествоБазовое" может не быть в ТЧ
			ТекСтрока.КоличествоБазовое = ТекСтрока.Количество*ТекСтрока.Коэффициент;
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.КоличествоБазовое",ТекСтрока,ЭтаФорма,ДопПараметры) И РезультатОбработки;
		Исключение
			Попытка // Определяем, а нужно ли вообще пересчитывать цену.
				ПересчитатьЦену = ДопПараметры.ПересчитатьЦену;
			Исключение 
				ПересчитатьЦену = Истина;
			КонецПопытки;
			// Если мы попали сюда из секции "Товары.Номенклатура", то рассчитывать цену не нужно.
			Если ПересчитатьЦену Тогда
				РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры) И РезультатОбработки;
			КонецЕсли;
		КонецПопытки; 
		
	ИначеЕсли Имя = "Товары.КоличествоБазовое" Тогда
		Попытка	// Реквизита КоличествоБазовое может не быть в ТЧ
			Если орКоличествоБазовоеПриИзменении(ЭтотОбъект,ТекСтрока,ЭтаФорма,ДопПараметры) = Неопределено Тогда
				Если обПраво("ОтображатьБазовоеКоличество",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
					
					//bizteh++      
					Количество = Цел(ТекСтрока.КоличествоБазовое/ТекСтрока.Коэффициент);
					
					//Количество = ТекСтрока.КоличествоБазовое/?(ТекСтрока.Коэффициент=0, 1, ТекСтрока.Коэффициент);
					//КоличествоЦел = Цел(Количество);
					//КоличествоДробь = Количество - КоличествоЦел;
					//Количество = КоличествоЦел + ?(КоличествоДробь=0,0,1);
					//bizteh--
					
					Если Количество <> 0 Тогда ТекСтрока.Количество = Количество; КонецЕсли;
					Если Количество <> 1 Тогда
						дкПроверитьКорректностьКоличества(ЭтотОбъект,ТекСтрока,ЭтаФорма,ДопПараметры);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка // Определяем, а нужно ли вообще пересчитывать цену.
			ПересчитатьЦену = ДопПараметры.ПересчитатьЦену;
		Исключение 
			ПересчитатьЦену = Истина;
		КонецПопытки;
		// Если мы попали сюда из секции "Товары.Номенклатура", то рассчитывать цену не нужно. 
		Если ПересчитатьЦену Тогда 
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры) И РезультатОбработки;
		КонецЕсли;
		
	ИначеЕсли Имя = "Товары.Цена" Тогда
		Попытка	// Реквизита КоличествоБазовое может не быть в ТЧ
			ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.КоличествоБазовое;
		Исключение
			Попытка
				ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество * ТекСтрока.Коэффициент;
			Исключение
				// Значит в табличной части нет реквизита "Сумма", тогда дальше идти смысла нет.
				Возврат РезультатОбработки;
			КонецПопытки;
		КонецПопытки;
		Если ТипЗнч(ДопПараметры)<>Тип("Структура") Тогда
			ДопПараметры=Новый Структура;
		КонецЕсли;
		НеПерерасчитыватьЦенуСтарое=Неопределено;
		ДопПараметры.Свойство("НеПерерасчитыватьЦену",НеПерерасчитыватьЦенуСтарое);
		ДопПараметры.Вставить("НеПерерасчитыватьЦену",Истина);
		РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.Сумма",ТекСтрока,ЭтаФорма,ДопПараметры) И РезультатОбработки;
		Если НеПерерасчитыватьЦенуСтарое=Неопределено Тогда
			ДопПараметры.Удалить("НеПерерасчитыватьЦену");
		Иначе
			ДопПараметры.Вставить("НеПерерасчитыватьЦену",НеПерерасчитыватьЦенуСтарое);
		КонецЕсли; 
		
	ИначеЕсли Имя = "Товары.Сумма" Тогда
		Попытка	// Реквизита КоличествоБазовое может не быть в ТЧ
			ТекКоличество = ТекСтрока.КоличествоБазовое;
		Исключение
			ТекКоличество = ТекСтрока.Количество*ТекСтрока.Коэффициент;
		КонецПопытки;
		НеПерерасчитыватьЦену=Ложь;
		Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
			ДопПараметры.Свойство("НеПерерасчитыватьЦену",НеПерерасчитыватьЦену);
			Если НеПерерасчитыватьЦену = Неопределено Тогда
				НеПерерасчитыватьЦену = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если (НЕ НеПерерасчитыватьЦену) И ТекКоличество<>0 Тогда
			Попытка ТекСтрока.Цена = Окр(ТекСтрока.Сумма/ТекКоличество,2); Исключение КонецПопытки;
		КонецЕсли;
		
		// Если документ поддерживает скидки, то рассчитываем их, иначе переходим к расчету суммы НДС.
		Если Не ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) Тогда
			// Если ОбработкаРеквизита("РассчитатьСкидки") будет выполнена с результатом Истина,
			// то оттуда принудительно будет вызван ОбработкаРеквизита("Товары.СтавкаНДС") !!!
			// ВНИМАНИЕ Это не недоработка - так и должно быть, чтобы избежать двойного вызова в случае
			// прохода по всей ТЧ в случае Суммовой скидки или изменения базы.
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", ТекСтрока, ЭтаФорма, ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя = "Товары.ПроцентСкидки" Тогда
		#Если Клиент Тогда
			// Скидка не может быть выше 100%
			Если ТекСтрока.ПроцентСкидки > 100 Тогда
				ТекСтрока.ПроцентСкидки = 100;
			КонецЕсли;
			
			Попытка // может и не быть товарных скидок
				Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СкидкаНаТовар) И ТекСтрока.СкидкаНаТовар.ФлагВытеснения Тогда
					ТекСтрока.ПроцентСкидки = 0;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
			ТекСтрока.СуммаСкидки = Окр(СуммаБезСкидки * ТекСтрока.ПроцентСкидки / 100, 2);
			Попытка
				СкидкаДокумента=ЭтотОбъект.СкидкаНаценка;
			Исключение
				СкидкаДокумента=Справочники.ТипыСкидок.ПустаяСсылка();
			КонецПопытки;
			ТекСтрока.СуммаСкидки=дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидки,СкидкаДокумента);
			
			Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("ПересчитыватьПроцент", Ложь);
			
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СуммаСкидки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки; 			
		#КонецЕсли
		
	ИначеЕсли Имя = "Товары.СуммаСкидки" Тогда 
		#Если Клиент Тогда
			
			Попытка	// Определим необходимость обратного расчета процента скидки.
				ПересчитыватьПроцент = ДопПараметры.ПересчитыватьПроцент;
			Исключение 
				ПересчитыватьПроцент = Истина;	
			КонецПопытки;
			
			Попытка // может и не быть товарных скидок
				Если НЕ обЗначениеНеЗаполнено(ТекСтрока.СкидкаНаТовар) И ТекСтрока.СкидкаНаТовар.ФлагВытеснения Тогда
					ТекСтрока.СуммаСкидки = 0;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ПересчитыватьПроцент Тогда
				//СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры); 
				СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
				ТекСтрока.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, Окр(ТекСтрока.СуммаСкидки * 100 / СуммаБезСкидки, 2));
			КонецЕсли;
			
			// Выполним расчет итоговой суммы скидки на документ.
			
			// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
			// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
			Попытка 		
				ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
			Исключение
				ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
			КонецПопытки;
			
			ОбработкаРасчетСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			
			// Вычисляем итоговое значение суммы скидки (скидка шапки + скидки строк). Имя реквизита,
			// в котором должна хранится итоговая сумма скидки, 
			// а также имя табличной части, по которой необходимо вычислить итоговую сумму скидки находятся в реквизитах
			// обработки.
			СуммаИтого = 0;
			СуммаИтого = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидки");
			
			Попытка	// Если документ поддерживает только "шапочные" скидки, то в ТЧ не будет реквизита "СуммаСкидкиСтроки".
				СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки");
			Исключение
			КонецПопытки;
			
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = СуммаИтого;
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		#КонецЕсли
		
	ИначеЕсли Имя = "Товары.СкидкаНаТовар" Тогда
		#Если Клиент Тогда
			// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
			// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
			Попытка
				ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
			Исключение
				ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
			КонецПопытки;
			
			Попытка
				БлокироватьПерерасчетСкидок = ЭтотОбъект.БлокироватьПерерасчетСкидок;
			Исключение
				БлокироватьПерерасчетСкидок = Ложь;
			КонецПопытки;
			
			Если БлокироватьПерерасчетСкидок Тогда
				ЭтотОбъект.ОбработкаРеквизита("Товары.ПроцентСкидки",ТекСтрока,ЭтаФорма);
				ЭтотОбъект.ОбработкаРеквизита("Товары.ПроцентСкидкиСтроки",ТекСтрока,ЭтаФорма);
				Возврат Ложь;
			КонецЕсли;
			// Теперь получаем ссылку на обработку. Если соответствующей переменной в модуле документа нет,
			// значит он не поддерживает скидки.
			Попытка
				ОбработкаРасчетСкидок = ЭтотОбъект[ИмяПеременнойОбработки];	
				
				ОбработкаРасчетСкидок.ПодобратьСтрочнуюСкидку(ЭтотОбъект, ТекСтрока);
				
				ТекСтрока.СкидкаНаТовар  = ОбработкаРасчетСкидок.ТекущаяСкидкаСтроки;
				ТекСтрока.ПроцентСкидкиСтроки = ОбработкаРасчетСкидок.ТекущийПроцентСкидкиСтроки;
				ТекСтрока.СуммаСкидкиСтроки = ОбработкаРасчетСкидок.ТекущаяСуммаСкидкиСтроки;
				
				// Пересчитываем общую сумму скидок документа.
				СуммаИтого = 0;
				СуммаИтого = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидки");
				СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки");
				
				ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = СуммаИтого;
			Исключение КонецПопытки;
			
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		#КонецЕсли
		
	ИначеЕсли Имя = "Товары.ПроцентСкидкиСтроки" Тогда
		#Если Клиент Тогда 			
			// Если скидка на товар (строки) не выбрана, а пользователь пытается установить значение процента, 
			// то не дадим ему это сделать.
			Если ТекСтрока.СкидкаНаТовар.Пустая() Тогда
				ТекСтрока.ПроцентСкидкиСтроки = 0;
			КонецЕсли;
			
			// Скидка не может быть выше 100%
			Если ТекСтрока.ПроцентСкидкиСтроки > 100 Тогда
				ТекСтрока.ПроцентСкидкиСтроки = 100;
			КонецЕсли; 
			СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
			ТекСтрока.СуммаСкидкиСтроки = Окр(СуммаБезСкидки * ТекСтрока.ПроцентСкидкиСтроки / 100,2);
			ТекСтрока.СуммаСкидкиСтроки = дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидкиСтроки,ТекСтрока.СкидкаНаТовар);
			
			// Запрещаем обратный пересчет процента.
			Если ТипЗнч(ДопПараметры) <> Тип("Структура") Тогда
				ДопПараметры = Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("ПересчитыватьПроцент", Ложь);
			
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СуммаСкидкиСтроки", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		#КонецЕсли
		
	ИначеЕсли Имя = "Товары.СуммаСкидкиСтроки" Тогда 
		#Если Клиент Тогда 
			
			// Если скидка на товар (строки) не выбрана, а пользователь пытается установить сумму скидки, 
			// то не дадим ему это сделать.
			Если ТекСтрока.СкидкаНаТовар.Пустая() Тогда
				ТекСтрока.СуммаСкидкиСтроки = 0;
			КонецЕсли;
			
			// Проверим дополнительные параметры, возможно пересчитывать процент не нужно. 			
			Попытка // Определим необходимость обратного расчета процента скидки.
				ПересчитыватьПроцент = ДопПараметры.ПересчитыватьПроцент;
			Исключение 
				ПересчитыватьПроцент = Истина;
			КонецПопытки;
			
			Если ПересчитыватьПроцент Тогда
				СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
				ТекСтрока.ПроцентСкидкиСтроки = ?(СуммаБезСкидки = 0, 0, Окр(ТекСтрока.СуммаСкидкиСтроки * 100 / СуммаБезСкидки,2));
			КонецЕсли;
			
			// Выполним расчет итоговой суммы скидки на документ.
			
			// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
			// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
			Попытка
				ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
			Исключение
				ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
			КонецПопытки;
			
			ОбработкаРасчетСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			
			// Вычисляем итоговое значение суммы скидки (скидка шапки + скидки строк). Имя реквизита,
			// в котором должна хранится итоговая сумма скидки, 
			// а также имя табличной части, по которой необходимо вычислить итоговую сумму скидки находятся в реквизитах
			// обработки.
			СуммаИтого = 0;
			СуммаИтого = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидки");
			СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки");
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = СуммаИтого;
			
			РезультатОбработки = ЭтотОбъект.ОбработкаРеквизита("Товары.СтавкаНДС", ТекСтрока, ЭтаФорма, ДопПараметры) И РезультатОбработки;
		#КонецЕсли
		
	ИначеЕсли Имя = "Товары.СтавкаНДС" Тогда
		//bizteh
		СуммаСоСкидкой = дкПолучитьСуммуСтрокиСоСкидкой(ЭтотОбъект,ТекСтрока);
		//СуммаСоСкидкой = дкПолучитьСуммуСтрокиСоСкидкой(ЭтотОбъект,ТекСтрока,ДопПараметры); 
		//bizteh		
		Попытка
			СтавкаНДС = ТекСтрока.СтавкаНДС.Ставка;
			ТекСтрока.СуммаНДС = Окр((СуммаСоСкидкой * СтавкаНДС)/(100 + СтавкаНДС),2);
		Исключение
		КонецПопытки;
		ТекСтрока.СуммаВсего = СуммаСоСкидкой;
		
	ИначеЕсли Имя = "Товары.СуммаНДС" Тогда
		
		//// Определим, есть ли скидки. Могут быть и строчные и шапочные скидки.
		//Попытка   			
		//	СуммаСкидки = ТекСтрока.СуммаСкидки;			
		//Исключение 
		//	СуммаСкидки = 0;
		//КонецПопытки;
		//Попытка   						
		//	СуммаСкидки = СуммаСкидки + ТекСтрока.СуммаСкидкиСтроки;
		//Исключение
		//КонецПопытки;
		//
		//// Вычисляем сумму с учетом скидок.
		//СуммаВсегоБезСкидки = ТекСтрока.Сумма - СуммаСкидки;
		//
		//// Возможно ТЧ не поддерживает расчет НДС.
		//Попытка 
		//	// Пробуем получить сумму НДС. Если ее нет в табличной части, то не учитываем НДС
		//	//при расчете Суммы всего. Валимся прямо тут.
		//	СуммаНДС = ТекСтрока.СуммаНДС;
		//	
		//	// Определим каким образом у нас вычисляется НДС
		//	Попытка
		//		ЦенаВключаетНДС = ЭтотОбъект.ТипЦен.Пустая() ИЛИ ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
		//	Исключение
		//		ЦенаВключаетНДС = Истина;
		//	КонецПопытки;
		//	
		//	Если ЦенаВключаетНДС Тогда			
		//		ТекСтрока.СуммаВсего = СуммаВсегоБезСкидки;			
		//	Иначе
		//		ТекСтрока.СуммаВсего = СуммаВсегоБезСкидки + СуммаНДС;			
		//	КонецЕсли;
		//Исключение
		//	ТекСтрока.СуммаВсего = СуммаВсегоБезСкидки; 
		//КонецПопытки;	 
		
	ИначеЕсли Имя = "Товары.СуммаВсего" Тогда 
		// ВНИМАНИЕ ! Сюда мы попадаем только интерактивно. В предыдущих обработчиках
		// реквизитов ТЧ вызов этой ветки не производится
		// код этой ветки используется для обратного пересчета суммовых реквизитов строки если СуммаВсего исправлена руками
		
		// Определяем, ведется ли расчет НДС в табличной части.
		Попытка
			СтавкаНДС   = ТекСтрока.СтавкаНДС;
			ВедетсяРасчетНДС = Истина;
			// Определим включают ли в себя НДС цены документа
			Попытка
				ЦенаВключаетНДС = ЭтотОбъект.ТипЦен.Пустая() ИЛИ ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
			Исключение
				ЦенаВключаетНДС = Истина;
			КонецПопытки;
		Исключение
			ВедетсяРасчетНДС = Ложь;
			ЦенаВключаетНДС = Истина;
		КонецПопытки;
		
		// Определим, есть ли скидки.
		// Сначала шапочная скидка.
		Попытка
			ПроцентСкидки = ТекСтрока.ПроцентСкидки;
		Исключение 
			ПроцентСкидки = 0;
		КонецПопытки;
		
		// Теперь определяем какая скидка установлена для строки.
		СкидкаСтрокиАбсолютная = Истина;
		ЗначениеСкидкиСтроки = 0;
		Попытка
			СкидкаНаценка = ТекСтрока.СкидкаНаТовар;
			Если Не СкидкаНаценка.Пустая() Тогда
				СкидкаСтрокиАбсолютная = (СкидкаНаценка.СпособВычисления = Перечисления.СкидкиСпособВычисления.Абсолютная);
				Если СкидкаСтрокиАбсолютная Тогда
					ЗначениеСкидкиСтроки = ТекСтрока.СуммаСкидкиСтроки;	
				Иначе
					ЗначениеСкидкиСтроки = ТекСтрока.ПроцентСкидкиСтроки;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
		Если ЦенаВКлючаетНДС Тогда
			Если СкидкаСтрокиАбсолютная Тогда
				СуммаДляРасчета    = ТекСтрока.СуммаВсего + ЗначениеСкидкиСтроки;
				ПроцентСкидкиВсего = ПроцентСкидки;
			Иначе
				СуммаДляРасчета = ТекСтрока.СуммаВсего;
				ПроцентСкидкиВсего = ПроцентСкидки + ЗначениеСкидкиСтроки;
			КонецЕсли;
		Иначе
			ВремСуммаНДС = Окр((ТекСтрока.СуммаВсего * СтавкаНДС.Ставка)/(100 + СтавкаНДС.Ставка), 2);
			Если СкидкаСтрокиАбсолютная Тогда
				СуммаДляРасчета    = ТекСтрока.СуммаВсего - ВремСуммаНДС + ЗначениеСкидкиСтроки;
				ПроцентСкидкиВсего = ПроцентСкидки;
			Иначе
				СуммаДляРасчета = ТекСтрока.СуммаВсего - ВремСуммаНДС;
				ПроцентСкидкиВсего = ПроцентСкидки + ЗначениеСкидкиСтроки;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроцентСкидкиВсего >= 100 Тогда
			ТекСтрока.СуммаВсего = 0;
			ТекСтрока.Сумма = СуммаДляРасчета;
		Иначе
			ТекСтрока.Сумма = СуммаДляРасчета*100/(100 - ПроцентСкидкиВсего)
		КонецЕсли;
		
		// Пересчитываем цену.
		Попытка
			ТекКоличество = ТекСтрока.КоличествоБазовое;
		Исключение  
			ТекКоличество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
		КонецПопытки; 
		НеПерерасчитыватьЦену=Ложь;
		Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
			ДопПараметры.Свойство("НеПерерасчитыватьЦену",НеПерерасчитыватьЦену);
			Если НеПерерасчитыватьЦену = Неопределено Тогда
				НеПерерасчитыватьЦену = Ложь;
			КонецЕсли;
		КонецЕсли;
		Если (НЕ НеПерерасчитыватьЦену) И ТекКоличество<>0 Тогда
			Попытка
				ТекСтрока.Цена = Окр(ТекСтрока.Сумма / ТекКоличество,2);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		СуммаБезСкидки = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
		
		// Вычисляем новую сумму "шапочной" скидки приходящейся на текущую строку.
		Попытка
			ТекСтрока.СуммаСкидки = Окр(СуммаБезСкидки * ПроцентСкидки / 100, 2);
			Попытка
				СкидкаДокумента=ЭтотОбъект.СкидкаНаценка;
			Исключение
				СкидкаДокумента=Справочники.ТипыСкидок.ПустаяСсылка();
			КонецПопытки;
			ТекСтрока.СуммаСкидки=дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидки,СкидкаДокумента);
			СуммаСкидки = ТекСтрока.СуммаСкидки;
		Исключение
			СуммаСкидки = 0;
		КонецПопытки;
		
		// Вычисляем товарную скидку.
		Попытка
			Если СкидкаСтрокиАбсолютная Тогда
				ТекСтрока.ПроцентСкидкиСтроки = ?(СуммаБезСкидки = 0, 0, Окр(ТекСтрока.СуммаСкидкиСтроки * 100 / СуммаБезСкидки,2));
			Иначе
				ТекСтрока.СуммаСкидкиСтроки = Окр(СуммаБезСкидки * ТекСтрока.ПроцентСкидкиСтроки / 100, 2);
				ТекСтрока.СуммаСкидкиСтроки = дкОкруглитьСуммуСкидки(ТекСтрока.СуммаСкидкиСтроки,ТекСтрока.СкидкаНаТовар);
			КонецЕсли;
			СуммаСкидки = СуммаСкидки + ТекСтрока.СуммаСкидкиСтроки; 
		Исключение
		КонецПопытки;
		
		// Рассчитываем новую сумму НДС.
		Если ВедетсяРасчетНДС Тогда
			СуммаВсегоБезСкидки = СуммаБезСкидки - СуммаСкидки ;
			ТекСтрока.СуммаНДС = Окр((ТекСтрока.СуммаВсего * СтавкаНДС.Ставка)/(100 + СтавкаНДС.Ставка), 2);
		КонецЕсли;
		
		// Выполним расчет итоговой суммы скидки на документ.
		
		// Если имя переменной модуля документа, являющейся ссылкой на обработку по расчету скидок, отличается
		// стандартного, тогда альтернативное имя будет передано через дополнительные параметры.
		Попытка
			ИмяПеременнойОбработки = ДопПараметры.ИмяПеременнойОбработки;
		Исключение
			ИмяПеременнойОбработки = "ОбработкаРасчетСкидок";
		КонецПопытки;
		
		// Имя реквизита, в котором должна хранится итоговая сумма скидки, а также имя табличной части,
		// по которой необходимо вычислить итоговую сумму скидки находятся в реквизитах обработки.
		Попытка
			ОбработкаРасчетСкидок = ЭтотОбъект[ИмяПеременнойОбработки];
			СуммаИтого = 0;
			СуммаИтого = ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидки");
			Попытка	// Возможно используются только "шапочные" скидки, тогда в ТЧ не будет реквизита "СуммаСкидкиСтроки".
				СуммаИтого = СуммаИтого + ЭтотОбъект[ОбработкаРасчетСкидок.ИмяТабличнойЧасти].Итог("СуммаСкидкиСтроки")
			Исключение
			КонецПопытки;
			ЭтотОбъект[ОбработкаРасчетСкидок.ИмяРеквизитаСуммаСкидкиНаценки] = СуммаИтого;
		Исключение
		КонецПопытки;
		
	ИначеЕсли Имя = "Товары.Поставщик" Тогда
		
		Рез = Истина;
		
		ВариантПоставки = Новый Структура;
		ВариантПоставки.Вставить("Закупка",              Ложь);
		ВариантПоставки.Вставить("Поставщик",            ТекСтрока.Поставщик);
		ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
		ВариантПоставки.Вставить("СрокПоставки",         ТекСтрока.СрокПоставкиВСтроке);
		ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
		#Если Клиент Тогда
			ВариантПоставки.Вставить("ИнтерактивныйВвод", Истина);
		#Иначе
			ВариантПоставки.Вставить("ИнтерактивныйВвод", Ложь);
		#КонецЕсли
		
		Попытка
			МоментЦены = ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени());
			КурсДокумента = ЭтотОбъект.КурсДокумента;
		Исключение
			МоментЦены = Неопределено;
			КурсДокумента = Неопределено;
		КонецПопытки;
		
		НоваяЦена = обПолучитьЦену(ЭтотОбъект.ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ЭтотОбъект.ВалютаДокумента, КурсДокумента, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
		
		ТекСтрока.Поставщик            = ВариантПоставки.Поставщик;
		ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
		ТекСтрока.СрокПоставкиВСтроке  = ВариантПоставки.СрокПоставки;
		
		Если НоваяЦена > 0 И ТекСтрока.Цена <> НоваяЦена Тогда
			ТекСтрока.Цена = НоваяЦена;
			Возврат ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма);
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя = "Товары.ПрайсЛист" Тогда
		
		Рез = Истина;
		
		ВариантПоставки = Новый Структура;
		ВариантПоставки.Вставить("Закупка",              Истина);
		ВариантПоставки.Вставить("Поставщик",            ТекСтрока.ПрайсЛист);
		ВариантПоставки.Вставить("КлючСтрокиПоставщика", ТекСтрока.КлючСтрокиПоставщика);
		ВариантПоставки.Вставить("СрокПоставки",         "");
		ВариантПоставки.Вставить("СтавкаНДС",            ТекСтрока.СтавкаНДС);
		#Если Клиент Тогда
			ВариантПоставки.Вставить("ИнтерактивныйВвод", Истина);
		#Иначе
			ВариантПоставки.Вставить("ИнтерактивныйВвод", Ложь);
		#КонецЕсли
		
		НоваяЦена = обПолучитьЦену(ЭтотОбъект.ТипЦен, ТекСтрока.Номенклатура, ?(ЭтотОбъект.ЭтоНовый(), ЭтотОбъект.Дата, ЭтотОбъект.МоментВремени()),, ЭтотОбъект.ВалютаДокумента, ЭтотОбъект.КурсДокумента, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ЭтотОбъект.ПодразделениеКомпании,, ВариантПоставки);
		
		ТекСтрока.ПрайсЛист = ВариантПоставки.Поставщик;
		ТекСтрока.КлючСтрокиПоставщика = ВариантПоставки.КлючСтрокиПоставщика;
		
		Если НоваяЦена > 0 И ТекСтрока.Цена <> НоваяЦена Тогда
			ТекСтрока.Цена = НоваяЦена;
			Возврат ЭтотОбъект.ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма);
		КонецЕсли;
		
		Возврат Рез;
		
	// ОБРАБОТКА ДЕЙСТВИЙ КНОПОК КОМАНДНОЙ ПАНЕЛИ ФОРМ ДОКУМЕНТОВ
	ИначеЕсли Имя = "ДвиженияДокумента" Тогда
		#Если Клиент Тогда
			дкДвиженияДокумента(ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "ДеревоДокумента" Тогда
		#Если Клиент Тогда
			дкДействияФормыДеревоДокумента(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "Свойства" Тогда
		#Если Клиент Тогда
			дкДействияФормыСвойства(ЭтаФорма, ДопПараметры);
		#КонецЕсли
	ИначеЕсли Имя = "кнЗаметки" Тогда
		#Если Клиент Тогда
			спЗаметки(ЭтотОбъект.Ссылка,ЭтаФорма);
		#КонецЕсли
	ИначеЕсли Имя = "РедактироватьНомер" Тогда
		#Если Клиент Тогда
			дкДействияФормыРедактироватьНомер(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "ПоискСсылок" Тогда
		#Если Клиент Тогда
			дкДействияФормыПоискСсылок(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "ДобавитьВИзбранное" Тогда
		#Если Клиент Тогда
			Попытка	
				ИмяФормы = ДопПараметры.ИмяФормы;
			Исключение
				ИмяФормы = Неопределено;
			КонецПопытки;	
			
			дкДействияФормыДобавитьВИзбранное(ЭтаФорма, ЭтотОбъект, ИмяФормы);
		#КонецЕсли
		
	ИначеЕсли Имя = "ПоискПоНомеруДокументаОснования" Тогда
		#Если Клиент Тогда
			дкДействияФормыПоискПоНомеруДокументаОснования(ЭтаФорма);
		#КонецЕсли
		
	ИначеЕсли Имя = "ИсторияОбъекта" Тогда
		#Если Клиент Тогда
			дкДействияФормыИсторияОбъекта(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "ВыгрузкаВТабличныйДокумент" Тогда
		#Если Клиент Тогда
			дкДействияФормыВыгрузкаВТабличныйДокумент(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли
		
	ИначеЕсли Имя = "СоздатьНапоминание" Тогда
		#Если Клиент Тогда
			дкДействияФормыСоздатьНапоминание(ЭтаФорма, ЭтотОбъект, ДопПараметры);
		#КонецЕсли
		
	ИначеЕсли Имя = "УстановитьРозничныеЦены" Тогда
		Если ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
			Для Каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
				ЭтотОбъект.ОбработкаРеквизита("УстановитьРозничнуюЦену",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Имя = "СоздатьПисьмоВТехПоддержку" Тогда
		#Если Клиент Тогда
			элНаписатьПисьмоВСлужбуТехПоддержки(ЭтаФорма, ЭтотОбъект);
		#КонецЕсли 	
		
	ИначеЕсли Имя = "ВыгрузкаВБухгалтерию" Тогда
		#Если Клиент Тогда
			удВыгрузитьВбухгалтерию(ЭтаФорма,ЭтотОбъект);
		#КонецЕсли
	ИначеЕсли Имя = "АльтернативноеРедактирование" Тогда
		#Если Клиент Тогда
			дкАльтернативноеРедактированиеДокумента(ЭтаФорма,ЭтотОбъект);
		#КонецЕсли
	ИначеЕсли Имя = "ИскатьКонтрагентов" Тогда
		ОбработкаПоиска=Обработки.ПоискКонтрагентовИКонтактныхЛиц.Создать();
		ФормаПоиска=ОбработкаПоиска.ПолучитьФорму("Форма",ЭтаФорма,ЭтаФорма);
		Если ФормаПоиска.Открыта() Тогда
			ФормаПоиска.Активизировать();
		Иначе
			ФормаПоиска.Открыть();
		КонецЕсли;
	ИначеЕсли Имя = "КартинкиИФайлы" Тогда
		#Если Клиент Тогда
			Если Метаданные.РегистрыСведений.КартинкиИФайлы.Измерения.Объект.Тип.СодержитТип(ТипЗнч(ЭтотОбъект.Ссылка)) Тогда				
				ФормаРегистра = РегистрыСведений.КартинкиИФайлы.ПолучитьФормуСписка("ФормаСписка",ЭтаФорма);
				ФормаРегистра.РегистрСведенийСписок.Отбор.Объект.Установить(ЭтотОбъект.Ссылка);
				Если НЕ ФормаРегистра.Открыта() Тогда
					ФормаРегистра.ОткрытьМодально();
				Иначе
					ФормаРегистра.Активизировать();
				КонецЕсли;
				удФайлыИКартинкиОбновитьПодменю(ЭтаФорма);
			КонецЕсли;
		#КонецЕсли
		
	ИначеЕсли Лев(Имя,14) = "КартинкиИФайлы" Тогда
		#Если Клиент Тогда
			Запись = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
			Запись.Объект = ЭтотОбъект.Ссылка;
			Запись.Идентификатор = Сред(Имя, 16);
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				ФормаЗаписи = Запись.ПолучитьФорму();
				ФормаЗаписи.ОткрытьМодально();
				удФайлыИКартинкиОбновитьПодменю(ЭтаФорма);
			КонецЕсли;
		#КонецЕсли
		
	ИначеЕсли Имя = "ОплатаЧерезКассу" Тогда
		#Если Клиент Тогда
			
			// БИЗТЕХ Горковенко П.А. + КОВАЛЬ 23.10.2025 ++
			Если ТипЗнч(ЭтотОбъект.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
				// Если это ПКО то проверим последний статус по терминалу АльфаБанка	
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	AB_РаботаСТерминаломАльфаБанкСрезПоследних.Статус КАК Статус
					|ИЗ
					|	РегистрСведений.AB_РаботаСТерминаломАльфаБанк.СрезПоследних(, UUID = """") КАК AB_РаботаСТерминаломАльфаБанкСрезПоследних
					|ГДЕ
					|	AB_РаботаСТерминаломАльфаБанкСрезПоследних.Документ = &Ссылка";
				
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				РезультатЗапроса = Запрос.Выполнить().Выбрать();	
				// Если выборка не пуста - значит ПКО использовали для оплаты через АльфаБанк
				Пока РезультатЗапроса.Следующий() Цикл
					// В Выборке будет единственная строка с последним статусом по документу
					Если РезультатЗапроса.Статус = Перечисления.AB_СтатусыТерминаловАльфабанк.Занят Тогда
						Предупреждение("Провести оплату невозможно. Завершите работу через АльфаБанк!");
						Возврат(Истина);	
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			// БИЗТЕХ Горковенко П.А. + КОВАЛЬ 23.10.2025 --
			
			Если ЭтотОбъект.ЭтоНовый() ИЛИ ЭтотОбъект.Модифицированность() Тогда
				Предупреждение("Перед выполнением операции необходимо записать документ!");
				РезультатОбработки = ЛОЖЬ;
			Иначе
				
				//anton 23/12/2019 //bizteh
				
				Попытка 
					ФР=ЭтотОбъект.ФР;
					КассаККМ=ЭтотОбъект.КассаККМ;				
				Исключение
					ФР=Неопределено;
					КассаККМ=Неопределено;
					обОбщие.обОпределениеФР_ВключитьОборудование(ЭтотОбъект, ФР, КассаККМ);		
				КонецПопытки;
								
				Компьютер=ПараметрыСеанса.Компьютер.ПолучитьОбъект();
				Компьютер.ФР=ФР;
				Компьютер.КассаККМ=КассаККМ;	
				Компьютер.Записать();
				
				GUID_ФР=ФР.ИдентификаторОборудования;
								
				ФронтКассира=Обработки.ФронтКассира.Создать();
				ФронтКассира.ФР=ФР;
				ФронтКассира.КассаККМ=КассаККМ;
				ФронтКассира.GUID_ФР    = GUID_ФР;
				
				Попытка
					
					Если НЕ ПустаяСтрока(GUID_ФР) Тогда
						// Есть устройство, включаем его
						Если ФронтКассира.глТорговоеОборудование.СтатусОборудования(GUID_ФР)=Перечисления.СтатусыОборудования.Включено Тогда
							ОписаниеОшибки="";
							// Выключим оборудование
							КодОшибки=ФронтКассира.глТорговоеОборудование.ВыключитьОборудование(GUID_ФР,ОписаниеОшибки);
							Если НЕ ФронтКассира.РезультатРаботыСОборудованием("Фискальный регистратор",КодОшибки,ОписаниеОшибки) Тогда
								Возврат Ложь;
							Иначе
							КонецЕсли;
						КонецЕсли;
						ОписаниеОшибки="";
						КодОшибки=ФронтКассира.глТорговоеОборудование.ВключитьОборудование(GUID_ФР,ОписаниеОшибки);
						// Включаем оборудование
						Если НЕ ФронтКассира.РезультатРаботыСОборудованием("Фискальный регистратор",КодОшибки,ОписаниеОшибки) Тогда
							Возврат Ложь;
						Иначе
						КонецЕсли;
					Иначе
						Возврат Ложь;
					КонецЕсли;
					
				Исключение
				КонецПопытки;
				
				ФронтКассира.ОплатитьДокумент(ЭтотОбъект.Ссылка);					
				//Обработки.ФронтКассира.Создать().ОплатитьДокумент(ЭтотОбъект.Ссылка);
				//anton 23/12/2019
				
				//БИЗТЕХ МАМОНОВ 19.12.2025 ++
				//Если последний пробитый документ оплаты был с флагом Автопробитие, тогда выводим на печать  
				Если ФронтКассира.Автопробитие = Истина Тогда
					ДокОплатыСсылка = ХранилищеОбщихНастроек.Загрузить("ПоследнийПробитыйЧек","Ссылка");
					ТабДокПечатьНаОплату = Новый ТабличныйДокумент;
					Если ЗначениеЗаполнено(ДокОплатыСсылка) И ТипЗнч(ДокОплатыСсылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
						дкПечать(ДокОплатыСсылка.ПолучитьОбъект(), "Приходный кассовый ордер", 1, Ложь, ТабДокПечатьНаОплату);
					ИначеЕсли ЗначениеЗаполнено(ДокОплатыСсылка) И ТипЗнч(ДокОплатыСсылка) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
						дкПечать(ДокОплатыСсылка.ПолучитьОбъект(), "Чек на оплату", 1, Ложь, ТабДокПечатьНаОплату);
					КонецЕсли;
                КонецЕсли;
                //БИЗТЕХ МАМОНОВ 19.12.2025 ++
			КонецЕсли;
		#КонецЕсли
		
	ИначеЕсли Имя = "ВыгрузитьВШаблон" Тогда
		#Если Клиент Тогда
			Попытка	
				ИмяФормы = ДопПараметры.ИмяФормы;
			Исключение
				ИмяФормы = Неопределено;
			КонецПопытки;	
			
			дкДействияФормыВыгрузитьВШаблон(ЭтаФорма, ЭтотОбъект, ИмяФормы);
		#КонецЕсли
		
	ИначеЕсли Имя = "ЗагрузитьИзШаблона" Тогда
		#Если Клиент Тогда
			Попытка	
				ИмяФормы = ДопПараметры.ИмяФормы;
			Исключение
				ИмяФормы = Неопределено;
			КонецПопытки;	
			
			дкДействияФормыЗагрузитьИзШаблона(ЭтаФорма, ЭтотОбъект, ИмяФормы);
		#КонецЕсли	
		
	ИначеЕсли Имя = "ПакетнаяПечать" Тогда
		#Если Клиент Тогда
			зфОткрытьФормуПакетнойПечати(ЭтотОбъект,,ДопПараметры);
		#КонецЕсли	
		
	ИначеЕсли Имя = "ДополнительнаяФорма" Тогда
		#Если Клиент Тогда
			НайденнаяФорма = ЭтотОбъект.Метаданные().Формы.Найти("ФормаДокументаДополнительная");
			Если НайденнаяФорма <> Неопределено Тогда
				Форма = ЭтотОбъект.ПолучитьФорму(НайденнаяФорма.Имя,ДопПараметры);
				Форма.ВладелецФормы = ЭтаФорма;
				Форма.Открыть();		
			КонецЕсли;
		#КонецЕсли	
	ИначеЕсли Найти(Имя, "_РасширеннаяСортировка_") > 0 Тогда
		#Если Клиент Тогда
			дкДействияФормыРасширеннаяСортировкаТабЧасти(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		#КонецЕсли
		
		//begin taty 23.03.2021
	ИначеЕсли Найти(Имя, "ЭМ_ПодписатьОплату") > 0 Тогда
		#Если Клиент Тогда
			Если ЭтотОбъект.ЭтоНовый() ИЛИ ЭтотОбъект.Модифицированность() 
				и не ЭтотОбъект.комментарий = "Создана БТ (перепродажа)"   //ЧалапАю БизТех 24.12.2024 
				тогда
				Предупреждение("Перед выполнением операции необходимо записать документ!");
				РезультатОбработки = ЛОЖЬ;
			Иначе
				//Если ЭтаФорма.ЭМ_ПодписалОплату <> обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ПодписалОплату, Справочники.Пользователи.ПустаяСсылка()) Тогда
				Если ЭтаФорма.ЭМ_КнопкаНажата <> обПолучитьЗначениеСвойства(ЭтотОбъект, ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_КнопкаНажата,ложь) Тогда        //ЧалапАю БизТех 21.03.2025 000000802 
					МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = ЭтотОбъект.Ссылка;
					МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ПодписалОплату;
					МенеджерЗаписи.Значение = ЭтаФорма.ЭМ_ПодписалОплату;
					МенеджерЗаписи.Записать(); 
					
					//<<ЧалапАю БизТех 21.03.2025 000000802 
					МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = ЭтотОбъект.Ссылка;
					МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_ДатаУстановки;
					МенеджерЗаписи.Значение = ЭтаФорма.ЭМ_ДатаУстановки;
					МенеджерЗаписи.Записать(); 
					
					МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = ЭтотОбъект.Ссылка;
					МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ЭМ_КнопкаНажата;
					МенеджерЗаписи.Значение = ЭтаФорма.ЭМ_КнопкаНажата;
					МенеджерЗаписи.Записать();
					//ЧалапАю БизТех 21.03.2025 000000802 >>

				КонецЕсли;
			КонецЕсли;	
		#КонецЕсли	
		//end			
	Иначе	
		// Обработка реквизита с заданным именем не предусмотрена
		Возврат Ложь;
	КонецЕсли; 
	
	// Если при обработке ошибок нет - все нормально
	Возврат РезультатОбработки;
КонецФункции // дкОбработкаРеквизита()

// Округление суммы скидки согласно правилам округления по типу скидки
//
// Параметры
//  СуммаСкидки  - Число - Расчетная сумма скидки
//  ТипСкидки  - СправочникСсылка.ТипыСкидок - Ссылка на справочник типов скидок
//
// Возвращаемое значение:
//   Число   - Округленная сумма скидки
//
Функция дкОкруглитьСуммуСкидки(СуммаСкидки,ТипСкидки) Экспорт
	СуммаСкидкиОкругленная=СуммаСкидки;
	Если НЕ обЗначениеНеЗаполнено(ТипСкидки) Тогда
		Если ТипСкидки.ОкруглятьВБольшуюСторону Тогда
			СуммаСкидкиОкругленная=Окр(СуммаСкидки,ТипСкидки.Точность,1);
		Иначе
			СуммаСкидкиОкругленная=Окр(СуммаСкидки,ТипСкидки.Точность,0);
		КонецЕсли;
	КонецЕсли;
	Возврат СуммаСкидкиОкругленная;
КонецФункции // дкОкруглитьСуммуСкидки() 

// Получение суммы по строке документа без скидки
//
// ЭтотОбъект	– ДокументОбъект	– Документ, для которого требуется получить сумму строки.
// ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа.
//
// Возвращаемое значение:
// Число – Сумма строки документа.
//
Функция дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры=Неопределено) Экспорт
	Сумма = 0;
	
	// Включает ли цена НДС?
	Попытка  
		//бизтез (добавленно по аналогии с пред. релизом)
		//Если ТипЗнч(ДопПараметры) = Тип("Структура") И ДопПараметры.Свойство("ТипЦен") Тогда
			ЦенаВключаетНДС = ДопПараметры.ТипЦен.Пустая() ИЛИ ДопПараметры.ТипЦен.ЦенаВключаетНДС;
		//Иначе
		//	ЦенаВключаетНДС = ЭтотОбъект.ТипЦен.Пустая() ИЛИ ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
		//КонецЕсли;
	Исключение
		ЦенаВключаетНДС = Истина;
	КонецПопытки;
	// Пробуем получить ставку НДС. Если ее нет в табличной части, то считаем что ставка = 0.
	Попытка
		СтавкаНДС = ТекСтрока.СтавкаНДС.Ставка;
	Исключение
		СтавкаНДС = 0;
	КонецПопытки; 
	
	Сумма = ТекСтрока.Сумма;
	Если НЕ ЦенаВключаетНДС Тогда
		Сумма = Сумма + Окр(Сумма*СтавкаНДС/100,2);
	КонецЕсли;
	
	Возврат Сумма;
КонецФункции // дкПолучитьСуммуСтрокиБезСкидки()

// Получение суммы по строке документа со скидкой
//
// ЭтотОбъект	– ДокументОбъект	– Документ, для которого требуется получить сумму строки.
// ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа.
//
// Возвращаемое значение:
// Число – Сумма строки документа.
//
Функция дкПолучитьСуммуСтрокиСоСкидкой(ЭтотОбъект,ТекСтрока,ДопПараметры=Неопределено) Экспорт
	// Определим, есть ли скидки. Могут быть и строчные, и шапочные скидки.
	Попытка   			
		СуммаСкидки = ТекСтрока.СуммаСкидки;			
	Исключение 
		СуммаСкидки = 0; 			
	КонецПопытки;
	// Добавляем, если есть, сумму товарной скидки.
	Попытка   						
		СуммаСкидки = СуммаСкидки + ТекСтрока.СуммаСкидкиСтроки;
	Исключение
	КонецПопытки;
	
	//Сумма = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока,ДопПараметры);
	Сумма = дкПолучитьСуммуСтрокиБезСкидки(ЭтотОбъект,ТекСтрока);
	Сумма = Сумма - СуммаСкидки;
	
	Возврат Сумма;
КонецФункции // дкПолучитьСуммуСтрокиСоСкидкой()

// Обработка изменения реквизита документа "ДоговорВзаиморасчетов"
//
// Параметры:
// ЭтотОбъект	 – ДокументОбъект, документ, реквизит которого обрабатывается.
// ЭтаФорма	 – Форма, Ссылка на форму документа. Если значение неопределено,
//					  производится программная обработка реквизитов.
// ДопПараметры – Структура, структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
// Булево – Результат выполнения обработки.
//
Функция дкОбработкаРеквизитаДоговорВзаиморасчетов(ЭтотОбъект,ЭтаФорма = Неопределено,ДопПараметры = Неопределено)
	
	НеПерезаполнятьПоДоговоруВзаиморасчетов=Ложь;
	Если ТипЗнч(ДопПараметры)=Тип("Структура") Тогда
		Если НЕ ДопПараметры.Свойство("НеПерезаполнятьПоДоговоруВзаиморасчетов",НеПерезаполнятьПоДоговоруВзаиморасчетов) Тогда
			НеПерезаполнятьПоДоговоруВзаиморасчетов=Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	РеквизитыШапкиДокумента = ЭтотОбъект.Метаданные().Реквизиты;
	Если РеквизитыШапкиДокумента.Найти("ДоговорВзаиморасчетов") <> Неопределено И НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
		Попытка ПраваПользователя = ЭтотОбъект.Права; Исключение ПраваПользователя = НЕОПРЕДЕЛЕНО; КонецПопытки;
		//Проверим на соответствие ХозОперации
		Попытка
			Если НЕ ЭтотОбъект.ДоговорВзаиморасчетов.ПолучитьОбъект().СоответствуетХозОперации(ЭтотОбъект.ХозОперация) Тогда
				#Если Клиент Тогда
					Предупреждение("Вид договора не соответствует Хоз.операции.",обПраво("ТаймаутДиалогов",ПраваПользователя,,ЭтотОбъект));
				#КонецЕсли
				ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
				Возврат ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов",,ЭтаФорма,ДопПараметры);
			КонецЕсли;
		Исключение
			#Если Клиент Тогда
			Сообщить("Ошибка при проверка договора взаиморасчетов: " + ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
		//Проверим даты действия договора
		КонтрольКорректностиДатДоговоров=обПраво("КонтрольКорректностиДатДоговоров",ПраваПользователя,,ЭтотОбъект);
		Если КонтрольКорректностиДатДоговоров<>Перечисления.ВидыКонтроля.НеКонтролировать Тогда
			Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Дата) Тогда
				КонтрольКорректностиДатДоговоровОшибка=Ложь;
				Если ЭтотОбъект.ДоговорВзаиморасчетов.ДатаНачала>ЭтотОбъект.Дата Тогда
					#Если Клиент Тогда
						Сообщить("Дата начала действия договора позже даты документа.",СтатусСообщения.Важное);
					#КонецЕсли
					КонтрольКорректностиДатДоговоровОшибка=Истина;
				КонецЕсли;
				Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ДатаКонца) Тогда
					Если ЭтотОбъект.ДоговорВзаиморасчетов.ДатаКонца<ЭтотОбъект.Дата Тогда
						#Если Клиент Тогда
							Сообщить("Дата окончания действия договора ранее даты документа.",СтатусСообщения.Важное);
						#КонецЕсли
						КонтрольКорректностиДатДоговоровОшибка=Истина;
					КонецЕсли;
				КонецЕсли;
				Если КонтрольКорректностиДатДоговоровОшибка И 
					 КонтрольКорректностиДатДоговоров=Перечисления.ВидыКонтроля.Запрещать Тогда
					 ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
					 Возврат ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов",,ЭтаФорма,ДопПараметры);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		// Подставляем контрагента из договора (возможно он не заполнен или не соответствует владельцу договора)
		Если НЕ РеквизитыШапкиДокумента.Найти("Контрагент") = Неопределено Тогда
			ЭтотОбъект.Контрагент = ЭтотОбъект.ДоговорВзаиморасчетов.Владелец;
		КонецЕсли;
		
		НужноПересчитатьТовары = Ложь; // Флаг необходимости пересчета товарной таблицы документа
		НоваяВалюта            = НЕОПРЕДЕЛЕНО;
		НовыйТипЦен            = НЕОПРЕДЕЛЕНО;
		НовыйТипЦенРабот       = НЕОПРЕДЕЛЕНО;
		КодВозвратаЦеныИВалюта = НЕОПРЕДЕЛЕНО;
		
		//Заполним курс валюты взаиморасчетов - если у документа есть соответствующий реквизит
		Если РеквизитыШапкиДокумента.Найти("КурсВалютыВзаиморасчетов") <> Неопределено Тогда 
			Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) Тогда
				ЭтотОбъект.КурсВалютыВзаиморасчетов = дкПолучитьКурсВалютыВзаиморасчетов(ЭтотОбъект, ЭтотОбъект.ДоговорВзаиморасчетов,
				?(ЭтотОбъект.Метаданные().Реквизиты.Найти("ДокументОснование") <> Неопределено, ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование), Неопределено, ЭтотОбъект.ДокументОснование), Неопределено));
				ЭтотОбъект.ОбработкаРеквизита("КурсВалютыВзаиморасчетов");
			КонецЕсли;
		КонецЕсли;
		
		// Подставляем вид оплаты из договора (возможно он не заполнен или не соответствует владельцу договора)
		ИзменилиВидОплаты = Ложь;
		Если НЕ РеквизитыШапкиДокумента.Найти("ВидОплаты") = Неопределено Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов) И ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ВидОплаты) Тогда
				ЭтотОбъект.ВидОплаты = ЭтотОбъект.ДоговорВзаиморасчетов.ВидОплаты;
				ИзменилиВидОплаты = Истина;
			КонецЕсли;
		КонецЕсли;
		
		//Если настройка автоматического изменения валюты и типа цен документа 
		//по договору взаиморасчетов с контрагентом разрешена
		Если (НЕ НеПерезаполнятьПоДоговоруВзаиморасчетов) И обПраво("ИзменятьВалютуПоДоговоруВзаиморасчетов",ПраваПользователя,,ЭтотОбъект) И (НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов)) Тогда
			//Проверим на наличие у документа реквизита валюты
			Если РеквизитыШапкиДокумента.Найти("ВалютаДокумента") <> Неопределено Тогда
				//У документа есть валюта
				//Заполнена ли валюта у договора
				Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов) Тогда
					//Да, валюта у договора заполнена
					Если ЭтотОбъект.ВалютаДокумента <> ЭтотОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
						
						//SHMI++ 
						//изменение валюты документа
						Если ЭтаФорма = Неопределено Тогда
							ЭтотОбъект.ВалютаДокумента = ЭтотОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
							СтруктураКурса = обКурсДляВалюты(ЭтотОбъект.ВалютаДокумента,ЭтотОбъект.Дата);
							ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
						КонецЕсли;
						//SHMI--
						
						НоваяВалюта = ЭтотОбъект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			//Проверим на наличие у документа реквизита типа цен
			Если РеквизитыШапкиДокумента.Найти("ТипЦен") <> Неопределено Тогда
				//У документа есть реквизит тип цен
				Если ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаТМЦ ИЛИ
					ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаАвтомобилей ИЛИ
					ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаОтгрузку ИЛИ
					орПолучитьТипыСделок(Истина).СодержитТип(ТипЗнч(ЭтотОбъект.Ссылка)) Тогда
					//Для документов продажи
					Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПродажи) Тогда
						НовыйТипЦен = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПродажи;
					КонецЕсли; 
				ИначеЕсли ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ ИЛИ
					ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей ИЛИ
					ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку ИЛИ
					орПолучитьТипыСделок(Ложь).СодержитТип(ТипЗнч(ЭтотОбъект.Ссылка)) Тогда
					//Для документов покупки
					Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПокупки) Тогда
						НовыйТипЦен = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПокупки;
					КонецЕсли;
				ИначеЕсли ЭтотОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенАвтоработКонтрагента Тогда
					//Для документа установка цен автораборт
					Если ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенРабот) Тогда
						НовыйТипЦен = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенРабот;
					КонецЕсли;
				Иначе
					Если 	ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.СчетНаОплату") 
						ИЛИ ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.СчетФактураВыданный") Тогда
						//Для документов "СЧЕТ" устанавливаем тип цен продажа
						Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПродажи) Тогда
							НовыйТипЦен = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПродажи;
						КонецЕсли; 
					Иначе
						//Для прочих документов тип цен покупка
						Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПокупки) Тогда
							НовыйТипЦен = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенПокупки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ЭтотОбъект.ТипЦен = НовыйТипЦен Тогда
					НовыйТипЦен = Неопределено;
				КонецЕсли; 
			КонецЕсли;
			
			//Проверим на наличие у документа реквизита типа цен работ
			Если РеквизитыШапкиДокумента.Найти("ТипЦенРабот") <> Неопределено Тогда
				//У документа есть реквизит тип цен работ
				Если ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенРабот) И 
					ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенРабот.ДляРабот Тогда
					НовыйТипЦенРабот = ЭтотОбъект.ДоговорВзаиморасчетов.ТипЦенРабот;
				КонецЕсли;
				
				Если ЭтотОбъект.ТипЦенРабот = НовыйТипЦенРабот Тогда
					НовыйТипЦенРабот = Неопределено;
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли; 
		// Проверим изменились ли реквизиты шапки из-за которых нужно пересчитывать таблицу товаров 	
		Если НоваяВалюта <> Неопределено ИЛИ НовыйТипЦен <> Неопределено ИЛИ НовыйТипЦенРабот <> Неопределено Тогда
			НужноПересчитатьТовары = Истина;
		КонецЕсли;
		
		// Подставляем вид оплаты из договора (возможно он не заполнен или не соответствует владельцу договора)
		НовыйВидОплаты = Неопределено;
		Если (НЕ ИзменилиВидОплаты) И 
			(НовыйТипЦен <> Неопределено ИЛИ НовыйТипЦенРабот <> Неопределено) И
			(НЕ РеквизитыШапкиДокумента.Найти("ВидОплаты") = Неопределено) Тогда
			Если ЗначениеЗаполнено(НовыйТипЦен) И ЗначениеЗаполнено(НовыйТипЦен.ВидОплаты) Тогда
				НовыйВидОплаты = НовыйТипЦен.ВидОплаты;
			ИначеЕсли ЗначениеЗаполнено(НовыйТипЦенРабот) И ЗначениеЗаполнено(НовыйТипЦенРабот.ВидОплаты) Тогда
				НовыйВидОплаты = НовыйТипЦенРабот.ВидОплаты;
			КонецЕсли;
		КонецЕсли;
		
		// проверим блокировку перерасчета скидок
		Попытка
			БлокироватьПерерасчетСкидок = ЭтотОбъект.БлокироватьПерерасчетСкидок;
		Исключение
			БлокироватьПерерасчетСкидок = Ложь;
		КонецПопытки;
		// Если у документа есть реквизит СкидкаНаценка, заполним его из Договора 
		Если(РеквизитыШапкиДокумента.Найти("СкидкаНаценка") <> Неопределено) И (НЕ БлокироватьПерерасчетСкидок) Тогда
			Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ТипСкидкиНаценки) Тогда
				Если ЭтотОбъект.СкидкаНаценка <> ЭтотОбъект.ДоговорВзаиморасчетов.ТипСкидкиНаценки Тогда
					НоваяСкидкаНаценка = ЭтотОбъект.ДоговорВзаиморасчетов.ТипСкидкиНаценки;
				Иначе
					НоваяСкидкаНаценка = ЭтотОбъект.СкидкаНаценка;
				КонецЕсли;
			Иначе
				НоваяСкидкаНаценка = ЭтотОбъект.СкидкаНаценка;
			КонецЕсли;
		Иначе
			НоваяСкидкаНаценка = Неопределено;	
		КонецЕсли;	
		
		// Если есть карточка, нужно заполнить и её
		Если(РеквизитыШапкиДокумента.Найти("Карточка") <> Неопределено) Тогда
			НоваяКарточка=ЭтотОбъект.Карточка;
		КонецЕсли;
		
		// Если установлен флаг что нужно пересчитать таблицу товаров
		Если НужноПересчитатьТовары И НЕ(ЭтаФорма = Неопределено) Тогда
			
			ИмяОбщейФормы = "";
			Попытка
				Кнопка = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ВыборВалюты;
				ИмяОбщейФормы = "ВыборВалюты";
			Исключение
				ИмяОбщейФормы = "ЦеныИВалюта";
			КонецПопытки;
			
			Если ИмяОбщейФормы = "ВыборВалюты" Тогда
				
				// получим общую форму для валюты
				ФормаВыборВалюты = ПолучитьОбщуюФорму("ВыборВалюты", ЭтаФорма);
				ФормаВыборВалюты.мРежимВнешнегоЗаполнения = Истина;
				ФормаВыборВалюты.ТребуетсяПересчет = Истина;
				
				Если НоваяВалюта <> НЕОПРЕДЕЛЕНО Тогда
					ФормаВыборВалюты.НоваяВалюта = НоваяВалюта;
					СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтаФорма.Дата);
					ФормаВыборВалюты.НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
				КонецЕсли;
				
				Если НЕ ФормаВыборВалюты.Открыта() Тогда
					КодВозвратаЦеныИВалюта = ФормаВыборВалюты.ОткрытьМодально(обПраво("ТаймаутДиалогов",ПраваПользователя,,ЭтотОбъект)*4);
				Иначе
					ФормаВыборВалюты.ОсновныеДействияФормыОК(Неопределено);
					#Если Клиент Тогда
						КодВозвратаЦеныИВалюта = КодВозвратаДиалога.ОК;
					#КонецЕсли
				КонецЕсли;
				
			Иначе
			
				// Вызовем общую форму установки цен, валюты и прочего - там все корректно пересчитывается
				ФормаЦеныИВалюта = ПолучитьОбщуюФорму("ЦеныИВалюта",ЭтаФорма);
				ФормаЦеныИВалюта.мРежимВнешнегоЗаполнения = Истина;
				//ФормаЦеныИВалюта.Заголовок = "Внимание! Реквизиты изменены согласно договору. Проверьте их значения";
				Если НоваяВалюта <> НЕОПРЕДЕЛЕНО Тогда
					ФормаЦеныИВалюта.НоваяВалюта = НоваяВалюта;
					СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтотОбъект.Дата);
					ФормаЦеныИВалюта.НовыйКурс = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
				КонецЕсли;
				
				Если НовыйТипЦен <> НЕОПРЕДЕЛЕНО Тогда
					ФормаЦеныИВалюта.НовыйТипЦен = НовыйТипЦен;
				КонецЕсли;
				
				Если НовыйТипЦенРабот <> НЕОПРЕДЕЛЕНО Тогда
					ФормаЦеныИВалюта.НовыйТипЦенРабот = НовыйТипЦенРабот;
				КонецЕсли;
				
				Если НоваяСкидкаНаценка <> Неопределено Тогда 
					ФормаЦеныИВалюта.НоваяСкидкаНаценка = НоваяСкидкаНаценка;
				КонецЕсли;
				
				Если НовыйВидОплаты <> Неопределено Тогда
					ФормаЦеныИВалюта.НовыйВидОплаты = НовыйВидОплаты;
				КонецЕсли;
				
				Если НоваяКарточка <> Неопределено Тогда
					ФормаЦеныИВалюта.НоваяКарточка = НоваяКарточка;
				КонецЕсли;
				
				Если НЕ ФормаЦеныИВалюта.Открыта() Тогда
					КодВозвратаЦеныИВалюта = ФормаЦеныИВалюта.ОткрытьМодально(обПраво("ТаймаутДиалогов",ПраваПользователя,,ЭтотОбъект)*4);
				Иначе
					ФормаЦеныИВалюта.ОсновныеДействияФормыОК(Неопределено);
					#Если Клиент Тогда
						КодВозвратаЦеныИВалюта = КодВозвратаДиалога.ОК;
					#КонецЕсли
				КонецЕсли;
				
			КонецЕсли;
			
			#Если Клиент Тогда
				дкФормаОбновлениеОтображения(ЭтаФорма);
			#КонецЕсли
		Иначе
			
			Если НоваяВалюта <> Неопределено Тогда
				ЭтотОбъект.ВалютаДокумента = НоваяВалюта;
				СтруктураКурса = обКурсДляВалюты(НоваяВалюта,ЭтотОбъект.Дата);
				ЭтотОбъект.КурсДокумента = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
				ЭтотОбъект.ОбработкаРеквизита("ВалютаДокумента",, ЭтаФорма, ДопПараметры);
			КонецЕсли;
			
			Если НовыйТипЦен <> Неопределено Тогда
				ЭтотОбъект.ТипЦен = НовыйТипЦен;
				ЭтотОбъект.ОбработкаРеквизита("ТипЦен",, ЭтаФорма, ДопПараметры);
			КонецЕсли;
			
			Если НовыйТипЦенРабот <> Неопределено Тогда
				ЭтотОбъект.ТипЦенРабот = НовыйТипЦенРабот;
				ЭтотОбъект.ОбработкаРеквизита("ТипЦенРабот",, ЭтаФорма, ДопПараметры);
			КонецЕсли;
			
			Если НоваяСкидкаНаценка <> Неопределено Тогда 
				ЭтотОбъект.СкидкаНаценка = НоваяСкидкаНаценка;
				ЭтотОбъект.ОбработкаРеквизита("СкидкаНаценка",, ЭтаФорма, ДопПараметры);
			КонецЕсли;
			
		КонецЕсли;
		
		Проверка = Истина;
		#Если Клиент Тогда
			Проверка = (КодВозвратаЦеныИВалюта = КодВозвратаДиалога.Отмена);
		#КонецЕсли
		
		// Пересчитаем вознаграждение
		Если (НЕ НужноПересчитатьТовары)ИЛИ(Проверка) Тогда
			Если (ЭтотОбъект.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено)И(ЭтотОбъект.Метаданные().ТабличныеЧасти.Товары.Реквизиты.Найти("Вознаграждение") <> Неопределено) Тогда
				Для каждого ТекСтрока Из ЭтотОбъект.Товары Цикл
					ЭтотОбъект.ОбработкаРеквизита("РассчитатьВознаграждение",ТекСтрока,ЭтаФорма,ДопПараметры);
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		
		// определимся с автоматическим закрытием сделок
		Попытка ЭтотОбъект.АвтоЗакрытиеСделок = ЭтотОбъект.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок; Исключение КонецПопытки;
	КонецЕсли;
	
	// если есть реквизит ИдентификаторГосударственногоКонтракта, заполним его из Договора
	Если Метаданные.НайтиПоТипу(ТипЗнч(ЭтотОбъект)).Реквизиты.Найти("ИдентификаторГосударственногоКонтракта") <> Неопределено Тогда
		ЭтотОбъект.ИдентификаторГосударственногоКонтракта = ЭтотОбъект.ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта;
	КонецЕсли;
	
	//проверка корректности проекта договора для данного документа
	Если РеквизитыШапкиДокумента.Найти("ДоговорВзаиморасчетов")<>Неопределено И
		 РеквизитыШапкиДокумента.Найти("Проект")<>Неопределено И
		 ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект) И
		 ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект<>ЭтотОбъект.Проект Тогда
		Если ЭтаФорма <> Неопределено Тогда
			//условие отключает контроль для только что созданного документа - проверяем только интерактивно измененные договора
			КонтрольПроектов = обПраво("КонтролироватьСоответствиеПроектов", ПраваПользователя,,ЭтотОбъект);
			Если КонтрольПроектов = Перечисления.ВидыКонтроля.Предупреждать Тогда
				#Если Клиент Тогда
					
					//сформируем строку - представление проекта для вывода в сообщении
					Если ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект = Справочники.Проекты.ПустаяСсылка() Тогда
						ПредставлениеПроектаДоговора = "пустой";
					Иначе	
						ПредставлениеПроектаДоговора = СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект);
					КонецЕсли;
					
					Если Вопрос("Проект < " + ПредставлениеПроектаДоговора + " > договора < " + СокрЛП(ЭтотОбъект.ДоговорВзаиморасчетов) + " > отличается от проекта < " + СокрЛП(ЭтотОбъект.Проект) + " > документа! Заменить проект документа проектом договора?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						ЭтотОбъект.Проект = ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект;
						зфОрганизацияПодразделениеИндикация(ЭтаФорма);
					КонецЕсли;
				#КонецЕсли
			Иначе
				ЭтотОбъект.Проект = ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект;
				#Если Клиент Тогда
					зфОрганизацияПодразделениеИндикация(ЭтаФорма);
				#КонецЕсли
			КонецЕсли;
		Иначе
			//для нового документа
			Если обПраво("КонтролироватьСоответствиеПроектов", ПраваПользователя,,ЭтотОбъект) <> Перечисления.ВидыКонтроля.НеКонтролировать Тогда
				ЭтотОбъект.Проект = ЭтотОбъект.ДоговорВзаиморасчетов.ОсновнойПроект;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	// обновим подписи на гиперссылках
	#Если Клиент Тогда
		дкВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
		дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	#КонецЕсли
	Возврат Истина;
КонецФункции // дкОбработкаРеквизитаДоговорВзаиморасчетов()

// Обработка изменения реквизита документа "Контрагент"
//
// Параметры
// ЭтотОбъект	– ДокументОбъект	– документ, реквизит которого обрабатывается.
// ЭтаФорма	– Форма				– Ссылка на форму документа.
// Если значение неопределено, производится программная обработка реквизитов.
// ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
// Булево – Результат выполнения обработки.
//
Функция дкОбработкаРеквизитаКонтрагент(ЭтотОбъект,ЭтаФорма = Неопределено,ДопПараметры = Неопределено)
	
	//список содержит виды отношений, запрещенные в документах данного вида
	СписокЗапрещенныхВидовОтношений = Неопределено;
	Если ДопПараметры <> Неопределено Тогда
		ДопПараметры.Свойство("СписокЗапрещенныхВидовОтношений",СписокЗапрещенныхВидовОтношений);			
	КонецЕсли; 
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.Контрагент) Тогда 
		// если контрагент не указан, то очистим договор
		Попытка
			ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
		Исключение КонецПопытки; 
		Возврат ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов",,ЭтаФорма,ДопПараметры); 
	Иначе
		// если введен контрагент с запрещенным видом отношений - очистим его
		Если ТипЗнч(ЭтотОбъект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если  ТипЗнч(СписокЗапрещенныхВидовОтношений) = Тип("СписокЗначений") Тогда
				Если СписокЗапрещенныхВидовОтношений.НайтиПоЗначению(ЭтотОбъект.Контрагент.ВидОтношений) <> Неопределено Тогда
					Сообщить("В документы запрещен ввод контрагентов с видом " + ЭтотОбъект.Контрагент.ВидОтношений,СтатусСообщения.Внимание);
					ЭтотОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
					Возврат ЭтотОбъект.ОбработкаРеквизита("Контрагент",,ЭтаФорма,ДопПараметры);
				КонецЕсли;
			Иначе	
				Если ЭтотОбъект.Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.КонтактноеЛицо Тогда
					Сообщить("В документы запрещен ввод контрагентов с видом контактное лицо.",СтатусСообщения.Внимание);
					ЭтотОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
					Возврат ЭтотОбъект.ОбработкаРеквизита("Контрагент",,ЭтаФорма,ДопПараметры);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ обПраво("ВводДокументовДляВсехКонтрагентов",ЭтотОбъект.Права,,ЭтотОбъект) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Кураторы.Контрагент,
			|	Кураторы.Куратор
			|ИЗ
			|	РегистрСведений.Кураторы КАК Кураторы
			|ГДЕ
			|	Кураторы.Контрагент = &Контрагент
			|	И Кураторы.Куратор = &Куратор";
			Запрос.УстановитьПараметр("Контрагент",ЭтотОбъект.Контрагент);
			Запрос.УстановитьПараметр("Куратор",ПараметрыСеанса.Пользователь.Сотрудник);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() = 0 Тогда
				ЭтотОбъект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
				Возврат ЭтотОбъект.ОбработкаРеквизита("Контрагент",,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли; 
		Попытка
			//Если договор уже выбран, тогда ничего не делаем
			Если (НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов)) И 
				ЭтотОбъект.ДоговорВзаиморасчетов.Владелец = ЭтотОбъект.Контрагент И
				ЭтотОбъект.ДоговорВзаиморасчетов.ПолучитьОбъект().СоответствуетХозОперации(ЭтотОбъект.ХозОперация) Тогда
				Возврат ИСТИНА; 
			КонецЕсли;
		Исключение
			Возврат ИСТИНА; 
		КонецПопытки; 
		ВидДоговора = Неопределено;
		ТипЦенПокупки = Неопределено;
		ТипЦенПродажи = Неопределено;
		Если ДопПараметры <> Неопределено Тогда
			ДопПараметры.Свойство("ВидДоговора",ВидДоговора);			
			ДопПараметры.Свойство("ТипЦенПокупки",ТипЦенПокупки);
			ДопПараметры.Свойство("ТипЦенПродажи",ТипЦенПродажи);
		Иначе
			ДопПараметры = Новый Структура;
		КонецЕсли; 
		Если ВидДоговора = Неопределено ИЛИ ТипЦенПокупки = Неопределено ИЛИ ТипЦенПродажи = Неопределено Тогда
			ЕстьТипЦен = (ЭтотОбъект.Метаданные().Реквизиты.Найти("ТипЦен") <> Неопределено);
			Если (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаТМЦ) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ОтгрузкаАвтомобилей) ИЛИ
				(ЭтотОбъект.ХозОперация = Справочники.ХозОперации.УстановкаЦенАвтоработКонтрагента) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаОтгрузку) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПрочиеАктивы) Тогда
				Если ВидДоговора = Неопределено Тогда
					ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
					ДопПараметры.Вставить("ВидДоговора",ВидДоговора);
				КонецЕсли; 
				Если ТипЦенПокупки = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПокупки",Справочники.ТипыЦен.ПустаяСсылка());
				КонецЕсли; 
				Если ТипЦенПродажи = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПродажи",?(ЕстьТипЦен,ЭтотОбъект.ТипЦен,Справочники.ТипыЦен.ПустаяСсылка()));
				КонецЕсли; 
			ИначеЕсли (ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоступлениеТМЦ) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ПоставкаАвтомобилей) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.Ценообразование) ИЛИ
				(ЭтотОбъект.ХозОперация.Родитель = Справочники.ХозОперации.ЗаказыНаПоставку) Тогда
				Если ВидДоговора = Неопределено Тогда
					ВидДоговора = Перечисления.ВидыДоговоров.Покупка;
					ДопПараметры.Вставить("ВидДоговора",ВидДоговора);
				КонецЕсли; 
				Если ТипЦенПокупки = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПокупки",?(ЕстьТипЦен,ЭтотОбъект.ТипЦен,Справочники.ТипыЦен.ПустаяСсылка()));
				КонецЕсли; 
				Если ТипЦенПродажи = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПродажи",Справочники.ТипыЦен.ПустаяСсылка());
				КонецЕсли; 
			Иначе
				Если ВидДоговора = Неопределено Тогда
					ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
					ДопПараметры.Вставить("ВидДоговора",ВидДоговора);
				КонецЕсли; 
				Если ТипЦенПокупки = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПокупки",Справочники.ТипыЦен.ПустаяСсылка());
				КонецЕсли; 
				Если ТипЦенПродажи = Неопределено Тогда
					ДопПараметры.Вставить("ТипЦенПродажи",Справочники.ТипыЦен.ПустаяСсылка());
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
		ЭтотОбъект.ДоговорВзаиморасчетов = Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(ЭтотОбъект.Контрагент, ВидДоговора, ЭтотОбъект, ДопПараметры, Истина, Ложь);
	КонецЕсли;
	// выполним действия при изменении договора
	Возврат ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов",,ЭтаФорма,ДопПараметры);
КонецФункции // дкОбработкаРеквизитаКонтрагент()

// начало выбора подразделения
//
// Параметры:
// ЭтаФорма 		 	 - форма, форма переданного документа
// Элемент 		 	 - ЭУ поле ввода, поле вводе подразделения компании
// СтандартнаяОбработка - Булево, признак стандартной обработки выбора в ЭУ
// СтруктураОтбора 	 - структура, структура отбора для формы списка выбора подразделения
//
Процедура дкПодразделениеКомпанииНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		Попытка
			Организация_ = ЭтаФорма.Организация;
		Исключение
			Организация_ = ЭтаФорма.ЭлементыФормы.Организация.Значение;
		КонецПопытки;
		СтруктураОтбора.Вставить("Организация",Организация_);
	КонецЕсли; 
КонецПроцедуры // дкПодразделениеКомпанииНачалоВыбора()

// Получение договора взаиморасчетов контрагента с заданными параметрами.
// Если договора заданного типа нет - создается новый договор.
//
// Параметры:
// Контрагент	– СправочникСсылка.Контрагенты – Ссылка на справочник контрагентов,
//				 договор которого требуется получить.
// ВидДоговора	– ПеречислениеСсылка.ВидыДоговоров – Ссылка на перечисление вида получаемого договора.
//	ЭтотОбъект	- ДокументОбъект - Документ, в рамках которого производится создание нового договора.
//				 Если значение неопределено параметры договора беруться из настроек.
//	ДопПараметры - Структура - Структура, содержащая тип цен покупки и продажи для заполнения нового договора.
//				 Если значение неопределено или не определен тот или иной тип цен - они берутся из настроек.
// УчитыватьПринадлежность - Булево, определяет нужно ли дополнительно проверять соответствие подразделения, организации и т.д.
//				 основного договора с данными объекта
//
// Возвращаемое значение:
// СправочникСсылка.ДоговорыВзаиморасчетов – Ссылка на справочник ДоговорыВзаиморасчетов с найденным договором
//											 или вновь созданным.
Функция дкПолучитьДоговорВзаиморасчетов(Контрагент,ВидДоговора,ЭтотОбъект = Неопределено,ДопПараметры = Неопределено, УчитыватьПринадлежность = Ложь, СоздаватьТолькоПродажи = Ложь) Экспорт
	
	Справочники.Контрагенты.ПолучитьДоговорВзаиморасчетов(Контрагент, ВидДоговора, ЭтотОбъект, ДопПараметры, УчитыватьПринадлежность, СоздаватьТолькоПродажи);
	
КонецФункции // дкПолучитьДоговорВзаиморасчетов()

#Если Клиент Тогда
	
// начало выбора банковского счета
//
// Параметры:
// ЭтаФорма 		- форма, форма переданного документа
// Элемент 		- ЭУ поле ввода, поле ввода кассы
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// СтруктураОтбора - Структура, структура ограничений при выборе данных
//
Процедура дкБанковскийСчетНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	Если НЕ СтруктураОтбора.Свойство("ПодразделениеКомпании") Тогда
		СтруктураОтбора.Вставить("ПодразделениеКомпании",ЭтаФорма.ПодразделениеКомпании);
	КонецЕсли;
	
	//++бизтех++
	
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		СтруктураОтбора.Вставить("Организация",ЭтаФорма.Организация);
	КонецЕсли; 
	
	//Владельцы = Новый СписокЗначений;
	//Владельцы.Добавить(ЭтаФорма.Организация);
	//Родитель = ЭтаФорма.ПодразделениеКомпании;
	//
	//Пока НЕ обЗначениеНеЗаполнено(Родитель) Цикл
	//	Владельцы.Добавить(Родитель);
	//	Родитель = Родитель.Родитель;
	//КонецЦикла;
	//
	//СтруктураОтбора.Вставить("Владелец", Владельцы);
	//--бизтех--
	
КонецПроцедуры // дкБанковскийСчетНачалоВыбора()

Процедура дкОстаткиПоВзаиморасчетам(Контрагент, ДоговорВзаиморасчетов) Экспорт
	
	Отчет = Отчеты.Взаиморасчеты.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета  = Отчет.Метаданные();
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Дата(1,1,1));
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", РабочаяДата);
	КонецЕсли;
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			ИмяФункции = СокрЛП(ТекПоказатель.Поле);
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ИмяПоказателя = СтрЗаменить(ТекВложенныйПоказатель.Поле, ИмяФункции+".", "");
				ТекВложенныйПоказатель.Использование = (ИмяПоказателя="ИтогоСумма" ИЛИ ИмяПоказателя="ИтогоСуммаБаз");
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			
			ПозицияТочки = Найти(ТекПоказатель.Поле, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяПоказателя = Сред(ТекПоказатель.Поле, ПозицияТочки+1);
			Иначе
				ИмяПоказателя = СокрЛП(ТекПоказатель.Поле);
			КонецЕсли;
			
			ТекПоказатель.Использование = (ИмяПоказателя="ИтогоСумма" ИЛИ ИмяПоказателя="ИтогоСуммаБаз");
		КонецЕсли;
	КонецЦикла;
	
	Отбор.Элементы.Очистить();
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Контрагент");
	ТекОтбор.ПравоеЗначение = Контрагент;
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДоговорВзаиморасчетов");
	ТекОтбор.ПравоеЗначение = ДоговорВзаиморасчетов;
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	ГруппировкаКонтрагент = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Контрагент");
	ГруппировкаДоговор    = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаКонтрагент.Структура, "ДоговорВзаиморасчетов");
	ГруппировкаСделка     = ОтчетыСервер.СКД_ДобавитьГруппировку(ГруппировкаДоговор.Структура, "Сделка");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры

// нажатие на гиперссылку, показывающую текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма 			- форма, форма переданного документа
// Элемент 			- ЭУ надпись, служит для вывода состояния взаиморасчетов
// РеквизитКонтрагента - СправочникСсылка.Контрагенты, контрагент документа,
// по которому выводится состояние взаиморасчетов
// РеквизитКонтрагента - СправочникСсылка.договорыВзаиморасчетов, договор
// контрагента, по которому выводится состояние взаиморасчетов
//
Процедура дкВзаиморасчетыНажатие(ЭтаФорма,Элемент,РеквизитКонтрагента = Неопределено,РеквизитДоговорВзаиморасчетов = Неопределено) Экспорт
	
	// проверки
	Контрагент = Неопределено; ДоговорВзаиморасчетов = Неопределено;
	
	Попытка
		Если РеквизитКонтрагента = Неопределено И ЗначениеЗаполнено(ЭтаФорма.Контрагент) Тогда
			Контрагент = ЭтаФорма.Контрагент;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма[РеквизитКонтрагента]) Тогда
			Контрагент = ЭтаФорма[РеквизитКонтрагента];
		Иначе
			Возврат;
		КонецЕсли;
	Исключение
		Возврат; // раз нет контрагента, то дальше и делить нечего
	КонецПопытки;
	
	Попытка
		Если РеквизитДоговорВзаиморасчетов = Неопределено И ЗначениеЗаполнено(ЭтаФорма.ДоговорВзаиморасчетов) Тогда
			ДоговорВзаиморасчетов = ЭтаФорма.ДоговорВзаиморасчетов;
		ИначеЕсли ЗначениеЗаполнено(ЭтаФорма[РеквизитДоговорВзаиморасчетов]) Тогда
			ДоговорВзаиморасчетов = ЭтаФорма[РеквизитДоговорВзаиморасчетов];
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	дкОстаткиПоВзаиморасчетам(Контрагент, ДоговорВзаиморасчетов);
	
	дкВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
	
КонецПроцедуры // дкВзаиморасчетыНажатие()

// процедура осуществляет выбор значения элемента диалога. Если реквизит имеет составной тип данных,
// то открывается контекстный список для выбора вида значения
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// ИмяРеквизита - Строка. Имя реквизита для которого выбираем значение
// Элемент  - элемент диалога для которого выбираем значение
// СтруктураФильтров - Структура. Ключ - имя фильтра, Значение - значение фильтра
//
// Возвращаемое значение:
// 	 Форма - форма выбора
//
Функция дкВыборЗначенияРеквизита(ЭтаФорма,ИмяРеквизита,Элемент,СтандартнаяОбработка,СтруктураФильтров = Неопределено,ИмяТабличнойЧасти = "Товары") Экспорт
	Возврат зфВыборЗначенияРеквизита(ЭтаФорма,ИмяРеквизита,Элемент,СтандартнаяОбработка,СтруктураФильтров,ИмяТабличнойЧасти);
КонецФункции // дкВыборЗначенияРеквизита()

// формирует заголовок гиперссылки, показывающей текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкВывестиЗаголовокВзаиморасчеты(ЭтаФорма) Экспорт
	Если ЭтаФорма <> Неопределено Тогда
		// проверка на договор
		Если ЭтаФорма.ЭлементыФормы.Найти("ДоговорВзаиморасчетов") = Неопределено Тогда
			Возврат 
		КонецЕсли;
		
		//получим элемент на форме
		Попытка
			НадписьНаФорме = ЭтаФорма.ЭлементыФормы.тВзаиморасчеты;
			ДляАРМ = Ложь;
		Исключение
			НадписьНаФорме = ЭтаФорма.ЭлементыФормы.тВзаиморасчетыДляАРМ;
			ДляАРМ = Истина;
		КонецПопытки;	
		
		НадписьНаФорме.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		Если обЗначениеНеЗаполнено(ЭтаФорма.ДоговорВзаиморасчетов) Тогда
			// пустой договор
			НадписьНаФорме.Заголовок = " < Договор не выбран > ";
		Иначе
			// получим долг
			СтруктураОтбора = Новый Структура("Контрагент,ДоговорВзаиморасчетов",ЭтаФорма.Контрагент,ЭтаФорма.ДоговорВзаиморасчетов);
			тзДолги = РегистрыНакопления.ВзаиморасчетыКомпании.Остатки(,СтруктураОтбора,,"Сумма,СуммаУпр");
			Долг = тзДолги.Итог("Сумма");
			// выведем на экран этот долг
			Если ДляАРМ Тогда
				НадписьНаФорме.Заголовок = "Долг контрагент" + ?(Долг < 0,"у","а") + ": " + Формат(?(Долг < 0,-Долг,Долг),"ЧДЦ = 2; ЧН = 0,00") + " " + СокрЛП(ЭтаФорма.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов.Наименование);
			Иначе
				НадписьНаФорме.Заголовок = "По договору долг контрагент" + ?(Долг < 0,"у","а") + " составляет: " + Формат(?(Долг < 0,-Долг,Долг),"ЧДЦ = 2; ЧН = 0,00") + " " + СокрЛП(ЭтаФорма.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов.Наименование);
			КонецЕсли;
			Если Долг < 0 Тогда
				НадписьНаФорме.ЦветТекста = WebЦвета.ТемноКрасный;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры // дкВывестиЗаголовокВзаиморасчеты()

// формирует заголовок гиперссылки, показывающей текущее состояние кассы компании
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// Элемент 	 - надпись, в не выводится состояние кассы
// КассаКомпании - СправочникСсылка.КассыКомпании или Справочник.Ссылка.БанковскиеСчета, касса, состояние которой выводится
//
Процедура дкВывестиЗаголовокДенежныеСредства(ЭтаФорма,Элемент,КассаКомпании) Экспорт
	Если ТипЗнч(КассаКомпании) = Тип("СправочникСсылка.КассыКомпании") Тогда
		Если обЗначениеНеЗаполнено(КассаКомпании) Тогда
			// Пустая касса
			Элемент.Заголовок = " < Касса не выбрана > ";
		Иначе
			// Определим остаток в какой валюте необходимо вывести сумму
			ЭтотОбъект = ЭтаФорма.ДокументОбъект;
			Валюта = ?(КассаКомпании.МноговалютнаяКасса, ЭтотОбъект.ВалютаДокумента, КассаКомпании.ВалютаДенежныхСредств);
			
			// Получим остаток
			СтруктураОтбора	 = Новый Структура("Валюта, СтруктурнаяЕдиница", Валюта, КассаКомпании);
			Остаток			 = РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(, СтруктураОтбора,, "Сумма").Итог("Сумма");
			
			// Выведем на экран этот остаток
			Элемент.Заголовок = "Остаток в кассе составляет: " + Формат(Остаток, "ЧЦ = 15; ЧДЦ = 2; ЧН = 0") + " " + СокрЛП(Валюта.Наименование);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(КассаКомпании) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		Если обЗначениеНеЗаполнено(КассаКомпании) Тогда
			// Пустой расчетный счет
			Элемент.Заголовок = " < Расчетный счет не выбран > ";
		Иначе
			// Определим остаток в какой валюте необходимо вывести сумму
			ЭтотОбъект = ЭтаФорма.ДокументОбъект;
			Валюта = КассаКомпании.ВалютаДенежныхСредств;
			
			// Получим остаток
			СтруктураОтбора	 = Новый Структура("Валюта, СтруктурнаяЕдиница", Валюта, КассаКомпании);
			Остаток			 = РегистрыНакопления.ДенежныеСредстваКомпании.Остатки(, СтруктураОтбора,, "Сумма").Итог("Сумма");
			
			// Выведем на экран этот остаток
			Элемент.Заголовок = "Остаток на расчетном счете составляет: " + Формат(Остаток, "ЧЦ = 15; ЧДЦ = 2; ЧН = 0") + " " + СокрЛП(Валюта.Наименование);
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры // дкВывестиЗаголовокДенежныеСредства()

// Выводит сумму по табличной части документа "Товары"
//
// Параметры:
// ЭтаФорма - форма, форма документа
//
Процедура дкВывестиЗаголовокСуммаДокумента(ЭтаФорма) Экспорт
	Если ЭтаФорма <> Неопределено Тогда
		// попытаемся пересчитать сумму документа
		
		Попытка 
			ЭтаФорма.ВывестиЗаголовокСуммаДокумента(ЭтаФорма);
			Возврат;
		Исключение
		КонецПопытки;
		
		Попытка
			ВремСумма = ЭтаФорма.РассчитатьСуммуВсего();
		Исключение
			Попытка ВремСумма = ЭтаФорма.Товары.Итог("СуммаВсего"); Исключение КонецПопытки;
		КонецПопытки;
		Попытка
			//Если ВремСумма <> ЭтаФорма.СуммаДокумента Тогда ЭтаФорма.СуммаДокумента = ВремСумма; КонецЕсли;
		Исключение
		КонецПопытки;	
		// обновим надпись валюты и суммы документа
		ТекстВалюта = "";
		Попытка	
			ТекстВалюта = "Валюта: " + СокрЛП(ЭтаФорма.ВалютаДокумента) + " (" + Формат(ЭтаФорма.КурсДокумента,"ЧДЦ = 4") + ")";
			Попытка
				Если ВремСумма <> Неопределено Тогда
					ТекстСумма = " ИТОГО: " + Формат(ВремСумма,"ЧДЦ = 2; ЧН = 0,00");
				КонецЕсли; 
			Исключение
			КонецПопытки;
			ЭтаФорма.ЭлементыФормы.тСуммаДокумента.Заголовок = ТекстВалюта + ТекстСумма;
		Исключение 
		КонецПопытки;
		// здесь же установим подписи количества строк в заголовках страниц основной панели
		ТекстЦена = ""; ТекстЦенаРаботы = ""; ТекстСкидка = "";
		Попытка ТекстЦена = ?(обЗначениеНеЗаполнено(ЭтаФорма.ТипЦен)," < не указан > ",СокрЛП(ЭтаФорма.ТипЦен.Наименование)); Исключение КонецПопытки;
		Попытка ТекстЦенаРаботы = ?(обЗначениеНеЗаполнено(ЭтаФорма.ТипЦенРабот)," < не указан > ",СокрЛП(ЭтаФорма.ТипЦенРабот.Наименование)); Исключение КонецПопытки;
		ТекстСкидка = "";
		Попытка ТекстСкидка = ТекстСкидка + "Карта: " + ?(обЗначениеНеЗаполнено(ЭтаФорма.Карточка)," < нет > ",СокрЛП(ЭтаФорма.Карточка.Наименование)) + "; "; Исключение КонецПопытки;
		
		Попытка
			СкидкаДокумента = ЭтаФорма.СкидкаНаценка;
			
			ТекстСкидка = ТекстСкидка + "Скидка: ";
			Если СкидкаДокумента.Пустая() Тогда
				ТекстСкидка = ТекстСкидка + " < нет > ";	
			Иначе
				ТекстСкидка = ТекстСкидка + СокрЛП(СкидкаДокумента.Наименование);
				ТекстСкидка = ТекстСкидка + " (" + ЭтаФорма.ЗначениеСкидкиНаценки + " " + ?(СкидкаДокумента.СпособВычисления = Перечисления.СкидкиСпособВычисления.Относительная, "%", Строка(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить())) + ")";
			КонецЕсли;			
		Исключение
		КонецПопытки;
		
		Мет = ЭтаФорма.ЭтотОбъект.Метаданные();
		Для Каждого ТаблЧасть Из Мет.ТабличныеЧасти Цикл
			Попытка ЭтаФорма.ЭлементыФормы.ОсновнаяПанель.Страницы[ТаблЧасть.Имя].Заголовок = СокрЛП(ТаблЧасть.Синоним) + " (" + СокрЛП(ЭтаФорма[ТаблЧасть.Имя].Количество()) + " поз.)"; Исключение КонецПопытки;
			// и тут же попытаемся установить текст подвала для колоники "Работы"
			Если ТаблЧасть.Имя = "Работы" Тогда
				Попытка ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Цена.ТекстПодвала = ТекстЦенаРаботы; Исключение КонецПопытки;
			//и для остальных колонок
			Иначе
				Попытка ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Цена.ТекстПодвала = ТекстЦена; Исключение КонецПопытки;
			КонецЕсли;
			Попытка ЭтаФорма.ЭлементыФормы[ТаблЧасть.Имя].Колонки.Номенклатура.ТекстПодвала = ?(ПустаяСтрока(ТекстСкидка),"",ТекстСкидка); Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры // дкВывестиЗаголовокСуммаДокумента()

// Формирует заголовок гиперссылки, показывающей текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкВывестиЗаголовокСчетФактура(ЭтаФорма) Экспорт
	// ищем счет фактуру
	МассивВидов = Новый Массив(2); МассивВидов[0] = "СчетФактураПолученный"; МассивВидов[1] = "СчетФактураВыданный";
	МассивПодчиненных = дкПолучитьМассивПодчиненных(Этаформа.Ссылка,МассивВидов);
	Если МассивПодчиненных <> Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		// нашли
		СФ = МассивПодчиненных[0].Ссылка;
		Попытка
			ЭтаФорма.ЭлементыФормы.тСчетФактура.Заголовок = СокрЛП(СФ.Метаданные().Синоним) + " №" + СокрЛП(СФ.Номер) + " от " + Формат(СФ.Дата,"ДФ = dd.MM.yyyy");
		Исключение
		КонецПопытки; 
	Иначе
		// не нашли
		Попытка
			ЭтаФорма.ЭлементыФормы.тСчетФактура.Заголовок = "Ввести счет-фактуру";
		Исключение
		КонецПопытки; 
	КонецЕсли;
КонецПроцедуры // дкВывестиЗаголовокСчетФактура()

// Формирует заголовок гиперссылки, показывающей текущее состояние взаиморасчетов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкПерезаполнитьСчетФактуру(ЭтаФорма) Экспорт
	
	Если НЕ обПраво("ПерезаполнятьСчетаПриРедактированииДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	// ищем счета
	МассивВидов = Новый Массив(3);МассивВидов[0] = "СчетФактураПолученный"; МассивВидов[1] = "СчетФактураВыданный"; МассивВидов[2] = "СчетНаОплату";
	МассивПодчиненных = дкПолучитьМассивПодчиненных(ЭтаФорма.ЭтотОбъект.Ссылка,МассивВидов);
	Если МассивПодчиненных <> Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		// если нашли
		ОбновлениеДокументовОплаты = ПолучитьФорму("ОбщаяФорма.ОбновлениеДокументовОплаты",, ЭтаФорма);
		ОбновлениеДокументовОплаты.Документ = ЭтаФорма.ЭтотОбъект.Ссылка;
		Для Каждого ЭлементМассива Из МассивПодчиненных Цикл
			Если НЕ ЭлементМассива.ПометкаУдаления Тогда
				Если ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.СчетНаОплату") И обЗначениеНеЗаполнено(ОбновлениеДокументовОплаты.СчетНаОплату) Тогда
					ОбновлениеДокументовОплаты.СчетНаОплату = ЭлементМассива;
				ИначеЕсли НЕ ТипЗнч(ЭлементМассива) = Тип("ДокументСсылка.СчетНаОплату") И обЗначениеНеЗаполнено(ОбновлениеДокументовОплаты.СчетФактура) Тогда
					ОбновлениеДокументовОплаты.СчетФактура = ЭлементМассива;
				ИначеЕсли ЗначениеЗаполнено(ОбновлениеДокументовОплаты.СчетНаОплату) И ЗначениеЗаполнено(ОбновлениеДокументовОплаты.СчетФактура) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(ОбновлениеДокументовОплаты.СчетНаОплату) И НЕ ЗначениеЗаполнено(ОбновлениеДокументовОплаты.СчетФактура) Тогда
			Сообщить("Найденные документы оплаты помечены на удаление. Редактирование документов оплаты отменено.", СтатусСообщения.Информация);
			Возврат;
		КонецЕсли;
		ОбновлениеДокументовОплаты.Открыть();
	КонецЕсли;
	
КонецПроцедуры // дкПерезаполнитьСчетФактуру()

// Вывод заголовка формы документа
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкВывестиЗаголовокФормы(ЭтаФорма) Экспорт
	// обновим заголовок формы
	Номер = " № " + СокрЛП(ЭтаФорма.Номер); Дата = " от " + Формат(ЭтаФорма.Дата,"ДФ = dd.MM.yyyy");
	Попытка	ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права; Исключение ПраваПользователя = НЕОПРЕДЕЛЕНО; КонецПопытки; 
	Если обПраво("ПредставлениеАвторовПоПолномуНаименованию",ПраваПользователя,,ЭтаФорма) Тогда
		Если обЗначениеНеЗаполнено(ЭтаФорма.Автор.Сотрудник) Тогда
			Автор = " (" + СокрЛП(ЭтаФорма.Автор.Наименование) + ")";	
		Иначе
			Автор = " (" + СокрЛП(ЭтаФорма.Автор.Сотрудник.Наименование) + ")";
		КонецЕсли;
	Иначе
		Автор = " (" + СокрЛП(ЭтаФорма.Автор.Код) + ")";
	КонецЕсли;
	Если ЭтаФорма.ЭтотОбъект.Проведен Тогда
		СостояниеДокумента = " Проведен";
	ИначеЕсли ЭтаФорма.ЭтотОбъект.ПометкаУдаления Тогда
		СостояниеДокумента = " Удален";
	ИначеЕсли НЕ ЭтаФорма.ЭтотОбъект.ЭтоНовый() Тогда
		СостояниеДокумента = " Записан";
	Иначе
		СостояниеДокумента = " Новый";
	КонецЕсли;
	Попытка ЭтаФорма.Заголовок = ЭтаФорма.ЭтотОбъект.ХозОперация.Наименование + Номер + Дата + Автор + СостояниеДокумента ;
	Исключение ЭтаФорма.Заголовок = ЭтаФорма.ЭтотОбъект.Метаданные().Представление() + Номер + Дата + Автор + СостояниеДокумента;
	КонецПопытки;
КонецПроцедуры // дкВывестиЗаголовокФормы()

// Возвращает таблицу остатков по КассеККМ
// Параметры:
//	КассаККМ - СправочникСсылка.КассыККМ
//	НаМомент - Момент времени на который получаем остатки
//
Функция дкПолучитьОстатокПоКассеККМ(КассаККМ,НаМомент) Экспорт
	
	Документ = Неопределено;
	Если ТипЗнч(НаМомент) = Тип("Дата") Тогда
		ДатаРасчета = НаМомент;
	ИначеЕсли ТипЗнч(НаМомент) = Тип("МоментВремени") Тогда
		Документ    = НаМомент.Ссылка;
		ДатаРасчета = НаМомент.Дата;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|КассыККМ.СпособОплаты КАК ТипОплаты,
	|СУММА(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвижения
	|			И КассыККМ.Сумма > 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ) -
	|Сумма(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвиженияВозврат
	|			И КассыККМ.Сумма > 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ) КАК Сумма,
	|
	|-1* (СУММА(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвижения
	|			И КассыККМ.Сумма < 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ) -
	|Сумма(ВЫБОР
	|	КОГДА КассыККМ.ВидДвижения = &ВидДвиженияВозврат
	|			И КассыККМ.Сумма < 0
	|		ТОГДА ЕСТЬNULL(КассыККМ.Сумма, 0)
	|	ИНАЧЕ 0
	|КОНЕЦ)) КАК СуммаВозврат
	|
	|ИЗ
	|	РегистрНакопления.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.Период <= &НаМомент
	|	И КассыККМ.КассаККМ = &КассаККМ" + ?(Документ = Неопределено, "", " И 
	|	(НЕ КассыККМ.Регистратор = &Ссылка)") + "
	|
	|СГРУППИРОВАТЬ ПО
	|	КассыККМ.СпособОплаты";
	Запрос.УстановитьПараметр("НаМомент",           ДатаРасчета);
	Запрос.УстановитьПараметр("КассаККМ",           КассаККМ);
	Запрос.УстановитьПараметр("Ссылка",             Документ);
	Запрос.УстановитьПараметр("ВидДвижения",        ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияВозврат", ВидДвиженияНакопления.Расход);
	
	тзЗапрос = Новый ТаблицаЗначений;
	тзЗапрос.Колонки.Добавить("ТипОплаты");
	тзЗапрос.Колонки.Добавить("Сумма");
	тзЗапрос.Колонки.Добавить("СуммаВозврат");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 И Выборка.СуммаВозврат = 0 Тогда 
			Продолжить; 
		ИначеЕсли Выборка.ТипОплаты.Объект = Перечисления.ТипыОплатыВРознице.Наличные И Выборка.Сумма = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = тзЗапрос.Добавить();
		НоваяСтрока.ТипОплаты = Выборка.ТипОплаты; 
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СуммаВозврат = 0;
		Если Выборка.ТипОплаты.Объект = Перечисления.ТипыОплатыВРознице.Наличные Тогда
			НоваяСтрока.Сумма = НоваяСтрока.Сумма-Выборка.СуммаВозврат;
		Иначе
			НоваяСтрока.СуммаВозврат = Выборка.СуммаВозврат;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат тзЗапрос;
КонецФункции

// нажатие на гиперссылку, показывающую текущее состояние кассы
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// КассаКомпании - СправочникСсылка.КассыКомпании, касса, состояние которой выводится
//
Процедура дкДенежныеСредстваНажатие(ЭтаФорма,КассаКомпании) Экспорт
	
	// проверки
	Если обЗначениеНеЗаполнено(КассаКомпании) Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = Отчеты.ОстаткиИОборотыДенежныхСредствКомпании.Создать();
	Отчет.ЗаполнитьНачальныеНастройки();
	
	МетаданныеОтчета = Отчет.Метаданные();
	
	ВариантОтчета     = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки;
	НастройкиВарианта = ВариантОтчета.Настройки;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаНачала") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала",    Дата(1,1,1));
	КонецЕсли;
	
	Если НЕ НастройкиВарианта.ПараметрыДанных.Элементы.Найти("ДатаОкончания") = Неопределено Тогда
		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", РабочаяДата);
	КонецЕсли;
	
	ИмяФормыОтчета = МетаданныеОтчета.ПолноеИмя() + ".Форма";
	
	Показатели      = НастройкиВарианта.Выбор;
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ТекВложенныйПоказатель.Использование = Истина;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Отбор.Элементы.Очистить();
	
	ТекОтбор = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ТекОтбор.Использование  = Истина;
	ТекОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница");
	ТекОтбор.ПравоеЗначение = КассаКомпании;
	ТекОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	
	СтруктураОтчета.Очистить();
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	//добавляем измерения строки
	НоваяГруппировка = ОтчетыСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Валюта");
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("Вариант",                 НастройкиВарианта);
	СтруктураПараметров.Вставить("ЗаполнитьНастроки",       Ложь);
	СтруктураПараметров.Вставить("КлючВарианта",            ВариантОтчета.Имя);
	СтруктураПараметров.Вставить("ПредставлениеВарианта",   ВариантОтчета.Представление);
	СтруктураПараметров.Вставить("СформироватьПриОткрытии", Истина);
	СтруктураПараметров.Вставить("ВариантЗагрузкиПериода",  "ВариантСтандартногоПериода.ПроизвольныйПериод");
	
	ОткрытьФорму(ИмяФормыОтчета, СтруктураПараметров);
	
КонецПроцедуры // дкДенежныеСредстваНажатие()

// Начало выбора договора
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// Элемент 	 - ЭУ поле ввода, поле ввода договора
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// СтруктураОтбора - Структура, структура ограничений при выборе данных
//
Процедура дкДоговорНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		Попытка
			СтруктураОтбора.Вставить("Организация",ЭтаФорма.Организация);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	Если НЕ СтруктураОтбора.Свойство("ПодразделениеКомпании") Тогда
		Попытка
			СтруктураОтбора.Вставить("ПодразделениеКомпании",ЭтаФорма.ПодразделениеКомпании);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	Если НЕ СтруктураОтбора.Свойство("ДатаНачала") Тогда
		Попытка
			СтруктураОтбора.Вставить("ДатаНачала",ЭтаФорма.Дата);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	// если контрагент не пустой, то...
	Попытка
		Если обЗначениеНеЗаполнено(ЭтаФорма.Контрагент) Тогда		 
			//Нет контрагента - ничего не делаем
			СтандартнаяОбработка = Ложь;
		Иначе
			// установим отбор по владельцу для формы выбора договора
			Элемент.ВыборПоВладельцу = ЭтаФорма.Контрагент;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры // дкДоговорНачалоВыбора()

// Получение данных для открытия подбора по партиям
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкИнициализацияПодбораПоПартиям(ЭтаФорма) Экспорт
	// передадим построителю запрос
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|	ПартииТоваровКомпанииОстатки.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиница,
	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.Партия КАК Документ,
	|	ПартииТоваровКомпанииОстатки.Партия.Контрагент КАК Контрагент,
	|	СУММА(0) КАК Оборот,
	|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток,
	|	СУММА(ПартииТоваровКомпанииОстатки.СуммаУпрОстаток) КАК СуммаУпр
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонца,{СкладКомпании КАК СкладКомпании, Номенклатура КАК Номенклатура, ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры}) КАК ПартииТоваровКомпанииОстатки
	|
	|ГДЕ 
	|	НЕ ПартииТоваровКомпанииОстатки.Партия ЕСТЬ NULL
	|
	|{ГДЕ 
	|	ПартииТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура
	|}
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровКомпанииОстатки.Номенклатура,
	|	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.Партия
	|
	|ИМЕЮЩИЕ
	|	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	Документ Убыв";
	
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Текст = ТекстЗапроса;
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.Добавить("СкладКомпании");
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.СкладКомпании.ВидСравнения = ВидСравнения.Равно;
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.Добавить("Номенклатура");
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.Номенклатура.ВидСравнения = ВидСравнения.Равно;
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.Добавить("ХарактеристикаНоменклатуры");
	ЭтаФорма.ОбработкаПодбораПартий.Построитель.Отбор.ХарактеристикаНоменклатуры.ВидСравнения = ВидСравнения.Равно;
КонецПроцедуры // дкИнициализацияПодбораПоПартиям()

// начало выбора кассы
//
// Параметры:
// ЭтаФорма 		- форма, форма переданного документа
// Элемент 		- ЭУ поле ввода, поле ввода кассы
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// СтруктураОтбора - Структура, структура ограничений при выборе данных
//
Процедура дкКассаКомпанииНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		СтруктураОтбора.Вставить("Организация",ЭтаФорма.Организация);
	КонецЕсли; 
	Если НЕ СтруктураОтбора.Свойство("ПодразделениеКомпании") Тогда
		СтруктураОтбора.Вставить("ПодразделениеКомпании",ЭтаФорма.ПодразделениеКомпании);
	КонецЕсли; 
КонецПроцедуры // дкКассаКомпанииНачалоВыбора()

// нажатие "лупы" в поле "комментарий"
// предназначена для редактирования многострочного комментария
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - ЭУ поле ввода, поле ввода склада
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкКомментарийОткрытие(ЭтаФорма,Элемент,СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат; КонецЕсли; 
	Комментарий = СтрЗаменить(Элемент.Значение,"¶",Символы.ПС);
	Если ВвестиСтроку(Комментарий,"Введите комментарий",0,Истина) Тогда
		Элемент.Значение = СокрЛП(Комментарий);
	КонецЕсли;
КонецПроцедуры // дкКомментарийОткрытие()

// Начало выбора контрагента
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - ЭУ поле ввода, поле ввода контрагента
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкКонтрагентНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка) Экспорт
	// отменим стандартную обработку
	СтандартнаяОбработка=Ложь;
	
	// создадим форму
	ФормаВыбора = Справочники.Контрагенты.ПолучитьФормуВыбора(,Элемент,ЭтаФорма);
	ФормаВыбора.ЗакрыватьПриВыборе=Истина;
	ФормаВыбора.ЗакрыватьПриЗакрытииВладельца=Истина;
	
	// поставим отборы
	// отбор по виду контрагента
	ФормаВыбора.Отбор.ВидКонтрагента.ВидСравнения=ВидСравнения.НеРавно;
	ФормаВыбора.Отбор.ВидКонтрагента.Значение=Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
	ФормаВыбора.Отбор.ВидКонтрагента.Использование=Истина;
	// сделаем отбор не снимаемым
	ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ВидКонтрагента.Доступность=Ложь;
	
	// запретим выбор групп
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	ФормаВыбора.Открыть();
КонецПроцедуры // дкКонтрагентНачалоВыбора()

// начало выбора МОЛа
// 	Параметры:
//
// ЭтаФорма 	 - форма, форма переданного документа
// Элемент 		 - ЭУ поле ввода, поле ввода склада
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//	ДопПодразделение - СправочникСсылка.ПодразделенияКомпании - если указано, то будем проверять по нему,
//	      иначе по стандартному реквизиту
//
Процедура дкМОЛНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, ДопПодразделение = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	Если ДопПодразделение = Неопределено Тогда
		Попытка
			ВыбПодразделение = ЭтаФорма.ПодразделениеКомпании;
		Исключение
		КонецПопытки;
	Иначе
		ВыбПодразделение = ДопПодразделение;
	КонецЕсли;
	
	Если ВыбПодразделение = Неопределено Тогда
		// подразделение не указано - ничего не делаем
	Иначе
		// установим отбор в форме выбора по подразделению
		ФормаВыбораСотрудники = Справочники.Сотрудники.ПолучитьФормуВыбора(, Элемент, );
		ФормаВыбораСотрудники.СправочникСписок.Отбор.Подразделение.Значение = ВыбПодразделение;
		ФормаВыбораСотрудники.СправочникСписок.Отбор.Подразделение.Использование = Истина;
		ФормаВыбораСотрудники.СправочникСписок.Отбор.Организация.Значение = ВыбПодразделение.Организация;
		ФормаВыбораСотрудники.СправочникСписок.Отбор.Организация.Использование = Истина;
		ФормаВыбораСотрудники.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		ФормаВыбораСотрудники.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры // дкМОЛНачалоВыбора()

// Выбор "Организации" и "Подразделения" в специальной форме
//
// Параметры:
// ЭтаФорма 	- форма, форма переданного документа
// Элемент		- ЭУ поле ввода, поле ввода "Организации" и "Подразделения"
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// Ограничения - Структура, структура ограничений при выборе данных
//
Процедура дкОрганизацияПодразделениеНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, Ограничения = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	
	ФормаОбщихРеквизитов = ПолучитьОбщуюФорму("ВыборОбщихРеквизитов");
	ФормаОбщихРеквизитов.Ограничения = Ограничения;
	ФормаОбщихРеквизитов.ВладелецФормы = ЭтаФорма;
	ФормаОбщихРеквизитов.Открыть();
КонецПроцедуры // дкОрганизацияПодразделениеНачалоВыбора()

// Начало выбора склада
//
// Параметры:
// ЭтаФорма	 - форма, форма переданного документа
// Элемент		 - ЭУ поле ввода, поле ввода склада
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// СтруктураОтбора - Структура, структура ограничений при выборе данных
//
Процедура дкСкладКомпанииНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		СтруктураОтбора.Вставить("Организация",ЭтаФорма.Организация);
	КонецЕсли; 
	Если НЕ СтруктураОтбора.Свойство("ПодразделениеКомпании") Тогда
		СтруктураОтбора.Вставить("ПодразделениеКомпании",ЭтаФорма.ПодразделениеКомпании);
	КонецЕсли; 
КонецПроцедуры // дкСкладКомпанииНачалоВыбора()

// нажатие на гиперссылку "Ввести счет-фактуру"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - ЭУ надпись, служит для отображения гиперссылки
// ВидСФ 	 - Строка. Вид счета-фактуры ("СчетФактураПолученный"/"СчетФактураВыданный")
//
Процедура дкСчетФактураНажатие(ЭтаФорма,Элемент,ВидСФ) Экспорт
	//проверка проведения документа-основания
	//Если НЕ ЭтаФорма.Проведен Тогда
	//	Сообщить("Документ не проведен. Перед вводом счета-фактуры необходимо его проведение.",СтатусСообщения.Внимание);
	//	Возврат;
	//КонецЕсли;
	// получим имеющуюся счет-фактуру
	МассивВидов = Новый Массив(1);
	МассивВидов[0] = ВидСФ;
	МассивПодчиненных = дкПолучитьМассивПодчиненных(Этаформа.Ссылка,МассивВидов, Истина);
	Если НЕ МассивПодчиненных = Неопределено И МассивПодчиненных.Количество() > 0 Тогда
		// счет-фактура найден, откроем его
		СчетФактура = МассивПодчиненных[0].Ссылка;
	Иначе
		// счет-фактура НЕ найден, введем новый
		СчетФактура = Документы[ВидСФ].СоздатьДокумент();
		СчетФактура.Заполнить(ЭтаФорма.Ссылка);
	КонецЕсли;
	// откроем форму
	ФормаСФ = СчетФактура.ПолучитьФорму( ,ЭтаФорма);
	ФормаСФ.ПараметрОснование = ЭтаФорма.Ссылка;
	ФормаСФ.Открыть();
КонецПроцедуры // дкСчетФактураНажатие()    

// Начало выбора варианта поставки
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - ЭУ поле ввода, поле ввода контрагента
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкВариантПоставкиНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка) Экспорт
	// отменим стандартную обработку
	СтандартнаяОбработка=Ложь;
	
	СписокВидов = Новый СписокЗначений();
	
	СписокВидов.Добавить("Контрагенты", "Контрагент");
	СписокВидов.Добавить("ПрайсЛистыКонтрагентов", "Прайс-лист поставщика");
	СписокВидов.Добавить("СкладыКомпании", "Склад компании");
	
	ВыбВид = ЭтаФорма.ВыбратьИзСписка(СписокВидов, Элемент);
	Если ВыбВид = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбВид.Значение = "Контрагенты" Тогда
		// создадим форму
		ФормаВыбора = Справочники.Контрагенты.ПолучитьФормуВыбора(, Элемент, ЭтаФорма);
		ФормаВыбора.ЗакрыватьПриВыборе = Истина;
		ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
		// поставим отборы
		// отбор по виду контрагента
		ФормаВыбора.Отбор.ВидКонтрагента.ВидСравнения = ВидСравнения.НеРавно;
		ФормаВыбора.Отбор.ВидКонтрагента.Значение = Перечисления.ВидыКонтрагентов.КонтактноеЛицо;
		ФормаВыбора.Отбор.ВидКонтрагента.Использование = Истина;
		// сделаем отбор не снимаемым
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.ВидКонтрагента.Доступность = Ложь;
		// запретим выбор групп
		ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		// установим начальную строку
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ПрайсЛистыКонтрагентов") Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение.Владелец;
		КонецЕсли;
		ФормаВыбора.ОткрытьМодально();
		
	ИначеЕсли ВыбВид.Значение = "ПрайсЛистыКонтрагентов" Тогда
		// создадим форму
		ФормаВыбора = Справочники.ПрайсЛистыКонтрагентов.ПолучитьФормуВыбора(, Элемент, ЭтаФорма);
		ФормаВыбора.ЗакрыватьПриВыборе = Истина;
		ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
		// установим начальную строку
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.ПрайсЛистыКонтрагентов") Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;
		КонецЕсли;
		ФормаВыбора.ОткрытьМодально();
		
	ИначеЕсли ВыбВид.Значение = "СкладыКомпании" Тогда
		// создадим форму
		ФормаВыбора = Справочники.СкладыКомпании.ПолучитьФормуВыбора(, Элемент, ЭтаФорма);
		ФормаВыбора.ЗакрыватьПриВыборе = Истина;
		ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
		// поставим отборы
		// отбор по виду контрагента
		ФормаВыбора.Отбор.Розничный.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.Розничный.Значение = Ложь;
		ФормаВыбора.Отбор.Розничный.Использование = Истина;
		// сделаем отбор не снимаемым
		ФормаВыбора.ЭлементыФормы.Список.НастройкаОтбора.Розничный.Доступность = Ложь;
		// запретим выбор групп
		ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		// установим начальную строку
		Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.СкладыКомпании") Тогда
			ФормаВыбора.НачальноеЗначениеВыбора = Элемент.Значение;
		КонецЕсли;
		ФормаВыбора.ОткрытьМодально();
		
	КонецЕсли;
	
КонецПроцедуры // дкПоставщикНачалоВыбора()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ФОРМ ДОКУМЕНТОВ

// При выводе строки табличного поля "Активы". Заполнение и форматирование информационных полей
//
// Параметры:
// ЭтаФорма   - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент   - поле ввода колонки табличной части документа
// ОформлениеСтроки - ОформлениеСтроки, содержит параметры оформления выводимой строки
// ДанныеСтроки  - Данные выводимой строки. Параметр соответствует свойству "ТекущиеДанные" для выводимой строки
//
Процедура дкАктивыПриВыводеСтроки(ЭтаФорма, ТабличноеПоле, Элемент, ОформлениеСтроки, ДанныеСтроки) Экспорт
	Попытка
		Если обЗначениеНеЗаполнено(ДанныеСтроки.ПрочийАктив) Тогда
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Попытка
		//Пока выводим инвентарный номер
		//Надо будет переделать на вывод данных, согласно права вывода кода/артикула
		Попытка
			Актив = ДанныеСтроки.ПрочийАктив;
		Исключение
			Попытка
				Актив = ДанныеСтроки.Актив;
			Исключение
				Актив = Неопределено;
			КонецПопытки;
		КонецПопытки; 
		Если НЕ обЗначениеНеЗаполнено(Актив) Тогда
			Если ТабличноеПоле.Колонки.ИнвентарныйНомер.Видимость Тогда
				ОформлениеСтроки.Ячейки.ИнвентарныйНомер.УстановитьТекст(Актив.ИнвентарныйНомер);
			КонецЕсли; 
		КонецЕсли;
	Исключение
	КонецПопытки; 
	Попытка
		Если обЗначениеНеЗаполнено(ДанныеСтроки.ПрочийАктив) Тогда
			Возврат;
		КонецЕсли;
		// проверим наличие и видимость информационных колонок в табличной части
		КолонкаБалансоваяСтоимость = ТабличноеПоле.Колонки.Найти("БалансоваяСтоимость");
		КолонкаАмортизация   = ТабличноеПоле.Колонки.Найти("Амортизация");
		КолонкаОстаточнаяСтоимость = ТабличноеПоле.Колонки.Найти("ОстаточнаяСтоимость");
		КолонкаТипЭксплуатации  = ТабличноеПоле.Колонки.Найти("ТипЭксплуатации");
		КолонкаМОЛ     = ТабличноеПоле.Колонки.Найти("МОЛ");
		// флаги вывода
		БалансоваяСтоимостьНеВыводить 	= (КолонкаБалансоваяСтоимость = Неопределено ИЛИ (НЕ КолонкаБалансоваяСтоимость.Видимость));
		АмортизацияНеВыводить   		= (КолонкаАмортизация = Неопределено ИЛИ (НЕ КолонкаАмортизация.Видимость));
		ОстаточнаяСтоимостьНеВыводить 	= (КолонкаОстаточнаяСтоимость = Неопределено ИЛИ (НЕ КолонкаОстаточнаяСтоимость.Видимость));
		ТипЭксплуатацииНеВыводить  	= (КолонкаТипЭксплуатации = Неопределено ИЛИ (НЕ КолонкаТипЭксплуатации.Видимость));
		МОЛНеВыводить     			= (КолонкаМОЛ = Неопределено ИЛИ (НЕ КолонкаМОЛ.Видимость));
		
		Если БалансоваяСтоимостьНеВыводить И АмортизацияНеВыводить И ОстаточнаяСтоимостьНеВыводить И 
			ТипЭксплуатацииНеВыводить И МОЛНеВыводить Тогда
			//ничего не надо делать
		Иначе //попробуем вывести всю информацию в табличную часть
			// попробуем вычислить остатки
			Попытка
				Подразделение = ЭтаФорма.ПодразделениеКомпании;
			Исключение 
				Подразделение = Неопределено;
			КонецПопытки; 
			Попытка
				МоментВремени = ?(обЗначениеНеЗаполнено(ЭтаФорма.ДокументОбъект.Ссылка), Новый МоментВремени(КонецДня(ЭтаФорма.ДокументОбъект.Дата)), ЭтаФорма.ДокументОбъект.МоментВремени());
			Исключение
				#Если Клиент Тогда
				МоментВремени=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
				МоментВремени=ТекущаяДата();
				#КонецЕсли
			КонецПопытки; 
			ТаблАктив = дкПолучитьОстаткиАктивов(Подразделение, , ДанныеСтроки.ПрочийАктив, МоментВремени);
			
			Если ЭтаФорма.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить() Тогда
				ТребуетсяПересчет = Ложь;
			Иначе
				ТребуетсяПересчет = Истина;
			КонецЕсли; 
			// оформление ячеек
			Если НЕ БалансоваяСтоимостьНеВыводить Тогда
				Если ТребуетсяПересчет Тогда
					БалансоваяСтоимость = ?(ТаблАктив.Количество() = 0, 0, ТаблАктив[0].БалансоваяСтоимость);
					БалансоваяСтоимость = обПересчет(БалансоваяСтоимость, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ЭтаФорма.Дата, ЭтаФорма.ВалютаДокумента, ЭтаФорма.КурсДокумента);
				Иначе
					БалансоваяСтоимость = ?(ТаблАктив.Количество() = 0, 0, ТаблАктив[0].БалансоваяСтоимостьРегл);
				КонецЕсли; 
				ОформлениеСтроки.Ячейки.БалансоваяСтоимость.ТолькоПросмотр = Истина;
				ОформлениеСтроки.Ячейки.БалансоваяСтоимость.ОтображатьТекст = Истина;
				ОформлениеСтроки.Ячейки.БалансоваяСтоимость.Выравнивание = ГоризонтальноеПоложение.Право;
				ОформлениеСтроки.Ячейки.БалансоваяСтоимость.Текст = Формат(БалансоваяСтоимость,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
			КонецЕсли;
			Если НЕ АмортизацияНеВыводить Тогда
				Если ТребуетсяПересчет Тогда
					Амортизация = ?(ТаблАктив.Количество() = 0, 0, ТаблАктив[0].Амортизация);
					Амортизация = обПересчет(Амортизация, Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ЭтаФорма.Дата, ЭтаФорма.ВалютаДокумента, ЭтаФорма.КурсДокумента);
				Иначе
					Амортизация = ?(ТаблАктив.Количество() = 0, 0, ТаблАктив[0].АмортизацияРегл);
				КонецЕсли; 
				ОформлениеСтроки.Ячейки.Амортизация.ТолькоПросмотр = Истина;
				ОформлениеСтроки.Ячейки.Амортизация.ОтображатьТекст = Истина;
				ОформлениеСтроки.Ячейки.Амортизация.Выравнивание = ГоризонтальноеПоложение.Право;
				ОформлениеСтроки.Ячейки.Амортизация.Текст = Формат(Амортизация,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
			КонецЕсли;
			Если НЕ ОстаточнаяСтоимостьНеВыводить Тогда
				ОстаточнаяСтоимость = БалансоваяСтоимость - Амортизация;
				ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.ТолькоПросмотр = Истина;
				ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.ОтображатьТекст = Истина;
				ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.Выравнивание = ГоризонтальноеПоложение.Право;
				ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.Текст = Формат(ОстаточнаяСтоимость,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
			КонецЕсли;
			Если НЕ ТипЭксплуатацииНеВыводить Тогда
				ТипЭксплуатации = ?(ТаблАктив.Количество() = 0, "", ТаблАктив[0].ТипЭксплуатации);
				ОформлениеСтроки.Ячейки.ТипЭксплуатации.ТолькоПросмотр = Истина;
				ОформлениеСтроки.Ячейки.ТипЭксплуатации.ОтображатьТекст = Истина;
				ОформлениеСтроки.Ячейки.ТипЭксплуатации.Текст = ТипЭксплуатации;
			КонецЕсли;
			Если НЕ МОЛНеВыводить Тогда
				МОЛ = ?(ТаблАктив.Количество() = 0, "", ТаблАктив[0].МОЛ);
				ОформлениеСтроки.Ячейки.МОЛ.ТолькоПросмотр = Истина;
				ОформлениеСтроки.Ячейки.МОЛ.ОтображатьТекст = Истина;
				ОформлениеСтроки.Ячейки.МОЛ.Текст = МОЛ;
			КонецЕсли;
		КонецЕсли;
		
		// колонка "СуммаСписания" (балансовая себестоимость)
		СуммаСписанияЕстьВТЧ = Новый Структура;
		СуммаСписанияЕстьВТЧ.Вставить("ПеремещениеАктивов");
		СуммаСписанияЕстьВТЧ.Вставить("РеализацияАктивов");
		СуммаСписанияЕстьВТЧ.Вставить("СписаниеАктивов");
		ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
		МетаданныеДокументИмя = ЭтотОбъект.Метаданные().Имя;
		Если СуммаСписанияЕстьВТЧ.Свойство(МетаданныеДокументИмя) Тогда
			Если (ЭтотОбъект.Проведен) И (ТабличноеПоле.Колонки.СуммаСписания.Видимость) Тогда
				СуммаСписания = дкПолучитьСуммуСписания(ЭтотОбъект,
				"ПрочиеАктивыВЭксплуатации",
				ЭтотОбъект.тКэшСуммСписания,
				ДанныеСтроки.ПрочийАктив);
				ОформлениеСтроки.Ячейки.СуммаСписания.Выравнивание = ГоризонтальноеПоложение.Право;
				Если СуммаСписания < 0 Тогда
					ОформлениеСтроки.Ячейки.СуммаСписания.ЦветТекста = WebЦвета.Красный;
				КонецЕсли;
				ОформлениеСтроки.Ячейки.СуммаСписания.УстановитьТекст(Формат(СуммаСписания,"ЧЦ = 15; ЧДЦ = 2; ЧРГ = ' '; ЧН = 0.00"));
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры // дкАктивыПриВыводеСтроки()

#КонецЕсли

// Получить остатки актива
// 	Параметры:
//		ВыбАктив - СправочникСсылка.ПрочиеАктивы или массив Активов отбора,
// 		ВыбПодразделение - СправочникСсылка.ПодразделенияКомпании,
// 		ВыбМОЛ - СправочникСсылка.Сотрудники,
// 		Момент - Момент, на какой необходимо производить расчет
// 	Возвращаемое значение:
//		ТаблицаЗначений - [Актив, МОЛ, Тип эксплуатации, Балансовая стоимость, Амортизация, СуммаОбслуживания]
//
Функция дкПолучитьОстаткиАктивов(ВыбПодразделение = Неопределено, ВыбМОЛ = Неопределено, ВыбАктив = Неопределено, Момент = Неопределено) Экспорт
	// сформируем запрос на получение остатков по активу
	ТекстПараметрыВиртуальнойТаблицы = "&Момент, ";
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбПодразделение), "", "ПодразделениеКомпании В Иерархии (&Подразделение) И ");
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбМОЛ), "", "МОЛ = &МОЛ И ");
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбАктив), "", "(ПрочийАктив " + ?(ТипЗнч(ВыбАктив) = Тип("Массив"), "В", " = ") + " (&Актив)) И ");
	ТекстПараметрыВиртуальнойТаблицы = Лев(ТекстПараметрыВиртуальнойТаблицы, СтрДлина(ТекстПараметрыВиртуальнойТаблицы)-3);
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	АктивыПодразделенияОстатки.ПрочийАктив КАК Актив,
	               |	АктивыПодразделенияОстатки.ТипЭксплуатации КАК ТипЭксплуатации,
	               |	АктивыПодразделенияОстатки.МОЛ КАК МОЛ,
				   |	АктивыПодразделенияОстатки.Автомобиль КАК Автомобиль,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.БалансоваяСтоимостьУпрОстаток, 0) КАК БалансоваяСтоимость,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаАмортизацииУпрОстаток, 0) КАК Амортизация,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаОбслуживанияУпрОстаток, 0) КАК СуммаОбслуживания,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.БалансоваяСтоимостьОстаток, 0) КАК БалансоваяСтоимостьРегл,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаАмортизацииОстаток, 0) КАК АмортизацияРегл,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаОбслуживанияОстаток, 0) КАК СуммаОбслуживанияРегл,
	               |	ЕСТЬNULL(АктивыПодразделенияОстатки.КоличествоОстаток, 0) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки(" + ТекстПараметрыВиртуальнойТаблицы + ") КАК АктивыПодразделенияОстатки
	               |ГДЕ
	               |	АктивыПодразделенияОстатки.КоличествоОстаток > 0";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Момент", ?(Момент = Неопределено, Новый МоментВремени(КонецДня(ТекущаяДата())), Момент));
	Запрос.УстановитьПараметр("Подразделение", ВыбПодразделение);
	Запрос.УстановитьПараметр("МОЛ", ВыбМОЛ);
	Запрос.УстановитьПараметр("Актив", ВыбАктив);
	
	ТаблАктивы = Запрос.Выполнить().Выгрузить();
	Возврат ТаблАктивы;
КонецФункции

// Получить остатки актива, который нужно амортизировать на тек. период
// 	Параметры:
//		ДатаКонца  - конец периода амортизации,
//		ВыбАктив   - СправочникСсылка.ПрочиеАктивы или массив Активов отбора,
// 		ВыбПодразделение - СправочникСсылка.ПодразделенияКомпании,
// 		ВыбМОЛ   - СправочникСсылка.Сотрудники
// 	Возвращаемое значение:
//		ТаблицаЗначений - [Актив, МОЛ, Тип эксплуатации, Балансовая стоимость, Амортизация, СуммаОбслуживания]
//
Функция дкПолучитьОстаткиАктивовНеАмортизированных(ДатаКонца, ВыбПодразделение = Неопределено, ВыбМОЛ = Неопределено, ВыбАктив = Неопределено) Экспорт
	// сформируем запрос на получение остатков по активу
	ТекстПараметрыВиртуальнойТаблицы = "&Момент, ";
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбПодразделение), "", "ПодразделениеКомпании = &Подразделение И ");
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбМОЛ), "", "МОЛ = &МОЛ И ");
	ТекстПараметрыВиртуальнойТаблицы = ТекстПараметрыВиртуальнойТаблицы + 
	?(обЗначениеНеЗаполнено(ВыбАктив), "", "(ПрочийАктив " + ?(ТипЗнч(ВыбАктив) = Тип("Массив"), "В", " = ") + " (&Актив)) И ");
	ТекстПараметрыВиртуальнойТаблицы = Лев(ТекстПараметрыВиртуальнойТаблицы, СтрДлина(ТекстПараметрыВиртуальнойТаблицы)-3);
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ ПромежуточнаяТаблица.*
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		АктивыПодразделенияОстатки.ПрочийАктив КАК Актив,
	               |		АктивыПодразделенияОстатки.ТипЭксплуатации КАК ТипЭксплуатации,
	               |		АктивыПодразделенияОстатки.МОЛ КАК МОЛ,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.БалансоваяСтоимостьОстаток, 0) КАК БалансоваяСтоимостьРегл,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.БалансоваяСтоимостьУпрОстаток, 0) КАК БалансоваяСтоимость,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаАмортизацииОстаток, 0) КАК АмортизацияРегл,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаАмортизацииУпрОстаток, 0) КАК Амортизация,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаОбслуживанияОстаток, 0) КАК СуммаОбслуживанияРегл,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.СуммаОбслуживанияУпрОстаток, 0) КАК СуммаОбслуживания,
	               |		ЕСТЬNULL(АктивыПодразделенияОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	               |	ИЗ
	               |		РегистрНакопления.ПрочиеАктивыВЭксплуатации.Остатки(" + ТекстПараметрыВиртуальнойТаблицы + ") КАК АктивыПодразделенияОстатки) КАК ПромежуточнаяТаблица
	               |ГДЕ
	               |	ПромежуточнаяТаблица.БалансоваяСтоимость > ПромежуточнаяТаблица.Амортизация
	               |	И ПромежуточнаяТаблица.КоличествоОстаток > 0";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Момент", ДатаКонца);
	Запрос.УстановитьПараметр("Подразделение", ВыбПодразделение);
	Запрос.УстановитьПараметр("МОЛ", ВыбМОЛ);
	Запрос.УстановитьПараметр("Актив", ВыбАктив);
	
	ТаблАктивы = Запрос.Выполнить().Выгрузить();
	Возврат ТаблАктивы;
КонецФункции

// Нажатие кнопки "ЗаполнитьПоЗаказу" панели "КоманднаяПанельТовары"
//
// Параметры:
// Таблица 				 - Табличная часть документа. Данные меняемого табл. поля.
// ДокументОснованиеТаблица - ТаблицаЗначений. Данные табличной части документа-основания
//
Процедура дкЗаполнитьТоварыСторнированием(Таблица,ДокументОснованиеТаблица) Экспорт
	
	Для каждого СтрокаТЧ из ДокументОснованиеТаблица Цикл
		// - 1 - строка из основания с минусом
		НоваяСтрокаМинус = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаМинус,СтрокаТЧ);
		НоваяСтрокаМинус.Количество = -1 * СтрокаТЧ.Количество;
		НоваяСтрокаМинус.Сумма  	= -1 * СтрокаТЧ.Сумма;
		НоваяСтрокаМинус.СуммаВсего = -1 * СтрокаТЧ.СуммаВсего;
		Попытка // такого реквизита может и не быть
			НоваяСтрокаМинус.СуммаНДС 	 = -1 * СтрокаТЧ.СуммаНДС;
			НоваяСтрокаМинус.СуммаСкидки = -1 * СтрокаТЧ.СуммаСкидки;
		Исключение КонецПопытки;
		// - 2 - строка из основания с плюсом
		НоваяСтрокаМинус = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаМинус,СтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры


#Если Клиент Тогда

// При выводе строки табличного поля "Активы". Заполнение и форматирование информационных полей
//
// Параметры:
// ЭтаФорма   - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент   - поле ввода колонки табличной части документа
// ОформлениеСтроки - ОформлениеСтроки, содержит параметры оформления выводимой строки
// ДанныеСтроки  - Данные выводимой строки. Параметр соответствует свойству "ТекущиеДанные" для выводимой строки
//
Процедура дкАктивыПриПолученииДанных(ЭтаФорма, ОформленияСтрок, ТабличноеПоле) Экспорт
	
	// Определим необходимость отображения информации по балансовой стоимости и амортизации активов.
	// Если такую информацию выводить нужно, то получим ее.
	Попытка
		// проверим наличие и видимость информационных колонок в табличной части
		КолонкаБалансоваяСтоимость 	= ТабличноеПоле.Колонки.Найти("БалансоваяСтоимость");
		КолонкаАмортизация   		= ТабличноеПоле.Колонки.Найти("Амортизация");
		КолонкаОстаточнаяСтоимость 	= ТабличноеПоле.Колонки.Найти("ОстаточнаяСтоимость");
		КолонкаТипЭксплуатации  	= ТабличноеПоле.Колонки.Найти("ТипЭксплуатации");
		КолонкаМОЛ      			= ТабличноеПоле.Колонки.Найти("МОЛ");
		КолонкаИнвИСерийныйНомер 	= ТабличноеПоле.Колонки.Найти("Номер");
		КолонкаЕдиницаВыработки  	= ТабличноеПоле.Колонки.Найти("ЕдиницаВыработки");
		
		// флаги вывода
		БалансоваяСтоимостьНеВыводить 	= (КолонкаБалансоваяСтоимость = Неопределено ИЛИ (НЕ КолонкаБалансоваяСтоимость.Видимость));
		АмортизацияНеВыводить   		= (КолонкаАмортизация = Неопределено ИЛИ (НЕ КолонкаАмортизация.Видимость));
		ОстаточнаяСтоимостьНеВыводить 	= (КолонкаОстаточнаяСтоимость = Неопределено ИЛИ (НЕ КолонкаОстаточнаяСтоимость.Видимость));
		ТипЭксплуатацииНеВыводить  	= (КолонкаТипЭксплуатации = Неопределено ИЛИ (НЕ КолонкаТипЭксплуатации.Видимость));
		МОЛНеВыводить     			= (КолонкаМОЛ = Неопределено ИЛИ (НЕ КолонкаМОЛ.Видимость));
		ИнвИСерийныйНомерНеВыводить 	= (КолонкаИнвИСерийныйНомер = Неопределено Или (Не КолонкаИнвИСерийныйНомер.Видимость));
		ЕдиницаВыработкиНеВыводить 	= (КолонкаЕдиницаВыработки = Неопределено Или (Не КолонкаЕдиницаВыработки.Видимость));
		
		// Получим массив номенклатуры, для которой необходимо выполнить
		// расчет остатков и свойства которой необходимо вывести.
		МассивАктивов = Новый Массив;
		Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
			Попытка
				Актив = ОформлениеСтроки.ДанныеСтроки.ПрочийАктив;
			Исключение
				Попытка
					Актив = ОформлениеСтроки.ДанныеСтроки.Актив;
				Исключение
					Возврат;
				КонецПопытки;
			КонецПопытки; 				
			МассивАктивов.Добавить(Актив);
		КонецЦикла;
	Исключение	
		БалансоваяСтоимостьНеВыводить 	= Истина;
		АмортизацияНеВыводить 			= Истина;
		ОстаточнаяСтоимостьНеВыводить 	= Истина;
		ТипЭксплуатацииНеВыводить  	= Истина;
		МОЛНеВыводить     			= Истина;
		НомерНеВыводить     			= Истина;
		ИнвИСерийныйНомерНеВыводить 	= Истина;
	КонецПопытки;
	
	Попытка
		Если (Не БалансоваяСтоимостьНеВыводить)
			Или (Не АмортизацияНеВыводить)
			Или (Не ОстаточнаяСтоимостьНеВыводить)
			Или (Не ТипЭксплуатацииНеВыводить)
			Или (Не МОЛНеВыводить) Тогда
			
			Попытка
				Подразделение = ЭтаФорма.ПодразделениеКомпании;
			Исключение 
				Подразделение = Неопределено;
			КонецПопытки; 
			Попытка
				МоментВремени = ?(ЭтаФорма.ДокументОбъект.Ссылка.Пустая(), Новый МоментВремени(КонецДня(ЭтаФорма.ДокументОбъект.Дата)), ЭтаФорма.ДокументОбъект.МоментВремени());
			Исключение
				#Если Клиент Тогда
				МоментВремени=РабочаяДата+(Час(ТекущаяДата())*60*60)+(Минута(ТекущаяДата())*60)+(Секунда(ТекущаяДата()));
				#Иначе
				МоментВремени=ТекущаяДата();
				#КонецЕсли
			КонецПопытки; 			
			
			ТаблицаАктивов = дкПолучитьОстаткиАктивов(Подразделение, , МассивАктивов, МоментВремени);
			
			// Выясним, необходим ли пересчет.
			КонстантаРеглУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			КонстантаУпрУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			Если ЭтаФорма.ВалютаДокумента <> КонстантаУпрУчета Тогда
				Если ЭтаФорма.ВалютаДокумента <> КонстантаРеглУчета Тогда
					// Пересчет необходим. Проходимся сразу по всей таблице и пересчитываем суммовые показатели.
					Для каждого ТекСтрокаТаблицы Из ТаблицаАктивов Цикл 	
						Если Не БалансоваяСтоимостьНеВыводить Тогда
							ТекСтрокаТаблицы.БалансоваяСтоимость = обПересчет(ТекСтрокаТаблицы.БалансоваяСтоимость, КонстантаУпрУчета, ЭтаФорма.Дата, ЭтаФорма.ВалютаДокумента, ЭтаФорма.КурсДокумента);	
						КонецЕсли;
						Если Не АмортизацияНеВыводить Тогда
							ТекСтрокаТаблицы.Амортизация = обПересчет(ТекСтрокаТаблицы.Амортизация, КонстантаУпрУчета, ЭтаФорма.Дата, ЭтаФорма.ВалютаДокумента, ЭтаФорма.КурсДокумента);
						КонецЕсли;
					КонецЦикла;
				Иначе
					//берем бал. стоимость из колонки БалансоваяСтоимостьРегл
					Для каждого ТекСтрокаТаблицы Из ТаблицаАктивов Цикл 	
						Если Не БалансоваяСтоимостьНеВыводить Тогда
							ТекСтрокаТаблицы.БалансоваяСтоимость = ТекСтрокаТаблицы.БалансоваяСтоимостьРегл;
						КонецЕсли;
						Если Не АмортизацияНеВыводить Тогда
							ТекСтрокаТаблицы.Амортизация = ТекСтрокаТаблицы.АмортизацияРегл;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;				
	Исключение	
		БалансоваяСтоимостьНеВыводить 	= Истина;
		АмортизацияНеВыводить   		= Истина;
		ОстаточнаяСтоимостьНеВыводить 	= Истина;
		ТипЭксплуатацииНеВыводить  	= Истина;
		МОЛНеВыводить     			= Истина;
	КонецПопытки;
	
	Если (Не ИнвИСерийныйНомерНеВыводить) Или (Не ЕдиницаВыработкиНеВыводить) Тогда
		// Получим запросом информацию по серийным и инвентарным номерам.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрочиеАктивы.Ссылка,
		|	ПрочиеАктивы.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ПрочиеАктивы.СерийныйНомер КАК СерийныйНомер";
		
		Если Не ЕдиницаВыработкиНеВыводить Тогда
			Запрос.Текст = Запрос.Текст + ", 
			|	ПРЕДСТАВЛЕНИЕ(ПрочиеАктивы.ЕдиницаВыработки) КАК ЕдиницаВыработки,
			|	ВЫБОР
			|		КОГДА ПрочиеАктивы.ОсновнойТипЭксплуатации.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособыНачисленияАмортизации.ПоОбъемуВыработки)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ВыработкаТолькоПросмотр";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Справочник.ПрочиеАктивы КАК ПрочиеАктивы
		|ГДЕ
		|	ПрочиеАктивы.Ссылка В(&СписокАктивов)";
		Запрос.УстановитьПараметр("СписокАктивов", МассивАктивов);
		Выборка = Запрос.Выполнить().Выбрать();
		СоответствиеПрочиеАктивы = Новый Соответствие;
		Пока Выборка.Следующий() Цикл
			Структура = Новый Структура;
			Структура.Вставить("ИнвентарныйИСерийныйНомер", ?(ПустаяСтрока(Выборка.ИнвентарныйНомер), "-", Выборка.ИнвентарныйНомер) + " / " + ?(ПустаяСтрока(Выборка.СерийныйНомер), "-", Выборка.СерийныйНомер)); 
			Если Не ЕдиницаВыработкиНеВыводить Тогда
				Структура.Вставить("ЕдиницаВыработки", Выборка.ЕдиницаВыработки);
				Структура.Вставить("ВыработкаТолькоПросмотр", Выборка.ВыработкаТолькоПросмотр);
			КонецЕсли;
			
			СоответствиеПрочиеАктивы.Вставить(Выборка.Ссылка, Структура);	
		КонецЦикла;
	КонецЕсли;
	
	// Определим необходимость отображения информации "Суммы списания".
	ОтображатьСуммуСписания = Ложь;
	ИмяДокумента    = ЭтаФорма.Метаданные().Имя;
	Если ИмяДокумента = "ВводВЭксплуатацию" Или ИмяДокумента = "ПеремещениеАктивов" 
		Или ИмяДокумента = "РеализацияАктивов" Или ИмяДокумента = "СписаниеАктивов" Тогда
		Если ТабличноеПоле.Колонки.СуммаСписания.Видимость Тогда
			Если ЭтаФорма.ЭтотОбъект.Проведен Тогда
				ОтображатьСуммуСписания = Истина;				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Попытаемся получить кеш прав пользователя 
	Попытка 
		ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права;
	Исключение
	КонецПопытки;
	
	//Проверим наличие и видимость колонки "Код" в табличной части
	ВыводитьКод = Ложь;
	Если ПраваПользователя <> неопределено Тогда
		КолонкаКода = ТабличноеПоле.Колонки.Найти("Код");
		Если (КолонкаКода = Неопределено) ИЛИ (НЕ КолонкаКода.Видимость) Тогда
			ВыводитьКод = Ложь;
		Иначе
			ВыводитьКод = Истина;
			Попытка
				ИмяРеквизитаКода = ЭтаФорма.ИмяРеквизитаКода;
			Исключение
				ИмяРеквизитаКода = Неопределено;
			КонецПопытки; 
			Если ИмяРеквизитаКода = Неопределено ИЛИ ТипЗнч(ИмяРеквизитаКода) = Тип("ПеречислениеСсылка.РежимыВыводаКодаВДокументах") Тогда
				ИмяРеквизитаКода = дкПолучитьПараметрыРежимаВыводаКодаВДокументах(ИмяРеквизитаКода,ЭтаФорма).Имя;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	// проверим наличие и видимость колонки "ОстатокНаСкладе" в табличной части
	КолонкаОстатка = ТабличноеПоле.Колонки.Найти("ОстатокНаСкладе");
	Если (КолонкаОстатка = Неопределено) ИЛИ (НЕ КолонкаОстатка.Видимость) Тогда
		ВыводитьОстаток = Ложь;
	Иначе
		ВыводитьОстаток = Истина;
		ПоказыватьОстаткиНоменклатурыВТаблицах = обПраво("ПоказыватьОстаткиНоменклатурыВТаблицах", ПраваПользователя,,ЭтаФорма);
		Если ПоказыватьОстаткиНоменклатурыВТаблицах Тогда
			//Если склада компании нет в ТЧ, то попробуем взять его из шапки
			КолонкаСклада = ТабличноеПоле.Колонки.Найти("МестоРазмещения");
			Если КолонкаСклада = Неопределено Тогда
				Попытка
					Склад = ЭтаФорма.СкладКомпании;
				Исключение 
					Склад = Неопределено;
				КонецПопытки; 
			КонецЕсли; 
			МоментВремени = Неопределено;
			//Проверим наличие колонки партии в ТЧ
			КолонкаПартии = ТабличноеПоле.Колонки.Найти("Партия");
			Если КолонкаПартии = Неопределено Тогда
				ЕстьПартия = Ложь;
				ЕстьПартияВСтроке = Ложь;
			Иначе
				ЕстьПартия = Истина;
			КонецЕсли; 
			Попытка
				РезервыДляКонтрагента = ЭтаФорма.РезервыДляКонтрагента;
			Исключение
				РезервыДляКонтрагента = Неопределено;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
	
	// Выводим необходимую информацию в табличное поле.
	Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл 	
		ДанныеСтроки = ОформлениеСтроки.ДанныеСтроки;
		Попытка
			Актив = ДанныеСтроки.ПрочийАктив;
		Исключение
			Попытка
				Актив = ДанныеСтроки.Актив;
			Исключение
				Возврат;
			КонецПопытки;
		КонецПопытки;
		
		//Отобразим код/артикул в табличном поле
		Если ВыводитьКод Тогда
			Попытка
				Код = дкПолучитьЗначениеКолонкиКода(ДанныеСтроки.Номенклатура,ИмяРеквизитаКода,ЭтаФорма);
				ОформлениеСтроки.Ячейки.Код.УстановитьТекст(Код);
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		// Выводим инвентарный номер, а также конкатенацию строк "Инвентарный номер" + "Серийный номер" в колонку "Номер".
		Если (Не ИнвИСерийныйНомерНеВыводить) Или (Не ЕдиницаВыработкиНеВыводить) Тогда
			НайденныйЭлемент = СоответствиеПрочиеАктивы.Получить(Актив);
			Если НайденныйЭлемент <> Неопределено Тогда 
				Если Не ИнвИСерийныйНомерНеВыводить Тогда 
					ОформлениеСтроки.Ячейки.Номер.УстановитьТекст(НайденныйЭлемент.ИнвентарныйИСерийныйНомер);
				КонецЕсли;
				Если Не ЕдиницаВыработкиНеВыводить Тогда 
					ОформлениеСтроки.Ячейки.ЕдиницаВыработки.УстановитьТекст(НайденныйЭлемент.ЕдиницаВыработки);
					ОформлениеСтроки.Ячейки.Выработка.ТолькоПросмотр = НайденныйЭлемент.ВыработкаТолькоПросмотр;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			// Найдем соответствующую строку в таблице остатков.
			СтрокаСТекущимАктивом = ТаблицаАктивов.Найти(Актив, "Актив");
			Если СтрокаСТекущимАктивом <> Неопределено Тогда
				Если НЕ БалансоваяСтоимостьНеВыводить Тогда					
					ОформлениеСтроки.Ячейки.БалансоваяСтоимость.ТолькоПросмотр = Истина;
					ОформлениеСтроки.Ячейки.БалансоваяСтоимость.ОтображатьТекст = Истина;
					ОформлениеСтроки.Ячейки.БалансоваяСтоимость.Выравнивание = ГоризонтальноеПоложение.Право;
					ОформлениеСтроки.Ячейки.БалансоваяСтоимость.Текст = Формат(СтрокаСТекущимАктивом.БалансоваяСтоимость,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
				КонецЕсли;
				Если НЕ АмортизацияНеВыводить Тогда					
					ОформлениеСтроки.Ячейки.Амортизация.ТолькоПросмотр = Истина;
					ОформлениеСтроки.Ячейки.Амортизация.ОтображатьТекст = Истина;
					ОформлениеСтроки.Ячейки.Амортизация.Выравнивание = ГоризонтальноеПоложение.Право;
					ОформлениеСтроки.Ячейки.Амортизация.Текст = Формат(СтрокаСТекущимАктивом.Амортизация,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
				КонецЕсли;
				Если НЕ ОстаточнаяСтоимостьНеВыводить Тогда
					ОстаточнаяСтоимость = СтрокаСТекущимАктивом.БалансоваяСтоимость - СтрокаСТекущимАктивом.Амортизация;
					ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.ТолькоПросмотр = Истина;
					ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.ОтображатьТекст = Истина;
					ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.Выравнивание = ГоризонтальноеПоложение.Право;
					ОформлениеСтроки.Ячейки.ОстаточнаяСтоимость.Текст = Формат(ОстаточнаяСтоимость,"ЧЦ = 15; ЧДЦ = 2; ЧН = 0.00");
				КонецЕсли;
				Если НЕ ТипЭксплуатацииНеВыводить Тогда
					ТипЭксплуатации = СтрокаСТекущимАктивом.ТипЭксплуатации;
					ОформлениеСтроки.Ячейки.ТипЭксплуатации.ТолькоПросмотр = Истина;
					ОформлениеСтроки.Ячейки.ТипЭксплуатации.ОтображатьТекст = Истина;
					ОформлениеСтроки.Ячейки.ТипЭксплуатации.Текст = ТипЭксплуатации;
				КонецЕсли;
				Если НЕ МОЛНеВыводить Тогда
					МОЛ = СтрокаСТекущимАктивом.МОЛ;
					ОформлениеСтроки.Ячейки.МОЛ.ТолькоПросмотр = Истина;
					ОформлениеСтроки.Ячейки.МОЛ.ОтображатьТекст = Истина;
					ОформлениеСтроки.Ячейки.МОЛ.Текст = МОЛ;
				КонецЕсли;				
			КонецЕсли; 			
			
			// колонка "СуммаСписания" (балансовая себестоимость)
			Если ОтображатьСуммуСписания Тогда
				Если ИмяДокумента = "ВводВЭксплуатацию" Тогда
					СуммаСписания = дкПолучитьСуммуСписания(ЭтаФорма.ЭтотОбъект,"ПартииТоваровКомпании",ЭтаФорма.ЭтотОбъект.тКэшСуммСписания,ДанныеСтроки.Номенклатура,,ДанныеСтроки.НомерСтроки);
				Иначе
					СуммаСписания = дкПолучитьСуммуСписания(ЭтаФорма.ЭтотОбъект,"ПрочиеАктивыВЭксплуатации",ЭтаФорма.ЭтотОбъект.тКэшСуммСписания,ДанныеСтроки.ПрочийАктив);
				КонецЕсли;
				ОформлениеСтроки.Ячейки.СуммаСписания.Выравнивание = ГоризонтальноеПоложение.Право;
				Если СуммаСписания < 0 Тогда
					ОформлениеСтроки.Ячейки.СуммаСписания.ЦветТекста = WebЦвета.Красный;
				КонецЕсли;
				ОформлениеСтроки.Ячейки.СуммаСписания.УстановитьТекст(Формат(СуммаСписания,"ЧЦ = 15; ЧДЦ = 2; ЧРГ = ' '; ЧН = 0.00"));
			КонецЕсли; 			
		Исключение
		КонецПопытки;
		
		Попытка
			//Отобразим остаток товара на складе
			Если ВыводитьОстаток Тогда
				Если НЕ ПоказыватьОстаткиНоменклатурыВТаблицах Тогда
					//Запрещено отображение остатков
					ОформлениеСтроки.Ячейки.ОстатокНаСкладе.Выравнивание = ГоризонтальноеПоложение.Центр;
					ОформлениеСтроки.Ячейки.ОстатокНаСкладе.УстановитьТекст("Нет прав");
				Иначе
					//Можно отображать остатки товаров
					//Определимся со складом, остатки которого будем выводить
					Если КолонкаСклада <> Неопределено Тогда
						Склад = ОформлениеСтроки.ДанныеСтроки.МестоРазмещения;
					КонецЕсли;
					//Если задана партия, будем отображать остатки по ней
					Если ЕстьПартия Тогда
						ЕстьПартияВСтроке = НЕ обЗначениеНеЗаполнено(ОформлениеСтроки.ДанныеСтроки.Партия); 
					КонецЕсли; 
					Если ЕстьПартияВСтроке Тогда
						//Остаток считаем по партионному регистру
						Остаток = зфПолучитьОстаткиПартийНоменклатуры(ЭтаФорма.ДокументОбъект,ОформлениеСтроки.ДанныеСтроки.Номенклатура,ОформлениеСтроки.ДанныеСтроки.ХарактеристикаНоменклатуры,ОформлениеСтроки.ДанныеСтроки.Партия,Склад,МоментВремени);
					Иначе
						//Остаток считаем по регистру остатков
						Остаток = зфПолучитьОстаткиНоменклатуры(ЭтаФорма.ДокументОбъект,ОформлениеСтроки.ДанныеСтроки.Номенклатура,ОформлениеСтроки.ДанныеСтроки.ХарактеристикаНоменклатуры,Склад,МоментВремени,РезервыДляКонтрагента);
					КонецЕсли;
					ОформлениеСтроки.Ячейки.ОстатокНаСкладе.Выравнивание = ГоризонтальноеПоложение.Право;
					Если ОформлениеСтроки.ДанныеСтроки.Коэффициент = 0 Тогда
						ОстатокНаСкладе = 0;
					Иначе
						ОстатокНаСкладе = Формат(Остаток/ОформлениеСтроки.ДанныеСтроки.Коэффициент,"ЧДЦ = 3; ЧРГ = ' '; ЧН = 0.000");
					КонецЕсли;
					ОформлениеСтроки.Ячейки.ОстатокНаСкладе.УстановитьТекст(ОстатокНаСкладе);
				КонецЕсли; 
			КонецЕсли; 
		Исключение
		КонецПопытки;
		
		Попытка
			ОформлениеСтроки.Ячейки.НоменклатураПроизводитель.УстановитьТекст(Строка(ДанныеСтроки.Номенклатура.Производитель));
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // дкАктивыПриПолученииДанных() 

// Перед началом добавления строки в табличное поле. 
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Отказ 		 - Булево, признак отказа от стандартной обработки 
// Копирование - булево, признак копирования документа
//
Процедура дкТоварыПередНачаломДобавления(ЭтаФорма, ТабличноеПоле, Отказ, Копирование) Экспорт
	// зарезервировано	
КонецПроцедуры // дкТоварыПередНачаломДобавления()

// Перед началом изменения строки табличного поля. 
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Отказ 		 - Булево, признак отказа от стандартной обработки 
//
Процедура дкТоварыПередНачаломИзменения(ЭтаФорма, ТабличноеПоле, Отказ) Экспорт
	//Сообщить("дкТоварыПередНачаломИзменения");
КонецПроцедуры // дкТоварыПередНачаломИзменения()

// Перед удалением строки табличного поля.
//
// Параметры:
// ЭтаФорма 		 - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Отказ 			 - Булево, признак отказа от стандартной обработки 
// ПраваПользователя - структура, кеш прав и настроек текущего пользователя
//
Процедура дкТоварыПередУдалением(ЭтаФорма, ТабличноеПоле, Отказ, ПраваПользователя = Неопределено) Экспорт
	Если (ПраваПользователя = НЕОПРЕДЕЛЕНО) Тогда
		Попытка 
			ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если НЕ обПраво("УдалениеСтрокБезПодтверждения",ПраваПользователя,,ЭтаФорма) Тогда
		Ответ = Вопрос("Удалить строку таблицы ?",РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.ОК);
		Если (Ответ = КодВозвратаДиалога.Отмена) ИЛИ (Ответ = КодВозвратаДиалога.Таймаут) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // дкТоварыПередУдалением()

// Перед удалением строки табличного поля.
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
//
Процедура дкТоварыПослеУдаления(ЭтаФорма, ТабличноеПоле) Экспорт
	// Табличная часть документа изменена - необходимо получить новые параметры скидки и перерассчитать табличную часть
	РезультатОбработки = ЭтаФорма.ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", , ЭтаФорма);
	
	// Обновляем основной суммовой индикатор документа
	дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	
	//запишем произведенные изменения в файл
	ОбновитьСтруктуруФайла(ЭтаФорма);
КонецПроцедуры // дкТоварыПослеУдаления()

// Обработка вывода строки табличного поля (табличной части "Товары")
//
// Параметры:
// ЭтаФорма   - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент   - поле ввода колонки табличной части документа
// ОформлениеСтроки - ОформлениеСтроки, содержит параметры оформления выводимой строки
// ДанныеСтроки  - Данные выводимой строки. Параметр соответствует свойству "ТекущиеДанные" для выводимой строки
// ПраваПользователя - Структура, кеш прав и настроек пользователя
//
Процедура дкТоварыПриВыводеСтроки(ЭтаФорма, ТабличноеПоле, Элемент, ОформлениеСтроки, ДанныеСтроки, ПраваПользователя = Неопределено) Экспорт
	// попробуем завязаться на отраслевой обработчик
	Если орТоварыПриВыводеСтроки(ЭтаФорма,ТабличноеПоле,Элемент,ОформлениеСтроки,ДанныеСтроки,ПраваПользователя) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры // дкТоварыПриВыводеСтроки()

// Обработка получения данных строк табличного поля (табличной части "Товары")
//
// Параметры:
// ЭтаФорма   - форма, форма документа
// Элемент   - табличное поле табличной части документа
// ОформлениеСтроки - ОформлениеСтроки, коллекция оформления строк табличного поля.
// ПраваПользователяИзОбъекта - Соответствие, кеш прав и настроек пользователя
//
Процедура дкТоварыПриПолученииДанных(ЭтаФорма, Элемент, ОформленияСтрок, ПраваПользователяИзОбъекта = Неопределено) Экспорт
	зфТоварыПриПолученииДанных(ЭтаФорма, Элемент, ОформленияСтрок, ПраваПользователяИзОбъекта)
КонецПроцедуры // дкТоварыПриПолученииДанных() 

// После редактирования строки табличного поля.
//
// Параметры:
// ЭтаФорма 			 - форма, форма переданного документа
// ТабличноеПоле 		 - редактируемое табличное поле
// НоваяСтрока 		 - булево, признак завершения редактирования новой строки
// ОтменаРедактирования - Булево, признак отказа от стандартной обработки 
//
Процедура дкТоварыПриОкончанииРедактирования(ЭтаФорма,ТабличноеПоле, НоваяСтрока, ОтменаРедактирования) Экспорт
	дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	//запишем произведенные изменения в файл
	ОбновитьСтруктуруФайла(ЭтаФорма);
	Если ОтменаРедактирования Тогда
		// Произошел отказ от редактирования строки документа. Строка удаляется, поэтому необходимо пересчитать скидки,
		// которые были подобраны в ходе редактирования данной строки.
		РезультатОбработки = ЭтаФорма.ЭтотОбъект.ОбработкаРеквизита("РассчитатьСкидки", , ЭтаФорма);	
	КонецЕсли;
КонецПроцедуры // дкТоварыПриОкончанииРедактирования()

// Проверка данных, помещаемых в табличное поле товаров при перетаскивании
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - поле ввода колонки табличной части документа
// ПараметрыПеретаскивания - ПараметрыПеретаскивания. Содержит перетаскиваемое значение, 
//         тип действия и возможные действия при перетаскивании.
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыПроверкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Колонка) Экспорт
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") И
		ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("СправочникСсылка.Номенклатура") Тогда
		// Если происходит перетаскивание данных, отличных от номенклатуры - запрещаем
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		Возврат;
	КонецЕсли; 
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		// Проверим, что все элементы массива являются номенклатурой
		Для Сч = 0 По ПараметрыПеретаскивания.Значение.Количество()-1 Цикл
			Если ТипЗнч(ПараметрыПеретаскивания.Значение[Сч]) <> Тип("СправочникСсылка.Номенклатура") Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				Возврат;
			КонецЕсли;
			Если ПараметрыПеретаскивания.Значение[Сч].ЭтоГруппа Тогда
				ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
				Возврат;
			КонецЕсли; 
		КонецЦикла; 
	Иначе
		Если ПараметрыПеретаскивания.Значение.ЭтоГруппа Тогда
			// Если происходит перетаскивание номенклатурной группы - запрещаем
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
			Возврат;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры // дкТоварыПроверкаПеретаскивания()

// Начало выбора "Единиц измерения". 
//
// Параметры:
// ЭтаФорма  - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент  - поле ввода колонки табличной части документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыЕдиницаИзмеренияНачалоВыбораИзСписка(ЭтаФорма,ТабличноеПоле,Элемент,СтандартнаяОбработка) Экспорт
	// получаем текущую строку
	ТекСтрока = ТабличноеПоле.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда СтандартнаяОбработка = Ложь; Возврат; КонецЕсли;
	Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) Тогда СтандартнаяОбработка = Ложь; Возврат; КонецЕсли;
	// проверим как у нас хранятся единицы
	Если ТекСтрока.Номенклатура.ТипНоменклатуры.ИспользованиеЕдиницИзмерения = 2 Тогда
		// единицы подчинены номенклатуре
		Элемент.ВыборПоВладельцу = ТекСтрока.Номенклатура;
	Иначе
		// единицы подчинены типу номенклатуры
		Элемент.ВыборПоВладельцу = ТекСтрока.Номенклатура.ТипНоменклатуры;
	КонецЕсли;
КонецПроцедуры // дкТоварыЕдиницаИзмеренияНачалоВыбораИзСписка()

// Начало выбора номенклатуры
//
// Параметры:
// ЭтаФорма	- форма, форма переданного документа
// Элемент 	- поле ввода колонки табличной части документа
// Копирование - булево, признак копирования документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыНоменклатураНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка,УстанавливатьОтборПоЗапретам = Истина) Экспорт
	Номенклатура = Неопределено;
	Номенклатура = ?(обЗначениеНеЗаполнено(Элемент.Значение), Неопределено, Элемент.Значение);
	Если Номенклатура = Неопределено Тогда
		// посмотрим сколько строк в таблице
		Если ЭтаФорма.Товары.Количество() >= 2 Тогда 
			Попытка
				// пытаемся получить товар из предыдущей строки
				Номенклатура = ЭтаФорма.Товары[ЭтаФорма.Товары.Количество()-2].Номенклатура;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	// открываем форму для выбора
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Справочники.Номенклатура.ПолучитьФормуВыбора(,Элемент);
	ФормаВыбора.ПараметрТекущаяСтрока = Номенклатура;
	ФормаВыбора.ЗакрыватьПриВыборе = Истина;
	ФормаВыбора.МножественныйВыбор = Ложь;
	ФормаВыбора.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаВыбора.ПараметрВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;

	Если УстанавливатьОтборПоЗапретам Тогда
		// установим отборы
		ДокОбъектТип = ТипЗнч(ЭтаФорма.ЭтотОбъект);
		Если ДокОбъектТип = Тип("ОбработкаОбъект.ОбработкаТабличнойЧастиТовары") Тогда
			ДокОбъектТип = ТипЗнч(ЭтаФорма.ВладелецФормы.ЭтотОбъект);
		КонецЕсли;
		СписокТиповБлокПродажи = Новый СписокЗначений;
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.РеализацияТоваров"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.КорректировкаРеализации"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.ЗаявкаНаРемонт"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.ЗаказПокупателя"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.ЗаказНаряд"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.ЗаменаВЗаказеПокупателя"));
		СписокТиповБлокПродажи.Добавить(Тип("ДокументОбъект.КорректировкаЗаказаПокупателя")); 
		
		Если СписокТиповБлокПродажи.НайтиПоЗначению(ДокОбъектТип) <> Неопределено Тогда
			ФормаВыбора.Отбор.ЗапретПродажи.ВидСравнения  = ВидСравнения.Равно;
			ФормаВыбора.Отбор.ЗапретПродажи.Значение      = Ложь;
			ФормаВыбора.Отбор.ЗапретПродажи.Использование = Истина;
		КонецЕсли;
		
		СписокТиповБлокЗакупки = Новый СписокЗначений;
		СписокТиповБлокЗакупки.Добавить(Тип("ДокументОбъект.ЗаказПоставщику"));
		СписокТиповБлокЗакупки.Добавить(Тип("ДокументОбъект.ЗаказПокупателя"));
		СписокТиповБлокЗакупки.Добавить(Тип("ДокументОбъект.ЗаменаВЗаказеПокупателя"));
		СписокТиповБлокЗакупки.Добавить(Тип("ДокументОбъект.КорректировкаЗаказаПокупателя"));
		СписокТиповБлокЗакупки.Добавить(Тип("ДокументОбъект.КорректировкаЗаказаПоставщику"));
		
		Если СписокТиповБлокЗакупки.НайтиПоЗначению(ДокОбъектТип) <> Неопределено Тогда
			ФормаВыбора.Отбор.ЗапретЗакупки.ВидСравнения  = ВидСравнения.Равно;
			ФормаВыбора.Отбор.ЗапретЗакупки.Значение      = Ложь;
			ФормаВыбора.Отбор.ЗапретЗакупки.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// отбор по товарным группам
	ТоварнаяГруппа = Неопределено;
	Попытка
		ТоварнаяГруппа = ЭтаФорма.ТоварнаяГруппа;
	Исключение
	КонецПопытки;
	
	Если НЕ обЗначениеНеЗаполнено(ТоварнаяГруппа) Тогда
		СписокТиповНоменклатуры=Новый СписокЗначений;
		СписокТиповНоменклатуры.ЗагрузитьЗначения(дкТипыНоменклатурыТоварнойГруппы(ТоварнаяГруппа));
		ФормаВыбора.Отбор.ТипНоменклатуры.ВидСравнения = ВидСравнения.ВСписке;
		ФормаВыбора.Отбор.ТипНоменклатуры.Значение = СписокТиповНоменклатуры;
		ФормаВыбора.Отбор.ТипНоменклатуры.Использование = Истина;
	КонецЕсли;
	ФормаВыбора.Открыть();
КонецПроцедуры // дкТоварыНоменклатураНачалоВыбора()

// Окончания ввода текста в элемент управления, на который ссылается "номенклатура"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - поле ввода колонки табличной части документа
// Текст - строка, строка текста, введенная в поле ввода
// Значение - Параметр может содержать значение для размещения в поле ввода или 
//    список значений для последующего выбора одного из них и размещения в поле ввода
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыНоменклатураОкончаниеВводаТекста(ЭтаФорма, Элемент, Текст, Значение, СтандартнаяОбработка) Экспорт
	Попытка
		// Если такой реквизит есть, то ищем по коду поставщика
		ПоискПоКодуПоставщика = ЭтаФорма.флПоискПоКодуПоставщика;	
	Исключение
		// такого нет, выходим
		Возврат;		
	КонецПопытки;
	Если ПоискПоКодуПоставщика Тогда
		// значит ищем по кодам поставщиков
		// проверки
		Если обЗначениеНеЗаполнено(ЭтаФорма.Контрагент) Тогда Сообщить("Не указан поставщик!"); Возврат; КонецЕсли;
		Если обЗначениеНеЗаполнено(Текст) Тогда Возврат; КонецЕсли;
		// ищем
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрайсЛисты.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛисты
		|
		|ГДЕ
		|	ПрайсЛисты.ПрайсЛист.Владелец = &Контрагент
		|	И ПрайсЛисты.Номенклатура <> &ПустаяСсылка
		|	И ПрайсЛисты.Артикул ПОДОБНО """ + Текст + "%"" "; 
		Запрос.УстановитьПараметр("Контрагент",ЭтаФорма.Контрагент);
		Запрос.УстановитьПараметр("ПустаяСсылка",Справочники.Номенклатура.ПустаяСсылка());
		РезультатПоиска = Запрос.Выполнить();
		// смотрим, что в результате
		Если РезультатПоиска.Пустой() Тогда
			// ничего не нашли- выходим	
		Иначе
			// коды найдены.
			СтандартнаяОбработка = Ложь;
			СписокНайденныхТоваров = Новый СписокЗначений();
			СписокНайденныхТоваров.ЗагрузитьЗначения(РезультатПоиска.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
			// смотрим сколько их
			Если СписокНайденныхТоваров.Количество() = 1 Тогда
				// товар 1. его и устанавливаем
				Значение = СписокНайденныхТоваров[0].Значение;
			Иначе
				// товаров много. выберем из списка
				СписокНайденныхТоваров.СортироватьПоЗначению(НаправлениеСортировки.Возр);
				ВыбТовар = ЭтаФорма.ВыбратьИзСписка(СписокНайденныхТоваров,Элемент);
				Если ВыбТовар <> Неопределено Тогда Значение = ВыбТовар.Значение; КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // дкТоварыНоменклатураОкончаниеВводаТекста()

// Начало выбора "партия номенклатуры". 
//
// Параметры:
// ЭтаФорма  - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент  - поле ввода колонки табличной части документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// ДопПараметры - Структура, дополнительные переданные параметры
//
Процедура дкТоварыПартияНачалоВыбора(ЭтаФорма,ТабличноеПоле,Элемент,СтандартнаяОбработка,ДопПараметры = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	// проверим заполнение
	СкладКомпании = ЭтаФорма.СкладКомпании;
	ТекСтрока = ТабличноеПоле.ТекущиеДанные;
	
	ИмяРеквизитаНоменклатура = "Номенклатура";
	ИмяРеквизитаХарактеристикаНоменклатуры = "ХарактеристикаНоменклатуры";
	ИмяРеквизитаДокумент = "Партия";
	Если ДопПараметры <> Неопределено Тогда
		ИмяРеквизитаДокумент = Неопределено;
		Если НЕ ДопПараметры.Свойство("ИмяРеквизитаДокумент",ИмяРеквизитаДокумент) Тогда
			ИмяРеквизитаДокумент = "Партия";
		КонецЕсли;
		ИмяРеквизитаНоменклатура = Неопределено;
		Если НЕ ДопПараметры.Свойство("ИмяРеквизитаНоменклатура",ИмяРеквизитаНоменклатура) Тогда
			ИмяРеквизитаНоменклатура = "Номенклатура";
		КонецЕсли;
		ИмяРеквизитаХарактеристикаНоменклатуры = Неопределено;
		Если НЕ ДопПараметры.Свойство("ИмяРеквизитаХарактеристикаНоменклатуры",ИмяРеквизитаХарактеристикаНоменклатуры) Тогда
			ИмяРеквизитаХарактеристикаНоменклатуры = "ХарактеристикаНоменклатуры";
		КонецЕсли;
	КонецЕсли;
	Номенклатура = ТекСтрока[ИмяРеквизитаНоменклатура];
	ХарактеристикаНоменклатуры = ТекСтрока[ИмяРеквизитаХарактеристикаНоменклатуры];
	
	Если обЗначениеНеЗаполнено(СкладКомпании) Тогда
		Предупреждение("Не указана склад компании!",10); Возврат;
	КонецЕсли;
	Если ТекСтрока = Неопределено ИЛИ обЗначениеНеЗаполнено(Номенклатура) Тогда
		Предупреждение("Не указана номенклатура!",10); Возврат;
	КонецЕсли;
	
	// установим фильтры построителя
	ОбработкаПодбораПартий = ЭтаФорма.ОбработкаПодбораПартий;
	
	ОбработкаПодбораПартий.ДатаКонца = ЭтаФорма.Дата;
	
	ОбработкаПодбораПартий.Построитель.Отбор.СкладКомпании.Использование = Истина;
	ОбработкаПодбораПартий.Построитель.Отбор.Номенклатура.Использование = Истина;
	// значения фильтров
	ОбработкаПодбораПартий.Построитель.Отбор.СкладКомпании.Значение = СкладКомпании; 
	ОбработкаПодбораПартий.Построитель.Отбор.Номенклатура.Значение = Номенклатура;
	
	//характеристика
	Если НЕ обЗначениеНеЗаполнено(ХарактеристикаНоменклатуры) Тогда
		ОбработкаПодбораПартий.Построитель.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
		ОбработкаПодбораПартий.Построитель.Отбор.ХарактеристикаНоменклатуры.Значение = ХарактеристикаНоменклатуры;
	КонецЕсли;
	
	// параметры объекта
	ОбработкаПодбораПартий.ДатаДокумента = ЭтаФорма.Дата;
	ОбработкаПодбораПартий.ВалютаДокумента = ЭтаФорма.ВалютаДокумента;
	ОбработкаПодбораПартий.КурсДокумента = ЭтаФорма.КурсДокумента;
	ОбработкаПодбораПартий.Документ = ЭтаФорма.Ссылка;
	ОбработкаПодбораПартий.ИмяРеквизитаДокумент = ИмяРеквизитаДокумент;
	ОбработкаПодбораПартий.ХозОперация = ЭтаФорма.ХозОперация;
	ОбработкаПодбораПартий.Документ = ЭтаФорма.Ссылка;
	// заполним дерево возвратов
	ФормаПодбора = ОбработкаПодбораПартий.ПолучитьФорму(,Элемент);
	ФормаПодбора.РежимВыбора = Истина;
	ФормаПодбора.ЗакрыватьПриВыборе = Истина;
	ВыбраннаяСтрока = ФормаПодбора.ОткрытьМодально();
	Если ВыбраннаяСтрока = Неопределено Тогда Возврат; КонецЕсли;
	
	ТекСтрока[ИмяРеквизитаДокумент] = ВыбраннаяСтрока.Объект;
	ЭтаФорма.ОбработкаРеквизита("Товары.Партия",ТекСтрока,,ДопПараметры);
	Попытка
		ТекСтрока.ЦенаЗакупки = ВыбраннаяСтрока.Цена;
		дкОбработкаРеквизита("Товары.ЦенаЗакупки",ТекСтрока);
	Исключение
	КонецПопытки;
КонецПроцедуры // дкТоварыПартияНачалоВыбора()

// Начало выбора "характеристики номенклатуры". 
//
// Параметры:
// ЭтаФорма  - форма, форма переданного документа
// ТабличноеПоле - редактируемое табличное поле
// Элемент  - поле ввода колонки табличной части документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыХарактеристикаНоменклатурыНачалоВыбора(ЭтаФорма,ТабличноеПоле,Элемент,СтандартнаяОбработка) Экспорт
	// перекрываем стандартный обработчик
	СтандартнаяОбработка = Ложь;
	// получим текущую строку
	ТекСтрока = ТабличноеПоле.ТекущиеДанные;
	// если нет текущей строки или не выбрана номенклатура, то выходим
	Если (ТекСтрока = Неопределено) или (обЗначениеНеЗаполнено(ТекСтрока.Номенклатура)) Тогда
		Возврат;
	КонецЕсли;
	// проверим как у нас храняться характеристики
	Если ТекСтрока.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 3 Тогда
		// учет по характеристикам не ведется
		Предупреждение("Для типа номенклатуры """ + СокрЛП(ТекСтрока.Номенклатура.ТипНоменклатуры.Наименование) + """ учет по характеристикам не ведется !",5); Возврат;
		
	ИначеЕсли ТекСтрока.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1 Тогда
		// хар-ки хранятся для типов номенклатуры и в данном товаре ведется учет по характеристикам
		Элемент.ВыборПоВладельцу = ТекСтрока.Номенклатура.ТипНоменклатуры;
		
	ИначеЕсли ТекСтрока.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2 Тогда
		// хар-ки хранятся для номенклатуры и в данном товаре ведется учет по характеристикам
		Элемент.ВыборПоВладельцу = ТекСтрока.Номенклатура;
	Иначе
		// соответственно ничего...
		Предупреждение("Для номенклатуры """ + СокрЛП(ТекСтрока.Номенклатура.Наименование) + """ учет по характеристикам не ведется !",5); Возврат;
	КонецЕсли;
	
	// получим форму из которой будем выбирать хар-ки
	ИмяФормы = обПолучитьИмяФормыХарактеристик(ТекСтрока.Номенклатура.ТипНоменклатуры);
	ФормаВыбора = Справочники.ХарактеристикиНоменклатуры.ПолучитьФорму(ИмяФормы,Элемент);
	ФормаВыбора.ПараметрОтборПоВладельцу = Элемент.ВыборПоВладельцу;
	ФормаВыбора.ПараметрТекущаяСтрока = Элемент.Значение;
	// передадим в форму дополнительные параметры
	Попытка // не все формы их поддерживают
		ФормаВыбора.ПараметрОтборНоменклатура = ТекСтрока.Номенклатура;
		ФормаВыбора.ПараметрОтборПоСкладу = ЭтаФорма.СкладКомпании;
	Исключение
	КонецПопытки;
	// установим режим для выбора	
	ФормаВыбора.РежимВыбора = Истина;
	ФормаВыбора.ЗакрыватьПриВыборе = Истина;
	ФормаВыбора.МножественныйВыбор = Ложь;
	ФормаВыбора.Открыть();
КонецПроцедуры // дкТоварыХарактеристикаНоменклатурыНачалоВыбора()

// Автоподбор характеристики по введенному фрагменту текста
//
// Параметры:
// ЭтаФорма  	 - форма, форма переданного документа
// Элемент  	 - поле ввода колонки табличной части документа
// Текст     - строка, строка текста, введенная в поле ввода
// ТекстАвтоПодбора - строка, После завершения обработки события содержит текст для размещения в поле ввода
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыХарактеристикаНоменклатурыАвтоПодборТекста(ЭтаФорма,Элемент,Текст,ТекстАвтоПодбора,СтандартнаяОбработка) Экспорт
	ТоварыХарактеристикаНоменклатурыВводТекста(ЭтаФорма,Элемент,Текст,СтандартнаяОбработка);	
КонецПроцедуры // дкТоварыХарактеристикаНоменклатурыАвтоПодборТекста()

// Окончание ввода текста в поле характеристики
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - поле ввода колонки табличной части документа
// Текст - строка, строка текста, введенная в поле ввода
// Значение - Параметр может содержать значение для размещения в поле ввода или 
//    список значений для последующего выбора одного из них и размещения в поле ввода
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура дкТоварыХарактеристикаНоменклатурыОкончаниеВводаТекста(ЭтаФорма,Элемент,Текст,Значение,СтандартнаяОбработка) Экспорт
	ТоварыХарактеристикаНоменклатурыВводТекста(ЭтаФорма,Элемент,Текст,СтандартнаяОбработка);	
КонецПроцедуры // дкТоварыХарактеристикаНоменклатурыОкончаниеВводаТекста()

// Установка связи по владельцу для характеристики номенклатуры
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Элемент - поле ввода колонки табличной части документа
// Текст - строка, строка текста, введенная в поле ввода
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//
Процедура ТоварыХарактеристикаНоменклатурыВводТекста(ЭтаФорма,Элемент,Текст,СтандартнаяОбработка)
	Номенклатура = ЭтаФорма.ЭлементыФормы.Товары.ТекущиеДанные.Номенклатура;
	Элемент.ВыборПоВладельцу = Номенклатура;
	Если обЗначениеНеЗаполнено(Номенклатура) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 
	Если Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 3 Тогда
		// учет по характеристикам не ведется
		Предупреждение("Для типа номенклатуры """ + СокрЛП(Номенклатура.ТипНоменклатуры.Наименование) + """ учет по характеристикам не ведется !",5); Возврат;
		СтандартнаяОбработка = Ложь;
		Возврат;
	ИначеЕсли Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1 Тогда
		// хар-ки хранятся для типов номенклатуры и в данном товаре ведется учет по характеристикам
		Элемент.ВыборПоВладельцу = Номенклатура.ТипНоменклатуры;
	ИначеЕсли Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2 Тогда
		// хар-ки хранятся для номенклатуры и в данном товаре ведется учет по характеристикам
		Элемент.ВыборПоВладельцу = Номенклатура;
	Иначе
		// соответственно ничего...
		Предупреждение("Для номенклатуры """ + СокрЛП(Номенклатура.Наименование) + """ учет по характеристикам не ведется !",5); Возврат;
		СтандартнаяОбработка = Ложь; Возврат;
	КонецЕсли;
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыВводТекста()

// Окончание ввода текста в поле ячейки
//
// Параметры:
//	ЭтаФорма             - форма, форма переданного документа
//	Элемент              - поле ввода колонки табличной части документа
//	Текст                - строка, строка текста, введенная в поле ввода
//	Значение             - Параметр может содержать значение для размещения в поле ввода или 
//	                       список значений для последующего выбора одного из них и размещения в поле ввода
//	СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
//	Номенклатура         - Ссылка на номенклатуру строки ТЧ
//	Склад                - Склад документа
//
Процедура дкТоварыЯчейкаХраненияОкончаниеВводаТекста(ЭтаФорма,Элемент,Текст,Значение,СтандартнаяОбработка,Знач Номенклатура,Знач Склад=Неопределено) Экспорт
	// если склад не передан попробуем получить из формы
	Если обЗначениеНеЗаполнено(Склад) Тогда
		Попытка
			Склад = ЭтаФорма.СкладКомпании;
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	// проверим есть ли номенклатура
	Если обЗначениеНеЗаполнено(Номенклатура) ИЛИ обЗначениеНеЗаполнено(Текст) ИЛИ обЗначениеНеЗаполнено(Склад) Тогда
		Возврат;
	КонецЕсли;
	
	// проверка введенной ячейки
	ЯчейкаХраненияСсылка = Справочники.ЯчейкиХранения.НайтиПоКоду(Текст,,,Склад);
	
	Если обЗначениеНеЗаполнено(ЯчейкаХраненияСсылка) Тогда
		// такой ячейки не существует
		Если Вопрос("Ячейка """ + СокрЛП(Текст) + """ не найдена.
					|Создать новую?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Да Тогда
			// создание новой ячейки
			НовыйЭлемент = Справочники.ЯчейкиХранения.СоздатьЭлемент();
			НовыйЭлемент.Владелец     = Склад;
			НовыйЭлемент.ДлинаЯчейки  = 1;
			НовыйЭлемент.ШиринаЯчейки = 1;
			НовыйЭлемент.Код          = СокрЛП(Текст);
			НовыйЭлемент.Записать();
			ЯчейкаХраненияСсылка = НовыйЭлемент.Ссылка;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Номенклатура,СкладКомпании",Номенклатура,Склад);
	ЯчейкиПоУмолчанию=РегистрыСведений.ЯчейкиХраненияПоУмолчанию.Получить(СтруктураПоиска).ЯчейкаХранения;
	
	МенеджерЗаписиЯчеекХранения=РегистрыСведений.ЯчейкиХраненияПоУмолчанию.СоздатьМенеджерЗаписи();
	МенеджерЗаписиЯчеекХранения.Номенклатура=Номенклатура;
	МенеджерЗаписиЯчеекХранения.СкладКомпании=Склад;
	МенеджерЗаписиЯчеекХранения.Прочитать();
	Если ЗначениеЗаполнено(ЯчейкиПоУмолчанию) И ЯчейкиПоУмолчанию<>ЯчейкаХраненияСсылка Тогда
		Сообщить("Для склад """ + Строка(Склад) + """ и номенклатуры """ + Строка(Номенклатура) + """ назначеная новая ячейка хранения по умолчанию """+СокрЛП(Строка(ЯчейкаХраненияСсылка))+""".",СтатусСообщения.Информация);
		МенеджерЗаписиЯчеекХранения.Номенклатура=Номенклатура;
		МенеджерЗаписиЯчеекХранения.СкладКомпании=Склад;
	   	МенеджерЗаписиЯчеекХранения.ЯчейкаХранения=ЯчейкаХраненияСсылка;
    	МенеджерЗаписиЯчеекХранения.Записать(Истина);
	ИначеЕсли НЕ ЗначениеЗаполнено(ЯчейкиПоУмолчанию) Тогда
		Сообщить("Для склад """ + Строка(Склад) + """ и номенклатуры """ + Строка(Номенклатура) + """ назначеная ячейка хранения по умолчанию """+СокрЛП(Строка(ЯчейкаХраненияСсылка))+""".",СтатусСообщения.Информация);
		МенеджерЗаписиЯчеекХранения.Номенклатура=Номенклатура;
		МенеджерЗаписиЯчеекХранения.СкладКомпании=Склад;
	   	МенеджерЗаписиЯчеекХранения.ЯчейкаХранения=ЯчейкаХраненияСсылка;
    	МенеджерЗаписиЯчеекХранения.Записать(Истина);
	КонецЕсли; 
	Значение=ЯчейкаХраненияСсылка;
	
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПАНЕЛЕЙ ФОРМ СПИСКОВ И ДОКУМЕНТОВ

// Выбор пункта меню "Установить время"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Кнопка - кнопка командной панели, пункта меню
//
Процедура дкДействияФормыВвестиВремя(ЭтаФорма,Кнопка) Экспорт
	ФормаВремя = ПолучитьОбщуюФорму("ВводВремени",ЭтаФорма);
	Попытка
		ФормаВремя.НачальноеЗначениеВыбора = ЭтаФорма.Дата;
	Исключение КонецПопытки;
	НовоеВремя = ФормаВремя.ОткрытьМодально();
	Если НовоеВремя <> Неопределено Тогда
		Попытка
			НоваяДата = Дата(Год(ЭтаФорма.Дата),Месяц(ЭтаФорма.Дата),День(ЭтаФорма.Дата),Час(НовоеВремя),Минута(НовоеВремя),Секунда(НовоеВремя));
			ЭтаФорма.Дата = НоваяДата;
			дкПроверитьКорректностьНомераИДаты(ЭтаФорма, Неопределено);
		Исключение КонецПопытки;
	КонецЕсли;
	дкФормаОбновлениеОтображения(ЭтаФорма);
Конецпроцедуры // дкДействияФормыВвестиВремя()

// Нажатие кнопки "Валюта"
//
// Параметры:
// ЭтаФорма 		 - форма, форма переданного документа
// Кнопка 			 - кнопка командной панели, пункта меню
// ТребуетсяПересчет - булево. признак что требуется выполнить пересчет суммы валюты
//
Процедура дкДействияФормыВыборВалюты(ЭтаФорма,Кнопка,ТребуетсяПересчет = Истина) Экспорт
	// получим общую форму для валюты
	ФормаВыборВалюты = ПолучитьОбщуюФорму("ВыборВалюты", ЭтаФорма);
	ФормаВыборВалюты.ТребуетсяПересчет = ТребуетсяПересчет;
	ФормаВыборВалюты.ОткрытьМодально();
КонецПроцедуры // дкДействияФормыВыборВалюты()

// нажатие кнопки "Выгрузить в табличный документ" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка - ДокументСсылка, документ, который выгружаем
//
Процедура дкДействияФормыВыгрузкаВТабличныйДокумент(ЭтаФорма,Ссылка) Экспорт
	Попытка	// Сначала попробуем для формы списка
		ТекущиеДанныеСписка = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные;
		Если ТекущиеДанныеСписка = Неопределено Тогда
			Возврат;
		Иначе
			Объект = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные.Ссылка;
		КонецЕсли;
	Исключение
		Объект = ЭтаФорма.Ссылка;
	КонецПопытки;
	Если обЗначениеНеЗаполнено(Объект) Тогда
		#Если Клиент Тогда
			Предупреждение("Элемент должен быть записан !");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	// перед выгрузкой не помешало бы проверить, есть ли права на данный объект
	Результат = обПраво("Право доступа " + Объект.Метаданные().Имя);
	Если Результат = Перечисления.ВидыПравДляДокументов.НетДоступа Тогда
		Сообщить("Нет доступа к объектам вида " + Объект.Метаданные().Представление(), СтатусСообщения.Важное); 
		Возврат;
	КонецЕсли;
	
	Если Объект <> Неопределено и Не Объект.Пустая() Тогда 
		ОбъектИсторияОбъекта = Обработки.ВыгрузкаВТабличныйДокумент.Создать();
		ОбъектИсторияОбъекта.ОбъектСсылка = Объект;
		ОбъектИсторияОбъекта.ВыгрузитьВТабличныйДокумент();
	КонецЕсли
КонецПроцедуры // дкДействияФормыВыгрузкаВТабличныйДокумент()

// Вывод дерева подчиненности документов
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка	 - ДокументСсылка, ссылка на документ, для которого строится дерево
//
Процедура дкДействияФормыДеревоДокумента(ЭтаФорма,Ссылка) Экспорт
	Если Ссылка = Неопределено ИЛИ обЗначениеНеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Дерево = Обработки.ДеревоДокументов.Создать();
	Дерево.ВыбДокумент = Ссылка.Ссылка;
	Попытка
		Дерево.ПолучитьДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.ВывестиДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.НастроитьПолеДеревоДокументов();
	Исключение
		Предупреждение("По документу данного вида построение дерева невозможно!",10);
	КонецПопытки;
КонецПроцедуры // дкДействияФормыДеревоДокумента()

// Нажатие кнопки "ДобавитьВИзбранное" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка - ДокументСсылка, документ, который добавляем в избранное
// ИмяФормы - строка, имя текущей формы
//
Процедура дкДействияФормыДобавитьВИзбранное(ЭтаФорма, Ссылка, ИмяФормы) Экспорт
	ЭтоФормаСписка = Ссылка = Неопределено;
	Избранное = Обработки.Избранное.Создать();
	Если ЭтоФормаСписка Тогда
		Менеджер = "";
		Попытка
			Менеджер = "Документы." + Сред(Строка(ЭтаФорма.ДокументСписок), СтрДлина("ДокументСписок") + 2);
		Исключение
			Менеджер = "ЖурналыДокументов." + Сред(Строка(ЭтаФорма.ЖурналДокументовСписок), СтрДлина("ЖурналДокументовСписок") + 2);
		КонецПопытки;
		Избранное.ДобавитьВИзбранное(ЭтаФорма.Заголовок, Менеджер, ИмяФормы); 
	Иначе
		Избранное.ДобавитьВИзбранное(Ссылка);
	КонецЕсли;	
КонецПроцедуры // дкДействияФормыДобавитьВИзбранное()

// Перемещается по списку документов вверх или вниз (в зависимости от нажатой кнопки) 
// не закрывая форму документа
//
// Параметры:
// ЭтаФорма - форма, форма списка документов
// Предыдущий - Булево. Истина - ищем предыдущий документ. Ложь - следующий.
//
Процедура дкДействияФормыДругойДокумент(ЭтаФорма,Предыдущий = Ложь) Экспорт 
	// проверим модифицированность
	Если ЭтаФорма.Модифицированность ИЛИ ЭтаФорма.Модифицированность() Тогда
		Предупреждение("Документ не записан!",10);
		Возврат;
	КонецЕсли;
	// ищем следующий или предыдущий документ
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ЭтаФорма.Метаданные().Имя + " КАК Док
	|ГДЕ
	|	Док.МоментВремени" + ?(Предыдущий," < "," > ") + "&Момент
	|
	|УПОРЯДОЧИТЬ ПО Док.Дата " + ?(Предыдущий,"Убыв","Возр") + ", Док.МоментВремени " + ?(Предыдущий,"Убыв","Возр"));
	Запрос.УстановитьПараметр("Момент",ЭтаФорма.МоментВремени());
	РезультатПоискДокумента = Запрос.Выполнить();
	Если РезультатПоискДокумента.Пустой() Тогда
		Сигнал();
		Возврат;
	КонецЕсли;
	
	// меняем
	ЭтаФорма.ДокументОбъект = РезультатПоискДокумента.Выгрузить().Получить(0).Ссылка.ПолучитьОбъект();
	ЭтаФорма.Обновить();
КонецПроцедуры // дкДействияФормыДругойДокумент()

// Нажатие кнопки "ИсторияОбъекта" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка - ДокументСсылка, документ, для которого получаем историю
//
Процедура дкДействияФормыИсторияОбъекта(ЭтаФорма,Ссылка) Экспорт
	Попытка	// Сначала попробуем для формы списка
		ТекущиеДанныеСписка = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные;
		Если ТекущиеДанныеСписка = Неопределено Тогда
			Возврат;
		Иначе
			Объект = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные.Ссылка;
		КонецЕсли;
	Исключение
		Объект = ЭтаФорма.Ссылка;
	КонецПопытки;
	Если обЗначениеНеЗаполнено(Объект) Тогда
		#Если Клиент Тогда
			Предупреждение("Элемент должен быть записан !");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	Если Объект <> Неопределено и Не Объект.Пустая() Тогда 
		ОбъектИсторияОбъекта = Обработки.ИсторияОбъекта.Создать();
		ОбъектИсторияОбъекта.ОбъектСсылка = Объект;
		ОбъектИсторияОбъекта.СформироватьЖурналРегистрации();
	КонецЕсли
КонецПроцедуры // дкДействияФормыИсторияОбъекта()

// открывает диалог поиска документов по номеру документа-основания
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
Процедура дкДействияФормыПоискПоНомеруДокументаОснования(ЭтаФорма) Экспорт
	ФормаПоискаПоНомеруДокументаОснования = ПолучитьОбщуюФорму("ПоискПоНомеруДокументаОснования", ЭтаФорма);	
	Попытка
		ТекДокумент = ЭтаФорма.ЭлементыФормы.Список.ТекущаяСтрока;
	Исключение
		Попытка
			ТекДокумент = ЭтаФорма.ЭлементыФормы.Список.ТекущаяСтрока;
		Исключение
			ТекДокумент = ЭтаФорма.ДокументОбъект;
		КонецПопытки;
	КонецПопытки;
	ТекДокументМетаданные = ТекДокумент.Метаданные();
	
	ФормаПоискаПоНомеруДокументаОснования.НомерДокументаОснования = ТекДокумент.Номер;
	Для каждого Док Из Метаданные.Документы Цикл
		Если Док.ВводитсяНаОсновании.Содержит(ТекДокументМетаданные) Тогда
			ФормаПоискаПоНомеруДокументаОснования.спВидыДокументов.Добавить(Док.Имя, Док.Синоним, Истина);
		КонецЕсли; 
	КонецЦикла; 
	
	ФормаПоискаПоНомеруДокументаОснования.Открыть();	
КонецПроцедуры // дкДействияФормыПоискПоНомеруДокументаОснования()

// Нажатие кнопки "ПоискСсылок" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка - ДокументСсылка, документ, для которого выполняем поиск ссылок
//
Процедура дкДействияФормыПоискСсылок(ЭтаФорма,Ссылка) Экспорт
	Попытка	// Сначала попробуем для формы списка
		ТекущиеДанныеСписка = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные;
		Если ТекущиеДанныеСписка = Неопределено Тогда
			Возврат;
		Иначе
			Объект = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные.Ссылка;
		КонецЕсли; 
	Исключение
		Объект = ЭтаФорма.Ссылка;
	КонецПопытки;
	Если обЗначениеНеЗаполнено(Объект) Тогда
		#Если Клиент Тогда
			Предупреждение("Элемент должен быть записан !");
		#КонецЕсли
		Возврат;
	КонецЕсли;
	Если Объект <> Неопределено и Не Объект.Пустая() Тогда 
		ОбъектПоискСсылок = Обработки.ПоискСсылок.Создать();
		ОбъектПоискСсылок.ОбъектСсылка = Объект;
		ОбъектПоискСсылок.НайтиВходящие();
		ОбъектПоискСсылок.НайтиИсходящие();
	КонецЕсли;
КонецПроцедуры // дкДействияФормыПоискСсылок()

// Выбор пункта из подменю "Операции"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Кнопка 	 - кнопка командной панели, пункта меню
//
Процедура дкДействияФормыОперация(ЭтаФорма,Кнопка = Неопределено) Экспорт
	зфДействияФормыОперация(ЭтаФорма,Кнопка);
	ЭтаФорма.ДокументОбъект.ОбработкаРеквизита("ХозОперация",,ЭтаФорма);
КонецПроцедуры // дкДействияФормыОперация()

// нажатие кнопки "Редактировать номер" 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Ссылка - ДокументСсылка, документ, номер которого редактируем
//
Процедура дкДействияФормыРедактироватьНомер(ЭтаФорма,Ссылка) Экспорт
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	//получим элемент формы "номенр"
	Номер = ЭтаФорма.ЭлементыФормы.Найти("Номер");
	Если Номер = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//получим кнопку
	Попытка
		Кнопка = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Подменю.Кнопки.РедактироватьНомер;
	Исключение
	КонецПопытки;
	Если Кнопка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//изменим доступность элемента формы и подсказку
	Если НЕ Кнопка.Пометка Тогда
		ТекстВопроса = "Номер документу присваивается автоматически при записи, самостоятельное его редактирование может привести к нарушению в нумерации в системе. 
						|Вы действительно хотите установить номер вручную?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	Номер.ТолькоПросмотр = Кнопка.Пометка;
	Кнопка.Пометка = Не Кнопка.Пометка;

	//необходимо обновить автоотметки незаполненных реквизитов
	Попытка
		СтруктураОбязательныхРеквизитов = ЭтаФорма.ПолучитьОбязательныеРеквизиты();
	Исключение
	КонецПопытки;
	
	Если СтруктураОбязательныхРеквизитов <> Неопределено Тогда 
		удРасставитьАвтоотметкиНезаполненного(ЭтаФорма, СтруктураОбязательныхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры // спДействияФормыПоискСсылок()

// Обработчик нажатия кнопок подменю Утверждение
//
// Параметры
// ЭтаФорма - Форма - Форма переданного документа
// Кнопка 	 - КнопкаКоманднойПанели - Пункт меню
//
Процедура дкОсновныеДействияФормыУтверждение(ЭтаФорма,Кнопка = неопределено, ИмяСписка = Неопределено) Экспорт
	
	ЭтоФормаСписка = Ложь;
	ТекСтрока = неопределено;
	ДокСсылка = неопределено;
	Попытка
		ДокументОбъект = ЭтаФорма.ДокументОбъект;
		ДокСсылка = ДокументОбъект.Ссылка;
	Исключение
		Попытка
			ИмяСписка = ?(ИмяСписка = Неопределено, "Список", ИмяСписка);
			ТекСтрока = ЭтаФорма.ЭлементыФормы[ИмяСписка].ТекущиеДанные;
			Если ТекСтрока = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ДокСсылка = ТекСтрока.Ссылка;
			ДокументОбъект = ДокСсылка.ПолучитьОбъект();
		Исключение
			Возврат;
		КонецПопытки;
		ЭтоФормаСписка = Истина;
	КонецПопытки;
	
	Если ТипЗнч(Кнопка) <> Тип("Строка") Тогда
		КнопкаИмя = Кнопка.Имя;
	Иначе
		КнопкаИмя = Кнопка;
	КонецЕсли;
	
	Если КнопкаИмя = "История" Тогда
		ФормаСписка = РегистрыСведений.СостоянияДокументов.ПолучитьФормуСписка(,ЭтаФорма,ДокСсылка);
		ФормаСписка.ПараметрОтборПоРегистратору = ДокСсылка;
		ФормаСписка.Открыть();
		Возврат;
	КонецЕсли; 
	
	Организация = Неопределено;
	Попытка	// Получим дату запрета редактирования для организации указанной в документе
		Организация = ДокументОбъект.Организация;	
	Исключение 
	КонецПопытки;
	// если не получилось определить организацию документа то получим ее из настроек пользователя
	Если Организация = Неопределено Тогда
		Организация = ПараметрыСеанса.Организация;
	КонецЕсли;
	ДатаЗапретаРедактирования = КонецДня(орПолучитьДатуЗапретаРедактирования(ДокументОбъект));
	Если ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.ЗаказНаряд") ИЛИ ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
		Если обЗначениеНеЗаполнено(ДокументОбъект.ДатаЗакрытия) Тогда
			ДокументОбъектДата=ДокументОбъект.Дата;
		Иначе
			ДокументОбъектДата=ДокументОбъект.ДатаЗакрытия;
		КонецЕсли; 
	Иначе
		ДокументОбъектДата=ДокументОбъект.Дата;
	КонецЕсли; 
	Если (ДокументОбъектДата <= ДатаЗапретаРедактирования) Тогда
		
		//++бизтех++
		Если НЕ (ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") ИЛИ ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.РабочийЛистОтделаСтрахования")) Тогда //Bizteh 20.01.2023
			Сообщить("Дата документа находится в закрытом периоде. Для организации < " + СокрЛП(Организация) + " > дата запрета редактирования " + Формат(ДатаЗапретаРедактирования,"ДФ = ""дд.ММ.гггг"""),СтатусСообщения.Важное);
			Возврат;	
		КонецЕсли; 
		//--бизтех--
		
	Иначе
		СтруктураИнтервалаЗапрета = орПолучитьИнтервалЗапретаРедактирования(ДокументОбъект, ТекущаяДата());
		Если (ДокументОбъектДата > СтруктураИнтервалаЗапрета.ВерхГраница) ИЛИ (ДокументОбъектДата < СтруктураИнтервалаЗапрета.НижнГраница) Тогда
			Сообщить("Дата документа находится за пределами разрешенного интервала редактирования.",СтатусСообщения.Важное);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если КнопкаИмя <> "Подготовлен" Тогда
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("Подготовлен") Тогда
			ДокументОбъект.ДополнительныеСвойства.Удалить("Подготовлен");
		КонецЕсли;
	КонецЕсли;
	
	// определим текущий статус документа - ТекСтатус и
	// присваиваемый статус ВыбСтатус для записи в регистр
	Отказ = Ложь;
	Если ДокументОбъект.ЭтоНовый() И НЕ ЭтоФормаСписка Тогда
		//Если документ еще не записан выдаем соотв. вопрос о записи
		Ответ = Вопрос("Документ еще не записан, ввод данных об утверждении не возможен."
		 + Символы.ПС + "Записать документ?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка
				Отказ = НЕ ЭтаФорма.ЗаписатьВФорме();
				ДокСсылка = ДокументОбъект.Ссылка; // запись прошла успешно
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если КнопкаИмя = "Утвержден" И ДокументОбъект.Метаданные().Проведение=Метаданные.СвойстваОбъектов.Проведение.Разрешить И НЕ ДокументОбъект.Проведен Тогда
		Ответ = Вопрос("Для установки документа в состояние ""Утвержден"" необходимо проведение документа."
		 + Символы.ПС + "Провести документ?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// если пытаемся утвердить или отклонить, но документ был модифицирован после открытия,
	// записываем в режиме записи
	Если НЕ ЭтоФормаСписка И ЭтаФорма.Модифицированность Тогда
		Если ДокументОбъект.Проведен Тогда
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Возврат;
			КонецПопытки; 
		Иначе
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				Возврат;
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли; 
	
	ТекСтатус = дкПолучитьСтатусДокумента(ДокСсылка);
	ВыбСтатус = Перечисления.СтатусыДокументов[КнопкаИмя];
	
	дкВыполнитьУтверждение(ДокСсылка,ДокументОбъект,ТекСтатус,ВыбСтатус);
	
	Если ВыбСтатус = Перечисления.СтатусыДокументов.Согласован Тогда
		Если ДокументОбъект.Проведен Тогда
			ВыполнитьОтменуПроведения = обПраво("ОтменаПроведенияПриВозвратеКСогласованию",,,ЭтаФорма);
			Если ВыполнитьОтменуПроведения = Перечисления.ВариантыОтветов.Спрашивать Тогда
				ТекстВопроса = "Произведен возврат документа к статусу ""Согласован""
				|Выполнить отмену проведения документа?";
				Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,25,КодВозвратаДиалога.Да);
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("Согласован") Тогда
						ДокументОбъект.ДополнительныеСвойства.Вставить("Согласован",Истина);
					КонецЕсли;
					Попытка
						ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Исключение
					КонецПопытки;
				КонецЕсли;
			ИначеЕсли ВыполнитьОтменуПроведения = Перечисления.ВариантыОтветов.Да Тогда
				Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("Согласован") Тогда
					ДокументОбъект.ДополнительныеСвойства.Вставить("Согласован",Истина);
				КонецЕсли;
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	Оповестить("ЗаполнитьСписокУтверждение",ДокументОбъект,);
	Если НЕ ЭтоФормаСписка Тогда
		дкВывестиЗаголовокФормы(ЭтаФорма);
	КонецЕсли; 
	
КонецПроцедуры // дкОсновныеДействияФормыУтверждение()

// Выполняет утверждение после проведение/отмены проведения
// документа.
//
// Параметры:
// Документобъект - Документобъект - Документ, для которого
//					 выполняется утверждение.
// Событие - "Строка" - вид события.
// 
Процедура ВыполнитьУтверждениеПослеПроведения(ДокументОбъект, Событие = "ОбработкаПроведения") Экспорт
	
	ВидДокумента = Документобъект.Метаданные().Имя;
	Если дкПроверитьИспользованиеУтверждения(ВидДокумента,Документобъект.Права) Тогда
		
		СтатусДокумента = дкПолучитьСтатусДокумента(Документобъект.Ссылка);
		// получаем соответствие действий над объектов из общего кэша прав
		ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента,Документобъект.Права);
		Если ПраваУтверждения <> Неопределено Тогда
			Если Событие = "ОбработкаПроведения" И ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден] Тогда
				
				Если ((НЕ ВидДокумента = "ЗаказНаряд") ИЛИ ДокументОбъект.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт) И 
					(СтатусДокумента = Перечисления.СтатусыДокументов.Согласован ИЛИ 
					(ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован] И НЕ СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден)) Тогда
					дкУтверждение(Документобъект,Перечисления.СтатусыДокументов.Утвержден);
				КонецЕсли;
				
				// вопрос об отклонении при отмене проведения документа
			ИначеЕсли Событие = "ОбработкаУдаленияПроведения" И ПраваУтверждения[Перечисления.СтатусыДокументов.Отклонен] Тогда
				Согласован = Ложь;
				Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("Согласован",Согласован) Тогда
					Если (СтатусДокумента = Перечисления.СтатусыДокументов.Согласован
						ИЛИ ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован]) Тогда
						
						ОтклонениеПриОтменеПроведения = обПраво("ОтклонениеПриОтменеПроведения",Документобъект.Права,,Документобъект);
						Если ОтклонениеПриОтменеПроведения = Перечисления.ВариантыОтветов.Да Тогда
							дкУтверждение(Документобъект,Перечисления.СтатусыДокументов.Отклонен);	
						ИначеЕсли ОтклонениеПриОтменеПроведения = Перечисления.ВариантыОтветов.Спрашивать Тогда		
							Ответ = Вопрос("Установить документу статус Отклонен?", РежимДиалогаВопрос.ДаНет);
							Если Ответ = КодВозвратаДиалога.Да Тогда
								Попытка
									дкУтверждение(Документобъект,Перечисления.СтатусыДокументов.Отклонен);
								Исключение
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьУтверждениеПослеПроведения() 

// Формирует структуру видимости кнопок командной панели
//
// Параметры
//	Объект - ДокументОбъект. Документ, для которого нужно сформировать структуру
//	СтатусДокумента - ПеречислениеСсылка.СтатусыДокументов. Текущий найденный статус документа
// ИсторияУтверждения – Соответствие. Содержит соответствие между статусами и пользователями,
//						 присвоившими данные статусы документу.
// СтруктураКнопокУтверждения – Структура
// ПраваПользователя – Соответствие - Кэш прав и настроек.Обычно равен ДокументОбъект.Права
//
Процедура дкСформироватьСтруктуруКнопокУтверждения(ДокументСсылка, ИсторияУтверждения,СтатусДокумента,СтруктураКнопокУтверждения, ПраваПользователя)

	ВидДокумента = ДокументСсылка.Метаданные().Имя;
	ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента, ПраваПользователя);
	Если ПраваУтверждения = Неопределено Тогда
		СтруктураКнопокУтверждения.Вставить("Подготовлен",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Согласован",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Утвержден",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Отклонен",		Ложь);
		Возврат;
	КонецЕсли;
	ПравоПодготовлен = ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
	ПравоСогласован  = ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован];
	ПравоУтвержден   = ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден];
	ПравоОтклонен    = ПраваУтверждения[Перечисления.СтатусыДокументов.Отклонен];
	
	АвторПодготовлен = ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
	АвторСогласован  = ИсторияУтверждения[Перечисления.СтатусыДокументов.Согласован];
	АвторУтвержден   = ИсторияУтверждения[Перечисления.СтатусыДокументов.Утвержден];
	АвторОтклонен    = ИсторияУтверждения[Перечисления.СтатусыДокументов.Отклонен];
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	// 1. Кнопка Подготовлен
	ЗначениеПодготовлен = Ложь;
	Если ПравоПодготовлен Тогда
		// Новый или не утверждался
		Если СтатусДокумента = Перечисления.СтатусыДокументов.ПустаяСсылка() Тогда
			// покажем
			ЗначениеПодготовлен = Истина;
			
			// Подготовлен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			// уже подготовлен, незачем показывать
			ЗначениеПодготовлен = Ложь;
			
			// Согласован
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			// есть автор тот же
			Если ПравоСогласован И АвторСогласован = ТекПользователь Тогда
				ЗначениеПодготовлен = Истина;
			КонецЕсли; 
			
			// Утвержден
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда	
			// если утвержден - не даем опять подготовить (можно только вернуться к согласован)
			// (нельзя перескочить сразу через 2 этапа назад)
			ЗначениеПодготовлен = Ложь;
			
			// Отклонен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			// если отклонен - не даем опять подготовить (можно только вернуться к согласован)
			ЗначениеПодготовлен = Ложь;
			
		КонецЕсли; 
	Иначе
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			// есть автор тот же
			Если ПравоСогласован И АвторСогласован = ТекПользователь Тогда
				ЗначениеПодготовлен = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли; 
	
	// 2. Кнопка Согласован
	ЗначениеСогласован = Ложь;
	Если ПравоСогласован Тогда
		// Новый или не утверждался
		Если СтатусДокумента = Перечисления.СтатусыДокументов.ПустаяСсылка() Тогда
			// покажем если есть право на согласование и подготовку
			Если ПравоПодготовлен Тогда
				ЗначениеСогласован = Истина;
			КонецЕсли; 
			
			// Подготовлен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			ЗначениеСогласован = Истина; // логично
			
			// Согласован
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			ЗначениеСогласован = Ложь; // уже согласован, незачем показывать
			
			// Утвержден
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
			// есть автор тот же
			Если ПравоУтвержден И АвторУтвержден = ТекПользователь Тогда
				ЗначениеСогласован = Истина;
			КонецЕсли; 
			
			// Отклонен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			// есть автор тот же
			Если ПравоОтклонен И АвторОтклонен = ТекПользователь Тогда
				ЗначениеСогласован = Истина;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
			// есть автор тот же
			Если ПравоУтвержден И АвторУтвержден = ТекПользователь Тогда
				ЗначениеСогласован = Истина;
			КонецЕсли;
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			// есть автор тот же
			Если ПравоОтклонен И АвторОтклонен = ТекПользователь Тогда
				ЗначениеСогласован = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	// 3. Кнопка Утвержден
	ЗначениеУтвержден = Ложь;
	Если ПравоУтвержден Тогда
		// Новый или не утверждался
		Если СтатусДокумента = Перечисления.СтатусыДокументов.ПустаяСсылка() Тогда
			// покажем если есть право на согласование и подготовку
			Если ПравоПодготовлен И ПравоСогласован Тогда
				ЗначениеУтвержден = Истина;
			КонецЕсли;
			
			// Подготовлен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			// покажем если есть право на согласование
			Если ПравоСогласован Тогда
				ЗначениеУтвержден = Истина;
			КонецЕсли;
			
			// Согласован
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			ЗначениеУтвержден = Истина; // логично
			
			// Утвержден
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда	
			ЗначениеУтвержден = Ложь; // уже утвержден, незачем показывать
			
			// Отклонен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			// надо сначала вернуть к согласован
			ЗначениеУтвержден = Ложь;    			
		КонецЕсли; 
	КонецЕсли;
	
	// 4. Кнопка Отклонен
	ЗначениеОтклонен = Ложь;
	Если ПравоОтклонен Тогда
		// Новый или не утверждался
		Если СтатусДокумента = Перечисления.СтатусыДокументов.ПустаяСсылка() Тогда
			// покажем если есть право на согласование и подготовку
			Если ПравоПодготовлен И ПравоСогласован Тогда
				ЗначениеОтклонен = Истина;
			КонецЕсли;
			
			// Подготовлен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			// покажем если есть право на согласование
			Если ПравоСогласован Тогда
				ЗначениеОтклонен = Истина;
			КонецЕсли;
			
			// Согласован
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			ЗначениеОтклонен = Истина; // логично
			
			// Утвержден
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда	
			// надо сначала вернуть к согласован
			ЗначениеОтклонен = Ложь;
			
			// Отклонен
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			ЗначениеОтклонен = Ложь; // уже отклонен, незачем показывать
			
		КонецЕсли;
	КонецЕсли;
	
	// заполняем структуру для кнопок
	СтруктураКнопокУтверждения.Вставить("Подготовлен",	ЗначениеПодготовлен);
	СтруктураКнопокУтверждения.Вставить("Согласован",	ЗначениеСогласован);
	СтруктураКнопокУтверждения.Вставить("Утвержден",	ЗначениеУтвержден);
	СтруктураКнопокУтверждения.Вставить("Отклонен",		ЗначениеОтклонен);
	
КонецПроцедуры // дкСформироватьСтруктуруКнопокУтверждения()

// Выполняет сортировку по коду и производителю в табличной части документа
//
// Параметры:
//  ЭтотОбъект - Документобъект - Документ, для которого выполняется сортировка
//  Имя - "Строка" - Имя кнопки сортировки.
//  ТекСтрока - СтрокаТабличнойЧасти - Текущая строка табличной части.
//  ЭтаФорма - Форма - Форма документа.
//  ДопПараметры - КнопкаКоманднойПанели - Кнопка сортировки.
//
Процедура дкДействияФормыРасширеннаяСортировкаТабЧасти(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры)
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТабПоля	= Лев(Имя, Найти(Имя, "_РасширеннаяСортировка_")-1);
	ТабПоле		= ЭтаФорма.ЭлементыФормы[ИмяТабПоля];
	ТабЧасть	= ТабПоле.Значение;
	
	Если ТабПоле.ТолькоПросмотр Или Не ТабПоле.ИзменятьПорядокСтрок Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТекущаяКолонка = ТабПоле.ТекущаяКолонка;
	Исключение
		Возврат;
	КонецПопытки;
	ТекущаяКолонкаИмя = ТекущаяКолонка.Имя;
	
	НаправлениеСортировкиКолонки = ?(Найти(Имя,"_Убыв") > 0, " Убыв", " Возр");
	
	Если (Не ПустаяСтрока(ТекущаяКолонка.Данные)) Тогда // Это реквизит табличной части
		Попытка
			ТабЧасть.Сортировать(ТекущаяКолонкаИмя + НаправлениеСортировкиКолонки);
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	Если Не	(ТекущаяКолонкаИмя = "Код" Или ТекущаяКолонкаИмя = "НоменклатураПроизводитель") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ИмяРеквизитаКода = ЭтаФорма.ИмяРеквизитаКода;
	Исключение
		ИмяРеквизитаКода=Неопределено;
	КонецПопытки;
	Если ИмяРеквизитаКода=Неопределено ИЛИ ТипЗнч(ИмяРеквизитаКода)=Тип("ПеречислениеСсылка.РежимыВыводаКодаВДокументах") Тогда
		ИмяРеквизитаКода=дкПолучитьПараметрыРежимаВыводаКодаВДокументах(ИмяРеквизитаКода,ЭтаФорма).Имя;
	КонецЕсли;
	
	ТабЗнач = Новый ТаблицаЗначений;
	ТабЗнач.Колонки.Добавить("КодНоменклатуры", Новый ОписаниеТипов("Строка"));
	ТабЗнач.Колонки.Добавить("СтрокаТабЧасти");
	
	Если ТекущаяКолонкаИмя = "НоменклатураПроизводитель" Тогда
		ТабЗнач.Колонки.Добавить("НоменклатураПроизводитель", Новый ОписаниеТипов("Строка"));
		КолонкиСортировки = "НоменклатураПроизводитель"+НаправлениеСортировкиКолонки+", КодНоменклатуры";
	Иначе
		КолонкиСортировки = "КодНоменклатуры"+НаправлениеСортировкиКолонки;
	КонецЕсли;
	
	Для Каждого СтрокаТабЧасти Из ТабЧасть Цикл
		НовСтрокаТЗ = ТабЗнач.Добавить();
		Попытка
			НовСтрокаТЗ.КодНоменклатуры = дкПолучитьЗначениеКолонкиКода(СтрокаТабЧасти.Номенклатура,ИмяРеквизитаКода,ЭтаФорма);
		Исключение
			НовСтрокаТЗ.КодНоменклатуры = "";
		КонецПопытки;
		НовСтрокаТЗ.СтрокаТабЧасти = СтрокаТабЧасти;
		Если ТекущаяКолонкаИмя = "НоменклатураПроизводитель" Тогда
			Если ТипЗнч(СтрокаТабЧасти.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				НовСтрокаТЗ.НоменклатураПроизводитель = Строка(СтрокаТабЧасти.Номенклатура.Производитель);
			Иначе
				НовСтрокаТЗ.НоменклатураПроизводитель = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабЗнач.Сортировать(КолонкиСортировки);
	
	Итератор = 1;
	Для Каждого СтрокаТЗ Из ТабЗнач Цикл
		ТабЧасть.Сдвинуть(СтрокаТЗ.СтрокаТабЧасти, Итератор - СтрокаТЗ.СтрокаТабЧасти.НомерСтроки);
		Итератор = Итератор + 1;
	КонецЦикла;
	
КонецПроцедуры //дкДействияФормыРасширеннаяСортировкаТабЧасти()

#КонецЕсли

// Получает историю утверждения в виде соответствия Статус-Пользователь
//
// Параметры
// ДокументКУтверждению – ДокументСсылка
//
// Возвращаемое значение:
// ИсторияУтверждения – Соответствие 
//
Функция дкПолучитьИсториюУтверждения(ДокументКУтверждению) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыДокументов.Ссылка КАК СтатусДокумента,
	|	ЕСТЬNULL(СостоянияДокументов.Пользователь,&ПустойПользователь) КАК Пользователь
	|ИЗ
	|	Перечисление.СтатусыДокументов КАК СтатусыДокументов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	(ВЫБРАТЬ
	|		СостоянияДокументов.Пользователь,
	|		СостоянияДокументов.Период,
	|		СостоянияДокументов.СтатусДокумента КАК СтатусДокумента
	|	ИЗ
	|		РегистрСведений.СостоянияДокументов КАК СостоянияДокументов
	|	ГДЕ
	|		СостоянияДокументов.Регистратор = &ДокументКУтверждению
	| ) КАК СостоянияДокументов
	|	ПО СтатусыДокументов.Ссылка = СостоянияДокументов.СтатусДокумента
	|УПОРЯДОЧИТЬ ПО
	|	СостоянияДокументов.Период";
	
	Запрос.УстановитьПараметр("ДокументКУтверждению",ДокументКУтверждению);
	Запрос.УстановитьПараметр("ПустойПользователь",Справочники.Пользователи.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ИсторияУтверждения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ИсторияУтверждения.Вставить(Выборка.СтатусДокумента, Выборка.Пользователь);
	КонецЦикла;
	
	Возврат ИсторияУтверждения;
	
КонецФункции // дкПолучитьИсториюУтверждения()

// Выполняет проверку на необходимость использования системы
// утверждения документов
//
// Параметры
// ВидДокумента – Строка - Синоним документа
// ЗначенияПрав – Соответствие - Кэш прав и настроек.Обычно равен ДокументОбъект.Права
//
// Возвращаемое значение:
// ИсторияУтверждения – Соответствие. 
//
Функция дкПроверитьИспользованиеУтверждения(ВидДокумента,ЗначенияПрав) Экспорт
	
	// получаем все нужное из кэша
	ИспользоватьВсе = обПраво("ИспользоватьУтверждениеДокументов",ЗначенияПрав);
	ИспользоватьПользователь = обПраво("Утверждение по пользователю " + ВидДокумента,ЗначенияПрав);
	ИспользоватьПодразделение = обПраво("Утверждение по подразделению " + ВидДокумента,ЗначенияПрав);
	
	// Каскадная проверка
	ИспользоватьУтверждение = Ложь;
	Если ИспользоватьВсе Тогда
		Если ИспользоватьПользователь Тогда
			ИспользоватьУтверждение = Истина;
			ОсновноеПраво = "Утверждение по пользователю " + ВидДокумента;
		Иначе
			Если ИспользоватьПодразделение Тогда
				ИспользоватьУтверждение = Истина;
				ОсновноеПраво = "Утверждение по подразделению " + ВидДокумента;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ИспользоватьУтверждение;
	
КонецФункции // дкПроверитьИспользованиеУтверждения()

// Возвращает текущий статус утверждения документа
//
// Параметры
// ДокументКУтверждению – Документ.Ссылка – ссылка на документ
//
// Возвращаемое значение:
// СтатусДокумента – ПеречислениеСсылка.СтатусыДокумента
//
Функция дкПолучитьСтатусДокумента(ДокументКУтверждению) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияДокументов.СтатусДокумента,
	|	СостоянияДокументов.Период КАК Период
	|ИЗ
	|	РегистрСведений.СостоянияДокументов.СрезПоследних(, Регистратор = &Регистратор) КАК СостоянияДокументов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Регистратор",ДокументКУтверждению);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусДокумента;
	Иначе	
		Возврат Перечисления.СтатусыДокументов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // дкПолучитьСтатусДокумента()

// Выполняет утверждение после выполнения проведения/отмены проведения
// при невозможности обращения к процедуре дкОсновныеДействияФормыУтверждение().
// Параметры
// ЭтаФорма - форма, форма переданного документа
// Кнопка 	 - кнопка командной панели, пункта меню
//
Процедура дкУтверждение(ДокументОбъект,ВыбСтатус) Экспорт
	
	ТекСтатус = дкПолучитьСтатусДокумента(ДокументОбъект.Ссылка);
	дкВыполнитьУтверждение(ДокументОбъект.Ссылка,ДокументОбъект,ТекСтатус,ВыбСтатус);
	#Если Клиент Тогда
		// оповещаем открытые формы списков документов для переформирования состава подменю
		Оповестить("ЗаполнитьСписокУтверждение",ДокументОбъект.Ссылка,);
	#КонецЕсли
	
КонецПроцедуры // дкДУтверждение()

// Производит запись в регистр СостояниеДокументов на основании текущего
// и выбранного статуса документа
//
// Параметры
// ДокументОбъект – ДокументСсылка - Документ к утверждению
// ТекСтатус – ПеречислениеСсылка.СтатусыДокументов - Текущий статус документа
// ВыбСтатус – ПеречислениеСсылка.СтатусыДокументов - Выбранный статус документа
//
// Возвращаемое значение:
// ИсторияУтверждения – Соответствие. 
//
Процедура дкВыполнитьУтверждение(ДокСсылка,ДокументОбъект,ТекСтатус,ВыбСтатус) Экспорт
	
	// массив для хранения необходимых действий
	// права на утв-ние - задали ранее
	МассивДействий = Новый Массив;
	МассивДействий.Добавить(ВыбСтатус);
	
	ЕстьРеквизитСумма = ДокСсылка.Метаданные().Реквизиты.Найти("СуммаДокумента") <> неопределено;
	ЕстьРеквизитКомментарий = ДокСсылка.Метаданные().Реквизиты.Найти("Комментарий") <> неопределено;
	НаборИстория = РегистрыСведений.СостоянияДокументов.СоздатьНаборЗаписей();
	НаборИстория.Отбор.Регистратор.Установить(ДокСсылка);
	НаборИстория.Прочитать();
	
	// Заполним по умолчанию итоговую сумму
	Попытка 	
		СуммаДокумента = ДокументОбъект.РассчитатьСуммуВсего();
	Исключение
		Попытка 
			СуммаДокумента = ДокументОбъект.Товары.Итог("СуммаВсего");
		Исключение
		КонецПопытки;
	КонецПопытки;
	
	ТекДата = ТекущаяДата();
	Для Инд = 0 По МассивДействий.ВГраница() Цикл
		Запись = НаборИстория.Добавить();
		Запись.Период	    	= ТекДата; 
		Запись.Пользователь   	= ПараметрыСеанса.Пользователь;
		Запись.СтатусДокумента  = МассивДействий[Инд];
		Если ЕстьРеквизитСумма Тогда
			Запись.Сумма    = СуммаДокумента;
		КонецЕсли;
		Если ЕстьРеквизитКомментарий Тогда
			Запись.Комментарий  = ДокументОбъект.Комментарий;
		КонецЕсли; 
		Запись.Регистратор = ДокСсылка;
	КонецЦикла;
	
	Если МассивДействий.Количество() <> 0 И НЕ (ТекСтатус = ВыбСтатус) Тогда
		НаборИстория.Записать();
	КонецЕсли;
	
КонецПроцедуры

// код вида дохода

Функция ДействуетУказаниеБанкаРоссии5286У(Период) Экспорт
	
	Возврат Период = Неопределено
		Или Период >= НачалоДействияУказанияБанкаРоссии5286У();
	
КонецФункции

Функция НачалоДействияУказанияБанкаРоссии5286У() Экспорт
	
	Возврат '20200601';
	
КонецФункции

#Если Клиент Тогда

// Выполняет заполнение подменю "Утверждение"
// при открытии формы или изменении статусу документа
//
// Параметры:
// ЭтаФорма           - форма, форма переданного документа
// ПраваПользователя  – Соответствие - Кэш прав и настроек.Обычно равен ДокументОбъект.Права
// ЭтоФормаСписка     - Булево - Признак вызова процедуры из формы списка
// ИмяСписка          - Строка - имя списка документов.
// ИмяКоманднойПанели - Строка - имя командной панели списка документов.
//
Процедура дкЗаполнитьСписокУтверждение(ЭтаФорма, ДокументСсылка = Неопределено, ПраваПользователя, ЭтоФормаСписка = Ложь, ИмяСписка = Неопределено, ИмяКоманднойПанели = Неопределено) Экспорт
	
	ИмяКоманднойПанели = ?(ИмяКоманднойПанели = Неопределено, "ОсновныеДействияФормы", ИмяКоманднойПанели);
	Если ЭтаФорма.ЭлементыФормы.Найти(ИмяКоманднойПанели)<>Неопределено Тогда
		КоманднаяПанель    = ЭтаФорма.ЭлементыФормы[ИмяКоманднойПанели];
	Иначе
		//установка утверждения для АРМ, которые используют документ-объект
		Попытка
			// проверим нужно ли вообще отобразить подменю
			ДокументСсылка = дкПолучитьСсылкуНаТекущийОбъект(ЭтаФорма.ЭтотОбъект);
			ВидДокумента = СокрЛП(ДокументСсылка.Метаданные().Имя);
			ИспользоватьУтверждение = дкПроверитьИспользованиеУтверждения(ВидДокумента, ПраваПользователя);
			Если НЕ ИспользоватьУтверждение Тогда
				Возврат;
			КонецЕсли;
			СтатусДокумента = дкПолучитьСтатусДокумента(ДокументСсылка);
			ИсторияУтверждения 	 = дкПолучитьИсториюУтверждения(ДокументСсылка);
			дкУстановитьДоступностьФормыПоУтверждению(ЭтаФорма, ИсторияУтверждения, СтатусДокумента);
		Исключение
		КонецПопытки;
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Неопределено;
	ПрефиксИмя = "";
	Если ДокументСсылка = Неопределено Тогда
		Попытка
			Если ЭтоФормаСписка Тогда
				
				// Префикс нужен только для АРМ-ов
				Если ИмяСписка = Неопределено Тогда
					ИмяСписка = "Список";
				ИначеЕсли Не ИмяКоманднойПанели = Неопределено Тогда
					ПрефиксИмя = "ДокументСписок" + "_1_" + ИмяКоманднойПанели + "_2_";
				КонецЕсли;
				ТекСтрока = ЭтаФорма.ЭлементыФормы[ИмяСписка].ТекущиеДанные;
				Если ТекСтрока = неопределено Тогда
					Возврат;
				Иначе
					ДокументСсылка = ТекСтрока.Ссылка;
				КонецЕсли; 
			Иначе
				ДокументСсылка = ЭтаФорма.Ссылка;
			КонецЕсли;
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	// добавляем подменю Утверждение
	Кнопки = КоманднаяПанель.Кнопки;
	// если добавили ранее - удаляем для формирования нового состава кнопок подменю
	КнопкаПодменю = Кнопки.Найти("Утверждение");
	Если КнопкаПодменю <> Неопределено Тогда
		Кнопки.Удалить(КнопкаПодменю);
		Если ЭтаФорма.ЭлементыФормы.Найти("Комментарий") <> неопределено Тогда
			ШиринаКомментарий = ЭтаФорма.ЭлементыФормы.Комментарий.Ширина;
		КонецЕсли;
		Если ЭтаФорма.ЭлементыФормы.Найти("тКомментарий") <> неопределено И ЭтоФормаСписка Тогда
			ШиринатКомментарий = ЭтаФорма.ЭлементыФормы.тКомментарий.Ширина;
		КонецЕсли;
	Иначе
		Если ЭтаФорма.ЭлементыФормы.Найти("Комментарий") <> неопределено Тогда
			ШиринаКомментарий = ЭтаФорма.ЭлементыФормы.Комментарий.Ширина - 105;
		КонецЕсли;
		Если ЭтаФорма.ЭлементыФормы.Найти("тКомментарий") <> неопределено И ЭтоФормаСписка Тогда
			ШиринатКомментарий = ЭтаФорма.ЭлементыФормы.тКомментарий.Ширина - 70;
		КонецЕсли;
	КонецЕсли; 
	
	КнопкаПодменю = Кнопки.Найти("УтверждениеРазделитель");
	Если Не КнопкаПодменю = Неопределено Тогда
		Кнопки.Удалить(КнопкаПодменю);
	КонецЕсли;
	
	// Проверка на необходимость подключения подменю
	ВидДокумента = СокрЛП(ДокументСсылка.Метаданные().Имя);
	
	// проверим нужно ли вообще отобразить подменю
	ИспользоватьУтверждение = дкПроверитьИспользованиеУтверждения(ВидДокумента, ПраваПользователя);
	Если НЕ ИспользоватьУтверждение Тогда
		Возврат;
	КонецЕсли;
	
	Кнопки.Добавить("УтверждениеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
	Кнопки.Добавить("Утверждение",ТипКнопкиКоманднойПанели.Подменю,"Утверждение",);
	//Кнопки.Утверждение.Картинка = БиблиотекаКартинок.Утверждение;
	Кнопки.Утверждение.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
	
	Если ЭтаФорма.ЭлементыФормы.Найти("Комментарий") <> неопределено Тогда
		ЭтаФорма.ЭлементыФормы.Комментарий.Ширина = ШиринаКомментарий;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ;
	КонецЕсли;
	Если ЭтаФорма.ЭлементыФормы.Найти("тКомментарий") <> неопределено И ЭтоФормаСписка Тогда
		ЭтаФорма.ЭлементыФормы.тКомментарий.Ширина = ШиринатКомментарий;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   ;
	КонецЕсли;
	Кнопки.Сдвинуть(Кнопки.УтверждениеРазделитель,-Кнопки.Количество());
	Кнопки.Сдвинуть(Кнопки.Утверждение,-Кнопки.Количество());
	
	Если ТекСтрока <> Неопределено ИЛИ ДокументСсылка <> Неопределено Тогда
		// определим какие кнопки необходимо показать
		СтруктураКнопокУтверждения = Новый Структура();
		// определим тек.статус документа
		СтатусДокумента = дкПолучитьСтатусДокумента(ДокументСсылка);
		
		// кэш авторов действий для проверки
		ИсторияУтверждения 	 = дкПолучитьИсториюУтверждения(ДокументСсылка);
		
		дкСформироватьСтруктуруКнопокУтверждения(ДокументСсылка, ИсторияУтверждения, СтатусДокумента, СтруктураКнопокУтверждения, ПраваПользователя);
		
		МетаданныеСтатусыДокументов = Перечисления.СтатусыДокументов.ПустаяСсылка().Метаданные();
		// добавляем необходимые действия
		Для каждого ЭлементСтруктуры Из СтруктураКнопокУтверждения Цикл
			Если ЭлементСтруктуры.Значение Тогда
				ИмяКнопки 	 = ЭлементСтруктуры.Ключ;
				ТекстКнопки = МетаданныеСтатусыДокументов.ЗначенияПеречисления[ИмяКнопки].Синоним;
				Кнопки.Утверждение.Кнопки.Добавить(ПрефиксИмя + ИмяКнопки, ТипКнопкиКоманднойПанели.Действие,
				ТекстКнопки,Новый Действие("ДополнительныеДействияФормы"));
				Кнопки.Утверждение.Кнопки[ПрефиксИмя + ИмяКнопки].ИзменяетДанные = Истина;
				Если ИмяКнопки = "Подготовлен" Тогда
					Кнопки.Утверждение.Кнопки[ПрефиксИмя + ИмяКнопки].Картинка = БиблиотекаКартинок.Подготовлен;
				ИначеЕсли ИмяКнопки = "Согласован" Тогда
					Кнопки.Утверждение.Кнопки[ПрефиксИмя + ИмяКнопки].Картинка = БиблиотекаКартинок.Согласован;
				ИначеЕсли ИмяКнопки = "Утвержден" Тогда
					Кнопки.Утверждение.Кнопки[ПрефиксИмя + ИмяКнопки].Картинка = БиблиотекаКартинок.Утвержден;
				ИначеЕсли ИмяКнопки = "Отклонен" Тогда
					Кнопки.Утверждение.Кнопки[ПрефиксИмя + ИмяКнопки].Картинка = БиблиотекаКартинок.Отклонен;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла; 
		
		// меняем заголовок кнопки подменю
		Если ЗначениеЗаполнено(СтатусДокумента) Тогда
			Если ДокументСсылка.Пустая() Тогда
				Кнопки.Утверждение.Текст = "Подготовлен";
				Кнопки.Утверждение.Картинка = БиблиотекаКартинок.Утверждение;
			Иначе	
				Кнопки.Утверждение.Текст = СокрЛП(СтатусДокумента);
				Если Кнопки.Утверждение.Текст = "Подготовлен" Тогда
					Картинка = БиблиотекаКартинок.Подготовлен;
				ИначеЕсли Кнопки.Утверждение.Текст = "Согласован" Тогда
					Картинка = БиблиотекаКартинок.Согласован;
				ИначеЕсли Кнопки.Утверждение.Текст = "Утвержден" Тогда
					Картинка = БиблиотекаКартинок.Утвержден;
				ИначеЕсли Кнопки.Утверждение.Текст = "Отклонен" Тогда
					Картинка = БиблиотекаКартинок.Отклонен;
				КонецЕсли;
				Кнопки.Утверждение.Картинка = Картинка;
			КонецЕсли; 
		Иначе
			Кнопки.Утверждение.Текст = "Утверждение";
		КонецЕсли; 
	КонецЕсли; 
	
	// в конце добавим кнопку История
	Кнопки.Утверждение.Кнопки.Добавить("кРазделитель",ТипКнопкиКоманднойПанели.Разделитель,,);
	Кнопки.Утверждение.Кнопки.Добавить(ПрефиксИмя + "История", ТипКнопкиКоманднойПанели.Действие,
	"История",Новый Действие("ДополнительныеДействияФормы"));
	
	//++бизтех++
	//Кнопки.Утверждение.Кнопки[ПрефиксИмя + "История"].Картинка = БиблиотекаКартинок.ИсторияДокументов; 
	Кнопки.Утверждение.Кнопки[ПрефиксИмя + "История"].Картинка = БиблиотекаКартинок.История;
	//--бизтех--
	
	Если Не ЭтоФормаСписка Тогда
		// доступность формы
		дкУстановитьДоступностьФормыПоУтверждению(ЭтаФорма, ИсторияУтверждения, СтатусДокумента);
		// автоустановка статуса Подготовлен
		Если ИспользоватьУтверждение Тогда
			ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента, ПраваПользователя);
			Если ПраваУтверждения <> Неопределено Тогда
				Если ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен] Тогда
					Если НЕ ЗначениеЗаполнено(СтатусДокумента) И НЕ ДокументСсылка.Проведен Тогда
						Кнопки.Утверждение.Картинка = БиблиотекаКартинок.Подготовлен;
						Кнопки.Утверждение.Текст = "Подготовлен";
						КнопкаПодготовлен = Кнопки.Утверждение.Кнопки.Найти("Подготовлен");
						Если КнопкаПодготовлен <> Неопределено Тогда
							Кнопки.Утверждение.Кнопки.Удалить(КнопкаПодготовлен);
						КонецЕсли; 
						
						Если Не ЭтаФорма.ДокументОбъект.ДополнительныеСвойства.Свойство("Подготовлен") Тогда
							ЭтаФорма.ДокументОбъект.ДополнительныеСвойства.Вставить("Подготовлен", Истина);
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	Иначе
		// установим доступность кнопок утверждения в списке документов
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден ИЛИ СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			Для Каждого КнопкаУтв Из Кнопки.Утверждение.Кнопки Цикл
				Если КнопкаУтв.ТипКнопки = ТипКнопкиКоманднойПанели.Действие И НЕ (КнопкаУтв.Текст = "История") Тогда
					КнопкаУтв.Доступность = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры // дкЗаполнитьСписокУтверждение()

// Выполняет блокировку доступности кнопок в подменю "Утверждение"
// если документ к которому они относятся находится в закрытом периоде
//
Процедура дкУстановитьДоступностьУтверждений(ЭтаФорма, Элемент, ИмяКоманднойПанели, ИмяСписка) Экспорт
	// Заблокируем утверждения в форме списка если документ находится в закрытом периоде
	Если Элемент.ТекущаяСтрока <> Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущаяСтрока.Ссылка) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда
			Возврат;
		КонецЕсли;
		Заблокировать = Ложь;
		ДокументОбъект = Элемент.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
		ДатаЗапретаРедактирования = КонецДня(орПолучитьДатуЗапретаРедактирования(ДокументОбъект));
		Если ТипЗнч(ДокументОбъект)=Тип("ДокументСсылка.ЗаказНаряд") ИЛИ ТипЗнч(ДокументОбъект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
			Если обЗначениеНеЗаполнено(ДокументОбъект.ДатаЗакрытия) Тогда
				ДокументОбъектДата=ДокументОбъект.Дата;
			Иначе
				ДокументОбъектДата=ДокументОбъект.ДатаЗакрытия;
			КонецЕсли; 
		Иначе
			ДокументОбъектДата=ДокументОбъект.Дата;
		КонецЕсли; 
		// Проверка на допустимость редактирования по датам запрета и разрешенного интервала редактирования
		Если (ДокументОбъектДата <= ДатаЗапретаРедактирования) Тогда
			Заблокировать = Истина;
		Иначе
			СтруктураИнтервалаЗапрета = орПолучитьИнтервалЗапретаРедактирования(ДокументОбъект);
			Если ((ДокументОбъектДата > СтруктураИнтервалаЗапрета.ВерхГраница) ИЛИ (ДокументОбъектДата < СтруктураИнтервалаЗапрета.НижнГраница)) Тогда
				Заблокировать = Истина;
			КонецЕсли;
		КонецЕсли;
		
		// установим имя командной панели
		Если Заблокировать Тогда
			ПодменюКнопки = ЭтаФорма.ЭлементыФормы[?(ИмяКоманднойПанели = Неопределено,"ОсновныеДействияФормы",ИмяКоманднойПанели)].Кнопки.Найти("Утверждение");
			Если НЕ ПодменюКнопки = Неопределено Тогда
				Для Каждого Кнопка Из ПодменюКнопки.Кнопки Цикл
					Если Кнопка.ТипКнопки = ТипКнопкиКоманднойПанели.Действие И НЕ (Кнопка.Текст = "История") Тогда
						Кнопка.Доступность = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Производит установку доступности формы в зависимости
// от права объекта, пользователя, статуса документа
//
// Параметры
// ЭтаФорма – Форма документа
// ИсторияУтверждения – Соответствие истории утверждения - Статус - Пользователь
// СтатусДокумента – ПеречислениеСсылка.СтатусыДокументов. Текущий статус документа
//
// Возвращаемое значение:
// Нет. 
//
Процедура дкУстановитьДоступностьФормыПоУтверждению(ЭтаФорма,ИсторияУтверждения,СтатусДокумента)
	
	ТекПрава = ЭтаФорма.ДокументОбъект.Права;
	ВидДокумента = ЭтаФорма.ДокументОбъект.Метаданные().Имя;
	ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента,ТекПрава);
	
	Если ПраваУтверждения <> Неопределено Тогда
		ПравоПодготовлен 	= ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		ПравоСогласован 	= ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован];
		ПравоУтвержден 		= ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден];
		ПравоОтклонен  		= ПраваУтверждения[Перечисления.СтатусыДокументов.Отклонен];
		
		АвторПодготовлен 	= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторСогласован 	= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторУтвержден 		= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторОтклонен  		= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
	КонецЕсли;
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	
	Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
		// просмотр открыт - тек.пользователь = автор подготовки
		//- есть право согласования
		Если НЕ (АвторПодготовлен = ТекПользователь ИЛИ ПравоСогласован) Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
			дкУстановитьДоступностьТолькоНаПроведение(ЭтаФорма,Истина);
		КонецЕсли; 
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
		// просмотр открыт - тек пользователь - автор согласования
		//- есть право утверждения или отклонения
		Если НЕ (АвторСогласован = ТекПользователь
			ИЛИ ПравоУтвержден ИЛИ ПравоОтклонен) Тогда
			ЭтаФорма.ТолькоПросмотр = Истина;
		Иначе
			ЭтаФорма.ТолькоПросмотр = Ложь;
			дкУстановитьДоступностьТолькоНаПроведение(ЭтаФорма,Истина);
		КонецЕсли; 
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
		//ЭтаФорма.ТолькоПросмотр = Истина;
		// даем право на проведении, если это происходит уже после утверждения
		дкУстановитьДоступностьТолькоНаПроведение(ЭтаФорма,Ложь); 
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
		// даем право на отмену проведения, если это происходит уже после отклонения
		дкУстановитьДоступностьТолькоНаПроведение(ЭтаФорма,Ложь);
	КонецЕсли; 
	
КонецПроцедуры //дкУстановитьДоступностьФормыПоУтверждению()

// Получает значение доступности формы в зависимости
// от права объекта, пользователя, статуса документа
//
// Параметры
// ПраваУтверждения – Значение права "Значения Утверждение" по виду документа
// ИсторияУтверждения – Соответствие истории утверждения - Статус - Пользователь
// СтатусДокумента – ПеречислениеСсылка.СтатусыДокументов. Текущий статус документа
//
// Возвращаемое значение:
// Булево - доступность (Истина - форма доступна, Ложь - не доступна) 
//
Функция дкПолучитьДоступностьФормыПоУтверждению(ПраваУтверждения,ИсторияУтверждения,СтатусДокумента) Экспорт
	
	Если ПраваУтверждения <> Неопределено Тогда
		ПравоПодготовлен 	= ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		ПравоСогласован 	= ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован];
		ПравоУтвержден 		= ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден];
		ПравоОтклонен  		= ПраваУтверждения[Перечисления.СтатусыДокументов.Отклонен];
		
		АвторПодготовлен 	= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторСогласован 	= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторУтвержден 		= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
		АвторОтклонен  		= ИсторияУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
	КонецЕсли;
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	
	Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
		// просмотр открыт - тек.пользователь = автор подготовки
		//- есть право согласования
		Если НЕ (АвторПодготовлен = ТекПользователь ИЛИ ПравоСогласован) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
		// просмотр открыт - тек пользователь - автор согласования
		//- есть право утверждения или отклонения
		Если НЕ (АвторСогласован = ТекПользователь
			ИЛИ ПравоУтвержден ИЛИ ПравоОтклонен) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
		Возврат Ложь;
		
	ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции //дкПолучитьДоступностьФормыПоУтверждению()

// Выполняет установку доступности элементов формы документа
// при утвержденном или неутвержденном документе
//
// Параметры:
// ЭтаФорма 	- Форма - Форма переданного документа
// ЕстьДоступ 	- Булево - Флаг доступности
//
Процедура дкУстановитьДоступностьТолькоНаПроведение(ЭтаФорма,ЕстьДоступ)
	//Для каждого ЭлементФормы Из ЭтаФорма.ЭлементыФормы Цикл
	//	Если ЭлементФормы.Имя = "ОсновныеДействияФормы" 
	//		ИЛИ ТипЗнч(ЭлементФормы) = Тип("Панель")
	//		ИЛИ ТипЗнч(ЭлементФормы) = Тип("Надпись") 
	//		Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	Попытка
	//		ЭлементФормы.ТолькоПросмотр = Не ЕстьДоступ;
	//	Исключение
	//		Попытка
	//			ЭлементФормы.Доступность = ЕстьДоступ;
	//		Исключение
	//		КонецПопытки; 
	//	КонецПопытки; 
	//КонецЦикла; 
	ЭтаФорма.ТолькоПросмотр=НЕ ЕстьДоступ;
КонецПроцедуры

// Нажатие кнопки "Свойства" в верхней панели.
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// Кнопка 		 - кнопка командной панели, действие "Свойства"
// ИмяФормыСписка - строка, имя формы списка документов
//
Процедура дкДействияФормыСвойства(ЭтаФорма, Кнопка, ИмяФормыСписка = "Список") Экспорт
	
	Если ТипЗнч(Кнопка)=Тип("Структура") Тогда
		Кнопка =  Кнопка.Кнопка;
	КонецЕсли;
	
	// Сначала попробуем для формы списка, в противном случае - это форма объекта
	Список = ЭтаФорма.ЭлементыФормы.Найти(ИмяФормыСписка);
	Если Список = Неопределено Тогда
		Попытка
			//если форму открываем из формы объекта то и передаем в нее объект
			ТекОбъект = дкПолучитьТекущийОбъект(ЭтаФорма.ЭтотОбъект);
			ОткрытаИзФормыСписка = ЛОЖЬ;
		Исключение
			Возврат;
		КонецПопытки;
	Иначе
		ТекущиеДанныеСписка = Список.ТекущиеДанные;
		Если ТекущиеДанныеСписка = Неопределено Тогда
			Возврат;
		Иначе
			ТекОбъект = ТекущиеДанныеСписка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		ОткрытаИзФормыСписка = ИСТИНА;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ТекОбъект.Ссылка) Тогда
		Предупреждение("Элемент должен быть записан !");
		Возврат;
	КонецЕсли;
	// проверка на редактирование справочника
	Отказ = Ложь;
	
	// Проверка на допустимость редактирования	
	Результат = НЕОПРЕДЕЛЕНО;
	
	Если обПраво("ПроверкаДоступаКСправочникамИДокументам", ТекОбъект.Права,,ТекОбъект) Тогда	
		Результат = обПраво("Право доступа " + ТекОбъект.Метаданные().Имя, ТекОбъект.Права);
	КонецЕсли;
	
	Если Результат = Перечисления.ВидыПравДляДокументов.НетДоступа Тогда
		Сообщить("Нет доступа к форме свойств объекта - " + ТекОбъект.Метаданные().Представление() + ": " + СокрЛП(ТекОбъект) + " запрет доступа", СтатусСообщения.Важное); 
		Возврат;
	КонецЕсли;
	//открываем панель свойств	
	Показывать = НЕ Кнопка.Пометка;
	ОбработкаПанельСвойств = Обработки.ПанельСвойствОбъекта.Создать();
	ОбработкаПанельСвойств.ОткрытьПанельСвойств(ТекОбъект, ЭтаФорма, Показывать, Кнопка, ОткрытаИзФормыСписка);
КонецПроцедуры // дкДействияФормыСвойства()

// Создание напоминания из формы документа
//
// Параметры:
// ЭтаФорма - форма, форма документа
// Ссылка - ДокументСсылка, объект, добавляемый в напоминание
//
Процедура дкДействияФормыСоздатьНапоминание(ЭтаФорма, Ссылка, ДопПараметры = Неопределено) Экспорт
	опСоздатьОповещение(Ссылка.Ссылка,ДопПараметры,ЭтаФорма);
КонецПроцедуры// спДействиеФормыСоздатьНапоминание()

// Нажатие кнопки "Цена и валюта"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Кнопка - кнопка командной панели, пункта меню
//
Процедура дкДействияФормыЦеныИВалюта(ЭтаФорма,Кнопка, ВидЦен = 0) Экспорт
	// получим общую форму для ввода цен и валюты и пр. параметров с этим связанных
	ВидЦен = ?(ВидЦен = Неопределено, 0, ВидЦен);
	ФормаЦеныИВалюта = ПолучитьОбщуюФорму("ЦеныИВалюта",ЭтаФорма);
	ФормаЦеныИВалюта.ВидЦен = ВидЦен;
	ФормаЦеныИВалюта.ОткрытьМодально();
КонецПроцедуры // дкДействияФормыЦеныИВалюта()

// Обработчик всех пунктов подменю "Заполнение" панели "КоманднаяПанельАктивы"
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// 	 Таблица - ТаблицаЗначений. Данные меняемого табл. поля.
//	 Кнопка - Нажатый элемент подменю
//
// Возвращаемое значение:
// Булево - Истина, если обработка прошла успешно, Ложь - Иначе, "ИмяОбработчика" - если обработчик не найден.
//	
Функция дкКоманднаяПанельАктивыЗаполнение(ЭтаФорма, Таблица, Кнопка) Экспорт
	ИмяПодменю = Кнопка.Имя;
	Если ИмяПодменю = "ЗаполнитьАктивамиПодразделения" Тогда
		// надо заполнить таблицу активами подразделения
		Попытка
			ВыбПодразделение = ЭтаФорма.ПодразделениеКомпании;
		Исключение
			ВыбПодразделение = Неопределено;
		КонецПопытки;
		Попытка
			ВыбМОЛ = ЭтаФорма.МОЛОтбор;
		Исключение
			ВыбМОЛ = Неопределено;
		КонецПопытки;
		Если обЗначениеНеЗаполнено(ВыбПодразделение) Тогда
			Предупреждение("Не выбрано подразделение компании !", 10);
			Возврат ИмяПодменю;
		КонецЕсли;
		
		// спросим
		Если Таблица.Количество() > 0 Тогда
			Если Вопрос("Перед заполнением таблица будет очищена
				|Продолжить ?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет) <> КодВозвратаДиалога.Да Тогда
				Возврат ИмяПодменю;
			Иначе
				Таблица.Очистить();
			КонецЕсли;
		КонецЕсли;
		// запрос по активам
		МоментВремени = ?(обЗначениеНеЗаполнено(ЭтаФорма.Ссылка), Новый МоментВремени(КонецДня(ЭтаФорма.Дата)), ЭтаФорма.МоментВремени());
		//на случай, если документ уже проведен,правим момент расчета
		МоментВремени = ?(ЭтаФорма.ДокументОбъект.Проведен, Новый Граница(ЭтаФорма.Ссылка.МоментВремени(), ВидГраницы.Исключая), МоментВремени);
		Если ЭтаФорма.ДокументОбъект.Метаданные().Имя = "Амортизация" Тогда
			ТаблАктивы = дкПолучитьОстаткиАктивовНеАмортизированных(МоментВремени, ВыбПодразделение);
		Иначе
			ТаблАктивы = дкПолучитьОстаткиАктивов(ВыбПодразделение, ВыбМОЛ, , МоментВремени);
		КонецЕсли;
		Возврат ТаблАктивы;     		
	Иначе
		Возврат дкКоманднаяПанельТоварыЗаполнение(ЭтаФорма,Таблица,Кнопка);  		
	КонецЕсли;
КонецФункции // дкКоманднаяПанельАктивыЗаполнение()

// Обработчик всех пунктов подменю "Заполнение" панели "КоманднаяПанельТовары"
// Параметры:
//		ЭтаФорма	 	- Форма. Форма, в которой выбран вариант заполнения 
// 		Таблица 		- ТаблицаЗначений. Данные меняемого табл. поля.
//		Кнопка	 		- Нажатый элемент подменю
//  ИмяРегистра 	- строка. Имя регистра, по которому будем делать запросы. Если не указано
//
// Возвращает:
//		Истина			- если обработка прошла успешно
//		Неопределено	- если не было выполнено никаких действий 
//		ТаблицаЗначений	- результат запроса. для добавления строк в табличную часть.
//		ИмяОбработчика	- если обработчик не найден.
//
Функция дкКоманднаяПанельТоварыЗаполнение(ЭтаФорма,Таблица,Кнопка, ИмяРегистра = "") Экспорт
	Возврат зфКоманднаяПанельТоварыЗаполнение(ЭтаФорма,Таблица,Кнопка, ИмяРегистра)
КонецФункции

// Нажатие на кнопку "Подбор"
//
// Параметры:
// ЭтаФорма - форма, форма переданого документа
// СтруктураПараметровПодбора - Структура. Параметры подбора, можно сюда передавать
// 							 все необходимые данные на основании которых инициализируется форма подбора.
//
Процедура дкКоманднаяПанельТоварыПодбор(ЭтаФорма,СтруктураПараметровПодбора) Экспорт
	Перем ПодборПоПрайсЛисту; // Имя обработки подбора по прайс-листу
	
	Если НЕ СтруктураПараметровПодбора.Свойство("ЭтаФорма") Тогда
		СтруктураПараметровПодбора.Вставить("ЭтаФорма",ЭтаФорма);
	КонецЕсли;
	
	СтруктураПараметровПодбора.Свойство("ПодборПоПрайсЛисту", ПодборПоПрайсЛисту);
	ПодборПоПрайсЛисту = ?(обЗначениеНеЗаполнено(ПодборПоПрайсЛисту), ЛОЖЬ, ПодборПоПрайсЛисту);
	
	Если обПраво("ИспользованиеФормыПодбора",ЭтаФорма.Права,,ЭтаФорма) Тогда
		ИмяОбработки = ?(ПодборПоПрайсЛисту, "ПодборНоменклатурыПоПрайсЛисту", "ПодборНоменклатуры");
		ФормаПодбора = Обработки[ИмяОбработки].ПолучитьФорму("Форма",ЭтаФорма);
	Иначе
		СтруктураПараметровПодбора.Вставить("ИмяТабличногоПоляИсточника", "Список");
		ИмяСправочника = ?(ПодборПоПрайсЛисту, "ПрайсЛист", "Номенклатура");
		ФормаПодбора = Справочники[ИмяСправочника].ПолучитьФормуВыбора("ФормаСписка",ЭтаФорма);
	КонецЕсли; 
	
	ФормаПодбора.СтруктураПараметровФормы	 = СтруктураПараметровПодбора;
	ФормаПодбора.РежимВыбора				 = ИСТИНА;
	ФормаПодбора.ЗакрыватьПриВыборе			 = ЛОЖЬ;
	ФормаПодбора.Открыть();
КонецПроцедуры // дкКоманднаяПанельТоварыПодбор()

// Печать реестра документов
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Список - список документов на форме
//
Процедура дкОсновныеДействияФормыРеестр(ЭтаФорма, Список) Экспорт
	
	Попытка
		ПраваПользователя = ЭтаФорма.Права;
	Исключение
		ПраваПользователя = Неопределено;
	КонецПопытки; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Символы.ПС;
	ТекстКолонок = "";
	ВыбратьВалюту = Ложь;
	НомерСтроки = 1;
	СписокПоказателейВВалютеРеестра = Новый СписокЗначений;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Список.Значение);
	
	Результат = Построитель.Результат;
	Результат = Результат.Выгрузить();
	
	МассивСсылок = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивСсылок.Добавить(Строка.Ссылка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	ИсточникДанных = Строка(Список.Значение);
	РеквизитыОбъектаЕстьКурс = Ложь;
	ЭтоЖурнал = Найти(Строка(ИсточникДанных), "Журнал") > 0;
	Если ЭтоЖурнал Тогда
		ИсточникДанных = СтрЗаменить(ИсточникДанных, "ЖурналДокументовСписок.", "ЖурналДокументов.");
		РеквизитыОбъектаЕстьКурс = Метаданные.ЖурналыДокументов[Сред(ИсточникДанных, 18)].Графы.Найти("Курс") <> Неопределено;
	Иначе
		ИсточникДанных = СтрЗаменить(ИсточникДанных, "ДокументСписок.", "Документ.");
		РеквизитыОбъектаЕстьКурс = Метаданные.Документы[Сред(ИсточникДанных, 10)].Реквизиты.Найти("КурсДокумента") <> Неопределено;
		Если Найти(Сред(ИсточникДанных, 10),"Бюджет") > 0 Тогда
			РеквизитыОбъектаЕстьКурс = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//выводимые в запрос поля - это отображаемые колонки
	Для каждого Колонка Из Список.Колонки Цикл
		Если Колонка.Видимость И (Колонка.ЭлементУправления <> Неопределено ИЛИ ЭтоЖурнал) И НЕ ПустаяСтрока(Колонка.Данные) Тогда
			
			Если ТекстКолонок <> "" Тогда
				ТекстКолонок = ТекстКолонок + "," + Символы.ПС;
			КонецЕсли;
			//поле ВидДокумента заменяем на Операция
			Если ЭтоЖурнал И Колонка.Данные = "ВидДокумента" Тогда
				ТекстКолонок = ТекстКолонок + " СписокДокументов.Операция КАК " + СтрЗаменить(Колонка.Имя," ","_");	
			Иначе
				ТекстКолонок = ТекстКолонок + " СписокДокументов." + Колонка.Данные + " КАК " + СтрЗаменить(Колонка.Имя," ","_");
			КонецЕсли;
			Если РеквизитыОбъектаЕстьКурс И Найти(ВРег(Колонка.Данные), "СУММА") Тогда
				ТекстКолонок = ТекстКолонок + " //" + НомерСтроки;
				СписокПоказателейВВалютеРеестра.Добавить("//" + НомерСтроки,",
					|	ВЫБОР 
					|		КОГДА &ВалютаРеестра = СписокДокументов." + ?(ЭтоЖурнал,"Валюта", "ВалютаДокумента") + "
					|			ТОГДА СписокДокументов." + Колонка.Данные + "
					|	ИНАЧЕ
					|		СписокДокументов." + ?(ЭтоЖурнал, "Курс", "КурсДокумента") + " * СписокДокументов." + Колонка.Данные + "/&ВыбраннаяВалютаРеестра
					|	КОНЕЦ КАК " + Колонка.Имя + "ВВалютеРеестра");
				ВыбратьВалюту = Истина;
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ТекстКолонок <> "" Тогда
		ТекстКолонок = ТекстКолонок + "," + Символы.ПС;
	КонецЕсли; 
	ТекстКолонок = ТекстКолонок + "	ВЫБОР КОГДА СписокДокументов.Проведен = ИСТИНА ТОГДА 1 
	|	КОГДА СписокДокументов.ПометкаУдаления = ИСТИНА ТОГДА 2
	|	ИНАЧЕ 3 КОНЕЦ КАК Картинка";
	
	Если ВыбратьВалюту Тогда
		Если обПраво("ЗапросВалютыПечатногоДокумента",,,ЭтаФорма) Тогда
			ФормаВыбораВалюты = Справочники.Валюты.ПолучитьФормуВыбора(,ЭтаФорма);
			Попытка
				ТекСтрока=Список.ТекущаяСтрока;
				Если ТекСтрока<>Неопределено Тогда
					ФормаВыбораВалюты.НачальноеЗначениеВыбора=ТекСтрока.ВалютаДокумента;
				КонецЕсли; 
			Исключение
			КонецПопытки; 
			ФормаВыбораВалюты.Заголовок = "Выбор валюты для печати реестра";
			ВыбВалютаРеестра = ФормаВыбораВалюты.ОткрытьМодально();
		Иначе
			ВыбВалютаРеестра = Неопределено;
		КонецЕсли; 
		Если обЗначениеНеЗаполнено(ВыбВалютаРеестра) Тогда
			ВыбратьВалюту = Ложь;
			Для Каждого ТекПоказатель Из СписокПоказателейВВалютеРеестра Цикл
				ТекстКолонок = СтрЗаменить(ТекстКолонок, ТекПоказатель.Значение, "");
			КонецЦикла;
		Иначе
			//ТекстКолонок = ТекстКолонок + ТекстКолонокСуммВВалютеРеестра;
			Для Каждого ТекПоказатель Из СписокПоказателейВВалютеРеестра Цикл
				ТекстКолонок = СтрЗаменить(ТекстКолонок, ТекПоказатель.Значение, ТекПоказатель.Представление);
			КонецЦикла;
			СтруктураКурсаВалютыРеестра = обКурсДляВалюты(ВыбВалютаРеестра, ТекущаяДата());
			КурсВалютыРеестра = СтруктураКурсаВалютыРеестра.Курс/?(СтруктураКурсаВалютыРеестра.Кратность = 0,1,СтруктураКурсаВалютыРеестра.Кратность);
		КонецЕсли;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + ТекстКолонок + Символы.ПС + "ИЗ" + Символы.ПС + " " + ИсточникДанных 
					+ " КАК СписокДокументов" + Символы.ПС + "ГДЕ СписокДокументов.Ссылка В (&МассивСсылок)" + Символы.ПС;
	
	ЕстьОтборы = Ложь;
	Для Каждого ЭлементОтбора Из Список.Значение.Отбор Цикл
		Если ЭлементОтбора.Использование И Не ЭлементОтбора.Имя = "Периодичность" Тогда
			ЕстьОтборы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекстОтборов = "";
	Если ЕстьОтборы Тогда
		// Текст отборов
		Для Каждого ТекОтбор Из Список.Значение.Отбор Цикл
			Если ТекОтбор.Использование И Не ТекОтбор.Имя = "Периодичность" Тогда
				Если Найти(ТекОтбор.ВидСравнения,"Интервал") > 0 Тогда
					ТекстОтборов = ТекстОтборов + ?(ТекстОтборов = "", "", ", ") + ТекОтбор.Представление + " " + ТекОтбор.ВидСравнения + " " + ТекОтбор.ЗначениеС + " - " + ТекОтбор.ЗначениеПо;
				Иначе
					ТекстОтборов = ТекстОтборов + ?(ТекстОтборов = "", "", ", ") + ТекОтбор.Представление + " " + ТекОтбор.ВидСравнения + " " + ТекОтбор.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТекстОтборов = ?(ТекстОтборов = "", "Все", ТекстОтборов);
	Иначе
		ТекстОтборов = "Без отбора";
	КонецЕсли;
	
	//Выбранная валюта реестра   
	Если ВыбратьВалюту Тогда
		Запрос.УстановитьПараметр("ВыбраннаяВалютаРеестра", ?(КурсВалютыРеестра = 0, 1, КурсВалютыРеестра));
		Запрос.УстановитьПараметр("ВалютаРеестра", ВыбВалютаРеестра);   
	КонецЕсли;
	
	//упорядочим документы по дате
	Запрос.Текст = Запрос.Текст + "УПОРЯДОЧИТЬ ПО" + Символы.ПС + " СписокДокументов.Дата";
	Результат = Запрос.Выполнить().Выгрузить();
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы", ПраваПользователя,,ЭтаФорма);
	
	ПараметрыРеестра = Новый Структура();
	//заголовок
	ПараметрыРеестра.Вставить("ЗаголовокРеестра", "Реестр документов - " + ЭтаФорма.Заголовок);
	//Период
	ПараметрыРеестра.Вставить("ДатаНачала", Список.СтандартныйПериод.ДатаНачала);
	ПараметрыРеестра.Вставить("ДатаОкончания", Список.СтандартныйПериод.ДатаОкончания);
	//Отбор
	ПараметрыРеестра.Вставить("Отборы", ТекстОтборов);
	
	Если ВыбратьВалюту Тогда
		ПараметрыРеестра.Вставить("ВалютаРеестра", ВыбВалютаРеестра.Наименование);
	КонецЕсли;
	
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Имя");
	ТаблицаКолонок.Колонки.Добавить("Представление");
	ТаблицаКолонок.Колонки.Добавить("Формат");
	ТаблицаКолонок.Колонки.Добавить("ЭтоПоказатель");
	
	СтруктураИтоговыхКолонок = Новый Структура;
	СтруктураКартинок = Неопределено;
	Для каждого Колонка Из Список.Колонки Цикл
		
		Если Колонка.Имя = "Картинка" Тогда 			
			НоваяСтрока = ТаблицаКолонок.Добавить();
			НоваяСтрока.Имя = Колонка.Имя;
			НоваяСтрока.Представление = Колонка.ТекстШапки;
			НоваяСтрока.Формат = "";
			НоваяСтрока.ЭтоПоказатель = Ложь;
			
			СтруктураКартинок = Новый Соответствие();
			СтруктураКартинок.Вставить(1, БиблиотекаКартинок.ДокументПроведен);
			СтруктураКартинок.Вставить(2, БиблиотекаКартинок.ДокументПомеченНаУдаление);
			СтруктураКартинок.Вставить(3, БиблиотекаКартинок.ДокументНеПроведен);
		ИначеЕсли Колонка.Видимость И (Колонка.ЭлементУправления <> Неопределено ИЛИ ЭтоЖурнал) И НЕ ПустаяСтрока(Колонка.Данные) Тогда
			
			НоваяСтрока = ТаблицаКолонок.Добавить();
			НоваяСтрока.Имя = Колонка.Имя;
			НоваяСтрока.Представление = Колонка.ТекстШапки;
			
			ФорматСтр = Колонка.Формат;
			Попытка
				Если ФорматСтр = "" Тогда // можно взять формат из элемента управления
					ФорматСтр = Колонка.ЭлементУправления.Формат;
				КонецЕсли; 
			Исключение
			КонецПопытки;
			
			ТипЗначенияКолонки = Результат.Колонки.Найти(Колонка.Имя).ТипЗначения;
			
			//Если для числа не задан спец. формат, поставим вывод нуля 
			Если ТипЗначенияКолонки.СодержитТип(Тип("Число")) и ФорматСтр = "" Тогда
				ФорматСтр = "ЧН = "; 
			КонецЕсли;
			// Для даты (реквизита) проверим формат квалификатора и установим принудительно такой-же
			Если ТипЗначенияКолонки.СодержитТип(Тип("Дата")) и ФорматСтр = "" Тогда
				Квалиф = ТипЗначенияКолонки.КвалификаторыДаты.ЧастиДаты;
				Если Квалиф = ЧастиДаты.Дата Тогда
					ФорматСтр = "ДФ = dd.MM.yyyy; ДП = -"; 
				ИначеЕсли Квалиф = ЧастиДаты.Время Тогда
					ФорматСтр = "ДЛФ = T"; 
				КонецЕсли; 
			КонецЕсли;
			
			НоваяСтрока.Формат = ФорматСтр;
			НоваяСтрока.ЭтоПоказатель = ТипЗначенияКолонки.СодержитТип(Тип("Число"));
			
			Если ВыбратьВалюту И Найти(ВРег(Колонка.Данные), "ВАЛЮТА") Тогда
				НоваяСтрока = ТаблицаКолонок.Добавить();
				Для каждого ЕщеКолонка Из Список.Колонки  Цикл
					НайденаСумма = Найти(ВРег(ЕщеКолонка.Данные), "СУММА");
					Если НайденаСумма Тогда    
						Прервать;       
					КонецЕсли; 
				КонецЦикла;
				Если ВыбратьВалюту И НайденаСумма Тогда    
					НоваяСтрока.Имя = ЕщеКолонка.Имя + "ВВалютеРеестра";
					НоваяСтрока.Представление = ЕщеКолонка.ТекстШапки + " (" + ВыбВалютаРеестра.Наименование + ")";
					НоваяСтрока.Формат = ФорматВыводаСуммы;
					НоваяСтрока.ЭтоПоказатель = Истина;
					СтруктураИтоговыхКолонок.Вставить(ЕщеКолонка.Имя + "ВВалютеРеестра"); 	       
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТабДокумент = дкСформироватьРеестр(ПараметрыРеестра, Результат, ТаблицаКолонок, СтруктураИтоговыхКолонок, СтруктураКартинок);
	
	//получение представления заголовка печатной формы
	Представление = Метаданные.НайтиПоПолномуИмени(ИсточникДанных);
	Если Представление <> Неопределено Тогда
		Представление = Представление.Синоним;
	Иначе //а что может быть ещё?
		Представление = "";
	КонецЕсли;
	
	//получим форму вывода
	КлючУникальности = Строка(ТекущаяДата()); //уникальность открытых форм будем определять по тек. времени ...
	ПечатнаяФорма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов", , КлючУникальности);
	Пока ПечатнаяФорма.Открыта() Цикл
		КлючУникальности = КлючУникальности + "0"; //... а если в одну секунду открыли, степень уникальности повысим
		ПечатнаяФорма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов", , КлючУникальности);
	КонецЦикла;
	
	//зададим параметры макета	
	ПечатнаяФорма.Объект = Неопределено;
	ПечатнаяФорма.ОбъектПредставление = Представление;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ОтображатьЗаголовки 	= Ложь;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ОтображатьСетку		= Ложь;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.Защита				= обПраво("ЗащитаПечатныхФорм", ПраваПользователя,,ЭтаФорма);
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ТолькоПросмотр		= обПраво("ОткрытиеПечатныхФормДокументовВРежимеПросмотра", ПраваПользователя,,ЭтаФорма);
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ПолеСлева 			= 9;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ПолеСправа 			= 6;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
	ПечатнаяФорма.ЭлементыФормы.ТабличныйДокумент.Вывести(ТабДокумент);
	//покажем
	ПечатнаяФорма.Открыть();
	
КонецПроцедуры // дкОсновныеДействияФормыРеестр()

// печать реестра документов
//
// Параметры:
//
//	ПараметрыРеестра		 - Структура		- Параметры реестра
//	ИсточникДанных   - ТаблицаЗначений - Источник данных
//	ТаблицаКолонок			 - ТаблицаЗначений - Таблица колонок
//	СтруктураИтоговыхКолонок - Структура  - Структура итоговых колонок
//	СтруктураКартинок		 - Структура  - Структура картинок
//
// Возвращаемое значение:
//	ТабличныйДокумент	- Печатная форма реестра
//
Функция дкСформироватьРеестр(ПараметрыРеестра, ИсточникДанных, ТаблицаКолонок, СтруктураИтоговыхКолонок, СтруктураКартинок = Неопределено) Экспорт
	
	ВыбратьВалюту = СтруктураИтоговыхКолонок.Количество() > 0;
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет   = ПолучитьОбщийМакет("РеестрДокументов");
	//Формат вывода сумм
	Если ВыбратьВалюту Тогда
		ВыбВалютаРеестра = ПараметрыРеестра.ВалютаРеестра;
	КонецЕсли;
	//Заголовок
	ТекстЗаголовка = "Реестр";
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	Если ПараметрыРеестра.Свойство("ЗаголовокРеестра") Тогда
		ТекстЗаголовка = ПараметрыРеестра.ЗаголовокРеестра;
	КонецЕсли;
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ТабДокумент.Вывести(ОбластьМакета);
	//Период
	ДатаНачала	 = "";
	ДатаОкончания = "";
	Если ПараметрыРеестра.Свойство("ДатаНачала") Тогда
		ДатаНачала = ПараметрыРеестра.ДатаНачала;
	КонецЕсли;
	Если ПараметрыРеестра.Свойство("ДатаОкончания") Тогда
		ДатаОкончания = ПараметрыРеестра.ДатаОкончания;
	КонецЕсли;
	
	СтрПериод = "Период: ";
	Если обЗначениеНеЗаполнено(ДатаНачала) И обЗначениеНеЗаполнено(ДатаОкончания) Тогда
		СтрПериод = СтрПериод + "весь период";
	ИначеЕсли обЗначениеНеЗаполнено(ДатаНачала) Тогда	
		///		СтрПериод = СтрПериод + "С начала по " + Формат(ДатаОкончания, "ДФ = dd.MM.yyyy");
		СтрПериод = СтрПериод + "по " + Формат(ДатаОкончания, "ДФ = dd.MM.yyyy");
	ИначеЕсли обЗначениеНеЗаполнено(ДатаОкончания) Тогда	
		СтрПериод = СтрПериод + "с " + Формат(ДатаНачала, "ДФ = dd.MM.yyyy");
	Иначе
		СтрПериод = СтрПериод + "с " + Формат(ДатаНачала, "ДФ = dd.MM.yyyy") + " по " + Формат(ДатаОкончания, "ДФ = dd.MM.yyyy");
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Период");
	ОбластьМакета.Параметры.Период = СтрПериод;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ПараметрыРеестра.Свойство("Отборы") Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Отборы");
		ОбластьМакета.Параметры.Отборы = "Отбор: " + ПараметрыРеестра.Отборы;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	Если ТаблицаКолонок.Количество() = 0 Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	МакетОбластей = Новый ТабличныйДокумент;
	МакетОбластей.Область("R1:R1").Имя = "Строка";
	МакетОбластей.Область("R2:R2").ВысотаСтроки = 12;
	МакетОбластей.Область("R2:R3").Имя = "ШапкаТаблицы";
	МакетОбластей.Область("R4:R4").Имя = "ИтогПоСтранице";
	МакетОбластей.Область("R5:R5").Имя = "Подвал";
	
	СтруктураОбластейСтроки = Неопределено;
	ЕстьКартинки = ТипЗнч(СтруктураКартинок) = Тип("Соответствие");
	Если ЕстьКартинки Тогда
		НомерОбласти = 6;
		СтруктураОбластейСтроки = Новый Соответствие();
		Для Каждого ТекКартинка Из СтруктураКартинок Цикл
			МакетОбластей.Область("R" + НомерОбласти + ":R" + НомерОбласти).Имя = "Строка" + НомерОбласти;
			СтруктураОбластейСтроки.Вставить(ТекКартинка.Ключ, МакетОбластей.ПолучитьОбласть("Строка" + НомерОбласти));
			НомерОбласти = НомерОбласти + 1;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьСтроки 					 = МакетОбластей.ПолучитьОбласть("Строка");
	ОбластьШапкаТаблицы 			 = МакетОбластей.ПолучитьОбласть("ШапкаТаблицы");
	Если ВыбратьВалюту Тогда
		ОбластьМакетаИтогоПоСтранице = МакетОбластей.ПолучитьОбласть("ИтогПоСтранице");
		ОбластьПодвал				 = МакетОбластей.ПолучитьОбласть("Подвал");
	Иначе
		ОбластьМакетаИтогоПоСтранице = Неопределено;
		ОбластьПодвал				 = Неопределено;
	КонецЕсли;
	
	МакетОформленияТекстаЗаголовка 	 = Макет.ПолучитьОбласть("ШапкаТаблицы|Колонка").Область(1,1,1,1);
	МакетОформленияШапки 			 = Макет.ПолучитьОбласть("ШапкаТаблицы|Колонка").Область(2,1,2,1);
	МакетОформленияСтроки			 = Макет.ПолучитьОбласть("Строка|Колонка").Область(1,1,1,1);
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	ТекОбласть = ОбластьШапкаТаблицы.Область(1,2,1,2);
	ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	ТекОбласть.Параметр = "ТекстЗаголовка";
	ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево; 
	ТекОбласть.Шрифт = МакетОформленияТекстаЗаголовка.Шрифт;
	
	ТекОбласть = ОбластьШапкаТаблицы.Область(2,2,2,2);
	ТекОбласть.Текст = "№";
	ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр; 
	ТекОбласть.ГраницаСверху = Линия;
	ТекОбласть.ГраницаСлева  = Линия;
	ТекОбласть.ГраницаСнизу  = Линия;
	ТекОбласть.ГраницаСправа = Линия;
	ТекОбласть.Шрифт = МакетОформленияШапки.Шрифт;
	
	ТекОбласть = ОбластьСтроки.Область(1,2,1,2);
	ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	ТекОбласть.Параметр = "НомерСтроки";
	ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр; 
	ТекОбласть.ГраницаСверху = Линия;
	ТекОбласть.ГраницаСлева  = Линия;
	ТекОбласть.ГраницаСнизу  = Линия;
	ТекОбласть.ГраницаСправа = Линия;
	ТекОбласть.Шрифт = МакетОформленияСтроки.Шрифт;
	
	Если ЕстьКартинки Тогда
		Для Каждого ТекущаяОбласть Из СтруктураОбластейСтроки Цикл
			ТекОбласть = ТекущаяОбласть.Значение.Область(1,2,1,2);
			ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ТекОбласть.Параметр = "НомерСтроки";
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр; 
			ТекОбласть.ГраницаСверху = Линия;
			ТекОбласть.ГраницаСлева  = Линия;
			ТекОбласть.ГраницаСнизу  = Линия;
			ТекОбласть.ГраницаСправа = Линия;
			ТекОбласть.Шрифт = МакетОформленияСтроки.Шрифт;
		КонецЦикла;
	КонецЕсли;
	
	Если ВыбратьВалюту Тогда
		ТекОбласть = ОбластьМакетаИтогоПоСтранице.Область(1,2,1,2);
		ТекОбласть.ГраницаСверху = Линия;
		ТекОбласть.ГраницаСлева = Линия;
		ТекОбласть.ГраницаСнизу = Линия;
		ТекОбласть.Шрифт = Новый Шрифт(МакетОформленияШапки.Шрифт,,,Ложь);
		
		ТекОбласть = ОбластьПодвал.Область(1,2,1,2);
		ТекОбласть.ГраницаСверху 	= Линия;
		ТекОбласть.ГраницаСлева 	= Линия;
		ТекОбласть.ГраницаСнизу 	= Линия;
		ТекОбласть.Шрифт = МакетОформленияШапки.Шрифт;
	КонецЕсли;
	
	ПозицияКолонки = 3;
	ЧислоИтоговыхКолонок = 0;
	СписокШириныКолонок 		= Новый Структура;
	СписокОбщейШириныКолонок 	= Новый Структура;
	СтруктураИтоговПоСтранице 	= Новый Структура;
	СтруктураИтоговПодвала 		= Новый Структура;
	
	ПозицияКолонкиВыводаИтогаПоСтранице = 0;
	ШиринаКолонкиВыводаИтогаПоСтранице  = 0;
	
	Для Каждого Колонка Из ТаблицаКолонок Цикл
		
		ТекОбласть = ОбластьШапкаТаблицы.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
		ТекОбласть.Шрифт = МакетОформленияТекстаЗаголовка.Шрифт;
		
		ТекОбласть = ОбластьШапкаТаблицы.Область(2, ПозицияКолонки, 2, ПозицияКолонки);
		ТекОбласть.Текст = Колонка.Представление;
		ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр; 
		ТекОбласть.ГраницаСверху = Линия;
		ТекОбласть.ГраницаСлева  = Линия;
		ТекОбласть.ГраницаСнизу  = Линия;
		ТекОбласть.ГраницаСправа = Линия;
		ТекОбласть.Шрифт = МакетОформленияШапки.Шрифт;
		
		ТекОбласть = ОбластьСтроки.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
		ТекОбласть.Заполнение	 = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
		ТекОбласть.Параметр		 = Колонка.Имя;
		ТекОбласть.Формат 		 = Колонка.Формат;
		Если Колонка.ЭтоПоказатель Тогда
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право; 
		Иначе
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево; 
			ТекОбласть.ПараметрРасшифровки = Колонка.Имя;
		КонецЕсли; 
		ТекОбласть.ГраницаСверху = Линия;
		ТекОбласть.ГраницаСправа = Линия;
		ТекОбласть.ГраницаСнизу  = Линия;
		ТекОбласть.Шрифт 		 = МакетОформленияСтроки.Шрифт;
		
		Если ЕстьКартинки Тогда
			Для Каждого ТекКартинка Из СтруктураКартинок Цикл
				ОбластьСтрокиКартинки = СтруктураОбластейСтроки[ТекКартинка.Ключ];
				ТекОбласть = ОбластьСтрокиКартинки.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
				ТекОбласть.Заполнение	 = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
				ТекОбласть.Параметр		 = Колонка.Имя;
				ТекОбласть.Формат 		 = Колонка.Формат;
				Если Колонка.ЭтоПоказатель Тогда
					ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право; 
				Иначе
					ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево; 
					ТекОбласть.ПараметрРасшифровки = Колонка.Имя;
				КонецЕсли;
				ТекОбласть.ГраницаСверху = Линия;
				ТекОбласть.ГраницаСправа = Линия;
				ТекОбласть.ГраницаСнизу  = Линия;
				ТекОбласть.Шрифт 		 = МакетОформленияСтроки.Шрифт;
				Если Колонка.Имя = "Картинка" Тогда
					ОбластьСтрокиКартинки = СтруктураОбластейСтроки[ТекКартинка.Ключ];
					ДобавленнаяКартинка = ОбластьСтрокиКартинки.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
					ДобавленнаяКартинка.Картинка = ТекКартинка.Значение;
					ДобавленнаяКартинка.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
					ДобавленнаяКартинка.Расположить(ТекОбласть);
					ДобавленнаяКартинка.Имя = "Пиктограмма";
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СписокШириныКолонок.Вставить(Колонка.Имя, Новый Структура("Позиция, Длинна, Формат, ЭтоПоказатель", ПозицияКолонки, (СтрДлина(Колонка.Представление)*1.4), Колонка.Формат, Колонка.ЭтоПоказатель)); // сначала ширина самого заголовка
		СписокОбщейШириныКолонок.Вставить(Колонка.Имя, Новый Структура("Ширина, ЧислоСтрок", 0, 0)); 
		
		Если ВыбратьВалюту Тогда
			ТекОбластьИтогаПоСтранице = ОбластьМакетаИтогоПоСтранице.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
			ТекОбластьИтогаПоСтранице.ГраницаСверху = Линия;
			ТекОбластьИтогаПоСтранице.ГраницаСнизу 	= Линия;
			ТекОбластьИтогаПоСтранице.Шрифт		 	= Новый Шрифт(МакетОформленияШапки.Шрифт,,,Ложь);
			
			ТекОбластьПодвала = ОбластьПодвал.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
			ТекОбластьПодвала.ГраницаСверху = Линия;
			ТекОбластьПодвала.ГраницаСнизу  = Линия;
			ТекОбластьПодвала.Шрифт			= МакетОформленияШапки.Шрифт;
			
			Если ЧислоИтоговыхКолонок = 0 Тогда
				Если СтруктураИтоговыхКолонок.Свойство(Колонка.Имя) Тогда
					ТекОбласть = ОбластьПодвал.Область(1, ПозицияКолонки-1, 1, ПозицияКолонки-1);
					ТекОбласть.Текст = "Итого " + ВыбВалютаРеестра + ":";
					ТекОбласть.ГраницаСправа			 = Линия;
					ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
					ОбластьПодвал.Область(1, ПозицияКолонки-2, 1, ПозицияКолонки-1).ПоВыделеннымКолонкам = Истина;
					
					ТекОбласть = ОбластьМакетаИтогоПоСтранице.Область(1, ПозицияКолонки-1, 1, ПозицияКолонки-1);
					ТекОбласть.Текст = "Итого по странице " + ВыбВалютаРеестра + ":";
					ТекОбласть.ГраницаСправа		 	= Линия;
					ТекОбласть.ГоризонтальноеПоложение 	= ГоризонтальноеПоложение.Право;
					
					ПозицияКолонкиВыводаИтогаПоСтранице = ПозицияКолонки-1;
					ШиринаКолонкиВыводаИтогаПоСтранице  = СтрДлина(ТекОбласть.Текст);
					ОбластьМакетаИтогоПоСтранице.Область(1, ПозицияКолонки-2, 1, ПозицияКолонки-1).ПоВыделеннымКолонкам = Истина;
				КонецЕсли;
			Иначе
				ТекОбластьИтогаПоСтранице.ГраницаСправа = Линия;
				ТекОбластьПодвала.ГраницаСправа			= Линия;
			КонецЕсли;
		КонецЕсли;
		
		Если СтруктураИтоговыхКолонок.Свойство(Колонка.Имя) Тогда
			ТекОбласть = ОбластьМакетаИтогоПоСтранице.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
			ТекОбласть.Заполнение	 = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ТекОбласть.Параметр		 = Колонка.Имя;
			ТекОбласть.Формат 		 = Колонка.Формат;
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
			ТекОбласть.ГраницаСверху = Линия;
			ТекОбласть.ГраницаСнизу  = Линия;
			ТекОбласть.ГраницаСправа = Линия;
			ТекОбласть.Шрифт		 = Новый Шрифт(МакетОформленияШапки.Шрифт,,,Ложь);
			
			ТекОбласть = ОбластьПодвал.Область(1, ПозицияКолонки, 1, ПозицияКолонки);
			ТекОбласть.Заполнение	 = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			ТекОбласть.Параметр		 = Колонка.Имя;
			ТекОбласть.Формат 		 = Колонка.Формат;
			ТекОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право; 
			ТекОбласть.ГраницаСверху = Линия;
			ТекОбласть.ГраницаСнизу  = Линия;
			ТекОбласть.ГраницаСправа = Линия;
			ТекОбласть.Шрифт		 = МакетОформленияШапки.Шрифт;
			
			СтруктураИтоговПоСтранице.Вставить(Колонка.Имя, 0);
			СтруктураИтоговПодвала.Вставить(Колонка.Имя, 0);
			ЧислоИтоговыхКолонок = ЧислоИтоговыхКолонок + 1;
		КонецЕсли;
		ПозицияКолонки = ПозицияКолонки + 1;
	КонецЦикла;
	
	ТекОбласть = ОбластьШапкаТаблицы.Область(1, ПозицияКолонки-1, 1, ПозицияКолонки-1);
	ТекОбласть.Заполнение	 = ТипЗаполненияОбластиТабличногоДокумента.Параметр;
	ТекОбласть.Параметр		 = "НомерСтраницы";
	
	Если ВыбратьВалюту Тогда
		ТекОбласть = ОбластьМакетаИтогоПоСтранице.Область(1, ПозицияКолонки-1, 1, ПозицияКолонки-1);
		ТекОбласть.ГраницаСправа = Линия;
		ТекОбласть = ОбластьПодвал.Область(1, ПозицияКолонки-1, 1, ПозицияКолонки-1);
		ТекОбласть.ГраницаСправа = Линия;
	КонецЕсли;
	
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = "";
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "";
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	Для Каждого ТекДанные Из ИсточникДанных Цикл
		Для Каждого ТекКолонка Из СписокШириныКолонок Цикл
			// Подсчитаем длину текстового представления, если она больше чем было до этого, запишем
			Если ТекКолонка.Ключ = "Картинка" Тогда
				Продолжить;
			КонецЕсли;
			ТекущаяДлина = СтрДлина(Формат(ТекДанные[ТекКолонка.Ключ], ТекКолонка.Значение.Формат));
			// Если колонка это показатель то ищем максимальную длину иначе среднюю
			Если ТекКолонка.Значение.ЭтоПоказатель Тогда
				Если ТекКолонка.Значение.Длинна < ТекущаяДлина Тогда
					СписокШириныКолонок[ТекКолонка.Ключ].Вставить("Длинна", ТекущаяДлина);
				КонецЕсли; 
			ИначеЕсли ТекущаяДлина > 0 Тогда
				ТекСтруктураШирины = СписокОбщейШириныКолонок[ТекКолонка.Ключ];
				ТекСтруктураШирины.Вставить("Ширина", ТекСтруктураШирины.Ширина + ТекущаяДлина);
				ТекСтруктураШирины.Вставить("ЧислоСтрок", ТекСтруктураШирины.ЧислоСтрок + 1);
			КонецЕсли;
		КонецЦикла;
		//заполняем данные подвала
		Попытка // В журнале могут быть документы, у которых нет суммовых показателей!!!
			Для Каждого ТекИтог Из СтруктураИтоговПодвала Цикл
				СтруктураИтоговПодвала.Вставить(ТекИтог.Ключ, ТекИтог.Значение + ТекДанные[ТекИтог.Ключ]);
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если ВыбратьВалюту Тогда
		// Подсчитаем длину текста итоговых колонок
		Для Каждого ТекИтог Из СтруктураИтоговПодвала Цикл
			ТекПараметрыКолонки = СписокШириныКолонок[ТекИтог.Ключ];
			ТекущаяДлина = СтрДлина(Формат(ТекИтог.Значение, ТекПараметрыКолонки.Формат))*1.4;
			Если ТекПараметрыКолонки.Длинна < ТекущаяДлина Тогда
				ТекПараметрыКолонки.Вставить("Длинна", ТекущаяДлина);
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	ТекущаяПозиция = ТабДокумент.Область("C1").ШиринаКолонки + ТабДокумент.Область("C2").ШиринаКолонки;
	//раздвинем колонки в табличном документе
	Для Каждого ТекКолонка Из СписокШириныКолонок Цикл
		ТекОбласть 		 = ТабДокумент.Область("C" + Строка(ТекКолонка.Значение.Позиция));
		ТекОбластьСтроки = ОбластьСтроки.Область("C" + Строка(ТекКолонка.Значение.Позиция));
		Если ВыбратьВалюту Тогда
			ТекОбластьИтогаПоСтранице = ОбластьМакетаИтогоПоСтранице.Область("C" + Строка(ТекКолонка.Значение.Позиция));
		КонецЕсли;
		
		Если ТекКолонка.Значение.ЭтоПоказатель Тогда
			ШиринаКолонки = ТекКолонка.Значение.Длинна;
		Иначе
			ТекСтруктураШирины = СписокОбщейШириныКолонок[ТекКолонка.Ключ];
			ШиринаКолонки = ТекСтруктураШирины.Ширина/?(ТекСтруктураШирины.ЧислоСтрок = 0,1,ТекСтруктураШирины.ЧислоСтрок);
			// Если средняя длинна меньше длинны шапки тогда берем длину шапки
			Если ТекКолонка.Значение.Длинна > ШиринаКолонки Тогда
				ШиринаКолонки = ТекКолонка.Значение.Длинна;
			КонецЕсли;
			
			Если ПозицияКолонкиВыводаИтогаПоСтранице = ТекКолонка.Значение.Позиция Тогда
				Если ШиринаКолонкиВыводаИтогаПоСтранице > ШиринаКолонки Тогда
					ШиринаКолонки = ШиринаКолонкиВыводаИтогаПоСтранице;
				КонецЕсли;
			КонецЕсли;
			
			ТекОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			ТекОбластьСтроки.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			
			Если ЕстьКартинки Тогда
				Для Каждого ТекКартинка Из СтруктураКартинок Цикл
					ОбластьСтрокиКартинки = СтруктураОбластейСтроки[ТекКартинка.Ключ];
					ОбластьСтрокиКартинки.Область("C" + Строка(ТекКолонка.Значение.Позиция)).РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				КонецЦикла;
			КонецЕсли;
			
			Если ВыбратьВалюту Тогда
				ТекОбластьИтогаПоСтранице.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			КонецЕсли;
		КонецЕсли;
		
		ШиринаКолонки = Цел(ШиринаКолонки + 1);
		
		// ограничение ширины колонок зададим равное 40 (в средних единицах шрифта)
		Если ШиринаКолонки > 40 Тогда
			ШиринаКолонки = 40;
			// Поскольку ограничили ширину, нужно установить тип размещения = Переносить 
			ТекОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		КонецЕсли; 
		Если ТекКолонка.Ключ = "Картинка" Тогда
			ШиринаКолонки = 3;
		КонецЕсли;
		ТекОбласть.ШиринаКолонки = ШиринаКолонки;
		ТекОбластьСтроки.ШиринаКолонки = ШиринаКолонки;
		
		Если ЕстьКартинки Тогда
			Для Каждого ТекКартинка Из СтруктураКартинок Цикл
				ОбластьСтрокиКартинки = СтруктураОбластейСтроки[ТекКартинка.Ключ];
				ОбластьСтрокиКартинки.Область("C" + Строка(ТекКолонка.Значение.Позиция)).ШиринаКолонки = ШиринаКолонки;
			КонецЦикла;
		КонецЕсли;
		
		Если ВыбратьВалюту Тогда
			ТекОбластьИтогаПоСтранице.ШиринаКолонки = ШиринаКолонки;
		КонецЕсли;
		ТекущаяПозиция = ТекущаяПозиция + ШиринаКолонки;
	КонецЦикла;
	
	НомерСтроки = 1;
	Для Каждого ТекДанные Из ИсточникДанных Цикл
		
		Если ЕстьКартинки Тогда
			ТекОбластьСтроки = СтруктураОбластейСтроки[ТекДанные.Картинка];
		Иначе
			ТекОбластьСтроки = ОбластьСтроки;
		КонецЕсли;
		
		//заполняем данные строки
		ТекОбластьСтроки.Параметры.Заполнить(ТекДанные);
		ТекОбластьСтроки.Параметры.НомерСтроки = НомерСтроки;
		ИндексПараметра = 0;
		Для каждого ПараметрСтроки Из ТекОбластьСтроки.Параметры Цикл
			Попытка
				Если ПараметрСтроки = Неопределено ИЛИ ПараметрСтроки.Пустая() Тогда
					ТекОбластьСтроки.Параметры.Установить(ИндексПараметра,"");
				КонецЕсли; 
			Исключение
			КонецПопытки; 
			ИндексПараметра = ИндексПараметра + 1;
		КонецЦикла; 
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ТекОбластьСтроки, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			Для Каждого ТекИтог Из СтруктураИтоговПоСтранице Цикл
				СтруктураИтоговПоСтранице.Вставить(ТекИтог.Ключ, 0);
			КонецЦикла;
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		Попытка // В журнале могут быть документы, у которых нет суммовых показателей!!!
			дкДобавитьИтогиПоСтранице(ТекДанные,СтруктураИтоговПоСтранице);
		Исключение
		КонецПопытки; 
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Если ВыбратьВалюту Тогда
		//довыводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице, Неопределено);
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Заполнить(СтруктураИтоговПодвала);
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы);
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции // дкСформироватьРеестр()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ФОРМ ДОКУМЕНТОВ

// Общий обработчик события ПередОткрытием формы документа 
// Здесь прописаны действия блокировки просмотра, вызова процедур заполнения новых документов и т.д.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Отказ - булево, признак отказа открытия формы документа
// СтандартнаяОбработка - булево, признак стандартной обработки
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПередОткрытием(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт

	ВосстановитьРазмерыФормы(ЭтаФорма);

	МетаданныеОбъекта=Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ДокументОбъект));
	ПодсистемаАвтосалон=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Документооборот.Подсистемы.Автосалон;
	ПодсистемаТестДрайв=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.ТестДрайв;
	Если ПодсистемаАвтосалон.Состав.Содержит(МетаданныеОбъекта) ИЛИ ПодсистемаТестДрайв.Состав.Содержит(МетаданныеОбъекта) Тогда
		Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон",Истина) Тогда
			Отказ=Истина;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ПодсистемаУчетВзаимоотношенийСКлиентами=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.УчетВзаимоотношенийСКлиентами;
	Если ПодсистемаУчетВзаимоотношенийСКлиентами.Состав.Содержит(МетаданныеОбъекта) Тогда
		Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаCRM",Истина) Тогда
			Отказ=Истина;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ПодсистемаТехосмотр=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Документооборот.Подсистемы.Техосмотр;
	Если ПодсистемаТехосмотр.Состав.Содержит(МетаданныеОбъекта) Тогда
		Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаТехосмотр",Истина) Тогда
			Отказ=Истина;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Результат = зфФормаПередОткрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Отказ = Отказ ИЛИ дкПроверитьОтменуВводаДокумента(ЭтаФорма.ДокументОбъект);
	
	//anton
	ТТ_Общий.ФормаПередОткрытием(ЭтаФорма);
	//anton           
	
	верс_ВерсионированиеОбъектов.верс_удЗаполнитьДополнительныеДействияДокументов(ЭтаФорма); //ЧалапАю БизТех 10.09.2024 - версионирование
	Попытка
		М_КонтрольЭлементовФорм.КонтрольЭлементовФормы(ЭтаФорма,"ФормаДокумента"); // БИЗТЕХ КОВАЛЬ 20.10.2024 ++
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
	КонецПопытки;
	Возврат Результат И НЕ Отказ;
	
КонецФункции // дкФормаПередОткрытием()

// Общий обработчик события ПриОткрытии формы документа 
// Здесь прописаны различные предопределенные заполнения, создание списка печ. форм, 
// управление видимостью элементов и прочее
//
// Параметры:
// ЭтаФорма   - форма, форма переданного документа
// ПовторноеОткрытие - булево, признак повторного открытия формы документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПриОткрытии(ЭтаФорма, ПовторноеОткрытие = Ложь) Экспорт
	попытка
		Возврат зфФормаДокументаПриОткрытии(ЭтаФорма, ПовторноеОткрытие);
	исключение
	конецпопытки;	
КонецФункции // дкФормаПриОткрытии()

// Общий обработчик события ОбновлениеОтображения формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаОбновлениеОтображения(ЭтаФорма) Экспорт
	
	Результат = Истина;
	
	Если ЭтаФорма <> Неопределено Тогда
		// отобразим время документа в верхней панели
		Время = "(" + Формат(ЭтаФорма.Дата,"ДЛФ = T") + ")";
		Попытка           
			ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Время.Текст = Время; 			
		Исключение    
			
		КонецПопытки;
		
		Для Каждого ТекЭлемент Из ЭтаФорма.ЭлементыФормы Цикл
			Если ТипЗнч(ТекЭлемент) <> Тип("КоманднаяПанель") Тогда
				Продолжить;
			КонецЕсли;
			
			КнопкаСортировкиВозр = Неопределено;
			КнопкаСортировкиУбыв = Неопределено;
			ЕстьНайденнаяКнопка = Ложь;
			Для Каждого ТекКнопка Из ТекЭлемент.Кнопки Цикл
				Если Найти(ТекКнопка.Имя, "_РасширеннаяСортировка_Возр")>0 Тогда
					КнопкаСортировкиВозр = ТекКнопка;
					ЕстьНайденнаяКнопка = Истина;
				ИначеЕсли Найти(ТекКнопка.Имя, "_РасширеннаяСортировка_Убыв")>0 Тогда
					КнопкаСортировкиУбыв = ТекКнопка;
					ЕстьНайденнаяКнопка = Истина;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьНайденнаяКнопка Тогда
				Попытка
					СортировкаВозможна = ((Не ЭтаФорма.ТолькоПросмотр) И (Не ТекЭлемент.ИсточникДействий.ТолькоПросмотр) 
					И ТекЭлемент.ИсточникДействий.Доступность И ТекЭлемент.ИсточникДействий.ИзменятьПорядокСтрок );
					КнопкаСортировкиВозр.Доступность = СортировкаВозможна;
					КнопкаСортировкиУбыв.Доступность = СортировкаВозможна;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли; 
	
	Возврат Результат; 	
КонецФункции // дкФормаОбновлениеОтображения()

// Общий обработчик события ПередЗакрытием формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Отказ - булево, признак отказа открытия формы документа
// СтандартнаяОбработка - булево, признак стандартной обработки
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	СохранитьРазмерыФормы(ЭтаФорма);

	Результат = Истина;
	
	//Попытка // Проверим сами закрываемся или нас закрывают "снаружи"
	//	ВнешняяКомпонентаПодключена = Обработки.Защита.Создать().Компонента.УправлениеАктивно();
	//Исключение 
	//	ВнешняяКомпонентаПодключена = Ложь;
	//КонецПопытки;
	//Если НЕ ВнешняяКомпонентаПодключена Тогда
	//	СтандартнаяОбработка = Ложь; // Аварийное закрытие - нельзя что-либо спрашивать!
	//КонецЕсли;
	
	Возврат Результат;  	
КонецФункции // дкФормаПередЗакрытием()

// Общий обработчик события ПриЗакрытии формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПриЗакрытии(ЭтаФорма) Экспорт
	
	Результат = Истина;
	
	Попытка
		ДокументОбъект = ЭтаФорма.ДокументОбъект;
	Исключение
		ДокументОбъект = Неопределено;
	КонецПопытки;
	Если ДокументОбъект <> Неопределено Тогда
		МассивТабЧасти = Новый Массив;
		ДокументОбъектМетаданные=ДокументОбъект.Метаданные();
		МетаДанныеТабЧасти = ДокументОбъектМетаданные.ТабличныеЧасти;
		Для Каждого МетаТабЧасть Из МетаДанныеТабЧасти Цикл
			Если МетаТабЧасть.Реквизиты.Найти("Номенклатура")<> Неопределено Тогда
				МассивТабЧасти.Добавить(МетаТабЧасть.Имя);
			КонецЕсли;
		КонецЦикла;
		Для Каждого ИмяТабЧасти Из МассивТабЧасти Цикл
			Попытка
				ТабПоле = ЭтаФорма.ЭлементыФормы[ИмяТабЧасти];
			Исключение
				Продолжить;
			КонецПопытки;
			Если ТипЗнч(ТабПоле) = Тип("ТабличноеПоле") И ТабПоле.Данные = ИмяТабЧасти Тогда
				КолонкаПроизводителя = ТабПоле.Колонки.Найти("НоменклатураПроизводитель");
				Если КолонкаПроизводителя <> Неопределено Тогда
					СохранитьЗначение(ДокументОбъектМетаданные.Имя+"_"+ИмяТабЧасти+"_"+КолонкаПроизводителя.Имя+"_Видимость",КолонкаПроизводителя.Видимость);
				КонецЕсли;
				КолонкаПроизводителя = ТабПоле.Колонки.Найти("НоменклатураПроизводительПриход");
				Если КолонкаПроизводителя <> Неопределено Тогда
					СохранитьЗначение(ДокументОбъектМетаданные.Имя+"_"+ИмяТабЧасти+"_"+КолонкаПроизводителя.Имя+"_Видимость",КолонкаПроизводителя.Видимость);
				КонецЕсли;
				КолонкаПроизводителя = ТабПоле.Колонки.Найти("НоменклатураПроизводительРасход");
				Если КолонкаПроизводителя <> Неопределено Тогда
					СохранитьЗначение(ДокументОбъектМетаданные.Имя+"_"+ИмяТабЧасти+"_"+КолонкаПроизводителя.Имя+"_Видимость",КолонкаПроизводителя.Видимость);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Удалим файл
	//Компьютер = Справочники.Компьютеры.НайтиПоНаименованию(ИмяКомпьютера(), Истина);
	Компьютер = ПараметрыСеанса.Компьютер;
	ВидДокумента = ЭтаФорма.ЭтотОбъект.Метаданные().Имя;
	GUIDКонфигурации = СтрЗаменить(Сред(ЗначениеВСтрокуВнутр(Метаданные),6,36),"-","");
	СохраненныйФайл = НайтиФайлы(Компьютер.ЛокальныйКаталог, GUIDКонфигурации + "_" + СокрЛП(ВидДокумента) + "_" + ЭтаФорма.ЭтотОбъект.Номер + "_" + Формат(ЭтаФорма.ЭтотОбъект.Дата, "ДФ = ддММгггг") + "_" + СокрЛП(ПараметрыСеанса.Пользователь.Код) + ".dct");
	Если СохраненныйФайл.Количество() <> 0 Тогда
		УдалитьФайлы(СохраненныйФайл[0].ПолноеИмя);
	КонецЕсли;
	Обработки.ПанельАРМФормыИПоследниеОбъекты.Создать().УдалитьИзДереваФорм(ЭтаФорма);
	
	Возврат Результат;    	
КонецФункции // дкФормаПриЗакрытии()

// Общий обработчик события ОбработкаВыбора формы документа 
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного документа
// ЗначениеВыбора - произвольный. Выбранное значение.
// Источник  - Произвольный, Форма - источник события. 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаОбработкаВыбора(ЭтаФорма, ЗначениеВыбора, Источник) Экспорт
	
	// Может быть отраслевое переопределение функции модуля...
	Результат = орФормаОбработкаВыбора(ЭтаФорма, ЗначениеВыбора, Источник); 
	Если Результат <> Неопределено Тогда
		Возврат Результат;     		
	Иначе		
		Результат = Истина;
	КонецЕсли; 
	
	ПодборПоНоменклатуре = Ложь;
	ПодборПоПрайсЛисту   = Ложь;
	СтруктураВыбор       = Неопределено;
	Если ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.Номенклатура") Тогда 
		ПодборПоНоменклатуре = Истина;
	ИначеЕсли ТипЗнч(ЗначениеВыбора) = Тип("СправочникСсылка.ПрайсЛист") Тогда
		ПодборПоПрайсЛисту = Истина;
	КонецЕсли;
	
	СтруктураПараметровПодбора = Неопределено;
	Попытка
		СтруктураПараметровПодбора = Источник.СтруктураПараметровФормы;
	Исключение
		СтруктураПараметровПодбора = Новый Структура();
	КонецПопытки; 
	ОбработкаВДокументе = Ложь;
	Если НЕ СтруктураПараметровПодбора.Свойство("ОбработкаВДокументе",ОбработкаВДокументе) Тогда
		ОбработкаВДокументе = Ложь;
		СтруктураПараметровПодбора.Вставить("ОбработкаВДокументе",ОбработкаВДокументе);
	КонецЕсли; 
	
	Если (ПодборПоНоменклатуре ИЛИ ПодборПоПрайсЛисту) И НЕ ОбработкаВДокументе Тогда
		Если ЭтаФорма.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
			Если ПодборПоНоменклатуре Тогда 
				ОбработкаПодбор = Обработки.ПодборНоменклатуры.Создать();
			Иначе
				ОбработкаПодбор = Обработки.ПодборНоменклатурыПоПрайсЛисту.Создать();
			КонецЕсли;
			Количество			= ?(СтруктураПараметровПодбора.Свойство("Количество"), СтруктураПараметровПодбора["Количество"], 1);
			Цена				= ?(СтруктураПараметровПодбора.Свойство("Цена"), СтруктураПараметровПодбора["Цена"], 0);
			ЗагрузкаИзВнешнихКатологов	= ?(СтруктураПараметровПодбора.Свойство("ЗагрузкаИзВнешнихКатологов"),
											СтруктураПараметровПодбора["ЗагрузкаИзВнешнихКатологов"], Ложь);
			Если ЗагрузкаИзВнешнихКатологов=Истина Тогда
				СпроситьКоличество	= Истина;
			Иначе
				СпроситьКоличество	= Ложь;
			КонецЕсли;
			ОбработкаПодбор.ДобавитьНоменклатуру(Источник,СтруктураПараметровПодбора,ЗначениеВыбора,СпроситьКоличество,Ложь, Количество,,,Цена);
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // дкФормаОбработкаВыбора()

// Общий обработчик события ОбработкаОповещения формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// ИмяСобытия - Имя события. Может быть использовано для идентификации сообщений
// Параметр - Произвольный. Параметр, переданный в сообщении.
// источник - Источник события, переданный в сообщении. 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Результат = Истина;
	
	// Отбросим собственные оповещения
	Если ЭтаФорма = Источник Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьПрава" Тогда
		Если Параметр=ПараметрыСеанса.Пользователь ИЛИ Параметр=ПараметрыСеанса.Пользователь.ШаблонПрав ИЛИ
			 Параметр=ПараметрыСеанса.ПодразделениеКомпании ИЛИ Параметр=ПараметрыСеанса.Организация Тогда
			// Были обновлены права пользователя (глПрава) - необходимо пересчитывание кэша прав объекта
			Попытка Состояние("Обновляю права для документа " + ЭтаФорма.Заголовок);
				ЭтаФорма.Права = обПолучитьПраваИНастройкиПользователя(Параметр);
				ЭтаФорма.Обновить();
			Исключение
			КонецПопытки; 
		КонецЕсли; 
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьСписокУтверждение" Тогда
		Если Параметр = ЭтаФорма.Ссылка ИЛИ Параметр.Ссылка = ЭтаФорма.Ссылка Тогда
			// выполнили утверждение документа - изменим состав действий (кнопок)
			Попытка
				ПраваПользователя=ЭтаФорма.Права;
			Исключение
				ПраваПользователя=Обработки.Защита.Создать().Права;
			КонецПопытки; 
			дкЗаполнитьСписокУтверждение(ЭтаФорма, ЭтаФорма.Ссылка, ПраваПользователя);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбновилисьЗаметки" Тогда
		Попытка
			ТекСтрока = ЭтаФорма.ЭтотОбъект.Ссылка;
			Если обЗначениеНеЗаполнено(ТекСтрока) Тогда
				ТекСтрока = Неопределено;
			КонецЕсли;
		Исключение
			ТекСтрока = Неопределено;
		КонецПопытки;
		
		удОбновитьКартинкуЗаметок(ТекСтрока, ЭтаФорма);
	КонецЕсли; 
	
	Возврат Результат;    	
КонецФункции // дкФормаОбработкаОповещения()

// Общий обработчик события ВнешнееСобытие формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Источник - строка, источник внешнего события. 
// Событие - строка, наименование события. 
// Данные - строка, данные для события. 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаВнешнееСобытие(ЭтаФорма, Источник, Событие, Данные) Экспорт
	
	//защита от двойного срабатывания сканера штрихкодов
	Если Источник = "Сканер" И НЕ ЗначениеЗаполнено(Данные) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	//защита от срабатывания в неактивных формах
	Если НЕ ЭтаФорма.ВводДоступен() Тогда 
		Возврат Ложь; 
	КонецЕсли;
	
	Попытка
		КэшПрава = ЭтаФорма.ДокументОбъект.Права;
	Исключение
		КэшПрава = ЭтаФорма.Права;
	КонецПопытки;
	
	Попытка
		ЗапросКоличестваПриВводеТовараСоСканераШК = обПраво("ЗапросКоличестваПриВводеТовараСоСканераШК", КэшПрава,,ЭтаФорма.ДокументОбъект);
	Исключение
		ЗапросКоличестваПриВводеТовараСоСканераШК = обПраво("ЗапросКоличестваПриВводеТовараСоСканераШК");
	КонецПопытки;
	
	Попытка 
		ВидДокумента = ЭтаФорма.ЭтотОбъект.Метаданные().Имя;
	Исключение
	КонецПопытки;
	
	//исключение для АРМ Корзина
	//для АРМ поведение при сканировании ШК такое же как для документа Реализация товаров. 
	Если ВидДокумента = "АРМКорзина" Тогда
		ВидДокумента = "РеализацияТоваров";
	КонецЕсли;
	
	Если ВидДокумента = "ПомощникСозданияЧековКоррекции" Тогда
		ВидДокумента = "ЧекКоррекции";
	КонецЕсли;
	
	// не можем ничего добавить, также если документ уже был утвержден
	ИспользоватьУтверждение = дкПроверитьИспользованиеУтверждения(ВидДокумента, КэшПрава);
	ДокументУтвержден = Ложь;
	Если ИспользоватьУтверждение Тогда
		СтатусДокумента = дкПолучитьСтатусДокумента(ЭтаФорма.ЭтотОбъект.Ссылка);
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден Тогда
			ДокументУтвержден = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ДокументУтвержден И Не ЭтаФорма.ТолькоПросмотр Тогда
		//обработка события от сканера ШК
		Если Источник = "Сканер" Тогда
			ОбработкаОбъектШтрихКоды = Обработки.ШтрихКоды.Создать();
			
			КодМаркировки = "";
			
			// Маркировка товаров
			ЕстьМаркировка = дкДокументЕстьТабЧасть(ВидДокумента, "КодыМаркировки");
			ЕстьТовары     = дкДокументЕстьТабЧасть(ВидДокумента, "Товары");
			
			// Проверим, что сканируемый ШК - это маркировка
			Если ЕстьМаркировка И ЕстьТовары Тогда
				
				ДвоичныеДанныеКМ = ПолучитьДвоичныеДанныеИзСтроки(Данные);
				МаркировкаBase64 = Base64Строка(ДвоичныеДанныеКМ);
				СтруктураШК = ОбработкаОбъектШтрихКоды.РазобратьСтрокуШтрихкодаGS1(Данные, Истина);
				
				Попытка
					КодыМаркировки = ЭтаФорма.КодыМаркировки;
				Исключение
					КодыМаркировки = Неопределено;
				КонецПопытки;
				
				// Считали маркировку товара.
				Если СтруктураШК.Разобран И КодыМаркировки <> Неопределено Тогда
					КодМаркировки = Данные;
					
					СтруктураПоиска = Новый Структура();
					СтруктураПоиска.Вставить("КодМаркировки", Данные);
					
					НайденныеСтроки = КодыМаркировки.НайтиСтроки(СтруктураПоиска);
					
					// Такая маркировка уже имеется в документе. Не будем ее повторно добавлять.
					Если НайденныеСтроки.Количество() > 0 Тогда
						
						Попытка
							НайденныеСтроки[0].Подтверждено = Истина;
						Исключение
						КонецПопытки;
						
						Попытка
							НайденныеСтроки[0].КодМаркировкиBase64 = МаркировкаBase64;
						Исключение
						КонецПопытки;
						
						СтруктураПоиска = Новый Структура();
						СтруктураПоиска.Вставить("ИдентификаторТовара", НайденныеСтроки[0].ИдентификаторТовара);
						
						МассивСтрок = ЭтаФорма.Товары.НайтиСтроки(СтруктураПоиска);
						
						Если МассивСтрок.Количество() > 0 Тогда
							СтрокаНоменклатура = МассивСтрок[0];
							ЭтаФорма.ЭлементыФормы.Товары.ТекущаяСтрока = СтрокаНоменклатура;
						КонецЕсли;
						
						Возврат Ложь;
						
					КонецЕсли;
					
					// Получим EAN маркировки
					ШтрихкодEAN = "";
					Идентификатор01 = СтруктураШК.ДанныеШтрихкода["01"];
					Если НЕ Идентификатор01 = Неопределено Тогда
						ШтрихкодEAN = ОбработкаОбъектШтрихКоды.EANПоКодуМаркировки(Идентификатор01.Значение);
					КонецЕсли;
					
					// Найдем номенклатуру по EAN
					СтруктураНоменклатуры = ОбработкаОбъектШтрихКоды.НайтиСтруктуруПоШтрихКоду(ШтрихкодEAN);
					
					// Полученную номенклатуру попробуем найти в ТЧ Товары или добавим новую строку.
					Если СтруктураНоменклатуры <> Неопределено
						И ТипЗнч(СтруктураНоменклатуры.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
						
						ИмяТабличнойЧасти = "Товары";
						СписокТоваров  = ЭтаФорма.Товары;
						ТоварыТабличноеПоле = ЭтаФорма.ЭлементыФормы.Товары;
						СтрокаНоменклатура = Неопределено;
						
						//теперь определим наличие колонок ТЧ
						ЕстьЕдиницаИзмерения   = дкДокументЕстьРеквизитТабЧасти("ЕдиницаИзмерения", ВидДокумента, ИмяТабличнойЧасти);
						ЕстьХарактеристикаНоменклатуры = дкДокументЕстьРеквизитТабЧасти("ХарактеристикаНоменклатуры", ВидДокумента, ИмяТабличнойЧасти);
						ЕстьКоличество     = дкДокументЕстьРеквизитТабЧасти("Количество", ВидДокумента, ИмяТабличнойЧасти);
						
						//установим флаг того что поиск не производился
						ПоискПроизводился = Ложь;
						МассивСтрок = Новый Массив();
						Если СтруктураНоменклатуры.Свойство("ЕдиницаИзмерения") И ЕстьЕдиницаИзмерения Тогда
							//МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура,ЕдиницаИзмерения",
							//СтруктураНоменклатуры.Объект,СтруктураНоменклатуры.ЕдиницаИзмерения));
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура",СтруктураНоменклатуры.Объект));
							ПоискПроизводился = Истина;
						ИначеЕсли СтруктураНоменклатуры.Свойство("ХарактеристикаНоменклатуры") И ЕстьХарактеристикаНоменклатуры Тогда
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтруктураНоменклатуры.Объект,СтруктураНоменклатуры.ХарактеристикаНоменклатуры));
							ПоискПроизводился = Истина;
						КонецЕсли;
						//если не искали тогда будем искать только по номенклатуре
						Если НЕ ПоискПроизводился Тогда
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура",СтруктураНоменклатуры.Объект));
						КонецЕсли;
						Если МассивСтрок.Количество() > 0 Тогда
							СтрокаНоменклатура = МассивСтрок[0];
						КонецЕсли;
						КолСтр = "Количество";
						// попытаемся получить нестандартное имя реквизита который является количеством
						Попытка 
							КолСтр = ЭтаФорма.ИмяРеквизитаКоличество;
						Исключение
						КонецПопытки;
						
						//если товар в ТЧ не найден то добавим строку
						Если обЗначениеНеЗаполнено(СтрокаНоменклатура) Тогда
							//добавим новую строчку в ТЧ 
							СтрокаНоменклатура = СписокТоваров.Добавить();
							ТоварыТабличноеПоле.ТекущаяСтрока = СтрокаНоменклатура;
							СтрокаНоменклатура.Номенклатура = СтруктураНоменклатуры.Объект;
							СтрокаНоменклатура.ИдентификаторТовара = Новый УникальныйИдентификатор;
							
							ДопПараметры = Неопределено;
							
							// Пытаемся обработать реквизит "Номенклатура" табличной части документа.
							Попытка 
								ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".Номенклатура", СтрокаНоменклатура,ЭтаФорма, ДопПараметры);
							Исключение
							КонецПопытки; 
							
							Попытка
								НоменклатураНовойСтроки = СтрокаНоменклатура.Номенклатура;
							Исключение
								//Это если это был набор и мы удалили эту строку
								дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
								Возврат Истина; 
							КонецПопытки; 
							//а теперь если есть характеристика или единица измерения поставим и их
							Если СтруктураНоменклатуры.Свойство("ЕдиницаИзмерения") И ЕстьЕдиницаИзмерения Тогда
								СтрокаНоменклатура.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
								Попытка
									ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".ЕдиницаИзмерения",СтрокаНоменклатура,ЭтаФорма);
								Исключение
								КонецПопытки;
							ИначеЕсли СтруктураНоменклатуры.Свойство("ХарактеристикаНоменклатуры") И ЕстьХарактеристикаНоменклатуры Тогда
								СтрокаНоменклатура.ХарактеристикаНоменклатуры = СтруктураНоменклатуры.ХарактеристикаНоменклатуры;
								// Пытаемся обработать реквизит "Номенклатура" табличной части документа.
								Попытка 
									ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".ХарактеристикаНоменклатуры", СтрокаНоменклатура,ЭтаФорма, ДопПараметры);
								Исключение
								КонецПопытки;
							КонецЕсли;
							
							СтрокаНоменклатура[КолСтр] = 1;
							
						Иначе
							ТоварыТабличноеПоле.ТекущаяСтрока = СтрокаНоменклатура;
						КонецЕсли;
						ЭтаФорма.Модифицированность = Истина;
						дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
						
						// Внесем маркировку в ТЧ
						Если СтрокаНоменклатура <> Неопределено
							И дкЭтоМаркируемаяНоменклатура(СтрокаНоменклатура.Номенклатура) Тогда
							
							// Добавим в ТЧ Коды маркировки маркировку.
							НоваяСтрока = ЭтаФорма.КодыМаркировки.Добавить();
							НоваяСтрока.ИдентификаторТовара = СтрокаНоменклатура.ИдентификаторТовара;
							НоваяСтрока.КодМаркировки = Данные;
							
							Попытка
								НоваяСтрока.Подтверждено = Истина;
							Исключение
							КонецПопытки;
							
							Попытка
								НоваяСтрока.КодМаркировкиBase64 = МаркировкаBase64;
							Исключение
							КонецПопытки;
							
							СтруктураПоиска = Новый Структура();
							СтруктураПоиска.Вставить("ИдентификаторТовара", СтрокаНоменклатура.ИдентификаторТовара);
							
							МассивСтрок = ЭтаФорма.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
							
							// Если количество товара в строке меньше, чем отсканированной номенклатуры
							// то увеличиваем количество на единицу
							Если ЕстьКоличество И СтрокаНоменклатура[КолСтр] < МассивСтрок.Количество() Тогда
								СтрокаНоменклатура[КолСтр] = СтрокаНоменклатура[КолСтр] + 1;
								Попытка ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + "." + КолСтр,СтрокаНоменклатура,ЭтаФорма); Исключение КонецПопытки;
							КонецЕсли;
							
						КонецЕсли;
						
						Возврат Ложь;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			СтруктураНоменклатуры = ОбработкаОбъектШтрихКоды.НайтиСтруктуруПоШтрихКоду(Данные);
			Если (НЕ обЗначениеНеЗаполнено(СтруктураНоменклатуры)) И (Метаданные.Документы.Содержит(ЭтаФорма.Метаданные()) ИЛИ ЭтаФорма.Метаданные() = Метаданные.Обработки.АРМКорзина) Тогда
				Если ТипЗнч(СтруктураНоменклатуры.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
					//В системе с данным штрихкодом зарегистрирована номенклатура
					СписокТоваров = Неопределено;
					//тут можно вставить поиск других ТЧ
					Попытка 
						СписокТоваров  = ЭтаФорма.Товары;
						ТоварыТабличноеПоле = ЭтаФорма.ЭлементыФормы.Товары;
						ИмяТабличнойЧасти = "Товары";
					Исключение 
						Попытка 
							СписокТоваров  = ЭтаФорма.Скидки;
							ТоварыТабличноеПоле = ЭтаФорма.ЭлементыФормы.Скидки;
							ИмяТабличнойЧасти = "Скидки";
						Исключение 							
						КонецПопытки; 						
					КонецПопытки;
					
					//если не определились с ТЧ то и делать ничего не будем
					Если СписокТоваров = Неопределено ИЛИ 
							ТоварыТабличноеПоле.ТолькоПросмотр ИЛИ 
							(Не ТоварыТабличноеПоле.Доступность) Тогда
						Возврат Ложь;
					КонецЕсли;
					
					//поищем номенклатуру
					СтрокаНоменклатура = Неопределено;
					
					Если ИмяТабличнойЧасти <> "Скидки" Тогда
						
						//теперь определим наличие колонок ТЧ
						ЕстьЕдиницаИзмерения   = дкДокументЕстьРеквизитТабЧасти("ЕдиницаИзмерения", ВидДокумента, ИмяТабличнойЧасти);
						ЕстьХарактеристикаНоменклатуры = дкДокументЕстьРеквизитТабЧасти("ХарактеристикаНоменклатуры", ВидДокумента, ИмяТабличнойЧасти);
						ЕстьКоличество     = дкДокументЕстьРеквизитТабЧасти("Количество", ВидДокумента, ИмяТабличнойЧасти);
						
						//установим флаг того что поиск не производился
						ПоискПроизводился = Ложь;
						МассивСтрок = Новый Массив();
						Если СтруктураНоменклатуры.Свойство("ЕдиницаИзмерения") И ЕстьЕдиницаИзмерения Тогда
							//МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура,ЕдиницаИзмерения",
							//СтруктураНоменклатуры.Объект,СтруктураНоменклатуры.ЕдиницаИзмерения));
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура",СтруктураНоменклатуры.Объект));
							ПоискПроизводился = Истина;
						ИначеЕсли СтруктураНоменклатуры.Свойство("ХарактеристикаНоменклатуры") И ЕстьХарактеристикаНоменклатуры Тогда
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтруктураНоменклатуры.Объект,СтруктураНоменклатуры.ХарактеристикаНоменклатуры));
							ПоискПроизводился = Истина;
						КонецЕсли;
						//если не искали тогда будем искать только по номенклатуре
						Если НЕ ПоискПроизводился Тогда
							МассивСтрок = СписокТоваров.НайтиСтроки(Новый Структура("Номенклатура",СтруктураНоменклатуры.Объект));
						КонецЕсли;
						Если МассивСтрок.Количество() > 0 Тогда
							СтрокаНоменклатура = МассивСтрок[0];
						КонецЕсли;
						КолСтр = "Количество";
						// попытаемся получить нестандартное имя реквизита который является количеством
						Попытка 
							КолСтр = ЭтаФорма.ИмяРеквизитаКоличество;
						Исключение
						КонецПопытки;
					Иначе
						Если НЕ дкДокументЕстьРеквизитТабЧасти("Номенклатура", ВидДокумента, ИмяТабличнойЧасти) Тогда
							Возврат Ложь;	
						КонецЕсли;
						ЕстьЕдиницаИзмерения   			= Ложь;
						ЕстьХарактеристикаНоменклатуры 	= Ложь;
						ЕстьКоличество     				= Ложь;
					КонецЕсли;
					
					//если товар в ТЧ не найден то добавим строку
					Если обЗначениеНеЗаполнено(СтрокаНоменклатура) Тогда
						//добавим новую строчку в ТЧ 
						СтрокаНоменклатура = СписокТоваров.Добавить();
						ТоварыТабличноеПоле.ТекущаяСтрока = СтрокаНоменклатура;
						СтрокаНоменклатура.Номенклатура = СтруктураНоменклатуры.Объект;
						
						ДопПараметры = Неопределено;
						Если ВидДокумента = "Инвентаризация" Тогда
							// У документа инвентаризация обработка заполнения табличной части
							// зависит от реквизита формы "флЗаполнятьПоСебестоимости".
							ДопПараметры = Новый Структура;
							Попытка флЗаполнятьПоСебестоимости = ЭтаФорма.флЗаполнятьПоСебестоимости Исключение флЗаполнятьПоСебестоимости = Ложь КонецПопытки;
							ДопПараметры.Вставить("флЗаполнятьПоСебестоимости", флЗаполнятьПоСебестоимости);
						КонецЕсли;
						
						Если ЕстьМаркировка Тогда
							Если ДопПараметры = Неопределено Тогда
								ДопПараметры = Новый Структура;
							КонецЕсли;
							ДопПараметры.Вставить("ОткрытьФормуСканированияМаркировки", Истина);
						КонецЕсли;
						
						// Пытаемся обработать реквизит "Номенклатура" табличной части документа.
						Попытка 
							ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".Номенклатура", СтрокаНоменклатура,ЭтаФорма, ДопПараметры);
						Исключение
						КонецПопытки; 
						
						Попытка
							НоменклатураНовойСтроки = СтрокаНоменклатура.Номенклатура;
						Исключение
							//Это если это был набор и мы удалили эту строку
							дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
							Возврат Истина; 
						КонецПопытки; 
						//а теперь если есть характеристика или единица измерения поставим и их
						Если СтруктураНоменклатуры.Свойство("ЕдиницаИзмерения") И ЕстьЕдиницаИзмерения Тогда
							СтрокаНоменклатура.ЕдиницаИзмерения = СтруктураНоменклатуры.ЕдиницаИзмерения;
							Попытка
								ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".ЕдиницаИзмерения",СтрокаНоменклатура,ЭтаФорма);
							Исключение
							КонецПопытки;
						ИначеЕсли СтруктураНоменклатуры.Свойство("ХарактеристикаНоменклатуры") И ЕстьХарактеристикаНоменклатуры Тогда
							СтрокаНоменклатура.ХарактеристикаНоменклатуры = СтруктураНоменклатуры.ХарактеристикаНоменклатуры;
							// Пытаемся обработать реквизит "Номенклатура" табличной части документа.
							Попытка 
								ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + ".ХарактеристикаНоменклатуры", СтрокаНоменклатура,ЭтаФорма, ДопПараметры);
							Исключение
							КонецПопытки;
						КонецЕсли;
						
						Если ЕстьКоличество Тогда
							
							Если ЗапросКоличестваПриВводеТовараСоСканераШК Тогда
								ФормаКоличества = ПолучитьОбщуюФорму("ВводПараметровПодбора");
								ФормаКоличества.ИмяРеквизитаКоличества = КолСтр;
								ФормаКоличества.ВладелецФормы = ЭтаФорма;
								ФормаКоличества.ТекущаяСтрока = СтрокаНоменклатура;
								ФормаКоличества.Номенклатура  = СтрокаНоменклатура.Номенклатура;
								ФормаКоличества.ВидПодбора    = 3;
								
								Если ЕстьЕдиницаИзмерения Тогда
									ФормаКоличества.ЕдиницаИзмерения = СтрокаНоменклатура.ЕдиницаИзмерения;
									ФормаКоличества.ЕдиницаИзмеренияСтарая = СтрокаНоменклатура.ЕдиницаИзмерения;
								КонецЕсли;
								
								Если ЕстьХарактеристикаНоменклатуры Тогда
									ФормаКоличества.ХарактеристикаНоменклатуры = СтрокаНоменклатура.ХарактеристикаНоменклатуры;
								КонецЕсли;
								
								ФормаКоличества.СтруктураПараметровПодбора = Новый Структура("ИмяТабличногоПоляИсточника", ИмяТабличнойЧасти);
								
								// "на шарца" попробуем установить количество
								Если СтруктураНоменклатуры.Свойство("Вес") И СтруктураНоменклатуры.Вес<>Неопределено И СтруктураНоменклатуры.Вес > 0 Тогда
									ФормаКоличества.Количество = СтруктураНоменклатуры.Вес;
								Иначе
									ФормаКоличества.Количество = 1;
								КонецЕсли;
								
								Если дкДокументЕстьРеквизитТабЧасти("Цена", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.Цена  = СтрокаНоменклатура.Цена;
									ФормаКоличества.ЦенаСтарая = СтрокаНоменклатура.Цена;
								ИначеЕсли дкДокументЕстьРеквизитТабЧасти("ЦенаРасход", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.Цена  = СтрокаНоменклатура.ЦенаРасход;
									ФормаКоличества.ЦенаСтарая = СтрокаНоменклатура.ЦенаРасход;
								КонецЕсли;
								
								Если дкДокументЕстьРеквизитТабЧасти("Сумма", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.СуммаСтарая = СтрокаНоменклатура.Сумма;
								ИначеЕсли дкДокументЕстьРеквизитТабЧасти("СуммаРасход", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.СуммаСтарая = СтрокаНоменклатура.СуммаРасход;
								КонецЕсли;
								
								ФормаКоличества.ОткрытьМодально();
							Иначе
								Если СтруктураНоменклатуры.Свойство("Вес") И СтруктураНоменклатуры.Вес<>Неопределено И СтруктураНоменклатуры.Вес > 0 Тогда
									СтрокаНоменклатура[КолСтр] = СтруктураНоменклатуры.Вес;
								Иначе
									СтрокаНоменклатура[КолСтр] = 1;
								КонецЕсли;
							КонецЕсли;
							Попытка ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + "." + КолСтр,СтрокаНоменклатура,ЭтаФорма); Исключение КонецПопытки;
						КонецЕсли;
						//если найден - перейдем
					Иначе
						ТоварыТабличноеПоле.ТекущаяСтрока = СтрокаНоменклатура;
						Если ЕстьКоличество Тогда
							Если ЗапросКоличестваПриВводеТовараСоСканераШК Тогда
								ФормаКоличества = ПолучитьОбщуюФорму("ВводПараметровПодбора");
								ФормаКоличества.ИмяРеквизитаКоличества = КолСтр;
								ФормаКоличества.ВладелецФормы   		= ЭтаФорма;
								ФормаКоличества.ТекущаяСтрока   		= СтрокаНоменклатура;
								ФормаКоличества.Номенклатура            = СтрокаНоменклатура.Номенклатура;
								ФормаКоличества.Количество    			= СтрокаНоменклатура[КолСтр];
								ФормаКоличества.КоличествоСтарое		= СтрокаНоменклатура[КолСтр];
								ФормаКоличества.ВидПодбора              = 3;
								
								Если ЕстьЕдиницаИзмерения Тогда
									ФормаКоличества.ЕдиницаИзмерения       = СтрокаНоменклатура.ЕдиницаИзмерения;
									ФормаКоличества.ЕдиницаИзмеренияСтарая = СтрокаНоменклатура.ЕдиницаИзмерения;
								КонецЕсли;
								
								Если ЕстьХарактеристикаНоменклатуры Тогда
									ФормаКоличества.ХарактеристикаНоменклатуры = СтрокаНоменклатура.ХарактеристикаНоменклатуры;
								КонецЕсли;
								
								ФормаКоличества.СтруктураПараметровПодбора = Новый Структура("ИмяТабличногоПоляИсточника", ИмяТабличнойЧасти);
								
								Если дкДокументЕстьРеквизитТабЧасти("Цена", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.Цена       = СтрокаНоменклатура.Цена;
									ФормаКоличества.ЦенаСтарая = СтрокаНоменклатура.Цена;
								ИначеЕсли дкДокументЕстьРеквизитТабЧасти("ЦенаРасход", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.Цена       = СтрокаНоменклатура.ЦенаРасход;
									ФормаКоличества.ЦенаСтарая = СтрокаНоменклатура.ЦенаРасход;
								КонецЕсли;
								
								Если дкДокументЕстьРеквизитТабЧасти("Сумма", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.СуммаСтарая = СтрокаНоменклатура.Сумма;
								ИначеЕсли дкДокументЕстьРеквизитТабЧасти("СуммаРасход", ВидДокумента, ИмяТабличнойЧасти) Тогда
									ФормаКоличества.СуммаСтарая = СтрокаНоменклатура.СуммаРасход;
								КонецЕсли;
								
								ФормаКоличества.ОткрытьМодально();
							Иначе
								Если СтруктураНоменклатуры.Свойство("Вес") И СтруктураНоменклатуры.Вес<>Неопределено И СтруктураНоменклатуры.Вес > 0 Тогда
									СтрокаНоменклатура[КолСтр] = СтрокаНоменклатура[КолСтр] + СтруктураНоменклатуры.Вес;
								Иначе
									СтрокаНоменклатура[КолСтр] = СтрокаНоменклатура[КолСтр] + 1;
								КонецЕсли;
							КонецЕсли;
							Попытка ЭтаФорма.ОбработкаРеквизита(ИмяТабличнойЧасти + "." + КолСтр,СтрокаНоменклатура,ЭтаФорма); Исключение КонецПопытки;
						КонецЕсли;
					КонецЕсли;
					ЭтаФорма.Модифицированность = Истина;
					дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
				ИначеЕсли ТипЗнч(СтруктураНоменклатуры.Объект) = Тип("СправочникСсылка.Карточки") Тогда
					//В системе с данным штрихкодом зарегистрирована карточка
					Если ТипЗнч(СтруктураНоменклатуры.Объект.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
						//Данная карточка есть дисконтная, т.к. зарегистрирована за контрагентом
						Попытка
							ЭтаФорма.Карточка = СтруктураНоменклатуры.Объект;
							ЭтаФорма.ОбработкаРеквизита("Карточка",,ЭтаФорма);
						Исключение
						КонецПопытки; 
						//В этом случае подставляет владельца карточки в качестве контрагента в документ
						Попытка
							Если ЭтаФорма.Контрагент <> СтруктураНоменклатуры.Объект.Объект И НЕ обЗначениеНеЗаполнено(СтруктураНоменклатуры.Объект.Объект) Тогда
								//В документе выбран другой контрагент - заменяем на владельца карточки
								//Запомним старого контрагента
								ВремКонтрагент = ЭтаФорма.Контрагент;
								ЭтаФорма.Контрагент = СтруктураНоменклатуры.Объект.Объект;
								Попытка
									//Попытаемся инициировать событие по изменению контрагента
									//Для этого процедура "КонтрагентПриИзменении" в форме должна быть объявлена как экспортная
									ЭтаФорма.КонтрагентПриИзменении(ЭтаФорма.ЭлементыФормы.Контрагент);
								Исключение
									//Такой процедуры нет или она не экспортная
									//В этом случае подмена контрагента на владельца карточки
									//должна быть отменена
									ЭтаФорма.Контрагент = ВремКонтрагент;
								КонецПопытки; 
							КонецЕсли; 
						Исключение
						КонецПопытки; 
					ИначеЕсли ТипЗнч(СтруктураНоменклатуры.Объект.Объект) = Тип("СправочникСсылка.Пользователи") Тогда
						Попытка 
							ЭтаФорма.Менеджер = СтруктураНоменклатуры.Объект.Объект.Сотрудник;
						Исключение
						КонецПопытки;
					КонецЕсли; 
					дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
				Иначе
					//Документ не умеет обрабатывать объекты других типов
					Возврат Ложь;
				КонецЕсли; 
			ИначеЕсли обЗначениеНеЗаполнено(СтруктураНоменклатуры) Тогда
				ПредставлениеДанных = ?(ЗначениеЗаполнено(КодМаркировки), Сред(КодМаркировки, 6, 13), Данные);
				Если ОбПраво("ВыводитьПредупреждениеПриСканированииНеНайденнойНоменклатуры") Тогда
					Предупреждение("Штрихкод " + ПредставлениеДанных + " не найден!",5);
				КонецЕсли;
				Если ЗначениеЗаполнено(КодМаркировки) Тогда
					Сообщить("Штрихкод " + ПредставлениеДанных + " не найден с кодом маркировки:");
					Сообщить(КодМаркировки);
				Иначе
					Сообщить("Штрихкод " + ПредставлениеДанных + " не найден!");
				КонецЕсли;
				Возврат Ложь;
			Иначе
				Возврат Ложь;
			КонецЕсли; 
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции // дкФормаВнешнееСобытие()

// Общий обработчик события ПриИзмененииДанных формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПриИзмененииДанных(ЭтаФорма) Экспорт
	
	Результат = Истина;
	
	// обновим подписи на гиперссылках
	Попытка 
		дкВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
	Исключение
	КонецПопытки;
	
	Возврат Результат; 	
КонецФункции // дкФормаПриИзмененииДанных()

// Общий обработчик события ПередЗаписью формы документа 
//
// Параметры:
// ЭтаФорма  - форма, форма переданного документа
// Отказ   - булево, признак отказа записи документа
// РежимЗаписи - режимЗаписиДокумента, Режим записи документа. Позволяет определить -
//	     выполняется запись, проведение или отмена проведения.
// РежимПроведения - РежимПроведенияДокумента. Позволяет определить, выполняется 
//      оперативное проведение или нет.
// Маска   - строка, разрешение проверки прав
//      1 - проверять / 0 - не проверять
//      биты:
//      1 - Проверка пользователя 
//      2 - Проверка подразделения
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПередЗаписью(ЭтаФорма, Отказ, РежимЗаписи, РежимПроведения, ПраваПользователя = Неопределено, Маска = "11") Экспорт
	
	Результат = Истина;
	
	// Перед записью проверим на права настройки на изменение автора и подразделения документа
	//на текущие значения (текущего пользователя и/или его подразделение)
	//При установленном режиме Спрашивать выведем запрос пользователю (сразу на оба реквизита если что)
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	Если (ПраваПользователя = НЕОПРЕДЕЛЕНО) Тогда
		Попытка 
			ПраваПользователя = ЭтотОбъект.Права;
		Исключение
		КонецПопытки; 
	КонецЕсли;
	// определим текущего пользователя и его подразделение
	Пользователь = ПараметрыСеанса.Пользователь;
	Подразделение = ПараметрыСеанса.ПодразделениеКомпании;
	
	// обновим права и настройки пользователя, так как они могли изменится в другом сеансе
	// проверим, что у нас в режиме работы пользователя
	СтруктураОтбора = Новый Структура("Пользователь,НомерСоединения,Режим",
	Пользователь,НомерСоединенияИнформационнойБазы(),3);
	Ресурсы = РегистрыСведений.РежимыРаботыПользователей.Получить(СтруктураОтбора);	
	Если ЗначениеЗаполнено(Ресурсы.Начало) Тогда
		// Были обновлены права пользователя (глПрава) - необходимо пересчитывание кэша прав объекта
		Попытка 
			Состояние("Обновляю права для документа " + ЭтаФорма.Заголовок);
			глПрава = обПолучитьПраваИНастройкиПользователя(Пользователь);
			ЭтаФорма.Права = глПрава;
			ПраваПользователя = глПрава;
		Исключение
		КонецПопытки; 
	КонецЕсли;
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	Если (ПраваПользователя = НЕОПРЕДЕЛЕНО) Тогда
		Попытка 
			ПраваПользователя = ЭтотОбъект.Права;
		Исключение
		КонецПопытки; 
	КонецЕсли;
	
	// проверяем изменился ли реквизит Автор
	ПользовательДругой = Ложь;
	Если обЗначениеНеЗаполнено(ЭтотОбъект.Автор) Тогда
		ЭтотОбъект.Автор = Пользователь;
	ИначеЕсли (ЭтотОбъект.Автор <> Пользователь) Тогда
		ПользовательДругой = Истина;
		РежимПоПользователю = обПраво("ПерезаписьАвтора",ПраваПользователя,,ЭтотОбъект);
	КонецЕсли;
	// проверяем изменился ли реквизит Подразделение	
	ПодразделениеДругое = Ложь;
	Если обЗначениеНеЗаполнено(ЭтотОбъект.ПодразделениеКомпании) Тогда
	ИначеЕсли (ЭтотОбъект.ПодразделениеКомпании <> Подразделение) Тогда
		ПодразделениеДругое = Истина;
		РежимПоПодразделению = обПраво("ПерезаписьПодразделения",ПраваПользователя,,ЭтотОбъект);
	КонецЕсли;
	
	СпроситьПроРеквизиты = "";
	ОбновимАвтоматически = "";
	// проверки по автору документа
	Если ПользовательДругой Тогда
		//проверим маску
		Если Булево(Число(Сред(Маска,1,1))) Тогда
			// то в зависимости от установленного режима... 
			Если 	 (РежимПоПользователю = Перечисления.ВариантыОтветов.Да) Тогда
				// меняем без разговоров
				ОбновитьПользователя = Истина;
				ОбновимАвтоматически = " < Автор > "
			ИначеЕсли (РежимПоПользователю = Перечисления.ВариантыОтветов.Нет) Тогда
				// не трогаем текущее значение 
				ОбновитьПользователя = Ложь;
			ИначеЕсли (РежимПоПользователю = Перечисления.ВариантыОтветов.Спрашивать) Тогда
				// придется спрашивать пользователя что делать
				СпроситьПроРеквизиты = " < Автор > ";
				ОбновитьПользователя = НЕОПРЕДЕЛЕНО;
			КонецЕсли;
		Иначе
			ОбновитьПользователя = Ложь;
		КонецЕсли;
	Иначе // не будем обновлять
		ОбновитьПользователя = Ложь;
	КонецЕсли;
	// проверки по Подразделению документа
	Если ПодразделениеДругое Тогда
		//проверим маску
		Если Булево(Число(Сред(Маска,2,1))) Тогда
			// то в зависимости от установленного режима... 
			Если 	 (РежимПоПодразделению = Перечисления.ВариантыОтветов.Да) Тогда
				// меняем без разговоров
				ОбновитьПодразделение = Истина;
				ОбновимАвтоматически = ?(ОбновимАвтоматически = ""," < Подразделение > ",ОбновимАвтоматически + " и < Подразделение > ");
			ИначеЕсли (РежимПоПодразделению = Перечисления.ВариантыОтветов.Нет) Тогда
				// не трогаем текущее значение 
				ОбновитьПодразделение = Ложь;
			ИначеЕсли (РежимПоПодразделению = Перечисления.ВариантыОтветов.Спрашивать) Тогда
				// придется спрашивать пользователя что делать
				СпроситьПроРеквизиты = ?(СпроситьПроРеквизиты = ""," < Подразделение > ",СпроситьПроРеквизиты + " и < Подразделение > ");
				ОбновитьПодразделение = НЕОПРЕДЕЛЕНО;
			КонецЕсли;
		Иначе
			ОбновитьПодразделение = Ложь;
		КонецЕсли;
	Иначе // не будем обновлять
		ОбновитьПодразделение = Ложь;
	КонецЕсли;
	
	// Если нужно спросить хотя бы про один из реквизитов зададим вопрос пользователю
	Если (СпроситьПроРеквизиты <> "") Тогда
		ВопросВЕдинственномЧисле = (ОбновитьПользователя <> Неопределено) ИЛИ (ОбновитьПодразделение <> Неопределено);
		Если ВопросВЕдинственномЧисле Тогда
			ТекстаВопроса = "Cледующий реквизит документа не соответствуют текущему пользователю:" + Символы.ПС + 
			?(ОбновитьПользователя = Неопределено,"Автор: " + ЭтотОбъект.Автор + Символы.ПС,"") + 
			?(ОбновитьПодразделение = Неопределено,"Подразделение: " + ЭтотОбъект.ПодразделениеКомпании + Символы.ПС,"") + 
			"
			|Установить значение текущего пользователя?
			|Да - будет установлено значение текущего пользователя;
			|Нет - останется значение указанное в документе;
			|Отмена - операция записи документа будет отменена.";
		Иначе
			ТекстаВопроса = "Cледующие реквизиты документа не соответствуют текущему пользователю:" + Символы.ПС + 
			?(ОбновитьПользователя = Неопределено,"Автор: " + ЭтотОбъект.Автор + Символы.ПС,"") + 
			?(ОбновитьПодразделение = Неопределено,"Подразделение: " + ЭтотОбъект.ПодразделениеКомпании + Символы.ПС,"") + 
			"
			|Установить значения текущего пользователя?
			|Да - будут установлены значения текущего пользователя;
			|Нет - останутся значения указанные в документе;
			|Отмена - операция записи документа будет отменена.";
		КонецЕсли;
		ОтветПользователя = Вопрос(ТекстаВопроса,РежимДиалогаВопрос.ДаНетОтмена,
									,КодВозвратаДиалога.Да, ЭтаФорма.Заголовок);
		Если (ОтветПользователя = КодВозвратаДиалога.Таймаут) Тогда
			ОтветПользователя = КодВозвратаДиалога.Да;
		КонецЕсли;
		// обработаем ответ пользователя расставив флаги что нужно менять
		Если (ОтветПользователя = КодВозвратаДиалога.Да) Тогда
			ОбновитьПользователя = ?(ОбновитьПользователя = НЕОПРЕДЕЛЕНО,Истина,ОбновитьПользователя);
			ОбновитьПодразделение = ?(ОбновитьПодразделение = НЕОПРЕДЕЛЕНО,Истина,ОбновитьПодразделение);
		ИначеЕсли (ОтветПользователя = КодВозвратаДиалога.Нет) Тогда
			ОбновитьПользователя = ?(ОбновитьПользователя = НЕОПРЕДЕЛЕНО,Ложь,ОбновитьПользователя);
			ОбновитьПодразделение = ?(ОбновитьПодразделение = НЕОПРЕДЕЛЕНО,Ложь,ОбновитьПодразделение);
		ИначеЕсли (ОтветПользователя = КодВозвратаДиалога.Отмена) Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда
		// теперь меняем что нужно изменить
		Если ОбновитьПользователя Тогда
			ЭтотОбъект.Автор = Пользователь;
		КонецЕсли;
		Если ОбновитьПодразделение Тогда
			ЭтотОбъект.ПодразделениеКомпании = Подразделение;
			ЭтотОбъект.ОбработкаРеквизита("ПодразделениеКомпании",,ЭтаФорма);
		КонецЕсли;
		зфОрганизацияПодразделениеИндикация(ЭтаФорма);	
		// выведем сообщение если что-то поменяли без спроса и стоит такой режим чтобы сообщать
		Если (ОбновимАвтоматически <> "") И обПраво("ВыводитьСообщенияПроверкиПравДоступа",ПраваПользователя,,ЭтотОбъект) Тогда
			Сообщить("При записи документа < " + Строка(ЭтотОбъект) + " > были обновлены поля: " + ОбновимАвтоматически,СтатусСообщения.Информация); 
		КонецЕсли;
	КонецЕсли;
	
	//подготоим запись журнала регистрации
	Если НЕ Отказ И обПраво("ВестиЖурналИзмененийДокументов",ЭтаФорма.Права,,ЭтотОбъект) И НЕ ЭтаФорма.ЭтоНовый() И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И ЭтаФорма.Модифицированность() Тогда
		дкСформироватьЗаписьЖурналаРегистрации(ЭтаФорма);
	КонецЕсли;	
		
	Возврат Результат;  	
КонецФункции // дкФормаПередЗаписью()

// Общий обработчик события ПриЗаписи формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// Отказ  - булево, признак отказа открытия формы документа
// НовыйОбъект - булево, признак что записывается новый документ
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПриЗаписи(ЭтаФорма, Отказ, НовыйОбъект = Ложь) Экспорт
	// зарезервировано на будущее
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкФормаПриЗаписи()

// Общий обработчик события ПослеЗаписи формы документа 
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкФормаПослеЗаписи(ЭтаФорма) Экспорт
	Результат = Истина;
	
	// Выполним проверку права на утверждение (если используется подсистема утверждения)
	// и запретим проведение, если документ еще не проведен.
	ЭтотОбъект = ЭтаФорма.ЭтотОбъект;
	ВидДокумента = СокрЛП(ЭтотОбъект.Метаданные().Имя);
	Если дкПроверитьИспользованиеУтверждения(ВидДокумента,ЭтотОбъект.Права) Тогда
		СтатусДокумента = дкПолучитьСтатусДокумента(ЭтотОбъект.Ссылка);
		// получаем соответствие действий над объектов
		ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента,ЭтотОбъект.Права);
		ДокументПодготовлен = Ложь;
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Подготовлен",ДокументПодготовлен) Тогда
			// автоматически ставим статус Подготовлен для документа, не участвующего в утверждении
			Если ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен] Тогда
				Если НЕ ЗначениеЗаполнено(СтатусДокумента) Тогда
					дкОсновныеДействияФормыУтверждение(ЭтаФорма,"Подготовлен");
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	//Подменю, которое содержит кнопки печати
	Попытка
		//для документов
		КнопкаПечатьВыбор = ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ПечатьВыбор;
	Исключение
		Попытка
			//для АРМ Машинозаезд - временно
			КнопкаПечатьВыбор = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ПечатьВыбор;
		Исключение
			//для АРМ
			КнопкаПечатьВыбор=ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ПодменюДействия.Кнопки.ПечатьВыбор;
		КонецПопытки;
	КонецПопытки;
	
	// Формируем список доступных печатных форм
	дкСформироватьМенюВыбораПечатнойФормы(ЭтаФорма, ЭтотОбъект.Ссылка, КнопкаПечатьВыбор);
	ЭтаФорма.Модифицированность = Ложь;
	
	// установим доступность кнопок "Свойства", "Дерево документов", "Заметки" и "Картинки и файлы" на панели действий формы
	Попытка ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Свойства.Доступность = Истина; Исключение; КонецПопытки;
	Попытка ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.ДеревоДокумента.Доступность = Истина; Исключение; КонецПопытки;
	Попытка ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.КартинкиИФайлы.Доступность = Истина; Исключение; КонецПопытки;
	Попытка ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.кнЗаметки.Доступность = Истина; Исключение; КонецПопытки;
	
	дкВывестиЗаголовокСуммаДокумента(ЭтаФорма);
	дкВывестиЗаголовокФормы(ЭтаФорма);
	
	Попытка
		СкладКомпании=ЭтотОбъект.СкладКомпании;
		МоментВремени=ЭтотОбъект.МоментВремени();
	Исключение
	КонецПопытки; 
	Попытка
		зфЗаполнитьОстаткиНоменклатуры(ЭтотОбъект,СкладКомпании,МоментВремени);
	Исключение
	КонецПопытки; 
	
	Обработки.ПанельАРМФормыИПоследниеОбъекты.Создать().ЗарегистрироватьФорму(ЭтаФорма, ЭтаФорма.Ссылка, "Документ");
	
	// обновим подписи на гиперссылке "Взаиморасчеты".
	Попытка 
		дкВывестиЗаголовокВзаиморасчеты(ЭтаФорма);
	Исключение
	КонецПопытки;
	
	// перезаполним документ счет-фактура
	дкПерезаполнитьСчетФактуру(ЭтаФорма);
	
	дкШтрихКодированиеДокументов(ЭтотОбъект,ЭтаФорма.Права);
	
	// добавим кнопки отображения времени
	Попытка
		ПодменюВремя = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Найти("Время");
	Исключение
		ПодменюВремя = Неопределено;
	КонецПопытки;
	
	Если ПодменюВремя<>Неопределено Тогда
		// для ЗН исключение
		Если ТипЗнч(ЭтотОбъект) <> Тип("ДокументОбъект.ЗаказНаряд") Тогда
			Попытка
				КнопкаДаты = ПодменюВремя.Кнопки.Найти("ДатаСоздания");
				Если КнопкаДаты=Неопределено Тогда
					ПодменюВремя.Кнопки.Добавить("ДатаСоздания",ТипКнопкиКоманднойПанели.Действие,"Дата создания: " + ?(НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДатаСоздания),Строка(ЭтотОбъект.ДатаСоздания),"хх.хх.хх хх:хх:хх"));
				Иначе
					КнопкаДаты.Текст = "Дата создания: " + ?(НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДатаСоздания),Строка(ЭтотОбъект.ДатаСоздания),"хх.хх.хх хх:хх:хх");
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Попытка
				КнопкаДаты = ПодменюВремя.Кнопки.Найти("ДатаОперации");
				Если КнопкаДаты=Неопределено Тогда
					ПодменюВремя.Кнопки.Добавить("ДатаОперации",ТипКнопкиКоманднойПанели.Действие,"Дата операции: " + ?(НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДатаОперации),Строка(ЭтотОбъект.ДатаОперации),"хх.хх.хх хх:хх:хх"));
				Иначе
					КнопкаДаты.Текст ="Дата операции: " + ?(НЕ обЗначениеНеЗаполнено(ЭтотОбъект.ДатаОперации),Строка(ЭтотОбъект.ДатаОперации),"хх.хх.хх хх:хх:хх");
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Оповестить("ДокументФормаПослеЗаписи",ЭтотОбъект.Ссылка,ЭтаФорма);
	
	// Удалим корзины, которые были перемещены в документ
	дкУдалитьКорзиныПеремещенныеВДокумент(ЭтаФорма);
	
	//выполним запись об изменениях в документе в журнал регистрации
	дкЗафиксироватьЗаписьВЖурналеРегистрации(ЭтаФорма);
	
	//anton
	ТТ_Общий.ЗаписатьДополнительныеРеквизиты(ЭтаФорма);
	//anton
	
	Возврат Результат;  	
КонецФункции // дкФормаПослеЗаписи()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ФОРМ СПИСКОВ И ЖУРНАЛОВ ДОКУМЕНТОВ

// Общий обработчик события ПередОткрытием формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Отказ - булево, признак отказа от открытия документа
// СтандартнаяОбработка - Булево, признак стандартной обработки действия 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередОткрытием(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Попытка
		МетаданныеОбъекта=Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ДокументСписок));
		ПодсистемаАвтосалон=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Документооборот.Подсистемы.Автосалон;
		ПодсистемаТестДрайв=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.ТестДрайв;
		Если ПодсистемаАвтосалон.Состав.Содержит(МетаданныеОбъекта) ИЛИ ПодсистемаТестДрайв.Состав.Содержит(МетаданныеОбъекта) Тогда
			Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон",Истина) Тогда
				Отказ=Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		ПодсистемаУчетВзаимоотношенийСКлиентами=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.УчетныеБлоки.Подсистемы.УчетВзаимоотношенийСКлиентами;
		Если ПодсистемаУчетВзаимоотношенийСКлиентами.Состав.Содержит(МетаданныеОбъекта) Тогда
			Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаCRM",Истина) Тогда
				Отказ=Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		ПодсистемаТехосмотр=Метаданные.Подсистемы.СтруктураКонфигурации.Подсистемы.Документооборот.Подсистемы.Техосмотр;
		Если ПодсистемаТехосмотр.Состав.Содержит(МетаданныеОбъекта) Тогда
			Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаТехосмотр",Истина) Тогда
				Отказ=Истина;
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	// Может быть отраслевое переопределение функции модуля...
	Результат = орФормаПередОткрытием(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	Если Результат <> Неопределено Тогда
		Возврат Результат;
		
	Иначе
		Результат = Истина;
	КонецЕсли; 
	
	Попытка	ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права; Исключение ПраваПользователя = НЕОПРЕДЕЛЕНО; КонецПопытки;
	Попытка
		ОтношениеКРегламентированномуУчету = обПраво("ОтношениеКРегламентированномуУчету",ПраваПользователя,,ЭтаФорма.Отбор.Ссылка.Значение);
		Если ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрТолькоРегламентированныхДокументов Тогда
			ЭтаФорма.ДокументСписок.Отбор.РегламентированныйУчет.Значение = Истина;
			ЭтаФорма.ДокументСписок.Отбор.РегламентированныйУчет.Использование = Истина;
			ЭтаФорма.ЭлементыФормы.список.НастройкаОтбора.РегламентированныйУчет.Доступность = Ложь;
		ИначеЕсли ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.ПросмотрТолькоНеРегламентированныхДокументов Тогда
			ЭтаФорма.ДокументСписок.Отбор.РегламентированныйУчет.Значение = Ложь;
			ЭтаФорма.ДокументСписок.Отбор.РегламентированныйУчет.Использование = Истина;
			ЭтаФорма.ЭлементыФормы.список.НастройкаОтбора.РегламентированныйУчет.Доступность = Ложь;
		КонецЕсли;	
	Исключение
	КонецПопытки;	
	// Стандартная обработка
	удФормаПередОткрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//заполним доп. свойства формы документов
	удЗаполнитьДополнительныеДействияДокументов(ЭтаФорма);
	
	верс_ВерсионированиеОбъектов.верс_удЗаполнитьДополнительныеДействияДокументов(ЭтаФорма); //ЧалапАю БизТех 10.09.2024 - версионирование

	Возврат Результат;
	
КонецФункции // дкСписокПередОткрытием()

// Осуществляет заполнение отборов списка документов
//
// Параметры:
// ЭтаФорма - форма, форма списка документов
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокЗаполнитьОтборПоУмолчанию(ЭтаФорма) Экспорт
	
	Результат = Истина;
	ЭтоДокумент = Ложь;
	ЭтоЖурнал = Ложь;
	
	Попытка
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ДокументСписок));
		ЭтоДокумент = Истина;
	Исключение
	КонецПопытки;
	
	Попытка
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ЖурналДокументовСписок));
		ЭтоЖурнал = Истина;		
	Исключение
	КонецПопытки;
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	//Автор...
	//отбор по автору включается правом и устанавливается на списки документов (формы списка и выбора)
	Если обПраво("ФильтрацияДокументовПоПользователю") Тогда
		Если ЭтоДокумент Тогда 
			флОтборАвтор = ЭтаФорма.ДокументСписок.Отбор.Найти("Автор") <> Неопределено;	
			Если флОтборАвтор Тогда 
				ЭтаФорма.ДокументСписок.Отбор.Автор.Использование = Истина;
				ЭтаФорма.ДокументСписок.Отбор.Автор.ВидСравнения = ВидСравнения.Равно;
				ЭтаФорма.ДокументСписок.Отбор.Автор.Значение  = ПараметрыСеанса.Пользователь;
				ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Автор.Доступность=Ложь;
			КонецЕсли;
		ИначеЕсли ЭтоЖурнал Тогда
			флОтборАвтор = ЭтаФорма.ЖурналДокументовСписок.Отбор.Найти("Автор") <> Неопределено;	
			Если флОтборАвтор Тогда 
				ЭтаФорма.ЖурналДокументовСписок.Отбор.Автор.Использование = Истина;
				ЭтаФорма.ЖурналДокументовСписок.Отбор.Автор.ВидСравнения = ВидСравнения.Равно;
				ЭтаФорма.ЖурналДокументовСписок.Отбор.Автор.Значение  = ПараметрыСеанса.Пользователь;
				ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Автор.Доступность=Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//отбор по подразделению и организации включается правом и устанавливается на списки документов (формы списка и выбора)
	РежимФильтрации = обПраво("ФильтрацияСправочниковПриВыборе",,,ЭтаФорма.Отбор.Ссылка.Значение);
	Если РежимФильтрации = Перечисления.РежимФильтрации.НеФильтровать Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЭтоДокумент Тогда 
		//Организация...
		флОтборОрганизация = ЭтаФорма.ДокументСписок.Отбор.Найти("Организация") <> Неопределено И (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизации ИЛИ РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению);
		Если флОтборОрганизация Тогда //в отборе есть организация
			ЭтаФорма.ДокументСписок.Отбор.Организация.Использование = Истина;
			ЭтаФорма.ДокументСписок.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.ДокументСписок.Отбор.Организация.Значение  = ПараметрыСеанса.Организация;
			ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Организация.Доступность = Ложь;
			Попытка
				ЭтаФорма.ЭлементыФормы.Организация.Доступность = Ложь;
			Исключение
			КонецПопытки;
		КонецЕсли;
		//Подразделение...
		флОтборПодразделение = ЭтаФорма.ДокументСписок.Отбор.Найти("ПодразделениеКомпании") <> Неопределено И (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоПодразделению ИЛИ РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению);
		//БИЗТЕХ КОВАЛЬ 12.05.2025 ++
		//Доступ к подразделениям расширенный
		флОтборДоступКПодразделениям = ЭтаФорма.ДокументСписок.Отбор.Найти("ДоступКПодразделениям") <> Неопределено И (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоПодразделению ИЛИ РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению);
		Если флОтборДоступКПодразделениям Тогда
			ЭтаФорма.ДокументСписок.Отбор.ДоступКПодразделениям.Использование = Истина; 
			ЭтаФорма.ДокументСписок.Отбор.ДоступКПодразделениям.ВидСравнения = ВидСравнения.ВСписке; 
			ЭтаФорма.ДокументСписок.Отбор.ДоступКПодразделениям.Значение  = ТТ_Общий.ПолучитьСписокДоступныхПодразделений(ПараметрыСеанса.Пользователь);
			
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.ДоступКПодразделениям.Доступность = Ложь;
				Попытка
					ЭтаФорма.ЭлементыФормы.ДоступКПодразделениям.Доступность = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;  
		//БИЗТЕХ КОВАЛЬ 12.05.2025 -- 
		ИначеЕсли флОтборПодразделение Тогда
			ЭтаФорма.ДокументСписок.Отбор.ПодразделениеКомпании.Использование = Истина;
			
			//бизтех++   
			
			//ЭтаФорма.ДокументСписок.Отбор.ПодразделениеКомпании.ВидСравнения = ВидСравнения.Равно; 
			ЭтаФорма.ДокументСписок.Отбор.ПодразделениеКомпании.ВидСравнения = ВидСравнения.ВСписке; 
			
			//ЭтаФорма.ДокументСписок.Отбор.ПодразделениеКомпании.Значение  = ПараметрыСеанса.ПодразделениеКомпании; 
			ЭтаФорма.ДокументСписок.Отбор.ПодразделениеКомпании.Значение  = ТТ_Общий.ПолучитьСписокДоступныхПодразделений(ПараметрыСеанса.Пользователь);
			
			//ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.ПодразделениеКомпании.Доступность = Ложь;
			//Попытка
			//	ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Доступность = Ложь;
			//Исключение
			//КонецПопытки;
			
			Если НЕ РольДоступна("ПолныеПрава") И НЕ обПраво("РазрешитьИзменениеФильтрацииСправочников") Тогда
				ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.ПодразделениеКомпании.Доступность = Ложь;
				Попытка
					ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Доступность = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;  
			
			//бизтех--
			
		КонецЕсли;
	ИначеЕсли ЭтоЖурнал Тогда
		//Организация...
		флОтборОрганизация = ЭтаФорма.ЖурналДокументовСписок.Отбор.Найти("Организация") <> Неопределено И (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизации ИЛИ РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению);
		Если флОтборОрганизация Тогда //в отборе есть организация
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Организация.Использование = Истина;
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Организация.Значение  = ПараметрыСеанса.Организация;
			ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Организация.Доступность = Ложь;
			Попытка
				ЭтаФорма.ЭлементыФормы.Организация.Доступность = Ложь;
			Исключение
			КонецПопытки;
		КонецЕсли;
		//Подразделение...
		флОтборПодразделение = ЭтаФорма.ЖурналДокументовСписок.Отбор.Найти("Подразделение") <> Неопределено И (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоПодразделению ИЛИ РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению);
		Если флОтборПодразделение Тогда
			
			//++бизтех++ 
			
			//anton   
			
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Подразделение.Использование = Истина;
			//ЭтаФорма.ЖурналДокументовСписок.Отбор.Подразделение.ВидСравнения = ВидСравнения.Равно;
			//ЭтаФорма.ЖурналДокументовСписок.Отбор.Подразделение.Значение  = ПараметрыСеанса.ПодразделениеКомпании;
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Подразделение.ВидСравнения = ВидСравнения.ВСписке;
			ЭтаФорма.ЖурналДокументовСписок.Отбор.Подразделение.Значение  = ТТ_Общий.ПолучитьСписокДоступныхПодразделений(ПараметрыСеанса.Пользователь);
			//ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Подразделение.Доступность = Ложь;
			//Попытка
			//	ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Доступность = Ложь;
			//Исключение
			//КонецПопытки;
			
			Если НЕ РольДоступна("ПолныеПрава") И НЕ обПраво("РазрешитьИзменениеФильтрацииСправочников") Тогда
				ЭтаФорма.ЭлементыФормы.Список.НастройкаОтбора.Подразделение.Доступность = Ложь;
				Попытка
					ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Доступность = Ложь;
				Исключение
				КонецПопытки;
			КонецЕсли;  
			
			//--бизтех--
			
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;   	
КонецФункции // дкСписокЗаполнитьОтборПоУмолчанию()

// Общий обработчик события ПриОткрытии формы списка документов 
//
// Параметры:
// ЭтаФорма 		 - форма, форма переданного списка документов
// ПовторноеОткрытие - булево, признак повторного открытия
// СтруктураОтбора - Структура, структура отборов документов в списке (используется для вершней панели отборов списка)
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриОткрытии(ЭтаФорма, ПовторноеОткрытие = Ложь, СтруктураОтбора = Неопределено) Экспорт
	
	Результат = Истина;
	
	// общие действия форм списков при открытии
	удФормаПриОткрытии(ЭтаФорма);
	
	// Подключим обработку изменения отборов форм списков документов
	Попытка
		Если ЭтаФорма.Отбор.Найти("Организация") = Неопределено 
			И ЭтаФорма.Отбор.Найти("Подразделение") = Неопределено Тогда
			//ничего
		Иначе
			ЭтаФорма.ПодключитьОбработчикИзмененияДанных("Отбор","СписокПриИзмененииОтбора",Истина);
		КонецЕсли;
	Исключение
	КонецПопытки;
		
	//установим отбор
	дкСписокЗаполнитьОтборПоУмолчанию(ЭтаФорма);
	
	Если ЭтаФорма.РежимВыбора и (СтруктураОтбора <> Неопределено) Тогда
		РежимФильтрации = обПраво("ФильтрацияСправочниковПриВыборе",,,ЭтаФорма.Отбор.Ссылка.Значение);
		Для каждого ПараметрОтбора Из СтруктураОтбора Цикл
			//Проверим необходимость фильтрации по организации и подразделению
			Если ПараметрОтбора.Ключ = "Организация" Тогда
				Если НЕ ((РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизации) ИЛИ (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению)) Тогда
					Продолжить;
				КонецЕсли; 
			ИначеЕсли ПараметрОтбора.Ключ = "ПодразделениеКомпании" Тогда
				Если НЕ ((РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоПодразделению) ИЛИ (РежимФильтрации = Перечисления.РежимФильтрации.ФильтроватьПоОрганизацииИПодразделению)) Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли;
			//Проверим наличие такого отбора в справочнике
			Если ЭтаФорма.ДокументСписок.Отбор.Найти(ПараметрОтбора.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ПараметрОтбора.Значение) = Тип("СписокЗначений") Тогда
				ЭтаФорма.ДокументСписок.Отбор[ПараметрОтбора.Ключ].ВидСравнения = ВидСравнения.ВСписке;
			Иначе
				ЭтаФорма.ДокументСписок.Отбор[ПараметрОтбора.Ключ].ВидСравнения = ВидСравнения.Равно;
			КонецЕсли; 
			ЭтаФорма.ДокументСписок.Отбор[ПараметрОтбора.Ключ].Значение = ПараметрОтбора.Значение;
			ЭтаФорма.ДокументСписок.Отбор[ПараметрОтбора.Ключ].Использование = Истина;
		КонецЦикла;
		// Сбрасываем отборы
		СтруктураОтбора = Неопределено;
	КонецЕсли;
	
	//Установим сортировку
	Попытка
		ИмяПараметра = СокрЛП(ЭтаФорма.ДокументСписок) + ".Порядок";
		ПорядокДокументов = ВосстановитьЗначение(ИмяПараметра);
		Если ПорядокДокументов <> Неопределено Тогда
			ЭтаФорма.ЭлементыФормы.Список.Значение.Порядок.Очистить();
			ЭтаФорма.ЭлементыФормы.Список.Значение.Порядок.Установить(ПорядокДокументов);
		КонецЕсли; 
	Исключение
	КонецПопытки;
	
	Возврат Результат;  	
КонецФункции // дкСписокПриОткрытии()
	
// Общий обработчик события ПриПовторномОткрытии формы списка документов 
//
// Параметры:
// ЭтаФорма 			 - форма, форма переданного списка документов
// СтандартнаяОбработка - булево, признак стандартной обработки
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриПовторномОткрытии(ЭтаФорма, СтандартнаяОбработка) Экспорт  	
	Возврат дкСписокПриОткрытии(ЭтаФорма,Истина);  	
КонецФункции // дкСписокПриПовторномОткрытии()

// Общий обработчик события ОбновлениеОтображения формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокОбновлениеОтображения(ЭтаФорма) Экспорт
	// Зарезервировано на будущее
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкСписокОбновлениеОтображения()

// Общий обработчик события ПередЗакрытием формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Отказ - булево, признак отказа закрытия формы документа
// СтандартнаяОбработка - булево, признак стандартной обработки
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Результат = Истина;
	
	//Попытка // Проверим сами закрываемся или нас закрывают "снаружи"
	//	ВнешняяКомпонентаПодключена = Обработки.Защита.Создать().Компонента.УправлениеАктивно();
	//Исключение 
	//	ВнешняяКомпонентаПодключена = Ложь;
	//КонецПопытки;
	//Если НЕ ВнешняяКомпонентаПодключена Тогда
	//	СтандартнаяОбработка = Ложь; // Аварийное закрытие - нельзя что-либо спрашивать!
	//КонецЕсли;
	
	Возврат Результат;  	
КонецФункции // дкСписокПередЗакрытием()

// Общий обработчик события ПриЗакрытии формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриЗакрытии(ЭтаФорма) Экспорт
	
	Результат = Истина;
	
	Попытка
		ПорядокСписка = "";
		Для каждого ЭлементПорядка Из ЭтаФорма.ЭлементыФормы.Список.Значение.Порядок Цикл
			ПорядокСписка = ПорядокСписка + ЭлементПорядка.ПутьКДанным;
			Если ЭлементПорядка.Направление = НаправлениеСортировки.Возр Тогда
				ПорядокСписка = ПорядокСписка + " Возр";
			ИначеЕсли ЭлементПорядка.Направление = НаправлениеСортировки.Убыв Тогда
				ПорядокСписка = ПорядокСписка + " Убыв";
			КонецЕсли; 
			ПорядокСписка = ПорядокСписка + ",";
		КонецЦикла; 
		ПорядокСписка = Лев(ПорядокСписка,СтрДлина(ПорядокСписка)-1);
		
		ИмяПараметра = СокрЛП(ЭтаФорма.ДокументСписок) + ".Порядок";
		СохранитьЗначение(ИмяПараметра,ПорядокСписка);
	Исключение
	КонецПопытки;
	Обработки.ПанельАРМФормыИПоследниеОбъекты.Создать().УдалитьИзДереваФорм(ЭтаФорма);
	
	Возврат Результат;   	
КонецФункции // дкСписокПриЗакрытии()

// Общий обработчик события ОбработкаВыбора формы списка документов 
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного списка документов
// ЗначениеВыбора - ДокументСсылка, выбранный документ из списка 
// Источник	 - Форма, источник события. 
//      
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокОбработкаВыбора(ЭтаФорма, ЗначениеВыбора, Источник) Экспорт
	// Зарезервировано на будущее
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкСписокОбработкаВыбора()

// Общий обработчик события ОбработкаАктивизацииОбъекта формы списка документов 
//
// Параметры:
// ЭтаФорма 	 - форма, форма переданного списка документов
// АктивныйОбъект - ДокументСсылка, текущий документ из списка 
// Источник	 - Форма, источник события. 
//      
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокОбработкаАктивизацииОбъекта(ЭтаФорма, АктивныйОбъект, Источник) Экспорт
	// Зарезервировано на будущее
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкСписокОбработкаАктивизацииОбъекта()

// Общий обработчик события ОбработкаЗаписиНовогоОбъекта формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Объект 	 - ДокументСсылка, текущий документ из списка 
// Источник - Форма, источник события. 
//      
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокОбработкаЗаписиНовогоОбъекта(ЭтаФорма, Объект, Источник) Экспорт
	
	Результат = Истина;
	
	Попытка ЭтаФорма.ЭлементыФормы.Список.ТекущаяСтрока = Объект.Ссылка;
	Исключение КонецПопытки;
	
	Возврат Результат; 	
КонецФункции // дкСписокОбработкаЗаписиНовогоОбъекта()

// Общий обработчик события ОбработкаОповещения формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// ИмяСобытия - Строка, имя полученного события
// Параметр - Произвольный, переданный параметр оповещения
// Источник - Форма, источник события. 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = "ЗаполнитьСписокУтверждение" Тогда
		ТекСтрока = ЭтаФорма.ЭлементыФормы.Список.ТекущиеДанные;
		Если ТекСтрока <> Неопределено Тогда
			Если Параметр.Ссылка = ТекСтрока.Ссылка Тогда
				// выполнили утверждение документа - изменим состав действий (кнопок)
				Попытка
					ПраваПользователя=Параметр.Права;
				Исключение
					ПраваПользователя=Обработки.Защита.Создать().Права;
				КонецПопытки; 
				дкЗаполнитьСписокУтверждение(ЭтаФорма, ТекСтрока.Ссылка, ПраваПользователя, Истина);
			КонецЕсли; 
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбновилисьЗаметки" Тогда
		Попытка
			ТекСтрока = ЭтаФорма.ЭлементыФормы.Список.ТекущаяСтрока;
		Исключение
			ТекСтрока = Неопределено;
		КонецПопытки;
		
		удОбновитьКартинкуЗаметок(ТекСтрока, ЭтаФорма);
	КонецЕсли; 
	
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкСписокОбработкаОповещения()

// Общий обработчик события ВнешнееСобытие формы списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Источник - Строка, источник внешнего события. 
// Событие - строка, Наименование события.
// Данные - строка, Данные для события. 
//      
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокВнешнееСобытие(ЭтаФорма, Источник, Событие, Данные) Экспорт
	ВводДоступен = ЭтаФорма.ВводДоступен();
	
	Если ВводДоступен И Источник = "Сканер" Тогда
		Документ = Обработки.ШтрихКоды.Создать().НайтиПоШтрихКоду(Данные);
		Если НЕ обЗначениеНеЗаполнено(Документ) Тогда
			Попытка
				ЭтаФорма.ЭлементыФормы.Список.ТекущаяСтрока = Документ;
			Исключение
			КонецПопытки; 
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ВводДоступен;
КонецФункции // дкСписокВнешнееСобытие()   

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ТАБЛИЦЫ ФОРМ СПИСКОВ И ЖУРНАЛОВ ДОКУМЕНТОВ

// Кэширование автомобилей и VIN для вывода в списке при получении данных
//
// Параметры:
//  ЭтаФорма		- форма, форма переданного списка документов
//  Элемент			- редактируемое табличное поле
//	ТекущийДокумент - ДокументСсылка - Документ в текущей строке списка или пустая ссылка
Процедура дкСписокОбновитьКэшАвтомобилей(ЭтаФорма, КэшДокументов, ТекущийДокумент=Неопределено) Экспорт
	
	ВыводитьVIN = ЭтаФорма.ЭлементыФормы.Список.Колонки.VIN.Видимость;
	Попытка
		ВыводитьГосНомер = ЭтаФорма.ЭлементыФормы.Список.Колонки.ГосНомер.Видимость;
	Исключение
		ВыводитьГосНомер = Ложь;
	КонецПопытки;
	Если ЭтаФорма.ЭлементыФормы.Список.Колонки.Автомобиль.Данные="" Тогда
		ВыводитьАвтомобиль = ЭтаФорма.ЭлементыФормы.Список.Колонки.Автомобиль.Видимость;
	Иначе
		ВыводитьАвтомобиль=Ложь;
	КонецЕсли;
	Если НЕ ВыводитьVIN И НЕ ВыводитьАвтомобиль И НЕ ВыводитьГосНомер Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос();
	ИскатьВКэше = ЗначениеЗаполнено(ТекущийДокумент);
	ТаблицаОбъекта = "";
	ТекстЗапроса = "";
	
	//нужно определить, где содержится автомобиль, в шапке или в табличной части
	МетаданныеОбъекта = ТекущийДокумент.Метаданные();
	АвтомобильВТаблице = Ложь;
	Если МетаданныеОбъекта.Реквизиты.Найти("Автомобиль")<>Неопределено Тогда
		ТаблицаОбъекта = МетаданныеОбъекта.ПолноеИмя();		
	Иначе
		ТЧАвтомобили = МетаданныеОбъекта.ТабличныеЧасти.Найти("Автомобили");
		Если ТЧАвтомобили<>Неопределено И ТЧАвтомобили.Реквизиты.Найти("Автомобиль")<>Неопределено Тогда
			АвтомобильВТаблице = Истина;
			ТаблицаОбъекта = МетаданныеОбъекта.ПолноеИмя() + ".Автомобили";
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(ТаблицаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИскатьВКэше Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	ТаблицаОбъекта.Ссылка КАК Ссылка,
		|	ТаблицаОбъекта.Автомобиль КАК Автомобиль
		|ПОМЕСТИТЬ
		|	ТаблицаОбъекта
		|ИЗ
		|	"+ТаблицаОбъекта+" КАК ТаблицаОбъекта
		|ГДЕ
		|	ТаблицаОбъекта.Ссылка = &Ссылка
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаОбъекта.Ссылка КАК Ссылка,
		|	ТаблицаОбъекта.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(ТаблицаАвтомобили.Период, ДатаВремя(1, 1, 1))) КАК Период
		|ПОМЕСТИТЬ
		|	ТаблицаСрезПоследних
		|ИЗ
		|	ТаблицаОбъекта КАК ТаблицаОбъекта
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Автомобили КАК ТаблицаАвтомобили
		|ПО
		|	ТаблицаОбъекта.Автомобиль = ТаблицаАвтомобили.Автомобиль И 
		|	ТаблицаАвтомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаОбъекта.Ссылка,
		|	ТаблицаОбъекта.Автомобиль
		|;
		|
		|ВЫБРАТЬ
		|	ТаблицаОбъекта.Ссылка КАК Ссылка,
		|	ТаблицаОбъекта.Автомобиль КАК Автомобиль,
		|	ТаблицаОбъекта.Автомобиль.VIN КАК VIN,
		|	ЕСТЬNULL(ТаблицаАвтомобили.Значение, """") КАК ГосНомер
		|ИЗ
		|	ТаблицаСрезПоследних КАК ТаблицаОбъекта
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.Автомобили КАК ТаблицаАвтомобили
		|ПО
		|	ТаблицаОбъекта.Период     = ТаблицаАвтомобили.Период И 
		|	ТаблицаОбъекта.Автомобиль = ТаблицаАвтомобили.Автомобиль И 
		|	ТаблицаАвтомобили.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)";
		
		Запрос.УстановитьПараметр("Ссылка",ТекущийДокумент);
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		|		ТаблицаОбъекта.Ссылка КАК Ссылка,
		|		ТаблицаОбъекта.Автомобиль КАК Автомобиль,
		|		ТаблицаОбъекта.Автомобиль.VIN КАК VIN,
		|		АвтомобилиСрезПоследних.Значение КАК ГосНомер
		|	ИЗ
		|		"+ТаблицаОбъекта+" КАК ТаблицаОбъекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК АвтомобилиСрезПоследних
		|	ПО ТаблицаОбъекта.Автомобиль = АвтомобилиСрезПоследних.Автомобиль";
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса + " 
		               |ИТОГИ
		               |ПО
		               |	Ссылка"; 

	Если КэшДокументов = Неопределено Тогда
		КэшДокументов=Новый ТаблицаЗначений;
		КэшДокументов.Колонки.Добавить("Ссылка");
		КэшДокументов.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		КэшДокументов.Колонки.Добавить("VIN",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		КэшДокументов.Колонки.Добавить("ГосНомер",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
		
		КэшДокументов.Индексы.Добавить("Ссылка");
	КонецЕсли;
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		
		//попробуем отыскать строку в кэше чтобы обновить данные
		Если ИскатьВКэше Тогда
			НайденнаяСтрока = КэшДокументов.Найти(ВыборкаИтоги.Ссылка,"Ссылка");
		КонецЕсли;
		
		//получим список автомобилей и их VIN-кодов
		СтрокаАвто     = "";
		СтрокаVIN      = "";
		СтрокаГосНомер = "";
		ВыборкаДетали = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			
			СтрокаАвто     = ?(ПустаяСтрока(СтрокаАвто),"",СтрокаАвто+", ");
			СтрокаVIN      = ?(ПустаяСтрока(СтрокаVIN),"",СтрокаVIN+", ");
			СтрокаГосНомер = ?(ПустаяСтрока(СтрокаГосНомер),"",СтрокаГосНомер+", ");
			
			//Бизтех Коваль 09.08.2024
			//Попытка ускорить открытие списка документов ЗН и зак на авто
			Если НЕ ЭтаФорма.Заголовок = "Заказ на автомобиль" И НЕ ЭтаФорма.Заголовок = "Заказ-наряд" Тогда
				СтрокаАвто     = СтрокаАвто + ВыборкаДетали.Автомобиль;
			КонецЕсли;
			СтрокаVIN      = СтрокаVIN + ВыборкаДетали.VIN;
			СтрокаГосНомер = СтрокаГосНомер+ ВыборкаДетали.ГосНомер;
			
		КонецЦикла;
		
		//помещаем в кэш
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрокаКэш = КэшДокументов.Добавить();
			НоваяСтрокаКэш.Ссылка      = ВыборкаИтоги.Ссылка; 
			НоваяСтрокаКэш.Автомобиль  = СтрокаАвто;
			НоваяСтрокаКэш.VIN         = СтрокаVIN;
			НоваяСтрокаКэш.ГосНомер    = СтрокаГосНомер;
		Иначе
			НайденнаяСтрока.Автомобиль = СтрокаАвто;
			НайденнаяСтрока.VIN        = СтрокаVIN;
			НайденнаяСтрока.ГосНомер   = СтрокаГосНомер;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры //дкСписокОбновитьКэшАвтомобилей()

// Вывод автомобиля и VIN в колонках списка документов при получении данных
//
// Параметры:
//  ЭтаФорма		- форма, форма переданного списка документов
//  Элемент		 	- редактируемое табличное поле
//  ОформленияСтрок - ОформлениеСтроки, содержит параметры оформления выводимой строки
//  ТекущийДокумент - ДокументСсылка - Документ в текущей строке списка
Процедура дкСписокАвтосалонВыводАвтомобиля(ЭтаФорма, Элемент, ОформленияСтрок, КэшДокументов) Экспорт
	
	Если ЭтаФорма.ЭлементыФормы.Список.Колонки.Автомобиль.Данные="" Тогда
		ВыводитьАвтомобиль = ЭтаФорма.ЭлементыФормы.Список.Колонки.Автомобиль.Видимость;
	Иначе
		ВыводитьАвтомобиль=Ложь;
	КонецЕсли;
	
	Если КэшДокументов=Неопределено ИЛИ КэшДокументов.Количество()=0 Тогда
		ВыводитьVIN = Ложь;
		ВыводитьАвтомобиль = Ложь;
		ВыводитьГосНомер = Ложь;
		ПоискСтрокиВТаблице = Ложь;
	Иначе
		ВыводитьVIN = Элемент.Колонки.VIN.Видимость;
		ВыводитьАвтомобиль = Элемент.Колонки.Автомобиль.Видимость;
		Попытка
			ВыводитьГосНомер = Элемент.Колонки.ГосНомер.Видимость;
		Исключение
			ВыводитьГосНомер = Ложь;
		КонецПопытки;
		Если Элемент.Колонки.Автомобиль.Данные<>"" Тогда
			ВыводитьАвтомобиль = Ложь;	
		КонецЕсли;
		ПоискСтрокиВТаблице = (ВыводитьVIN ИЛИ ВыводитьАвтомобиль ИЛИ ВыводитьГосНомер);
	КонецЕсли;
	
	Для Каждого ТекОформление Из ОформленияСтрок Цикл
		ТекДокумент = ТекОформление.ДанныеСтроки.Ссылка;
		Если ПоискСтрокиВТаблице Тогда
			//ищем строку в кэше, если не нашли - обновляем кэш
			СтрокаТаблицы = КэшДокументов.Найти(ТекДокумент,"Ссылка");
			Если СтрокаТаблицы = Неопределено Тогда
				дкСписокОбновитьКэшАвтомобилей(ЭтаФорма, КэшДокументов, ТекДокумент);
			КонецЕсли;
			//снова ищем строку в кэше, получаем значения и выводим в колоноки
			СтрокаТаблицы = КэшДокументов.Найти(ТекДокумент,"Ссылка");
			Если СтрокаТаблицы <> Неопределено Тогда
				Если ВыводитьVIN Тогда
					ТекОформление.Ячейки.VIN.ОтображатьТекст=Истина;
					ТекОформление.Ячейки.VIN.Текст=Строка(СтрокаТаблицы.VIN);
				КонецЕсли;
				Если ВыводитьАвтомобиль Тогда
					ТекОформление.Ячейки.Автомобиль.ОтображатьТекст=Истина;
					ТекОформление.Ячейки.Автомобиль.Текст=Строка(СтрокаТаблицы.Автомобиль);
				КонецЕсли;
				Если ВыводитьГосНомер Тогда
					ТекОформление.Ячейки.ГосНомер.ОтображатьТекст=Истина;
					ТекОформление.Ячейки.ГосНомер.Текст = Строка(СтрокаТаблицы.ГосНомер);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //дкСписокАвтосалонВыводАвтомобиля()

// Общий обработчик события Выбор табличного поля списка документов 
//
// Параметры:
// ЭтаФорма		- форма, форма переданного списка документов
// Элемент		 - редактируемое табличное поле
// ВыбраннаяСтрока - строка табличного поля
// Колонка			- КолонкаТабличногоПоля. Выбранная колонка табличного поля. 
// СтандартнаяОбработка - Булево, признак стандартной обработки действия 
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокВыбор(ЭтаФорма, Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка) Экспорт
	
	Результат = Истина;
	
	// если это колонка принадлежности к учету, то при установленном праве будем менять принадлежность
	// вместо открытия документа
	Если Колонка.ДанныеФлажка = "РегламентированныйУчет" Тогда
		Объект = Элемент.ТекущиеДанные.Ссылка.ПолучитьОбъект();
		Попытка 
			ПраваПользователя = Объект.Права; 
		Исключение
			ПраваПользователя = Неопределено;
		КонецПопытки;
		//ОтношениеКРегламентированномуУчету = обПраво("ОтношениеКРегламентированномуУчету",ПраваПользователя,,ЭтаФорма.Отбор.Ссылка.Значение);
		ОтношениеКРегламентированномуУчету = обПраво("ОтношениеКРегламентированномуУчету",ПраваПользователя,,Объект);
		Если ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.РедактированиеВсехДокументовИстина ИЛИ
			ОтношениеКРегламентированномуУчету = Перечисления.ОтношениеКРегламентированномуУчету.РедактированиеВсехДокументовЛожь Тогда
			СтандартнаяОбработка = Ложь;
			
			Попытка
				Объект.РегламентированныйУчет = Не Объект.РегламентированныйУчет;
				Объект.ОбменДанными.Загрузка = Истина;
				Объект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Результат;  	
КонецФункции // дкСписокВыбор()

// Общий обработчик события ПриАктивизацииСтроки табличного поля списка документов 
// может порождать оповещение форм для связывания подчиненных форм по текущему объекту
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Элемент - редактируемое табличное поле
// ВызыватьОповещение - булево, определяет наличие открытых оповещаемых форм для включения оповещений при активации
// строк списков должно передаваться значение глобальной переменной глОповещениеАктивации
// ПраваПользователя  – Соответствие - Кэш прав и настроек.
// ИмяСписка          - Строка - имя списка документов.
// ИмяКоманднойПанели - Строка - имя командной панели списка документов.
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриАктивизацииСтроки(ЭтаФорма, Элемент, ВызыватьОповещение = ложь, ПраваПользователя, ИмяСписка = Неопределено, ИмяКоманднойПанели = Неопределено) Экспорт
	
	Результат = Истина;
	
	// если список и командная панель не указаны то вызов из формы списка документа
	ДобовлятьПечатныеФормы=((ИмяСписка="Список" ИЛИ ИмяСписка=Неопределено) И (ИмяКоманднойПанели=Неопределено ИЛИ ИмяКоманднойПанели = "ОсновныеДействияФормы"));
	
	Если ДобовлятьПечатныеФормы Тогда
		дкСформироватьМенюВыбораПечатнойФормы(ЭтаФорма, ?(Элемент.ТекущаяСтрока=Неопределено, Неопределено, Элемент.ТекущаяСтрока.Ссылка));
	КонецЕсли;
	
	Если ВызыватьОповещение И (НЕ ЭтаФорма.МодальныйРежим) И (НЕ ЭтаФорма.РежимВыбора) Тогда
		Попытка
			Оповестить("АктивизированЭлемент",Элемент.ТекущиеДанные.Ссылка,ЭтаФорма);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	дкЗаполнитьСписокУтверждение(ЭтаФорма, , ПраваПользователя, Истина, ИмяСписка, ИмяКоманднойПанели);
	дкУстановитьДоступностьУтверждений(ЭтаФорма, Элемент,ИмяКоманднойПанели, ИмяСписка);
	
	
	// заметки
	Попытка
		Кнопка = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Найти("кнЗаметки");
	Исключение
		Кнопка = Неопределено;
	КонецПопытки;
	Если Кнопка <> Неопределено И Элемент.ТекущаяСтрока <> Неопределено Тогда
		Если НЕ Метаданные.РегистрыСведений.ЗаметкиПользователей.Измерения.Объект.Тип.СодержитТип(ТипЗнч(Элемент.ТекущаяСтрока.Ссылка)) Тогда
			Кнопка.Картинка = БиблиотекаКартинок.ЗаметкиСоздать;
			Кнопка.Доступность = Ложь;
			Возврат Результат;
		КонецЕсли;
		
		Кнопка.Доступность = Истина;
		// проверим наличие заметок
		НаборРегистра = РегистрыСведений.ЗаметкиПользователей.СоздатьНаборЗаписей();
		НаборРегистра.Отбор.Объект.ВидСравнения  = ВидСравнения.Равно;
		НаборРегистра.Отбор.Объект.Значение      = Элемент.ТекущаяСтрока;
		НаборРегистра.Отбор.Объект.Использование = Истина;
		НаборРегистра.Прочитать();
		
		Если НаборРегистра.Количество() > 0 Тогда
			Кнопка.Картинка = БиблиотекаКартинок.ЗаметкиПерейти;
		Иначе
			Кнопка.Картинка = БиблиотекаКартинок.ЗаметкиСоздать;
		КонецЕсли;
		Оповестить("ОбновитьОтборЗаметок", Элемент.ТекущаяСтрока, ЭтаФорма);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // дкСписокПриАктивизацииСтроки()

// Общий обработчик события ПриАктивизацииСтроки табличного поля журнала документов 
//
// Параметры:
// ЭтаФорма 		- форма, форма переданного документа
// ТекДанные 		- Текущие данные строки списка
// КэшПечатныхФорм - Структура, хранит печатные форму конкретного документа, полученного из "ТекДанные"
// ПодменюПечати - подменю командной панели, в котором создаются пункты с печатными формами
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокЖурналаПриАктивизацииСтроки(ЭтаФорма, ТекДанные, КэшПечатныхФорм, ПодменюПечати = Неопределено,ТекИмяСписка = "", ИмяКоманднойПанели = Неопределено) Экспорт
	
	Результат = Истина;
	
	ИмяКоманднойПанели = ?(ИмяКоманднойПанели = Неопределено, "ОсновныеДействияФормы", ИмяКоманднойПанели);
	
	Если ПодменюПечати = Неопределено Тогда
		ПодменюПечати = ЭтаФорма.ЭлементыФормы[ИмяКоманднойПанели].Кнопки.ПечатьВыбор;
	КонецЕсли;
	
	ПодменюПечати.Кнопки.Очистить();
	
	Если ТекДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		Ссылка = ТекДанные.Ссылка;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	дкСформироватьМенюВыбораПечатнойФормы(ЭтаФорма, Ссылка, ПодменюПечати);
	
	Возврат Результат;   	
КонецФункции // дкСписокЖурналаПриАктивизацииСтроки()

// Общий обработчик события ПередНачаломДобавления табличного поля списка документов 
//
// Параметры:
// ЭтаФорма 	- форма, форма переданного списка документов
// Элемент - табличное поле списка документов
// Отказ  - Булево, признак отказа от стандартной обработки 
// Копирование - булево, признак копирования документа
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование) Экспорт
	
	Результат = Истина;
	
	// при копировании ни от чего не отказываемся
	Если НЕ Копирование Тогда
		
		//определим что у нас за документ
		ЭтоСписокЖурналаДокументов = Ложь;
		Попытка
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ДокументСписок));
		Исключение
			Попытка
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ЭтаФорма.ЖурналДокументовСписок));
				ЭтоСписокЖурналаДокументов = Истина;
			Исключение 				
				Возврат Ложь;
			КонецПопытки; 
		КонецПопытки;
		
		//не нашли, выходим
		Если ОбъектМетаданных = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		//откажемся от стандартного
		Отказ = Истина;
		
		Попытка
			ЭтаФормаОтбор = ЭтаФорма.Отбор;	
		Исключение
			//исключение для АРМ Журнал заказ-нарядов
			ЭтаФормаОтбор = ЭтаФорма.ЖурналДокументовСписок.Отбор;	
		КонецПопытки;
		
		// Если это список журнала документов, то предварительно необходимо выбрать вид документа.
		Если ЭтоСписокЖурналаДокументов Тогда
			ЭлементОтбораВидДокумента = ЭтаФормаОтбор.Найти("ВидДокумента");
			Если (ЭлементОтбораВидДокумента <> Неопределено)И (ЭлементОтбораВидДокумента.Использование) И (Не обЗначениеНеЗаполнено(ЭлементОтбораВидДокумента.Значение)) Тогда
				ОбъектМетаданных = ЭлементОтбораВидДокумента.Значение;		
			Иначе	
				СписокВидовДокументов = Новый СписокЗначений;
				Для каждого ТекОбъектМетаданныхДокумент Из ОбъектМетаданных.РегистрируемыеДокументы Цикл 	
					СписокВидовДокументов.Добавить(ТекОбъектМетаданныхДокумент, ТекОбъектМетаданныхДокумент.Синоним);		
				КонецЦикла;
				СписокВидовДокументов.СортироватьПоПредставлению();
				Если СписокВидовДокументов.Количество() = 0 Тогда
					Возврат Ложь;
				ИначеЕсли СписокВидовДокументов.Количество() = 1 Тогда
					ОбъектМетаданных = СписокВидовДокументов[0].Значение;
				Иначе
					// Предложим пользователю выбрать.
					ВыбранныйЭлемент = СписокВидовДокументов.ВыбратьЭлемент("Выберите вид документа");
					Если ВыбранныйЭлемент = Неопределено Тогда
						Возврат Ложь;
					КонецЕсли;
					ОбъектМетаданных = ВыбранныйЭлемент.Значение;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НовыйЭлемент = Документы[ОбъектМетаданных.Имя].СоздатьДокумент();
		Попытка
			НоваяФорма = НовыйЭлемент.ПолучитьФорму(,Элемент);
		Исключение
			НоваяФорма = НовыйЭлемент.ПолучитьФорму();
		КонецПопытки; 
		
		НовыйЭлемент.Дата = НачалоДня(РабочаяДата);
		
		//Дадим пользователю заполнить ХозОперацию (если есть такой реквизит у документа)
		Если НЕ НовыйЭлемент.Метаданные().Реквизиты.Найти("ХозОперация") = Неопределено Тогда
			Если Не ЭтоСписокЖурналаДокументов Тогда
				ХозОперация = ЭтаФормаОтбор.Найти("ХозОперация");
			Иначе
				ХозОперация = ЭтаФормаОтбор.Найти("Операция");
			КонецЕсли;
			
			Если (ХозОперация <> Неопределено) И (ХозОперация.Использование) И (Не обЗначениеНеЗаполнено(ХозОперация.Значение)) И (ХозОперация.ВидСравнения = ВидСравнения.Равно) Тогда
				СписокХО = НовыйЭлемент.ПолучитьСписокХозОпераций();
				ПринадлежитСписку = Ложь;
				Для каждого ТекЭлементСписка Из СписокХО Цикл 	
					Если Справочники.ХозОперации[ТекЭлементСписка.Значение] = ХозОперация.Значение Тогда
						ПринадлежитСписку = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла; 
				Если ПринадлежитСписку Тогда
					НовыйЭлемент.ХозОперация = ХозОперация.Значение;
				Иначе
					Предупреждение("Установлен отбор по хоз. операции, не принадлежащей данному виду документа!");
					Возврат Ложь;
				КонецЕсли;
			Иначе
				Попытка 
					Права = НовыйЭлемент.Права;
				Исключение
					Права = Неопределено;
				КонецПопытки;
				СписокХО = НовыйЭлемент.ПолучитьСписокХозОпераций();
				ВыбХО = Неопределено;
				Если обПраво("ВыбиратьХозОперациюПриВводеНового",Права,,ЭтаФормаОтбор.Ссылка.Значение) Тогда
					// если стоит право на выбор хоз. операции при вводе нового документа, то откроем список для выбора
					Для Каждого ХО Из СписокХО Цикл
						Попытка 
							ХО.Представление = Справочники.ХозОперации[ХО.Значение].Наименование;
						Исключение
						КонецПопытки;
					КонецЦикла;
					// если хоз. операция всего одна, то и делать нечего, иначе выберем
					Если СписокХО.Количество() < 2 Тогда
						ВыбХО = СписокХО.Получить(0);
					Иначе
						ВыбХО = СписокХО.ВыбратьЭлемент("Выберите вид хозяйственной операции");
					КонецЕсли;
				Иначе
					// получим список хоз. операций документа
					Если СписокХО.Количество()=1 Тогда
						// у нас новый документ, с единственной возможной хоз. операцией. Присвоим.
						ВыбХО = СписокХО[0];
					Иначе
						// у нас новый документ, но много хоз. операций. Получим хоз. операцию по умолчанию
						Для Каждого ХО ИЗ СписокХО Цикл
							Если ХО.Пометка Тогда
								ВыбХО = ХО;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				// смотрим что выбрали
				Если ВыбХО = Неопределено Тогда
					Отказ = Истина;
					Возврат Результат;
				Иначе
					НовыйЭлемент.ХозОперация = Справочники.ХозОперации[ВыбХО.Значение];
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//если отбор установлен, будем заполнять реквизиты
		Для Каждого ЭлементОтбора Из ЭтаФормаОтбор Цикл
			Если (Не обЗначениеНеЗаполнено(ЭлементОтбора.Значение)) И (ЭлементОтбора.Использование) Тогда
				ИмяРеквизита = ЭлементОтбора.Имя;
				Если ИмяРеквизита <> "Ссылка" И ИмяРеквизита <> "Номер" И ИмяРеквизита <> "Дата" И ИмяРеквизита <> "Автор" И ИмяРеквизита <> "ХозОперация" И ИмяРеквизита <> "Операция" Тогда
					Если (ИмяРеквизита = "Подразделение") И ЭтоСписокЖурналаДокументов Тогда
						ИмяРеквизита = "ПодразделениеКомпании";		
					КонецЕсли;
					Попытка
						Если ОбъектМетаданных.Реквизиты[ИмяРеквизита].Тип.СодержитТип(ТипЗнч(ЭлементОтбора.Значение)) Тогда
							НоваяФорма.ЭтотОбъект[ИмяРеквизита] = ЭлементОтбора.Значение;
							//НоваяФорма.ЭтотОбъект.ОбработкаРеквизита(ИмяРеквизита,,НоваяФорма);
						КонецЕсли; 
					Исключение
					КонецПопытки;
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		НоваяФорма.Модифицированность = Ложь;
		НоваяФорма.Открыть();
	КонецЕсли;
	
	Возврат Результат;      	
КонецФункции // дкСписокПередНачаломДобавления()

// Общий обработчик события ПередНачаломИзменения табличного поля списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Элемент - редактируемое табличное поле
// Отказ - Булево, признак отказа от стандартной обработки 
// ПраваПользователя - Структура, кеш прав и настроек пользователя
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередНачаломИзменения(ЭтаФорма, Элемент, Отказ, ПраваПользователя = Неопределено) Экспорт
	
	Результат = Истина;
	
	//запишем объект в панели свойств, если открыта во избежании разных версий объекта
	Попытка
		Показывать = ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Свойства.Пометка;
		Если Показывать Тогда
			//ЭтаФорма.ОповеститьОбАктивизацииОбъекта(Элемент.ТекущаяСтрока.ПолучитьОбъект());
			Обработки.ПанельСвойствОбъекта.Создать().ОткрытьПанельСвойств(Элемент.ТекущаяСтрока.ПолучитьОбъект(), ЭтаФорма, Показывать, ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Свойства, Истина);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Результат; 	
КонецФункции // дкСписокПередНачаломИзменения()

// Общий обработчик события ПередУдалением табличного поля списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Элемент - редактируемое табличное поле
// Отказ - Булево, признак отказа от стандартной обработки 
// ПраваПользователя - структура, кеш прав и настроек текущего пользователя
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередУдалением(ЭтаФорма, Элемент, Отказ, ПраваПользователя = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если ПраваПользователя = НЕОПРЕДЕЛЕНО Тогда
		Попытка 
			ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;    	
КонецФункции // дкСписокПередУдалением()

// Общий обработчик события ПриВыводеСтроки табличного поля списка документов 
//
// Параметры:
// ЭтаФорма 		 - форма, форма переданного списка документов
// Элемент 	  - редактируемое табличное поле
// ОформлениеСтроки - ОформлениеСтроки, содержит параметры оформления выводимой строки
// ДанныеСтроки  - Данные выводимой строки. Параметр соответствует свойству "ТекущиеДанные" для выводимой строки
// ПраваПользователя - Структура, кеш прав и настроек пользователя
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриВыводеСтроки(ЭтаФорма, Элемент, ОформлениеСтроки, ДанныеСтроки, ПраваПользователя = Неопределено) Экспорт
	// Зарезервировано на будущее
	Результат = Истина;
	Возврат Результат;
КонецФункции // дкСписокПриВыводеСтроки()

// Общий обработчик события ПередУстановкойПометкиУдаления табличного поля списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма переданного списка документов
// Элемент - редактируемое табличное поле
// Отказ - Булево, признак отказа от стандартной обработки 
// ПраваПользователя - структура, кеш прав и настроек текущего пользователя
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПередУстановкойПометкиУдаления(ЭтаФорма, Элемент, Отказ, ПраваПользователя = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если (ПраваПользователя = НЕОПРЕДЕЛЕНО) Тогда
		Попытка 
			ПраваПользователя = ЭтаФорма.ЭтотОбъект.Права;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Попытка
		ОтборЗначение = ЭтаФорма.Отбор.Ссылка.Значение;
	Исключение
		ОтборЗначение = Неопределено;
	КонецПопытки;
	Если обПраво("УдалениеЧерезПометку",ПраваПользователя,,ОтборЗначение) Тогда
		Если обПраво("ЗапросПриУдаленииПриНаличииПодчиненных",ПраваПользователя,,ОтборЗначение) 
			И обПраво("РедактированиеДокументовПриНаличииПодчиненных",ПраваПользователя,,ОтборЗначение) Тогда
			// нужно проверить наличие подчиненных
			Если ТипЗнч(Элемент) = Тип("ТабличноеПоле") Тогда
				Ссылка = Элемент.ТекущаяСтрока;
				Если обЗначениеНеЗаполнено(Ссылка) ИЛИ Ссылка.ПометкаУдаления Тогда
					// не должно такой ситуации возникнуть когда неопределенная или, но на всякий случай...
					// зато если уже помечен на удаление то отмечать его обратно можно без проверок-вопросов
				Иначе
					// найдем есть ли подчиненные документы
					МассивСсылок = КритерииОтбора.ПодчиненныеДокументы.Найти(Ссылка);
					Если МассивСсылок.Количество() > 0 Тогда
						Ответ = Вопрос("  Текущий документ имеет подчиненные! 
						|(Существуют документы введенные на его основании).
						| Все равно желаете пометить его на удаление?",РежимДиалогаВопрос.ДаНет,обПраво("ТаймаутДиалогов",ПраваПользователя,,ОтборЗначение),КодВозвратаДиалога.Нет);
						Если (Ответ = КодВозвратаДиалога.Нет) ИЛИ (Ответ = КодВозвратаДиалога.Таймаут) Тогда
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	Иначе
		Отказ = Истина;
		Сообщение = "Нет прав на изменение пометки удаления! Действие отменено.";
		Сообщить(Сообщение,СтатусСообщения.Важное); 
		Предупреждение(Сообщение,15);
	КонецЕсли;
	
	Возврат Результат;    	
КонецФункции // дкСписокПередУстановкойПометкиУдаления()

// Общий обработчик события ПриИзмененииОтбора табличного поля списка документов 
//
// Параметры:
// ЭтаФорма - форма, форма списка документов
// Элемент - Значение отбора или признак использования отбора
//
// Возвращаемое значение:
// Результат - Булево - Признак необходимости дальнейшей обработки (статус - отработано или нет)
//       для определения возможности дальнейшей работы приватного обработчика
//
Функция дкСписокПриИзмененииОтбора(ЭтаФорма, Элемент = Неопределено) Экспорт
	
	Результат = Истина;
	
	//отлавливаем всевозможные изменения значений и использований отборов
	Если Элемент = "ДокументСписок.Отбор.Организация.Использование" ИЛИ 
		Элемент = "ЖурналДокументовСписок.Отбор.Организация.Использование" Тогда
		Если НЕ ЭтаФорма.Отбор.Организация.Использование Тогда
			ЭтаФорма.Отбор.Организация.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.Отбор.Организация.Значение = Справочники.Организации.ПустаяСсылка();
			Если ЭтаФорма.ЭлементыФормы.Найти("Организация") <> Неопределено Тогда
				ЭтаФорма.ЭлементыФормы.Организация.Значение = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.ПодразделениеКомпании.Использование" Тогда
		Если НЕ ЭтаФорма.Отбор.ПодразделениеКомпании.Использование Тогда
			ЭтаФорма.Отбор.ПодразделениеКомпании.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.Отбор.ПодразделениеКомпании.Значение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
			Если ЭтаФорма.ЭлементыФормы.Найти("ПодразделениеКомпании") <> Неопределено Тогда
				ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Значение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Элемент = "ЖурналДокументовСписок.Отбор.Подразделение.Использование" Тогда
		Если НЕ ЭтаФорма.Отбор.Подразделение.Использование Тогда
			ЭтаФорма.Отбор.Подразделение.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.Отбор.Подразделение.Значение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ЖурналДокументовСписок.Склад.Использование" Тогда
		Если НЕ ЭтаФорма.Отбор.Склад.Использование Тогда
			ЭтаФорма.Отбор.Склад.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.Отбор.Склад.Значение = Справочники.СкладыКомпании.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ДокументСписок.Склад.Использование" Тогда
		Если НЕ ЭтаФорма.Отбор.СкладКомпании.Использование Тогда
			ЭтаФорма.Отбор.СкладКомпании.ВидСравнения = ВидСравнения.Равно;
			ЭтаФорма.Отбор.СкладКомпании.Значение = Справочники.СкладыКомпании.ПустаяСсылка();
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.Организация.Значение" ИЛИ 
		Элемент = "ЖурналДокументовСписок.Отбор.Организация.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("Организация") <> Неопределено Тогда
			ЭтаФорма.Отбор.Организация.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.Организация.Значение);
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.ПодразделениеКомпании.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("ПодразделениеКомпании") <> Неопределено Тогда
			ЭтаФорма.Отбор.ПодразделениеКомпании.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Значение);
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ЖурналДокументовСписок.Отбор.Подразделение.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("ПодразделениеКомпании") <> Неопределено Тогда
			ЭтаФорма.Отбор.Подразделение.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.ПодразделениеКомпании.Значение);
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ЖурналДокументовСписок.Отбор.Склад.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("Склад") <> Неопределено Тогда
			ЭтаФорма.Отбор.Склад.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.Склад.Значение);
		КонецЕсли; 
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.СкладКомпании.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("СкладКомпании") <> Неопределено Тогда
			ЭтаФорма.Отбор.СкладКомпании.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.СкладКомпании.Значение);
		КонецЕсли;
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.Автор.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("Автор") <> Неопределено Тогда
			ЭтаФорма.Отбор.Автор.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.Автор.Значение);
		КонецЕсли;
	КонецЕсли;
	Если Элемент = "ДокументСписок.Отбор.Контрагент.Значение" Тогда
		Если ЭтаФорма.ЭлементыФормы.Найти("Контрагент") <> Неопределено Тогда
			ЭтаФорма.Отбор.Контрагент.Использование = НЕ обЗначениеНеЗаполнено(ЭтаФорма.ЭлементыФормы.Контрагент.Значение);
		КонецЕсли; 
	КонецЕсли;
	
	//вывод комментария (фильтра списка или гиперссылки на владельца)
	Если ЭтаФорма.ЭлементыФормы.Найти("тКомментарий") <> Неопределено Тогда
		ПредставлениеОтбора = обПолучитьПредставлениеОтбора(ЭтаФорма.Отбор);
		Если ПустаяСтрока(ПредставлениеОтбора) Тогда
			Попытка
				ЭтаФорма.ЭлементыФормы.тКомментарий.Данные = "ЭлементыФормы.Список.ТекущиеДанные.Комментарий";
			Исключение
				ЭтаФорма.ЭлементыФормы.тКомментарий.Данные = "";
			КонецПопытки;
			ЭтаФорма.ЭлементыФормы.тКомментарий.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
			ЭтаФорма.ЭлементыФормы.тКомментарий.Подсказка = "Комментарий документа";
		Иначе
			ЭтаФорма.ЭлементыФормы.тКомментарий.Данные  = "";
			ЭтаФорма.ЭлементыФормы.тКомментарий.Заголовок = Лев(ПредставлениеОтбора, СтрДлина(ПредставлениеОтбора)-1);
			ЭтаФорма.ЭлементыФормы.тКомментарий.ЦветТекста = Новый Цвет(155,0,0);
			ЭтаФорма.ЭлементыФормы.тКомментарий.Подсказка = "Текущий фильтр";
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.Обновить();
	
	Возврат Результат;
	
КонецФункции // дкСписокПриИзмененииОтбора()

// Нажатие кнопки "ВыгрузитьВШаблон" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// ДокументОбъект - ДокументОбъект, документ, который выгружаем в шаблон
// ИмяФормы - строка, имя текущей формы
//
Процедура дкДействияФормыВыгрузитьВШаблон(ЭтаФорма, ДокументОбъект, ИмяФормы) Экспорт
	ВыгрузкаЗагрузкаШаблоновДокументов = Обработки.ВыгрузкаЗагрузкаШаблоновДокументов.Создать();
	ВыгрузкаЗагрузкаШаблоновДокументов.ВыгрузитьВШаблон(ДокументОбъект);
КонецПроцедуры // дкДействияФормыВыгрузитьВШаблон()

// Нажатие кнопки "ВыгрузитьВШаблон" в верхней панели.
//
// Параметры:
// ЭтаФорма - форма, форма переданного документа
// ДокументОбъект - ДокументОбъект, документ, который выгружаем в шаблон
// ИмяФормы - строка, имя текущей формы
//
Процедура дкДействияФормыЗагрузитьИзШаблона(ЭтаФорма, ДокументОбъект, ИмяФормы) Экспорт
	// если не пусто то будем работать
	Если обЗначениеНеЗаполнено(ДокументОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка	ЭтоФормаОбъекта = (ЭтаФорма.ЭтотОбъект <> Неопределено);
	Исключение ЭтоФормаОбъекта = Ложь;
	КонецПопытки;
	
	//если документ уже есть в базе, то следует спросить точно ли надо перезаполнять
	Если НЕ ДокументОбъект.Ссылка = Неопределено И ЭтоФормаОбъекта Тогда
		Если Вопрос("При загрузке данных документа из шаблона может быть утеряно значение реквизитов. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	ВыгрузкаЗагрузкаШаблоновДокументов = Обработки.ВыгрузкаЗагрузкаШаблоновДокументов.Создать();
	ВыгрузкаЗагрузкаШаблоновДокументов.ЗагрузитьИзШаблона(ДокументОбъект);
КонецПроцедуры // дкДействияФормыЗагрузитьИзШаблона()

// Начало выбора сотрудника
//
// Параметры:
// ЭтаФорма	 - форма, форма переданного документа
// Элемент		 - ЭУ поле ввода, поле ввода склада
// СтандартнаяОбработка - Булево, признак стандартной обработки действия элемента управления
// СтруктураОтбора - Структура, структура ограничений при выборе данных
//
Процедура дкСотрудникНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка, СтруктураОтбора = Неопределено) Экспорт
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	Если НЕ СтруктураОтбора.Свойство("Организация") Тогда
		СтруктураОтбора.Вставить("Организация",ЭтаФорма.Организация);
	КонецЕсли; 
	Если НЕ СтруктураОтбора.Свойство("ПодразделениеКомпании") Тогда
		СтруктураОтбора.Вставить("ПодразделениеКомпании",ЭтаФорма.ПодразделениеКомпании);
	КонецЕсли; 
КонецПроцедуры // дкСотрудникНачалоВыбора()

#КонецЕсли

Функция дкСписокДокументовСрослеживаемымиТоварами() Экспорт
	
	СписокДокументов = Новый Массив;
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияТоваров);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураВыданный);
	СписокДокументов.Добавить(Метаданные.Документы.СчетФактураПолученный);
	СписокДокументов.Добавить(Метаданные.Документы.ИзвлечениеТоваровИзПроизводства);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеТоваровВПроизводство);
	СписокДокументов.Добавить(Метаданные.Документы.ПеремещениеНезавершенногоПроизводства);
	СписокДокументов.Добавить(Метаданные.Документы.ПоступлениеАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.РеализацияАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.ЗаказНаряд);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаПоступления);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаПоступленияАвтомобилей);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаРеализации);
	СписокДокументов.Добавить(Метаданные.Документы.КорректировкаРеализацииАвтомобилей);
		
	Возврат СписокДокументов;
	
КонецФункции

//<<ЧалапАЮ БизТех 06.10.2023
Функция ПроверкаЛояльностиКлиента(Элемент)   Экспорт
	Если ТипЗнч(Элемент.Значение)=Тип("СправочникСсылка.Контрагенты") тогда  
		Если ЗначениеЗаполнено(Элемент.Значение.БТ_ПризнакЛояльности) тогда
			Возврат Элемент.Значение;
		иначе
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Элемент.Значение)=Тип("Строка") тогда
		//найдем по наименованию контрагента
		НайденныйКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(Элемент.Значение);
		Если не НайденныйКонтрагент = Неопределено и ЗначениеЗаполнено(НайденныйКонтрагент.БТ_ПризнакЛояльности) тогда
			Возврат НайденныйКонтрагент
		иначе
			Возврат Справочники.Контрагенты.ПустаяСсылка()	
		КонецЕсли;
	иначе
		Возврат Справочники.Контрагенты.ПустаяСсылка();//Неопределено;
	КонецЕсли;  
КонецФункции    

//ЧалапАЮ БизТех 06.10.2023>>
