
&НаКлиенте
Процедура ФормаСобственностиПриИзменении(Элемент)
	ВидимостьЭлементов();
КонецПроцедуры


&НаСервере
Процедура ВидимостьЭлементов() 
	ЭтоЮрЛицо = объект.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо;
	
	Элементы.инн.Видимость = ЭтоЮрЛицо; 
	Элементы.кпп.Видимость = ЭтоЮрЛицо;
	Элементы.КодПоОКПО.Видимость = ЭтоЮрЛицо;
	
	элементы.СогласиеНаОбработкуПерсональныхДанных.Видимость = не ЭтоЮрЛицо;
	элементы.ДеньРождения.Видимость = не ЭтоЮрЛицо;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если параметры.Ключ.Пустая() тогда
		объект.ФормаСобственности = ПредопределенноеЗначение("Перечисление.ФормыСобственности.ЧастноеЛицо");
	КонецЕсли;	
	
	ВидимостьЭлементов();
КонецПроцедуры
