#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция формирует показатель итогов
//
Функция СформироватьПоказательИтогов(Знач Путь, Знач ПоказательИтогов)
	Результат	= "";
	
	ОтборДляПоиска	= Новый Структура("ПутьКДанным, Использование",Путь, Истина);
	НайденныеСтроки	= ИзмеренияСтроки.НайтиСтроки(ОтборДляПоиска);
	Для Каждого ТекИзмерение Из НайденныеСтроки Цикл
		Результат	= Результат + "		КОГДА НЕ "+Путь+" ЕСТЬ NULL ";
		Для Индекс=ТекИзмерение.НомерСтроки По ИзмеренияСтроки.Количество()-1 Цикл
			Результат	= Результат + "И "+ИзмеренияСтроки[Индекс].ПутьКДанным+" ЕСТЬ NULL ";	
		КонецЦикла;
		Результат	= Результат + ПоказательИтогов;
		Прервать;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Функция формирует правильный текст запроса для получения итогов
//
Функция СформироватьИтоги()
	Результат	= "";
	ТекстИтога	= "";
	КоличествоРабочихЛистов	= "СУММА(ВЫБОР КОГДА ЕСТЬNULL(ТаблицаКоличества.КоличествоВсего,0)=0
								|		ТОГДА 0 ИНАЧЕ 1/ЕСТЬNULL(ТаблицаКоличества.КоличествоВсего,0) КОНЕЦ)";
	КоличествоВариантовСтрахования	= "СУММА(ЕСТЬNULL(ТаблицаПрограмм.Количество,0))";
	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("Статус","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПодразделениеКомпании","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("МенеджерСтраховогоОтдела","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПричинаОтказа","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("Статус","
		|			ТОГДА "+КоличествоРабочихЛистов);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ВидОплаты","
		|			ТОГДА "+КоличествоРабочихЛистов);
	Если НЕ ПустаяСтрока(ТекстИтога) Тогда
		ТекстОбщихИтогов	= "";
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если ТекСтрока.Использование Тогда
				ТекстОбщихИтогов	= ТекстОбщихИтогов + "И "+ТекСтрока.ПутьКДанным+" ЕСТЬ NULL ";
			КонецЕсли;
		КонецЦикла;
		ТекстОбщихИтогов	= Сред(ТекстОбщихИтогов,2);
		ТекстОбщихИтогов	= "		КОГДА "+ТекстОбщихИтогов+"
								|			ТОГДА "+КоличествоРабочихЛистов;
		Результат	= Результат + "	ВЫБОР
			|		"+ТекстИтога+"
			|		"+ТекстОбщихИтогов+"
			|		ИНАЧЕ 0 КОНЕЦ КАК КоличествоРабочихЛистов";		
	КонецЕсли;
	
    ТекстИтога	= "";
	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("СтраховаяКомпания","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ВидСтрахования","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ПрограммаСтрахования","
		|			ТОГДА "+КоличествоВариантовСтрахования);	
	ТекстИтога	= ТекстИтога + СформироватьПоказательИтогов("ЭтоПролонгация","
		|			ТОГДА "+КоличествоВариантовСтрахования);		
		Если НЕ ПустаяСтрока(ТекстИтога) Тогда
		ТекстОбщихИтогов	= "";
		Для Каждого ТекСтрока Из ИзмеренияСтроки Цикл
			Если ТекСтрока.Использование Тогда
				ТекстОбщихИтогов	= ТекстОбщихИтогов + "И "+ТекСтрока.ПутьКДанным+" ЕСТЬ NULL ";
			КонецЕсли;
		КонецЦикла;
		ТекстОбщихИтогов	= Сред(ТекстОбщихИтогов,2);
		ТекстОбщихИтогов	= "		КОГДА "+ТекстОбщихИтогов+"
								|			ТОГДА "+КоличествоВариантовСтрахования;			
			
		Результат	= Результат + ",
			|	ВЫБОР
			|		"+ТекстИтога+"
			|		"+ТекстОбщихИтогов+"
			|		ИНАЧЕ 0 КОНЕЦ КАК КоличествоВариантовСтрахования";		
	КонецЕсли;			
	Возврат Результат;
КонецФункции

//Возвращает ИСТИНА, если на входе тип 2-мерной диаграммы, и ЛОЖЬ - если 3-мерной
Функция ДиаграммаДвухмерная(ТипДиаграммы_)
	Возврат (ТипДиаграммы_ = ТипДиаграммы.Измерительная
	ИЛИ ТипДиаграммы_ = ТипДиаграммы.Круговая
	ИЛИ ТипДиаграммы_ = ТипДиаграммы.КруговаяОбъемная);
КонецФункции

// устанавливает основные параметры
Процедура УстановитьОсновныеПараметры()
	ПостроительОтчета.Параметры.Вставить("ДатаНач",ДатаНачала);
	ПостроительОтчета.Параметры.Вставить("ДатаКон",ДатаКонца);
КонецПроцедуры	

// Стандартная процедура настройки построителя отчета 
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	//ТекстЗамены			= СформироватьИтоги();
	//Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
	//	ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	//КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат);
	Результат.ТолькоПросмотр = обПраво("ЗащитаПечатныхФорм", глПрава);
	
	ТекстЗапроса	= ВременныйТекстЗапроса;
	
	Возврат Результат;	
КонецФункции

// формирует отчет в виде сводной таблицы
Функция СформироватьСводнуюТаблицу(ДокументРезультат=Неопределено) Экспорт
	
	КурсВалютыУпр = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ДатаКонца, Новый Структура("Валюта", Константы.ВалютаУправленческогоУчетаКомпании.Получить()));
	ПостроительОтчета.Параметры.Вставить("КурсВалютыУпр", КурсВалютыУпр.Курс/?(КурсВалютыУпр.Кратность=0,1,КурсВалютыУпр.Кратность));
		
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьСводнуюТаблицу(ЭтотОбъект, ДокументРезультат);	
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ДокументРезультат;
	
КонецФункции

// формирует диаграмму
Функция СформироватьДиаграмму(ПолеДиаграммы=Неопределено, СтруктураПараметров=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьДиаграмму(ЭтотОбъект, ПолеДиаграммы, СтруктураПараметров);
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ПолеДиаграммы;
	
КонецФункции

// формирует отчет в виде сводной диаграммы
Функция СформироватьСводнуюДиаграмму(ПолеСводнойДиаграммы=Неопределено) Экспорт
	
	УстановитьОсновныеПараметры();
	
	ВременныйТекстЗапроса	= ТекстЗапроса;
	ТекстЗамены				= СформироватьИтоги();
	Если НЕ ПустаяСтрока(ТекстЗамены) Тогда
		ЧтоЗаменить = "СУММА(КоличествоРабочихЛистов) КАК КоличествоРабочихЛистов	// ИТОГИ_ДЛЯ_ЗАМЕНЫ";
		ТекстЗапроса			= СтрЗаменить(ТекстЗапроса, ЧтоЗаменить, ТекстЗамены);
	КонецЕсли;
	
	отСформироватьСводнуюДиаграмму(ЭтотОбъект, ПолеСводнойДиаграммы);
	ТекстЗапроса	= ВременныйТекстЗапроса;	
	
	Возврат ПолеСводнойДиаграммы;
	
КонецФункции

// Функция возвращает структуру форматирования полей
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяРегистра = "РегистрацияЗвонковИКонтактов";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли