
Функция Расшифровка(СсылкаНаОбъект,Знач НачПериода,Знач КонПериода,Знач Сотрудник,ПодразделениеКомпании=Неопределено,Знач Должность = Неопределено) Экспорт
	
	НачалоПериода = НачПериода;
	КонецПериода = КонПериода;

	Попытка
		Если СсылкаНаОбъект.ИтоговыеКолонки.Количество()=0 тогда
			ЗаполнитьИтоговыеКолонки=Истина;
		иначе
			ЗаполнитьИтоговыеКолонки=Ложь;
		конецесли;	
		
      	СтрокаПараметров="";
		Сч=0;
		
		
		Если СсылкаНаОбъект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда 
			
			Параметры = СсылкаНаОбъект.ПараметрыРасшифровкиХранилище.Получить();
			МодульРасшифровки = СсылкаНаОбъект.МодульРасшифровки;
			
			Построитель=Новый ПостроительОтчета;
			Попытка
				Построитель.Текст = МодульРасшифровки;
				Для Каждого ТекСтр из Параметры Цикл
					Если ТекСтр.ЭтоВыражение Тогда
						Выполнить("Построитель.Параметры.Вставить("""+ТекСтр.Имя+""","+ТекСтр.Значение+")");
					Иначе
						Если ТекСтр.Имя="КонецПериода" Тогда
							Построитель.Параметры.Вставить(ТекСтр.Имя,КонецДня(ТекСтр.Значение));
						Иначе
							Если ТекСтр.Список = Ложь Тогда
								Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение);
							Иначе
								Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение.Получить());
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Построитель.Выполнить();
				
				Результат = Построитель.Результат.Выгрузить();

			Исключение
				
				Сообщить(ОписаниеОшибки()); 
				
			КонецПопытки;
	
			Иначе
				
				Параметры = СсылкаНаОбъект.ПеременныеСерверХранилище.Получить();
				МодульРасшифровки = СсылкаНаОбъект.ПроизвольныйМодульРасшифровка;
				
				Для Каждого ТекПараметр Из Параметры Цикл 
					
					Сч=Сч+1;
					Если НРег(ТекПараметр.Имя) = "сотрудник" Тогда
						Строка=ТекПараметр.Имя+"=Сотрудник;";
						Выполнить(Строка);
						Продолжить;
					КонецЕсли;
					
					Если НРег(ТекПараметр.Имя) = "началопериода" Тогда
						Строка=ТекПараметр.Имя+"=НачалоПериода;";
						Выполнить(Строка);
						Продолжить;
					КонецЕсли;
					
					Если НРег(ТекПараметр.Имя) = "конецпериода" Тогда
						Строка=ТекПараметр.Имя+"=КонецПериода;";
						Выполнить(Строка);
						Продолжить;
					КонецЕсли;
					
					Если СсылкаНаОбъект.ПодразделениеКомпании<>Неопределено Тогда
						Если НРег(ТекПараметр.Имя) = "подразделениекомпании" Тогда
							Строка=ТекПараметр.Имя+"=ПодразделениеКомпании;";
							Выполнить(Строка);
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					Если Должность<>Неопределено Тогда
						Если НРег(ТекПараметр.Имя) = "должность" Тогда
							Строка=ТекПараметр.Имя+"=Должность;";
							Выполнить(Строка);
							Продолжить;
						КонецЕсли;
					КонецЕсли;
					
					Если ТекПараметр.ЭтоВыражение Тогда
						Строка=ТекПараметр.Имя+"="+ТекПараметр.Значение+";";
						СтрокаПараметров=СтрокаПараметров+Строка+"
						|";
					ИначеЕсли ТекПараметр.Список ТОгда
						Строка=ТекПараметр.Имя+"=Параметры["+(Сч-1)+"].ЗначениеСписок.Получить();";
						СтрокаПараметров=СтрокаПараметров+Строка+"
						|";
					Иначе
						Строка=ТекПараметр.Имя+"=ПараметрKPI.Параметры["+(Сч-1)+"].Значение;";
						СтрокаПараметров=СтрокаПараметров+Строка+"
						|";
					КонецЕсли;
				КонецЦикла;
				

		//ПодготовленныйКод="";

		//Для НомерПеременной = 0 По Параметры.Количество() - 1 Цикл
		//	ТекПеременная=Параметры[НомерПеременной];
		//	ПодготовленныйКод=ПодготовленныйКод + Символы.ПС + ТекПеременная.Имя + "=Параметры[" + Формат(НомерПеременной,
		//	"ЧН=0; ЧГ=0;") + "].Значение;";
		//КонецЦикла;
				
		КонецЕсли;

		//выполним модуль
		Таблица=Новый ТабличныйДокумент;
		ТаблицаРасшифровки=Новый ТаблицаЗначений;
		М = ПолучитьМакет("Макет");
		
		Если СсылкаНаОбъект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда 
			
			ТаблицаРасшифровки=Результат;

		Иначе
			
			Выполнить(СокрЛП(СтрокаПараметров + Символы.ПС +МодульРасшифровки));
			
		КонецЕсли;
		
		Таблица.НачатьАвтогруппировкуСтрок();

		Отст=М.ПолучитьОбласть("Шапка|Отступ");
		Таблица.Вывести(Отст,0);
		Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
			Обл=М.Область("R1C2");
			Обл.ШиринаКолонки=ТекКол.Ширина;
			ОблВыв=М.ПолучитьОбласть("Шапка|Колонка");
			ОблВыв.Параметры.Колонка= ТекКол.Заголовок;
			Таблица.Присоединить(ОблВыв);
		КонецЦикла;
	
		Для Каждого ТекСтр из ТаблицаРасшифровки Цикл
			Отст=М.ПолучитьОбласть("Строка|Отступ");
			Таблица.Вывести(Отст,1);
			Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
				Обл=М.Область("R2C2");
				Обл.ШиринаКолонки=ТекКол.Ширина;
				ОблВыв=М.ПолучитьОбласть("Строка|Колонка");
				ОблВыв.Параметры.Значение=ТекСтр[ТекКол.Имя];
				Таблица.Присоединить(ОблВыв);
			КонецЦикла;
		КонецЦикла;
		Отст=М.ПолучитьОбласть("Итого|Отступ");
		Таблица.Вывести(Отст,0);
		Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
			Обл=М.Область("R3C2");
			Обл.ШиринаКолонки=ТекКол.Ширина;
			НС=СсылкаНаОбъект.ИтоговыеКолонки.Найти(ТекКол.Заголовок);
			Если НС<>Неопределено Тогда
				Если НС.Осн Тогда
					Обл.ЦветФона=webЦвета.Желтый;
				Иначе
					Обл.ЦветФона=webЦвета.СветлоЗеленый;
				КонецЕсли;
			Иначе
				Обл.ЦветФона=webЦвета.Белый;
			КонецЕсли;

			ОблВыв=М.ПолучитьОбласть("Итого|Колонка");
						
			если ЗаполнитьИтоговыеКолонки или СсылкаНаОбъект.ИтоговыеКолонки.Найти(ТекКол.Заголовок)<>Неопределено
				тогда
				Попытка
					ОблВыв.Параметры.Итого=ТаблицаРасшифровки.Итог(ТекКол.Имя);
					если ЗаполнитьИтоговыеКолонки
					тогда
					   СтрокаКолонки=СсылкаНаОбъект.ИтоговыеКолонки.Добавить();
					   СтрокаКолонки.Колонка=ТекКол.Заголовок;
					конецесли;

				Исключение
					ОблВыв.Параметры.Итого="";
				КонецПопытки;
			иначе
				ОблВыв.Параметры.Итого="";
			конецесли;
			Таблица.Присоединить(ОблВыв);
		КонецЦикла;
		Таблица.ЗакончитьАвтогруппировкуСтрок();
		Таблица.ОтображатьЗаголовки=Ложь;
		Таблица.ОтображатьСетку=Ложь;
		Таблица.АвтоМасштаб=Истина;
		Таблица.ТолькоПросмотр=Истина;
	Исключение
		Сообщить(ОписаниеОшибки()); 
	КонецПопытки;
	
    Возврат Таблица;

КонецФункции

Функция ВыполнитьРасчетKPI(Знач НачПериода,Знач КонПериода,Знач Сотрудник,Знач Должность,Знач ПараметрKPI, Знач Периодичность=Неопределено, Знач Подразделение=Неопределено,СреднееЗаКвартал=ложь) Экспорт
	
	НачалоПериода = НачПериода;
	КонецПериода = КонПериода;
	
	Если ПараметрKPI.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда
		
		Построитель=Новый ПостроительОтчета;
		Построитель.Текст=ПараметрKPI.ТЗапроса;
		
		ПараметрыЗапроса = ПараметрKPI.ПараметрыЗапросаХранилище.Получить();

		Для Каждого ТекСтр из ПараметрыЗапроса Цикл
			
			Если ТекСтр.ЭтоВыражение Тогда
				Выполнить("Построитель.Параметры.Вставить("""+ТекСтр.Имя+""","+ТекСтр.Значение+")");
			Иначе
				Если ТекСтр.Список = Ложь Тогда
					Если НРег(ТекСтр.Имя) = "сотрудник" Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,Сотрудник);
					ИначеЕсли НРег(ТекСтр.Имя) = "должность" Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,Должность);
					ИначеЕсли НРег(ТекСтр.Имя) = "подразделение" и ЗначениеЗаполнено(Подразделение) Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,Подразделение);		
					ИначеЕсли НРег(ТекСтр.Имя) = "началопериода" Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,НачПериода);
					ИначеЕсли НРег(ТекСтр.Имя) = "конецпериода" Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,КонецДня(КонПериода));
					Иначе
	    				Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение);
    				КонецЕсли;
				Иначе
					Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение.Получить());
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Построитель.Выполнить();
		Рез=Построитель.Результат.Выгрузить();
		
		ЗначениеЗапроса=Рез.Итог("Значение");
		
		Рез=Неопределено;
		
		Если СреднеезаКвартал Тогда
			ЗначениеЗапроса=ЗначениеЗапроса/3;
		КонецЕсли;
		
		Возврат ЗначениеЗапроса;
		
	ИначеЕсли ПараметрKPI.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		
		СтрокаПараметров="";
		Сч=-1;
		
		ПеременныеСервер = ПараметрKPI.ПеременныеСерверХранилище.Получить();
		
		//ПодготовленныйКод="";

		//Для НомерПеременной = 0 По ПеременныеСервер.Количество() - 1 Цикл
		//	ТекПеременная=ПеременныеСервер[НомерПеременной];
		//	ПодготовленныйКод=ПодготовленныйКод + Символы.ПС + ТекПеременная.Имя + "=ПеременныеСервер[" + Формат(НомерПеременной,
		//	"ЧН=0; ЧГ=0;") + "].Значение;";
		//КонецЦикла;

		Для Каждого ТекПараметр Из ПеременныеСервер Цикл
			
			Сч=Сч+1;
			Если НРег(ТекПараметр.Имя) = "сотрудник" Тогда
				Строка=ТекПараметр.Имя+"=Сотрудник;";
				Выполнить(Строка);
				Продолжить;
			КонецЕсли;
			Если НРег(ТекПараметр.Имя) = "должность" Тогда
				Строка=ТекПараметр.Имя+"=Должность;";
				Выполнить(Строка);
				Продолжить;
			КонецЕсли;
			Если НРег(ТекПараметр.Имя) = "подразделение" и не ТекПараметр.ЭтоВыражение и ЗначениеЗаполнено(Подразделение)Тогда
				Строка=ТекПараметр.Имя+"=Подразделение;";
				Выполнить(Строка);
				Продолжить;
			КонецЕсли;
			Если НРег(ТекПараметр.Имя) = "началопериода" Тогда
				Строка=ТекПараметр.Имя+"=НачалоПериода;";
				Выполнить(Строка);
				Продолжить;
			КонецЕсли;
			Если НРег(ТекПараметр.Имя) = "конецпериода" Тогда
				Строка=ТекПараметр.Имя+"=КонецПериода;";
				Выполнить(Строка);
				Продолжить;
			КонецЕсли;
			Если ТекПараметр.ЭтоВыражение Тогда
				Строка=ТекПараметр.Имя+"="+ТекПараметр.Значение+";";
				СтрокаПараметров=СтрокаПараметров+Строка+"
				|";
			ИначеЕсли ТекПараметр.Список ТОгда
				Строка=ТекПараметр.Имя+"="""+ТекСтр.Имя+""","+ТекСтр.Значение+";";
				СтрокаПараметров=СтрокаПараметров+Строка+"
				|";
			Иначе
				Строка=ТекПараметр.ИмяПараметра+"="""+ТекСтр.Имя+""","+ТекСтр.Значение+"";
				СтрокаПараметров=СтрокаПараметров+Строка+"
				|";
			КонецЕсли;
		КонецЦикла;
		
		//выполним модуль
		ЗначениеМодуля=0;
		
		Выполнить(СокрЛП(СтрокаПараметров + Символы.ПС +ПараметрKPI.ПроизвольныйМодуль));
		
		Если СреднеезаКвартал Тогда
			ЗначениеМодуля=ЗначениеМодуля/3;
		КонецЕсли;
		
		Возврат ЗначениеМодуля;
		
	ИначеЕсли  ПараметрKPI.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.РучнойВвод или ПараметрKPI.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Импорт Тогда
		
		Если ПараметрKPI.СрезПоследнегоЗначения Тогда
			
			Запрос=новый Запрос("ВЫБРАТЬ
			|	ФактическиеЗначенияKPI.Факт,
			|	ФактическиеЗначенияKPI.Период КАК Период
			|ИЗ
			|	РегистрСведений.ФактическиеЗначенияKPI.СрезПоследних(&КонПериода, ) КАК ФактическиеЗначенияKPI
			|ГДЕ
			|	ФактическиеЗначенияKPI.Сотрудник = &Сотрудник
			|	И ФактическиеЗначенияKPI.KPI = &KPI
			|	И ФактическиеЗначенияKPI.Период МЕЖДУ &НачПериода И &КонПериода
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ");
			
			Если   ПараметрKPI.Общий Тогда
				Запрос.УстановитьПараметр("Сотрудник",Справочники.Сотрудники.ПустаяСсылка());
			Иначе
				Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("KPI",ПараметрKPI);
			Запрос.УстановитьПараметр("НачПериода",НачПериода);
			Запрос.УстановитьПараметр("КонПериода",КонПериода); 
            Выб=Запрос.Выполнить().Выбрать();
			ПослПериод=Дата("01.01.01 00:00:00");
			
			Если Выб.Следующий() Тогда
				ПослПериод=Выб.Период;
			КонецЕсли;
			
			Запрос=новый Запрос("ВЫБРАТЬ
			|	ФактическиеЗначенияKPI.Факт,
			|	ФактическиеЗначенияKPI.Период КАК Период
			|ИЗ
			|	РегистрСведений.ФактическиеЗначенияKPI.СрезПоследних(&КонПериода, ) КАК ФактическиеЗначенияKPI
			|ГДЕ
			|	ФактическиеЗначенияKPI.Сотрудник = &Сотрудник
			|	И ФактическиеЗначенияKPI.KPI = &KPI
			|	И ФактическиеЗначенияKPI.Период = &Период
			|	И ФактическиеЗначенияKPI.Период МЕЖДУ &НачПериода И &КонПериода
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ");
            Запрос.УстановитьПараметр("Период",ПослПериод);
		Иначе
			Запрос=новый Запрос("ВЫБРАТЬ
			|	ФактическиеЗначенияKPI.Факт
			|ИЗ
			|	РегистрСведений.ФактическиеЗначенияKPI КАК ФактическиеЗначенияKPI
			|ГДЕ
		//	|	ФактПоKPI.Периодичность = &Периодичность
			|	ФактическиеЗначенияKPI.Сотрудник = &Сотрудник
			|	И ФактическиеЗначенияKPI.KPI = &KPI
			|	И ФактическиеЗначенияKPI.Период МЕЖДУ &НачПериода И &КонПериода");
		КонецЕсли;
		
		Если СреднееЗаКвартал Тогда
			Запрос.УстановитьПараметр("Периодичность",Перечисления.Периодичность.Месяц);
		Иначе
			Запрос.УстановитьПараметр("Периодичность",Периодичность);
		КонецЕсли;
		
		Если   ПараметрKPI.Общий Тогда
			Запрос.УстановитьПараметр("Сотрудник",Справочники.Сотрудники.ПустаяСсылка());
		Иначе
			Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("KPI",ПараметрKPI);
		Запрос.УстановитьПараметр("НачПериода",НачПериода);
		Запрос.УстановитьПараметр("КонПериода",КонПериода); 
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если СреднееЗаКвартал Тогда
			Дел=0;
			Для Каждого ТекЭл из ТЗ Цикл
				Если ТекЭл.Факт<>0 Тогда
					Дел=Дел+1;
				КонецЕсли;
			КонецЦикла;
			Если дел=0 Тогда
				Дел=1;
			КонецЕсли;
		Иначе
			Дел=1;
		КонецЕсли;

		Попытка	
			РезультатФормулаСумма=ТЗ.Итог("Факт")/Дел;
		Исключение
			РезультатФормулаСумма=0;
		КонецПопытки;
		
		ТЗ=Неопределено;
		Возврат РезультатФормулаСумма;
		
	КонецЕсли;
	Возврат 0;
	
КонецФункции
