
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Организация");
	СтруктураСвойств.Вставить("ПодразделениеКомпании");
	СтруктураСвойств.Вставить("ПериодРегистратор");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

// Процедура помогает настроить отчет непосредственно перед выводом
//
Процедура ПередФормированиемМакетаКомпоновки(ПараметрСхемаКомпоновкиДанных, ПараметрКомпоновщикНастроек) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("ПериодРегистратор");
	Поля.Добавить("ХозОперация");
	Поля.Добавить("СтатьяРаспределения");
	
	ОтчетыСервер.КомпоновщикУстановитьОтборПустыхГруппировок(ПараметрКомпоновщикНастроек.Настройки.Структура, Поля);
	
КонецПроцедуры // ПередФормированиемМакетаКомпоновки()