

Процедура ЗаполнитьПределы() Экспорт
	Пределы.Очистить();

	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Должность КАК Должность,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Параметр,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Предел,
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ТТ_ПараметрыЗП_Сервис.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗП_СервисСрезПоследних
	|ГДЕ
	|	ТТ_ПараметрыЗП_СервисСрезПоследних.Подразделение = &Подразделение
    |
	|УПОРЯДОЧИТЬ ПО
	|	Должность";
			Запрос.УстановитьПараметр("Подразделение",Подразделение);
			Запрос.УстановитьПараметр("Период",КонецДня(Дата));
			Рез=Запрос.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл
				Стр=Пределы.Добавить();
				Стр.Должность=Рез.Должность;
				Стр.Параметр=Рез.Параметр;
				Стр.Предел=Рез.Предел;
				Стр.Значение=Рез.Значение;
				
			КонецЦикла;	

	
КонецПроцедуры


Процедура ЗаполнитьМехаников() Экспорт
	
	Механики.Очистить();
	
	ЗапросСотр=Новый Запрос;
	ЗапросСотр.Текст="
	|ВЫБРАТЬ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Должность,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.ВидРемонта,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Ставка
	|ИЗ
	|РегистрСведений.ТТ_СтавкиПоВидамРемонта.СрезПоследних(&Период, ) КАК ТТ_СтавкиПоВидамРемонтаСрезПоследних
	|ГДЕ
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Подразделение = &Подразделение
	|СГРУППИРОВАТЬ ПО
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Должность,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.ВидРемонта,
	|ТТ_СтавкиПоВидамРемонтаСрезПоследних.Ставка";
			ЗапросСотр.УстановитьПараметр("Подразделение",Подразделение);
			ЗапросСотр.УстановитьПараметр("Период",КонецДня(Дата));
			
			Должность="";
			НомерСтр=1;
			Стр="";
			ВыборкаСотр=ЗапросСотр.Выполнить().Выбрать();
			Пока ВыборкаСотр.Следующий() Цикл
				Если ВыборкаСотр.Должность=Должность Тогда
					//Стр=Механики.Получить(НомерСтр);

					Если ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный Тогда
						Стр.АгрегатныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный Тогда
						Стр.СлесарныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП Тогда
						Стр.ДОПСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО Тогда
						Стр.ПСОСтавка=ВыборкаСотр.Ставка;
					Иначе
						Стр.ТОСтавка=ВыборкаСотр.Ставка;
					КонецЕсли;	
				Иначе	
					Должность=ВыборкаСотр.Должность;
					Стр=Механики.Добавить();
					НомерСтр=Стр.НомерСтроки;
					Стр.Должность=ВыборкаСотр.Должность;
					Если ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный Тогда
						Стр.АгрегатныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный Тогда
						Стр.СлесарныйСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП Тогда
						Стр.ДОПСтавка=ВыборкаСотр.Ставка;
					ИначеЕсли ВыборкаСотр.ВидРемонта=Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО Тогда
						Стр.ПСОСтавка=ВыборкаСотр.Ставка;
					Иначе
						Стр.ТОСтавка=ВыборкаСотр.Ставка;
					КонецЕсли;	
	
				КонецЕсли;	
			КонецЦикла;	

		КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
			
	
	Движения.ТТ_ПараметрыЗП_Сервис.Записывать = Истина;
	Для Каждого Стр Из Пределы Цикл
		Движение = Движения.ТТ_ПараметрыЗП_Сервис.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.Параметр = Стр.Параметр;
		Движение.Предел = Стр.Предел; 
		Движение.Значение = Стр.Значение;
	КонецЦикла;

	Движения.ТТ_СтавкиПоВидамРемонта.Записывать = Истина;
	Для Каждого Стр Из Механики Цикл 
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.Агрегатный;
		Движение.Ставка = Стр.АгрегатныйСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.Слесарный;
		Движение.Ставка = Стр.СлесарныйСтавка; 

		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ДОП;
		Движение.Ставка = Стр.ДОПСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ПСО;
		Движение.Ставка = Стр.ПСОСтавка; 
		
		Движение = Движения.ТТ_СтавкиПоВидамРемонта.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = Подразделение; 
		Движение.Должность = Стр.Должность;
		Движение.ВидРемонта =Перечисления.ТТ_ВидыРемонтаДляЗП.ТО;
		Движение.Ставка = Стр.ТОСтавка; 
		
	КонецЦикла;
	
	
	
КонецПроцедуры
