Функция КорректностьРезультатаПроверкиКМ(РезультатПроверкиКМ) Экспорт
	
	КорректностьРезультатаПроверки = Ложь;
	
	РезультатПроверки = ПроверитьБит(РезультатПроверкиКМ, 0);
	Если РезультатПроверки Тогда
		КорректностьРезультатаПроверки = Истина;
	КонецЕсли;
	Если КорректностьРезультатаПроверки Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиКМ, 1);
		КорректностьРезультатаПроверки = РезультатПроверки;
	Иначе
		КорректностьРезультатаПроверки = Истина;
	КонецЕсли;
	
	Возврат КорректностьРезультатаПроверки;
		
КонецФункции

Функция РасшифровкаРезультатаПроверкиКМ(РезультатПроверкиКМ, НомерБита) Экспорт
	
	Если НомерБита = 0 ИЛИ НомерБита = 1 Тогда 
		РезультатПроверки = ПроверитьБит(РезультатПроверкиКМ, НомерБита);
		Если НомерБита = 0 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Код маркировки проверен фискальным накопителем с использованием ключа проверки КП.";
			Иначе 
				РезультатПроверкиТекст = "Код маркировки не может быть проверен фискальным накопителем с использованием ключа проверки КП.";
			КонецЕсли;
		ИначеЕсли НомерБита = 1 Тогда
			Если РезультатПроверки Тогда
				РезультатПроверкиТекст = "Результат проверки КП КМ фискальным накопителем с использованием ключа проверки КП положительный.";
			Иначе 
				РезультатПроверкиТекст = "Результат проверки КП КМ фискальным накопителем с использованием ключа проверки КП отрицательный.";
			КонецЕсли;
		КонецЕсли;
	Иначе	
		РезультатПроверкиТекст = "Недопустимый код проверки состояния КМ.";
	КонецЕсли;
	
	Возврат РезультатПроверкиТекст;
		
КонецФункции
