//Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПроверкуЗаполненияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Category.СписокВыбора.ЗагрузитьЗначения(ns_БытоваяЭлектроникаФормы.ПолучитьСписокКатегорий());
	Элементы.GoodsType.СписокВыбора.ЗагрузитьЗначения(ns_БытоваяЭлектроникаФормы.ПолучитьСписокПодкатегорий(Объект.Category));
КонецПроцедуры
 
//КонецОбласти

//Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура CategoryПриИзменении(Элемент)
	СброситьРеквизитыЗаполнения(Истина);
	ОбновитьРеквизиты();
	Элементы.GoodsType.СписокВыбора.ЗагрузитьЗначения(ns_БытоваяЭлектроникаФормы.ПолучитьСписокПодкатегорий(Объект.Category));
	УстановитьПроверкуЗаполненияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GoodsTypeПриИзменении(Элемент)
	СброситьРеквизитыЗаполнения();
	ОбновитьРеквизиты();
	УстановитьПроверкуЗаполненияНаСервере();
КонецПроцедуры

//КонецОбласти

//Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьTitle(Команда)
	Объект.Title = СформироватьTitleНаСервере(Объект.ШаблонЗаголовка, Объект.Title, Объект.Номенклатура, Объект.Характеристика);
КонецПроцедуры

//КонецОбласти

//Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьРеквизиты()
	Для каждого Реквизит Из Метаданные.Справочники.ns_БытоваяЭлектроника.Реквизиты Цикл
		Если НЕ Элементы.Найти(Реквизит.Имя) = Неопределено Тогда
			Попытка
				Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Истина;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Истина;
				Иначе
					Элементы[Реквизит.Имя].АвтоОтметкаНезаполненного = Ложь;
					Элементы[Реквизит.Имя].ОтметкаНезаполненного = Ложь;
				КонецЕсли;
				Элементы[Реквизит.Имя].Видимость = Истина;	
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Процедура УстановитьПроверкуЗаполненияНаСервере()
	ОбязательныеПоля = ns_БытоваяЭлектроникаВалидация.ПолучитьОбязательныеПоля();
	Для каждого ИмяПоля Из ОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
	
	ДополнительныеОбязательныеПоля = ns_БытоваяЭлектроникаВалидация.ПолучитьДополнительныеОбязательныеПоля(Объект.Category, Объект.GoodsType);
	Для каждого ИмяПоля Из ДополнительныеОбязательныеПоля Цикл
		Элементы[ИмяПоля].АвтоОтметкаНезаполненного = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьTitleНаСервере(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика)
	Возврат ns_ШаблонизаторСервер.СформироватьTitle(ШаблонЗаголовка, Заголовок, Номенклатура, Характеристика);
КонецФункции

&НаКлиенте
Процедура СброситьРеквизитыЗаполнения(ОчищатьGoodsType = Ложь)
	Если ОчищатьGoodsType Тогда
		Объект.GoodsType = Неопределено;
	КонецЕсли;
	Объект.ProductsType = Неопределено;
КонецПроцедуры

//КонецОбласти 