//Функция получения заявки на хранение шин по подчиненности документов
Функция ПолучитьЗаявкуНаХранениеШин(ДокументОснование) Экспорт
	
	ЗаявкаНаХранениеШин=ДокументОснование;
	
	// массив уже рассмотренных документов, используется, чтобы не допустить зацикливания
	КонтрольПовторов = Новый Массив();
	Пока ТипЗнч(ЗаявкаНаХранениеШин)<>Тип("ДокументСсылка.ЗаявкаНаХранениеШин") Цикл
		Если НЕ (КонтрольПовторов.Найти(ЗаявкаНаХранениеШин) = Неопределено) Тогда
			Прервать;
		КонецЕсли;
		КонтрольПовторов.Добавить(ЗаявкаНаХранениеШин);
		Если обЗначениеНеЗаполнено(ЗаявкаНаХранениеШин) Тогда
			Прервать;
		КонецЕсли;
		Попытка
			ЗаявкаНаХранениеШин=ЗаявкаНаХранениеШин.ДокументОснование;
		Исключение
			ЗаявкаНаХранениеШин=Неопределено;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	Если обЗначениеНеЗаполнено(ЗаявкаНаХранениеШин) Тогда
		ЗаявкаНаХранениеШин=Неопределено;
	КонецЕсли;
	Возврат ЗаявкаНаХранениеШин;
КонецФункции // ПолучитьЗаявкуНаХранениеШин()

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ЗаявкаНаХранениеШин" , "Заявка на хранение шин");
	СтруктураМакетов.Вставить("ДоговорХранения"     , "Договор хранения шин");
	СтруктураМакетов.Вставить("АктПриемаПередачи"   , "Акт приема-передачи");
	СтруктураМакетов.Вставить("Бирок"               , "Бирки");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти