
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ОтменаРедактирования
	Движения.ДатыЗапретаРедактирования.Записывать = Истина;
	Движения.ДатыЗапретаРедактирования.Очистить();
	
	Движение = Движения.ДатыЗапретаРедактирования.Добавить();
	Движение.Период = Дата;
	Движение.Месяц = ПериодРасчета;
	Движение.Организация = Организация;
	Движение.ПодразделениеКомпании = ПодразделениеКомпании;
	Движение.НоваяДатаЗапретРедактированияРасчета = НоваяДатаЗапретаРедактирования;

КонецПроцедуры
