// <Описание функции>
//
Функция ПолучитьЗаполнитьСписок(КодНаим, ФлагКода = Истина, Список = Неопределено) Экспорт

	// ищем элемент по коду
	Если ФлагКода Тогда
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоКоду(КодНаим);
	Иначе	// или наименованию
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоНаименованию(КодНаим);
	КонецЕсли;	
	Если ТекПараметр = Справочники.ТТ_СписокПараметров.ПустаяСсылка() Тогда
		Возврат	Неопределено;
	Иначе
		// если находим и есть список параметров
		Если ТекПараметр.СписокПараметров.Количество()>0 Тогда
			Если Список = Неопределено Тогда
				Список = Новый СписокЗначений();
			Иначе	
				Попытка
					Список.Очистить();					
				Исключение
				КонецПопытки;
			КонецЕсли;	
			Для Каждого ТекСтрока ИЗ ТекПараметр.СписокПараметров Цикл
				НоваяСтрока = Список.Добавить(ТекСтрока.ЗначениеПараметра);
			КонецЦикла;	
			Возврат Список;
		Иначе
			Возврат	Неопределено;
		КонецЕсли;	
	КонецЕсли;	

КонецФункции

Функция ПроверитьНаличиеВСписке(КодНаим, ФлагКода = Истина, Значение) Экспорт

	// ищем элемент по коду
	Если ФлагКода Тогда
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоКоду(КодНаим);
	Иначе	// или наименованию
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоНаименованию(КодНаим);
	КонецЕсли;	
	Если ТекПараметр = Справочники.ТТ_СписокПараметров.ПустаяСсылка() Тогда
		Возврат	Ложь;
	Иначе
		// если находим и есть список параметров
		Если ТекПараметр.СписокПараметров.Количество()>0 Тогда
			Для Каждого ТекСтрока ИЗ ТекПараметр.СписокПараметров Цикл
				Попытка
					Если Значение = ТекСтрока.ЗначениеПараметра ИЛИ Значение.ПринадлежитЭлементу(ТекСтрока.ЗначениеПараметра) Тогда
						Возврат	Истина;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;	
			Возврат	Ложь;
		Иначе
			Возврат	Ложь;
		КонецЕсли;	
	КонецЕсли;	

КонецФункции

Функция ПолучитьТаблицуЗначений(КодНаим, ФлагКода = Истина, Параметр1 = Неопределено,Параметр2 = Неопределено,Параметр3 = Неопределено,Параметр4 = Неопределено) Экспорт
    // отбор по полю Занчение параметра - истина - активность строки
	// ищем элемент по коду
	Если ФлагКода Тогда
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоКоду(КодНаим);
	Иначе	// или наименованию
		ТекПараметр = Справочники.ТТ_СписокПараметров.НайтиПоНаименованию(КодНаим);
	КонецЕсли;	
	Если ТекПараметр = Справочники.ТТ_СписокПараметров.ПустаяСсылка() Тогда
		Возврат	Неопределено;
	Иначе
		// если находим и есть список параметров
		Если ТекПараметр.СписокПараметров.Количество()>0 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТТ_СписокПараметровСписокПараметров.Параметр1,
			|	ТТ_СписокПараметровСписокПараметров.Параметр2,
			|	ТТ_СписокПараметровСписокПараметров.Параметр3,
			|	ТТ_СписокПараметровСписокПараметров.Параметр4,
			|	ТТ_СписокПараметровСписокПараметров.Параметр5,
			|	ТТ_СписокПараметровСписокПараметров.Параметр6,
			|	ТТ_СписокПараметровСписокПараметров.Параметр7,
			|	ТТ_СписокПараметровСписокПараметров.Параметр8,
			|	ТТ_СписокПараметровСписокПараметров.Параметр9,
			|	ТТ_СписокПараметровСписокПараметров.Параметр10,
			|	ТТ_СписокПараметровСписокПараметров.Параметр11
			|ИЗ
			|	Справочник.ТТ_СписокПараметров.СписокПараметров КАК ТТ_СписокПараметровСписокПараметров
			|ГДЕ
			|	ТТ_СписокПараметровСписокПараметров.Ссылка = &Ссылка
			|	И ТТ_СписокПараметровСписокПараметров.ЗначениеПараметра = ИСТИНА
			|	И ТТ_СписокПараметровСписокПараметров.Параметр1 = &Параметр1
			|	И ТТ_СписокПараметровСписокПараметров.Параметр2 = &Параметр2
			|	И ТТ_СписокПараметровСписокПараметров.Параметр3 = &Параметр3
			|	И ТТ_СписокПараметровСписокПараметров.Параметр4 = &Параметр4";
			Если Параметр1 = Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ТТ_СписокПараметровСписокПараметров.Параметр1 = &Параметр1","");
			КонецЕсли;	
			Если Параметр2 = Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ТТ_СписокПараметровСписокПараметров.Параметр2 = &Параметр2","");
			КонецЕсли;	
			Если Параметр3 = Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ТТ_СписокПараметровСписокПараметров.Параметр3 = &Параметр3","");
			КонецЕсли;	
			Если Параметр4 = Неопределено Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ТТ_СписокПараметровСписокПараметров.Параметр4 = &Параметр4","");
			КонецЕсли;	
			Запрос.УстановитьПараметр("Ссылка", ТекПараметр.Ссылка);
			Запрос.УстановитьПараметр("Параметр1", Параметр1);
			Запрос.УстановитьПараметр("Параметр2", Параметр2);
			Запрос.УстановитьПараметр("Параметр3", Параметр3);
			Запрос.УстановитьПараметр("Параметр4", Параметр4);
			Результат = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = Результат.Выгрузить();
			Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
				Возврат ВыборкаДетальныеЗаписи;
			Иначе	
				Возврат	Неопределено;
			КонецЕсли;	
		Иначе
			Возврат	Неопределено;
		КонецЕсли;	
	КонецЕсли;	

КонецФункции

