
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	
	Если Параметры.КлючВарианта = Неопределено тогда
		Параметры.КлючВарианта = "Основной";
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   	
	Переключатель = 1;
	
	Если КлючТекущегоВарианта = "ДляРеестра" тогда
		Для Каждого Элемент из Элементы.ОсновнаяКоманднаяПанель.ПодчиненныеЭлементы Цикл
			Если Элемент.Имя = "ФормаСформировать" тогда
				Продолжить;
			КонецЕсли;
			Элемент.Видимость = Ложь;
		КонецЦикла;
	КонецЕсли; 
   	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)   	
	ОтборКомпоновщика = Отчет.КомпоновщикНастроек.Настройки.Отбор;
	Отбор = ОтчетыСервер.КомпоновщикНайтиОтбор("АктСверки",ОтборКомпоновщика);
	
	Если Переключатель = 1 тогда 
		Если НЕ Отбор = Неопределено тогда
			Отбор.Использование = Ложь;
		КонецЕсли;
	ИначеЕсли Переключатель = 2 тогда 
		СменитьФильтр(Отбор,ВидСравненияКомпоновкиДанных.Заполнено,ОтборКомпоновщика);
	ИначеЕсли Переключатель = 3 тогда 
		СменитьФильтр(Отбор,ВидСравненияКомпоновкиДанных.НеЗаполнено,ОтборКомпоновщика);	
	КонецЕсли;
	
	СкомпоноватьРезультат(); 	
КонецПроцедуры

&НаКлиенте
Процедура СменитьФильтр(Отбор,Значение,ОтборКомпоновщика)
	Если Отбор = Неопределено тогда
		ВидОбъекта = ОтборКомпоновщика.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ВидОбъекта.ВидСравнения = Значение;
		ВидОбъекта.Использование = Истина;
		ВидОбъекта.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктСверки");
		ВидОбъекта.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Отбор.ВидСравнения = Значение;
		Отбор.Использование = Истина;
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктСверки");
		Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;    
КонецПроцедуры // СменитьФильтр()
