#Область Настройки
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЭтаФорма.Модифицированность = Истина Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос("Настройки были изменены. Записать настройки?", Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		    Закрыть();
		ИначеЕсли Ответ = КодВозвратаДиалога.Да тогда
			СохранитьНастройкиНаСервере();	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиНаСервере()
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.СохранитьНастройки();
	ЗначениеВРеквизитФормы(Обр,"Объект");
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Обр = РеквизитФормыВЗначение("Объект");
	Обр.ВосстановитьНастройки();
	ЗначениеВРеквизитФормы(Обр,"Объект");	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	СохранитьНастройкиНаСервере();
КонецПроцедуры
#КонецОбласти    

&НаСервере
Процедура ЗаполнитьПодразделениямиО2НаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПодразделенияКомпании.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ О2
	                |ИЗ
	                |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	                |ГДЕ
	                |	ПодразделенияКомпании.Наименование ПОДОБНО ""%О2%""
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	О2.Ссылка КАК Ссылка
	                |ИЗ
	                |	О2 КАК О2
	                |ГДЕ
	                |	О2.Ссылка.Наименование ПОДОБНО ""%Сервис%""
	                |	И О2.Ссылка.Родитель <> &Родитель";
	Запрос.УстановитьПараметр("Родитель", Справочники.ПодразделенияКомпании.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Для каждого Стр Из РезультатЗапроса Цикл 
		СтруктураОтбора = Новый Структура("ПодменяемоеЗначение", Стр);
		Если НЕ Объект.ПодменяемыеДанные.НайтиСтроки(СтруктураОтбора).Количество() Тогда
			НоваяСтрока = Объект.ПодменяемыеДанные.Добавить();
			НоваяСтрока.ПодменяемоеЗначение = Стр;
		КонецЕсли;
	КонецЦикла; 
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодразделениямиО2(Команда)
	ЗаполнитьПодразделениямиО2НаСервере();
КонецПроцедуры

