#Область ОшибкиAPI
Функция ПолучитьОписаниеОшибки(КодОшибки, ДопПараметр = Неопределено)
	
	Соответствияошибок = Новый Соответствие;
	
	//Ошибки API
	Соответствияошибок.Вставить("ERR_SERVER", "Ошибка соединения. Возможно указан некорректный путь или метод запроса.");
	Соответствияошибок.Вставить("ERR_JSON", "Не удалось обработать тело запроса как JSON.");
	
	//создание заказа
	Соответствияошибок.Вставить("ERR_ORDER_DATA_INVALID", ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_WAREHOUSE_NOT_FOUND", "Не определен склад-получатель.");
	Соответствияошибок.Вставить("ERR_ORDER_EMPTY", "Невозможно создать пустой заказ");
	Соответствияошибок.Вставить("ERR_ORDER_ITEMS_DATA_INVALID", "Не заполнены обязательные параметры для товаров для создания заказа. Проверьте что параметры external_id, article, brand, quantity, unit_price и external_warehouse_id  - заполнены.");
	Соответствияошибок.Вставить("ERR_ORDER_ITEMS_RESOURCE_NOT_FOUND", "Номенклатура заказа не найдена. " + ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_ITEMS_WAREHOUSE_NOT_FOUND", "Не найден склад по ID. " + ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_ITEMS_WAREHOUSE_EMPTY", "Нет товаров на указанных складах. " + ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_CREATE_FAILED", "Ошибка при создании заказа покупателя. " + ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_RESERVE_CREATE_FAILED", "Ошибка при создании резерва под заказа покупателя. Ошибка - " + ДопПараметр);
	
	//Отмена заказа
	Соответствияошибок.Вставить("ERR_ORDER_DOESNT_EXIST", "Данных не найдено. Заказ не найден.");
	Соответствияошибок.Вставить("ERR_ORDER_ALREADY_CANCELLED", "Заказ уже отменен.");
	Соответствияошибок.Вставить("ERR_ORDER_ALREADY_COMPLETED", "Заказ реализован. Отменить его нельзя.");
	Соответствияошибок.Вставить("ERR_ORDER_CANCEL_FAILED", "Ошибка при отмене заказа. Ошибка - " + ДопПараметр);
	Соответствияошибок.Вставить("ERR_ORDER_DOESNT_CREATED_API", "Заказ не является заказом O2 API. Отменить его нельзя.");
	
	//статус заказа
	Соответствияошибок.Вставить("ERR_STATES_ORDERS_IDS_INVALID", "Данных не найдено. Возможно указаны некорректные ID заказов.");
	Соответствияошибок.Вставить("ERR_STATES_REFERENCE_NOT_UNIQUE", "В списке не уникальные ID заказа");
	Соответствияошибок.Вставить("ERR_STATES_DOESNT_CREATED_API", "Заказ не является заказом O2 API. Получить его нельзя.");
	
	Соответствияошибок.Вставить("ERR_SERVICE", ДопПараметр);
	
	Если ЗначениеЗаполнено(Соответствияошибок.Получить(КодОшибки)) Тогда
		Возврат Соответствияошибок.Получить(КодОшибки);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции
Функция ВернутьОшибку(КодОшибки, ДопПараметр = Неопределено)
	
	Ответ = Новый HTTPСервисОтвет(400);
	
	//Структура ошибки
	СтруктураОтвета = Новый Структура;
	МассивОшибок = Новый Массив;
	СтруктураОшибки = Новый Структура;
	
	СтруктураОшибки.Вставить("code", КодОшибки);
	СтруктураОшибки.Вставить("text", ПолучитьОписаниеОшибки(КодОшибки, ДопПараметр));
	
	МассивОшибок.Добавить(СтруктураОшибки);
	
	СтруктураОтвета.Вставить("errors", МассивОшибок);
	
	//Json
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;
	
КонецФункции
#КонецОбласти

#Область ЛогированиеЗапросов
Функция ЛогированиеЗапросов(Период, Запрос, Ответ = Неопределено, Заказ = Неопределено, Ошибка = Неопределено)
	
	Набор = РегистрыСведений.О2_API_ЛогиЗапросов.СоздатьНаборЗаписей();
	Если ЗначениеЗаполнено(Период) Тогда
		Набор.Отбор.Период.Установить(Период);
	Иначе
		Набор.Отбор.Период.Установить(ТекущаяДатаСеанса());
	КонецЕсли;
	
	//Запрос
	ТекстЗаголовкиЗапроса = "";
	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		ТекстЗаголовкиЗапроса = ТекстЗаголовкиЗапроса + Заголовок.Ключ + ": " + Заголовок.Значение + Символы.ПС;
	КонецЦикла;
	
	Набор.Отбор.Метод.Установить(Запрос.HTTPМетод + " " + Запрос.БазовыйURL + Запрос.ОтносительныйURL);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда
		НоваяЗапись = Набор.Добавить();
	Иначе
		НоваяЗапись = Набор[0];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Период) Тогда
		НоваяЗапись.Период = Период;
	Иначе
		НоваяЗапись.Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НоваяЗапись.Метод = Запрос.HTTPМетод + " " + Запрос.БазовыйURL + Запрос.ОтносительныйURL;
	НоваяЗапись.ЗаголовкиЗапроса = ТекстЗаголовкиЗапроса;
	НоваяЗапись.ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	
	
	//Ответ
	Если ТипЗнч(Ответ) = Тип("HTTPСервисОтвет") Тогда
		ТекстЗаголовкиОтвета = "";
		Для Каждого Заголовок Из Ответ.Заголовки Цикл
			ТекстЗаголовкиОтвета = ТекстЗаголовкиОтвета + Заголовок.Ключ + ": " + Заголовок.Значение + Символы.ПС;
		КонецЦикла;
		НоваяЗапись.ЗаголовкиОтвета = ТекстЗаголовкиОтвета;
		НоваяЗапись.КодОтвета = Ответ.КодСостояния;
		НоваяЗапись.ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	
	//Прочая информация
	НоваяЗапись.ОписаниеОшибки = Ошибка;
	НоваяЗапись.Заказ = Заказ;
	
	Набор.Записать();
КонецФункции
Функция ВЖурнал(Значение)
	ЗаписьЖурналаРегистрации("О2 API", УровеньЖурналаРегистрации.Информация, Значение, Строка(Значение), Строка(Значение));
КонецФункции
#КонецОбласти

#Область Обработка
Функция ПолучитьСтруктуруИзJSON(Текст)
	Попытка
		//Попытаемся прочитать JSON
		ЧтениеJson = Новый ЧтениеJSON;
		ЧтениеJson.УстановитьСтроку(Текст);
		ДанныеСтруктура = ПрочитатьJSON(ЧтениеJson);
		Возврат ДанныеСтруктура;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
//Получает данные из структуры если ключ существует
Функция ПолучитьЗначениеЕслиСуществуетИЗаполнено(Данные, Наименование) Экспорт
	Если НЕ ЗначениеЗаполнено(Данные) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Данные.Свойство(Наименование) Тогда
		Возврат Данные[Наименование];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
//Получает данные из структуры по пути "ключ1.ключ2" если ключи сущестуют
Функция ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Данные, Путь) Экспорт
	МассивПути = СтрРазделить(Путь, ".", Ложь);
	ТекущиеДанные = Данные;
	Для Каждого ТекущийКлюч Из МассивПути Цикл
		ТекущиеДанные = ПолучитьЗначениеЕслиСуществуетИЗаполнено(ТекущиеДанные, ТекущийКлюч);
		Если ТекущиеДанные = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	Возврат ТекущиеДанные;
КонецФункции
//упр вызов функции ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути
Функция ПолучитьПоПути(Данные, Путь)
	Возврат ПолучитьЗначениеЕслиСуществуетИЗаполненоПоПути(Данные, Путь);
КонецФункции
Функция ПолучитьМассивСтруктурИзТаблицы(Таблица)
	МассивТЗ = Новый Массив;
	Для Каждого СтрокаТЗ Из Таблица Цикл
		СтруктураСтроки = Новый Структура;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
		КонецЦикла;
		МассивТЗ.Добавить(СтруктураСтроки);
	КонецЦикла;
	Возврат МассивТЗ;
КонецФункции
#КонецОбласти

#Область ЭлементыКонфигурации
Функция НайтиНоменклатуруПоАртикулу(Артикул, Производитель = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул
		|	И Номенклатура.Производитель.Наименование = &Наименование
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Если ЗначениеЗаполнено(Производитель) Тогда
		Запрос.УстановитьПараметр("Наименование", Производитель);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура.Производитель.Наименование = &Наименование", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьОстаткиПоТаблице(ТаблицаТоваров)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ТаблицаТоваров.МестоРазмещения КАК МестоРазмещения
		|ПОМЕСТИТЬ ТаблицаТоваровЗаказа
		|ИЗ
		|	&Таблица КАК ТаблицаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ТаблицаТоваров.Количество КАК Количество,
		|	ТаблицаТоваров.МестоРазмещения КАК МестоРазмещения,
		|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК СвободныйОстаток,
		|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) >= ТаблицаТоваров.Количество КАК ДостаточноДляЗаказа
		|ИЗ
		|	ТаблицаТоваровЗаказа КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки КАК ОстаткиТоваровКомпанииОстатки
		|		ПО ТаблицаТоваров.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		|			И ТаблицаТоваров.МестоРазмещения = ОстаткиТоваровКомпанииОстатки.СкладКомпании";
	
	Запрос.УстановитьПараметр("Таблица", ТаблицаТоваров);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции
Функция ЗаписатьСтатусЗаказа(ID, ЗаявкаНаРемонт, ЗаказПокупателя, ЧекНаОплату=Неопределено, Статус)
		
	Если НЕ ТипЗнч(Статус) = Тип("ПеречислениеСсылка.О2_API_СтатусыЗаказов") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запись = РегистрыСведений.О2_API_СтатусыЗаказов.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.IDЗаказа = ID;
	Запись.ЗаявкаНаРемонт = ЗаявкаНаРемонт;
	Запись.ЗаказПокупателя = ЗаказПокупателя;
	Запись.ЧекНаОплату = ЧекНаОплату;
	Запись.Статус = Статус;
	Запись.Записать();
	Возврат Истина;
КонецФункции
Функция ПолучитьТекущийСтатусЗаказа(НаДату = Неопределено, IDЗаказа = Неопределено, ДокументДляПоиска = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Если заполнен документ то произведем сначала поиск актуального номера заказа по документу.
	Если ЗначениеЗаполнено(ДокументДляПоиска) И (ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ЗаявкаНаРемонт") ИЛИ ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ЧекНаОплату")) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	О2_API_СтатусыЗаказовСрезПоследних.IDЗаказа КАК IDЗаказа
		|ИЗ
		|	РегистрСведений.О2_API_СтатусыЗаказов.СрезПоследних(&НаДату, ЗаказПокупателя = &ДокументДляПоиска) КАК О2_API_СтатусыЗаказовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	О2_API_СтатусыЗаказовСрезПоследних.Период УБЫВ";
		
		Если ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЗаказПокупателя","ЗаявкаНаРемонт");
		ИначеЕсли ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЗаказПокупателя","ЧекНаОплату");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ДокументДляПоиска", ДокументДляПоиска);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			IDЗаказа = ВыборкаДетальныеЗаписи.IDЗаказа;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если IDЗаказа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	О2_API_СтатусыЗаказовСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
		|	О2_API_СтатусыЗаказовСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	О2_API_СтатусыЗаказовСрезПоследних.ЧекНаОплату КАК ЧекНаОплату,
		|	О2_API_СтатусыЗаказовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.О2_API_СтатусыЗаказов.СрезПоследних(&НаДату, IDЗаказа = &IDЗаказа) КАК О2_API_СтатусыЗаказовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	О2_API_СтатусыЗаказовСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("IDЗаказа", IDЗаказа);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("IDЗаказа", IDЗаказа);
		СтруктураВозврата.Вставить("ЗаявкаНаРемонт", ВыборкаДетальныеЗаписи.ЗаявкаНаРемонт);
		СтруктураВозврата.Вставить("ЗаказПокупателя", ВыборкаДетальныеЗаписи.ЗаказПокупателя);
		СтруктураВозврата.Вставить("ЧекНаОплату", ВыборкаДетальныеЗаписи.ЧекНаОплату);
		СтруктураВозврата.Вставить("Статус", ВыборкаДетальныеЗаписи.Статус);
		Возврат СтруктураВозврата;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
Функция ПолучитьКомментарийПеречисления(ЗначениеПеречисления)
	
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	КомментарийЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Комментарий;
	Возврат КомментарийЗначенияПеречисления;
	
КонецФункции
Функция ВернутьТаблицуЦенИОстатков(ПартииПодразделениеКомпании, ТипЦен, ДатаОстатковИЦен, СписокНоменклатур) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ Даты
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(
		|			{(&ДатаОстатковИЦен)},
		|			ТипЦен = &ТипЦен
		|				И Номенклатура В (&СписокНоменклатур)) КАК ЦеныСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена,
		|	ЦеныСрезПоследних.Период КАК Период
		|ПОМЕСТИТЬ ПоследниеЦены
		|ИЗ
		|	Даты КАК Даты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних({(&ДатаОстатковИЦен)}, ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
		|		ПО Даты.Период = ЦеныСрезПоследних.Период
		|			И Даты.Номенклатура = ЦеныСрезПоследних.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныСрезПоследних.Номенклатура,
		|	ЦеныСрезПоследних.Цена,
		|	ЦеныСрезПоследних.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПартииТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(ПоступлениеТоваровТовары.Цена, ОКР(ПоступлениеТоваровТовары.Сумма / ПоступлениеТоваровТовары.Количество, 2))) КАК Цена
		|ПОМЕСТИТЬ НовыеЦены
		|ИЗ
		|	РегистрНакопления.ПартииТоваровКомпании.Остатки({(&ДатаОстатковИЦен)}, ) КАК ПартииТоваровКомпанииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		|		ПО ПартииТоваровКомпанииОстатки.Партия = ПоступлениеТоваровТовары.Ссылка
		|			И ПартииТоваровКомпанииОстатки.Номенклатура = ПоступлениеТоваровТовары.Номенклатура
		|ГДЕ
		|	НЕ ПартииТоваровКомпанииОстатки.Партия.ПодразделениеКомпании В (&ПартииПодразделениеКомпании)
		|	И ПартииТоваровКомпанииОстатки.Номенклатура В(&СписокНоменклатур)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровКомпанииОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток - ОстаткиТоваровКомпанииОстатки.РезервОстаток, 0) КАК СвободныйОстаток,
		|	ПоследниеЦены.Номенклатура КАК Номенклатура,
		|	ПоследниеЦены.Цена КАК ЦенаПоРегистру,
		|	ПоследниеЦены.Номенклатура.Производитель КАК Производитель,
		|	ПоследниеЦены.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПоследниеЦены.Номенклатура.Артикул КАК Артикул,
		|	НовыеЦены.Цена КАК ЦенаПоПартии,
		|	ВЫБОР
		|		КОГДА НовыеЦены.Цена > ПоследниеЦены.Цена
		|			ТОГДА НовыеЦены.Цена
		|		ИНАЧЕ ПоследниеЦены.Цена
		|	КОНЕЦ КАК Цена,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Код КАК СкладКомпанииКод
		|ИЗ
		|	ПоследниеЦены КАК ПоследниеЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки({(&ДатаОстатковИЦен)}, ) КАК ОстаткиТоваровКомпанииОстатки
		|		ПО ПоследниеЦены.Номенклатура = ОстаткиТоваровКомпанииОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеЦены КАК НовыеЦены
		|		ПО ПоследниеЦены.Номенклатура = НовыеЦены.Номенклатура";
	
	Запрос.УстановитьПараметр("ПартииПодразделениеКомпании", ПартииПодразделениеКомпании);
	Запрос.УстановитьПараметр("СписокНоменклатур", СписокНоменклатур);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("ДатаОстатковИЦен", ДатаОстатковИЦен);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
Функция ПолучитьДатуИзISO8601(СтрокаДата) Экспорт
    Попытка
    	СтрокаДата = СтрЗаменить(СтрокаДата,"Z","");
        Возврат XMLЗначение(Тип("Дата"), СтрокаДата);
    Исключение
        Возврат Неопределено;
    КонецПопытки;
КонецФункции
#КонецОбласти

#Область ОбработчикиAPI
Функция ВсеОстальныеЛюбой(Запрос) Экспорт
	Ответ = ВернутьОшибку("ERR_SERVER");
	ЛогированиеЗапросов(Неопределено, Запрос, Ответ, , "Некорректный путь или метод запроса.");
	Возврат Ответ;
КонецФункции

#Область НЕ_ИСПОЛЬЗУЕТСЯ
// НЕ ИСПОЛЬЗУЕТСЯ ++
Функция place_orderPOST(Запрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, Запрос);
	//
	
	// МЕТОД НЕ АКТУАЛЕН
	Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Метод не актуален.");
	Возврат Ответ;
	//
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(Запрос.ПолучитьТелоКакСтроку()); //Запрос.ПолучитьТелоКакСтроку("UTF-8")
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим валидность структуры Для заказа
	СкладПолучатель = ПолучитьПоПути(СтруктураВхДанных, "order.delivery_address");
	СкладПолучательID = ПолучитьПоПути(СтруктураВхДанных, "order.delivery_id");
	НомерЗаказаВПриложении = ПолучитьПоПути(СтруктураВхДанных, "order.app_order");
	ОбщаяСтоимостьЗаказа = ПолучитьПоПути(СтруктураВхДанных, "order.order_price");
	МассивТоваров = ПолучитьПоПути(СтруктураВхДанных, "order.items");
	
	//Заполнены ли основные параметры
	Если ЗначениеЗаполнено(СкладПолучательID)
		И ЗначениеЗаполнено(НомерЗаказаВПриложении)
		И ЗначениеЗаполнено(ОбщаяСтоимостьЗаказа)
		И ТипЗнч(ОбщаяСтоимостьЗаказа) = Тип("Число")
		И ОбщаяСтоимостьЗаказа > 0 Тогда
		Если НЕ ЗначениеЗаполнено(МассивТоваров) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_EMPTY");
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Таблица товаров пуста.");
			Возврат Ответ;
		КонецЕсли;
		СкладЗаказа = Справочники.СкладыКомпании.НайтиПоКоду(СкладПолучательID);
		Если СкладЗаказа = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_WAREHOUSE_NOT_FOUND");
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Склад " + Строка(СкладПолучательID) + " не найден по коду.");
			Возврат Ответ;
		КонецЕсли;
	Иначе
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Обязательные реквизиты не заполнены");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Заполнен ли массив товаров корректными данными
	Для Каждого товар Из МассивТоваров Цикл
		Если НЕ (ЗначениеЗаполнено(ПолучитьПоПути(товар, "external_id"))
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "article"))
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "quantity"))
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "external_warehouse_id"))
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "brand"))
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "unit_price"))
				И ТипЗнч(ПолучитьПоПути(товар, "unit_price")) = Тип("Число")
				И ПолучитьПоПути(товар, "unit_price") > 0
				И ЗначениеЗаполнено(ПолучитьПоПути(товар, "position_price"))
				И ТипЗнч(ПолучитьПоПути(товар, "position_price")) = Тип("Число")
				И ПолучитьПоПути(товар, "position_price") > 0
			) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_DATA_INVALID");
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Строка таблицы товаров не заполнена полностью.");
			Возврат Ответ;
		КонецЕсли;
	КонецЦикла;
	//
	
	//Количество товаров не равно 0
	ОбщееКоличество = 0;
	Для Каждого товар Из МассивТоваров Цикл
		Количество = ПолучитьПоПути(товар, "quantity");
		Если ТипЗнч(Количество) = Тип("Число") Тогда
			ОбщееКоличество = ОбщееКоличество + Количество;
		КонецЕсли;
	КонецЦикла;
	Если ОбщееКоличество = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_EMPTY");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Количество позиций для заказа равно 0.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Произведем поиск номенклатуры
	Для Каждого товар Из МассивТоваров Цикл
		КодНоменклатуры = ПолучитьПоПути(товар, "external_id");
		АртикулНоменклатуры = ПолучитьПоПути(товар, "article");
		Бренд = ПолучитьПоПути(товар, "brand");
		
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура = НайтиНоменклатуруПоАртикулу(АртикулНоменклатуры, Бренд)
			КонецЕсли;
		
		Если Номенклатура = Неопределено Тогда
			ОписаниеНоменклатуры = "Код: " + КодНоменклатуры + ", Артикул: " + АртикулНоменклатуры + ", Бренд: " + Бренд;
			Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_RESOURCE_NOT_FOUND", ОписаниеНоменклатуры);
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Номенклатура не найдена. " + ОписаниеНоменклатуры);
			Возврат Ответ;
		КонецЕсли;
		
		товар.Вставить("Номенклатура", Номенклатура);
		
	КонецЦикла;
	//
	
	//Определим склады
	Для Каждого товар Из МассивТоваров Цикл
		КодСклада = ПолучитьПоПути(товар, "external_warehouse_id");
		
		Склад = Справочники.СкладыКомпании.НайтиПоКоду(КодСклада);
		
		Если Склад = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_WAREHOUSE_NOT_FOUND", "Код: " + КодСклада);
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Склад не найден. Код: " + КодСклада);
			Возврат Ответ;
		КонецЕсли;
		
		товар.Вставить("СкладыКомпании", Склад);
		
	КонецЦикла;
	//
	
	//Создадим таблицу
	//описание типов требуется для использования таблицы в запросе
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваров.Колонки.Добавить("МестоРазмещения", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании")); //Склад для Документа Резервирование Заказов
	ТаблицаТоваров.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании")); //Склад для Документа Заказ Покупателя
	ТаблицаТоваров.Колонки.Добавить("Цена");
	Для Каждого товар Из МассивТоваров Цикл
		Количество = ПолучитьПоПути(товар, "quantity");
		Цена = ПолучитьПоПути(товар, "unit_price");
		
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.Номенклатура = товар.Номенклатура;
		НоваяСтрока.Количество = Количество;
		НоваяСтрока.МестоРазмещения = товар.СкладыКомпании;
		НоваяСтрока.Поставщик = товар.СкладыКомпании;
		НоваяСтрока.Цена = Цена;
		
	КонецЦикла;
	//
	
	//Проверим что сумма количества товаров не равна 0
	Если ТаблицаТоваров.Итог("Количество") = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_EMPTY");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Количество позиций для заказа равно 0.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что все товары есть на остатках
	ТаблицаОстатковТоваров = ПолучитьОстаткиПоТаблице(ТаблицаТоваров);
	ТовараНедостаточно = Ложь;
	СписокОшибок = "";
	Для Каждого товар Из ТаблицаОстатковТоваров Цикл
		Если НЕ товар.ДостаточноДляЗаказа Тогда
			ТовараНедостаточно = Истина;
			СтрокаНоменклатуры = "Товара <" + Строка(товар.Номенклатура) + "> не хватает для резервирования. Резервируется - " + товар.Количество + ", На свободном остатке - " + товар.СвободныйОстаток;
			Если СписокОшибок = "" Тогда
				СписокОшибок = СтрокаНоменклатуры;
			Иначе
				СписокОшибок = СписокОшибок + Символы.ПС + СтрокаНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ТовараНедостаточно Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_WAREHOUSE_EMPTY", СписокОшибок);
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , СписокОшибок);
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Создадим заказ покупателя и резервирование под заказ покупателя в одной транзации
	ДокументСсылкаНаЗаказ = Неопределено;
	ДокументСсылкаНаРезервирование = Неопределено;
	НачатьТранзакцию();
	//Заказ Покупателя
	Попытка
		ДокОбъектЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
		
		// Получим ссылку на набор прав и переменных окружения
		Попытка ПраваПользователя = ДокОбъектЗаказ.Права;
		Исключение ПраваПользователя = Неопределено;
		КонецПопытки;
		//Типы цен
		ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", ПраваПользователя, , ДокОбъектЗаказ);
		ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", ПраваПользователя, , ДокОбъектЗаказ);
		ТипЦенРабот = обПраво("ОсновнойТипЦенРабот", ПраваПользователя, , ДокОбъектЗаказ);
		
		ДокОбъектЗаказ.Права = ПраваПользователя;
		ДокОбъектЗаказ.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъектЗаказ.БлокироватьПерерасчетСкидок = Ложь;
		ДокОбъектЗаказ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ДокОбъектЗаказ.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ДокОбъектЗаказ.КурсВалютыУпр = 1;
		ДокОбъектЗаказ.КурсДокумента = 1;
		ДокОбъектЗаказ.Менеджер = ПараметрыСеанса.Пользователь;
		ДокОбъектЗаказ.УстановитьНовыйНомер();
		ДокОбъектЗаказ.Организация = ПараметрыСеанса.Организация;
		ДокОбъектЗаказ.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		ДокОбъектЗаказ.ТипЦен = ТипЦенПродажи;
		ДокОбъектЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
		ДокОбъектЗаказ.ДатаСоздания = ТекущаяДатаСеанса();
		ДокОбъектЗаказ.Дата = ТекущаяДатаСеанса();
		ДокОбъектЗаказ.СкладКомпании = СкладЗаказа;
		ДокОбъектЗаказ.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
		ДокОбъектЗаказ.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		
		//Определим контрагента заказа
		КонтрагентПоУмолчанию = Константы.О2_API_КонтрагентДляЗаказов.Получить();
		Если ЗначениеЗаполнено(КонтрагентПоУмолчанию) Тогда
			ДокОбъектЗаказ.Контрагент = КонтрагентПоУмолчанию;
		Иначе
			ДокОбъектЗаказ.Контрагент = Справочники.Контрагенты.ОсновнойПокупатель;
		КонецЕсли;
		
		//Создадим договор
		НовыйДоговор = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
		НовыйДоговор.УстановитьНовыйКод();
		НовыйДоговор.Владелец = ДокОбъектЗаказ.Контрагент;
		НовыйДоговор.Организация = ДокОбъектЗаказ.Организация;
		НовыйДоговор.Подразделение = ДокОбъектЗаказ.ПодразделениеКомпании;
		НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
		НовыйДоговор.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		НовыйДоговор.ДляАвтосалона = Ложь;
		НовыйДоговор.ДляАвтосервиса = Истина;
		НовыйДоговор.Внутренний = Ложь;
		НовыйДоговор.ВалютаВзаиморасчетов = ДокОбъектЗаказ.ВалютаДокумента;
		НовыйДоговор.ДатаНачала = ТекущаяДатаСеанса();
		НовыйДоговор.ТипЦенПокупки = ТипЦенПокупки;
		НовыйДоговор.ТипЦенПродажи = ТипЦенПродажи;
		НовыйДоговор.ТипЦенРабот = ТипЦенРабот;
		НовыйДоговор.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		НовыйДоговор.ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
		НовыйДоговор.Основной = Ложь;
		НовыйДоговор.ОтменаКонтроляСуммыКредита = Ложь;
		НовыйДоговор.СформироватьНаименование();
		НовыйДоговор.ПроверятьЗаполнение = Ложь;
		НовыйДоговор.АвтоЗакрытиеСделок = Ложь;
		НовыйДоговор.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах", ДокОбъектЗаказ.Права, , ДокОбъектЗаказ.ПодразделениеКомпании);
		НовыйДоговор.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000007");
		НовыйДоговор.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		НовыйДоговор.Записать();
		
		ДокОбъектЗаказ.ДоговорВзаиморасчетов = НовыйДоговор.Ссылка;
		
		//добавлять Колонки последовательно
		ДокОбъектЗаказ.Товары.Загрузить(ТаблицаТоваров);
		ДокОбъектЗаказ.Товары.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"), "Номенклатура");
		Для Каждого товар Из ДокОбъектЗаказ.Товары Цикл
			ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Номенклатура", товар, );
		КонецЦикла;
		ДокОбъектЗаказ.Товары.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Количество"), "Количество");
		Для Каждого товар Из ДокОбъектЗаказ.Товары Цикл
			ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Количество", товар, );
		КонецЦикла;
		ДокОбъектЗаказ.Товары.ЗагрузитьКолонку(ТаблицаТоваров.ВыгрузитьКолонку("Цена"), "Цена");
		Для Каждого товар Из ДокОбъектЗаказ.Товары Цикл
			ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Цена", товар, );
			ДокОбъектЗаказ.ОбработкаРеквизита("Товары.СтавкаНДС", товар, );
		КонецЦикла;
		
		ДокОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		
		ДокументСсылкаНаЗаказ = ДокОбъектЗаказ.Ссылка;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		ОтменитьТранзакцию();
		Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	
	//Резерв под заказ покупателя
	Попытка
		ДокОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
		ДокОбъектРезерв.Заполнить(ДокументСсылкаНаЗаказ);
		ДокОбъектРезерв.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъектРезерв.УстановитьНовыйНомер();
		ДокОбъектРезерв.Организация = ПараметрыСеанса.Организация;
		ДокОбъектРезерв.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		ДокОбъектРезерв.ХозОперация = Справочники.ХозОперации.РезервированиеПодЗаказПокупателя;
		ДокОбъектРезерв.ДатаСоздания = ТекущаяДатаСеанса();
		ДокОбъектРезерв.Дата = ТекущаяДатаСеанса();
		ДокОбъектРезерв.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		ДокОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		
		ОтменитьТранзакцию();
		Ответ = ВернутьОшибку("ERR_ORDER_RESERVE_CREATE_FAILED", ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	//
	
	//Запишем состояние заказа покупателя - создан
	//ЗаписатьСтатусЗаказа(ДокументСсылкаНаЗаказ, Перечисления.О2_API_СтатусыЗаказов.Создан);
	//
	
	//Вернем ответ
	//Структура ошибки
	СтруктураОтвета = Новый Структура;
	МассивОшибок = Новый Массив;
	МассивТоваров = Новый Массив;
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("article");
	ТаблицаТоваров.Колонки.Добавить("external_id");
	ТаблицаТоваров.Колонки.Добавить("name");
	ТаблицаТоваров.Колонки.Добавить("brand");
	ТаблицаТоваров.Колонки.Добавить("quantity");
	ТаблицаТоваров.Колонки.Добавить("position_price");
	ТаблицаТоваров.Колонки.Добавить("is_analog");
	ТаблицаТоваров.Колонки.Добавить("external_warehouse_id");
	ТаблицаТоваров.Колонки.Добавить("external_warehouse_address");
	ТаблицаТоваров.Колонки.Добавить("arrival_at");
	
	Для Каждого СтрокаТовара Из ДокументСсылкаНаЗаказ.Товары Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		НоваяСтрока.article = СтрокаТовара.Номенклатура.Артикул;
		НоваяСтрока.external_id = СтрокаТовара.Номенклатура.Код;
		НоваяСтрока.name = СтрокаТовара.Номенклатура.НаименованиеПолное;
		НоваяСтрока.brand = СтрокаТовара.Номенклатура.Производитель.Наименование;
		НоваяСтрока.quantity = СтрокаТовара.Количество;
		НоваяСтрока.position_price = СтрокаТовара.СуммаВсего;
		НоваяСтрока.is_analog = False;
		НоваяСтрока.external_warehouse_id = СтрокаТовара.Поставщик.Код;
		НоваяСтрока.external_warehouse_address = "";
		НоваяСтрока.arrival_at = "";
	КонецЦикла;
	
	СтруктураОтвета.Вставить("order_id", Строка(ДокументСсылкаНаЗаказ.УникальныйИдентификатор()));
	СтруктураОтвета.Вставить("order_price", ДокументСсылкаНаЗаказ.СуммаДокумента);
	СтруктураОтвета.Вставить("delivery_address", "");
	СтруктураОтвета.Вставить("delivery_id", ДокументСсылкаНаЗаказ.СкладКомпании.Код);
	СтруктураОтвета.Вставить("status", Строка(Перечисления.О2_API_СтатусыЗаказов.Создан));
	СтруктураОтвета.Вставить("comment", Перечисления.О2_API_СтатусыЗаказов.Создан.Метаданные().ЗначенияПеречисления.Создан.Комментарий);
	СтруктураОтвета.Вставить("items", ПолучитьМассивСтруктурИзТаблицы(ТаблицаТоваров));
	СтруктураОтвета.Вставить("warnings", МассивОшибок);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, ДокументСсылкаНаЗаказ, "Заказ создан.");
	Возврат Ответ;
КонецФункции

Функция cancel_orderPOST(Запрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, Запрос);
	//
	
	// МЕТОД НЕ АКТУАЛЕН
	Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Метод не актуален.");
	Возврат Ответ;
	//
	
	IDЗаказа = Строка(Запрос.ПараметрыUrl.Получить("orderId"));
	Если НЕ ЗначениеЗаполнено(IDЗаказа) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не указан ID заказа.");
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		GUID = Новый УникальныйИдентификатор(IDЗаказа);
	Исключение
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "ID заказа не является GUID: " + IDЗаказа);
		Возврат Ответ;
	КонецПопытки;
	
	ЗаказПоID = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(IDЗаказа));
	Если ЗаказПоID = Неопределено ИЛИ ЗаказПоID = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Заказ не найден по ID: " + IDЗаказа);
		Возврат Ответ;
	КонецЕсли;
	
	//Проверим что заказ является заказом o2
	Если НЕ ЗначениеЗаполнено(ЗаказПоID.О2_API_IDЗаказа) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_CREATED_API");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Заказ не является заказом O2 API: " + IDЗаказа);
		Возврат Ответ;
	КонецЕсли;
	
	ТекущийСтатусЗаказа = ПолучитьТекущийСтатусЗаказа(ТекущаяДатаСеанса(), ЗаказПоID);
	Если ТекущийСтатусЗаказа = Перечисления.О2_API_СтатусыЗаказов.Отменён Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ALREADY_CANCELLED");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, ЗаказПоID, "Заказ уже отменен.");
		Возврат Ответ;
	ИначеЕсли ТекущийСтатусЗаказа = Перечисления.О2_API_СтатусыЗаказов.Реализован Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ALREADY_COMPLETED");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, ЗаказПоID, "Заказ реализован. Отмена невозможна.");
		Возврат Ответ;
	КонецЕсли;
	
	
	//Отменим заказ
	ДокОбъект = Документы.СнятиеРезервовЗаказовПокупателя.СоздатьДокумент();
	ДокОбъект.Заполнить(ЗаказПоID);
	ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.Организация = ПараметрыСеанса.Организация;
	ДокОбъект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ДокОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	ДокОбъект.КорректировкаЗаказа = Истина;
	ДокОбъект.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Ответ = ВернутьОшибку("ERR_ORDER_CANCEL_FAILED", ТекстОшибки);
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, ЗаказПоID, "Ошибка при отмене заказа: " + ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	ДокСсылкаОтмены = ДокОбъект.Ссылка;
	
	//Запишем состояние заказа покупателя - отменён
	//ЗаписатьСтатусЗаказа(ЗаказПоID, Перечисления.О2_API_СтатусыЗаказов.Отменён);
	
	//Вернем ответ
	СтруктураОтвета = Новый Структура;
	МассивОтмен = Новый Массив;
	МассивОшибок = Новый Массив;
	
	Для Каждого СтрокаОтмены Из ДокСсылкаОтмены.Товары Цикл
		СтруктураПозиции = Новый Структура;
		СтруктураПозиции.Вставить("external_id", СтрокаОтмены.Номенклатура.код);
		СтруктураПозиции.Вставить("cancelled_quantity", СтрокаОтмены.Количество);
		МассивОтмен.Добавить(СтруктураПозиции);
	КонецЦикла;
	СтруктураОтвета.Вставить("items_count", ДокСсылкаОтмены.Товары.Количество());
	
	СтруктураОтвета.Вставить("order_id", IDЗаказа);
	СтруктураОтвета.Вставить("cancellation_result", МассивОтмен);
	СтруктураОтвета.Вставить("warnings", МассивОшибок);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, ЗаказПоID, "Заказ отменен.");
	Возврат Ответ;
КонецФункции
// НЕ ИСПОЛЬЗУЕТСЯ --
#КонецОбласти

Функция statesGET(Запрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, Запрос);
	//
	
	// МЕТОД СЛЕДУЕТ ДОРАБОТАТЬ
	Ответ = ВернутьОшибку("ERR_STATES_ORDERS_IDS_INVALID");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Метод не актуален с учетом изменений структуры заказа.");
	Возврат Ответ;
	
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(Запрос.ПолучитьТелоКакСтроку());
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим наличие массива заказов
	Если СтруктураВхДанных.Свойство("orders") = Ложь Тогда
		Ответ = ВернутьОшибку("ERR_STATES_ORDERS_IDS_INVALID");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не указан массив заказов.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что массив заказов не пустой
	МассивЗаказов = ПолучитьПоПути(СтруктураВхДанных, "orders");
	Если МассивЗаказов.Количество() = 0 Тогда
		Ответ = ВернутьОшибку("ERR_STATES_ORDERS_IDS_INVALID");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Массив заказов пустой.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что массив заказов содержит уникальные значения и содержит только GUID значения
	МассивЗаказовУникальные = Новый Массив;
	МассивЗаказовСсылки = Новый Массив;
	Для Каждого Заказ Из МассивЗаказов Цикл
		Если МассивЗаказовУникальные.Найти(Заказ) = Неопределено Тогда
			Попытка
				GUID = Новый УникальныйИдентификатор(Заказ);
			Исключение
				Ответ = ВернутьОшибку("ERR_STATES_ORDERS_IDS_INVALID");
				ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "ID заказа не является GUID: " + Заказ);
				Возврат Ответ;
			КонецПопытки;
			//Проверим что заказ существует
			ЗаказПоGUID = Документы.ЗаявкаНаРемонт.ПолучитьСсылку(GUID);
			Если ЗаказПоGUID = Неопределено ИЛИ ЗаказПоGUID = Документы.ЗаявкаНаРемонт.ПустаяСсылка() Тогда
				Ответ = ВернутьОшибку("ERR_STATES_ORDERS_IDS_INVALID");
				ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Заказ не найден по ID: " + Заказ);
				Возврат Ответ;
			КонецЕсли;
			//Добавим уникальный заказ в массив уникальных заказов
			МассивЗаказовУникальные.Добавить(Заказ);
			МассивЗаказовСсылки.Добавить(ЗаказПоGUID);
		Иначе
			Ответ = ВернутьОшибку("ERR_STATES_REFERENCE_NOT_UNIQUE");
			ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Массив заказов содержит дублирующиеся значения.");
			Возврат Ответ;
		КонецЕсли;
	КонецЦикла;
	//
	
	
	// TODO: Надо проверить массив ссылок что они существуют в регистре статусов заказов.
	//Проверим что массив заказов содержит заказы О2
	//Для Каждого Заказ Из МассивЗаказовСсылки Цикл
	//	Если НЕ ЗначениеЗаполнено(Заказ.О2_API_IDЗаказа) Тогда
	//		Ответ = ВернутьОшибку("ERR_STATES_DOESNT_CREATED_API");
	//		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Заказ не является заказом O2 API: " + Заказ);
	//		Возврат Ответ;
	//	КонецЕсли;
	//КонецЦикла;
	//
	
	//Отправим ответ
	СтруктураОтвета = Новый Структура;
	МассивЗаказовДляОтвета = Новый Массив;
	
	Для Каждого Заказ Из МассивЗаказовСсылки Цикл
		СтатусЗаказа = ПолучитьТекущийСтатусЗаказа(ТекущаяДатаСеанса(), Заказ);
		СтруктураЗаказа = Новый Структура;
		СтруктураЗаказа.Вставить("order_id", Строка(Заказ.УникальныйИдентификатор()));
		СтруктураЗаказа.Вставить("app_order", Заказ.О2_API_IDЗаказа);
		СтруктураЗаказа.Вставить("order_price", Заказ.СуммаДокумента);
		СтруктураЗаказа.Вставить("delivery_address", "");
		СтруктураЗаказа.Вставить("delivery_id", Заказ.СкладКомпании.Код);
		СтруктураЗаказа.Вставить("status", Строка(СтатусЗаказа));
		СтруктураЗаказа.Вставить("comment", ПолучитьКомментарийПеречисления(СтатусЗаказа));
		СтруктураЗаказа.Вставить("created_at", Заказ.ДатаСоздания);
		МассивТоваровЗаказа = Новый Массив;
		Для Каждого СтрокаТовара Из Заказ.Товары Цикл
			
			СтруктураРесурса = Новый Структура;
			СтруктураРесурса.Вставить("article", СтрокаТовара.Номенклатура.Артикул);
			СтруктураРесурса.Вставить("external_id", СтрокаТовара.Номенклатура.Код);
			СтруктураРесурса.Вставить("name", СтрокаТовара.Номенклатура.НаименованиеПолное);
			СтруктураРесурса.Вставить("brand", СтрокаТовара.Номенклатура.Производитель.Наименование);
			СтруктураРесурса.Вставить("unit_of_measure", Строка(СтрокаТовара.Номенклатура.ОсновнаяЕдиницаИзмерения));
			СтруктураРесурса.Вставить("units_per_package", 1);
			СтруктураРесурса.Вставить("partial_sale_allowed", Ложь);
			СтруктураРесурса.Вставить("is_analog", Ложь);
			СтруктураРесурса.Вставить("external_warehouse_id", СтрокаТовара.Поставщик.Код);
			СтруктураРесурса.Вставить("external_warehouse_address", "");
			СтруктураРесурса.Вставить("arrival_at", "");
			
			СтруктураПозиции = Новый Структура;
			СтруктураПозиции.Вставить("resource", СтруктураРесурса);
			СтруктураПозиции.Вставить("quantity", СтрокаТовара.Количество);
			СтруктураПозиции.Вставить("position_price", СтрокаТовара.СуммаВсего);
			
			МассивТоваровЗаказа.Добавить(СтруктураПозиции);
		КонецЦикла;
		СтруктураЗаказа.Вставить("items", МассивТоваровЗаказа);
		
		МассивЗаказовДляОтвета.Добавить(СтруктураЗаказа);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("orders", МассивЗаказовДляОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Статусы заказов получены.");
	Возврат Ответ;
КонецФункции

Функция getallordersGET(Запрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, Запрос);
	//
	
	//Получим все заказы О2
	МассивЗаказовСсылки = Новый Массив;
	
	ЗапросЗаказы = Новый Запрос;
	ЗапросЗаказы.Текст =
		"ВЫБРАТЬ
		|	О2_API_СтатусыЗаказовСрезПоследних.IDЗаказа КАК IDЗаказа,
		|	О2_API_СтатусыЗаказовСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
		|	О2_API_СтатусыЗаказовСрезПоследних.ЗаказПокупателя КАК ЗаказПокупателя,
		|	О2_API_СтатусыЗаказовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.О2_API_СтатусыЗаказов.СрезПоследних(&НаДату, ) КАК О2_API_СтатусыЗаказовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	О2_API_СтатусыЗаказовСрезПоследних.Период УБЫВ";
	
	ЗапросЗаказы.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
	
	РезультатЗапроса = ЗапросЗаказы.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	//Отправим ответ
	СтруктураОтвета = Новый Структура;
	МассивЗаказовДляОтвета = Новый Массив;
	
	// Будем проверять по массиву ссылок чтобы не продублировались данные
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если МассивЗаказовСсылки.Найти(ВыборкаДетальныеЗаписи.ЗаказПокупателя) = Неопределено Тогда
			
			Заказ = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
			// Определим ИД заказа
			IDЗаказа = ВыборкаДетальныеЗаписи.IDЗаказа;
			
			СтруктураДанныхЗаказа = ПолучитьТекущийСтатусЗаказа(ТекущаяДатаСеанса(), IDЗаказа);
			СтатусЗаказа = СтруктураДанныхЗаказа.Статус;
			
			СтруктураЗаказа = Новый Структура;
			СтруктураЗаказа.Вставить("order_id", Строка(Заказ.УникальныйИдентификатор()));
			СтруктураЗаказа.Вставить("app_order", IDЗаказа);
			СтруктураЗаказа.Вставить("order_price", Заказ.СуммаДокумента);
			СтруктураЗаказа.Вставить("delivery_address", "");
			СтруктураЗаказа.Вставить("delivery_id", Заказ.СкладКомпании.Код);
			СтруктураЗаказа.Вставить("status", Строка(СтатусЗаказа));
			СтруктураЗаказа.Вставить("comment", ПолучитьКомментарийПеречисления(СтатусЗаказа));
			СтруктураЗаказа.Вставить("created_at", Заказ.ДатаСоздания);
			МассивТоваровЗаказа = Новый Массив;
			Для Каждого СтрокаТовара Из Заказ.Товары Цикл
				
				СтруктураРесурса = Новый Структура;
				СтруктураРесурса.Вставить("article", СтрокаТовара.Номенклатура.Артикул);
				СтруктураРесурса.Вставить("external_id", СтрокаТовара.Номенклатура.Код);
				СтруктураРесурса.Вставить("name", СтрокаТовара.Номенклатура.НаименованиеПолное);
				СтруктураРесурса.Вставить("brand", СтрокаТовара.Номенклатура.Производитель.Наименование);
				СтруктураРесурса.Вставить("unit_of_measure", Строка(СтрокаТовара.Номенклатура.ОсновнаяЕдиницаИзмерения));
				СтруктураРесурса.Вставить("units_per_package", 1);
				СтруктураРесурса.Вставить("partial_sale_allowed", Ложь);
				СтруктураРесурса.Вставить("is_analog", Ложь);
				СтруктураРесурса.Вставить("external_warehouse_id", СтрокаТовара.Поставщик.Код);
				СтруктураРесурса.Вставить("external_warehouse_address", "");
				СтруктураРесурса.Вставить("arrival_at", "");
				
				СтруктураПозиции = Новый Структура;
				СтруктураПозиции.Вставить("resource", СтруктураРесурса);
				СтруктураПозиции.Вставить("quantity", СтрокаТовара.Количество);
				СтруктураПозиции.Вставить("position_price", СтрокаТовара.СуммаВсего);
				
				МассивТоваровЗаказа.Добавить(СтруктураПозиции);
			КонецЦикла;
			СтруктураЗаказа.Вставить("items", МассивТоваровЗаказа);
			
			МассивЗаказовДляОтвета.Добавить(СтруктураЗаказа);

			МассивЗаказовСсылки.Добавить(Заказ);
		КонецЕсли;
	КонецЦикла;
	//
	
	СтруктураОтвета.Вставить("orders", МассивЗаказовДляОтвета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Все заказы получены.");
	Возврат Ответ;
КонецФункции

Функция itemsGET(Запрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, Запрос);
	//
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(Запрос.ПолучитьТелоКакСтроку());
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим валидность структуры Запроса
	items = ПолучитьПоПути(СтруктураВхДанных, "items");
	Если НЕ ЗначениеЗаполнено(items) ИЛИ ТипЗнч(items) <> Тип("Массив") Тогда
		Ответ = ВернутьОшибку("ERR_ITEMS_NOT_VALID");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Не заполнены значения");
		Возврат Ответ;
	КонецЕсли;
	Если items.Количество() = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ITEMS_NOT_VALID");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "Позиций не найдено");
		Возврат Ответ;
	КонецЕсли;
	
	// Определим массив позиций
	МассивПозиций = Новый СписокЗначений;
	Для Каждого СтрокаПозиции Из items Цикл
		Артикул = ПолучитьПоПути(СтрокаПозиции, "article");
		Бренд = ПолучитьПоПути(СтрокаПозиции, "brand");
		Если ЗначениеЗаполнено(Артикул) И ЗначениеЗаполнено(Бренд) Тогда
			Номенклатура = НайтиНоменклатуруПоАртикулу(Артикул, Бренд);
			Если Номенклатура <> Неопределено Тогда
				МассивПозиций.Добавить(Номенклатура);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	ВЖурнал("Количество номенклатур " + Строка(МассивПозиций.Количество()));
	Если МассивПозиций.Количество() = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ITEMS_NOT_FOUND");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "номенклатуры не найдены");
		Возврат Ответ;
	КонецЕсли;
	
	ПартииПодразделениеКомпании = Новый СписокЗначений();
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000393"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000280"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000354"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000226"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000255"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000273"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000290"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000357"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000217"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000271"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000272"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000133"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000317"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000386"));
	ПартииПодразделениеКомпании.Добавить(Справочники.ПодразделенияКомпании.найтиПоКоду("ЦБ000407"));
	
	ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенЗакупки;
	ДатаОстатковИЦен = НачалоДня(ТекущаяДатаСеанса() + 24 * 60 * 60);
	ТаблицаЦенИОстатков = ВернутьТаблицуЦенИОстатков(ПартииПодразделениеКомпании, ТипЦен, ДатаОстатковИЦен, МассивПозиций);
	
	Если ТаблицаЦенИОстатков.Количество() = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ITEMS_NOT_FOUND");
		ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "номенклатуры не найдены");
		Возврат Ответ;
	КонецЕсли;
	
	// БИЗТЕХ КОВАЛЬ 14.10.2025 ++
	// Масла GAC в литрах
	
	ТоварыGAC_Таблица = Справочники.БТ_СписокКонстантныхЗначений.ПолучитьТаблицуКонстанты("О2 API Жидкости GAC");
	ТоварыGAC_Массив = ТоварыGAC_Таблица.ВыгрузитьКолонку("Значение");
	
	// БИЗТЕХ КОВАЛЬ 14.10.2025 --

	
	СтруктураОтвета = Новый Структура;
	МассивПозиций = Новый Массив;
	Для Каждого Строка Из ТаблицаЦенИОстатков Цикл
		
		//Если Строка.СвободныйОстаток = 0 Тогда
		//	Продолжить;
		//КОнецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура.Производитель.Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПозиции = Новый Структура;
		СтруктураПозиции.Вставить("id", Строка.Номенклатура.Код);
		СтруктураПозиции.Вставить("name", Строка.Номенклатура.Наименование);
		СтруктураПозиции.Вставить("article", Строка.Номенклатура.Артикул);
		СтруктураПозиции.Вставить("brand", Строка.Номенклатура.Производитель.Наименование);
		СтруктураПозиции.Вставить("unit_of_measure", Строка.Номенклатура.БазоваяЕдиницаИзмерения.Наименование);
		СтруктураПозиции.Вставить("quantity", Строка.СвободныйОстаток);
		СтруктураПозиции.Вставить("price", Строка.Цена);
		СтруктураПозиции.Вставить("warehouse_name", ?(ЗначениеЗаполнено(Строка.СкладКомпании), Строка.СкладКомпании.Наименование, ""));
		СтруктураПозиции.Вставить("warehouse_id", ?(ЗначениеЗаполнено(Строка.СкладКомпании), Строка.СкладКомпании.Код, ""));
		
		// БИЗТЕХ КОВАЛЬ 14.10.2025 ++
		// Масла GAC в литрах
		
		//Если найден товар GAC то заменим у него количество и единицу изм на литры
		Если ТоварыGAC_Массив.найти(Строка.Номенклатура) <> Неопределено Тогда
			СтруктураПозиции.unit_of_measure = "л.";
			СтруктураПозиции.quantity = Строка.СвободныйОстаток * Строка.Номенклатура.Объем;
			СтруктураПозиции.price = Окр(Строка.Цена / Строка.Номенклатура.Объем,2);	
		КонецЕсли;
		
		// БИЗТЕХ КОВАЛЬ 14.10.2025 --

		
		МассивПозиций.Добавить(СтруктураПозиции);
	КонецЦикла;
	
	СтруктураОтвета.Вставить("items", МассивПозиций);
	
	Попытка
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
		ТелоОтвета = ЗаписьJSON.Закрыть();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);
		Ответ = ВернутьОшибку("ERR_SERVICE", "Err " + ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, Запрос, Ответ, , "");
	Возврат Ответ;
КонецФункции

Функция Эксперимент(Запрос) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Номенклатура.Код КАК СТРОКА(500)) КАК code,
		|	ВЫРАЗИТЬ(Номенклатура.Артикул КАК СТРОКА(500)) КАК art,
		|	ВЫРАЗИТЬ(Номенклатура.НаименованиеПолное КАК СТРОКА(500)) КАК name,
		|	Номенклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения,
		|	Номенклатура.Производитель КАК Производитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	МассивТЗ = Новый Массив;
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
		СтруктураСтроки = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураСтроки.Вставить(Колонка.Имя, Строка(СтрокаТЗ[Колонка.Имя]));
		КонецЦикла;
		МассивТЗ.Добавить(СтруктураСтроки);
	КонецЦикла;
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("items", МассивТЗ);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;
КонецФункции

Функция create_app_orderPOST(HTTPЗапрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос);
	//
	
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(HTTPЗапрос.ПолучитьТелоКакСтроку());
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим валидность структуры
	НомерЗаказаВПриложении = ПолучитьПоПути(СтруктураВхДанных, "order.app_order");
	СкладПолучательID = ПолучитьПоПути(СтруктураВхДанных, "order.delivery_id");
	МаксимальнаяДатаПоставки = ПолучитьПоПути(СтруктураВхДанных, "order.full_delivery_date");
	
	// Могут быть удалены
	ЮридическоеЛицо = ПолучитьПоПути(СтруктураВхДанных, "order.legalEntity");
	ИсточникЗаказа = ПолучитьПоПути(СтруктураВхДанных, "order.order_source");
	//
	
	СуммаВсегоЗаказа = ПолучитьПоПути(СтруктураВхДанных, "order.order_price");
	ПроцентПредоплаты = ПолучитьПоПути(СтруктураВхДанных, "order.prepayment_percent");
	СуммаПредоплаты = ПолучитьПоПути(СтруктураВхДанных, "order.prepayment_price");
	ВидРемонта = ПолучитьПоПути(СтруктураВхДанных, "order.work_type");
	ДатаНачалаРабот = ПолучитьПоПути(СтруктураВхДанных, "order.scheduled_start_date");
	ДатаОкончанияРабот = ПолучитьПоПути(СтруктураВхДанных, "order.scheduled_end_date");
	МассивРабот = ПолучитьПоПути(СтруктураВхДанных, "order.operations");
	
	//Поля клиента
	ИмяКлиента = ПолучитьПоПути(СтруктураВхДанных, "order.client.client_name");
	EmailКлиента = ПолучитьПоПути(СтруктураВхДанных, "order.client.email");
	ТелефонКлиента = ПолучитьПоПути(СтруктураВхДанных, "order.client.phone_number");
	
	//Поля автомобиля
	ПробегАвто = ПолучитьПоПути(СтруктураВхДанных, "order.car.mileage");
	МаркаАвто = ПолучитьПоПути(СтруктураВхДанных, "order.car.make");
	МодельАвто = ПолучитьПоПути(СтруктураВхДанных, "order.car.model");
	ГосномерАвто = ПолучитьПоПути(СтруктураВхДанных, "order.car.license_plate");
	VINАвто = ПолучитьПоПути(СтруктураВхДанных, "order.car.vin");
	
	//Комментарий клиента
	КомментарийКлиента = ПолучитьПоПути(СтруктураВхДанных, "order.client_comment");
	
	//Конвертируем все строковые значения на всякий случай в строку 
	
	МаркаАвто = ?(ЗначениеЗаполнено(МаркаАвто),Строка(МаркаАвто),"");
	МодельАвто = ?(ЗначениеЗаполнено(МодельАвто),Строка(МодельАвто),"");
	ГосномерАвто = ?(ЗначениеЗаполнено(ГосномерАвто),Строка(ГосномерАвто),"");
	VINАвто = ?(ЗначениеЗаполнено(VINАвто),Строка(VINАвто),"");
	
	//Новые поля по задаче 000000037
	ОплаченЛи = ПолучитьПоПути(СтруктураВхДанных, "order.paid");
	ПолноценныйЗаказ = ПолучитьПоПути(СтруктураВхДанных, "order.start_supply_processing");
	
	//Проверим что массив работ это массив
	Если МассивРабот = Неопределено ИЛИ ТипЗнч(МассивРабот) <> Тип("Массив") Тогда
		МассивРабот = Новый Массив();
	КонецЕсли;
	//
	
	//Проверим что номер заказа заполнен
	Если НЕ ЗначениеЗаполнено(НомерЗаказаВПриложении) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер заказа должен быть заполнен");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Номер заказа должен быть заполнен");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что заказ с таким номером не существует
	ДанныеОЗаказе = ПолучитьТекущийСтатусЗаказа(,Строка(НомерЗаказаВПриложении));
	Если ДанныеОЗаказе <> Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Заказ с номером " + НомерЗаказаВПриложении + " уже существует.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Заказ с номером " + НомерЗаказаВПриложении + " уже существует.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что склад получателя это корректный код склада
	СкладЗаказа = Справочники.СкладыКомпании.НайтиПоКоду(СкладПолучательID);
	Если СкладЗаказа = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_WAREHOUSE_NOT_FOUND");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Склад " + Строка(СкладПолучательID) + " не найден по коду.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что имя клиента заполнено
	Если НЕ ЗначениеЗаполнено(ИмяКлиента) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Имя клиента не заполнено");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Имя клиента не заполнено");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что имя клиента не больше 150 символов
	Если СтрДлина(ИмяКлиента) > 150 Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Имя клиента превышает 150 символов");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Имя клиента превышает 150 символов");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Если почта указана то проверим что email клиента заполнен корректно по регулярному выражению
	Если ЗначениеЗаполнено(EmailКлиента) Тогда
		Если НЕ СтрПодобнаПоРегулярномуВыражению(EmailКлиента,"^[a-zA-Z0-9](?:[a-zA-Z0-9._%+-]*[a-zA-Z0-9_])?@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Почта клиента не соответствует регулярному выражению ""^[a-zA-Z0-9](?:[a-zA-Z0-9._%+-]*[a-zA-Z0-9_])?@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$""");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Почта клиента не соответствует регулярному выражению");
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	//
	
	//Проверим что телефон контрагента соответствует регулярному выражению ^[78]\d{10}$
	Если ЗначениеЗаполнено(ТелефонКлиента) Тогда
		ТелефонКлиента = СтрЗаменить(ТелефонКлиента,"+","");
	КонецЕсли;
	Если НЕ ТелефонКлиента <> Неопределено ИЛИ НЕ СтрПодобнаПоРегулярномуВыражению(ТелефонКлиента,"^[78]\d{10}$") Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Телефон клиента не соответствует регулярному выражению ""^[78]\d{10}$""");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Телефон клиента не соответствует регулярному выражению");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что госномер соответствует регулярному выражению
	// БИЗТЕХ КОВАЛЬ 24.10.2025 ++ Теперь должен заполнен быть либо госномер либо VIN
	Если НЕ ЗначениеЗаполнено(VINАвто) И НЕ ЗначениеЗаполнено(ГосномерАвто) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Госномер автомобиля или VIN не указан");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Госномер автомобиля или VIN не указан");
		Возврат Ответ;
	ИначеЕсли ЗначениеЗаполнено(ГосномерАвто) Тогда
		// Проверим госномер
		Если НЕ ГосномерАвто <> Неопределено ИЛИ НЕ СтрПодобнаПоРегулярномуВыражению(ГосномерАвто,"^[АВЕКМНОРСТУХ]{1}\d{3}[АВЕКМНОРСТУХ]{2}\d{2,3}$") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Госномер автомобиля не соответствует регулярному выражению");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Госномер автомобиля не соответствует регулярному выражению");
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	//
	
	//Проверим что VIN вообще заполнен
	//Если НЕ ЗначениеЗаполнено(VINАвто) Тогда
	//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "VIN номер не указан");
	//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "VIN номер не указан");
	//	Возврат Ответ;
	//КонецЕсли;
	//
	
	//Проверим что Модель автомобиля заполнена
	Если НЕ ЗначениеЗаполнено(МодельАвто) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Модель автомобиля не заполнена");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Модель автомобиля не заполнена");
		Возврат Ответ;
	КонецЕсли;
	//

	//Определимся с цехом по складу
	ЦехЗаказа = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Цеха.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Цеха КАК Цеха
		|ГДЕ
		|	Цеха.СкладКомпании = &СкладКомпании
		|	И Цеха.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("СкладКомпании", СкладЗаказа);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЦехЗаказа = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//Проверим что цех нашли
	Если ЦехЗаказа = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цех заявки на ремонт не определен по складу");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цех заявки на ремонт не определен по складу");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что даты это даты в формате ISO 8601 и преобразуем их
	МаксимальнаяДатаПоставки = ПолучитьДатуИзISO8601(МаксимальнаяДатаПоставки);
	ДатаНачалаРабот = ПолучитьДатуИзISO8601(ДатаНачалаРабот);
	ДатаОкончанияРабот = ПолучитьДатуИзISO8601(ДатаОкончанияРабот);
	Если НЕ ЗначениеЗаполнено(МаксимальнаяДатаПоставки) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Максимальная дата поставки должна быть заполнена");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Максимальная дата поставки должна быть заполнена");
		Возврат Ответ;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаНачалаРабот) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата начала работ должна быть заполнена");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата начала работ должна быть заполнена");
		Возврат Ответ;
	КонецЕсли;
	
	//Временно сделаем дату ДатаОкончанияРабот необязательной 01.10.2025 Коваль ++
	//Если НЕ ЗначениеЗаполнено(ДатаОкончанияРабот) Тогда
	//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата окончания работ должна быть заполнена");
	//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата окончания работ должна быть заполнена");
	//	Возврат Ответ;
	//КонецЕсли;
	//
	
	//проверим что даты начала и окончания работ не пересекаются
	//Временно сделаем дату ДатаОкончанияРабот необязательной 01.10.2025 Коваль ++
	//Если ЗначениеЗаполнено(ДатаОкончанияРабот) Тогда
	//	Если ДатаНачалаРабот >= ДатаОкончанияРабот Тогда
	//		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата начала работ должна быть раньше даты окончания работ");
	//		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата начала работ должна быть раньше даты окончания работ");
	//		Возврат Ответ;
	//	КонецЕсли;
	//КонецЕсли;
	////
	//
	////Проверим что дата начала не прошла
	//Если ДатаНачалаРабот < ТекущаяДатаСеанса() Тогда
	//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата начала работ должна быть больше текущей");
	//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата начала работ должна быть больше текущей");
	//	Возврат Ответ;
	//КонецЕсли;
	//
	
	////Проверим что максимальная дата поставки не прошла
	//Если МаксимальнаяДатаПоставки < ТекущаяДатаСеанса() Тогда
	//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Максимальная дата поставки должна быть больше текущей");
	//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Максимальная дата поставки должна быть больше текущей");
	//	Возврат Ответ;
	//КонецЕсли;
	////
	//
	////Проверим что максимальная дата поставки не раньше начала работ
	//Если МаксимальнаяДатаПоставки > ДатаНачалаРабот Тогда
	//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Максимальная дата поставки должна быть меньше даты начала работ");
	//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Максимальная дата поставки должна быть меньше даты начала работ");
	//	Возврат Ответ;
	//КонецЕсли;
	//
	
	//Проверим что процент предоплаты это число
	Если ТипЗнч(ПроцентПредоплаты) <> Тип("Число") Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Процент предоплаты должен быть числом");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Процент предоплаты должен быть числом");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что сумма предоплаты это число
	Если ТипЗнч(СуммаПредоплаты) <> Тип("Число") Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Сумма предоплаты должна быть числом");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Сумма предоплаты должна быть числом");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что сумма всего заказа это число
	Если ТипЗнч(СуммаВсегоЗаказа) <> Тип("Число") Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Сумма всего заказа должна быть числом");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Сумма всего заказа должна быть числом");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что сумма всего заказа это не 0
	Если СуммаВсегоЗаказа <= 0 Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Сумма всего заказа должна быть больше 0");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Сумма всего заказа должна быть больше 0");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Извлечем номер ТО из массива работ если он заполнен
	НомерТО = Неопределено;
	Для Каждого Работа Из МассивРабот Цикл
		НомерТО = ПолучитьПоПути(Работа, "maintenance_number");
		Если ЗначениеЗаполнено(НомерТО) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//
	
	//Проверим что вид ремонта это Техническое обслуживание" или "Сервисное обслуживание"
	Если ВидРемонта = "Техническое обслуживание" Тогда
		ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000037");
		//Если вид ремонта равен "Техническое обслуживание" и номер ТО не заполнен, то запрос не проходит
		Если НЕ ЗначениеЗаполнено(НомерТО) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер ТО не заполнен");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Номер ТО не заполнен");
			Возврат Ответ;
		КонецЕсли;
		//
	ИначеЕсли ВидРемонта = "Сервисное обслуживание" Тогда
		ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	Иначе
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Вид ремонта должен быть ""Техническое обслуживание"" или ""Сервисное обслуживание""");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Вид ремонта должен быть ""Техническое обслуживание"" или ""Сервисное обслуживание""");
		Возврат Ответ;
	КонецЕсли;
	Если ВидРемонта = Неопределено ИЛИ ВидРемонта = Справочники.ВидыРемонта.ПустаяСсылка() Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Вид ремонта не найден");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Вид ремонта не найден");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что пробег автомобиля это число
	Если ТипЗнч(ПробегАвто) <> Тип("Число") Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Пробег автомобиля должен быть числом");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Пробег автомобиля должен быть числом");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//сделаем отдельный массив товаров
	МассивТоваров = Новый Массив;
	Для Каждого Работа Из МассивРабот Цикл
		МассивТоваровПоРаботе = ПолучитьПоПути(Работа, "items");
		Если МассивТоваровПоРаботе <> Неопределено И ТипЗнч(МассивТоваровПоРаботе) = Тип("Массив") Тогда
			Для Каждого СтруктураТовара Из МассивТоваровПоРаботе Цикл
				МассивТоваров.Добавить(СтруктураТовара);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	//
	
	//Проверим что массив работ заполнен корректными данными
	Для Каждого Работа Из МассивРабот Цикл
		//Проверим что код и имя работы заполнены
		ИдРаботы = ПолучитьПоПути(Работа, "operation_id");
		Если НЕ ЗначениеЗаполнено(ИдРаботы) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Код работы не заполнен");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Код работы не заполнен");
			Возврат Ответ;
		КонецЕсли;
		ИмяРаботы = ПолучитьПоПути(Работа, "operation_name");
		Если НЕ ЗначениеЗаполнено(ИмяРаботы) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Имя работы не заполнено");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Имя работы не заполнено");
			Возврат Ответ;
		КонецЕсли;
		//
		// Найдем работу по коду
		АвтоРабота = Справочники.Автоработы.НайтиПоРеквизиту("О2_API_ID", ИдРаботы);
		Если АвтоРабота = Справочники.Автоработы.ПустаяСсылка() Тогда
			//Если автоработы нет то создаем карточку автоработы сами
			РодительДляСозданияАвтоработы = Справочники.Автоработы.НайтиПоНаименованию("О2 Автоработы");
			Если РодительДляСозданияАвтоработы = Справочники.Автоработы.ПустаяСсылка() Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Не найден родитель ""О2 Автоработы"" для создания автоработы");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Не найден родитель ""О2 Автоработы"" для создания автоработы");
				Возврат Ответ;
			КонецЕсли;
			Если РодительДляСозданияАвтоработы.ЭтоГруппа = ЛОЖЬ Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Найденная карточка ""О2 Автоработы"" для не является родителем");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Найденная карточка ""О2 Автоработы"" для не является родителем");
				Возврат Ответ;
			КонецЕсли;
			НовыйЭлементАвторабота = Справочники.Автоработы.СоздатьЭлемент();
			НовыйЭлементАвторабота.Наименование = ИмяРаботы;
			НовыйЭлементАвторабота.НаименованиеПолное = ИмяРаботы;
			НовыйЭлементАвторабота.Комментарий = "Создано автомотически при создании заказа О2 по API";
			НовыйЭлементАвторабота.Номенклатура = Справочники.Номенклатура.Авторабота;
			НовыйЭлементАвторабота.О2_API_ID = ИдРаботы;
			НовыйЭлементАвторабота.Родитель = РодительДляСозданияАвтоработы;
			Попытка
				НовыйЭлементАвторабота.Записать();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Не удалось создать карточку автоработы с ID " + СТРОКА(ИдРаботы) + "Текст ошибки: " + ТекстОшибки);
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Не удалось создать карточку автоработы с ID " + СТРОКА(ИдРаботы) + "Текст ошибки: " + ТекстОшибки);
				Возврат Ответ;
			КонецПопытки;
			АвтоРабота = НовыйЭлементАвторабота.Ссылка;
		КонецЕсли;
		//
		//Проверим что количество работы это число и больше 0
		//Попросили принудительно 1  - 26.09.2025
		КоличествоРаботы = 1;//ПолучитьПоПути(Работа, "operation_quantity");
		Если ТипЗнч(КоличествоРаботы) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Количество работы должно быть числом");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Количество работы должно быть числом");
			Возврат Ответ;
		КонецЕсли;
		Если КоличествоРаботы <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Количество работы должно быть больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Количество работы должно быть больше 0");
			Возврат Ответ;
		КонецЕсли;
		//
		//Проверим что количество нормочасов это число и больше 0
		Нормочасы = ПолучитьПоПути(Работа, "service_hours_required");
		Если ТипЗнч(Нормочасы) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Нормочасы должны быть числом");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Нормочасы должны быть числом");
			Возврат Ответ;
		КонецЕсли;
		Если Нормочасы <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Нормочасы должны быть больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Нормочасы должны быть больше 0");
			Возврат Ответ;
		КонецЕсли;
		//
		//Проверим стоимость нормочаса это число и больше 0
		СтоимостьНормочаса = ПолучитьПоПути(Работа, "service_hours_cost");
		Если ТипЗнч(СтоимостьНормочаса) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Стоимость нормочаса должна быть числом");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Стоимость нормочаса должна быть числом");
			Возврат Ответ;
		КонецЕсли;
		Если СтоимостьНормочаса <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Стоимость нормочаса должна быть больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Стоимость нормочаса должна быть больше 0");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Найдем ставку НДС
		СтавкаНДС = ПолучитьПоПути(Работа, "vat_type");
		СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию(Строка(СтавкаНДС) + "%");
		Если СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка() Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Ставка НДС " + Строка(СтавкаНДС) + " не найдена");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ставка НДС " + Строка(СтавкаНДС) + " не найдена");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Проверим стоимость работы это число и больше 0
		СтоимостьРаботы = ПолучитьПоПути(Работа, "work_price");
		Если ТипЗнч(СтоимостьРаботы) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Стоимость работы должна быть числом");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Стоимость работы должна быть числом");
			Возврат Ответ;
		КонецЕсли;
		Если СтоимостьРаботы <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Стоимость работы должна быть больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Стоимость работы должна быть больше 0");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Проверим корректность суммы автоработы
		Если СтоимостьРаботы <> Окр(КоличествоРаботы*Нормочасы*СтоимостьНормочаса,2,РежимОкругления.Окр15как20) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Общая стоимость работы должна быть равна Количеству * КоличествуНормочасов * СтоимостиНормочаса");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Общая стоимость работы должна быть равна Количеству * КоличествуНормочасов * СтоимостиНормочаса");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Найдем рабочего по табельному номеру, если он указан 
		ИсполнительСтрока = Строка(ПолучитьПоПути(Работа, "worker_id"));
		Если ЗначениеЗаполнено(ИсполнительСтрока) Тогда
			//Показать ошибку если табельный номер больше 10 символов
			//Это нужно для того чтобы при поиске исполнителя в котором 11 и более символов табельного номера
			//платформа не отсекала лишнее и выполняла поиск как для кода из 10 символов
			Если СтрДлина(ИсполнительСтрока) > 10 Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Табельный номер исполнителя не может быть более 10 символов");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Табельный номер исполнителя не может быть более 10 символов");
				Возврат Ответ;
			КонецЕсли;
			//Найдем исполнителя простым способом и без проверок
			Исполнитель = Справочники.Сотрудники.НайтиПоРеквизиту("ТабельныйНомер", ИсполнительСтрока);
			Если Исполнитель = Справочники.Сотрудники.ПустаяСсылка() Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Исполнитель " + ИсполнительСтрока + " не найден");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Исполнитель " + ИсполнительСтрока + " не найден");
				Возврат Ответ;
			КонецЕсли;
		КонецЕсли;
		//
		
		// Добавим все данные в текущую работу
		Работа.Вставить("Исполнитель", Исполнитель);
		Работа.Вставить("ОбщаяСтоимостьРаботы", СтоимостьРаботы);
		Работа.Вставить("СтавкаНДС", СтавкаНДС);
		Работа.Вставить("Нормочасы", Нормочасы);
		Работа.Вставить("СтоимостьНормочаса", СтоимостьНормочаса);
		Работа.Вставить("Количество", КоличествоРаботы);
		Работа.Вставить("АвтоРабота", АвтоРабота);
		
	КонецЦикла;
	
	// Загрузим товары GAC в память
	ТоварыGAC_Таблица = Справочники.БТ_СписокКонстантныхЗначений.ПолучитьТаблицуКонстанты("О2 API Жидкости GAC");
	ТоварыGAC_Массив = ТоварыGAC_Таблица.ВыгрузитьКолонку("Значение");
	//
	
	//Теперь проверим все товары
	Для Каждого Товар Из МассивТоваров Цикл
		//Вынесем все данные в отдельные переменные
		ИмяТовара = ПолучитьПоПути(Товар, "name"); // Используется для создания номенклатуры
		КодТовара = ПолучитьПоПути(Товар, "external_id");
		АртикулТовара = ПолучитьПоПути(Товар, "article");
		БрендТовара = ПолучитьПоПути(Товар, "brand");
		ЕдиницаИзмеренияТовара = ПолучитьПоПути(Товар, "unit_of_measure"); // Не используется
		КоличествоТовара = ПолучитьПоПути(Товар, "quantity");
		ЦенаЗакупкиТовара = ПолучитьПоПути(Товар, "supplier_unit_price");
		ЦенаТовара = ПолучитьПоПути(Товар, "selling_unit_price");
		СуммаЗакупкиТовара = ПолучитьПоПути(Товар, "position_supplier_price");
		СуммаТовара = ПолучитьПоПути(Товар, "position_selling_price");
		ДатаДоставкиТовара = ПолучитьПоПути(Товар, "arrival_at");
		ИННПоставщика = ПолучитьПоПути(Товар, "supplier_inn_code");
		КПППоставщика = ПолучитьПоПути(Товар, "supplier_kpp_code");
		ДоговорПоставщика = ПолучитьПоПути(Товар, "supplier_contract_number");
		ДатаДоговораПоставщика = ПолучитьПоПути(Товар, "supplier_contract_date");
		СкладКомпании = ПолучитьПоПути(Товар, "external_warehouse_id");
		
		//Проверим что все данные заполнены корректно
		Если НЕ ЗначениеЗаполнено(КодТовара) И (НЕ ЗначениеЗаполнено(АртикулТовара) ИЛИ НЕ ЗначениеЗаполнено(БрендТовара)) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Код или артикул и бренд товара не заполнены");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Код или артикул и бренд товара не заполнены");
			Возврат Ответ;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КоличествоТовара) ИЛИ ТипЗнч(КоличествоТовара) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Количество товара должно быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Количество товара должно быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		
		Если ТипЗнч(ЦенаТовара) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цена товара должна быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цена товара должна быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		Если ЦенаТовара <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цена товара должна быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цена товара должна быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		
		Если ТипЗнч(ЦенаЗакупкиТовара) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цена товара должна быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цена товара должна быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		Если ЦенаЗакупкиТовара <= 0 Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цена товара должна быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цена товара должна быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		
		Если ЦенаТовара < ЦенаЗакупкиТовара Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Цена товара должна быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Цена товара должна быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		//Валидация отключена по задаче 000000037
//		Если ТипЗнч(СуммаТовара) <> Тип("Число") ИЛИ СуммаТовара <= 0 Тогда
//			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Сумма товара должна быть числом и больше 0");
//			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Сумма товара должна быть числом и больше 0");
//			Возврат Ответ;
//		КонецЕсли;
		//
		
		//Найдем каждую номенклатуру
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура = НайтиНоменклатуруПоАртикулу(АртикулТовара, БрендТовара)
		КонецЕсли;
		
		Если Номенклатура = Неопределено Тогда
			// Не показываем ошибку а создаем карточку номенклатуры
			//ОписаниеНоменклатуры = "Код: " + КодТовара + ", Артикул: " + АртикулТовара + ", Бренд: " + БрендТовара;
			//Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_RESOURCE_NOT_FOUND", ОписаниеНоменклатуры);
			//ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Номенклатура не найдена. " + ОписаниеНоменклатуры);
			//Возврат Ответ;
			
			//Проверки для создания номенклатуры
			Если НЕ ЗначениеЗаполнено(ИмяТовара) Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Для создания карточки номенклатуры требуется заполненное имя");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Для создания карточки номенклатуры требуется заполненное имя");
				Возврат Ответ;
			КонецЕсли;
			
			// в Процедуре ПередЗаписью() нужно обрамить все предупреждения под #Если КлиентскоеПриложение Тогда	#КонецЕсли
			
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			// Это плохой подход но другого варианта пока не вижу
			// Решено создавать номенклатуру через Загрузку данных
			// 05.11.2025 ++
			НоваяНоменклатура.ОбменДанными.Загрузка = Истина;
			//
			НоваяНоменклатура.Наименование = ИмяТовара;
			НоваяНоменклатура.НаименованиеПолное = ИмяТовара;
			НоваяНоменклатура.НаименованиеИностранное = ИмяТовара;
			НоваяНоменклатура.Артикул = АртикулТовара;
			НоваяНоменклатура.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Штучный;
			НоваяНоменклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
			НоваяНоменклатура.БазоваяЕдиницаИзмерения = НоваяНоменклатура.ТипНоменклатуры.ОсновнаяБазоваяЕдиницаИзмерения;
			НоваяНоменклатура.ОсновнаяЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт");
			НоваяНоменклатура.Комментарий = "Создана автоматически через API O2";
			НоваяНоменклатура.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			НоваяНоменклатура.ВалютаУчета = Справочники.Валюты.НайтиПоКоду("643");
			НоваяНоменклатура.АртикулДляПоиска = АртикулТовара;
			
			ПроизводительСсылка = Справочники.Производители.НайтиПоНаименованию(БрендТовара);
			Если ПроизводительСсылка = Справочники.Производители.ПустаяСсылка() Тогда
				// Создадим нового производителя а то та же номенклатура не найдется
				НовыйПроизводитель = Справочники.Производители.СоздатьЭлемент();
				НовыйПроизводитель.Наименование = БрендТовара;
				
				Попытка
					НовыйПроизводитель.Записать();
				Исключение
					ТекстОшибки = ОписаниеОшибки();
					ВЖурнал(ТекстОшибки);
					Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании нового производителя: " + ТекстОшибки);
					ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании нового производителя: " + ТекстОшибки);
					Возврат Ответ;
				КонецПопытки;
				
				ПроизводительСсылка = НовыйПроизводитель.Ссылка; 
				
			КонецЕсли;
			
			НоваяНоменклатура.Производитель = ПроизводительСсылка.Ссылка;
			
			Попытка
				НоваяНоменклатура.Записать();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				ВЖурнал(ТекстОшибки);
				Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании новой номенклатуры: " + ТекстОшибки);
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании новой номенклатуры: " + ТекстОшибки);
				Возврат Ответ;
			КонецПопытки;
			
			Номенклатура = НоваяНоменклатура.Ссылка;
			
		КонецЕсли;
		//
		
		// Масла GAC в литрах
		// По массиву проверим что товары GAC есть
		//Если найден товар GAC то заменим у него количество и единицу изм на литры
		Если ТоварыGAC_Массив.найти(Номенклатура) <> Неопределено Тогда
			НовКоличествоТовара = КоличествоТовара / Номенклатура.Объем;
			Попытка
				ВЖурнал(Номенклатура);
				ВЖурнал("Старое количество = " + Строка(КоличествоТовара) + ", Новое = " + Строка(НовКоличествоТовара));
			Исключение
			КонецПопытки;
			КоличествоТовара = НовКоличествоТовара;
		КонецЕсли;
		//		
		
		//Узнаем какой именно это поставщик внутренний или внешний
		ВнешнийПоставщик = Неопределено;
		Если ЗначениеЗаполнено(СкладКомпании) Тогда
			ВнешнийПоставщик = Ложь;
		Иначе
			ВнешнийПоставщик = Истина;
		КонецЕсли;
		//
		
		//Для внутреннего поставщика найдем склад компании
		Если ВнешнийПоставщик = Ложь Тогда
			СкладКомпанииСсылка = Справочники.СкладыКомпании.НайтиПоКоду(СкладКомпании);
			Если СкладКомпанииСсылка = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_WAREHOUSE_NOT_FOUND", "Код: " + СкладКомпании);
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Склад компании не найден. Код: " + СкладКомпании);
				Возврат Ответ;
			КонецЕсли;
			СкладКомпании = СкладКомпанииСсылка;
		Иначе
			СкладКомпании = СкладЗаказа;
		КонецЕсли;
		//
		
		//Проверим что дата доставки заполнена и корректна
		ДатаДоставкиТовара = ПолучитьДатуИзISO8601(ДатаДоставкиТовара);
		Если НЕ ЗначениеЗаполнено(ДатаДоставкиТовара) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата доставки должна быть заполнена");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата доставки должна быть заполнена");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Для внутреннего поставщика сделать проверку что arrival_at должно быть null
//		Если ЗначениеЗаполнено(ДатаДоставкиТовара) Тогда
//			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата доставки должна быть пуста если товар на складе О2");
//			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата доставки должна быть пуста если товар на складе О2");
//			Возврат Ответ;
//		КонецЕсли;
		//
		
		//проверим что дата доставки не прошла
		//Если ДатаДоставкиТовара < ТекущаяДатаСеанса() Тогда
		//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата доставки должна быть больше текущей");
		//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата доставки должна быть больше текущей");
		//	Возврат Ответ;
		//КонецЕсли;
		//
		
		//Проверим что дата доставки не больше даты начала работ
		//Если ДатаДоставкиТовара > ДатаНачалаРабот Тогда
		//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата доставки должна быть больше даты начала работ");
		//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата доставки должна быть больше даты начала работ");
		//	Возврат Ответ;
		//КонецЕсли;
		//
		
		//Проверим что дата доставки равна или не больше даты максимальной доставки
		//Если ДатаДоставкиТовара > МаксимальнаяДатаПоставки Тогда
		//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата доставки товара не может быть больше максимальной даты доставки всего заказа");
		//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата доставки товара не может быть больше максимальной даты доставки всего заказа");
		//	Возврат Ответ;
		//КонецЕсли;
		//
			
		//Для внешнего поставщика выполним проверки
		Если ВнешнийПоставщик = Истина Тогда
			// Проверим данные контрагента
			Если НЕ (ТипЗнч(ИННПоставщика) = Тип("Строка") И ЗначениеЗаполнено(ИННПоставщика)) Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "ИНН поставщика не заполнен");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "ИНН поставщика не заполнен");
				Возврат Ответ;
			КонецЕсли;
			// КПП НЕ ПРОВЕРЯЕМ - Теперь мы контрагента ищем по ИНН+НОМЕРДОГОВОРА+ДАТАДОГОВОРА 31.10.2025
			//Если НЕ (ТипЗнч(КПППоставщика) = Тип("Строка") И ЗначениеЗаполнено(КПППоставщика)) Тогда
			//	Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "КПП поставщика не заполнен");
			//	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "КПП поставщика не заполнен");
			//	Возврат Ответ;
			//КонецЕсли;
			//
			
			//Проверим договор и преобразуем дату
			Если НЕ (ТипЗнч(ДоговорПоставщика) = Тип("Строка") И ЗначениеЗаполнено(ДоговорПоставщика)) Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер договора поставщика не заполнен");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Номер договора поставщика не заполнен");
				Возврат Ответ;
			КонецЕсли;
			
			ДатаДоговораПоставщика = ПолучитьДатуИзISO8601(ДатаДоговораПоставщика);
			Если НЕ ЗначениеЗаполнено(ДатаДоговораПоставщика) Тогда
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата договора поставщика должна быть заполнена");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата договора поставщика должна быть заполнена");
				Возврат Ответ;
			КонецЕсли;
			//
		КонецЕсли;
		//
		
		//Добавим все данные в текущий товар
		Товар.Вставить("Номенклатура", Номенклатура);
		Товар.Вставить("Количество", КоличествоТовара);
		Товар.Вставить("СкладКомпании", СкладКомпании);
		Товар.Вставить("ЦенаТовара", ЦенаТовара);
		Товар.Вставить("СуммаТовара", СуммаТовара);
		Товар.Вставить("ЦенаЗакупки", ЦенаЗакупкиТовара);
		Товар.Вставить("СуммаЗакупки", СуммаЗакупкиТовара);
		Товар.Вставить("ДатаДоставки", ДатаДоставкиТовара);
		Товар.Вставить("ВнешнийПоставщик", ВнешнийПоставщик);
		Товар.Вставить("ИННПоставщика", ИННПоставщика);
		Товар.Вставить("КПППоставщика", КПППоставщика);
		Товар.Вставить("НомерДоговораПоставщика", ДоговорПоставщика);
		Товар.Вставить("ДатаДоговораПоставщика", ДатаДоговораПоставщика);
	КонецЦикла;
	
	// После того как разобрали все позиции проверим что СуммаВсегоЗаказа (order_price) = сумме всех позиций
	ПроверкаСуммаВсехРабот = 0;
	ПроверкаСуммаВсехТоваров = 0;
	ПроверкаСуммаВсего = 0;
	Для Каждого Работа из МассивРабот Цикл
		ПроверкаСуммаВсехРабот = ПроверкаСуммаВсехРабот + Работа.ОбщаяСтоимостьРаботы;
	КонецЦикла;
	Для Каждого Товар из МассивТоваров Цикл
		ПроверкаСуммаВсехТоваров = ПроверкаСуммаВсехТоваров + Товар.СуммаТовара;
	КонецЦикла;
	ПроверкаСуммаВсего = ПроверкаСуммаВсехРабот + ПроверкаСуммаВсехТоваров;
	Если ПроверкаСуммаВсего <> СуммаВсегоЗаказа Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Общая стоимость заказа не соответствует сумме позиций");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Общая стоимость заказа не соответствует сумме позиций");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Создадим таблицу товаров для проверки остатков для последующего резервирования
	//описание типов требуется для использования таблицы в запросе
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваров.Колонки.Добавить("МестоРазмещения", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании")); //Склад для Документа Резервирование Заказов
	ТаблицаТоваров.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании")); //Склад для Документа Заказ Покупателя
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)));
	ТаблицаТоваров.Колонки.Добавить("ВнешнийПоставщик", Новый ОписаниеТипов("Булево"));
	//Создадим отдельную таблицу для поиска контрагентов поставщиков и создание документов "Заказ поставщику"
	ТаблицаТоваровВнешнихПоставщиков = Новый ТаблицаЗначений;
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("ИННПоставщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("КПППоставщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("НомерДоговораПоставщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(20, ДопустимаяДлина.Переменная)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("ДатаДоговораПоставщика", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	ТаблицаТоваровВнешнихПоставщиков.Колонки.Добавить("ДатаДоставки", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Для Каждого Товар Из МассивТоваров Цикл
		Если Товар.ВнешнийПоставщик = Ложь Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = Товар.Номенклатура;
			НоваяСтрока.Количество = Товар.Количество;
			НоваяСтрока.МестоРазмещения = Товар.СкладКомпании;
			НоваяСтрока.Поставщик = Товар.СкладКомпании;
			НоваяСтрока.Цена = Товар.ЦенаТовара;
		ИначеЕсли Товар.ВнешнийПоставщик = Истина Тогда
			НоваяСтрока = ТаблицаТоваровВнешнихПоставщиков.Добавить();
			НоваяСтрока.Номенклатура = Товар.Номенклатура;
			НоваяСтрока.Количество = Товар.Количество;
			НоваяСтрока.Цена = Товар.ЦенаЗакупки;
			НоваяСтрока.ИННПоставщика = Товар.ИННПоставщика;
			НоваяСтрока.КПППоставщика = Товар.КПППоставщика;
			НоваяСтрока.НомерДоговораПоставщика = Товар.НомерДоговораПоставщика;
			НоваяСтрока.ДатаДоговораПоставщика = Товар.ДатаДоговораПоставщика;
			НоваяСтрока.ДатаДоставки = Товар.ДатаДоставки;
		КонецЕсли;
	КонецЦикла;
	//
	
	//Проверим что сумма количества товаров не равна 0
//	Если ТаблицаТоваров.Итог("Количество") + ТаблицаТоваровВнешнихПоставщиков.Итог("Количество") = 0 Тогда
//		Ответ = ВернутьОшибку("ERR_ORDER_EMPTY");
//		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Количество позиций для заказа равно 0.");
//		Возврат Ответ;
//	КонецЕсли;
	//
	
	//Проверим что все товары есть на остатках
	ТаблицаТоваров.Свернуть("Номенклатура,МестоРазмещения","Количество");
	ТаблицаОстатковТоваров = ПолучитьОстаткиПоТаблице(ТаблицаТоваров);
	ТовараНедостаточно = Ложь;
	СписокОшибок = "";
	Для Каждого товар Из ТаблицаОстатковТоваров Цикл
		Если НЕ товар.ДостаточноДляЗаказа Тогда
			ТовараНедостаточно = Истина;
			СтрокаНоменклатуры = "Товара <" + Строка(товар.Номенклатура) + "> не хватает для резервирования. Резервируется - " + товар.Количество + ", На свободном остатке - " + товар.СвободныйОстаток;
			Если СписокОшибок = "" Тогда
				СписокОшибок = СтрокаНоменклатуры;
			Иначе
				СписокОшибок = СписокОшибок + Символы.ПС + СтрокаНоменклатуры;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ТовараНедостаточно Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_WAREHOUSE_EMPTY", СписокОшибок);
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, СписокОшибок);
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Заполним контрагентов поставщиков и их договоры
	Если ТаблицаТоваровВнешнихПоставщиков.Количество() Тогда
		Запрос = Новый Запрос;
		//Сначала заполним менеджер временных таблиц нашей таблицей
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаТоваровВнешнихПоставщиков ИЗ &ТЗ КАК ТЗ";
		Запрос.УстановитьПараметр("ТЗ", ТаблицаТоваровВнешнихПоставщиков);
		Запрос.Выполнить();
		//
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ТаблицаТоваровВнешнихПоставщиков.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваровВнешнихПоставщиков.Количество КАК Количество,
			|	ТаблицаТоваровВнешнихПоставщиков.Цена КАК Цена,
			|	ТаблицаТоваровВнешнихПоставщиков.ИННПоставщика КАК ИННПоставщика,
			|	ТаблицаТоваровВнешнихПоставщиков.КПППоставщика КАК КПППоставщика,
			|	ТаблицаТоваровВнешнихПоставщиков.НомерДоговораПоставщика КАК НомерДоговораПоставщика,
			|	ТаблицаТоваровВнешнихПоставщиков.ДатаДоговораПоставщика КАК ДатаДоговораПоставщика,
			|	ТаблицаТоваровВнешнихПоставщиков.ДатаДоставки КАК ДатаДоставки,
			|	Контрагенты.Ссылка КАК Поставщик,
			|	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
			|	ДоговорыВзаиморасчетов.Владелец КАК Владелец
			|ПОМЕСТИТЬ ТаблицаСКонтрагентами
			|ИЗ
			|	ТаблицаТоваровВнешнихПоставщиков КАК ТаблицаТоваровВнешнихПоставщиков
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО ТаблицаТоваровВнешнихПоставщиков.ИННПоставщика = Контрагенты.ИНН
			|			И (Контрагенты.ЭтоГруппа = ЛОЖЬ)
			|			И (Контрагенты.ПометкаУдаления = ЛОЖЬ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
			|		ПО ТаблицаТоваровВнешнихПоставщиков.НомерДоговораПоставщика = ДоговорыВзаиморасчетов.НомерДоговора
			|			И ТаблицаТоваровВнешнихПоставщиков.ДатаДоговораПоставщика = ДоговорыВзаиморасчетов.ДатаНачала
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаСКонтрагентами.Номенклатура КАК Номенклатура,
			|	ТаблицаСКонтрагентами.Количество КАК Количество,
			|	ТаблицаСКонтрагентами.Цена КАК Цена,
			|	ТаблицаСКонтрагентами.ИННПоставщика КАК ИННПоставщика,
			|	ТаблицаСКонтрагентами.КПППоставщика КАК КПППоставщика,
			|	ТаблицаСКонтрагентами.НомерДоговораПоставщика КАК НомерДоговораПоставщика,
			|	ТаблицаСКонтрагентами.ДатаДоговораПоставщика КАК ДатаДоговораПоставщика,
			|	ВЫБОР
			|		КОГДА ТаблицаСКонтрагентами.Поставщик = ТаблицаСКонтрагентами.Владелец
			|			ТОГДА ТаблицаСКонтрагентами.Поставщик
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК Поставщик,
			|	ТаблицаСКонтрагентами.ДатаДоставки КАК ДатаДоставки,
			|	ВЫБОР
			|		КОГДА ТаблицаСКонтрагентами.Поставщик = ТаблицаСКонтрагентами.Владелец
			|			ТОГДА ТаблицаСКонтрагентами.Ссылка
			|		ИНАЧЕ НЕОПРЕДЕЛЕНО
			|	КОНЕЦ КАК ДоговорПоставщика
			|ИЗ
			|	ТаблицаСКонтрагентами КАК ТаблицаСКонтрагентами
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТаблицаСКонтрагентами";
		
		ТаблицаТоваровВнешнихПоставщиков = Запрос.Выполнить().Выгрузить();
		Запрос.МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	//
	
	//Проверим что все контрагенты и договоры найдены
	ТекстОшибки = "";
	Для Каждого Строка Из ТаблицаТоваровВнешнихПоставщиков Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Поставщик) Тогда
			ТекстОшибки = ТекстОшибки + "Не найден контрагент по ИНН:" + Строка.ИННПоставщика + " и КПП:" + Строка.КПППоставщика + Символы.ПС;
			Продолжить;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Строка.ДоговорПоставщика) Тогда
			ТекстОшибки = ТекстОшибки + "Не найден договор поставщика " + Строка.Поставщик + " с номером " + Строка.НомерДоговораПоставщика + " и датой начала " + Формат(Строка.ДатаДоговораПоставщика, "ДФ=dd.MM.yyyy") + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	Если ТекстОшибки <> "" Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", ТекстОшибки);
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, ТекстОшибки);
		Возврат Ответ;
	КонецЕсли;
	//
	
	// Определим количество создаваемых заказов поставщику по договорам
	Если ТаблицаТоваровВнешнихПоставщиков.Количество() Тогда
		ДоговорыПоставщиков = ТаблицаТоваровВнешнихПоставщиков.Скопировать( , "ДоговорПоставщика");
		ДоговорыПоставщиков.Свернуть("ДоговорПоставщика");
	Иначе
		ДоговорыПоставщиков = ТаблицаТоваровВнешнихПоставщиков.Скопировать();
	КонецЕсли;
	КоличествоДокументовЗаказаПоставщику = ДоговорыПоставщиков.Количество();
	//
	
	//Определим контрагента заказа
	
	//02.02.2025 O2 API - Коваль А.Д.
	//Попробуем найти по телефону
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект КАК СсылкаНаКонтрагента
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтактный)
		|	И КонтактнаяИнформация.Поле5 = &ТелефонКлиента
		|	И КонтактнаяИнформация.ЗначениеПоУмолчанию = ИСТИНА
		|	И ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(Справочник.Контрагенты)";
	
	Запрос.УстановитьПараметр("ТелефонКлиента", ТелефонКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СсылкаНаКонтрагента = ВыборкаДетальныеЗаписи.СсылкаНаКонтрагента;
	КонецЦикла;
	
	//КонтрагентПоУмолчанию = Константы.О2_API_КонтрагентДляЗаказов.Получить();
	//Если НЕ ЗначениеЗаполнено(КонтрагентПоУмолчанию) Тогда
	//	КонтрагентПоУмолчанию = Справочники.Контрагенты.ОсновнойПокупатель;
	//КонецЕсли;
	//
	
	//Права пользователя и Типы цен
	ДокОбъектДляПрав = Документы.ЗаявкаНаРемонт.СоздатьДокумент();
	// Получим ссылку на набор прав и переменных окружения
	Попытка ПраваПользователя = ДокОбъектДляПрав.Права;
	Исключение ПраваПользователя = Неопределено;
	КонецПопытки;
	ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", ПраваПользователя);
	ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", ПраваПользователя);
	ТипЦенРабот = обПраво("ОсновнойТипЦенРабот", ПраваПользователя);
	ДокОбъектДляПрав = Неопределено;
	//
	
	//Получим основной нормочас
	ОсновнойНормочас = Константы.О2_API_Нормочас.Получить();
	Если ОсновнойНормочас = Неопределено ИЛИ ОсновнойНормочас = Справочники.Нормочасы.ПустаяСсылка() Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Основной нормочас не найден");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Основной нормочас не найден");
		Возврат Ответ;
	КонецЕсли;
	//
	
	// Создадим документы в одной транзакции
	// Создаваемые документы:
	// 1. Заявка на ремонт
	// 2. Заказ покупателя
	// 3. Резервирование под заказ покупателя
	// 4. Заказ поставщика (Столько документов сколько поставщиков)
	
	// Также создадим контрагента и договор на заявку на ремонт и заказ покупателя
	// Если заказ еще и оплачен то нужно создать счет на оплату и чек на оплату
	
	
	ДокументСсылкаНаЗаявкуНаРемонт = Неопределено;
	ДокументСсылкаНаЗаказПокупателя = Неопределено;
	ДокументСсылкаНаРезервированиеЗаказаПокупателя = Неопределено;
	МассивДокументСсылкаНаЗаказПоставщика = Новый Массив;
	СправочникСсылкаНаДоговорВзаиморасчетов = Неопределено;
	ДокументСсылкаНаСчетНаОплату = Неопределено;
	ДокументСсылкаНаЧекПредоплаты = Неопределено;
	
	НачатьТранзакцию();
	
	// Создадим контрагента если не нашли его по номеру телефона
	Если СсылкаНаКонтрагента = Неопределено Тогда
		КЛОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		КЛОбъект.УстановитьНовыйКод();
		КЛОбъект.Наименование=СокрЛП(ИмяКлиента);
		КЛОбъект.Фамилия=ИмяКлиента;
		КЛОбъект.НаименованиеПолное = СокрЛП(ИмяКлиента);
		КЛОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;
		КЛОбъект.ВидКонтрагента=Перечисления.ВидыКонтрагентов.Покупатель;
		КЛОбъект.ОсновнойТелефон = ТелефонКлиента;
		КЛОбъект.Автор = ПараметрыСеанса.Пользователь;
		КЛОбъект.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Спрашивать;
		
		Попытка
			КЛОбъект.Записать();
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ОтменитьТранзакцию();
			ВЖурнал(ТекстОшибки);
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании карточки контрагента: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании карточки контрагента: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		
		// Запишем контактную информацию контрагента
		Попытка
			КЛСсылка = КЛОбъект.Ссылка;
			НаборЗаписей = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Значение      = КЛСсылка;
			НаборЗаписей.Отбор.Объект.Использование = Истина;
			
			// создадим запись в наборе регистра сведений для телефона		
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = КЛСсылка;
			Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный;
			Запись.ЗначениеПоУмолчанию = Истина;
			Запись.Поле5 = ТелефонКлиента;
			Запись.Представление = ТелефонКлиента;
			
			// создадим запись в наборе регистра сведений для Почты		
			Если ЗначениеЗаполнено(EmailКлиента) Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = КЛСсылка;
				Запись.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий;
				Запись.ЗначениеПоУмолчанию = Истина;
				Запись.Представление = EmailКлиента;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			
		Исключение
			Сообщить("Запись контактной информации контактного лица не удалась!.",СтатусСообщения.Важное);
			ОтменитьТранзакцию();
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при записи контактной информации контрагента: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при записи контактной информации контрагента: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		
		СсылкаНаКонтрагента = КЛСсылка;
		
	КонецЕсли;
	
	// Договор взаиморасчетов
	ОбъектДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.СоздатьЭлемент();
	ОбъектДоговорВзаиморасчетов.УстановитьНовыйКод();
	ОбъектДоговорВзаиморасчетов.Владелец = СсылкаНаКонтрагента;
	ОбъектДоговорВзаиморасчетов.Организация = СкладЗаказа.Организация;
	ОбъектДоговорВзаиморасчетов.Подразделение = СкладЗаказа.Подразделение;
	ОбъектДоговорВзаиморасчетов.ВидДоговора = Перечисления.ВидыДоговоров.Продажа;
	ОбъектДоговорВзаиморасчетов.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
	ОбъектДоговорВзаиморасчетов.ДляАвтосалона = Ложь;
	ОбъектДоговорВзаиморасчетов.ДляАвтосервиса = Истина;
	ОбъектДоговорВзаиморасчетов.Внутренний = Ложь;
	ОбъектДоговорВзаиморасчетов.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	ОбъектДоговорВзаиморасчетов.ДатаНачала = ТекущаяДатаСеанса();
	ОбъектДоговорВзаиморасчетов.ТипЦенПокупки = ТипЦенПокупки;
	ОбъектДоговорВзаиморасчетов.ТипЦенПродажи = ТипЦенПродажи;
	ОбъектДоговорВзаиморасчетов.ТипЦенРабот = ТипЦенРабот;
	ОбъектДоговорВзаиморасчетов.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
	ОбъектДоговорВзаиморасчетов.ТипСкидкиНаценки = Справочники.ТипыСкидок.ПустаяСсылка();
	ОбъектДоговорВзаиморасчетов.Основной = Ложь;
	ОбъектДоговорВзаиморасчетов.ОтменаКонтроляСуммыКредита = Ложь;
	ОбъектДоговорВзаиморасчетов.СформироватьНаименование();
	ОбъектДоговорВзаиморасчетов.ПроверятьЗаполнение = Ложь;
	ОбъектДоговорВзаиморасчетов.АвтоЗакрытиеСделок = Ложь;
	ОбъектДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах = обПраво("ЕдиницаИзмеренияАвтоработВПечатныхФормах", ПраваПользователя);
	ОбъектДоговорВзаиморасчетов.тт_ВидДоговора = Справочники.тт_ВидыДоговоров.НайтиПоКоду("000000007");
	ОбъектДоговорВзаиморасчетов.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	
	Попытка
		ОбъектДоговорВзаиморасчетов.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ВЖурнал(ТекстОшибки);
		ОтменитьТранзакцию();
		Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании договора взаиморасчетов: " + ТекстОшибки);
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании договора взаиморасчетов: " + ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	СправочникСсылкаНаДоговорВзаиморасчетов = ОбъектДоговорВзаиморасчетов.Ссылка;
	//
	
	// Заявка на ремонт
	Попытка
		ДокОбъектЗаявкиНаРемонт = Документы.ЗаявкаНаРемонт.СоздатьДокумент();
		
		// Получим ссылку на набор прав и переменных окружения
		Попытка ПраваПользователя = ДокОбъектЗаявкиНаРемонт.Права;
		Исключение ПраваПользователя = Неопределено;
		КонецПопытки;
		
		ДокОбъектЗаявкиНаРемонт.Права = ПраваПользователя;
		ДокОбъектЗаявкиНаРемонт.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъектЗаявкиНаРемонт.БлокироватьПерерасчетСкидок = Ложь;
		ДокОбъектЗаявкиНаРемонт.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		ДокОбъектЗаявкиНаРемонт.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
		ДокОбъектЗаявкиНаРемонт.КурсВалютыУпр = 1;
		ДокОбъектЗаявкиНаРемонт.КурсДокумента = 1;
		ДокОбъектЗаявкиНаРемонт.Диспетчер = ПараметрыСеанса.Пользователь;
		ДокОбъектЗаявкиНаРемонт.УстановитьНовыйНомер();
		ДокОбъектЗаявкиНаРемонт.Организация = СкладЗаказа.Организация;
		ДокОбъектЗаявкиНаРемонт.ПодразделениеКомпании = СкладЗаказа.Подразделение;
		ДокОбъектЗаявкиНаРемонт.ТипЦен = ТипЦенПродажи;
		ДокОбъектЗаявкиНаРемонт.ТипЦенРабот = ТипЦенПродажи;
		ДокОбъектЗаявкиНаРемонт.ХозОперация = Справочники.ХозОперации.ПланРемонта;
		ДокОбъектЗаявкиНаРемонт.Дата = ТекущаяДатаСеанса();
		ДокОбъектЗаявкиНаРемонт.ИсполнителиДляВсехРабот = Ложь;
		ДокОбъектЗаявкиНаРемонт.Цех = ЦехЗаказа;
		ДокОбъектЗаявкиНаРемонт.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
		ДокОбъектЗаявкиНаРемонт.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		
		Если ЗначениеЗаполнено(НомерТО) И ЗначениеЗаполнено(КомментарийКлиента) Тогда
			ДокОбъектЗаявкиНаРемонт.ПричинаОбращения = Строка(НомерТО) + ";" + Строка(КомментарийКлиента);
		ИначеЕсли ЗначениеЗаполнено(НомерТО) И НЕ ЗначениеЗаполнено(КомментарийКлиента) Тогда
			ДокОбъектЗаявкиНаРемонт.ПричинаОбращения = Строка(НомерТО) + ";";
		ИначеЕсли ЗначениеЗаполнено(КомментарийКлиента) И НЕ ЗначениеЗаполнено(НомерТО) Тогда
			ДокОбъектЗаявкиНаРемонт.ПричинаОбращения = ";" + Строка(КомментарийКлиента);
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ТелефонКлиента) Тогда
		//	ДокОбъектЗаявкиНаРемонт.Заказчик = Строка(ИмяКлиента) + ";" + Строка(ТелефонКлиента);
		//Иначе
		//	ДокОбъектЗаявкиНаРемонт.Заказчик = Строка(ИмяКлиента) + ";";
		//КонецЕсли;
		
		ДокОбъектЗаявкиНаРемонт.Заказчик = СсылкаНаКонтрагента;
		
		ДокОбъектЗаявкиНаРемонт.ПредставлениеТелефона = ТелефонКлиента;
		ДокОбъектЗаявкиНаРемонт.АдресЭлектронойПочты = EmailКлиента;
		ДокОбъектЗаявкиНаРемонт.Контрагент = СсылкаНаКонтрагента;
		ДокОбъектЗаявкиНаРемонт.ДоговорВзаиморасчетов = СправочникСсылкаНаДоговорВзаиморасчетов;
		ДокОбъектЗаявкиНаРемонт.ГосНомер = ГосномерАвто;
		ДокОбъектЗаявкиНаРемонт.Пробег = ПробегАвто;
		ДокОбъектЗаявкиНаРемонт.VIN = VINАвто;
		ДокОбъектЗаявкиНаРемонт.Автомобиль = МаркаАвто + " " + МодельАвто;
		ДокОбъектЗаявкиНаРемонт.ДатаНачала = ДатаНачалаРабот;
		Если ЗначениеЗаполнено(ДатаОкончанияРабот) Тогда
			ДокОбъектЗаявкиНаРемонт.ДатаОкончания = ДатаОкончанияРабот;
		КонецЕсли;
		ДокОбъектЗаявкиНаРемонт.ВидРемонта = ВидРемонта;
			
		//добавим работы
		Для Каждого Работа Из МассивРабот Цикл
			НоваяСтрокаРаботы = ДокОбъектЗаявкиНаРемонт.Работы.Добавить();
			НоваяСтрокаРаботы.Работа = Работа.Авторабота;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Работы.Работа", НоваяСтрокаРаботы);
			НоваяСтрокаРаботы.Количество = Работа.Количество;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Работы.Количество", НоваяСтрокаРаботы);
			НоваяСтрокаРаботы.ИдентификаторРаботы = Новый УникальныйИдентификатор();
			НоваяСтрокаРаботы.Нормочас = ОсновнойНормочас;
			НоваяСтрокаРаботы.Коэффициент = Работа.Нормочасы;
			НоваяСтрокаРаботы.Цена = Работа.СтоимостьНормочаса;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Работы.Цена", НоваяСтрокаРаботы);
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Работы.Коэффициент", НоваяСтрокаРаботы);
			
			// добавим исполнителя
			Если ЗначениеЗаполнено(Работа.Исполнитель) Тогда
				НоваяСтрокаИсполнителя = ДокОбъектЗаявкиНаРемонт.Исполнители.Добавить();
				НоваяСтрокаИсполнителя.Исполнитель = Работа.Исполнитель;
				НоваяСтрокаИсполнителя.ИдентификаторРаботы = НоваяСтрокаРаботы.ИдентификаторРаботы;
				НоваяСтрокаИсполнителя.Цех = ДокОбъектЗаявкиНаРемонт.Цех;
				НоваяСтрокаИсполнителя.Процент = 100;
			КонецЕсли;
		КонецЦикла;
		
		//добавим товары
		Для Каждого Товар Из МассивТоваров Цикл
			НоваяСтрокаТовары = ДокОбъектЗаявкиНаРемонт.Товары.Добавить();
			НоваяСтрокаТовары.Номенклатура = Товар.Номенклатура;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрокаТовары);
			НоваяСтрокаТовары.Количество = Товар.Количество;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Товары.Количество", НоваяСтрокаТовары);
			НоваяСтрокаТовары.Коэффициент = 1;
			НоваяСтрокаТовары.Цена = Товар.ЦенаТовара;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Товары.Цена", НоваяСтрокаТовары);
			//
			НоваяСтрокаТовары.СуммаВсего = Товар.СуммаТовара;
			ДокОбъектЗаявкиНаРемонт.ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрокаТовары);
			//
			НоваяСтрокаТовары.СрокПоставкиВСтроке = Товар.ДатаДоставки;
			НоваяСтрокаТовары.СкладКомпании = Товар.СкладКомпании;
		КонецЦикла;
		
		ДокОбъектЗаявкиНаРемонт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		ДокументСсылкаНаЗаявкуНаРемонт = ДокОбъектЗаявкиНаРемонт.ссылка;
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ВЖурнал(ТекстОшибки);
		ОтменитьТранзакцию();
		Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании заявки на ремонт: " + ТекстОшибки);
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании заявки на ремонт: " + ТекстОшибки);
		Возврат Ответ;
	КонецПопытки;
	//
	
	//Счет на оплату
	Если ОплаченЛи = Истина Тогда
		
		Попытка
			ДокОбъектСчетНаОплату = Документы.СчетНаОплату.СоздатьДокумент();
			ДокОбъектСчетНаОплату.Заполнить(ДокументСсылкаНаЗаявкуНаРемонт);
			ДокОбъектСчетНаОплату.Автор = ПараметрыСеанса.Пользователь;
			ДокОбъектСчетНаОплату.Дата = ТекущаяДатаСеанса();
			ДокОбъектСчетНаОплату.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			
			ДокОбъектСчетНаОплату.Записать();
			ДокументСсылкаНаСчетНаОплату = ДокОбъектСчетНаОплату.Ссылка;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			ОтменитьТранзакцию();
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании счета на оплату: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании счета на оплату: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		
	КонецЕсли;
	//
	
	//Чек на оплату
	Если ОплаченЛи = Истина Тогда
		
		Попытка
			ДокОбъектЧекНаОплату = Документы.ЧекНаОплату.СоздатьДокумент();
			ДокОбъектЧекНаОплату.Заполнить(ДокументСсылкаНаСчетНаОплату);
			ДокОбъектЧекНаОплату.Автор = ПараметрыСеанса.Пользователь;
			ДокОбъектЧекНаОплату.Дата = ТекущаяДатаСеанса();
			ДокОбъектЧекНаОплату.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			// Если касса не определена то засунем хоть какую нибудь чтобы записать документ
			Если НЕ ЗначениеЗаполнено(ДокОбъектЧекНаОплату.КассаККМ) Тогда
				ДокОбъектЧекНаОплату.КассаККМ = Справочники.КассыККМ.НайтиПоКоду("ЦБ000057");
			КонецЕсли;
			
			// Фикс предмета расчета
			Для Каждого Товар Из ДокОбъектЧекНаОплату.Товары Цикл
				Товар.ПризнакПредметаРасчета = Товар.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета;	
			КонецЦикла;
			
			// Распределим сумму оплаты
			Документы.ЧекНаОплату.ПроизвестиРаспределениеСуммыОплаты(ДокОбъектЧекНаОплату.СуммаДокумента, ДокОбъектЧекНаОплату.Товары);

			ДокОбъектЧекНаОплату.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			ДокументСсылкаНаЧекПредоплаты = ДокОбъектЧекНаОплату.Ссылка;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			ОтменитьТранзакцию();
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании чека предоплаты: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании чека предоплаты: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		
	КонецЕсли;
	//
	
	//Заказ Покупателя
	Если ТаблицаТоваров.Количество() ИЛИ ТаблицаТоваровВнешнихПоставщиков.Количество() Тогда
		Попытка
			ДокОбъектЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
			
			// Получим ссылку на набор прав и переменных окружения
			Попытка ПраваПользователя = ДокОбъектЗаказ.Права;
			Исключение ПраваПользователя = Неопределено;
			КонецПопытки;
			//Типы цен
			ТипЦенПокупки = обПраво("ОсновнойТипЦенЗакупки", ПраваПользователя, , ДокОбъектЗаказ);
			ТипЦенПродажи = обПраво("ОсновнойТипЦенПродажи", ПраваПользователя, , ДокОбъектЗаказ);
			ТипЦенРабот = обПраво("ОсновнойТипЦенРабот", ПраваПользователя, , ДокОбъектЗаказ);
			
			ДокОбъектЗаказ.Права = ПраваПользователя;
			ДокОбъектЗаказ.Автор = ПараметрыСеанса.Пользователь;
			ДокОбъектЗаказ.БлокироватьПерерасчетСкидок = Ложь;
			ДокОбъектЗаказ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			ДокОбъектЗаказ.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
			ДокОбъектЗаказ.КурсВалютыУпр = 1;
			ДокОбъектЗаказ.КурсДокумента = 1;
			ДокОбъектЗаказ.Менеджер = ПараметрыСеанса.Пользователь;
			ДокОбъектЗаказ.УстановитьНовыйНомер();
			ДокОбъектЗаказ.Организация = СкладЗаказа.Организация;
			ДокОбъектЗаказ.ПодразделениеКомпании = СкладЗаказа.Подразделение;
			ДокОбъектЗаказ.ТипЦен = ТипЦенПродажи;
			ДокОбъектЗаказ.ХозОперация = Справочники.ХозОперации.ЗаказПокупателя;
			ДокОбъектЗаказ.ДатаСоздания = ТекущаяДатаСеанса();
			ДокОбъектЗаказ.Дата = ТекущаяДатаСеанса()-1; // Нужно записать на секунду раньше чтобы корректно записалось резервирование
			ДокОбъектЗаказ.СкладКомпании = СкладЗаказа;
			ДокОбъектЗаказ.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
			ДокОбъектЗаказ.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			ДокОбъектЗаказ.Контрагент = СсылкаНаКонтрагента;
			ДокОбъектЗаказ.ДоговорВзаиморасчетов = СправочникСсылкаНаДоговорВзаиморасчетов;
			ДокОбъектЗаказ.ДокументОснование = ДокументСсылкаНаЗаявкуНаРемонт;
			ДокОбъектЗаказ.СрокПоставки = МаксимальнаяДатаПоставки;
			
			//добавим товары
			Для Каждого Товар Из МассивТоваров Цикл
				НоваяСтрокаТовары = ДокОбъектЗаказ.Товары.Добавить();
				НоваяСтрокаТовары.Номенклатура = Товар.Номенклатура;
				ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрокаТовары);
				НоваяСтрокаТовары.Количество = Товар.Количество;
				ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Количество", НоваяСтрокаТовары);
				НоваяСтрокаТовары.Коэффициент = 1;
				НоваяСтрокаТовары.Цена = Товар.ЦенаТовара;
				ДокОбъектЗаказ.ОбработкаРеквизита("Товары.Цена", НоваяСтрокаТовары);
				ДокОбъектЗаказ.ОбработкаРеквизита("Товары.СтавкаНДС", НоваяСтрокаТовары);
				//
				НоваяСтрокаТовары.СуммаВсего = Товар.СуммаТовара;
				ДокОбъектЗаказ.ОбработкаРеквизита("Товары.СуммаВсего", НоваяСтрокаТовары);
				//
				НоваяСтрокаТовары.Поставщик = Товар.СкладКомпании;
				НоваяСтрокаТовары.СрокПоставкиВСтроке = Товар.ДатаДоставки;
			КонецЦикла;
			
			ДокОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ДокументСсылкаНаЗаказПокупателя = ДокОбъектЗаказ.Ссылка;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			ОтменитьТранзакцию();
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании заказа покупателя: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании заказа покупателя: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
	КонецЕсли;
	
	
	//Резерв под заказ покупателя
	Если ТаблицаТоваров.Количество() Тогда
		Попытка
			ДокОбъектРезерв = Документы.РезервированиеЗаказовПокупателя.СоздатьДокумент();
			ДокОбъектРезерв.Заполнить(ДокументСсылкаНаЗаказПокупателя);
			ДокОбъектРезерв.Автор = ПараметрыСеанса.Пользователь;
			ДокОбъектРезерв.УстановитьНовыйНомер();
			ДокОбъектРезерв.Организация = СкладЗаказа.Организация;
			ДокОбъектРезерв.ПодразделениеКомпании = СкладЗаказа.Подразделение;
			ДокОбъектРезерв.ХозОперация = Справочники.ХозОперации.РезервированиеПодЗаказПокупателя;
			ДокОбъектРезерв.ДатаСоздания = ТекущаяДатаСеанса();
			ДокОбъектРезерв.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			// Так как заполнение происходит полностью типовым методом на основании то нужно удалить строчки которые не попадают под резерв
			СтрокиДляУдаления = Новый Массив;
			Для Каждого СтрокаТовара Из ДокОбъектРезерв.Товары Цикл
				Если ТаблицаТоваров.Найти(СтрокаТовара.Номенклатура, "Номенклатура") = Неопределено Тогда
					СтрокиДляУдаления.Добавить(СтрокаТовара);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДокОбъектРезерв.Товары.Удалить(ДокОбъектРезерв.Товары.Индекс(СтрокаДляУдаления));
			КонецЦикла;
			ДокОбъектРезерв.Дата = ТекущаяДатаСеанса()+1;
			ДокОбъектРезерв.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			ДокументСсылкаНаРезервированиеЗаказаПокупателя = ДокОбъектРезерв.Ссылка;
			
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			ОтменитьТранзакцию();
			Ответ = ВернутьОшибку("ERR_ORDER_RESERVE_CREATE_FAILED", "Ошибка при создании резерва заказа покупателя: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании резерва заказа покупателя: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
	КонецЕсли;
	//
	
	// Заказ поставщику
	// Для каждого договора поставщика будет отдельный документ
	Для Каждого ТекущийДоговор Из ДоговорыПоставщиков Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ДоговорПоставщика", ТекущийДоговор.ДоговорПоставщика);
		СписокТоваровДляЗаказаПоставщику = ТаблицаТоваровВнешнихПоставщиков.НайтиСтроки(СтруктураОтбора);
		//Можем взять первого потому что он будет в списке один
		КонтрагентДляЗаказаПоставщику = СписокТоваровДляЗаказаПоставщику[0].Поставщик;
		Попытка
			ДокОбъектЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
			// Нужно обрамить вызов функции зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон") в модуле менеджера справочника Контрагенты в функции ПолучитьДоговорВзаиморасчетов() в строке 130
			// #Если НЕ КлиентскоеПриложение Тогда ЕстьПодсистемаАвтосалон = Истина; #Иначе ЕстьПодсистемаАвтосалон = зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон"); #КонецЕсли
			ДокОбъектЗаказПоставщику.Заполнить(ДокументСсылкаНаЗаказПокупателя);
			ДокОбъектЗаказПоставщику.ДокументОснование = ДокументСсылкаНаЗаказПокупателя;
			ДокОбъектЗаказПоставщику.Автор = ПараметрыСеанса.Пользователь;
			ДокОбъектЗаказПоставщику.УстановитьНовыйНомер();
			ДокОбъектЗаказПоставщику.Организация = СкладЗаказа.Организация;
			ДокОбъектЗаказПоставщику.ПодразделениеКомпании = СкладЗаказа.Подразделение;
			ДокОбъектЗаказПоставщику.ХозОперация = Справочники.ХозОперации.ЗаказПоставщику;
			ДокОбъектЗаказПоставщику.ДатаСоздания = ТекущаяДатаСеанса();
			ДокОбъектЗаказПоставщику.Дата = ТекущаяДатаСеанса();
			ДокОбъектЗаказПоставщику.Комментарий = "Создан автоматически через API О2. Номер: " + Строка(НомерЗаказаВПриложении) + ". Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
			ДокОбъектЗаказПоставщику.Контрагент = КонтрагентДляЗаказаПоставщику;
			ДокОбъектЗаказПоставщику.ДоговорВзаиморасчетов = ТекущийДоговор.ДоговорПоставщика;
			ДокОбъектЗаказПоставщику.Товары.Очистить();
			ДокОбъектЗаказПоставщику.РаспределениеЗаказа.Очистить();
			Для Каждого ДобавляемыйТовар Из СписокТоваровДляЗаказаПоставщику Цикл
				НоваяСтрока = ДокОбъектЗаказПоставщику.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемыйТовар, "Номенклатура");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("Товары.Номенклатура", НоваяСтрока);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемыйТовар, "Цена");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("Товары.Цена", НоваяСтрока);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемыйТовар, "Количество");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("Товары.Количество", НоваяСтрока);
				НоваяСтрока.Распределено = ДобавляемыйТовар.Количество;
				
				НоваяСтрокаРаспределения = ДокОбъектЗаказПоставщику.РаспределениеЗаказа.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, ДобавляемыйТовар, "Номенклатура");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("РаспределениеЗаказа.Номенклатура", НоваяСтрокаРаспределения);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, ДобавляемыйТовар, "Цена");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("РаспределениеЗаказа.Цена", НоваяСтрокаРаспределения);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРаспределения, ДобавляемыйТовар, "Количество");
				ДокОбъектЗаказПоставщику.ОбработкаРеквизита("РаспределениеЗаказа.Количество", НоваяСтрокаРаспределения);
				НоваяСтрокаРаспределения.ЗаказПокупателя = ДокументСсылкаНаЗаказПокупателя;
				НоваяСтрокаРаспределения.СрокПоставкиВСтроке = ДобавляемыйТовар.ДатаДоставки;
			КонецЦикла;
			
			ДокОбъектЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
			МассивДокументСсылкаНаЗаказПоставщика.Добавить(ДокОбъектЗаказПоставщику.Ссылка);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ВЖурнал(ТекстОшибки);
			ОтменитьТранзакцию();
			Ответ = ВернутьОшибку("ERR_ORDER_CREATE_FAILED", "Ошибка при создании заказа поставщику: " + ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка при создании заказа поставщику: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
	КонецЦикла;
	//
	
	ЗафиксироватьТранзакцию();
	ВЖурнал("Зафиксирована транзакция");
	//Запишем состояние заказа покупателя - создан
	ЗаписатьСтатусЗаказа(НомерЗаказаВПриложении, ДокументСсылкаНаЗаявкуНаРемонт, ДокументСсылкаНаЗаказПокупателя, ДокументСсылкаНаЧекПредоплаты, Перечисления.О2_API_СтатусыЗаказов.Создан);
	//
	
	//Вернем ответ
	//Структура ошибки
	СтруктураОтвета = Новый Структура;
	СтруктураOrder = Новый Структура;
	МассивДокументов = Новый Массив;
	СтруктураДокументаЗаявкаНаРемонт = Новый Структура;
	СтруктураДокументаЗаказПокупателя = Новый Структура;
	СтруктураДокументаРезервированиеТоваров = Новый Структура;
	
	СтруктураOrder.Вставить("order_status", "Заказ заведён в 1С");
	
	СтруктураДокументаЗаявкаНаРемонт.Вставить("name", "Заявка на ремонт");
	СтруктураДокументаЗаявкаНаРемонт.Вставить("document_status", "Создан");
	СтруктураДокументаЗаявкаНаРемонт.Вставить("message", "");
	СтруктураДокументаЗаявкаНаРемонт.Вставить("number", ДокументСсылкаНаЗаявкуНаРемонт.Номер);
	СтруктураДокументаЗаявкаНаРемонт.Вставить("date", УниверсальноеВремя(ДокументСсылкаНаЗаявкуНаРемонт.Дата) - '19700101');
	
	Если ТаблицаТоваров.Количество() ИЛИ ТаблицаТоваровВнешнихПоставщиков.Количество() Тогда
		СтруктураДокументаЗаказПокупателя.Вставить("name", "Заказ покупателя");
		СтруктураДокументаЗаказПокупателя.Вставить("document_status", "Создан");
		СтруктураДокументаЗаказПокупателя.Вставить("message", "");
		СтруктураДокументаЗаказПокупателя.Вставить("number", ДокументСсылкаНаЗаказПокупателя.Номер);
		СтруктураДокументаЗаказПокупателя.Вставить("date", УниверсальноеВремя(ДокументСсылкаНаЗаказПокупателя.Дата) - '19700101');
	Иначе
		СтруктураДокументаЗаказПокупателя.Вставить("name", "Заказ покупателя");
		СтруктураДокументаЗаказПокупателя.Вставить("document_status", "Не создан");
		СтруктураДокументаЗаказПокупателя.Вставить("message", "В заказе нет товаров");
		СтруктураДокументаЗаказПокупателя.Вставить("number", "");
		СтруктураДокументаЗаказПокупателя.Вставить("date", "");
	КонецЕсли;
	
	Если ТаблицаТоваров.Количество() Тогда
		СтруктураДокументаРезервированиеТоваров.Вставить("name", "Резервирование товаров под заказ покупателя");
		СтруктураДокументаРезервированиеТоваров.Вставить("document_status", "Создан");
		СтруктураДокументаРезервированиеТоваров.Вставить("message", "");
		СтруктураДокументаРезервированиеТоваров.Вставить("number", ДокументСсылкаНаРезервированиеЗаказаПокупателя.Номер);
		СтруктураДокументаРезервированиеТоваров.Вставить("date", УниверсальноеВремя(ДокументСсылкаНаРезервированиеЗаказаПокупателя.Дата) - '19700101');
	Иначе
		СтруктураДокументаРезервированиеТоваров.Вставить("name", "Резервирование товаров под заказ покупателя");
		СтруктураДокументаРезервированиеТоваров.Вставить("document_status", "Не создан");
		СтруктураДокументаРезервированиеТоваров.Вставить("message", "Нет товаров для резервирования на наших складах");
		СтруктураДокументаРезервированиеТоваров.Вставить("number", "");
		СтруктураДокументаРезервированиеТоваров.Вставить("date", "");
	КонецЕсли;
	
	МассивДокументов.Добавить(СтруктураДокументаЗаявкаНаРемонт);
	МассивДокументов.Добавить(СтруктураДокументаЗаказПокупателя);
	МассивДокументов.Добавить(СтруктураДокументаРезервированиеТоваров);
	
	Если МассивДокументСсылкаНаЗаказПоставщика.Количество() Тогда
		Для Каждого ДокументЗаказПоставщику Из МассивДокументСсылкаНаЗаказПоставщика Цикл
			СтруктураДокументаЗаказПоставщику = Новый Структура;
			СтруктураДокументаЗаказПоставщику.Вставить("name", "Заказ внешнему поставщику");
			СтруктураДокументаЗаказПоставщику.Вставить("document_status", "Создан");
			СтруктураДокументаЗаказПоставщику.Вставить("message", "Заказ для поставщика " + ДокументЗаказПоставщику.Контрагент + " по договору " + ДокументЗаказПоставщику.ДоговорВзаиморасчетов);
			СтруктураДокументаЗаказПоставщику.Вставить("number", ДокументЗаказПоставщику.Номер);
			СтруктураДокументаЗаказПоставщику.Вставить("date", УниверсальноеВремя(ДокументЗаказПоставщику.Дата) - '19700101');
			МассивДокументов.Добавить(СтруктураДокументаЗаказПоставщику);
		КонецЦикла;
	Иначе
		СтруктураДокументаЗаказПоставщику = Новый Структура;
		СтруктураДокументаЗаказПоставщику.Вставить("name", "Заказ внешнему поставщику");
		СтруктураДокументаЗаказПоставщику.Вставить("document_status", "Не создан");
		СтруктураДокументаЗаказПоставщику.Вставить("message", "Нет товаров для заказа у внешнего поставщика");
		СтруктураДокументаЗаказПоставщику.Вставить("number", "");
		СтруктураДокументаЗаказПоставщику.Вставить("date", "");
		МассивДокументов.Добавить(СтруктураДокументаЗаказПоставщику);
	КонецЕсли;
	
	СтруктураOrder.Вставить("documents", МассивДокументов);
	СтруктураОтвета.Вставить("order", СтруктураOrder);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Заказ создан.");
	Возврат Ответ;
КонецФункции

Функция cancel_app_orderPOST(HTTPЗапрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос);
	//
	
	// Получим ID заказа
	IDЗаказа = Строка(HTTPЗапрос.ПараметрыUrl.Получить("orderId"));
	Если НЕ ЗначениеЗаполнено(IDЗаказа) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Не указан ID заказа.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Найдем заказ по ID
	ДанныеОЗаказе = ПолучитьТекущийСтатусЗаказа(,IDЗаказа);
	Если ДанныеОЗаказе = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DOESNT_EXIST");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Заказ не найден по ID: " + IDЗаказа);
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что заказ не отменен и не реализован
	ТекущийСтатусЗаказа = ДанныеОЗаказе.Статус;
	Если ТекущийСтатусЗаказа = Перечисления.О2_API_СтатусыЗаказов.Отменён Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ALREADY_CANCELLED");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Заказ уже отменен.");
		Возврат Ответ;
	ИначеЕсли ТекущийСтатусЗаказа = Перечисления.О2_API_СтатусыЗаказов.Реализован Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_ALREADY_COMPLETED");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Заказ реализован. Отмена невозможна.");
		Возврат Ответ;
	КонецЕсли;
	
	// Для отмены заказа требуется:
	// Перевести заявку на ремонт в состояние "отклонен"
	// Снять резервы с заказа покупателя
	// Скорректировать заказ покупателя в 0
	// Снять распределение по каждому заказу поставщику (делается тем же документом что и корректировка заказа)
	// Если была оплата то сделать возврат по чеку на оплату
	
	//Определим ссылки на документы
	// Заявка на ремонт
	СсылкаНаЗаявкуНаРемонт = ДанныеОЗаказе.ЗаявкаНаРемонт;
	Если НЕ ТипЗнч(СсылкаНаЗаявкуНаРемонт) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		СсылкаНаЗаявкуНаРемонт = Неопределено;
	ИначеЕсли НЕ СсылкаНаЗаявкуНаРемонт.Проведен Тогда
		СсылкаНаЗаявкуНаРемонт = Неопределено;
	КонецЕсли;
	
	// Заказ покупателя
	СсылкаНаЗаказПокупателя = ДанныеОЗаказе.ЗаказПокупателя;
	Если НЕ СсылкаНаЗаказПокупателя.Проведен Тогда
		СсылкаНаЗаказПокупателя = Неопределено;
	КонецЕсли;
	
	// Заказы поставщику
	//МассивСсылокДляЗаказаПоставщику = Новый Массив;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗаказПоставщику.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//	|ГДЕ
	//	|	ЗаказПоставщику.Проведен = ИСТИНА
	//	|	И ЗаказПоставщику.ДокументОснование = &ЗаказПокупателя";
	//
	//Запрос.УстановитьПараметр("ЗаказПокупателя", СсылкаНаЗаказПокупателя);
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	//		МассивСсылокДляЗаказаПоставщику.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	//	КонецЕсли;
	//КонецЦикла;
	//
	
	// Чек на оплату
	СсылкаНаЧекНаОплату = ДанныеОЗаказе.ЧекНаОплату;
	Если НЕ СсылкаНаЧекНаОплату.Проведен Тогда
		СсылкаНаЧекНаОплату = Неопределено;
	КонецЕсли;
	
	
	//Изменим статус заявки на ремонт
	Если ТипЗнч(СсылкаНаЗаявкуНаРемонт) = Тип("ДокументСсылка.ЗаявкаНаРемонт") И СсылкаНаЗаявкуНаРемонт.Состояние <> Перечисления.СостоянияЗаявкиНаРемонт.Отклонено Тогда
		ОбъектЗаявкаНаРемонт = СсылкаНаЗаявкуНаРемонт.ПолучитьОбъект();
		Попытка
			ОбъектЗаявкаНаРемонт.Состояние = Перечисления.СостоянияЗаявкиНаРемонт.Отклонено;
			ОбъектЗаявкаНаРемонт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
	КонецЕсли;
	//
	
	//Отменим резервирование
	Если ТипЗнч(СсылкаНаЗаказПокупателя) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ДокОбъект = Документы.СнятиеРезервовЗаказовПокупателя.СоздатьДокумент();
		ДокОбъект.Заполнить(СсылкаНаЗаказПокупателя);
		ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъект.УстановитьНовыйНомер();
		ДокОбъект.Организация = СсылкаНаЗаказПокупателя.Организация;
		ДокОбъект.ПодразделениеКомпании = СсылкаНаЗаказПокупателя.ПодразделениеКомпании;
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		ДокОбъект.КорректировкаЗаказа = Истина;
		ДокОбъект.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ответ = ВернутьОшибку("ERR_ORDER_CANCEL_FAILED", ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Ошибка при отмене заказа: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		//
		//Отменим позиции заказа
		ДокОбъект = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
		ДокОбъект.ОбработкаРасчетСкидок = Обработки.РасчетСкидок.Создать();
		ДокОбъект.Заполнить(СсылкаНаЗаказПокупателя);
		ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъект.УстановитьНовыйНомер();
		ДокОбъект.Организация = СсылкаНаЗаказПокупателя.Организация;
		ДокОбъект.ПодразделениеКомпании = СсылкаНаЗаказПокупателя.ПодразделениеКомпании;
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		Для Каждого СтрокаТовара Из ДокОбъект.Товары Цикл
			СтрокаТовара.Количество = 0;
		КонецЦикла;
		ДокОбъект.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ответ = ВернутьОшибку("ERR_ORDER_CANCEL_FAILED", ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Ошибка при отмене заказа: " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		//
	КонецЕсли;
	
	// Если есть чек на оплату то его тоже отменим
	Если ТипЗнч(СсылкаНаЧекНаОплату) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		ДокОбъект = Документы.ЧекНаОплату.СоздатьДокумент();
		ДокОбъект.Заполнить(СсылкаНаЧекНаОплату);
		ДокОбъект.Автор = ПараметрыСеанса.Пользователь;
		ДокОбъект.Дата = ТекущаяДатаСеанса();
		ДокОбъект.ДатаСоздания = ТекущаяДатаСеанса();
		ДокОбъект.Комментарий = "Создан автоматически через API О2. Дата создания - " + Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Ответ = ВернутьОшибку("ERR_ORDER_CANCEL_FAILED", ТекстОшибки);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Ошибка при отмене заказа (запись чека): " + ТекстОшибки);
			Возврат Ответ;
		КонецПопытки;
		
		СсылкаНаЧекНаОплату = ДокОбъект.Ссылка;
	КонецЕсли;
	//
	
	//Запишем состояние заказа покупателя - отменён
	ЗаписатьСтатусЗаказа(IDЗаказа, СсылкаНаЗаявкуНаРемонт, СсылкаНаЗаказПокупателя, СсылкаНаЧекНаОплату, Перечисления.О2_API_СтатусыЗаказов.Отменён);
	
	//Вернем ответ
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("app_order", IDЗаказа);
	СтруктураОтвета.Вставить("cancellation_result", "Заказ отменен");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, IDЗаказа, "Заказ отменен.");
	Возврат Ответ;
КонецФункции

Функция checkoutPOST(HTTPЗапрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос);
	//
	
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(HTTPЗапрос.ПолучитьТелоКакСтроку());
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим валидность структуры
	МассивТоваров = ПолучитьПоПути(СтруктураВхДанных, "items");
	
	//Теперь проверим все товары
	Для Каждого Товар Из МассивТоваров Цикл
		//Вынесем все данные в отдельные переменные
		КодТовара = ПолучитьПоПути(Товар, "external_id");
		АртикулТовара = ПолучитьПоПути(Товар, "article");
		БрендТовара = ПолучитьПоПути(Товар, "brand");
		ЕдиницаИзмеренияТовара = ПолучитьПоПути(Товар, "unit_of_measure"); // Не используется
		КоличествоТовара = ПолучитьПоПути(Товар, "quantity");
		СкладКомпании = ПолучитьПоПути(Товар, "warehouse_id");
		
		//Проверим что все данные заполнены корректно
		Если НЕ ЗначениеЗаполнено(КодТовара) И (НЕ ЗначениеЗаполнено(АртикулТовара) ИЛИ НЕ ЗначениеЗаполнено(БрендТовара)) Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Код или артикул и бренд товара не заполнены");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Код или артикул и бренд товара не заполнены");
			Возврат Ответ;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(КоличествоТовара) ИЛИ ТипЗнч(КоличествоТовара) <> Тип("Число") Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Количество товара должно быть числом и больше 0");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Количество товара должно быть числом и больше 0");
			Возврат Ответ;
		КонецЕсли;
		//
		
		//Найдем каждую номенклатуру
		Если ЗначениеЗаполнено(КодТовара) Тогда
			Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
		Иначе
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Номенклатура = НайтиНоменклатуруПоАртикулу(АртикулТовара, БрендТовара);
		КонецЕсли;
		
		Если Номенклатура = Неопределено Тогда
			ОписаниеНоменклатуры = "Код: " + КодТовара + ", Артикул: " + АртикулТовара + ", Бренд: " + БрендТовара;
			Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_RESOURCE_NOT_FOUND", ОписаниеНоменклатуры);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Номенклатура не найдена. " + ОписаниеНоменклатуры);
			Возврат Ответ;
		КонецЕсли;
		//
		
		//найдем склад компании
		СкладКомпанииСсылка = Справочники.СкладыКомпании.НайтиПоКоду(СкладКомпании);
		Если СкладКомпанииСсылка = Справочники.СкладыКомпании.ПустаяСсылка() Тогда
			Ответ = ВернутьОшибку("ERR_ORDER_ITEMS_WAREHOUSE_NOT_FOUND", "Код: " + СкладКомпании);
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Склад компании не найден. Код: " + СкладКомпании);
			Возврат Ответ;
		КонецЕсли;
		СкладКомпании = СкладКомпанииСсылка;
		//
		
		//Добавим все данные в текущий товар
		Товар.Вставить("Номенклатура", Номенклатура);
		Товар.Вставить("Количество", КоличествоТовара);
		Товар.Вставить("СкладКомпании", СкладКомпании);
	КонецЦикла;
	
	//Создадим таблицу товаров для проверки остатков
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаТоваров.Колонки.Добавить("МестоРазмещения", Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	Для Каждого Товар Из МассивТоваров Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
			НоваяСтрока.Номенклатура = Товар.Номенклатура;
			НоваяСтрока.Количество = Товар.Количество;
			НоваяСтрока.МестоРазмещения = Товар.СкладКомпании;
	КонецЦикла;
	//
	
	//Проверим что сумма количества товаров не равна 0
	Если ТаблицаТоваров.Итог("Количество") = 0 Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_EMPTY");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Количество позиций для заказа равно 0.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что все товары есть на остатках
	ТаблицаОстатковТоваров = ПолучитьОстаткиПоТаблице(ТаблицаТоваров);
	ТовараНедостаточно = Ложь;
	СписокОшибок = "";
	МассивТоваровНаОстатках = Новый Массив;
	МассивТоваровНеХватает = Новый Массив;
	Для Каждого товар Из ТаблицаОстатковТоваров Цикл
		Если НЕ товар.ДостаточноДляЗаказа Тогда
			ТовараНедостаточно = Истина;
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("article", товар.Номенклатура.Артикул);
			СтруктураТовара.Вставить("brand", товар.Номенклатура.Производитель.Наименование);
			МассивТоваровНеХватает.Добавить(СтруктураТовара);
		//Иначе
		//	СтруктураТовара = Новый Структура;
		//	СтруктураТовара.Вставить("article", товар.Номенклатура.Артикул);
		//	СтруктураТовара.Вставить("brand", товар.Номенклатура.Производитель.Наименование);
		//	МассивТоваровНаОстатках.Добавить(СтруктураТовара);
		КонецЕсли;
	КонецЦикла;
	//
	
	//Вернем ответ
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("timestamp", Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-ddTЧЧ:ММ:ссZ"));
	Если ТовараНедостаточно = Ложь Тогда
		СтруктураОтвета.Вставить("message", "Все детали доступны");
		СтруктураОтвета.Вставить("unavailable_items", МассивТоваровНаОстатках);
	Иначе
		СтруктураОтвета.Вставить("message", "Не все детали доступны");
		СтруктураОтвета.Вставить("unavailable_items", МассивТоваровНеХватает);
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета, );
	ТелоОтвета = ЗаписьJSON.Закрыть();
	//
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Остатки проверены");
	Возврат Ответ;
КонецФункции

Функция update_payment_status_appPOST(HTTPЗапрос) Экспорт
	//Запишем запрос в лог
	ВремяЗапроса = ТекущаяДатаСеанса();
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос);
	//
	
	//Проверим валидность JSON структуры
	СтруктураВхДанных = Новый Структура;
	СтруктураВхДанных = ПолучитьСтруктуруИзJSON(HTTPЗапрос.ПолучитьТелоКакСтроку());
	Если СтруктураВхДанных = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_JSON");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Не удалось обработать тело запроса как JSON.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//{
	//"order_id": "123abc",
	//"status": "Fiscalized",
	//"fiscalData": {
	//"fiscalDeviceId": "7380440802004975",
	//"shiftNumber": "108",
	//"receiptNumber": "33",
	//"documentId": "3224",
	//"fiscalAttribute": "2988766326",
	//"timestamp": "2025-09-03T14:38:11Z"
	//}
	//}
	//}
	
	//Проверим валидность структуры
	НомерЗаказаВПриложении = ПолучитьПоПути(СтруктураВхДанных, "order_id");
	СтатусФискальныхДанных = ПолучитьПоПути(СтруктураВхДанных, "status");
	
	НомерСмены = ПолучитьПоПути(СтруктураВхДанных, "fiscalData.shiftNumber");
	НомерЧека = ПолучитьПоПути(СтруктураВхДанных, "fiscalData.receiptNumber");
	НомерДокумента = ПолучитьПоПути(СтруктураВхДанных, "fiscalData.documentId");
	ДатаПробития = ПолучитьПоПути(СтруктураВхДанных, "fiscalData.timestamp");
	
	//Проверим что номер заказа заполнен
	Если НЕ ЗначениеЗаполнено(НомерЗаказаВПриложении) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер заказа должен быть заполнен");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Номер заказа должен быть заполнен");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Преобразуем строки в числа
	Попытка
		НомерСмены = Число(НомерСмены);
		НомерЧека = Число(НомерЧека);
		НомерДокумента = Число(НомерДокумента);
	Исключение
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер смены, чека и документа не удалось преобразовать в число");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, , "Номер смены, чека и документа не удалось преобразовать в число");
		Возврат Ответ;
	КонецПопытки;
	//
	
	//Проверим что фискальные данные заполнены
	Если ЗначениеЗаполнено(НомерСмены) И
		ЗначениеЗаполнено(НомерЧека) И 
		ЗначениеЗаполнено(НомерДокумента) Тогда
		ВсеХорошо = Истина;
	Иначе
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Номер смены, чека и документа не заполнены");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Номер смены, чека и документа не заполнены");
		Возврат Ответ;
	КонецЕсли;
	//
	
	//Проверим что дата это дата в формате ISO 8601 и преобразуем их
	ДатаПробития = ПолучитьДатуИзISO8601(ДатаПробития);
	Если НЕ ЗначениеЗаполнено(ДатаПробития) Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Дата не заполнена или заполнена неверно.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Дата не заполнена или заполнена неверно.");
		Возврат Ответ;
	КонецЕсли;
	//
	
	// Определим какой чек нам нужен
	ЭтоПредоплата = Ложь;
	ЭтоВозврат = Ложь;
	Если СтатусФискальныхДанных = "Fiscalized" Тогда
		ЭтоПредоплата = Истина;
	ИначеЕсли СтатусФискальныхДанных = "RefundedFiscalized" Тогда
		ЭтоВозврат = Истина;
	Иначе
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Не определен статус заказа. Требуется отправить Fiscalized или RefundedFiscalized.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Не определен статус заказа.");
		Возврат Ответ;	
	КонецЕсли;
	//
	
	//Проверим что заказ с таким номером существует
	ДанныеОЗаказе = ПолучитьТекущийСтатусЗаказа(,Строка(НомерЗаказаВПриложении));
	Если ДанныеОЗаказе = Неопределено Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Заказ с номером " + НомерЗаказаВПриложении + " не существует.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Заказ с номером " + НомерЗаказаВПриложении + " не существует.");
		Возврат Ответ;
	КонецЕсли;
	//

	// Проверим что вообще по заказу есть чек
	Если ДанныеОЗаказе.ЧекНаОплату = Неопределено ИЛИ ДанныеОЗаказе.ЧекНаОплату = Документы.ЧекНаОплату.ПустаяСсылка() Тогда
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Заказ с номером " + НомерЗаказаВПриложении + " не имеет предоплаты.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Заказ с номером " + НомерЗаказаВПриложении + " не имеет предоплаты.");
		Возврат Ответ;	
	КонецЕсли;	
	//
	
	// Определим ссылки чеков
	ЧекВозвратаСсылка = Неопределено;
	ЧекПредоплатыСсылка = Неопределено;
	Если ДанныеОЗаказе.Статус = Перечисления.О2_API_СтатусыЗаказов.Отменён Тогда
		// Если статус отменен то в записи статуса будет чек отмены
		ЧекВозвратаСсылка = ДанныеОЗаказе.ЧекНаОплату;
		ЧекПредоплатыСсылка = ДанныеОЗаказе.ЧекНаОплату.ДокументОснование;
	Иначе
		// Иначе в записи статуса будет чек предоплаты а чека отмены не будет
		ЧекПредоплатыСсылка = ДанныеОЗаказе.ЧекНаОплату;
		ЧекВозвратаСсылка = Неопределено;
	КонецЕсли;
	
	// Проверим ссылки и запишем фискальные данные
	Если ЭтоПредоплата = Истина Тогда
		// Проверим ссылку
		Если ЧекПредоплатыСсылка <> Неопределено И ЧекПредоплатыСсылка <> Документы.ЧекНаОплату.ПустаяСсылка() Тогда
			// Проверим что фискальные данные не заполнены уже в чек
			Если ЗначениеЗаполнено(ЧекПредоплатыСсылка.НомерДокумента) ИЛИ
				ЗначениеЗаполнено(ЧекПредоплатыСсылка.НомерСмены) ИЛИ
				ЗначениеЗаполнено(ЧекПредоплатыСсылка.НомерЧека) Тогда
				// Данные уже записаны, мы не можем их затереть
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "В чеке предоплаты уже заполнены фискальные данные.");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "В чеке предоплаты уже заполнены фискальные данные.");
				Возврат Ответ;
			Иначе
				// Данные не записаны, запишем их
				ОбъектЧекПредоплаты = ЧекПредоплатыСсылка.ПолучитьОбъект();
				ОбъектЧекПредоплаты.НомерДокумента = НомерДокумента;
				ОбъектЧекПредоплаты.НомерСмены = НомерСмены;
				ОбъектЧекПредоплаты.НомерЧека = НомерЧека;
				Попытка
					ОбъектЧекПредоплаты.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Ошибка записи фискальных данных в чек предоплаты.");
					ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка записи фискальных данных в чек предоплаты");
					Возврат Ответ;
				КонецПопытки;
			КонецЕсли;
		Иначе
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Ошибка получения чека предоплаты.");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка получения чека предоплаты.");
			Возврат Ответ;
		КонецЕсли;
	ИначеЕсли ЭтоВозврат = Истина Тогда
		// Проверим ссылку
		Если ЧекВозвратаСсылка <> Неопределено И ЧекВозвратаСсылка <> Документы.ЧекНаОплату.ПустаяСсылка() Тогда
			// Проверим что фискальные данные не заполнены уже в чек
			Если ЗначениеЗаполнено(ЧекВозвратаСсылка.НомерДокумента) ИЛИ
				ЗначениеЗаполнено(ЧекВозвратаСсылка.НомерСмены) ИЛИ
				ЗначениеЗаполнено(ЧекВозвратаСсылка.НомерЧека) Тогда
				// Данные уже записаны, мы не можем их затереть
				Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "В чеке возврата уже заполнены фискальные данные.");
				ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "В чеке возврата уже заполнены фискальные данные.");
				Возврат Ответ;
			Иначе
				// Данные не записаны, запишем их
				ОбъектЧекВозврата = ЧекВозвратаСсылка.ПолучитьОбъект();
				ОбъектЧекВозврата.НомерДокумента = НомерДокумента;
				ОбъектЧекВозврата.НомерСмены = НомерСмены;
				ОбъектЧекВозврата.НомерЧека = НомерЧека;
				Попытка
					ОбъектЧекВозврата.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Ошибка записи фискальных данных в чек возврата.");
					ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка записи фискальных данных в чек возврата");
					Возврат Ответ;
				КонецПопытки;
			КонецЕсли;
		Иначе
			Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Ошибка получения чека возврата.");
			ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Ошибка получения чека возврата.");
			Возврат Ответ;
		КонецЕсли;
	Иначе
		Ответ = ВернутьОшибку("ERR_ORDER_DATA_INVALID", "Нарушение логики.");
		ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Нарушение логики.");
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	ЛогированиеЗапросов(ВремяЗапроса, HTTPЗапрос, Ответ, НомерЗаказаВПриложении, "Данные записаны");
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область ПрочиеФункцииДляДокументов

Функция ПолучитьСкладыЗаказа(Заказ) Экспорт
	
	Если ТипЗнч(Заказ) <> тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			,
		|			Заказ = &Заказ
		|				И СкладКомпании <> &ЗаказСкладКомпании) КАК ЗаказыПокупателейОстатки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ЗаказСкладКомпании", Заказ.СкладКомпании);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Таблицу в список значений
	СписокЗначенийРезультат = Новый СписокЗначений;
	Для Каждого Значение Из РезультатЗапроса Цикл
		СписокЗначенийРезультат.Добавить(Значение.СкладКомпании, Значение.СкладКомпании);
	КонецЦикла;
	
	Возврат СписокЗначенийРезультат;
	
КонецФункции

Функция ЯвляетсяЛиЗаказО2(ЗаявкаНаРемонтИЛИЗаказПокупателя) Экспорт
	
	Если ТипЗнч(ЗаявкаНаРемонтИЛИЗаказПокупателя) <> Тип("ДокументСсылка.ЗаказПокупателя") И ТипЗнч(ЗаявкаНаРемонтИЛИЗаказПокупателя) <> Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	О2_API_СтатусыЗаказовСрезПоследних.IDЗаказа КАК IDЗаказа
		|ИЗ
		|	РегистрСведений.О2_API_СтатусыЗаказов.СрезПоследних(&НаДату, ЗаказПокупателя = &ДокументДляПоиска) КАК О2_API_СтатусыЗаказовСрезПоследних";
	
	Если ТипЗнч(ЗаявкаНаРемонтИЛИЗаказПокупателя) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ЗаказПокупателя","ЗаявкаНаРемонт");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ДокументДляПоиска", ЗаявкаНаРемонтИЛИЗаказПокупателя);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ОбновитьСтатусЗаказа(Заказ) Экспорт
	
	//Проверим что заказ не отменен
	СтруктураТекущийСтатусЗаказа = ПолучитьТекущийСтатусЗаказа(,,Заказ.Ссылка);
	ТекущийСтатусЗаказа = СтруктураТекущийСтатусЗаказа.Статус;
	Если ТекущийСтатусЗаказа = Перечисления.О2_API_СтатусыЗаказов.Отменён Тогда
		//отмена заказа окончательна
		Возврат Перечисления.О2_API_СтатусыЗаказов.Отменён;
	КонецЕсли;
	
	
	//Получим запрос по заказу
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.Заказ КАК Заказ,
		|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстатки.СкладКомпании КАК СкладКомпании,
		|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК ЗаказаноОстаток,
		|	ЗаказыПокупателейОстатки.РезервОстаток КАК РезервОстаток,
		|	ЗаказыПокупателейОстатки.РезервСвободныйОстаток КАК РезервСвободныйОстаток,
		|	ЗаказПокупателяТовары.ЗаказОтправленПоставщику КАК ЗаказОтправленПоставщику
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			,
		|			Заказ = &Заказ
		|				И СкладКомпании В
		|					(ВЫБРАТЬ
		|						ЗаказПокупателя.СкладКомпании КАК СкладКомпании
		|					ИЗ
		|						Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|					ГДЕ
		|						ЗаказПокупателя.Ссылка = &Заказ)) КАК ЗаказыПокупателейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ПО ЗаказыПокупателейОстатки.Заказ = ЗаказПокупателяТовары.Ссылка
		|			И ЗаказыПокупателейОстатки.Номенклатура = ЗаказПокупателяТовары.Номенклатура";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	//Если таблица пуста то это значит что заказ уже пуст (реализован или отменен) (отменен делается только по API)
	Если РезультатЗапроса.Количество() = 0 Тогда
		//Установим что заказ реализован
		Если ТекущийСтатусЗаказа <> Перечисления.О2_API_СтатусыЗаказов.Реализован Тогда
			ЗаписатьСтатусЗаказа(СтруктураТекущийСтатусЗаказа.IDЗаказа, СтруктураТекущийСтатусЗаказа.ЗаявкаНаРемонт, СтруктураТекущийСтатусЗаказа.ЗаказПокупателя, СтруктураТекущийСтатусЗаказа.ЧекНаОплату, Перечисления.О2_API_СтатусыЗаказов.Реализован);
		КонецЕсли;
		Возврат Перечисления.О2_API_СтатусыЗаказов.Реализован;
	Иначе
		//Если таблица не пуста и резервы равны заказам то заказ готов к выдаче
		Если РезультатЗапроса.Итог("ЗаказаноОстаток") = РезультатЗапроса.Итог("РезервОстаток") Тогда
			//Установим что заказ готов к выдаче
			Если ТекущийСтатусЗаказа <> Перечисления.О2_API_СтатусыЗаказов.ГотовКВыдаче Тогда
				ЗаписатьСтатусЗаказа(СтруктураТекущийСтатусЗаказа.IDЗаказа, СтруктураТекущийСтатусЗаказа.ЗаявкаНаРемонт, СтруктураТекущийСтатусЗаказа.ЗаказПокупателя, СтруктураТекущийСтатусЗаказа.ЧекНаОплату, Перечисления.О2_API_СтатусыЗаказов.ГотовКВыдаче);
			КонецЕсли;
			Возврат Перечисления.О2_API_СтатусыЗаказов.ГотовКВыдаче;
		Иначе
			//Если резервы не равны заказам то заказ не готов к выдаче
			Если ТекущийСтатусЗаказа <> Перечисления.О2_API_СтатусыЗаказов.ТоварыОтправлены Тогда
				ЗаписатьСтатусЗаказа(СтруктураТекущийСтатусЗаказа.IDЗаказа, СтруктураТекущийСтатусЗаказа.ЗаявкаНаРемонт, СтруктураТекущийСтатусЗаказа.ЗаказПокупателя, СтруктураТекущийСтатусЗаказа.ЧекНаОплату, Перечисления.О2_API_СтатусыЗаказов.ТоварыОтправлены);
			КонецЕсли;
			Возврат Перечисления.О2_API_СтатусыЗаказов.ТоварыОтправлены;
		КонецЕсли
	КонецЕсли;
	
КонецФункции

Функция УстановитьГалочкуОтправленНаТоваре(Заказ, Товары) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Заказ) <> Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИзмененияБыли = Ложь;
	
	МассивТоваров = Новый Массив;
	Если ТипЗнч(Товары) = Тип("ТаблицаЗначений") Тогда
		Если Товары.Колонки.Найти("Номенклатура") <> Неопределено Тогда
			ТоварыВрем = Товары.Скопировать( , "Номенклатура");
			ТоварыВрем.Свернуть("Номенклатура");
			МассивТоваров = ТоварыВрем.ВыгрузитьКолонку("Номенклатура");
		КонецЕсли;
	КонецЕсли;
	
	Если МассивТоваров.Количество() Тогда
		ЗаказОб = Заказ.ПолучитьОбъект();
		Для Каждого Товар Из МассивТоваров Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", Товар);
			МассивСтрок = ЗаказОб.Товары.НайтиСтроки(СтруктураОтбора);
			Для Каждого Строка Из МассивСтрок Цикл
				Если НЕ Строка.ЗаказОтправленПоставщику Тогда
					Строка.ЗаказОтправленПоставщику = Истина;
					ИзмененияБыли = Истина;
				КонецЕсли;
			КонецЦикла
		КонецЦикла;
	КонецЕсли;
	
	Если ИзмененияБыли Тогда
		Попытка
			ЗаказОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			сообщить("Не удалось записать галочку отправки товара");
		КонецПопытки;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

#КонецОбласти