#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//

// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ЗаявкаНаРасходДС", "Заявка на расход ДС");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


Функция ПолучитьОтчетПоЛимитам(ПараметрыОтчета) Экспорт
	
	СКД = ПолучитьМакет("ЛимитыСКД");
	НастройкиВарианта 	= СКД.НастройкиПоУмолчанию;            
							  
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("Организация",			ПараметрыОтчета.Организация);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТекПериода",				ПараметрыОтчета.Дата);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ПодразделениеКомпании",	ПараметрыОтчета.ПодразделениеКомпании);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("СуммаТекЗаявки",			ПараметрыОтчета.СуммаДокумента);
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("СтатьяДДС",				ПараметрыОтчета.СтатьяДДС);      
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ЗаявкаНаРасходДС",		ПараметрыОтчета.ЗаявкаНаРасходДС);
	
	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = МакетКомпоновки.Выполнить(СКД, НастройкиВарианта,);
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый 
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ТабличныйДокументРезультата);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновки);     
	
	
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	
	Возврат ТабличныйДокументРезультата;
	
КонецФункции
#КонецОбласти