 
Функция ПолучитьЗначениеПараметраKPI(НачПериода,КонПериода,Пар) Экспорт
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ПараметрыНастройкиKPIСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.ПараметрыНастройкиKPI.СрезПоследних(&Дата, ПараметрыДляKPI = &Пар) КАК ПараметрыНастройкиKPIСрезПоследних");
	Запрос.УстановитьПараметр("Дата",КонПериода);
	Запрос.УстановитьПараметр("Пар",Пар);
	Выб=Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Возврат Выб.Значение;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции
