// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	Штука = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт",Истина);
	Если Штука.Пустая() Тогда
		Штука = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	Иначе
		Штука = Штука.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		Штука.Код="796";
		Штука.Наименование = "шт";
		Штука.НаименованиеПолное = "Штука";
	Иначе
		Если обЗначениеНеЗаполнено(Штука.Код) Тогда
			Штука.Код="796";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Штука.Наименование) Тогда
			Штука.Наименование = "шт";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Штука.НаименованиеПолное) Тогда
			Штука.НаименованиеПолное = "Штука";
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = Штука.ЭтоНовый();
	Если Штука.Модифицированность() Тогда
		Попытка
			Штука.ОбменДанными.Загрузка = ИСТИНА;
			Штука.Записать();
			Сообщить("Справочник ""Классификатор единиц измерения"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(Штука.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	Килограмм = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг",Истина);
	Если Килограмм.Пустая() Тогда
		Килограмм = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	Иначе
		Килограмм = Килограмм.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		Килограмм.Код="166";
		Килограмм.Наименование = "кг";
		Килограмм.НаименованиеПолное = "Килограмм";
	Иначе
		Если обЗначениеНеЗаполнено(Килограмм.Код) Тогда
			Килограмм.Код="166";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Килограмм.Наименование) Тогда
			Килограмм.Наименование = "кг";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Килограмм.НаименованиеПолное) Тогда
			Килограмм.НаименованиеПолное = "Килограмм";
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = Килограмм.ЭтоНовый();
	Если Килограмм.Модифицированность() Тогда
		Попытка
			Килограмм.ОбменДанными.Загрузка = ИСТИНА;
			Килограмм.Записать();
			Сообщить("Справочник ""Классификатор единиц измерения"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(Килограмм.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Метр = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м",Истина);
	Если Метр.Пустая() Тогда
		Метр = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	Иначе
		Метр = Метр.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		Метр.Код="006";
		Метр.Наименование = "м";
		Метр.НаименованиеПолное = "Метр";
	Иначе
		Если обЗначениеНеЗаполнено(Метр.Код) Тогда
			Метр.Код="006";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Метр.Наименование) Тогда
			Метр.Наименование = "м";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(Метр.НаименованиеПолное) Тогда
			Метр.НаименованиеПолное = "Метр";
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = Метр.ЭтоНовый();
	Если Метр.Модифицированность() Тогда
		Попытка
			Метр.ОбменДанными.Загрузка = ИСТИНА;
			Метр.Записать();
			Сообщить("Справочник ""Классификатор единиц измерения"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(Метр.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	ПустаяЕдиница = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("-",Истина);
	Если ПустаяЕдиница.Пустая() Тогда
		ПустаяЕдиница = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
	Иначе
		ПустаяЕдиница = ПустаяЕдиница.ПолучитьОбъект();
	КонецЕсли;	
	Если ЗаполнятьВсе Тогда
		ПустаяЕдиница.Код="001";
		ПустаяЕдиница.Наименование = "-";
		ПустаяЕдиница.НаименованиеПолное = "-";
	Иначе
		Если обЗначениеНеЗаполнено(ПустаяЕдиница.Код) Тогда
			ПустаяЕдиница.Код="001";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПустаяЕдиница.Наименование) Тогда
			ПустаяЕдиница.Наименование = "-";
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПустаяЕдиница.НаименованиеПолное) Тогда
			ПустаяЕдиница.НаименованиеПолное = "-";
		КонецЕсли;
	КонецЕсли;
	НовыйЭлемент = ПустаяЕдиница.ЭтоНовый();
	Если ПустаяЕдиница.Модифицированность() Тогда
		Попытка
			ПустаяЕдиница.ОбменДанными.Загрузка = ИСТИНА;
			ПустаяЕдиница.Записать();
			Сообщить("Справочник ""Классификатор единиц измерения"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ПустаяЕдиница.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
