Функция ПолучитьМассивЦехов(Портал) Экспорт
	//GET /purchase-type
	
	Запрос="/api/purchase-type";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF",Портал);
	
	МассивВозврата=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			Для каждого Элемент ИЗ СтруктураJson Цикл
				МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьМассивВидовРемонта(Портал) Экспорт      
	//GET /purchase-group
	
	Запрос="/api/purchase-tag";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF",Портал);
	
	МассивВозврата=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			СтруктураJson = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			Для каждого Элемент ИЗ СтруктураJson Цикл
				МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивВозврата;
КонецФункции


Функция ПолучитьМассивТиповОплатЗаказНаряда(Портал) Экспорт
	//GET /event-type
	
	Запрос="/api/purchase-group";
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	МассивВозврата=Новый Массив;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивЗапроса = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Для каждого Элемент ИЗ МассивЗапроса Цикл
			МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции


Функция ПолучитьИдентфикаторАвтомобиляПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /vehicle
	Запрос="/api/vehicle?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруАвтомобиляДляПередачиПоОписанию(Описание, Тип)
	СтруктураПередачи=Новый Структура;
	
	//Car {
	//id (integer, optional): ID потребности/автомобиля (генерируется автоматически),
	//dealer_id (integer, optional): ID дилера, подставляется автоматически,
	//type (string, optional): Тип need - потребность, vehicle - автомобиль,
	СтруктураПередачи.Вставить("type","vehicle");
	
	//code (string): Код потребности/автомобиля во внешней системе,
	СтруктураПередачи.Вставить("code",Описание.Код);
	
	//brand_id (integer): ID бренда,
	СтруктураПередачи.Вставить("brand_id",Описание.БрендИдентификатор);
	
	//model_id (integer): ID модели,
	СтруктураПередачи.Вставить("model_id",Описание.МодельИдентификатор);
	
	//model_year_id (integer, optional): ID модельного года,
	
	//version (string, optional): Комплектация,
	СтруктураПередачи.Вставить("version",СокрЛП(Описание.Комплектация));
	
	//color (string, optional): Цвет,
	СтруктураПередачи.Вставить("color",СокрЛП(Описание.Цвет));
	
	//vin (string, optional): VIN,
	СтруктураПередачи.Вставить("vin",СокрЛП(Описание.VIN));
	
	//mileage (integer, optional): Пробег,
	СтруктураПередачи.Вставить("mileage",Описание.Пробег);
	
	//is_test_drive (integer, optional): Машина для тест драйвов
	//	}
	//	
	Возврат СтруктураПередачи;

КонецФункции

Функция СоздатьОбновитьАвтомобиль(Описание,Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=АСРМ_DSFСервис_ПротоколПодключения.ПолучитьИдентфикаторАвтомобиляПоКоду(Описание.Код, Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.АвтомобильКлиента,Идентификатор,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруАвтомобиляДляПередачиПоОписанию(Описание, "vehicle");
	
	//POST /vehicle
	
	Запрос="/api/vehicle";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.АвтомобильКлиента,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции




Функция ПолучитьИдентфикаторЗаказНарядаПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /vehicle
	Запрос="/api/purchase?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруЗаказНарядаДляПередачиПоОписанию(Описание, Портал, Проверен)
	СтруктураПередачи=Новый Структура;
	
	//Purchase {
	//id (integer, optional): Код (генерируется автоматически),
	//dealer_id (integer, optional): ID дилера, подставляется автоматически,
	//code (string): Код заказ-наряда,
	СтруктураПередачи.Вставить("code",Описание.Номер);
	
	//dateOpen (string): Дата открытия заказ-наряда в формате dd.MM.yyyy,
	СтруктураПередачи.Вставить("dateOpen",Формат(Описание.ДатаСоздания,"ДФ=dd.MM.yyyy"));
	
	//dateClose (string, optional): Дата закрытия заказ-наряда в формате dd.MM.yyyy,
	СтруктураПередачи.Вставить("dateClose",Формат(Описание.ДатаЗакрытия,"ДФ=dd.MM.yyyy"));
	
	//<<для Форда, пока так пусть
	СтруктураПередачи.Вставить("dateTimeOpen",Формат(Описание.ДатаСоздания,"ДФ=""dd.MM.yyyy ЧЧ:мм"""));
	
	СтруктураПередачи.Вставить("dateTimeClose",Формат(Описание.ДатаЗакрытия,"ДФ=""dd.MM.yyyy ЧЧ:мм"""));
	//>> для форда

	//Если Портал = Перечисления.ACPM_Портал.FORD тогда
	СтруктураПередачи.Вставить("recommendations",Описание.Рекомендации);
	//ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда
		//acceptor_id (integer): ID мастера приемщика. Получение списка сотрудников осуществляется методом manager. Добавление нового сотрудника осуществляется методом manager .,
	СтруктураПередачи.Вставить("acceptor_id",Описание.МастерИдентификатор);
//	КонецЕсли;
	
	//client_id (integer): ID клиента,
	СтруктураПередачи.Вставить("client_id",Описание.КонтрагентИдентификатор);
	
	//car_id (integer): ID автомобиля,
	СтруктураПередачи.Вставить("car_id",Описание.АвтомобильИдентификатор);

	//purchase_type_id (integer): ID типа заказ-наряда. Получение списка осуществляется методом purchase-type,
	СтруктураПередачи.Вставить("purchase_type_id",Описание.ЦехИдентификатор);
	
	//purchase_group_id (integer, optional): ID группы заказ-наряда. Получение списка осуществляется методом purchase-group,
	СтруктураПередачи.Вставить("purchase_group_id",Описание.ВидРемонтаИдентификатор);
	
	//status (string, optional): Статус (opened - открыт, closed - закрыт, canceled - отменен),
	Если Описание.Состояние="Закрыт" Тогда
		СтруктураПередачи.Вставить("status","closed");
	Иначе
		СтруктураПередачи.Вставить("status","opened");
	КонецЕсли;
	
	//verify (string, optional): Проверен (draft - черновик, approved - утвержден),
	//Если Портал = Перечисления.ACPM_Портал.FORD тогда
	//	СтруктураПередачи.Вставить("verify","approved");
	//ИначеЕсли Портал = Перечисления.ACPM_Портал.УАЗ тогда 
	Если Проверен Тогда
		СтруктураПередачи.Вставить("verify","approved");
	Иначе	
		СтруктураПередачи.Вставить("verify","draft");
	КонецЕсли;	
	//КонецЕсли;
	//request_reason (string, optional): Причина обращения,
	// МА заявленные работы
	Если Описание.Ссылка.ЗаявленныеРаботы.Количество()>0 тогда
		ПричинаОбр = "";
		Для каждого стрЗР ИЗ Описание.Ссылка.ЗаявленныеРаботы Цикл
			ПричинаОбр = СокрЛП(ПричинаОбр + " " + стрЗР.Наименование);
		КонецЦикла;	
		СтруктураПередачи.Вставить("request_reason",ПричинаОбр);
	Иначе
		СтруктураПередачи.Вставить("request_reason",Описание.ПричинаОбращения);
	КонецЕсли;
	
	СтруктураПередачи.Вставить("tags", Описание.ВидРемонта);
	//request_id (integer, optional): ID лида, по которому был создан заказ-наряд,
	//tags (Array[PurchaseTag], optional): Список тегов
	//}	
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьЗаказНаряд(Описание,Проверен = Ложь,Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=АСРМ_DSFСервис_ПротоколПодключения.ПолучитьИдентфикаторЗаказНарядаПоКоду(Описание.Номер,Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,Идентификатор,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруЗаказНарядаДляПередачиПоОписанию(Описание,Портал, Проверен);
	Если СтруктураПередачи.request_reason = "" тогда
		сообщить ("Ошибка: для успешной отправки в CRM заказ-наряда необходимо заполнение поля ПричинаОбращения либо заполнение ЗаявленныхРабот!!!");
	КонецЕсли;
	//POST /purchase
	
	Запрос="/api/purchase";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


Функция ПолучитьИдентфикаторСтрокиЗапчастейЗаказНарядаПоКоду(Код,ИдентификаторЗаказНаряда, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /vehicle
	Запрос="/api/purchase-spare?purchase_id="+Формат(ИдентификаторЗаказНаряда,"ЧГ=0")+"&code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=Неопределено;
		Для Каждого ТекСтрукутура Из МассивРезультата Цикл
			Если ТекСтрукутура.code=Код Тогда
				СтурктураРезультата=ТекСтрукутура;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//СтурктураРезультата=МассивРезультата[0];
		
		Если СтурктураРезультата=Неопределено Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруСтрокиЗапчастейЗаказНарядаДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	
	//PurchaseSpare {
	//id (integer, optional): Код (генерируется автоматически),
	//purchase_id (integer): ID заказ наряда,
	СтруктураПередачи.Вставить("purchase_id",Описание.ЗаказНарядИдентификатор);
	
	//code (string): Код запчасти,
	СтруктураПередачи.Вставить("code",Описание.Код);
	
	//name (string): Название,
	СтруктураПередачи.Вставить("name",Описание.Наименование);
	
	//type (integer): Тип ремонта = ['0 - гарантийный ремонт', '1 - коммерческий ремонт'],
	Если Описание.ГаратийныйРемонт=Истина Тогда
		СтруктураПередачи.Вставить("type",0);
	Иначе
		СтруктураПередачи.Вставить("type",1);
	КонецЕсли;
	
	//price (number): Цена,
	СтруктураПередачи.Вставить("price",Описание.Цена);
	
	//quantity (number): Кол-во,
	СтруктураПередачи.Вставить("quantity",Описание.Количество);
	
	//discount (number): Скидка в рублях,
	СтруктураПередачи.Вставить("discount",Описание.СуммаСкидки);
	
	//sum (number): Сумма
	СтруктураПередачи.Вставить("sum",Описание.Сумма);
	
	//}
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьСтрокуЗапчастейЗаказНаряда(Описание,Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=АСРМ_DSFСервис_ПротоколПодключения.ПолучитьИдентфикаторСтрокиЗапчастейЗаказНарядаПоКоду(Описание.Код,Описание.ЗаказНарядИдентификатор,Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,Идентификатор,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаЗапчастейЗаказНаряда,Описание.НомерСтроки,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруСтрокиЗапчастейЗаказНарядаДляПередачиПоОписанию(Описание);
	
	//POST /purchase-spare
	
	Запрос="/api/purchase-spare";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,СтруктураРезультата.id,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаЗапчастейЗаказНаряда,Описание.НомерСтроки,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


Функция ПолучитьИдентфикаторСтрокиРаботЗаказНарядаПоКоду(Код,ИдентификаторЗаказНаряда, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /purchase-work
	Запрос="/api/purchase-work?purchase_id="+Формат(ИдентификаторЗаказНаряда,"ЧГ=0")+"&code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=Неопределено;
		Для Каждого ТекСтрукутура Из МассивРезультата Цикл
			Если ТекСтрукутура.code=Код Тогда
				СтурктураРезультата=ТекСтрукутура;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//СтурктураРезультата=МассивРезультата[0];
		
		Если СтурктураРезультата=Неопределено Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруСтрокиРаботЗаказНарядаДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	
	//PurchaseWork {
	//id (integer, optional): Код (генерируется автоматически),
	//purchase_id (integer): ID заказ наряда,
	СтруктураПередачи.Вставить("purchase_id",Описание.ЗаказНарядИдентификатор);
	
	//code (string): Код работы,
	СтруктураПередачи.Вставить("code",Описание.Код);
	
	//name (string): Название,
	СтруктураПередачи.Вставить("name",Описание.Наименование);
	
	//price (number): Цена,
	СтруктураПередачи.Вставить("price",Описание.Цена);
	
	//quantity (number): Кол-во,
	СтруктураПередачи.Вставить("quantity",Описание.Количество);
	
	//discount (number): Скидка в рублях,
	СтруктураПередачи.Вставить("discount",Описание.СуммаСкидки);
	
	//sum (number): Сумма
	СтруктураПередачи.Вставить("sum",Описание.Сумма);
	
	//}
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьСтрокуРаботЗаказНаряда(Описание, Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=АСРМ_DSFСервис_ПротоколПодключения.ПолучитьИдентфикаторСтрокиРаботЗаказНарядаПоКоду(Описание.Код,Описание.ЗаказНарядИдентификатор,Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,Идентификатор,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаРаботЗаказНаряда,Описание.НомерСтроки,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруСтрокиРаботЗаказНарядаДляПередачиПоОписанию(Описание);
	
	//POST /purchase-work
	
	Запрос="/api/purchase-work";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ЗаказНаряд,СтруктураРезультата.id,"DSF",ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.СтрокаРаботЗаказНаряда,Описание.НомерСтроки,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


Функция ПередатьЗаказНаряд(ЗаказНарядСсылка, Портал)  Экспорт
	
	Резльтат=Ложь;
	
	Если Не АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПроверитьНеобходимостьОтправкиЗаказНаряда(ЗаказНарядСсылка,Портал) Тогда
		Возврат Истина;	
	КонецЕсли;
	
	ТекстСообщ = ?(Портал = Перечисления.ACPM_Портал.FORD, "Начало передачи заказ-наряда в CRM_FORD ", "Начало передачи заказ-наряда в CRM_UAZ ");
	Сообщить(ТекстСообщ + Строка(ТекущаяДата()));


	//1. Контрагент
	КонтрагентЗН=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьКонтрагентаЗаказНаряда(ЗаказНарядСсылка);
	Успешно=АСРМ_DSFОбщий_ПротоколПодключения.СоздатьОбновитьКонтрагента(АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеКонтрагента(КонтрагентЗН, Портал),, Портал);
	
	Если НЕ Успешно Тогда
		Возврат Резльтат;
	КонецЕсли;
	
	//2. Автомобиль
	Автомобиль=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьАвтомобильЗаказНаряда(ЗаказНарядСсылка);
	ОписаниеАвтомобиля=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеАвтомобиля(Автомобиль,ЗаказНарядСсылка,Портал);
	Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьАвтомобиль(ОписаниеАвтомобиля,Портал);
	
	Если НЕ Успешно Тогда
		Возврат Резльтат;
	КонецЕсли;
	
	//Если Портал = Перечисления.ACPM_Портал.УАЗ тогда
	//3. Мастер
	Мастер=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьМастераЗаказНаряда(ЗаказНарядСсылка);
	ОписаниеМастера=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСотрудника(Мастер, Портал);
	
	//<<Павличенко 06.03.2020 для форд пока пусть так
	//Если Не ЗначениеЗаполнено(ОписаниеМастера.Идентификатор) Тогда
	//>>для форд перезаписывать мастера
	Успешно= АСРМ_DSFОбщий_ПротоколПодключения.СоздатьОбновитьСотрудника(ОписаниеМастера,Портал);
	
	Если НЕ Успешно Тогда
		Возврат Резльтат;
	КонецЕсли;
	//<<пока для фор так	
	//КонецЕсли;
	//>>пока для форд так
	
	Если Портал = Перечисления.ACPM_Портал.FORD тогда
	//	//3. Рекомендации
		Рекомендации=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьРекомендацииЗаказНаряда(ЗаказНарядСсылка);
	КонецЕсли;
	//4. Заказ наряд
	ОписаниеЗаказНаряда=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеЗаказНаряда(ЗаказНарядСсылка,Портал);
	Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьЗаказНаряд(ОписаниеЗаказНаряда,,Портал);
	
	Если НЕ Успешно Тогда
		Возврат Резльтат;
	КонецЕсли;
	
	
	//5. Запчасти
	ОписаниеЗапчастей=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеЗапчастейЗаказНаряда(ЗаказНарядСсылка,Портал);
	Для Каждого ОписаниеЗапчасти ИЗ ОписаниеЗапчастей Цикл
		Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьСтрокуЗапчастейЗаказНаряда(ОписаниеЗапчасти,Портал);
		
		Если НЕ Успешно Тогда
			Возврат Резльтат;
		КонецЕсли;
	КонецЦикла;
	
	//6. Работы
	ОписаниеРабот=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеРаботЗаказНаряда(ЗаказНарядСсылка,Портал);
	Для Каждого ОписаниеРаботы ИЗ ОписаниеРабот Цикл
		Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьСтрокуРаботЗаказНаряда(ОписаниеРаботы, Портал);
		
		Если НЕ Успешно Тогда
			Возврат Резльтат;
		КонецЕсли;
	КонецЦикла;
	//Если Портал = Перечисления.ACPM_Портал.УАЗ тогда
	//7. Заказ наряд Проверен
	ОписаниеЗаказНаряда=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеЗаказНаряда(ЗаказНарядСсылка,Портал);
	Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьЗаказНаряд(ОписаниеЗаказНаряда,Истина,Портал);
	
	Если НЕ Успешно Тогда
		Возврат Резльтат;
	КонецЕсли;
	//КонецЕсли;
	Результат=Истина;
	ТекстСообщ = ?(Портал = Перечисления.ACPM_Портал.FORD, "Заказ-наряд передан в CRM_FORD ", "Заказ-наряд передан в CRM_UAZ ");
	Если Результат Тогда
		Сообщить(ТекстСообщ + Строка(ТекущаяДата()));
	КонецЕсли;

	Возврат Результат;
	

КонецФункции	


Функция СоздатьОбновитьПотребность(Описание, РабочийЛист, Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторПотребностиПоКоду(Описание.Код, Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,Идентификатор,"DSF", ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруАвтомобиляДляПередачиПоОписанию(Описание, "car");
	
	//POST /car
	
	Запрос="/api/car";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Потребность,СтруктураРезультата.id,"DSF", ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьИдентфикаторПотребностиПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /car
	Запрос="/api/car?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

