
&НаКлиенте
Функция ПередОткрытием()
	
	СписокХО = ПолучитьСписокХозОпераций();
	
	ВыбХО = СписокХО.ВыбратьЭлемент("Выберите вид хозяйственной операции");
	Если ВыбХО = Неопределено Тогда
		Возврат Истина;
	Иначе
		
		Объект.ХозОперация = Справочники.ХозОперации[ВыбХО.Значение];
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ПередОткрытием()

&НаКлиенте
Процедура ПоставитьГалочкуНаХозОперацию()

	Если Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
		Элементы.ОперацияКредитная.Пометка = Истина;		
		Элементы.ОперацияСтраховая.Пометка = Ложь;
		Элементы.АктСверкиДопСтраховой.Пометка = Ложь;
		Элементы.АктСверкиКредитный_ПоРетроБонусу.Пометка = Ложь;
		Элементы.АктСверкиСтраховой_ПоРетроБонусу.Пометка = Ложь;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
		Элементы.ОперацияКредитная.Пометка = Ложь;		
		Элементы.ОперацияСтраховая.Пометка = Истина;		     
		Элементы.АктСверкиДопСтраховой.Пометка = Ложь;
		Элементы.АктСверкиКредитный_ПоРетроБонусу.Пометка = Ложь;
		Элементы.АктСверкиСтраховой_ПоРетроБонусу.Пометка = Ложь;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой тогда
		Элементы.ОперацияКредитная.Пометка = Ложь;		
		Элементы.ОперацияСтраховая.Пометка = Ложь;		     
		Элементы.АктСверкиДопСтраховой.Пометка = Истина;
		Элементы.АктСверкиКредитный_ПоРетроБонусу.Пометка = Ложь;
		Элементы.АктСверкиСтраховой_ПоРетроБонусу.Пометка = Ложь;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу тогда
		Элементы.ОперацияКредитная.Пометка = Ложь;		
		Элементы.ОперацияСтраховая.Пометка = Ложь;		     
		Элементы.АктСверкиДопСтраховой.Пометка = Ложь;
		Элементы.АктСверкиКредитный_ПоРетроБонусу.Пометка = Истина;
		Элементы.АктСверкиСтраховой_ПоРетроБонусу.Пометка = Ложь;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу тогда
		Элементы.ОперацияКредитная.Пометка = Ложь;		
		Элементы.ОперацияСтраховая.Пометка = Ложь;		     
		Элементы.АктСверкиДопСтраховой.Пометка = Ложь;
		Элементы.АктСверкиКредитный_ПоРетроБонусу.Пометка = Ложь;
		Элементы.АктСверкиСтраховой_ПоРетроБонусу.Пометка = Истина;
	КонецЕсли;  

КонецПроцедуры // ПоставитьГалочкуНаХозОперацию()

&НаКлиенте
Функция ПолучитьСписокХозОпераций() Экспорт
	
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("АктСверкиКредитный","Акт сверки с кредитной компанией",Истина);
	СписокХозОпераций.Добавить("АктСверкиСтраховой","Акт сверки со страховой компанией",Ложь);	
	СписокХозОпераций.Добавить("АктСверкиДоп_АВ_КВ_Страховой","Акт по доп. АВ/КВ страховой",Ложь);	
	СписокХозОпераций.Добавить("АктСверкиКредитный_ПоРетроБонусу","Акт по ретро бонусу АВ/КВ кредитный",Ложь);	
	СписокХозОпераций.Добавить("АктСверкиСтраховой_ПоРетроБонусу","Акт по ретро бонусу АВ/КВ страховой",Ложь);	
	Возврат СписокХозОпераций;
	
КонецФункции // ПолучитьСписокХозОпераций()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ОТКАЗ = Неопределено и НЕ Отказ и НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		Отказ = ПередОткрытием();
	КонецЕсли;
	
	Элементы.ФормаСкорректироватьВзаимозачеты.Видимость = ложь;
	Элементы.ФормаСкорректироватьВзаимозачеты.Доступность = ложь;
		
	СменаХозОперации();
	ОбновитьДоступностьФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СменаХозОперации()

	Если Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
		ЭтаФорма.Заголовок = Объект.ХозОперация.Наименование + " " + Объект.Номер + " " + Объект.Дата;
		Элементы.РабочиеЛистыАвтомобиль.Заголовок = "Автомобиль";
		Элементы.ГруппаКредитная.Видимость = Истина;
		Элементы.ГруппаСтраховая.Видимость = Ложь;
		Элементы.ГруппаУдержание.Видимость = Ложь;
		Элементы.ГруппаОплат.Видимость = Истина;
		Элементы.РабочиеЛистыГруппа14.Видимость = Истина;
		Элементы.Группа11.Видимость = Истина;
		Элементы.Группа9.Видимость = Истина;  
		Элементы.РабочиеЛистыТолькоПросмотр.Видимость = Истина;
		Элементы.РабочиеЛистыПроверено.Видимость = Истина;
		Элементы.РабочиеЛистыРасхождение.Видимость = Истина;
		Элементы.РабочиеЛистыАВПоАкту.Заголовок = "АВ/КВ по акту";
		Элементы.РабочиеЛистыСтатус.Заголовок = "Статус РЛ";                
		Элементы.ИтогоРасхождение.Заголовок = "Итоговое расхождение";		
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 ++   
		Элементы.НомерАкта.Видимость = Истина;
		Элементы.ЗаявкаНаРасходДС.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 --
		Элементы.НаДату.Видимость = Истина; 
		Элементы.РабочиеЛистыЗаполнить.Видимость = Истина;
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = '00010101';  
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерАкта = 0; 
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
		ЭтаФорма.Заголовок = Объект.ХозОперация.Наименование + " " + Объект.Номер + " " + Объект.Дата;
		Элементы.РабочиеЛистыАвтомобиль.Заголовок = "ОбъектСтрахования";		
		Элементы.ГруппаКредитная.Видимость = Ложь;
		Элементы.ГруппаСтраховая.Видимость = Истина;
		Элементы.ГруппаУдержание.Видимость = Истина;
		Элементы.ГруппаОплат.Видимость = Истина;
		Элементы.РабочиеЛистыГруппа14.Видимость = Истина;
		Элементы.Группа11.Видимость = Истина;
		Элементы.Группа9.Видимость = Истина;                   
		Элементы.РабочиеЛистыТолькоПросмотр.Видимость = Истина;
		Элементы.РабочиеЛистыПроверено.Видимость = Истина;
		Элементы.РабочиеЛистыРасхождение.Видимость = Истина;
		Элементы.РабочиеЛистыАВПоАкту.Заголовок = "АВ/КВ по акту";
		Элементы.РабочиеЛистыСтатус.Заголовок = "Статус РЛ";                
		Элементы.ИтогоРасхождение.Заголовок = "Итоговое расхождение";		
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 ++   
		Элементы.НомерАкта.Видимость = Истина;
		Элементы.ЗаявкаНаРасходДС.Видимость = Истина; 
		Элементы.ФормаСкорректироватьВзаимозачеты.Видимость = Истина;
		Элементы.ФормаСкорректироватьВзаимозачеты.Доступность = Истина;
		//БизТех Коваль А.Д. 27.03.2024 --
		Элементы.НаДату.Видимость = Истина;    
		Элементы.РабочиеЛистыЗаполнить.Видимость = Истина;
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = '00010101';
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерАкта = 0;
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой тогда
		ЭтаФорма.Заголовок = Объект.ХозОперация.Наименование + " " + Объект.Номер + " " + Объект.Дата;
		Элементы.РабочиеЛистыАвтомобиль.Заголовок = "ОбъектСтрахования";		
		Элементы.ГруппаКредитная.Видимость = Ложь;
		Элементы.ГруппаСтраховая.Видимость = Истина;
		Элементы.ГруппаОплат.Видимость = Ложь;
		Элементы.ГруппаУдержание.Видимость= Истина;
		Элементы.РабочиеЛистыГруппа14.Видимость = Ложь; 
		Элементы.Группа11.Видимость = Ложь;
		Элементы.Группа9.Видимость = Ложь;                     
		Элементы.РабочиеЛистыТолькоПросмотр.Видимость = Истина;
		Элементы.РабочиеЛистыПроверено.Видимость = Истина;
		Элементы.РабочиеЛистыРасхождение.Видимость = Истина;
		Элементы.РабочиеЛистыАВПоАкту.Заголовок = "Доп АВ/КВ";
		Элементы.РабочиеЛистыСтатус.Заголовок = "Статус РЛ"; 
		Элементы.ИтогоРасхождение.Заголовок = "Итоговое расхождение";		
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 ++   
		Элементы.НомерАкта.Видимость = Истина;
		Элементы.ЗаявкаНаРасходДС.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 --
		Элементы.НаДату.Видимость = Истина;      
		Элементы.РабочиеЛистыЗаполнить.Видимость = Истина;
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = '00010101';
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерАкта = 0;
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу тогда
		ЭтаФорма.Заголовок = Объект.ХозОперация.Наименование + " " + Объект.Номер + " " + Объект.Дата;	
		Элементы.РабочиеЛистыАвтомобиль.Заголовок = "Автомобиль";
		Элементы.ГруппаКредитная.Видимость = Истина;
		Элементы.ГруппаСтраховая.Видимость = Ложь;
		Элементы.ГруппаУдержание.Видимость = Ложь;
		Элементы.ГруппаОплат.Видимость = Истина;
		Элементы.РабочиеЛистыГруппа14.Видимость = Ложь;
		Элементы.Группа11.Видимость = Ложь;
		Элементы.Группа9.Видимость = Ложь;                     
		Элементы.РабочиеЛистыТолькоПросмотр.Видимость = Ложь;
		Элементы.РабочиеЛистыПроверено.Видимость = Ложь;
		Элементы.РабочиеЛистыРасхождение.Видимость = Ложь;
		Элементы.РабочиеЛистыАВПоАкту.Заголовок = "Сумма бонусов";
		Элементы.РабочиеЛистыСтатус.Заголовок = "Наименование";     
		Элементы.ИтогоРасхождение.Заголовок = "Итого бонусов";
		Элементы.ГруппаКонтрагента.Видимость = Ложь;
		//БизТех Коваль А.Д. 27.03.2024 ++   
		Элементы.НомерАкта.Видимость = Истина;
		Элементы.ЗаявкаНаРасходДС.Видимость = Истина;
		//БизТех Коваль А.Д. 27.03.2024 --   
		Элементы.НаДату.Видимость = Ложь;
		Элементы.РабочиеЛистыЗаполнить.Видимость = Ложь; 
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = ТекущаяДата();  
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерАкта = 1;
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу тогда
		ЭтаФорма.Заголовок = Объект.ХозОперация.Наименование + " " + Объект.Номер + " " + Объект.Дата;	
		Элементы.РабочиеЛистыАвтомобиль.Заголовок = "ОбъектСтрахования";		
		Элементы.ГруппаКредитная.Видимость = Ложь;
		Элементы.ГруппаСтраховая.Видимость = Истина;
		Элементы.ГруппаОплат.Видимость = Истина;
		Элементы.ГруппаУдержание.Видимость = Ложь;
		Элементы.РабочиеЛистыГруппа14.Видимость = Ложь;
		Элементы.Группа11.Видимость = Ложь;
		Элементы.Группа9.Видимость = Ложь;                   
		Элементы.РабочиеЛистыТолькоПросмотр.Видимость = Ложь;
		Элементы.РабочиеЛистыПроверено.Видимость = Ложь;
		Элементы.РабочиеЛистыРасхождение.Видимость = Ложь;
		Элементы.РабочиеЛистыАВПоАкту.Заголовок = "Сумма бонусов";
		Элементы.РабочиеЛистыСтатус.Заголовок = "Наименование";
		Элементы.ИтогоРасхождение.Заголовок = "Итого бонусов";		
		Элементы.ГруппаКонтрагента.Видимость = Ложь;
		//БизТех Коваль А.Д. 27.03.2024 ++
		Элементы.ГруппаКонтрагента.Видимость = Истина;
		Элементы.НомерАкта.Видимость = Ложь;
		Элементы.ЗаявкаНаРасходДС.Видимость = Ложь;
		//БизТех Коваль А.Д. 27.03.2024 --   
		Элементы.НаДату.Видимость = Ложь; 
		Элементы.РабочиеЛистыЗаполнить.Видимость = Ложь;
		Если Не ЗначениеЗаполнено(Объект.ДатаАкта) Тогда
			Объект.ДатаАкта = ТекущаяДата(); 
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.НомерАкта) Тогда
			Объект.НомерАкта = 1;  
		КонецЕсли;
	КонецЕсли;
	
	ПоставитьГалочкуНаХозОперацию();
	
КонецПроцедуры // СменаХозОперации()

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	Если Объект.РабочиеЛисты.Количество() тогда
		Ответ = Вопрос("Табличная часть будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		Объект.РабочиеЛисты.Очистить();
		Объект.ИтогоРасхождение = 0;
		Объект.Итого_АВ_КВ_ПО_Акту = 0;
		Объект.ОбщаяСумма_АВ_КВ = 0;
		Модифицированность = Истина;
	КонецЕсли;	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) тогда
		Объект.Организация = ПараметрыСеанса.Организация;
		Объект.ПодразделенияКомпании = ПараметрыСеанса.ПодразделениеКомпании;
		Объект.НаДату = КонецДня(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
			
	Если ТипЗнч(Команда) = Тип("КомандаФормы") или Объект.РабочиеЛисты.Количество() тогда
		Если Объект.РабочиеЛисты.Количество() тогда
			//БизТех Коваль А.Д. 27.03.2024 ++
			Ответ = Вопрос("Очистить табличную часть перед заполнением?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
			Если Ответ = КодВозвратаДиалога.Нет тогда
				Модифицированность = Истина;  
				//Возврат;
				//БизТех Коваль А.Д. 27.03.2024 --
			Иначе
				Объект.РабочиеЛисты.Очистить();
				Объект.ИтогоРасхождение = 0;
				Объект.Итого_АВ_КВ_ПО_Акту = 0;
				Объект.ОбщаяСумма_АВ_КВ = 0;
				Модифицированность = Истина;
			КонецЕсли;
        КонецЕсли;
		
		Если Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
			Если ВсеПоляЗаполненны() тогда
				ЗаполнитьКредитнымиЛистами();
			КонецЕсли;
		ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
			Если ВсеПоляЗаполненны() тогда
				ЗаполнитьСтраховымиЛистами();
			КонецЕсли;
		ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой тогда
			Если ВсеПоляЗаполненны() тогда
				ЗаполнитьАктСверкиДопСтрах();
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьАктСверкиДопСтрах()
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.ПодразделенияКомпании) и НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки,
			|	DN_АВ_КредитноСтраховыеСделки.Расхождение КАК Расхождение
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И НЕ DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.Расхождение < 0
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.ПодразделенияКомпании = &ПодразделенияКомпании
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.УчтеноДопКВ = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и НЕ ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки,
			|	DN_АВ_КредитноСтраховыеСделки.Расхождение КАК Расхождение
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И НЕ DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.Расхождение < 0
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
			|	И DN_АВ_КредитноСтраховыеСделки.УчтеноДопКВ = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки,
			|	DN_АВ_КредитноСтраховыеСделки.Расхождение КАК Расхождение
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И НЕ DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.Расхождение < 0
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.ПодразделенияКомпании = &ПодразделенияКомпании
			|	И DN_АВ_КредитноСтраховыеСделки.УчтеноДопКВ = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки,
			|	DN_АВ_КредитноСтраховыеСделки.Расхождение КАК Расхождение
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И НЕ DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.Расхождение < 0
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.УчтеноДопКВ = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтраховыеЛисты = РезультатЗапроса.Выбрать();
	
	Пока СтраховыеЛисты.Следующий() Цикл
		ДляПроверки = Новый Структура;
		ДляПроверки.Вставить("СсылкаНаРабочийЛист", СтраховыеЛисты.Лист.Ссылка);		
		Если Объект.РабочиеЛисты.НайтиСтроки(ДляПроверки).Количество() = 0 тогда
			НомерСтроки = СтраховыеЛисты.НомерСтроки - 1;
			
			НоваяСтрока = Объект.РабочиеЛисты.Добавить();
			НоваяСтрока.Проверено = Ложь; 
			//НоваяСтрока.Подразделение = СтраховыеЛисты.Лист.ПодразделениеКомпании;
			НоваяСтрока.Клиент  = СтраховыеЛисты.Лист.Страхователь;
			НоваяСтрока.СсылкаНаРабочийЛист = СтраховыеЛисты.Лист.Ссылка;
			НоваяСтрока.Статус = СтраховыеЛисты.Лист.Статус;
			НоваяСтрока.ДатаЛиста = СтраховыеЛисты.Лист.Дата;
			НоваяСтрока.НомерРабочегоЛиста = СтраховыеЛисты.Лист.Номер;
			НоваяСтрока.МенеджерОформитель = СтраховыеЛисты.Лист.Менеджер;
							
			СтрокаЛиста = СтраховыеЛисты.Лист.ВариантыСтрахования[НомерСтроки];
			Программа = СтрокаЛиста.ПрограммаСтрахования;
			НоваяСтрока.Программа = Программа;
			НоваяСтрока.Автомобиль = СтрокаЛиста.ОбъектСтрахования;
			Если ТипЗнч(НоваяСтрока.Автомобиль) = ТИП("СправочникСсылка.Автомобили") тогда
				НоваяСтрока.VIN = СтраховыеЛисты.Лист.Автомобиль.VIN;
			КонецЕсли; 
			
			НоваяСтрока.ВидОплаты = СтрокаЛиста.ТТ_ВидОплаты;
			НоваяСтрока.БланкКСО = СтрокаЛиста.БланкПолиса;
			НоваяСтрока.Брутто = СтрокаЛиста.СуммаБрутто;
			НоваяСтрока.Нетто = СтрокаЛиста.СуммаНетто; 
			НоваяСтрока.ПроцентКомиссии = СтрокаЛиста.ПроцентКомиссии; 
			НоваяСтрока.ОбщаяСуммаАВ = СтрокаЛиста.СуммаКомиссии;
			НоваяСтрока.Расхождение = СтраховыеЛисты.Расхождение - НоваяСтрока.АВПоАкту;
			НоваяСтрока.Удержание = Истина;
			
			Если НЕ НоваяСтрока.ВидОплаты = Перечисления.ТТ_ВидыОплатыСтраховки.Кредит тогда
				СуммаОплат = ПолучитьСуммуОплат(НоваяСтрока.СсылкаНаРабочийЛист,НоваяСтрока.ВидОплаты);
				НоваяСтрока.СуммаОплат = СуммаОплат;
				НоваяСтрока.РасхождениеПоОплатам = СуммаОплат - НоваяСтрока.Брутто;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры // ЗаполнитьАктСверкиДопСтраз()  

&НаКлиенте
Функция ВсеПоляЗаполненны()

	Если НЕ ЗначениеЗаполнено(Объект.НаДату) тогда
		Предупреждение("Необходимо заполнить поле сформировать на дату ",,"Внимание");
		Возврат Ложь;	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Контрагент) тогда	
		Предупреждение("Необходимо заполнить Контрагента",,"Внимание");
		Возврат Ложь;	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) тогда	
		Предупреждение("Необходимо заполнить Договор Взаиморасчетов",,"Внимание");
		Возврат Ложь;	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Организация) тогда
		Предупреждение("Необходимо заполнить Организацию",,"Внимание");
		Возврат Ложь;	
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ХозОперация) тогда
		Предупреждение("Необходимо заполнить Хоз операцию",,"Внимание");
		Возврат Ложь;	
	КонецЕсли;

	Возврат Истина;
КонецФункции // ВсеПоляЗаполненны()

&НаСервере
Процедура ЗаполнитьКредитнымиЛистами()
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.ПодразделенияКомпании) и НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Одобрен)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиКредитный)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.ПодразделенияКомпании = &ПодразделенияКомпании
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и НЕ ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Одобрен)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиКредитный)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.ДоговорыВзаиморасчетов = &ДоговорыВзаиморасчетов";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ДоговорыВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Одобрен)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиКредитный)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.ДоговорыВзаиморасчетов = &ДоговорыВзаиморасчетов
			|	И DN_АВ_КредитноСтраховыеСделки.ПодразделенияКомпании = &ПодразделенияКомпании";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ДоговорыВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Одобрен)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиКредитный)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	КредитныеЛисты = РезультатЗапроса.Выбрать();  
	Пока КредитныеЛисты.Следующий() Цикл
		ДляПроверки = Новый Структура;
		ДляПроверки.Вставить("СсылкаНаРабочийЛист", КредитныеЛисты.Лист.Ссылка);		
		Если Объект.РабочиеЛисты.НайтиСтроки(ДляПроверки).Количество() = 0 тогда
			НоваяСтрока = Объект.РабочиеЛисты.Добавить();
			НоваяСтрока.Проверено = Ложь;
			НоваяСтрока.Клиент  = КредитныеЛисты.Лист.Клиент;
			НоваяСтрока.Подразделение = КредитныеЛисты.Лист.ПодразделениеКомпании;
			НоваяСтрока.СсылкаНаРабочийЛист = КредитныеЛисты.Лист.Ссылка;
			НоваяСтрока.Статус = КредитныеЛисты.Лист.Статус;
			НоваяСтрока.ДатаЛиста = КредитныеЛисты.Лист.Дата;
			НоваяСтрока.НомерРабочегоЛиста = КредитныеЛисты.Лист.Номер;
			НоваяСтрока.Программа = КредитныеЛисты.Лист.КредитнаяПрограмма;
			НоваяСтрока.Автомобиль = КредитныеЛисты.Лист.Автомобиль.Модель;
			Если ЗначениеЗаполнено(НоваяСтрока.Автомобиль) тогда
				НоваяСтрока.VIN = КредитныеЛисты.Лист.Автомобиль.VIN;
			КонецЕсли;
			НоваяСтрока.СтоимостьАвтомобиля = КредитныеЛисты.Лист.СтоимостьАвтомобиля;
			НоваяСтрока.СуммаКредита = КредитныеЛисты.Лист.СуммаКредита;
			НоваяСтрока.АВЗаКредит = КредитныеЛисты.Лист.сав_СуммаКредита;
			НоваяСтрока.АВПроцентКАСКО = КредитныеЛисты.Лист.пав_КАСКО;
			НоваяСтрока.АВСуммаКАСКО = КредитныеЛисты.Лист.сав_КАСКО;
			НоваяСтрока.АВПроцентСЖБанк = КредитныеЛисты.Лист.пав_СЖБанк;
			НоваяСтрока.АВСуммаСЖБанк = КредитныеЛисты.Лист.сав_СЖБанк;
			НоваяСтрока.АВПроцентGAPБанк = КредитныеЛисты.Лист.пав_GAPБанк;
			НоваяСтрока.АВСуммаGAPБанк = КредитныеЛисты.Лист.сав_GAPБанк;
			НоваяСтрока.АВПроцентПрУслуги = КредитныеЛисты.Лист.пав_ПрочиеУслуги;
			НоваяСтрока.АВСуммаПрУслуги = КредитныеЛисты.Лист.сав_ПрочиеУслуги;
			НоваяСтрока.ОбщаяСуммаКредита = КредитныеЛисты.Лист.ОбщаяСуммаКредита;
			НоваяСтрока.ОбщаяСуммаАВ = КредитныеЛисты.Лист.ОбщаяСуммаАВ;
			НоваяСтрока.МенеджерОформитель = КредитныеЛисты.Лист.Менеджер;
			НоваяСтрока.Расхождение = НоваяСтрока.АВПоАкту - НоваяСтрока.ОбщаяСуммаАВ;	
		КонецЕсли;		
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры // НайтиКредитныеЛисты()

&НаСервере
Функция ЗаполнитьСтраховымиЛистами()

	 Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Объект.ПодразделенияКомпании) и НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.ПодразделенияКомпании = &ПодразделенияКомпании
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и НЕ ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.ДоговорыВзаиморасчетов = &ДоговорыВзаиморасчетов";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ДоговорыВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) и ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание
			|	И DN_АВ_КредитноСтраховыеСделки.ДоговорыВзаиморасчетов = &ДоговорыВзаиморасчетов
			|	И DN_АВ_КредитноСтраховыеСделки.ПодразделенияКомпании = &ПодразделенияКомпании";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПодразделенияКомпании", Объект.ПодразделенияКомпании);
		Запрос.УстановитьПараметр("ДоговорыВзаиморасчетов", Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	DN_АВ_КредитноСтраховыеСделки.Регистратор КАК Лист,
			|	DN_АВ_КредитноСтраховыеСделки.НомерСтроки КАК НомерСтроки
			|ИЗ
			|	РегистрСведений.DN_АВ_КредитноСтраховыеСделки КАК DN_АВ_КредитноСтраховыеСделки
			|ГДЕ
			|	DN_АВ_КредитноСтраховыеСделки.Статус = ЗНАЧЕНИЕ(Справочник.СтатусыРабочегоЛиста.Подготовка)
			|	И DN_АВ_КредитноСтраховыеСделки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.АктСверкиСтраховой)
			|	И DN_АВ_КредитноСтраховыеСделки.Организация = &Организация
			|	И DN_АВ_КредитноСтраховыеСделки.Контрагент = &Контрагент
			|	И DN_АВ_КредитноСтраховыеСделки.АктСверки = ЗНАЧЕНИЕ(Документ.DN_АктСверкиКредитСтрах.ПустаяСсылка)
			|	И DN_АВ_КредитноСтраховыеСделки.Период МЕЖДУ &ПериодНачало И &ПериодОкончание";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ПериодНачало", ДобавитьМесяц(ТекущаяДата(),-12));
		Запрос.УстановитьПараметр("ПериодОкончание", КонецДня(Объект.НаДату));

	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтраховыеЛисты = РезультатЗапроса.Выбрать();
	
	Пока СтраховыеЛисты.Следующий() Цикл
		ДляПроверки = Новый Структура;
		ДляПроверки.Вставить("СсылкаНаРабочийЛист", СтраховыеЛисты.Лист.Ссылка);		
		Если Объект.РабочиеЛисты.НайтиСтроки(ДляПроверки).Количество() = 0 тогда
			НомерСтроки = СтраховыеЛисты.НомерСтроки - 1;
			
			НоваяСтрока = Объект.РабочиеЛисты.Добавить();
			НоваяСтрока.Проверено = Ложь;
			НоваяСтрока.Клиент  = СтраховыеЛисты.Лист.Страхователь; 
			НоваяСтрока.Подразделение = СтраховыеЛисты.Лист.ПодразделениеКомпании;  //Bizteh 30/01/2023
			НоваяСтрока.СсылкаНаРабочийЛист = СтраховыеЛисты.Лист.Ссылка;
			НоваяСтрока.Статус = СтраховыеЛисты.Лист.Статус;
			НоваяСтрока.ДатаЛиста = СтраховыеЛисты.Лист.Дата;
			НоваяСтрока.НомерРабочегоЛиста = СтраховыеЛисты.Лист.Номер;
			НоваяСтрока.МенеджерОформитель = СтраховыеЛисты.Лист.Менеджер;
							
			СтрокаЛиста = СтраховыеЛисты.Лист.ВариантыСтрахования[НомерСтроки];
			Программа = СтрокаЛиста.ПрограммаСтрахования;
			НоваяСтрока.Программа = Программа;
			НоваяСтрока.Автомобиль = СтрокаЛиста.ОбъектСтрахования;
			Если ТипЗнч(НоваяСтрока.Автомобиль) = ТИП("СправочникСсылка.Автомобили") тогда
				НоваяСтрока.VIN = СтраховыеЛисты.Лист.Автомобиль.VIN;
			КонецЕсли; 
			
			НоваяСтрока.ВидОплаты = СтрокаЛиста.ТТ_ВидОплаты;
			НоваяСтрока.БланкКСО = СтрокаЛиста.БланкПолиса;
			НоваяСтрока.Брутто = СтрокаЛиста.СуммаБрутто;
			НоваяСтрока.Нетто = СтрокаЛиста.СуммаНетто; 
			НоваяСтрока.ПроцентКомиссии = СтрокаЛиста.ПроцентКомиссии; 
			НоваяСтрока. ОбщаяСуммаАВ = СтрокаЛиста.СуммаКомиссии;
			НоваяСтрока.Расхождение = НоваяСтрока.АВПоАкту - НоваяСтрока.ОбщаяСуммаАВ;
			
			//Если НЕ НоваяСтрока.ВидОплаты = Перечисления.ТТ_ВидыОплатыСтраховки.Кредит тогда
				//СуммаОплат = ПолучитьСуммуОплат(НоваяСтрока.СсылкаНаРабочийЛист,НоваяСтрока.ВидОплаты);
				СуммаОплат = ПолучитьСуммуОплат_БТ(НоваяСтрока.СсылкаНаРабочийЛист);
				НоваяСтрока.СуммаОплат = СуммаОплат;
				НоваяСтрока.РасхождениеПоОплатам = СуммаОплат - НоваяСтрока.Брутто;
			//КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецФункции // НайтиСтраховыеЛисты()

&НаСервере
Функция ПолучитьСуммуОплат(Документ,ВидОплаты)

	Сумма = 0;
	Если ВидОплаты = Перечисления.ТТ_ВидыОплатыСтраховки.Наличные тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПриходныйКассовыйОрдер.СуммаДокумента КАК Сумма
			|ИЗ
			|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
			|ГДЕ
			|	ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
			|	И ПриходныйКассовыйОрдер.Сделка = &Документ";
		
		Запрос.УстановитьПараметр("Документ",Документ);  
		Если ЗначениеЗаполнено(Документ.БТ_ДокЗН) Тогда
			Запрос.УстановитьПараметр("Документ",Документ.БТ_ДокЗН); 
		КонецЕсли;

		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Сумма = Сумма + Выборка.Сумма;
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Чек.СуммаДокумента КАК Сумма
			|ИЗ
			|	Документ.Чек КАК Чек
			|ГДЕ
			|	Чек.ПометкаУдаления = ЛОЖЬ
			|	И Чек.ДокументОснование = &Документ";
		
		Запрос.УстановитьПараметр("Документ",Документ);
		Если ЗначениеЗаполнено(Документ.БТ_ДокЗН) Тогда
			Запрос.УстановитьПараметр("Документ",Документ.БТ_ДокЗН); 
		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.Сумма = NULL тогда
				Сумма = Сумма + Выборка.Сумма;
			КонецЕсли;
		КонецЦикла;		
		
	ИначеЕсли ВидОплаты = Перечисления.ТТ_ВидыОплатыСтраховки.Эквайринг тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЧекНаОплату.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ Чеки
			|ИЗ
			|	Документ.ЧекНаОплату КАК ЧекНаОплату
			|ГДЕ
			|	ЧекНаОплату.Сделка = &Документ
			|	И ЧекНаОплату.ПометкаУдаления = ЛОЖЬ
			|;
            |////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СУММА(ЧекНаОплатуОплаты.Сумма) КАК Сумма
			|ИЗ
			|	Чеки КАК Чеки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекНаОплату.Оплаты КАК ЧекНаОплатуОплаты
			|		ПО Чеки.Ссылка = ЧекНаОплатуОплаты.Ссылка";
		
		Запрос.УстановитьПараметр("Документ",Документ);
		Если ЗначениеЗаполнено(Документ.БТ_ДокЗН) Тогда
			Запрос.УстановитьПараметр("Документ",Документ.БТ_ДокЗН); 
		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.Сумма = NULL тогда
				Сумма = Сумма + Выборка.Сумма;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции // ПолучитьСуммуОплат()

&НаСервере
Функция ПолучитьСуммуОплат_БТ(Документ) 
	СуммаОплат = 0;
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыКомпанииОбороты.СуммаРасход КАК СуммаРасход
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыКомпании.Обороты(&ДатаНачала, &ДатаКонец, , ДоговорВзаиморасчетов = &Договор) КАК ВзаиморасчетыКомпанииОбороты
	               |ГДЕ
	               |	ВзаиморасчетыКомпанииОбороты.ДоговорВзаиморасчетов = &Договор";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоМесяца(Документ.Дата));
	Запрос.УстановитьПараметр("ДатаКонец", Объект.НаДату);
	Запрос.УстановитьПараметр("Договор", Документ.ДоговорКСО);  
	//БизТех Аляль 28.12.2024 ТЗ по КСО <<
	Если ЗначениеЗаполнено(Документ.БТ_ДокЗН) Тогда
		Запрос.УстановитьПараметр("Договор", Документ.БТ_ДокЗН.ДоговорВзаиморасчетов);
	КонецЕсли; 
	//>>
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл  
		СуммаОплат = Результат.СуммаРасход;
	КонецЦикла;	
	Возврат СуммаОплат;
КонецФункции

&НаКлиенте
Процедура РабочиеЛистыАВПоАктуПриИзменении(Элемент)
	Если НЕ Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиДоп_АВ_КВ_Страховой" тогда 
		Строка = Элементы.РабочиеЛисты.ТекущиеДанные;
		Строка.Расхождение = Строка.АВПоАкту - Строка.ОбщаяСуммаАВ;
	КонецЕсли;  
	
	Если Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиКредитный_ПоРетроБонусу"
			или Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиСтраховой_ПоРетроБонусу" тогда
		Объект.ИтогоРасхождение = 0;
		Для Каждого Строка из Объект.РабочиеЛисты Цикл
			Объект.ИтогоРасхождение = Объект.ИтогоРасхождение + Строка.АВПоАкту;			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ВыделенныеСтроки = Элементы.РабочиеЛисты.ВыделенныеСтроки;
	
	Для Каждого Строка из ВыделенныеСтроки Цикл
		Значение = Объект.РабочиеЛисты.НайтиПоИдентификатору(Строка);
		
		Если Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиКредитный_ПоРетроБонусу"
			или Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиСтраховой_ПоРетроБонусу" тогда
        	Объект.ИтогоРасхождение = Объект.ИтогоРасхождение - Значение.АВПоАкту;
		КонецЕсли;
		
		Если Значение.Проверено тогда
			Ответ = Вопрос("Вы хотите удалить проверянную строку, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
			Если Ответ = КодВозвратаДиалога.Нет тогда
				Возврат;
			КонецЕсли;

			Объект.ИтогоРасхождение = Объект.ИтогоРасхождение - Значение.Расхождение;
			Объект.ОбщаяСумма_АВ_КВ = Объект.ОбщаяСумма_АВ_КВ - Значение.ОбщаяСуммаАВ;
			Объект.Итого_АВ_КВ_ПО_Акту = Объект.Итого_АВ_КВ_ПО_Акту - Значение.АВПоАкту;
			
		КонецЕсли;
		Объект.РабочиеЛисты.Удалить(Значение);
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЛистыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если (Элемент.ТекущийЭлемент.Имя = "РабочиеЛистыНомерРабочегоЛиста" или Элемент.ТекущийЭлемент.Имя = "РабочиеЛистыДатаЛиста") 
			и Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
			
		РабочийЛист = Элемент.ТекущиеДанные.СсылкаНаРабочийЛист;
		Параметр = Новый Структура;
		Параметр.Вставить("Ключ",РабочийЛист);
		Форма = ОткрытьФорму("Документ.РабочийЛистКредитногоОтдела.ФормаОбъекта",Параметр,ЭтаФорма); 
		Форма.ТолькоПросмотр = Истина; 	
		
	ИначеЕсли (Элемент.ТекущийЭлемент.Имя = "РабочиеЛистыНомерРабочегоЛиста" или Элемент.ТекущийЭлемент.Имя = "РабочиеЛистыДатаЛиста")
			и Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
			
		РабочийЛист = Элемент.ТекущиеДанные.СсылкаНаРабочийЛист;
		Параметр = Новый Структура;
		Параметр.Вставить("Ключ",РабочийЛист);
		Форма = ОткрытьФорму("Документ.РабочийЛистОтделаСтрахования.ФормаОбъекта",Параметр,ЭтаФорма); 
		Форма.ТолькоПросмотр = Истина; 	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЛистыПровереноПриИзменении(Элемент)

	Строка = Элементы.РабочиеЛисты.ТекущиеДанные;
//БизТех 16.03.2023г. <<	
//	Если ЗначениеЗаполнено(Строка.АВПоАкту) или Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиДоп_АВ_КВ_Страховой" тогда

		Если Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиДоп_АВ_КВ_Страховой" тогда
			Если Строка.Проверено тогда
				Объект.ИтогоРасхождение = Объект.ИтогоРасхождение + (Строка.Расхождение + Строка.АВПоАкту);
			Иначе
				Объект.ИтогоРасхождение = Объект.ИтогоРасхождение - (Строка.Расхождение + Строка.АВПоАкту);
			КонецЕсли;
		Иначе
			Если Строка.Проверено тогда
				Объект.ИтогоРасхождение = Объект.ИтогоРасхождение + Строка.Расхождение;
				Объект.ОбщаяСумма_АВ_КВ = Объект.ОбщаяСумма_АВ_КВ + Строка.ОбщаяСуммаАВ;
				Объект.Итого_АВ_КВ_ПО_Акту = Объект.Итого_АВ_КВ_ПО_Акту + Строка.АВПоАкту;
			Иначе
				Объект.ИтогоРасхождение = Объект.ИтогоРасхождение - Строка.Расхождение;
				Объект.ОбщаяСумма_АВ_КВ = Объект.ОбщаяСумма_АВ_КВ - Строка.ОбщаяСуммаАВ;
				Объект.Итого_АВ_КВ_ПО_Акту = Объект.Итого_АВ_КВ_ПО_Акту - Строка.АВПоАкту;
			КонецЕсли;
		КонецЕсли;
	//Иначе
	//	Строка = Объект.РабочиеЛисты.НайтиПоИдентификатору(Элементы.РабочиеЛисты.ТекущаяСтрока);
	//	Строка.Проверено = Ложь;
	//	Текст = "Не задано значение АВ/КВ по АКТУ!";
	//	ПоказатьОповещениеПользователя ("Внимание",,Текст,БиблиотекаКартинок.Информация32);
	//КонецЕсли; 
	// >>
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ПодразделенияКомпании = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	Объект.РабочиеЛисты.Очистить();	
	Объект.ОбщаяСумма_АВ_КВ = 0;
	Объект.Итого_АВ_КВ_ПО_Акту = 0;
	Объект.ИтогоРасхождение = 0;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Объект.РабочиеЛисты.Очистить();	
	Объект.ОбщаяСумма_АВ_КВ = 0;
	Объект.Итого_АВ_КВ_ПО_Акту = 0;
	Объект.ИтогоРасхождение = 0;
КонецПроцедуры

&НаКлиенте
Процедура СменитьХозОперацию(Команда)
	
	Если Команда.Имя = "ОперацияКредитная" и НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда
		Ответ = Вопрос("При смене Хоз Операции документ будет очищен, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		ОчиститьДокумент();
		Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный;
		ПриОткрытии(НЕОПРЕДЕЛЕНО);
		
	ИначеЕсли Команда.Имя = "ОперацияСтраховая" и НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой тогда
		Ответ = Вопрос("При смене Хоз Операции документ будет очищен, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		ОчиститьДокумент();
		Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой;
		ПриОткрытии(НЕОПРЕДЕЛЕНО);
		
	ИначеЕсли Команда.Имя = "АктСверкиДопСтраховой" и НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой тогда
		Ответ = Вопрос("При смене Хоз Операции документ будет очищен, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		ОчиститьДокумент();
		Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой;
		ПриОткрытии(НЕОПРЕДЕЛЕНО);	
		
	ИначеЕсли Команда.Имя = "АктСверкиКредитный_ПоРетроБонусу" и НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу тогда
		Ответ = Вопрос("При смене Хоз Операции документ будет очищен, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		ОчиститьДокумент();
		Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу;
		ПриОткрытии(НЕОПРЕДЕЛЕНО);
		
	ИначеЕсли Команда.Имя = "АктСверкиСтраховой_ПоРетроБонусу" и НЕ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу тогда
		Ответ = Вопрос("При смене Хоз Операции документ будет очищен, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
		Если Ответ = КодВозвратаДиалога.Нет тогда
			Возврат;
		КонецЕсли;
		ОчиститьДокумент();
		Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу;
		ПриОткрытии(НЕОПРЕДЕЛЕНО);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДокумент()

	Объект.РабочиеЛисты.Очистить();
	Объект.ИтогоРасхождение = 0;
	Объект.Итого_АВ_КВ_ПО_Акту = 0;
	Объект.ОбщаяСумма_АВ_КВ = 0;
	
	Объект.Организация = ПараметрыСеанса.Организация;
	Объект.ПодразделенияКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	Объект.ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	Объект.ДатаАкта = "010101";
	Объект.НомерАкта = "";	

КонецПроцедуры // ОчиститьДокумент()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		СозданыДокументы = НайтиДокументы();
		
		Если НЕ СозданыДокументы Тогда
			//Bizteh 31/01/2023 для каждого Подразделения из табличной части создаем документ <<	
			Если Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный тогда  
				ЗапросПоПодр = Новый запрос;
				ЗапросПоПодр.Текст =  "ВЫБРАТЬ
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту КАК АВПоАкту,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение КАК Подразделение,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.НомерСтроки КАК НомерСтроки,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено КАК Проверено,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист КАК СсылкаНаРабочийЛист
				                      |ИЗ
				                      |	Документ.DN_АктСверкиКредитСтрах.РабочиеЛисты КАК DN_АктСверкиКредитСтрахРабочиеЛисты
				                      |ГДЕ
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.Ссылка = &Ссылка
				                      |	И DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено
				                      |
				                      |СГРУППИРОВАТЬ ПО
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.НомерСтроки,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено,
				                      |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист
				                      |ИТОГИ
				                      |	СУММА(АВПоАкту)
				                      |ПО
				                      |	Подразделение";   
				ЗапросПоПодр.УстановитьПараметр("Ссылка",Объект.Ссылка);
				РезультатПодр = ЗапросПоПодр.Выполнить(); 
				ВыборкаПодр = РезультатПодр.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение"); 
				Пока ВыборкаПодр.Следующий() Цикл
				     СоздатьДокОказанияУслуг_БТ(ВыборкаПодр.АВПоАкту,ВыборкаПодр.Подразделение);
				КонецЦикла;	

 
				
			//	СоздатьДокОказанияУслуг(Объект.Итого_АВ_КВ_ПО_Акту);
			//>>	
		ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой 
			ИЛИ Объект.ХозОперация = Справочники.ХозОперации.АктСверкиДоп_АВ_КВ_Страховой Тогда
					 
				//Bizteh 31/01/2023 для каждого Подразделения из табличной части создаем документ <<
				ЗапросУД = Новый запрос;
				ЗапросУД.Текст =     "ВЫБРАТЬ
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту КАК АВПоАкту,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Нетто КАК Нетто,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение КАК Подразделение,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.НомерСтроки КАК НомерСтроки,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено КАК Проверено,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Клиент КАК Клиент,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист КАК СсылкаНаРабочийЛист
				                     |ИЗ
				                     |	Документ.DN_АктСверкиКредитСтрах.РабочиеЛисты КАК DN_АктСверкиКредитСтрахРабочиеЛисты
				                     |ГДЕ
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Ссылка = &Ссылка
				                     |	И DN_АктСверкиКредитСтрахРабочиеЛисты.Удержание
				                     |	И DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено
				                     |
				                     |СГРУППИРОВАТЬ ПО
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Нетто,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.НомерСтроки,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.Клиент,
				                     |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист
				                     |ИТОГИ
				                     |	СУММА(АВПоАкту),
				                     |	СУММА(Нетто)
				                     |ПО
				                     |	Подразделение";
				
				ЗапросУД.УстановитьПараметр("Ссылка",Объект.Ссылка);
				РезультатУд = ЗапросУД.Выполнить(); 
				ВыборкаУдПодр = РезультатУд.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение"); 
				Пока ВыборкаУдПодр.Следующий() Цикл
				     СоздатьДокОказанияУслуг_БТ(ВыборкаУдПодр.АВПоАкту,ВыборкаУдПодр.Подразделение);
				КонецЦикла;	
				//Отбор = Новый Структура("Удержание",Истина);
				//Строки = Объект.РабочиеЛисты.НайтиСтроки(Отбор);
				//СуммаАВБезУдержания = 0;
				//СуммаНетто = 0;
				//Если Строки.Количество() тогда
				//	Для Каждого Строка из Строки Цикл
				//		СуммаАВБезУдержания = СуммаАВБезУдержания + Строка.АВПоАкту;	
				//		СуммаНетто = СуммаНетто + Строка.Нетто;
				//	КонецЦикла;
				//	СоздатьДокОказанияУслуг(СуммаАВБезУдержания);
				//	//Реализовано через обработку СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО
				//	//СоздатьЗаявкуНаРасходДС(СуммаНетто);
				//КонецЕсли;
				ЗапросНеУД = Новый запрос;
				ЗапросНеУД.Текст =     "ВЫБРАТЬ
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение КАК Подразделение,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.Брутто КАК Брутто,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист КАК СсылкаНаРабочийЛист,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту КАК АВПоАкту
				                       |ИЗ
				                       |	Документ.DN_АктСверкиКредитСтрах.РабочиеЛисты КАК DN_АктСверкиКредитСтрахРабочиеЛисты
				                       |ГДЕ
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.Ссылка = &Ссылка
				                       |	И НЕ DN_АктСверкиКредитСтрахРабочиеЛисты.Удержание
				                       |	И DN_АктСверкиКредитСтрахРабочиеЛисты.Проверено
				                       |
				                       |СГРУППИРОВАТЬ ПО
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.Подразделение,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.Брутто,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.СсылкаНаРабочийЛист,
				                       |	DN_АктСверкиКредитСтрахРабочиеЛисты.АВПоАкту
				                       |ИТОГИ
				                       |	СУММА(Брутто),
				                       |	СУММА(АВПоАкту)
				                       |ПО
				                       |	Подразделение";
				
				ЗапросНеУД.УстановитьПараметр("Ссылка",Объект.Ссылка);
				РезультатНеУд = ЗапросНеУД.Выполнить(); 
				ВыборкаНеУдПодр = РезультатНеУд.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение"); 
				Пока ВыборкаНеУдПодр.Следующий() Цикл
					//БизТех Аляль 29.05.2024г. Надо брать сумму АВПОАкту   <<
					//СоздатьДокОказанияУслуг_БТ(ВыборкаНеУдПодр.Брутто,ВыборкаНеУдПодр.Подразделение);
					СоздатьДокОказанияУслуг_БТ(ВыборкаНеУдПодр.АВПоАкту,ВыборкаНеУдПодр.Подразделение);
					//БизТех Аляль >>
				КонецЦикла;	

				//Отбор = Новый Структура("Удержание",Ложь);
				//Строки = Объект.РабочиеЛисты.НайтиСтроки(Отбор);
				//СуммаБрутто = 0;
				//Если Строки.Количество() тогда
				//	Для Каждого Строка из Строки Цикл
				//		СуммаБрутто = СуммаБрутто + Строка.Брутто;	
				//	КонецЦикла;
				//	СоздатьДокОказанияУслуг(СуммаБрутто);
				//	//Реализовано через обработку СформироватьЗаявкуНаРасходДСПоАктамСверкиКСО
				//	//СоздатьЗаявкуНаРасходДС(СуммаБрутто); 
				//КонецЕсли;
			ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.АктСверкиКредитный_ПоРетроБонусу 
							или Объект.ХозОперация = Справочники.ХозОперации.АктСверкиСтраховой_ПоРетроБонусу тогда
				СуммаБонусов = 0;
				Строки = Объект.РабочиеЛисты;
				Если Строки.Количество() тогда
					Для Каждого Строка из Строки Цикл
						СуммаБонусов = СуммаБонусов + Строка.АВПоАкту;	
					КонецЦикла;
					СоздатьДокОказанияУслуг(СуммаБонусов);
				КонецЕсли;
							
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	ОбновитьДоступностьФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьФормы()

	Если Объект.Проведен тогда
		//ЭтаФорма.Доступность = Ложь;
		ЭтаФорма.ТолькоПросмотр = Истина;
		Предупреждение("Документ только для просмотра, для редактирования распроведите этот документ",,"Внимание"); 
	Иначе
		ЭтаФорма.Доступность = Истина;		
	КонецЕсли;
	
КонецПроцедуры // ОбновитьДоступность()

&НаКлиенте
Функция ЕстьОдобренные()
	
	Если Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиКредитный_ПоРетроБонусу"
			или Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиСтраховой_ПоРетроБонусу" тогда
		Возврат Истина;		
	КонецЕсли;
		
	Отбор = Новый Структура("Проверено",Истина);
	Есть = Объект.РабочиеЛисты.НайтиСтроки(Отбор);
	
	Если Есть.Количество() тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ЕстьОдобренные()

&НаСервере
Функция НайтиДокументы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РеализацияТоваров.Ссылка КАК Ссылка,
		|	ЗаявкаНаРасходДС.Ссылка КАК Ссылка1
		|ИЗ
		|	Документ.РеализацияТоваров КАК РеализацияТоваров,
		|	Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|ГДЕ
		|	РеализацияТоваров.ДокументОснование = &ДокументОснование
		|	И ЗаявкаНаРасходДС.ДокументОснование = &ДокументОснование
		|	И РеализацияТоваров.Проведен = ИСТИНА
		|	И ЗаявкаНаРасходДС.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // НайтиДокументы()

&НаКлиенте
Процедура СоздатьДокОказанияУслуг(СуммаУслуг)

	Форма = ПолучитьФорму("Документ.РеализацияТоваров.ФормаОбъекта");
	ДанныеФормы = Форма.ЭтотОбъект;
	ДанныеФормы.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;
	ДанныеФормы.Дата = ТекущаяДата();
	ДанныеФормы.Автор = ПараметрыСеанса.Пользователь;
	ДанныеФормы.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	ДанныеФормы.Организация = Объект.Организация;
	ДанныеФормы.ПодразделениеКомпании = Объект.ПодразделенияКомпании;
	ДанныеФормы.РегламентированныйУчет = Истина;
	ДанныеФормы.Комментарий = "Документ создан автоматически на основании " + Строка(Объект.Ссылка);
	ДанныеФормы.Контрагент = Объект.Контрагент;
	ДанныеФормы.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов;
	ДанныеФормы.ВалютаДокумента = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.КурсВалютыВзаиморасчетов = ПолучитьКурс(ДанныеФормы.ВалютаДокумента);
	ДанныеФормы.ДокументОснование = Объект.Ссылка;
	ДанныеФормы.ТипЦен = Объект.ДоговорВзаиморасчетов.ТипЦенПродажи;
	ДанныеФормы.СуммаДокумента = СуммаУслуг;
	ДанныеФормы.КурсВалютыУпр = ДанныеФормы.КурсВалютыВзаиморасчетов;
	
	НоваяСтрока = ДанныеФормы.Товары.Добавить();
	НоваяСтрока.Номенклатура = Объект.Контрагент.DN_НоменклатураКСО;
	НоваяСтрока.Количество = 1;  
	НоваяСтрока.КоличествоБазовое = 1;
	НоваяСтрока.ЕдиницаИзмерения = Объект.Контрагент.DN_НоменклатураКСО.ОсновнаяЕдиницаИзмерения;
	НоваяСтрока.Коэффициент = 1;
	НоваяСтрока.Цена = СуммаУслуг;
	НоваяСтрока.Сумма = СуммаУслуг;
	НоваяСтрока.СуммаВсего = СуммаУслуг;
	НоваяСтрока.СтатьяДоходов = Объект.Контрагент.DN_СтатьяДоходовКСО;
	
	Форма.Открыть();
		
КонецПроцедуры // СоздатьДокОказанияУслуг()  
&НаКлиенте
Процедура СоздатьДокОказанияУслуг_БТ(СуммаУслуг, Подразделение)

	Форма = ПолучитьФорму("Документ.РеализацияТоваров.ФормаОбъекта");
	ДанныеФормы = Форма.ЭтотОбъект;
	ДанныеФормы.ХозОперация = Справочники.ХозОперации.АктОбОказанииУслуг;
	ДанныеФормы.Дата = ТекущаяДата();
	ДанныеФормы.Автор = ПараметрыСеанса.Пользователь;
	ДанныеФормы.Менеджер = ПараметрыСеанса.Пользователь.Сотрудник;
	ДанныеФормы.Организация = Объект.Организация;
	ДанныеФормы.ПодразделениеКомпании = Подразделение;
	ДанныеФормы.РегламентированныйУчет = Истина;
	ДанныеФормы.Комментарий = "Документ создан автоматически на основании " + Строка(Объект.Ссылка);
	ДанныеФормы.Контрагент = Объект.Контрагент;
	ДанныеФормы.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов;
	ДанныеФормы.ВалютаДокумента = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.КурсВалютыВзаиморасчетов = ПолучитьКурс(ДанныеФормы.ВалютаДокумента);
	ДанныеФормы.ДокументОснование = Объект.Ссылка;
	ДанныеФормы.ТипЦен = Объект.ДоговорВзаиморасчетов.ТипЦенПродажи;
	ДанныеФормы.СуммаДокумента = СуммаУслуг;
	ДанныеФормы.КурсВалютыУпр = ДанныеФормы.КурсВалютыВзаиморасчетов;
	
	НоваяСтрока = ДанныеФормы.Товары.Добавить();
	НоваяСтрока.Номенклатура = Объект.Контрагент.DN_НоменклатураКСО;
	НоваяСтрока.Количество = 1;  
	НоваяСтрока.КоличествоБазовое = 1;
	НоваяСтрока.ЕдиницаИзмерения = Объект.Контрагент.DN_НоменклатураКСО.ОсновнаяЕдиницаИзмерения;
	НоваяСтрока.Коэффициент = 1;
	НоваяСтрока.Цена = СуммаУслуг;
	НоваяСтрока.Сумма = СуммаУслуг;
	НоваяСтрока.СуммаВсего = СуммаУслуг;
	НоваяСтрока.СтатьяДоходов = Объект.Контрагент.DN_СтатьяДоходовКСО;
	
	Форма.Открыть();
		
КонецПроцедуры // СоздатьДокОказанияУслуг()


&НаКлиенте
Процедура СоздатьЗаявкуНаРасходДС(Сумма)

	Форма = ПолучитьФорму("Документ.ЗаявкаНаРасходДС.ФормаОбъекта");
	ДанныеФормы = Форма.ЭтотОбъект;
	ДанныеФормы.ХозОперация = Справочники.ХозОперации.ЗаявкаНаРасходСРС;
	ДанныеФормы.Дата = ТекущаяДата();
	ДанныеФормы.Автор = ПараметрыСеанса.Пользователь;
	ДанныеФормы.ВалютаДокумента = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.ДоговорВзаиморасчетов = Объект.ДоговорВзаиморасчетов;
	ДанныеФормы.ДокументОснование = Объект.Ссылка;
	ДанныеФормы.СтруктурнаяЕдиница = Объект.Организация.ОсновнойБанковскийСчет;
	ДанныеФормы.Контрагент = Объект.Контрагент;
	ДанныеФормы.КурсДокумента = ПолучитьКурс(ДанныеФормы.ВалютаДокумента);
	ДанныеФормы.Назначение = "Согластно " + Строка(Объект.Ссылка);
	ДанныеФормы.Организация = Объект.Организация;
	ДанныеФормы.ПодразделениеКомпании = Объект.ПодразделенияКомпании;
	ДанныеФормы.СтатьяДДС = Объект.Контрагент.DN_СтатьяДДС;
	ДанныеФормы.СуммаДокумента = Сумма;
	ДанныеФормы.КурсВалютыУпр = ДанныеФормы.КурсДокумента; 
	ДанныеФормы.КурсВалютыВзаиморасчетов = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	ДанныеФормы.ДатаСоздания = ТекущаяДата();
	ДанныеФормы.СчетКонтрагента = Объект.Контрагент.ОсновнойБанковскийСчет;
	ДанныеФормы.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
	
	НоваяСтрока = ДанныеФормы.Платежи.Добавить();
	НоваяСтрока.ДатаПлатежа = ТекущаяДата();
	НоваяСтрока.СтатьяРасходов = Объект.Контрагент.DN_СтатьяРасходовКСО;
	НоваяСтрока.Сумма = Сумма;	
	
	Форма.ЭлементыФормы.ДействияФормы.Кнопки.Список.Пометка = Ложь;
	Форма.Открыть();

КонецПроцедуры // СоздатьЗаявкуНаРасходДС()

&НаСервере
Функция ПолучитьКурс(Валюта)
	
	Курс = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, ) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Запрос.УстановитьПараметр("Валюта",Валюта);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Курс = Выборка.Курс;	
	КонецЦикла;
	
	Возврат Курс;
	
КонецФункции //ПолучитьКурс

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ответ = Вопрос("При изменении Организации табличная часть будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
	Если Ответ = КодВозвратаДиалога.Нет тогда
		Возврат;
	КонецЕсли;   
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ответ = Вопрос("При изменении Контрагента табличная часть будет очищена, продолжить?",РежимДиалогаВопрос.ДаНет,,,"Внимание");
	Если Ответ = КодВозвратаДиалога.Нет тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение и НЕ ЕстьОдобренные() тогда
		Отказ = Истина;
		Предупреждение("Данный акт нельзя провести, нет проверенных листов");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВРегистр(Команда)
	Форма = ОткрытьФорму("РегистрСведений.DN_АВ_КредитноСтраховыеСделки.ФормаСписка"); 
	
	ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборВладелец.Использование = Истина;
	ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("АктСверки");
	ОтборВладелец.ПравоеЗначение = Объект.Ссылка;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПодчиненныеДокументы(Команда)
	Дерево=Обработки.ДеревоДокументов.Создать();
	Дерево.ВыбДокумент=Объект.Ссылка;
	Попытка
		Дерево.ПолучитьДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.ВывестиДеревоДокументов(Дерево.ДеревоДокументов);
		Дерево.НастроитьПолеДеревоДокументов();
	Исключение
		Предупреждение("По документу данного вида построение дерева невозможно!",10);
	КонецПопытки;    
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЛистыОтделаСтрахования(Команда)
	Форма = ОткрытьФорму("Документ.РабочийЛистОтделаСтрахования.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура РабочиеЛистыКредитногоОтдела(Команда)
	Форма = ОткрытьФорму("Документ.РабочийЛистКредитногоОтдела.ФормаСписка"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока = Объект.РабочиеЛисты.Добавить();
	НоваяСтрока.Удержание = Истина;
	
	Если Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиКредитный_ПоРетроБонусу" тогда
		НоваяСтрока.Статус = "Ретро бонус Кредитный";	
	ИначеЕсли Объект.ХозОперация.ИмяПредопределенныхДанных = "АктСверкиСтраховой_ПоРетроБонусу" тогда
		НоваяСтрока.Статус = "Ретро бонус Страховой";
	КонецЕсли;
КонецПроцедуры

//БизТех Коваль А.Д. 08.04.2024 ++
&НаКлиенте
Процедура СкорректироватьВзаимозачеты(Команда)
	//Для каждого Лист Из Объект.РабочиеЛисты Цикл
	//	Рабочийлист = Документы.РабочийЛистОтделаСтрахования.НайтиПоНомеру(Лист.НомерРабочегоЛиста);
	//	Если ТипЗнч(Рабочийлист) = Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") И ЗначениеЗаполнено(Рабочийлист.Комитент)
	//		И ЗначениеЗаполнено(Рабочийлист.Страхователь) Тогда
	//		
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = "ВЫБРАТЬ
	//		|	Взаимозачет.Ссылка КАК Ссылка,
	//		|	ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор КАК ДоговорВзаиморасчетовКредитор
	//		|ИЗ
	//		|	Документ.Взаимозачет.Состав КАК ВзаимозачетСостав
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Взаимозачет КАК Взаимозачет
	//		|		ПО ВзаимозачетСостав.Ссылка = Взаимозачет.Ссылка
	//		|ГДЕ
	//		|	Взаимозачет.Дебитор = &Дебитор
	//		|	И Взаимозачет.Кредитор = &Кредитор
	//		|	И ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор = &ДоговорВзаиморасчетовКредитор
	//		|	И Взаимозачет.Проведен = ИСТИНА";
	//		
	//		Запрос.УстановитьПараметр("Дебитор", Рабочийлист.Комитент);
	//		Запрос.УстановитьПараметр("Кредитор", Рабочийлист.Страхователь);
	//		Запрос.УстановитьПараметр("ДоговорВзаиморасчетовКредитор", Рабочийлист.ДоговорКСО);
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		//Если не найден взаимозачет
	//		Если РезультатЗапроса.Выгрузить().Количество() = 0 Тогда
	//		    Сообщить(Строка(Рабочийлист.Ссылка) + " -  не найден Взаимозачет!" );
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		//Если найдено больше 2
	//		Если РезультатЗапроса.Выгрузить().Количество() > 1 Тогда
	//		    Сообщить(Строка(Рабочийлист.Ссылка) + " -  найдено несколько Взаимозачетов:" );
	//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//				Сообщить(Строка(ВыборкаДетальныеЗаписи.Ссылка));
	//			КонецЦикла;
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		КорректируемаяСумма = Лист.АВПоАкту;
	//		АгентскийДоговор = Объект.ДоговорВзаиморасчетов;
	//		ВнесенаКорректировка = Ложь;
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			Если НЕ СтрНайти(ВыборкаДетальныеЗаписи.Ссылка.Комментарий,"Заполнен автоматически") = 0 Тогда 
	//				Если НЕ ВыборкаДетальныеЗаписи.Ссылка.СуммаКомиссии = КорректируемаяСумма Тогда
	//					ДокументОбъект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//					ДокументОбъект.СуммаКомиссии=КорректируемаяСумма;
	//					ДокументОбъект.АгентскийДоговор=АгентскийДоговор;
	//					ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + " Скорректирована сумма автоматически "+ Формат(ТекущаяДата(), "ДФ = 'дд.ММ.гггг ЧЧ:мм:сс'"); 
	//					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//					Сообщить(Строка(Рабочийлист.Ссылка) + ", " + Строка(ВыборкаДетальныеЗаписи.Ссылка)+ " - скорректирован успешно" );
	//					ВнесенаКорректировка = Истина;	
	//				КонецЕсли;
	//			Иначе
	//				Сообщить(Строка(Рабочийлист.Ссылка) + ", " + Строка(ВыборкаДетальныеЗаписи.Ссылка) +" - Не найден Взаимозачет заполненный автоматически. Корректировка сумм не выполнена!");
	//			КонецЕсли;
	//		КонецЦикла;
	//		
			
			
			//СуммаВзаимозачетов = 0;
			//ТребуемаяСуммаВзаимозачетов = Лист.Нетто; 
			
			//Взаимозачеты = Новый Массив;
			
			//Получаем сумму и массив взаимозачетов
			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	Если НЕ СтрНайти(ВыборкаДетальныеЗаписи.Ссылка.Комментарий,"Заполнен автоматически") = 0 Тогда
			//		СуммаВзаимозачетов = СуммаВзаимозачетов + ВыборкаДетальныеЗаписи.Ссылка.Состав[0].Сумма;
			//		Взаимозачеты.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			//	Иначе
			//		Сообщить(Строка(Рабочийлист.Ссылка) + ", " + Строка(ВыборкаДетальныеЗаписи.Ссылка) +" - Не найден Взаимозачет заполненный автоматически. Корректировка сумм не выполнена!");
			//	КонецЕсли;
			//КонецЦикла;
			
			//Если суммы сходятся то корректировка не требуется
			//Если ТребуемаяСуммаВзаимозачетов = СуммаВзаимозачетов  Тогда
			//	//Сообщить(Строка(Рабочийлист.Ссылка) + " - корректировка не требуется");
			//	Продолжить;
			////Иначе вносим корректировку
			//ИначеЕсли СуммаВзаимозачетов < КорректируемаяСумма Тогда
			//	Сообщить(Строка(Рабочийлист.Ссылка) +" - Взаимозачеты не скорректированы! Суммы взаимозачетов не хватает для корректировки!");
			//	Продолжить;
			//Иначе
			//	Для каждого Взаимозачет Из Взаимозачеты Цикл
			//		//Если нашли взаимозачет который можно скорректировать
			//		Если Взаимозачет.Ссылка.Состав[0].Сумма > КорректируемаяСумма И ВнесенаКорректировка = Ложь Тогда
			//			ДокументОбъект=Взаимозачет.Ссылка.ПолучитьОбъект();
			//			ДокументОбъект.Состав[0].Сумма=ДокументОбъект.Состав[0].Сумма - КорректируемаяСумма;
			//			ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + " Скорректирована сумма автоматически "+ Формат(ТекущаяДата(), "ДФ = 'дд.ММ.гггг ЧЧ:мм:сс'"); 
			//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			//			Сообщить(Строка(Рабочийлист.Ссылка) + ", " + Строка(Взаимозачет.Ссылка)+ " - скорректирован успешно" );
			//			ВнесенаКорректировка = Истина;
			//			Прервать;		
			//		КонецЕсли;
			//	КонецЦикла;
			//	//Если корректировки не произошло по одному из взаимозачетов то тогда нужно произвести корректировку суммарно по всем взаимозачетам
			//	Если ВнесенаКорректировка = Ложь Тогда
			//		Сообщить(Строка(Рабочийлист.Ссылка) + " - не удалось автоматически скорректировать сумму Взаимозачета!" );	
			//    КонецЕсли;
			//КонецЕсли;
			
			
			
	//
	//    КонецЕсли;
	//КонецЦикла;  
	
	//БизТех Аляль 27.05.2024г. <<  
	Если Объект.РабочиеЛисты.Количество() = 0 или НЕ Объект.Проведен или НЕ Объект.БТ_СУдержанием Тогда
		Сообщить ("Не найдены данные для заполнения документа Взаимозачет!");
		Возврат;
	КонецЕсли;
	
	//Проверим существует ли уже документ  
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	Взаимозачет.Ссылка КАК Ссылка
	//               |ИЗ
	//               |	Документ.Взаимозачет КАК Взаимозачет
	//               |ГДЕ
	//               |	Взаимозачет.ДокументОснование = &ДокументОснование
	//               |	И Взаимозачет.Комментарий ПОДОБНО &Комментарий
	//               |	И Взаимозачет.Проведен";
	//Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	//Запрос.УстановитьПараметр("Комментарий", "Создан автоматически на основании Акта сверки КСО "+Объект.Номер+"%");
	//Результат = Запрос.Выполнить().Выгрузить();
	//Если Не Результат.Количество()=0 Тогда
	//	Сообщить("Ранее был создан документ " + Результат[0].Ссылка);
	//	Ответ = Вопрос("Ранее был создан документ " + Результат[0].Ссылка + ". Перезаполнить его?", РежимДиалогаВопрос.ДаНетОтмена,0);  
	//	Если Ответ = КодВозвратаДиалога.Да Тогда
	//		Док = Результат[0].Ссылка; 
	//		НовДокВзаимозачет = Док.ПолучитьОбъект();
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//Иначе
	//	НовДокВзаимозачет = Документы.Взаимозачет.СоздатьДокумент();   
	//КонецЕсли;
	////Создаем новый док Взаимозачет   
	////Если НЕ Объект.РабочиеЛисты.Количество() = 0 Тогда
	////	НовДокВзаимозачет = Документы.Взаимозачет.СоздатьДокумент();
	//	НовДокВзаимозачет.Дата = Объект.Дата; 
	//	НовДокВзаимозачет.ХозОперация = Справочники.ХозОперации.Взаимозачет;
	//	НовДокВзаимозачет.Организация = Объект.Организация; 
	//	Если ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
	//		НовДокВзаимозачет.ПодразделениеКомпании = Объект.ПодразделенияКомпании; 
	//	Иначе     
	//		НовДокВзаимозачет.ПодразделениеКомпании = Объект.РабочиеЛисты[0].Подразделение;
	//	КонецЕсли;
	//	НовДокВзаимозачет.Автор = ПараметрыСеанса.Пользователь;
	//	НовДокВзаимозачет.ДокументОснование = Объект.Ссылка;
	//	НовДокВзаимозачет.Дебитор = Объект.Контрагент;
	//	НовДокВзаимозачет.Кредитор = Объект.Контрагент; 
	//	НовДокВзаимозачет.ВалютаДокумента = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
	//	НовДокВзаимозачет.Комментарий = "Создан автоматически на основании Акта сверки КСО "+Объект.Номер +" " + ТекущаяДата();  
	//	НовДокВзаимозачет.УстановитьНовыйНомер();  
	//	Если НовДокВзаимозачет.Состав.Количество()>0 Тогда
	//		НовДокВзаимозачет.Состав.Очистить();
	//	КонецЕсли;
	//	НовДокВзаимозачет.Записать();  
	//	//Найдем договор Вознаграждение                
	//	//Если Не ЗначениеЗаполнено(Объект.БТ_ДоговорАгента) Тогда
	//	//	Сообщить ("Не заполнено поле ""Агентский договор (вознагр.)""! В Взаимозачете будет использован Договор взаиморасчетов");
	//	//	ДоговорВознаграждение = Объект.ДоговорВзаиморасчетов;
	//	//Иначе
	//	//	ДоговорВознаграждение = Объект.БТ_ДоговорАгента;
	//	//КонецЕсли; 
	//	//ЗапросДоговор = Новый Запрос;
	//	//ЗапросДоговор.Текст = "ВЫБРАТЬ
	//	//                      |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	//	//                      |ИЗ
	//	//                      |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	//	//                      |ГДЕ
	//	//                      |	ДоговорыВзаиморасчетов.Владелец = &Владелец
	//	//                      |	И ДоговорыВзаиморасчетов.ПризнакАгента = &ПризнакАгента
	//	//                      |	И НЕ ДоговорыВзаиморасчетов.Ссылка = &Ссылка
	//	//                      |	И НЕ ДоговорыВзаиморасчетов.ПометкаУдаления
	//	//                      |	И (НЕ ДоговорыВзаиморасчетов.ДатаКонца < &ДатаКонца ИЛИ ДоговорыВзаиморасчетов.ДатаКонца = ДАТАВРЕМЯ(1, 1, 1))";
	//	//ЗапросДоговор.УстановитьПараметр("Владелец", Объект.Контрагент);
	//	//ЗапросДоговор.УстановитьПараметр("ПризнакАгента", Перечисления.ПризнакиАгента.Агент); 
	//	//ЗапросДоговор.УстановитьПараметр("Ссылка", Объект.ДоговорВзаиморасчетов); 
	//	//ЗапросДоговор.УстановитьПараметр("ДатаКонца", Объект.Дата);
	//	//РезультатДоговор = ЗапросДоговор.Выполнить().Выгрузить();
	//	//Если Не РезультатДоговор.Количество()= 0 Тогда
	//	//	ДоговорВознаграждение = РезультатДоговор[0].Ссылка;
	//	//Иначе
	//	//	Сообщить("Не найден договор вознаграждения!");
	//	//КонецЕсли;
	//	
	//	
	//	Для каждого Строка из Объект.РабочиеЛисты Цикл    
	//		НовСтрокаВзаимозачет = НовДокВзаимозачет.Состав.Добавить();
	//		НовСтрокаВзаимозачет.ДоговорВзаиморасчетовКредитор =  Объект.ДоговорВзаиморасчетов;
	//		Рабочийлист = Документы.РабочийЛистОтделаСтрахования.НайтиПоНомеру(Строка.НомерРабочегоЛиста);
	//		Если ТипЗнч(Рабочийлист) = Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") И ЗначениеЗаполнено(Рабочийлист.Страхователь) Тогда 
	//			Запрос = Новый Запрос;
	//			Запрос.Текст = "ВЫБРАТЬ
	//			               |	Взаимозачет.Ссылка КАК Ссылка,
	//			               |	ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор КАК ДоговорВзаиморасчетовКредитор,
	//			               |	ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК ДоговорВзаиморасчетовДебитор
	//			               |ИЗ
	//			               |	Документ.Взаимозачет.Состав КАК ВзаимозачетСостав
	//			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Взаимозачет КАК Взаимозачет
	//			               |		ПО ВзаимозачетСостав.Ссылка = Взаимозачет.Ссылка
	//			               |ГДЕ
	//			               |	Взаимозачет.Дебитор = &Дебитор
	//			               |	И Взаимозачет.Кредитор = &Кредитор
	//			               |	И ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор = &ДоговорВзаиморасчетовКредитор
	//			               |	И Взаимозачет.Проведен = ИСТИНА";
	//			
	//			Запрос.УстановитьПараметр("Дебитор", Рабочийлист.Комитент);
	//			Запрос.УстановитьПараметр("Кредитор", Рабочийлист.Страхователь);
	//			Запрос.УстановитьПараметр("ДоговорВзаиморасчетовКредитор", Рабочийлист.ДоговорКСО);
	//			РезультатЗапроса = Запрос.Выполнить();
	//			
	//			//Если не найден взаимозачет
	//			Если РезультатЗапроса.Выгрузить().Количество() = 0 Тогда
	//			    Сообщить(Строка(Рабочийлист.Ссылка) + " -  не найден Взаимозачет!" );
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			//Если найдено больше 2
	//			Если РезультатЗапроса.Выгрузить().Количество() > 1 Тогда
	//			    Сообщить(Строка(Рабочийлист.Ссылка) + " -  найдено несколько Взаимозачетов:" );
	//				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//					Сообщить(Строка(ВыборкаДетальныеЗаписи.Ссылка));
	//				КонецЦикла;
	//				Продолжить;
	//			КонецЕсли;
	//			
	//			НовСтрокаВзаимозачет.ДоговорВзаиморасчетовДебитор = Запрос.Выполнить().выгрузить()[0].ДоговорВзаиморасчетовДебитор;
	//			НовСтрокаВзаимозачет.СделкаДебитор = Запрос.Выполнить().выгрузить()[0].Ссылка;
	//			НовСтрокаВзаимозачет.Сумма = Строка.АВПоАкту;
	//			
	//			
	//	    КонецЕсли;
	//	КонецЦикла;		
	//	НовДокВзаимозачет.Записать();  
	//	Попытка
	//		НовДокВзаимозачет.Записать(РежимЗаписиДокумента.Проведение);
	//		#Если Клиент Тогда
	//		Сообщить(НСтр("ru = 'Сформирован документ '") + Строка(НовДокВзаимозачет.Ссылка) + ".");
	//		#КонецЕсли
	//	Исключение  
	//		НовДокВзаимозачет.Записать(РежимЗаписиДокумента.Запись);
	//		ИнформацияОбОшибке = ИнформацияОбОшибке();
	//		Сообщить(ИнформацияОбОшибке.Описание +"|"+ ИнформацияОбОшибке.Причина);
	//	КонецПопытки;   
	//	ФормаВзамозачет = НовДокВзаимозачет.ПолучитьФорму("ФормаДокумента"); 
	//	ФормаВзамозачет.Открыть();
	//	//Аляль 27.05.2024г. << 
	//Аляль 29.09.2025г. <<

	//Проверим существует ли уже документ  
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	Взаимозачет.Ссылка КАК Ссылка
			               |ИЗ
			               |	Документ.Взаимозачет КАК Взаимозачет
			               |ГДЕ
			               |	Взаимозачет.ДокументОснование = &ДокументОснование
			               |	И Взаимозачет.Комментарий ПОДОБНО &Комментарий
			               |	И Взаимозачет.Проведен";
			Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
			Запрос.УстановитьПараметр("Комментарий", "Создан автоматически на основании Акта сверки КСО "+Объект.Номер+"%");
			Результат = Запрос.Выполнить().Выгрузить();
			Если Не Результат.Количество()=0 Тогда
				Сообщить("Ранее был создан документ " + Результат[0].Ссылка);
				Ответ = Вопрос("Ранее был создан документ " + Результат[0].Ссылка + ". Перезаполнить его?", РежимДиалогаВопрос.ДаНетОтмена,0);  
				Если Ответ = КодВозвратаДиалога.Да Тогда
					Док = Результат[0].Ссылка; 
					НовДокВзаимозачет = Док.ПолучитьОбъект();
				Иначе
					Возврат;
				КонецЕсли;
			Иначе
				НовДокВзаимозачет = Документы.Взаимозачет.СоздатьДокумент();  
				НовДокВзаимозачет.Дата = КонецДня(Объект.Дата); 
				НовДокВзаимозачет.ХозОперация = Справочники.ХозОперации.Взаимозачет;
				НовДокВзаимозачет.Организация = Объект.Организация; 
				Если ЗначениеЗаполнено(Объект.ПодразделенияКомпании) тогда
					НовДокВзаимозачет.ПодразделениеКомпании = Объект.ПодразделенияКомпании; 
				Иначе     
					НовДокВзаимозачет.ПодразделениеКомпании = Объект.РабочиеЛисты[0].Подразделение;
				КонецЕсли;
	            НовДокВзаимозачет.УстановитьНовыйНомер();  
			КонецЕсли; 
			НовДокВзаимозачет.Автор = ПараметрыСеанса.Пользователь;
			НовДокВзаимозачет.ДокументОснование = Объект.Ссылка;
			НовДокВзаимозачет.Дебитор = Объект.Контрагент;
			НовДокВзаимозачет.Кредитор = Объект.Контрагент; 
			НовДокВзаимозачет.ВалютаДокумента = Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
			НовДокВзаимозачет.Комментарий = "Создан автоматически на основании Акта сверки КСО "+Объект.Номер +" " + ТекущаяДата();  
			//НовДокВзаимозачет.УстановитьНовыйНомер();  
			Если НовДокВзаимозачет.Состав.Количество()>0 Тогда
				НовДокВзаимозачет.Состав.Очистить();
			КонецЕсли;
           	СделкаКредитор = Неопределено;

	Для каждого Строка из Объект.РабочиеЛисты Цикл
		Если Строка.СуммаОплат >0 и Строка.АВПоАкту>0 Тогда
			НовСтрокаВзаимозачет = НовДокВзаимозачет.Состав.Добавить();
			НовСтрокаВзаимозачет.ДоговорВзаиморасчетовКредитор =  Объект.ДоговорВзаиморасчетов;
			Рабочийлист = Документы.РабочийЛистОтделаСтрахования.НайтиПоНомеру(Строка.НомерРабочегоЛиста);
			Если ТипЗнч(Рабочийлист) = Тип("ДокументСсылка.РабочийЛистОтделаСтрахования") И ЗначениеЗаполнено(Рабочийлист.Страхователь) Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	Взаимозачет.Ссылка КАК Ссылка,
				               |	ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор КАК ДоговорВзаиморасчетовКредитор,
				               |	ВзаимозачетСостав.ДоговорВзаиморасчетовДебитор КАК ДоговорВзаиморасчетовДебитор
				               |ИЗ
				               |	Документ.Взаимозачет.Состав КАК ВзаимозачетСостав
				               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Взаимозачет КАК Взаимозачет
				               |		ПО ВзаимозачетСостав.Ссылка = Взаимозачет.Ссылка
				               |ГДЕ
				               |	Взаимозачет.Дебитор = &Дебитор
				               |	И Взаимозачет.Кредитор = &Кредитор
				               |	И ВзаимозачетСостав.ДоговорВзаиморасчетовКредитор = &ДоговорВзаиморасчетовКредитор
				               |	И Взаимозачет.Проведен = ИСТИНА";
				
				//Запрос.УстановитьПараметр("Дебитор", Рабочийлист.Комитент); Рабочийлист.ВариантыСтрахования[0].Страховщик
				Запрос.УстановитьПараметр("Дебитор", Рабочийлист.ВариантыСтрахования[0].Страховщик);
				Запрос.УстановитьПараметр("Кредитор", Рабочийлист.Страхователь);
				Запрос.УстановитьПараметр("ДоговорВзаиморасчетовКредитор", Рабочийлист.ДоговорКСО);
				РезультатЗапроса = Запрос.Выполнить();
				
				//Если не найден взаимозачет
				Если РезультатЗапроса.Выгрузить().Количество() = 0 Тогда
				    Сообщить(Строка(Рабочийлист.Ссылка) + " -  не найден Взаимозачет!" );
					Продолжить;
				КонецЕсли;
				
				//Если найдено больше 2
				Если РезультатЗапроса.Выгрузить().Количество() > 1 Тогда
				    Сообщить(Строка(Рабочийлист.Ссылка) + " -  найдено несколько Взаимозачетов:" );
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Сообщить(Строка(ВыборкаДетальныеЗаписи.Ссылка));
						Если ВыборкаДетальныеЗаписи.Ссылка.СуммаДокумента >= Строка.АВПоАкту Тогда  
							СделкаКредитор = ВыборкаДетальныеЗаписи.Ссылка;
						КонецЕсли;
					КонецЦикла; 
					//Продолжить;
				КонецЕсли;
				
				Если СделкаКредитор = Неопределено Тогда
					НовСтрокаВзаимозачет.ДоговорВзаиморасчетовДебитор = Запрос.Выполнить().выгрузить()[0].ДоговорВзаиморасчетовДебитор;
					НовСтрокаВзаимозачет.СделкаКредитор = Запрос.Выполнить().выгрузить()[0].Ссылка;  
				Иначе
					НовСтрокаВзаимозачет.ДоговорВзаиморасчетовДебитор = СделкаКредитор.Состав[0].ДоговорВзаиморасчетовДебитор;
					НовСтрокаВзаимозачет.СделкаКредитор = СделкаКредитор; 
					СделкаКредитор = Неопределено;
				КОнецЕсли;
				НовСтрокаВзаимозачет.Сумма = Строка.АВПоАкту;  
				ЗапросРеализация = Новый Запрос;
				ЗапросРеализация.Текст = "ВЫБРАТЬ
				               |	РеализацияТоваров.Ссылка КАК Ссылка
				               |ИЗ
				               |	Документ.РеализацияТоваров КАК РеализацияТоваров
				               |ГДЕ
				               |	РеализацияТоваров.ДокументОснование = &ДокументОснование
				               |	И РеализацияТоваров.Проведен
				               |	И РеализацияТоваров.ПодразделениеКомпании = &ПодразделениеКомпании";
				ЗапросРеализация.УстановитьПараметр("ДокументОснование",  Объект.Ссылка); 
				ЗапросРеализация.УстановитьПараметр("ПодразделениеКомпании", Строка.Подразделение);
				РезультатРеализация = ЗапросРеализация.Выполнить().Выгрузить(); 
				Если РезультатРеализация.Количество()>0 Тогда
					НовСтрокаВзаимозачет.СделкаДебитор = РезультатРеализация[0].Ссылка;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;
		КонецЦикла;
		НовДокВзаимозачет.Записать();  
		Попытка
			НовДокВзаимозачет.Записать(РежимЗаписиДокумента.Проведение);
			#Если Клиент Тогда
			Сообщить(НСтр("ru = 'Сформирован документ '") + Строка(НовДокВзаимозачет.Ссылка) + ".");
			#КонецЕсли
		Исключение  
			НовДокВзаимозачет.Записать(РежимЗаписиДокумента.Запись);
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Сообщить(ИнформацияОбОшибке.Описание +"|"+ ИнформацияОбОшибке.Причина);
		КонецПопытки;   
		//ФормаВзамозачет = НовДокВзаимозачет.ПолучитьФорму("ФормаДокумента"); 
		//ФормаВзамозачет.Открыть(); 
КонецПроцедуры
//БизТех Коваль А.Д. 08.04.2024 --
