
//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура сохраняет настройки подключения к системе CLON
//
// Параметры:
//	Нет.
//
Процедура ЗаписатьНастройки()
	Константы.сфпCLONServerIP.Установить(НаборКонстант.сфпCLONServerIP);
	Константы.сфпCLONServerPort.Установить(НаборКонстант.сфпCLONServerPort);
	Константы.сфпCLONType.Установить(НаборКонстант.сфпCLONType);
	Константы.сфпCLONServerLogin.Установить(НаборКонстант.сфпCLONServerLogin);
	Константы.сфпCLONServerPassword.Установить(НаборКонстант.сфпCLONServerPassword);
КонецПроцедуры // ЗаписатьНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик команды формы "ЗаписатьНастройкиCLON"
//
Процедура ЗаписатьНастройкиCLON(Команда)
	ЗаписатьНастройки()
КонецПроцедуры // ЗаписатьНастройкиCLON()

&НаКлиенте
// Процедура - обработчик команды формы "ПодключитьCLON"
//
Процедура ПодключитьCLON(Команда)
	ЗаписатьНастройки();
	сфпСофтФонПроКлиент.сфпПодключитьCLON();
	Если НЕ (сфпObjCLON = Неопределено) Тогда
		Закрыть();
	КонецЕсли;	
КонецПроцедуры // ПодключитьCLON()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("сфпУправлениеМаршрутизацией") Тогда Возврат; КонецЕсли;
	Элементы.ФормаКнопкаПодключитьCLON.Доступность = (сфпСофтФонПроСервер.сфпИспользоватьСофтФоны() 
		И сфпСофтФонПроСервер.сфпПолучитьЗначениеНастройкиПользователя("сфпИспользоватьСофтФон"));
КонецПроцедуры // ПриСозданииНаСервере()
