Функция НайтиЗапросом(Организация, Контрагент, ВидДвижения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТТ_НастройкиКлиентБанка.Ссылка,
	|	ТТ_НастройкиКлиентБанка.НазначениеПлатежа,
	|	ТТ_НастройкиКлиентБанка.ПроцентКомиссии,
	|	ТТ_НастройкиКлиентБанка.ДоговорВзаиморасчетов,
	|	ТТ_НастройкиКлиентБанка.СтатьяДДС,
	|	ТТ_НастройкиКлиентБанка.СтатьяДоходовИРасходов,
	|	ТТ_НастройкиКлиентБанка.ЦФОБренд,
	|	ТТ_НастройкиКлиентБанка.ЦФОПодразделение
	|ИЗ
	|	Справочник.ТТ_НастройкиКлиентБанка КАК ТТ_НастройкиКлиентБанка
	|ГДЕ
	|	ТТ_НастройкиКлиентБанка.Организация = &Организация
	|	И ТТ_НастройкиКлиентБанка.Контрагент = &Контрагент
	|	И ТТ_НастройкиКлиентБанка.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФУнкции