
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вставить содержимое обработчика.
	Если Параметры.Свойство("СхемаКомпоновки") Тогда
		ВремСхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(Параметры.СхемаКомпоновки);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ВремСхемаКомпоновкиДанных));
		СхемаКомпоновки = ПоместитьВоВременноеХранилище(ВремСхемаКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкиОтчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользовательскоеПоле(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	СтруктураПараметров.Вставить("НастройкиОтчета", КомпоновщикНастроек.ПолучитьНастройки());
	
	ФормаНастройки = ПолучитьФорму("ОбщаяФорма.ОтчетНовоеПользовательскоеПоле", СтруктураПараметров, ЭтаФорма);
	
	Рез = ФормаНастройки.ОткрытьМодально();
	Если Рез = КодВозвратаДиалога.ОК Тогда
		
		НовоеПоле = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
		НовоеПоле.Использование = Истина;
		НовоеПоле.Заголовок     = ФормаНастройки.ЗаголовокПоля;
		
		НовоеПоле.УстановитьВыражениеДетальныхЗаписей(СокрЛП(ФормаНастройки.ВыражениеДетальныхЗаписей));
		НовоеПоле.УстановитьВыражениеИтоговыхЗаписей(СокрЛП(ФормаНастройки.ВыражениеИтоговыхЗаписей));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элементы.ПользовательскиеПоля.ТекущаяСтрока;
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("СхемаКомпоновки", СхемаКомпоновки);
	СтруктураПараметров.Вставить("НастройкиОтчета", КомпоновщикНастроек.ПолучитьНастройки());
	СтруктураПараметров.Вставить("ТекущаяСтрока",   ТекущаяСтрока);
	//СтруктураПараметров.Вставить("ТекущийЭлемент",  Элемент);
	//
	//Элементы.ПользовательскиеПоля.ТекущаяСтрока
	
	ФормаНастройки = ПолучитьФорму("ОбщаяФорма.ОтчетНовоеПользовательскоеПоле", СтруктураПараметров, ЭтаФорма);
	
	Рез = ФормаНастройки.ОткрытьМодально();
	Если Рез = КодВозвратаДиалога.ОК Тогда
		
		ПользовательскоеПоле = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.ПолучитьОбъектПоИдентификатору(ТекущаяСтрока);
		ПользовательскоеПоле.Заголовок     = ФормаНастройки.ЗаголовокПоля;
		ПользовательскоеПоле.УстановитьВыражениеДетальныхЗаписей(СокрЛП(ФормаНастройки.ВыражениеДетальныхЗаписей));
		ПользовательскоеПоле.УстановитьВыражениеИтоговыхЗаписей(СокрЛП(ФормаНастройки.ВыражениеИтоговыхЗаписей));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскиеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗакрыватьПриВыборе Тогда
		
		Закрыть(КодВозвратаДиалога.ОК);
		
	КонецЕсли;
	
КонецПроцедуры
