
#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("Расчет"      , "Расчет");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти  

Функция НайтиДанныеПоступления(Автомобиль,ТекДокумент) Экспорт 
	
	стр = Новый Структура;
	стр.Вставить("ЦенаПокупки",0);
	стр.Вставить("ДокументПоступленияНаСклад",Документы.ПоступлениеАвтомобилей.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|	ПоступлениеАвтомобилейАвтомобили.Цена КАК Цена
		|ИЗ
		|	Документ.ПоступлениеАвтомобилей.Автомобили КАК ПоступлениеАвтомобилейАвтомобили
		|ГДЕ
		|	ПоступлениеАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И ПоступлениеАвтомобилейАвтомобили.Ссылка.Проведен
		|	И НЕ ПоступлениеАвтомобилейАвтомобили.Ссылка В
		|				(ВЫБРАТЬ
		|					тт_РабочийЛистТрейдИн.ДокументПоступленияНаСклад КАК ДокументПоступленияНаСклад
		|				ИЗ
		|					Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|				ГДЕ
		|					тт_РабочийЛистТрейдИн.Ссылка <> &ТекДокумент
		|					И тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
		|					И НЕ тт_РабочийЛистТрейдИн.Ссылка.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТекДокумент", ТекДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр.ЦенаПокупки = ВыборкаДетальныеЗаписи.Цена;
		стр.ДокументПоступленияНаСклад = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат стр;

КонецФункции   

Функция НайтиДанныеРеализации(Автомобиль,ТекДокумент) Экспорт 
	
	стр = Новый Структура;
	стр.Вставить("ЦенаПродажи",0);
	стр.Вставить("ДокументПродажи",Документы.РеализацияАвтомобилей.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
		|	РеализацияАвтомобилейАвтомобили.Цена КАК Цена
		|ИЗ
		|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|ГДЕ
		|	РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
		|	И НЕ РеализацияАвтомобилейАвтомобили.Ссылка В
		|				(ВЫБРАТЬ
		|					тт_РабочийЛистТрейдИн.ДокументПродажи КАК ДокументПродажи
		|				ИЗ
		|					Документ.тт_РабочийЛистТрейдИн КАК тт_РабочийЛистТрейдИн
		|				ГДЕ
		|					тт_РабочийЛистТрейдИн.Ссылка <> &ТекДокумент
		|					И тт_РабочийЛистТрейдИн.Автомобиль = &Автомобиль
		|					И НЕ тт_РабочийЛистТрейдИн.Ссылка.ПометкаУдаления)
		|	И РеализацияАвтомобилейАвтомобили.Ссылка.Дата >= &ДатаПокупки";
	
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("ТекДокумент", ТекДокумент);
	
	Если ЗначениеЗаполнено(ТекДокумент.ДокументПоступленияНаСклад) Тогда
		Запрос.УстановитьПараметр("ДатаПокупки", ТекДокумент.ДокументПоступленияНаСклад.Дата); 
	Иначе
		Запрос.УстановитьПараметр("ДатаПокупки", ТекДокумент.Дата); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		стр.ЦенаПродажи = ВыборкаДетальныеЗаписи.Цена;
		стр.ДокументПродажи = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат стр;

КонецФункции

