// Делает запись в регистр "Коды маркировки для печати" кодов маркировки с криптохвостами.
//
// Параметры:
//  Ссылка - ДокументСсылка.ЗаказКодовМаркировки - документ заказа кодов маркировки;
//  КодыМаркировки - ТаблицаЗначений - таблица, содержащая информацию о кодах маркировки:
//    * Номенклатура - СправочникСсылка.Номенклатура - номенклатура;
//    * ХарактеристикаНоменклатуры - СправочникСсылка.ХарактеристикаНоменклатуры - характеристика номенклатуры;
//    * КодМаркировки - Строка - полученный полный код маркировки.
//
Процедура ДобавитьЗаписиВРегистр(Ссылка, КодыМаркировки) Экспорт
		
	НаборЗаписей = РегистрыСведений.КодыМаркировкиДляПечати.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументОснование.Установить(Ссылка);
	
	НаборЗаписей.Прочитать();
	ТаблицаНабора = НаборЗаписей.Выгрузить();
	
	ОбъектШтрихКоды = Обработки.ШтрихКоды.Создать();
	СимволГруппировки = ОбъектШтрихКоды.РазделительGS1();
	СимволЭкранирования = ОбъектШтрихКоды.ЭкранированныйСимволGS1();
	
	Для Каждого Строка Из КодыМаркировки Цикл
		
		ТекущийКодМаркировки = Строка.КодМаркировки;
		ТекущийКодМаркировки = СтрЗаменить(ТекущийКодМаркировки, СимволГруппировки, СимволЭкранирования);
		
		// Проверим, что ранее не было записи с таким кодом маркировки
		Если ТаблицаНабора.Найти(ТекущийКодМаркировки, "КодМаркировки") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНабора.Добавить();
		НоваяСтрока.ДокументОснование = Ссылка;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура, ХарактеристикаНоменклатуры");
		НоваяСтрока.КодМаркировки = ТекущийКодМаркировки;
		НоваяСтрока.ДатаПечати = Дата("00010101000000");
		
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТаблицаНабора);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СостоянияКодовМаркировки.Период КАК Период,
	               |	СостоянияКодовМаркировки.ДокументОснование КАК ДокументОснование,
	               |	СостоянияКодовМаркировки.Организация КАК Организация,
	               |	СостоянияКодовМаркировки.Номенклатура КАК Номенклатура,
	               |	СостоянияКодовМаркировки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	СостоянияКодовМаркировки.GTIN КАК GTIN,
	               |	СостоянияКодовМаркировки.СерийныйНомер КАК СерийныйНомер,
	               |	СостоянияКодовМаркировки.Состояние КАК Состояние,
	               |	СостоянияКодовМаркировки.УдалитьДатаПечати КАК ДатаПечати,
	               |	СостоянияКодовМаркировки.КодМаркировки КАК КодМаркировки
	               |ИЗ
	               |	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	               |ГДЕ
	               |	СостоянияКодовМаркировки.ДокументОснование ССЫЛКА Документ.ЗаказКодовМаркировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	Пока Выборка.Следующий() Цикл
		КодМаркировки = Выборка.КодМаркировки;
		СтруктураМаркировки = ОбъектШК.РазобратьСтрокуШтрихкодаGS1(КодМаркировки, Истина, Истина);
		
		Если НЕ СтруктураМаркировки.Разобран Тогда Продолжить; КонецЕсли;
		
		Если СтруктураМаркировки.ДанныеШтрихКода.Получить("92") <> Неопределено
			ИЛИ СтруктураМаркировки.ДанныеШтрихКода.Получить("91") <> Неопределено Тогда
			
			// есть криптохвост
			// Запишем как есть в регистр КодыМаркировкиДляПечати
			Запись = РегистрыСведений.КодыМаркировкиДляПечати.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Попытка
				Запись.Записать();
			Исключение
			КонецПопытки;
			
			// уберем криптохвост
			Запись = РегистрыСведений.СостоянияКодовМаркировки.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка, , "КодМаркировки");
			Запись.КодМаркировки = КодМаркировки;
			Попытка
				Запись.Записать(Истина);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Уберем все хвосты кодов маркировки из регистра "Состояния кодов маркировки"
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СостоянияКодовМаркировки.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			ОбъектШК.РазобратьСтрокуШтрихкодаGS1(Запись.КодМаркировки, Истина, Истина);
		КонецЦикла;
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры