перем УчитываетОтработанноеВремя;

Процедура ЗаполнитьДокумент(ЭтаФорма=неопределено) Экспорт 
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	БылоУтв = ФОТ.Выгрузить();
	БылоРасшифровка=Детализация.Выгрузить();
	БылоПФ=РезультатыРасчета.Выгрузить();
	
	ФОТ.Очистить();
	Детализация.Очистить();
	РезультатыРасчета.Очистить();
	ДетализацияВыработки.Очистить();
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Должность КАК Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И Сотрудники.Подразделение = &Подразделение
	|	И (НЕ Сотрудники.ДатаУвольнения < &Период
	|			ИЛИ Сотрудники.ДатаУвольнения = &Пусто)
	|	И Сотрудники.ДатаПриема < &ДатаПриема
	|	И Сотрудники.ДатаПриема <> &Пусто
	|	И (Сотрудники.Подразделение = &ПодразделениеК
	|			ИЛИ Сотрудники.Подразделение = &Пустое
	|				И &Осн)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование");
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Период", НачПериода);
	Запрос.УстановитьПараметр("ДатаПриема", КонПериода);
	Запрос.УстановитьПараметр("Пусто", Дата("01.01.01 00:00:00"));
	Запрос.УстановитьПараметр("ПодразделениеК", ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Пустое",Справочники.ПодразделенияКомпании.ПустаяСсылка());
	Запрос.УстановитьПараметр("Осн",ПодразделениеКомпании=Справочники.ПодразделенияКомпании.ОсновноеПодразделение);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		
		НС=БылоУтв.НайтиСтроки(Новый Структура("Сотрудник",Выб.Сотрудник));
		
		Если НС.Количество() = 0 Тогда
			Нов=ФОТ.Добавить();
			Нов.Сотрудник=Выб.Сотрудник;
			Нов.Должность=Выб.Сотрудник.Должность;
			Ур="";
			КоэфВыр=0;
		Иначе
			Нов=ФОТ.Добавить();
			// ЗаполнитьЗначенияСвойств(Нов,НС);
			Нов.Сотрудник=НС[0].Сотрудник;
			Нов.Должность=НС[0].Должность;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Выб=Неопределено;
	ЗаполнитьФонды();
	ЗаполнитьKPI();	
	
	//Попытка
	//	Если ЭтаФорма<>неопределено Тогда
	//		Элементы.ФОТ.ТекущиеДанные=Элементы.ФОТ[0];
	//		ФОТПриАктивизацииСтроки(Элементы.ФОТ);
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьФонды(ТекСотрудник=Неопределено) Экспорт
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	Если ТекСотрудник=Неопределено Тогда
		РезультатыРасчета.Очистить();
		
		Для Каждого ТекСтр из ФОТ Цикл 
			
			ЗаполнитьПоСН=Ложь;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность КАК Должность,
			|	СоставKPI.KPI КАК KPI,
			|	СоставKPI.Вес КАК Вес,
			|	СоставKPI.Период КАК Период
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И СоставKPI.Категория = &Категория
			|	И СоставKPI.Периодичность = &Периодичность
			|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
			|	И СоставKPI.Регистратор.ПодразделениеКомпании = &Подразделение     
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.БазоваяЧасть,
			|	0,
			|	ЦелевыеПоказатели.Период
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|	И ЦелевыеПоказатели.Регистратор.ПодразделениеКомпании = &Подразделение         
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);        
			
			Выб=Запрос.Выполнить().Выбрать();
			
			НеСот=ложь;
			
			Если Выб.Количество()=0 Тогда
				
				НеСот=истина;
				Запрос.УстановитьПараметр("Должность", ТекСтр.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);    
				
				Выб=Запрос.Выполнить().Выбрать();
				
			КонецЕсли;
			
			ПослПериод=Дата("01.01.01 00:00:00");
			
			Если Выб.Следующий() Тогда
				ПослПериод=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	ЦелевыеПоказатели.Период КАК Период,
			|	ЦелевыеПоказатели.Должность КАК Должность,
			|	ЦелевыеПоказатели.Периодичность КАК Периодичность,
			|	ЦелевыеПоказатели.БазоваяЧасть КАК БазоваяЧасть
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.Период = &Период
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|	И ЦелевыеПоказатели.Регистратор.ПодразделениеКомпании = &Подразделение       
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность",?(НеСот, ТекСтр.Должность, ТекСтр.Сотрудник));
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("Период", ПослПериод);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);              
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Если Выб.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Периодичность);
				Запрос.УстановитьПараметр("Период", ПослПериод);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);     
				
				Выб=Запрос.Выполнить().Выбрать();
				
			КонецЕсли;
			
			Пока Выб.Следующий() Цикл
				
				Нов=РезультатыРасчета.Добавить();
				Нов.Сотрудник=ТекСтр.Сотрудник;
				Нов.ЦелевыеПоказатели=Выб.БазоваяЧасть;
				
				Если ТипЗнч(Выб.БазоваяЧасть)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
					
					Нов.ЗащищеннаяЧасть=Выб.БазоваяЧасть.ОтдельнаяЧасть;
					Нов.ВыгружатьВыработку=Выб.БазоваяЧасть.ВыгружатьПоСдельнымНарядам;
					Нов.ДоляЗащищеннойЧасти=Выб.БазоваяЧасть.ДоляОтдельнойЧасти;
					
					Если Нов.ВыгружатьВыработку Тогда
						ЗаполнитьПоСН=истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Выб=Неопределено;
			Если флВсе Тогда
				
				//остальные с нулевым весом
				Запрос=Новый Запрос("ВЫБРАТЬ
				|	СоставKPI.KPI
				|ИЗ
				|	Документ.СоставKPI.НаборKPI КАК СоставKPI
				|ГДЕ
				|	СоставKPI.Должность = &Должность
				|	И НЕ СоставKPI.KPI В (&БазоваяЧасть)
				|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании");
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Должность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				
				Сп=Новый СписокЗначений;
				МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник", ТекСтр.Сотрудник));
				
				Для Каждого ТекЭл из МС Цикл
					Сп.Добавить(ТекЭл.ЦелевыеПоказатели);
				КонецЦикла;
				
				Запрос.УстановитьПараметр("БазоваяЧасть" ,Сп);
				Выб=Запрос.Выполнить().Выбрать();
				
				Пока выб.Следующий() Цикл
					Нов=РезультатыРасчета.Добавить();
					Нов.ЦелевыеПоказатели=Выб.KPI;
					Нов.ЗащищеннаяЧасть=Выб.KPI.ОтдельнаяЧасть;
					Нов.ВыгружатьВыработку=Выб.KPI.ВыгружатьПоСдельнымНарядам;
					Нов.Сотрудник=ТекСтр.Сотрудник;
					Нов.Неактивно=истина;
					Нов.ДоляЗащищеннойЧасти=Выб.KPI.ДоляОтдельнойЧасти;
				КонецЦикла;
				
				Выб=Неопределено;
				
			КонецЕсли;
			
			Если ЗаполнитьПоСН Тогда
				ЗаполнитьПоСдельнымНарядам(ТекСтр.Сотрудник, НачПериода,КонПериода);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник", ТекСотрудник));
		
		Для Каждого ТекЭл из МС Цикл
			РезультатыРасчета.Удалить(ТекЭл);
		КонецЦикла;
		
		ЗаполнитьПоСН=Ложь;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ЦелевыеПоказатели.Период КАК Период,
		|	ЦелевыеПоказатели.Должность КАК Должность,
		|	ЦелевыеПоказатели.Периодичность КАК Периодичность,
		|	ЦелевыеПоказатели.БазоваяЧасть КАК БазоваяЧасть
		|ИЗ
		|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
		|ГДЕ
		|	ЦелевыеПоказатели.Должность = &Должность
		|	И ЦелевыеПоказатели.Категория = &Категория
		|	И ЦелевыеПоказатели.Периодичность = &Периодичность
		|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И ЦелевыеПоказатели.Регистратор.ПодразделениеКомпании = &Подразделение        
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекСотрудник);
		Запрос.УстановитьПараметр("Категория",ТекСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Периодичность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);        
		
		Выб=Запрос.Выполнить().Выбрать();
		
		ПослПериод=Дата("01.01.01 00:00:00");
		
		Выб=Запрос.Выполнить().Выбрать();
		
		ТекСотЗапрос=ТекСотрудник;
		Если Выб.Следующий() Тогда
			ПослПериод=Выб.Период;
		Иначе
			Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
			ТекСотЗапрос=ТекСотрудник.Должность;
			Выб=Запрос.Выполнить().Выбрать();
			Если Выб.Следующий() Тогда
				ПослПериод=Выб.Период;
			КонецЕсли;
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ЦелевыеПоказатели.Период КАК Период,
		|	ЦелевыеПоказатели.Должность КАК Должность,
		|	ЦелевыеПоказатели.Периодичность КАК Периодичность,
		|	ЦелевыеПоказатели.БазоваяЧасть КАК БазоваяЧасть
		|ИЗ
		|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
		|ГДЕ
		|	ЦелевыеПоказатели.Должность = &Должность
		|	И ЦелевыеПоказатели.Категория = &Категория
		|	И ЦелевыеПоказатели.Периодичность = &Периодичность
		|	И ЦелевыеПоказатели.Период = &Период
		|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И ЦелевыеПоказатели.Регистратор.ПодразделениеКомпании = &Подразделение        
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекСотЗапрос);
		Запрос.УстановитьПараметр("Категория", ТекСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата",КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Периодичность);
		Запрос.УстановитьПараметр("Период", ПослПериод);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);        
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Пока Выб.Следующий() Цикл
			
			Нов=РезультатыРасчета.Добавить();
			Нов.Сотрудник=ТекСотрудник;
			Нов.ЦелевыеПоказатели=Выб.БазоваяЧасть;
			
			Если ТипЗнч(Выб.БазоваяЧасть)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
				
				Нов.ЗащищеннаяЧасть = Выб.БазоваяЧасть.ОтдельнаяЧасть;
				Нов.ВыгружатьВыработку=Выб.БазоваяЧасть.ВыгружатьПоСдельнымНарядам;
				Нов.ДоляЗащищеннойЧасти = Выб.БазоваяЧасть.ДоляОтдельнойЧасти;
				
				Если Нов.ВыгружатьВыработку Тогда
					ЗаполнитьПоСН=истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выб=Неопределено;
		
		Если флВсе Тогда
			
			//остальные с нулевым весом
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.БазоваяЧасть
			|ИЗ
			|	Документ.СоставKPI.ПремиальныйФонд КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И НЕ СоставKPI.БазоваяЧасть В (&БазоваяЧасть)
			|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании");
			
			Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			
			Сп=Новый СписокЗначений;
			
			МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник", ТекСотрудник));
			
			Для Каждого ТекЭл из МС Цикл
				Сп.Добавить(ТекЭл.ЦелевыеПоказатели);
			КонецЦикла;
			
			Запрос.УстановитьПараметр("БазоваяЧасть",Сп);
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока выб.Следующий() Цикл
				
				Нов=РезультатыРасчета.Добавить();
				Нов.ЦелевыеПоказатели=Выб.БазоваяЧасть;
				Нов.ЗащищеннаяЧасть=Выб.БазоваяЧасть.ОтдельнаяЧасть;
				Нов.ВыгружатьВыработку=Выб.БазоваяЧасть.ВыгружатьПоСдельнымНарядам;
				Нов.Сотрудник=ТекСотрудник;
				Нов.Неактивно=истина;
				Нов.ДоляЗащищеннойЧасти=Выб.БазоваяЧасть.ДоляОтдельнойЧасти;
				
			КонецЦикла;
			
			Выб=Неопределено;
			
		КонецЕсли;
		
		Если ЗаполнитьПоСН Тогда
			ЗаполнитьПоСдельнымНарядам(ТекСотрудник,НачПериода,КонПериода);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоСдельнымНарядам(Сотрудник,НачПериода,КонПериода)
	
	ТабРасценок=Новый ТаблицаЗначений;
	ТабРасценок.Колонки.Добавить("ВидРемонта");
	ТабРасценок.Колонки.Добавить("ТипРемонта");
	ТабРасценок.Колонки.Добавить("ВидРабот");
	ТабРасценок.Колонки.Добавить("Цена");
	ТабРасценок.Колонки.Добавить("Подразделение");
	ТабРасценок.Колонки.Добавить("Должность");
	ТабРасценок.Колонки.Добавить("КатегорияРабот");
	
	МС= ДетализацияВыработки.НайтиСтроки(Новый Структура("Сотрудник",Сотрудник));
	
	Для Каждого ТекЭл из МС Цикл
		ДетализацияВыработки.Удалить(ТекЭл);
	КонецЦикла;
	
	ТВ=Новый ТаблицаЗначений;
	ТВ.Колонки.Добавить("Исполнитель");
	ТВ.Колонки.Добавить("Авторабота");
	ТВ.Колонки.Добавить("ВидРемонта");
	//ТВ.Колонки.Добавить("ТипРемонта");
	ТВ.Колонки.Добавить("Подразделение");
	ТВ.Колонки.Добавить("Цех");
	ТВ.Колонки.Добавить("Нормочасы");
	ТВ.Колонки.Добавить("ПроцентИсполнителя");
	ТВ.Колонки.Добавить("ВидРабот");
	ТВ.Колонки.Добавить("Расценка");
	ТВ.Колонки.Добавить("Сумма");
	ТВ.Колонки.Добавить("Должность");
	ТВ.Колонки.Добавить("ЗЧ");
	//ТВ.Колонки.Добавить("КатегорияРаботы");
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	СУММА(ВыработкаСотрудниковОбороты.КоличествоНормочасовОборот) КАК КоличествоНормочасовОборот,
	                    |	ВыработкаСотрудниковОбороты.Работа КАК Работа,
	                    |	ВыработкаСотрудниковОбороты.ВидРемонта КАК ВидРемонта,
	                    |	ВыработкаСотрудниковОбороты.Цех КАК Цех,
	                    |	ВыработкаСотрудниковОбороты.Регистратор.ПодразделениеКомпании КАК Подразделение
	                    |ИЗ
	                    |	РегистрНакопления.ВыработкаСотрудников.Обороты(&НачПериода, &КонПериода, Регистратор, Сотрудник = &Сотрудник) КАК ВыработкаСотрудниковОбороты
	                    |ГДЕ
	                    |	ВыработкаСотрудниковОбороты.Регистратор.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВыработкаСотрудниковОбороты.Работа,
	                    |	ВыработкаСотрудниковОбороты.ВидРемонта,
	                    |	ВыработкаСотрудниковОбороты.Цех,
	                    |	ВыработкаСотрудниковОбороты.Регистратор.ПодразделениеКомпании");
	
	Запрос.УстановитьПараметр("НачПериода",НачПериода);
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	КоэфВыр=0;
	
	КоэфВыр = ПолучитьПроцентПремииВыработки(Сотрудник.Должность,ПодразделениеКомпании, КонПериода);
	
	Ур="";
	
	Пока Выб.Следующий() Цикл
		
		ВидРабот=Выб.Работа;
		
		ЗарплатныйЧас=УзнатьЦенуРемонта(Выб.ВидРемонта,ВидРабот,Выб.Подразделение,Сотрудник.Должность,ТабРасценок,НачПериода,КонПериода);
		
		Если ЗарплатныйЧас=0  Тогда
			
			ЗарплатныйЧас=УзнатьЦенуРемонта(Выб.ВидРемонта,Справочники.Автоработы.ПустаяСсылка(),Выб.Подразделение,Сотрудник.Должность,ТабРасценок,НачПериода,КонПериода);
			
			Если ЗарплатныйЧас=0 Тогда
				ЗарплатныйЧас=УзнатьЦенуРемонта(Выб.ВидРемонта,ВидРабот,Выб.Подразделение,Справочники.Должности.ПустаяСсылка(),ТабРасценок,НачПериода,КонПериода);
				
				Если ЗарплатныйЧас=0 Тогда
					ЗарплатныйЧас=УзнатьЦенуРемонта(Выб.ВидРемонта,ВидРабот,Выб.Подразделение,Неопределено,ТабРасценок,НачПериода,КонПериода);
				КонецЕсли;
				
				Если ЗарплатныйЧас=0 Тогда
					ЗарплатныйЧас=УзнатьЦенуРемонта(Выб.ВидРемонта,Справочники.Автоработы.ПустаяСсылка(),ПодразделениеКомпании,Неопределено,ТабРасценок,НачПериода,КонПериода);
				КонецЕсли;
				
				Если ЗарплатныйЧас=0 Тогда
					Сообщить("Не установлена цена ЗП за нормочас для "+Выб.ВидРемонта+" вид работ "+ВидРабот+" подразделение "+Выб.Подразделение+" должность "+Сотрудник.Должность);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Нов=ТВ.Добавить();
		Нов.Исполнитель=Сотрудник;
		Нов.Авторабота=Выб.Работа;
		Нов.ВидРемонта=Выб.ВидРемонта;
		Нов.Подразделение=Выб.Подразделение;
		Нов.Цех=Выб.Цех;
		Нов.Нормочасы=Выб.КоличествоНормочасовОборот;
		Нов.ПроцентИсполнителя=КоэфВыр;
		Нов.ВидРабот=ВидРабот;
		Нов.ЗЧ=ЗарплатныйЧас;                                                       
		Нов.Расценка=ЗарплатныйЧас*Нов.ПроцентИсполнителя;
		Нов.Сумма=Нов.Расценка*Нов.Нормочасы;
		Нов.Должность=Сотрудник.Должность;
		
	КонецЦикла;
	
	ТВ.Свернуть("ВидРемонта,ЗЧ,ПроцентИсполнителя,ВидРабот,Подразделение,Цех","Нормочасы,Сумма");
	
	Для Каждого ТекСтр из ТВ Цикл
		
		НовСтр=ДетализацияВыработки.Добавить();
		НовСтр.ВидРемонта=ТекСтр.ВидРемонта;
		НовСтр.СтоимостьЗаЧас=ТекСтр.ЗЧ;
		НовСтр.Сотрудник=Сотрудник;
		НовСтр.Должность=Сотрудник.Должность; //при расчете по периодам скорректировать должность от периода
		НовСтр.Коэффициент=ТекСтр.ПроцентИсполнителя;
		НовСтр.Сумма=ТекСтр.Сумма;
		НовСтр.СуммаБезКорректировки=ТекСтр.Сумма;
		НовСтр.Количество=ТекСтр.Нормочасы;
		НовСтр.ВидРабот=ТекСтр.ВидРабот;
		НовСтр.Цех=ТекСтр.Цех;
		НовСтр.Подразделение=ТекСтр.Подразделение;
		
	КонецЦикла;
	
	//РасчетНадбавок(Сотрудник);
	
	МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник,ВыгружатьВыработку",Сотрудник,истина));
	МР=ДетализацияВыработки.НайтиСтроки(Новый Структура("Сотрудник,Должность",Сотрудник,Сотрудник.Должность));
	ТР=ДетализацияВыработки.Выгрузить(МР);
	
	Сч1=0;
	Для Каждого ТекЭл из МС Цикл
		Сч1=сч1+1;
		Если Сч1=1 Тогда
			Если ТекЭл.ЦелевыеПоказатели.ОкруглятьДоЦелых Тогда
				ТекЭл.СуммаЦелевыхПоказателей=Окр(ТР.Итог("Сумма"),0,РежимОкругления.Окр15как10);
				ТекЭл.ИтоговыйРасчет=ТекЭл.СуммаЦелевыхПоказателей;
			Иначе
				ТекЭл.СуммаЦелевыхПоказателей=ТР.Итог("Сумма");
				ТекЭл.ИтоговыйРасчет=ТекЭл.СуммаЦелевыхПоказателей;
			КонецЕсли;
		Иначе
			ТекЭл.СуммаЦелевыхПоказателей=0;
			ТекЭл.ИтоговыйРасчет=0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПроцентПремииВыработки(Должность,Подразделение,КонПериода)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	УстановкаСтоимостиВыработкиСрезПоследних.ПроценПремииОтВыработки КАК ПроценПремииОтВыработки
	|ИЗ
	|	РегистрСведений.УстановкаСтоимостиВыработки.СрезПоследних(
	|			&Дата,
	|			ПодразделениеКомпании = &ПодразделениеКомпании
	|				И (Должность = &Должность
	|					ИЛИ Должность = &ДолжностьПустой)) КАК УстановкаСтоимостиВыработкиСрезПоследних");
	
	
	Запрос.УстановитьПараметр("Дата",КонПериода);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
	Запрос.УстановитьПараметр("Должность",Должность);
	Запрос.УстановитьПараметр("ДолжностьПустой",Справочники.Должности.ПустаяСсылка());
	
	Выбрать =Запрос.Выполнить();
	
	Если НЕ Выбрать.Пустой() Тогда
		
		Результат = Выбрать.Выбрать();
		Результат.Следующий();
		
		Возврат Результат.ПроценПремииОтВыработки;
		
	Иначе
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Функция УзнатьЦенуРемонта(ВидРемонта,ВидРабот, Подразделение,Должность,ТабРасценок,НачПериода,КонПериода)
	
	Если ПустаяСтрока(ВидРабот) ИЛИ ВидРабот = Справочники.Автоработы.ПустаяСсылка() Тогда
		
		Фильтр=Новый Структура("ВидРемонта,ВидРабот,Подразделение,Должность",ВидРемонта,Справочники.Автоработы.ПустаяСсылка(),Подразделение,Должность);
		МС=ТабРасценок.НайтиСтроки(Фильтр);
		Если МС.Количество()>0 Тогда
			Цена=МС[0].Цена;
			Возврат Цена;
		КонецЕсли;
		
		Фильтр=Новый Структура("ВидРемонта,ВидРабот,Подразделение,Должность",ВидРемонта,Справочники.Автоработы.ПустаяСсылка(),Подразделение,Должность);
		МС=ТабРасценок.НайтиСтроки(Фильтр);
		Если МС.Количество()>0 Тогда
			Цена=МС[0].Цена;
			Возврат Цена;
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СУММА(УстановкаСтоимостиВыработкиСрезПоследних.Стоимость) КАК Стоимость,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРемонта КАК ВидРемонта,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРабот КАК ВидРабот,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	РегистрСведений.УстановкаСтоимостиВыработки.СрезПоследних(
		|			&Дата,
		|			ПодразделениеКомпании = &ПодразделениеКомпании
		|				И (ВидРемонта = &ВидРемонта
		|					ИЛИ ВидРемонта = &ПустойВидРемонта)
		|				И (ВидРабот = &ВидРабот
		|					ИЛИ ВидРабот = &ПустойВидРабот)
		|				И (Должность = &Должность ИЛИ Должность = &ДолжностьПустой)) КАК УстановкаСтоимостиВыработкиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРемонта,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРабот,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ПодразделениеКомпании");
		
		
		Запрос.УстановитьПараметр("ВидРабот", ВидРабот);
		Запрос.УстановитьПараметр("ПустойВидРабот",Справочники.Автоработы.ПустаяСсылка());
		Запрос.УстановитьПараметр("Дата",КонПериода);
		Запрос.УстановитьПараметр("ВидРемонта",Видремонта);
		Запрос.УстановитьПараметр("ПустойВидРемонта",Справочники.ВидыРемонта.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
		Запрос.УстановитьПараметр("Должность",Должность);
		Запрос.УстановитьПараметр("ДолжностьПустой",Справочники.Должности.ПустаяСсылка());
		
	Иначе
		
		Фильтр=Новый Структура("ВидРемонта,ВидРабот,Подразделение,Должность",ВидРемонта,ВидРабот,Подразделение,Должность);
		МС=ТабРасценок.НайтиСтроки(Фильтр);
		Если МС.Количество()>0 Тогда
			Цена=МС[0].Цена;
			Возврат Цена;
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СУММА(УстановкаСтоимостиВыработкиСрезПоследних.Стоимость) КАК Стоимость,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРемонта КАК ВидРемонта,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРабот КАК ВидРабот,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	РегистрСведений.УстановкаСтоимостиВыработки.СрезПоследних(
		|			&Дата,
		|			ПодразделениеКомпании = &ПодразделениеКомпании
		|				И ВидРемонта =  &ВидРемонта
		|				И ВидРабот = &ВидРабот И Должность = &Должность) КАК УстановкаСтоимостиВыработкиСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРемонта,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ВидРабот,
		|	УстановкаСтоимостиВыработкиСрезПоследних.ПодразделениеКомпании");
		
		Запрос.УстановитьПараметр("ВидРабот",ВидРабот);
		Запрос.УстановитьПараметр("Дата",КонПериода);
		Запрос.УстановитьПараметр("ВидРемонта",ВидРемонта);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",Подразделение);
		Запрос.УстановитьПараметр("Должность",Должность);
		
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() тогда 
		Запрос.УстановитьПараметр("Должность",Справочники.Должности.ПустаяСсылка());
		Результат = Запрос.Выполнить();
	КонецЕсли;
	
	Выб=Результат.Выбрать();
	ЦенаЗП=0;
	
	Пока Выб.Следующий() Цикл
		ЦенаЗП=Выб.Стоимость;
	КонецЦикла;
	
	НовСтр=ТабРасценок.Добавить();
	НовСтр.ВидРемонта=ВидРемонта;
	НовСтр.ВидРабот=ВидРабот;
	НовСтр.Подразделение=Подразделение;
	НовСтр.Цена=ЦенаЗП;
	НовСтр.Должность=Должность;
	
	Возврат ЦенаЗП;
	
КонецФункции

Процедура ЗаполнитьKPI(ТекСотрудник=Неопределено) Экспорт

	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	Если ТекСотрудник=Неопределено Тогда
		
		Детализация.Очистить();
		
		Для Каждого ТекСтр из ФОТ Цикл 
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность КАК Должность,
			|	СоставKPI.KPI КАК KPI,
			|	СоставKPI.Вес КАК Вес,
			|	СоставKPI.Период КАК Период
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(
			|			&Дата,
			|			Должность = &Должность
			|				И Категория = &Категория
			|				И Периодичность = &Периодичность
			|				И ПодразделениеКомпании = &ПодразделениеКомпании
			|				И Регистратор.ПодразделениеКомпании = &Подразделение) КАК СоставKPI
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.БазоваяЧасть,
			|	0,
			|	ЦелевыеПоказатели.Период
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(
			|			&Дата,
			|			Должность = &Должность
			|				И Категория = &Категория
			|				И Периодичность = &Периодичность
			|				И ПодразделениеКомпании = &ПодразделениеКомпании
			|				И Регистратор.ПодразделениеКомпании = &Подразделение) КАК ЦелевыеПоказатели
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании); 
			
			НеСот=ложь;
			Выб=Запрос.Выполнить().Выбрать();
			
			Если Выб.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				НеСот=Истина;
				
				Выб=Запрос.Выполнить().Выбрать();
				
			КонецЕсли;
			
			ПослПериод=КонПериода;
			
			Если Выб.Следующий() Тогда
				ПослПериод=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность КАК Должность,
			|	СоставKPI.KPI КАК KPI,
			|	СоставKPI.Вес КАК Вес,
			|	СоставKPI.Период КАК Период
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(
			|			&Дата,
			|			Должность = &Должность
			|				И Категория = &Категория
			|				И Периодичность = &Периодичность
			|				И Период = &Период
			|				И ПодразделениеКомпании = &ПодразделениеКомпании
			|				И Регистратор.ПодразделениеКомпании = &Подразделение) КАК СоставKPI
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоставKPI.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность",?(НеСот, ТекСтр.Должность, ТекСтр.Сотрудник));
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("Период", ПослПериод);
			Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);         
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			Пока Выб.Следующий() Цикл
				Нов=Детализация.Добавить();
				Нов.KPI=Выб.KPI;
				Нов.Сотрудник=ТекСтр.Сотрудник;
				Нов.Вес=Выб.Вес;
			КонецЦикла;
			
			ТЗ=Неопределено;
			
			Выб=Неопределено;
			
			Если флВсе Тогда
				
				//остальные с нулевым весом
				Запрос=Новый Запрос("ВЫБРАТЬ
				|	СоставKPI.KPI
				|ИЗ
				|	Документ.СоставKPI.НаборKPI КАК СоставKPI
				|ГДЕ
				|	СоставKPI.Должность = &Должность
				|	И НЕ СоставKPI.KPI В (&KPI)
				|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании");
				
				Запрос.УстановитьПараметр("Должность",ТекСтр.Должность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
				
				Сп=Новый СписокЗначений;
				МС=Детализация.НайтиСтроки(Новый Структура("Сотрудник", ТекСтр.Сотрудник));
				
				Для Каждого ТекЭл из МС Цикл
					Сп.Добавить(ТекЭл.KPI);
				КонецЦикла;
				
				Запрос.УстановитьПараметр("KPI",Сп);
				
				Выб=Запрос.Выполнить().Выбрать();
				
				Пока выб.Следующий() Цикл
					Нов=Детализация.Добавить();
					Нов.KPI=Выб.KPI;
					Нов.Сотрудник=ТекСтр.Сотрудник;
					Нов.Вес=0;
				КонецЦикла;
				
				Выб=Неопределено;
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		МС=Детализация.НайтиСтроки(Новый Структура("Сотрудник",ТекСотрудник));
		
		Для Каждого ТекЭл из МС Цикл
			Детализация.Удалить(ТекЭл);
		КонецЦикла;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность КАК Должность,
		|	СоставKPI.KPI КАК KPI,
		|	СоставKPI.Вес КАК Вес,
		|	СоставKPI.Период КАК Период
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(
		|			&Дата,
		|			Должность = &Должность
		|				И Категория = &Категория
		|				И Периодичность = &Периодичность
		|				И ПодразделениеКомпании = &ПодразделениеКомпании
		|				И Регистратор.ПодразделениеКомпании = &Подразделение) КАК СоставKPI
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦелевыеПоказатели.Должность,
		|	ЦелевыеПоказатели.БазоваяЧасть,
		|	0,
		|	ЦелевыеПоказатели.Период
		|ИЗ
		|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(
		|			&Дата,
		|			Должность = &Должность
		|				И Категория = &Категория
		|				И Периодичность = &Периодичность
		|				И ПодразделениеКомпании = &ПодразделениеКомпании
		|				И Регистратор.ПодразделениеКомпании = &Подразделение) КАК ЦелевыеПоказатели
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Периодичность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании); 
		
		Выб=Запрос.Выполнить().Выбрать();
		
		ПослПериод=КонПериода;
		
		Если Выб.Следующий() Тогда
			ПослПериод=Выб.Период;
		Иначе
			
			Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			
			Выб=Запрос.Выполнить().Выбрать();
			Если Выб.Следующий() Тогда
				ПослПериод=Выб.Период;
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность КАК Должность,
		|	СоставKPI.KPI КАК KPI,
		|	СоставKPI.Вес КАК Вес,
		|	СоставKPI.Период КАК Период
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(
		|			&Дата,
		|			Должность = &Должность
		|				И Категория = &Категория
		|				И Периодичность = &Периодичность
		|				И Период = &Период
		|				И ПодразделениеКомпании = &ПодразделениеКомпании) КАК СоставKPI
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставKPI.Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата",КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Периодичность);
		Запрос.УстановитьПараметр("Период", ПослПериод);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			
		КонецЕсли;
		
		Выб=Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			
			Нов=Детализация.Добавить();
			Нов.KPI=Выб.KPI;
			Нов.Сотрудник=ТекСотрудник;
			Нов.Вес=Выб.Вес;
			
		КонецЦикла;
		
		ТЗ=Неопределено;
		Выб=Неопределено;
		
		Если флВсе Тогда
			
			//остальные с нулевым весом
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.KPI
			|ИЗ
			|	Документ.СоставKPI.НаборKPI КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И НЕ СоставKPI.KPI В (&KPI)
			|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании");
			
			Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
			
			Сп=Новый СписокЗначений;
			МС=Детализация.НайтиСтроки(Новый Структура("Сотрудник", ТекСотрудник));
			
			Для Каждого ТекЭл из МС Цикл
				Сп.Добавить(ТекЭл.KPI);
			КонецЦикла;
			
			Запрос.УстановитьПараметр("KPI",Сп);
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока выб.Следующий() Цикл
				
				Нов=Детализация.Добавить();
				Нов.KPI=Выб.KPI;
				Нов.Сотрудник=ТекСотрудник;
				Нов.Вес=0;
				
			КонецЦикла;
			
			Выб=Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АвторасчетФОТ(ЭтаФорма=Неопределено) Экспорт
	
	Для Каждого ТекСтр из ФОТ Цикл
		
		ТекСотрудник=ТекСтр.Сотрудник;
		
		ЗаполнитьKPI(ТекСотрудник);
		ЗаполнитьФонды(ТекСотрудник);
		АвторасчетФОТСотрудник(Этаформа,ТекСотрудник);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура АвторасчетФОТСотрудник(Этаформа,ТекСотрудник) Экспорт
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	МС1=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник",ТекСотрудник));
	МС2=Детализация.НайтиСтроки(Новый Структура("Сотрудник",ТекСотрудник));
	
	МаксРасч=МС1.Количество()+МС2.Количество()+1;
	
	Если МаксРасч=0 Тогда
		МаксРасч=1;
	КонецЕсли;
	
	Сч=0;
	//Об=Справочники.KPI.СоздатьЭлемент();
	//ОбПлан=Документы.ПлановыеЗначенияKPI.СоздатьДокумент();
	МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник",ТекСотрудник));
	Для Каждого ТекСтр из МС Цикл
		Сч=Сч+1;
		
		//Если УтверждениеПоКумМарже Тогда   //пересчет только показателей по кум марже
		//	Если ТипЗнч(ТекСтр.БазоваяЧасть)=Тип("СправочникСсылка.KPI") Тогда
		//		Если НЕ ТекСтр.БазоваяЧасть.ПоКумМарже Тогда
		//			Продолжить;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЕсли;
		
		Если НЕ ТекСтр.ВыгружатьВыработку Тогда
			
			Попытка
				
				Ставка = ПолучитьСтавкуСотрудника(КонПериода,ТекСтр.Сотрудник);
				
				Если ТипЗнч(ТекСтр.ЦелевыеПоказатели)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
					
					ТекСтр.РП=ложь;
					
					Если ТекСтр.ЦелевыеПоказатели.ОкруглятьДоЦелых Тогда
						
						ТекСтр.СуммаЦелевыхПоказателей=Окр(Справочники.KPI.РасчитатьKPI(НачПериода,КонПериода,ТекСтр.Сотрудник, ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели,,ПодразделениеКомпании)*Ставка,0,РежимОкругления.Окр15как10);
						
						ТекСтр.ПланЦелевыхПоказателей=Окр(Документы.ПлановыеЗначенияKPI.ПолучитьПлан(КонПериода,Периодичность,ТекСтр.ЦелевыеПоказатели,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ПодразделениеКомпании)*Ставка,0,РежимОкругления.Окр15как10);
						
						Если НЕ ТекСтр.ЦелевыеПоказатели.ПоказательСуммаКМ = Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка() Тогда
							
							ТекСтр.СуммаКМ = Окр(Справочники.ПоказателиДляРасчетаМотивации.ВыполнитьРасчетKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели.ПоказательСуммаКМ,ТекСтр.ЦелевыеПоказатели.Периодичность,ПодразделениеКомпании,ТекСтр.ЦелевыеПоказатели.СреднееЗаКвартал),0,РежимОкругления.Окр15как10);
							
						КонецЕсли;
					
						Если НЕ ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования = Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка()
							И ТипЗнч(ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования) = Тип("СправочникСсылка.ПоказателиДляРасчетаМотивации") Тогда
							
							ТекСтр.КоэффициентПремирования = Справочники.ПоказателиДляРасчетаМотивации.ВыполнитьРасчетKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования,ТекСтр.ЦелевыеПоказатели.Периодичность,ПодразделениеКомпании,ТекСтр.ЦелевыеПоказатели.СреднееЗаКвартал);
							
						ИначеЕсли НЕ ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования = Справочники.ПараметрыНастройкиKPI.ПустаяСсылка()
							И ТипЗнч(ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования) = Тип("СправочникСсылка.ПараметрыНастройкиKPI") Тогда
							
							ТекСтр.КоэффициентПремирования = Справочники.ПараметрыНастройкиKPI.ПолучитьЗначениеПараметраKPI(НачПериода,КонПериода,ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования);
	
						КонецЕсли;
					
					Иначе
						
						ТекСтр.СуммаЦелевыхПоказателей=Справочники.KPI.РасчитатьKPI(НачПериода,КонПериода,ТекСтр.Сотрудник, ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели,,ПодразделениеКомпании)*Ставка;
						
						ТекСтр.ПланЦелевыхПоказателей=Документы.ПлановыеЗначенияKPI.ПолучитьПлан(КонПериода,Периодичность,ТекСтр.ЦелевыеПоказатели,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ПодразделениеКомпании)*Ставка;
						
						Если НЕ ТекСтр.ЦелевыеПоказатели.ПоказательСуммаКМ = Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка() Тогда
							
							ТекСтр.СуммаКМ = Справочники.ПоказателиДляРасчетаМотивации.ВыполнитьРасчетKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели.ПоказательСуммаКМ,ТекСтр.ЦелевыеПоказатели.Периодичность,ПодразделениеКомпании,ТекСтр.ЦелевыеПоказатели.СреднееЗаКвартал);
							
						КонецЕсли;
						
						Если НЕ ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования = Справочники.ПоказателиДляРасчетаМотивации.ПустаяСсылка() 
							И ТипЗнч(ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования) = Тип("СправочникСсылка.ПоказателиДляРасчетаМотивации") Тогда
							
							ТекСтр.КоэффициентПремирования = Справочники.ПоказателиДляРасчетаМотивации.ВыполнитьРасчетKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования,ТекСтр.ЦелевыеПоказатели.Периодичность,ПодразделениеКомпании,ТекСтр.ЦелевыеПоказатели.СреднееЗаКвартал);
							
						ИначеЕсли НЕ ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования = Справочники.ПараметрыНастройкиKPI.ПустаяСсылка() 
							И ТипЗнч(ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования) = Тип("СправочникСсылка.ПараметрыНастройкиKPI") Тогда
							
							ТекСтр.КоэффициентПремирования = Справочники.ПараметрыНастройкиKPI.ПолучитьЗначениеПараметраKPI(НачПериода,КонПериода,ТекСтр.ЦелевыеПоказатели.ПоказательКоэффициентПремирования);
							
						КонецЕсли;

					КонецЕсли;
					
					НужноОкруглять=ложь;    
					КолЗнаков=2;
					
					//Если КорректироватьПлан(ТекСотрудник, ТекСтр.ЦелевыеПоказатели, ТекСотрудник.Должность, НужноОкруглять, КолЗнаков) Тогда
					//	
					//	ДнейПоФакту=0;
					//	ДнейПоПлану=0;
					//	Доля=УзнатьДолюОтработанногоВремени(ТекСотрудник,ДнейПоФакту,ДнейПоПлану,Ставка,истина);
					//	
					//	Если НужноОкруглять Тогда
					//		ТекСтр.ПланЦелевыхПоказателей=Окр(ТекСтр.ПланЦелевыхПоказателей*Доля*Ставка+(0.5*pow(10,-КолЗнаков)),КолЗнаков,РежимОкругления.Окр15как10);
					//	Иначе
					//		ТекСтр.ПланЦелевыхПоказателей=ТекСтр.ПланЦелевыхПоказателей*Доля*Ставка;
					//	КонецЕсли;
					//	
					//КонецЕсли;
					
					Если ТекСтр.ПланЦелевыхПоказателей>0 Тогда
						
						Если ТипЗнч(ТекСтр.ЦелевыеПоказатели) = Тип("СправочникСсылка.KPI") И ТекСтр.ЦелевыеПоказатели.Обратный Тогда
							
							Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета = 0 
								И ТекСтр.ЦелевыеПоказатели.НеОграничиватьВРасчете Тогда
								
								ТекПроцент = ТекСтр.ПланЦелевыхПоказателей/ТекСтр.СуммаЦелевыхПоказателей*100;
								
								//->Diginova 23.09.2021
								Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее = 0
									И ТекПроцент < ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее Тогда
									
									ТекСтр.ПроцентВыполнения = ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее;

								Иначе
									
									ТекСтр.ПроцентВыполнения = ?(ТекПроцент>ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета, ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета, ТекПроцент);
									
								КонецЕсли;
								//<-Diginova
								
							Иначе
								
								ТекПроцент = ТекСтр.ПланЦелевыхПоказателей/ТекСтр.СуммаЦелевыхПоказателей*100;
								
								//->Diginova 23.09.2021
								Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее = 0
									И ТекПроцент < ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее Тогда
									
									ТекСтр.ПроцентВыполнения = ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее;
									
								Иначе
									
									ТекСтр.ПроцентВыполнения = ТекПроцент;
									
								КонецЕсли;
							    //<-Diginova
								 
							КонецЕсли;
							
						Иначе
							
							Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета = 0 
								И ТекСтр.ЦелевыеПоказатели.НеОграничиватьВРасчете Тогда
								
								ТекПроцент = ТекСтр.СуммаЦелевыхПоказателей/ТекСтр.ПланЦелевыхПоказателей*100;
								
								//->Diginova 23.09.2021
								Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее = 0
									И ТекПроцент < ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее Тогда
									
									ТекСтр.ПроцентВыполнения = ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее;
									
								Иначе
									
									ТекСтр.ПроцентВыполнения = ?(ТекПроцент>ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета, ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчета, ТекПроцент);

								КонецЕсли;
							    //<-Diginova
								
							Иначе
								
								//->Diginova 23.09.2021
								ТекПроцент = ТекСтр.СуммаЦелевыхПоказателей/ТекСтр.ПланЦелевыхПоказателей*100;
								
								Если НЕ ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее = 0
									И ТекПроцент < ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее Тогда
									
									ТекСтр.ПроцентВыполнения = ТекСтр.ЦелевыеПоказатели.ПороговоеЗначенияДляРасчетаНеМенее;
									
								Иначе
									
									ТекСтр.ПроцентВыполнения = ТекПроцент;
									
								КонецЕсли;
							    //<-Diginova
							
							КонецЕсли;
							
						КонецЕсли;
						
						ТекСтр.Коэффициент=Справочники.KPI.РассчитатьКоэффициентБЧ(ТекСтр.ПроцентВыполнения, ТекСтр.ЦелевыеПоказатели);
						
					ИначеЕсли  ТекСтр.ЦелевыеПоказатели.НетПлана Тогда
						
						ТекСтр.ПроцентВыполнения=100;
						ТекСтр.Коэффициент=Справочники.KPI.РассчитатьКоэффициентБЧ(ТекСтр.ПроцентВыполнения, ТекСтр.ЦелевыеПоказатели);
						
					Иначе
						
						ТекСтр.ПроцентВыполнения=0;
						ТекСтр.Коэффициент=0;
						
					КонецЕсли;
					
					Если Не ПустаяСтрока(ТекСтр.ЦелевыеПоказатели.ФормулаДляРасчетаПремии) Тогда
						
						Если ТипЗнч(ТекСтр.ЦелевыеПоказатели) = Тип("СправочникСсылка.KPI") 
							И ТекСтр.ЦелевыеПоказатели.КоэффициентыБазовойЧастиОтВыполненияПлана.Количество() = 0 Тогда  
							ТекСтр.Коэффициент=1;
						КонецЕсли;  	
						
						Если ТипЗнч(ТекСтр.ЦелевыеПоказатели) = Тип("СправочникСсылка.KPI") 
							И ТекСтр.ЦелевыеПоказатели.ОкруглятьДоЦелых Тогда
							
							ТекСтр.ИтоговыйРасчет=Окр(Справочники.KPI.РасчитатьKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели,,ПодразделениеКомпании,истина,ТекСтр.ПроцентВыполнения/100)*Ставка*ТекСтр.Коэффициент,0,РежимОкругления.Окр15как10);
							
						Иначе
							
							ТекСтр.ИтоговыйРасчет=Справочники.KPI.РасчитатьKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.ЦелевыеПоказатели,,ПодразделениеКомпании,истина,ТекСтр.ПроцентВыполнения/100)*Ставка*ТекСтр.Коэффициент;
							
						КонецЕсли;
						
						ТекСтр.РП=истина;
						
					Иначе
						
						Если ТипЗнч(ТекСтр.ЦелевыеПоказатели) = Тип("СправочникСсылка.KPI") 
							И ТекСтр.ЦелевыеПоказатели.ОкруглятьДоЦелых Тогда
							
							ТекСтр.ИтоговыйРасчет=Окр(ТекСтр.СуммаЦелевыхПоказателей*ТекСтр.Коэффициент,0,РежимОкругления.Окр15как10);
							
						Иначе
							
							ТекСтр.ИтоговыйРасчет=ТекСтр.СуммаЦелевыхПоказателей*ТекСтр.Коэффициент;
							
						КонецЕсли;       
						
					КонецЕсли;
					
				Иначе
					
					ТекСтр.РП=ложь;
					ТекСтр.Коэффициент=1;
					
					Если ТипЗнч(ТекСтр.ЦелевыеПоказатели) = Тип("СправочникСсылка.KPI") 
						И ТекСтр.ЦелевыеПоказатели.ОкруглятьДоЦелых Тогда
						
						ТекСтр.СуммаЦелевыхПоказателей=Окр(ТекСтр.ЦелевыеПоказатели*Ставка,0,РежимОкругления.Окр15как10);
						
						ТекСтр.ИтоговыйРасчет=Окр(ТекСтр.ЦелевыеПоказатели*Ставка,0,РежимОкругления.Окр15как10);
						
					Иначе	
						
						ТекСтр.СуммаЦелевыхПоказателей=ТекСтр.ЦелевыеПоказатели*Ставка;
						
						ТекСтр.ИтоговыйРасчет=ТекСтр.ЦелевыеПоказатели*Ставка;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Исключение
				
				ОО=ОписаниеОшибки();
				
				Если не Мотивация.Это_Клиент() Тогда
					
					ЗаписьЖурналаРегистрации("Ошибка авторасчета выполнения KPI", УровеньЖурналаРегистрации.Предупреждение, , ТекСтр.ЦелевыеПоказатели, ОО); 
					
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МС=Детализация.НайтиСтроки(Новый Структура("Сотрудник",ТекСотрудник));
	
	Для Каждого ТекСтр из МС Цикл
		
		Сч=Сч+1;
		Попытка
			
				
				ТекСтр.Факт=Справочники.KPI.РасчитатьKPI(НачПериода,КонПериода,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ТекСтр.KPI,,ПодразделениеКомпании);
				ТекСтр.План=Документы.ПлановыеЗначенияKPI.ПолучитьПлан(КонПериода,Периодичность,ТекСтр.KPI,ТекСтр.Сотрудник,ДолжностьСотрудника(ТекСтр.Сотрудник),ПодразделениеКомпании);
			
		Исключение
			
			ОО=ОписаниеОшибки();
			
			Если не Мотивация.Это_Клиент() Тогда
				
				ЗаписьЖурналаРегистрации("Ошибка автоформирования", УровеньЖурналаРегистрации.Предупреждение, , ТекСтр.KPI, ОО); 
				
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	РасчетОбщейПремии(Сч,МаксРасч,ТекСотрудник,ЭтаФорма);
	
КонецПроцедуры

Процедура РасчетОбщейПремии(Сч,МаксРасч,ТекСотрудник=Неопределено,ЭтаФорма=Неопределено) Экспорт
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	СтруктураПостобработки = Новый Массив;
	СтруктураПостобработки.Добавить(НачПериода);	
	СтруктураПостобработки.Добавить(КонПериода);
	СтруктураПостобработки.Добавить(ТекСотрудник);
	СтруктураПостобработки.Добавить(ТекСотрудник.Должность);
	СтруктураПостобработки.Добавить(ЭтотОбъект.ПодразделениеКомпании);
	
	//ТабКорректировок=ПолучитьТабКорректировок();
	
	//Если Не УтверждениеПоКумМарже Тогда
	//	ОбновитьПовторноИспользуемыеЗначения();
	//КонецЕсли;
	
	Для Каждого ТекСтр из ФОТ Цикл
		
		Если ТекСотрудник<>Неопределено ТОгда
			Если ТекСотрудник<>ТекСтр.Сотрудник Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Сч=Сч+1;
		
		МС=РезультатыРасчета.НайтиСтроки(Новый Структура("Сотрудник",ТекСтр.Сотрудник));
		
		ОтдЧасть=0;
		ОбщЧасть=0;
		СНЧасть=0;
		ОкруглятьДоЦелых = Ложь;

		Для Каждого ТекЭл из МС Цикл
			
			Если Текэл.Неактивно Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если ТекЭл.ЗащищеннаяЧасть Тогда
				ОтдЧасть=ОтдЧасть+ТекЭл.ИтоговыйРасчет*ТекЭл.ЦелевыеПоказатели.ДоляОтдельнойЧасти/100;
				ОбщЧасть=ОбщЧасть+ТекЭл.ИтоговыйРасчет*(1-ТекЭл.ЦелевыеПоказатели.ДоляОтдельнойЧасти/100);
			Иначе
				ОбщЧасть=ОбщЧасть+ТекЭл.ИтоговыйРасчет;
			КонецЕсли;
			
			Если ТекЭл.ВыгружатьВыработку Тогда
				СНЧасть=СНЧасть+ТекЭл.ИтоговыйРасчет;
				ОкруглятьДоЦелых = ТекЭл.ЦелевыеПоказатели.ОкруглятьДоЦелых;
			КонецЕсли;
			
		КонецЦикла;
		
		ТекСтр.ОбщийФонд=ОбщЧасть;
		ТекСтр.ОтдельныйФонд=ОтдЧасть;
		ТекСтр.ФондПоСдельнымНарядам=СНЧасть;
		
		Ставка = ПолучитьСтавкуСотрудника(КонПериода,ТекСтр.Сотрудник);
		
		ТекСтр.Ставка=Ставка;
		
		МС=Детализация.НайтиСтроки(Новый Структура("Сотрудник",ТекСтр.Сотрудник));
		
		ОбщKPI=0;
		//Об=Справочники.KPI.СоздатьЭлемент();
		Для Каждого ТекЭл из МС Цикл
			
			ТекKPI=0;
			Если ТекЭл.План=0 Тогда
				
				Если  ТекЭл.KPI.Обратный Тогда
					
					Если  ТекЭл.Факт<=ТекЭл.План Тогда
						ТекKPI=1;
						ТекЭл.ФактПлан=ТекKPI;
						ТекЭл.Значение=ТекKPI;
					Иначе
						ТекKPI=ТекЭл.План/ТекЭл.Факт;
						ТекЭл.ФактПлан=ТекKPI;
						ТекKPI=Справочники.KPI.Постобработка(ТекKPI,ТекЭл.KPI, "", СтруктураПостобработки);
						Если ТекKPI>1 и Не ТекЭл.KPI.НеОграничиватьВРасчете Тогда
							ТекKPI=1;
						КонецЕсли;
						ТекЭл.Значение=ТекKPI;
					КонецЕсли;
					
				ИначеЕсли ТекЭл.KPI.НетПлана Тогда
					
					ТекKPI=1;
					ТекЭл.Значение=ТекKPI;
					
				Иначе
					
					Сообщить("Для сотрудника "+ТекСтр.Сотрудник+" не установлен план по KPI : "+ТекЭл.KPI+". Значение не расчитано");
					ТекЭл.ФактПлан=0;
					ТекЭл.Значение=0;
					
				КонецЕсли;
				
			Иначе
				
				Если ТекЭл.KPI.Обратный Тогда
					
					Если  ТекЭл.Факт<=ТекЭл.План Тогда
						
						Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчета = 0 
							И ТекЭл.KPI.НеОграничиватьВРасчете Тогда
							
							ТекKPI=ТекЭл.План/ТекЭл.Факт;
							
							ТекЭл.ФактПлан=ТекKPI;
							
							Если ТекKPI>1 и Не ТекЭл.KPI.НеОграничиватьВРасчете Тогда
								ТекKPI=1;
							КонецЕсли;
							
							//->Diginova 23.09.2021
							Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее = 0
								И ТекKPI < (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100) Тогда
								
								ТекKPI = (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100);
								
							Иначе

							    ТекKPI = ?(ТекKPI>(ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100), (ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100),ТекKPI);
							
						    КонецЕсли;
						    //->Diginova 
							
						Иначе
							
							ТекKPI=1;
							
							//->Diginova 23.09.2021
							Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее = 0
								И ТекKPI < (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100) Тогда
								
								ТекKPI = (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100);
								
							КонецЕсли;
                            //->Diginova
							
							ТекЭл.ФактПлан=ТекKPI;
							
						КонецЕсли;	
						
						ТекЭл.Значение=ТекKPI;
						
					Иначе
						
						ТекKPI=ТекЭл.План/ТекЭл.Факт;
						ТекЭл.ФактПлан=ТекKPI;
						ТекKPI=Справочники.KPI.Постобработка(ТекKPI,ТекЭл.KPI, "", СтруктураПостобработки);
						Если ТекKPI>1 и Не ТекЭл.KPI.НеОграничиватьВРасчете Тогда
							ТекKPI=1;
						КонецЕсли;
						
						Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчета = 0 
							И ТекЭл.KPI.НеОграничиватьВРасчете Тогда
							
							//->Diginova 23.09.2021
							Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее = 0
								И ТекKPI < (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100) Тогда
								
								ТекKPI = (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100);
								
							Иначе

							    ТекKPI = ?(ТекKPI>(ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100), (ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100),ТекKPI);
							
						     КонецЕсли;
						     //->Diginova 
							 
						КонецЕсли;
						
						//->Diginova 23.09.2021
						Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее = 0
							И ТекKPI < (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100) Тогда
							
							ТекKPI = (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100);
							
						КонецЕсли;
						//->Diginova

						ТекЭл.Значение=ТекKPI;
						
					КонецЕсли;
					
				Иначе
					
					ТекKPI=ТекЭл.Факт/ТекЭл.План;
					ТекЭл.ФактПлан=ТекKPI;
					ТекKPI=Справочники.KPI.Постобработка(ТекKPI,ТекЭл.KPI, "", СтруктураПостобработки);
					
					Если ТекKPI>1 и Не ТекЭл.KPI.НеОграничиватьВРасчете Тогда
						ТекKPI=1;
					КонецЕсли;
					
					Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчета = 0 
						И ТекЭл.KPI.НеОграничиватьВРасчете Тогда
						
						ТекKPI = ?(ТекKPI>(ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100), (ТекЭл.KPI.ПороговоеЗначенияДляРасчета/100),ТекKPI);
						
					КонецЕсли;	
					
					//->Diginova 23.09.2021
					Если НЕ ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее = 0
						И ТекKPI < (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100) Тогда
						
						ТекKPI = (ТекЭл.KPI.ПороговоеЗначенияДляРасчетаНеМенее/100);
						
					КонецЕсли;
					//->Diginova

					ТекЭл.Значение=ТекKPI;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТекЭл.KPI.ОкруглятьДоЦелых Тогда
				
				ОкруглятьДоЦелых = Истина;
				ТекЭл.Сумма = Окр(Окр(ОбщЧасть,2)*(ТекKPI*ТекЭл.Вес/100),0,РежимОкругления.Окр15как10);
				
			Иначе
				
				ТекЭл.Сумма = Окр(ОбщЧасть,2)*(ТекKPI*ТекЭл.Вес/100);
				
			КонецЕсли;
			
			ОбщKPI=ОбщKPI+ТекKPI*ТекЭл.Вес;
			
		КонецЦикла;
		
		ОбщKPI=ОбщKPI/100;
		
		ТекСтр.ИтоговыйKPI=ОбщKPI;
		
		ОДФ=0;
		ОДП=0;
		Ставка=1;
		
		ТекСтр.ДоляОтработанногоВремени = УзнатьДолюОтработанногоВремени(ТекСтр.Сотрудник,ОДФ,ОДП,Ставка);
		
		ТекСтр.ОДП=ОДП;
		ТекСТр.ОДФ=ОДФ;
		
		Если СНЧасть = 0 Тогда
			
			Если ОкруглятьДоЦелых Тогда
				
				ТекСтр.ОбщийФонд= Окр(Окр(ОбщЧасть,2)*?(ОбщKPI=0,1,ОбщKPI),0,РежимОкругления.Окр15как10);
				ТекСтр.ОтдельныйФонд= Окр(Окр(ОтдЧасть,2),0,РежимОкругления.Окр15как10);
				
			Иначе
				
				ТекСтр.ОбщийФонд=Окр(ОбщЧасть,2)*?(ОбщKPI=0,1,ОбщKPI);
				ТекСтр.ОтдельныйФонд=Окр(ОтдЧасть,2);
				
			КонецЕсли;
			
			ТекСтр.ФондПоСдельнымНарядам=Окр(СНЧасть,2)*ТекСтр.ДоляОтработанногоВремени;
			
			Премия=ТекСтр.ОтдельныйФонд+ТекСтр.ОбщийФонд;
			
		Иначе
			
			Если ОкруглятьДоЦелых Тогда
				
				ТекСтр.ОбщийФонд=Окр(Окр(ОбщЧасть,2)*?(ОбщKPI=0,1,ОбщKPI),0,РежимОкругления.Окр15как10);;
				ТекСтр.ОтдельныйФонд=Окр(Окр(ОтдЧасть,2),0,РежимОкругления.Окр15как10);;
				
			Иначе	
				
				ТекСтр.ОбщийФонд=Окр(ОбщЧасть,2)*?(ОбщKPI=0,1,ОбщKPI);
				ТекСтр.ОтдельныйФонд=Окр(ОтдЧасть,2);
				
			КонецЕсли;
			
			ТекСтр.ФондПоСдельнымНарядам=Окр(СНЧасть,2);
			Премия=ТекСтр.ОтдельныйФонд+ТекСтр.ОбщийФонд;
			
		КонецЕсли;
		
		ТекСтр.ПредварительнаяПремия=Премия;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнформацияОФОТСрезПоследних.СуммаОклада КАК СуммаОклада,
		|	ИнформацияОФОТСрезПоследних.Премия КАК Премия
		|ИЗ
		|	РегистрСведений.ИнформацияОФОТ.СрезПоследних(
		|			&КонецПериода,
		|			Сотрудник = &Сотрудник
		|				И Должность = &Должность
		|				И Подразделение = &Подразделение) КАК ИнформацияОФОТСрезПоследних";
		
		Запрос.УстановитьПараметр("Должность", ТекСотрудник.Должность);
		Запрос.УстановитьПараметр("КонецПериода", КонПериода);
		Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Сотрудник", текСтр.Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Если НЕ ВыборкаДетальныеЗаписи.СуммаОклада = 0 
				ИЛИ НЕ ВыборкаДетальныеЗаписи.Премия = 0 Тогда
				
				ТекСтр.ПремияИлиОклад=Истина;
				ТекСтр.Оклад=ВыборкаДетальныеЗаписи.СуммаОклада;
				ТекСтр.Премия=ВыборкаДетальныеЗаписи.Премия;
				
				Если ТекСтр.Оклад*ТекСтр.ДоляОтработанногоВремени<ТекСТр.ПредварительнаяПремия ТОгда
					//ТекСтр.ПремияБезКорректировки=ТекСтр.ПредварительнаяПремия-ТекСтр.Оклад;
					ТекСтр.ПремияБезКорректировки=ТекСтр.ПредварительнаяПремия;
					
				Иначе
					ТекСтр.ПремияБезКорректировки=Премия;
				КонецЕсли;
				
			Иначе
				
				ТекСтр.ПремияИлиОклад=Ложь;
				ТекСтр.ПремияБезКорректировки=Премия;
				
			КонецЕсли;
			
		Иначе
			
			ТекСтр.ПремияИлиОклад=Ложь;
			ТекСтр.ПремияБезКорректировки=Премия;
			
		КонецЕсли;
		
		
		СуммаПоОкладуПремии = 0;
		Если ТекСтр.ПремияИлиОклад Тогда
			//->Diginova 04.10.2021
			Если УчитываетОтработанноеВремя тогда
				ОснПремия = ТекСтр.Премия * ТекСтр.ДоляОтработанногоВремени;
			Иначе
				ОснПремия = ТекСтр.Премия;
			КонецЕсли;
			СуммаПоОкладуПремии = (ТекСтр.Оклад*ТекСтр.ДоляОтработанногоВремени) + ОснПремия;
			//<-Diginova
			
		КонецЕсли;
		
		СуммаПоKPI = 0;
		Если СНЧасть = 0 Тогда
			//->Diginova 04.10.2021
						
			Если УчитываетОтработанноеВремя тогда
				СуммаПоKPI = ТекСтр.ПремияБезКорректировки*ТекСтр.ДоляОтработанногоВремени;
			Иначе
				СуммаПоKPI = ТекСтр.ПремияБезКорректировки;
			КонецЕсли;
			//<-Diginova
			
		Иначе
			
			//->Diginova 04.10.2021
			Если УчитываетОтработанноеВремя тогда
				СуммаПоKPI = ТекСтр.ПремияБезКорректировки*ТекСтр.ДоляОтработанногоВремени;
			Иначе
				СуммаПоKPI = ТекСтр.ПремияБезКорректировки;
			КонецЕсли;
			//<-Diginova

			
		КонецЕсли;
		
		текСтр.ФОТпоШР = текСтр.Сотрудник.ФОТпоШР;	
		
		Если ОкруглятьДоЦелых Тогда
			
			ТекСтр.Сумма=Окр((СуммаПоKPI+СуммаПоОкладуПремии),0,РежимОкругления.Окр15как10);
			
		Иначе
			
			ТекСтр.Сумма=(СуммаПоKPI+СуммаПоОкладуПремии);
			
		КонецЕсли;
	
		Если ЭтотОбъект.Периодичность=Перечисления.Периодичность.Квартал Тогда
			
			НКД=УзнатьНабор(ТекСтр.Должность);
			
			Если НКД<>Неопределено и НКД.РасчетКвартальнойПремииСВычетомПомесячной  Тогда
				
				ТекСтр.СуммаВычетаЗаКвартал=РассчитатьВычет(ТекСтр.Сотрудник,НКД);
				Если ТекСтр.СуммаВычетаЗаКвартал>ТекСтр.ПремияБезКорректировки Тогда
					ТекСтр.Сумма=0;
				Иначе
					ТекСтр.Сумма=ТекСтр.ПремияБезКорректировки-ТекСтр.СуммаВычетаЗаКвартал;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;  
	
	//Заполнение корректировок	
	КорректировкаОкладов.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкиРасчетаKPIКорректировки.Сотрудник КАК Сотрудник,
	|	КорректировкиРасчетаKPIКорректировки.СуммаНачислено КАК СуммаНачислено,
	|	КорректировкиРасчетаKPIКорректировки.СуммаКорректировки КАК СуммаКорректировки,
	|	КорректировкиРасчетаKPIКорректировки.Должность КАК Должность
	|ИЗ
	|	Документ.КорректировкиРасчетаKPI.Корректировки КАК КорректировкиРасчетаKPIКорректировки
	|ГДЕ
	|	КорректировкиРасчетаKPIКорректировки.Ссылка.ДокументОснование = &ДокументОснование
	|	И НЕ КорректировкиРасчетаKPIКорректировки.СуммаКорректировки = 0
	|	И КорректировкиРасчетаKPIКорректировки.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			//Заполняем ТЧ корректировки
			НоваяСтрока = КорректировкаОкладов.Добавить();
			НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			НоваяСтрока.СуммаКорректировки = ВыборкаДетальныеЗаписи.СуммаКорректировки;
			
			ПараметрыОтбораСотрудника = Новый Структура;
			ПараметрыОтбораСотрудника.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Сотрудник);
			ПараметрыОтбораСотрудника.Вставить("Должность",ВыборкаДетальныеЗаписи.Должность);
			
			НайденаяСтрокаФОТ = ФОТ.НайтиСтроки(ПараметрыОтбораСотрудника);
			
			Если НЕ НайденаяСтрокаФОТ.Количество() = 0 Тогда 
				НайденаяСтрокаФОТ[0].ДопПремия = ВыборкаДетальныеЗаписи.СуммаКорректировки;
				НайденаяСтрокаФОТ[0].СуммаСКорректировкой = НайденаяСтрокаФОТ[0].Сумма + НайденаяСтрокаФОТ[0].ДопПремия;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьВычет(Сотр,НКД) //вычет из квартальной премии
	
	Вычет=0;
	Если НКД.Месяц1 Тогда
		Пер=ДобавитьМесяц(НачалоКвартала(ЭтотОбъект.Период),0);
		Вычет=Вычет+УзнатьПремию(Сотр,Пер)+УзнатьОтдельнуюЧасть(Сотр,Пер);
	КонецЕсли;
	
	Если НКД.Месяц2 Тогда
		Пер=ДобавитьМесяц(НачалоКвартала(ЭтотОбъект.Период),1);
		Вычет=Вычет+УзнатьПремию(Сотр,Пер)+УзнатьОтдельнуюЧасть(Сотр,Пер);
	КонецЕсли;
	
	Если НКД.Месяц3 Тогда
		Пер=ДобавитьМесяц(НачалоКвартала(ЭтотОбъект.Период),2);
		Вычет=Вычет+УзнатьПремию(Сотр,Пер)+УзнатьОтдельнуюЧасть(Сотр,Пер);
	КонецЕсли;
	
	Возврат Вычет;
	
КонецФункции

Функция УзнатьОтдельнуюЧасть(Сотр,Пер)
	
	ОТЧ = 0;
	ЭтоРОП = Сотр.Должность  = Справочники.Должности.НайтиПоНаименованию("Руководитель отдела продаж"); //или Сотр.РОП;
	
	Если НЕ ЭтоРОП тогда 
		Возврат ОТЧ
	Иначе
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РасчетВыполненияKPI.ОтдельныйФонд, 0)) КАК ОтдельныйФонд
		|ИЗ
		|	Документ.РасчетВыполненияKPI.ФОТ КАК РасчетВыполненияKPI
		|ГДЕ
		|	РасчетВыполненияKPI.Ссылка.Проведен
		|	И РасчетВыполненияKPI.Сотрудник = &Сотрудник
		|	И РасчетВыполненияKPI.Ссылка.ПериодПланирования МЕЖДУ &НачПериода И &КонПериода");
		
		Запрос.УстановитьПараметр("Сотрудник",Сотр);
		Запрос.УстановитьПараметр("НачПериода",НачалоМесяца(Пер));
		Запрос.УстановитьПараметр("КонПериода",КонецМесяца(Пер));
		Результат = Запрос.Выполнить().Выбрать();
		
		Если Результат.Следующий() тогда 
			ОФ = Результат.ОтдельныйФонд;
			Если ЗначениеЗаполнено(ОФ) тогда 
				ОТЧ = (-1)*ОФ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОТЧ;
	
КонецФункции

Функция УзнатьПремию(Сотр,Пер)
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Начисления.Сумма
	|ИЗ
	|	РегистрСведений.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Сотрудник = &Сотрудник
	|	И Начисления.ПодразделениеКомпании = &ПодразделениеК
	|	И Начисления.Период = &Период
	|	И Начисления.Периодичность = &Периодичность");
	
	Запрос.УстановитьПараметр("Сотрудник",Сотр);
	Запрос.УстановитьПараметр("ПодразделениеК",ЭтотОбъект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	Запрос.УстановитьПараметр("Период",Пер);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	ВсегоПремия=0;
	Пока Выб.Следующий() Цикл
		ВсегоПремия=ВсегоПремия+Выб.Сумма;
	КонецЦикла;
	
	Итого=ВсегоПремия;
	
	Возврат Итого;
	
КонецФункции

Функция УзнатьНабор(Долж)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Ссылка
	|ИЗ
	|	Документ.СоставKPI.Должности КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ СоставKPI.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Должность", Долж);
	Запрос.УстановитьПараметр("подразделениеКомпании", ЭтотОбъект.ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДолжностьСотрудника(Сотр) Экспорт
	НС=ФОТ.Найти(Сотр,"Сотрудник");
	Если НС<>Неопределено Тогда
		Возврат НС.Должность;
	Иначе
		Возврат Сотр.Должность;
	КонецЕсли;
КонецФункции

//Функция КорректироватьПлан(Сотр,KPI,Должность,НужноОкруглять,КолЗнаков)
//	
//	Запрос=Новый запрос( "ВЫБРАТЬ
//	|	СоставKPI.KPI,
//	|	СоставKPI.УчитыватьОтрабВремя,
//	|	СоставKPI.ОкруглятьПлан,
//	|	СоставKPI.КоличествоЗнаковОкругления
//	|ИЗ
//	|	Документ.СоставKPI.НаборKPI КАК СоставKPI
//	|ГДЕ
//	|	СоставKPI.KPI = &KPI
//	|	И СоставKPI.Должность = &Должность" );
//	Запрос.УстановитьПараметр("Должность",Должность);
//	Запрос.УстановитьПараметр("KPI",KPI);
//	
//	Выб=Запрос.Выполнить().Выбрать();
//	
//	Если Выб.Следующий() Тогда
//		НужноОкруглять=Выб.округлятьПлан;
//		КолЗнаков=Выб.КоличествоЗнаковОкругления;
//		Возврат Выб.УчитыватьОтрабВремя;
//	КонецЕсли;
//	
//	Возврат ложь;
//	
//КонецФункции

Функция УзнатьДолюОтработанногоВремени(Сотр,ДнейПоФакту,ДнейПоПлану,Ставка,БезПроверки=ложь)
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат 0;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ТабельУчетаРабочегоВремениТабель.Сотрудник КАК Сотрудник,
	|	СУММА(ТабельУчетаРабочегоВремениТабель.КоличествоДнейПлан) КАК План,
	|	СУММА(ТабельУчетаРабочегоВремениТабель.КоличествоДнейФакт) КАК Факт
	|ИЗ
	|	Документ.ТабельУчетаРабочегоВремени.Табель КАК ТабельУчетаРабочегоВремениТабель
	|ГДЕ
	|	ТабельУчетаРабочегоВремениТабель.Ссылка.ПериодРаботы МЕЖДУ &НачПериода И &КонПериода
	|	И НЕ ТабельУчетаРабочегоВремениТабель.Ссылка.ПометкаУдаления
	|	И ТабельУчетаРабочегоВремениТабель.Сотрудник = &Сотрудник
	|	И ТабельУчетаРабочегоВремениТабель.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабельУчетаРабочегоВремениТабель.Сотрудник");
	
	Запрос.УстановитьПараметр("НачПериода",НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериода",КонецМесяца(КонПериода));
	Запрос.УстановитьПараметр("Сотрудник",Сотр);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	ДнейПоПлану=0;
	ДнейПоФакту=0;
	
	Ставка = ПолучитьСтавкуСотрудника(КонПериода, Сотр);
	
	Пока Выб.Следующий() Цикл
		
		Если Выб.План>0 Тогда
			ДнейПоПлану=Выб.План;
		КонецЕсли;
		
		Если Выб.Факт>0 Тогда
			ДнейПоФакту=Выб.Факт;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ БезПроверки Тогда
		
		Запрос=Новый запрос( "ВЫБРАТЬ
		|	СоставKPIДолжности.УчитыватьОтрабВремя КАК УчитыватьОтработанноеВремя,
		|	СоставKPIДолжности.Ссылка,
		|	0 КАК Приоритет
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.СоставKPI.Должности КАК СоставKPIДолжности
		|ГДЕ
		|	СоставKPIДолжности.Должность = &Должность
		|	И НЕ СоставKPIДолжности.Ссылка.ПометкаУдаления
		|	И СоставKPIДолжности.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоставKPIДолжности.УчитыватьОтрабВремя,
		|	СоставKPIДолжности.Ссылка,
		|	1
		|ИЗ
		|	Документ.СоставKPI.Должности КАК СоставKPIДолжности
		|ГДЕ
		|	СоставKPIДолжности.Должность = &Должность
		|	И НЕ СоставKPIДолжности.Ссылка.ПометкаУдаления
		|	И СоставKPIДолжности.Ссылка.ПодразделениеКомпании = &Пустое
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.УчитыватьОтработанноеВремя,
		|	ВТ.Ссылка,
		|	ВТ.Приоритет КАК Приоритет
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет" );
		
		Запрос.УстановитьПараметр("Должность", Сотр.Должность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Пустое", Справочники.ПодразделенияКомпании.ПустаяСсылка());
		
		Выб=Запрос.Выполнить().Выбрать();
		//->Diginova 04.10.2021
		Если НЕ Выб.Количество() тогда
			УчитываетОтработанноеВремя = Истина;
			Сообщить("Для некоторых сотрудников не определен параметр расчета коэффициента отработанного времени в составе KPI " + "
			| Будет применен расчет по умолчанию из ТУРВ",СтатусСообщения.Внимание);	
		КонецЕсли;
		//<-Diginova
		
		Если Выб.Следующий() Тогда
	//->Diginova 01.10.2021
			//Если не Выб.УчитыватьОтработанноеВремя Тогда
			//	Возврат 1;
			//КонецЕсли;
			УчитываетОтработанноеВремя = Выб.УчитыватьОтработанноеВремя;
	//<-Diginova
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДнейПоПлану=0 Тогда
		Сообщить("Не заполнен табель по "+Сотр);
		Возврат 1;
	Иначе
		
		Доля=ДнейПоФакту/ДнейПоПлану;
		
		Если Доля>1 Тогда
			Доля=1;
		КонецЕсли;
		
		Возврат Доля;
		
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Создается=ЭтоНовый();
	Если Не ЭтотОбъект.Ссылка.ПометкаУдаления и НЕ ЭтотОбъект.ПометкаУдаления Тогда
		
		Если Периодичность=Перечисления.Периодичность.Квартал Тогда
			Пер=НачалоМесяца(КонецКвартала(ПериодПланирования));
		ИначеЕсли Периодичность=Перечисления.Периодичность.Год Тогда
			Пер=НачалоМесяца(КонецГода(ПериодПланирования));
		Иначе
			пер=НачалоМесяца(ПериодПланирования);
		КонецЕсли;
		
		//Пер=ДобавитьМесяц(Пер, Мотивация.ПолучитьПериодыРасчета(ПериодПланирования,Периодичность,Подразделение)); 
		
		Запрос=Новый запрос("ВЫБРАТЬ
		|	РасчетВыполненияKPI.Ссылка,
		|	РасчетВыполненияKPI.Периодичность
		|ИЗ
		|	Документ.РасчетВыполненияKPI КАК РасчетВыполненияKPI
		|ГДЕ
		|	РасчетВыполненияKPI.Ссылка <> &Ссылка
		|	И РасчетВыполненияKPI.ПериодПланирования = &Период
		|	И РасчетВыполненияKPI.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И РасчетВыполненияKPI.Периодичность = &Периодичность
		|	И НЕ РасчетВыполненияKPI.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Период",ПериодПланирования);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Периодичность",Периодичность);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			Сообщить("Уже существует аналогичный документ за этот период "+Выб.Ссылка);
			ЗаписьЖурналаРегистрации("Ошибка создания расчет переменной части ФОТ", УровеньЖурналаРегистрации.Предупреждение, , Ссылка, "Уже существует аналогичный документ за этот период "+Выб.Ссылка); 
			Отказ=истина;
		КонецЕсли;
		
		Запрос=Новый запрос("ВЫБРАТЬ
		|	ПлановыеЗначенияKPI.Ссылка
		|ИЗ
		|	Документ.ПлановыеЗначенияKPI КАК ПлановыеЗначенияKPI
		|ГДЕ
		|	ПлановыеЗначенияKPI.ПериодПланирования = &ПериодПланирования
		|	И ПлановыеЗначенияKPI.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И ПлановыеЗначенияKPI.Проведен
		|	И ПлановыеЗначенияKPI.Периодичность = &Периодичность");
		
		Запрос.УстановитьПараметр("ПериодПланирования",ПериодПланирования);
		Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Периодичность",Периодичность);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если НЕ Выб.Следующий() Тогда
			
			Сообщить("Расчет выполнения KPI по "+ПодразделениеКомпании+" от "+Дата+ " не создан, так как нет плана на период");
			
			ЗаписьЖурналаРегистрации("Ошибка создания расчета выполнения KPI", УровеньЖурналаРегистрации.Предупреждение, , Ссылка, "Расчет выполнения KPI по "+ПодразделениеКомпании+" от "+Дата+ " не создан, так как нет плана на период"); 
			
			Отказ=истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ФОТ.Количество()=0 Тогда
		Движения.Начисления.Очистить();
		Движения.НачисленияKPI.Очистить();
		Движения.ДетализацияВыработки.Очистить();
		Движения.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ПеременнаяЧастьФОТ
	Если ПустаяСтрока(ЭтотОбъект.ПодразделениеКомпании) Тогда
		Отказ=истина;
		Сообщить("Не заполнено подразделение компании");
		Возврат;
	КонецЕсли;
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	КонецЕсли;
	
	//КонПериода=ДобавитьМесяц(КонПериода,ДляРасчетаKPI.ПолучитьПериодыРасчета(ПериодПланирования,Периодичность,Подразделение)); 
	
	Движения.Начисления.Записывать = Истина;
	Движения.Начисления.Очистить();
	
	Для Каждого ТекСтрокаФОТ Из ФОТ Цикл
		
		Движение = Движения.Начисления.Добавить();
		Движение.Период =НачалоМесяца(КонПериода);
		Движение.Сотрудник = ТекСтрокаФОТ.Сотрудник;
		Движение.Должность = ТекСтрокаФОТ.Должность;
		Движение.Периодичность = Периодичность;
		Движение.Сумма = ТекСтрокаФОТ.Сумма;
		Движение.Премия = ТекСтрокаФОТ.Премия;
		Движение.Оклад = ТекСтрокаФОТ.Оклад;
		Движение.СуммаПоСдельнымНарядам = ТекСтрокаФОТ.ФондПоСдельнымНарядам;
		Движение.ДоляОтработанногоВремени=ТекСтрокаФОТ.ДоляОтработанногоВремени;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация=Организация;
		Движение.ОДП=ТекСтрокаФОТ.ОДП;
		Движение.ОДФ=ТекСтрокаФОТ.ОДФ;
		Движение.Мотивация = ТекСтрокаФОТ.ПремияБезКорректировки;
		Движение.ФОТпоШР = ТекСтрокаФОТ.ФОТпоШР;
		
	КонецЦикла;
	
	// регистр РасчетыKPI
	Движения.НачисленияKPI.Записывать = Истина;
	Движения.НачисленияKPI.Очистить();
	
	Для Каждого ТекСтрокаРасшифровка Из Детализация Цикл
		
		Движение = Движения.НачисленияKPI.Добавить();
		Движение.Период = НачалоМесяца(КонПериода);
		Движение.Сотрудник = ТекСтрокаРасшифровка.Сотрудник;
		Движение.Должность = ДолжностьСотрудника(ТекСтрокаРасшифровка.Сотрудник);
		Движение.Периодичность = Периодичность;
		Движение.KPI = ТекСтрокаРасшифровка.KPI;
		Движение.База = ложь;
		Движение.Факт = ТекСтрокаРасшифровка.Факт;
		Движение.План = ТекСтрокаРасшифровка.План;
		Движение.Значение= ТекСтрокаРасшифровка.Значение;
		Движение.Вес=ТекСтрокаРасшифровка.Вес;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация=Организация;
		Движение.Сумма=ТекСтрокаРасшифровка.Сумма;
		Движение.ПроцентВыполненияФакт=ТекСтрокаРасшифровка.ФактПлан;
		Движение.ПроцентВыполненияПремиальный=ТекСтрокаРасшифровка.Значение;
		
	КонецЦикла;
	
	// регистр РасчетыKPI
	Для Каждого ТекСтрокаПремиальныйФонд Из РезультатыРасчета Цикл
		
		Движение = Движения.НачисленияKPI.Добавить();
		Движение.Период = НачалоМесяца(КонПериода);
		Движение.Сотрудник = ТекСтрокаПремиальныйФонд.Сотрудник;
		Движение.Должность = ДолжностьСотрудника(ТекСтрокаПремиальныйФонд.Сотрудник);
		Движение.Периодичность = Периодичность;
		Движение.KPI = ТекСтрокаПремиальныйФонд.ЦелевыеПоказатели;
		Движение.База = истина;
		Движение.Факт = ТекСтрокаПремиальныйФонд.СуммаЦелевыхПоказателей;
		Движение.План=ТекСтрокаПремиальныйФонд.ПланЦелевыхПоказателей;
		Движение.Значение=ТекСтрокаПремиальныйФонд.ИтоговыйРасчет;
		Движение.Организация=Организация;
		
		Если ТекСтрокапремиальныйФонд.Неактивно Тогда
			Движение.Вес=0;
		Иначе
			Движение.Вес=100;
		КонецЕсли;
		
		Движение.КоэффициентБЧ=ТекСтрокаПремиальныйФонд.Коэффициент;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		
		Движение.СуммаКМ=ТекСтрокаПремиальныйФонд.СуммаКМ;
		Движение.КоэффициентПремирования= ?(ТекСтрокаПремиальныйФонд.КоэффициентПремирования<>0, ТекСтрокаПремиальныйФонд.КоэффициентПремирования*100,ТекСтрокаПремиальныйФонд.КоэффициентПремирования);

		Если НЕ ТекСтрокаПремиальныйФонд.СуммаЦелевыхПоказателей = 0 
			И НЕ ТекСтрокаПремиальныйФонд.ПланЦелевыхПоказателей = 0 Тогда
			
			Если ТекСтрокаПремиальныйФонд.ЦелевыеПоказатели.Обратный Тогда
				
				Движение.ПроцентВыполненияФакт=(ТекСтрокаПремиальныйФонд.ПланЦелевыхПоказателей/ТекСтрокаПремиальныйФонд.СуммаЦелевыхПоказателей)*100;
				
			Иначе
				
				Движение.ПроцентВыполненияФакт=(ТекСтрокаПремиальныйФонд.СуммаЦелевыхПоказателей/ТекСтрокаПремиальныйФонд.ПланЦелевыхПоказателей)*100;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Движение.ПроцентВыполненияПремиальный=ТекСтрокаПремиальныйФонд.ПроцентВыполнения;
		
	КонецЦикла;
	
	// регистр РасшифровкаПоСдельнымНарядам 
	Движения.ДетализацияВыработки.Записывать = Истина;
	Движения.ДетализацияВыработки.Очистить();
	
	Для Каждого ТекС Из  ДетализацияВыработки Цикл
		
		Движение = Движения.ДетализацияВыработки.Добавить();
		Движение.Период = НачалоМесяца(КонПериода);
		Движение.Сотрудник = ТекС.Сотрудник;
		Движение.ВидРемонта=ТекС.ВидРемонта;
		Движение.ВидРабот=ТекС.ВидРабот;
		Движение.Подразделение=ТекС.Подразделение;
		Движение.Цех=ТекС.Цех;
		Движение.ЗарплатныйЧас=ТекС.СтоимостьЗаЧас;
		Движение.Коэффициент=ТекС.Коэффициент+ТекС.Надбавка;
		Движение.Надбавка=ТекС.Надбавка;
		Движение.Выработка=ТекС.Количество;
		Движение.Сумма=ТекС.Сумма;
		Движение.Организация=Организация;
		Движение.Должность=ТекС.Должность;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтавкуСотрудника(КонПериода,Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнформацияОФОТСрезПоследних.Период КАК Период,
	|	ИнформацияОФОТСрезПоследних.Сотрудник КАК Сотрудник,
	|	ИнформацияОФОТСрезПоследних.Подразделение КАК Подразделение,
	|	ИнформацияОФОТСрезПоследних.Должность КАК Должность,
	|	ИнформацияОФОТСрезПоследних.СуммаОклада КАК СуммаОклада,
	|	ИнформацияОФОТСрезПоследних.Ставка КАК Ставка
	|ИЗ
	|	РегистрСведений.ИнформацияОФОТ.СрезПоследних(
	|			&НаДату,
	|			Сотрудник = &Сотрудник
	|				И Подразделение = &Подразделение
	|				И Должность = &Должность) КАК ИнформацияОФОТСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", КонецМесяца(КонПериода));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Сотрудник.Подразделение);
	Запрос.УстановитьПараметр("Должность", Сотрудник.Должность);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если РезультатЗапроса.Пустой() 
		ИЛИ Документы.СоставKPI.НеУчитыватьСтавку(Сотрудник.Должность, Сотрудник.Подразделение) Тогда
		
		Ставка=1;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.Ставка=0 Тогда
			
			Ставка=1;
			
		Иначе
			
			Ставка=ВыборкаДетальныеЗаписи.Ставка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ставка;
	
КонецФункции

Функция ПечатьВедомости() Экспорт 
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Ведомость");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");						
	ОбластьШапка.Параметры.Организация = Организация;
	ОбластьШапка.Параметры.Номер = Номер;
	ОбластьШапка.Параметры.Дата = Формат(Дата,"ДЛФ=Д");
	ОбластьШапка.Параметры.Подразделение = ПодразделениеКомпании;
	
	Если Периодичность = Перечисления.Периодичность.Месяц Тогда
		ОбластьШапка.Параметры.ПериодНачисления = ПредставлениеПериода(ПериодПланирования,КонецМесяца(ПериодПланирования));
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда	
		ОбластьШапка.Параметры.ПериодНачисления = ПредставлениеПериода(НачалоКвартала(ПериодПланирования),КонецКвартала(ПериодПланирования));
	ИначеЕсли Периодичность = Перечисления.Периодичность.Год Тогда	
		ОбластьШапка.Параметры.ПериодНачисления = ПредставлениеПериода(НачалоГода(ПериодПланирования),КонецГода(ПериодПланирования));	
	КонецЕсли;	
	
	СтруктураОтбора=Новый Структура("Организация,Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Дата,СтруктураОтбора);
	
	Если ЗначениеЗаполнено(СтруктураСведений.Значение) тогда
		ОбластьШапка.Параметры.Долж = СтруктураСведений.Значение.Должность;
	КонецЕсли;
	
	ОбластьШапка.Параметры.ГенДиректор = Мотивация.ФИО(СтруктураСведений.Значение);
	
	ТабДок.Вывести(ОбластьШапка);				
	
	// ------ строка ------	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТаблицаФОТ = ФОТ.Выгрузить();
	
	Сч=1;
	
	Для Каждого СтрокаТаблицы Из ТаблицаФОТ Цикл
		
		ОбластьСтрока.Параметры.нпп = Сч;
		
		Сч=Сч+1;
		
		ОбластьСтрока.Параметры.Сотрудник=СтрокаТаблицы.Сотрудник;
		ОбластьСтрока.Параметры.Должность=СтрокаТаблицы.Должность;
		ОбластьСтрока.Параметры.Оклад=СтрокаТаблицы.Оклад;
		ОбластьСтрока.Параметры.ДатаПриема=СтрокаТаблицы.Сотрудник.ДатаПриема;
		ОбластьСтрока.Параметры.ВсегоДней=СтрокаТаблицы.ОДП;
		ОбластьСтрока.Параметры.Отработано=СтрокаТаблицы.ОДФ;
		ОбластьСтрока.Параметры.КРаб=СтрокаТаблицы.ДоляОтработанногоВремени;
		ОбластьСтрока.Параметры.ФотПоШР=СтрокаТаблицы.ФОТпоШР;
		ОбластьСтрока.Параметры.Премия=СтрокаТаблицы.Премия;
		ОбластьСтрока.Параметры.Мотивация=СтрокаТаблицы.ПремияБезКорректировки;
		ОбластьСтрока.Параметры.ДопПремия=СтрокаТаблицы.ДопПремия;
		ОбластьСтрока.Параметры.ИтогоЗП=СтрокаТаблицы.СуммаСКорректировкой;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПодвал.Параметры.ИтогоФОТ = ТаблицаФОТ.Итог("ФОТпоШР");
	ОбластьПодвал.Параметры.ИтогоПремия = ТаблицаФОТ.Итог("Премия");
	ОбластьПодвал.Параметры.ИтогоМотивация = ТаблицаФОТ.Итог("ПремияБезКорректировки");
	ОбластьПодвал.Параметры.ИтогоДопПремия = ТаблицаФОТ.Итог("ДопПремия");
	ОбластьПодвал.Параметры.ВсегоЗП = ТаблицаФОТ.Итог("СуммаСКорректировкой");
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДок;
	
КонецФункции
