
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// // Получаем необходимую СКД.	НеобходимаяСКД = Неопределено;
	//Если НЕ ЭтотОбъект.Выработка Тогда
	//	НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("ОбщийЛистРасчета");
	//ИначеЕсли ЭтотОбъект.Выработка Тогда
	//	НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("ВыборкаЛистРасчета");
	//КонецЕсли;
	
	 //// Устанавливаем выбранную СКД как основную.
	 //ЭтотОбъект.СхемаКомпоновкиДанных = НеобходимаяСКД;
	
	  //Устанавливаем настройки.
	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрПериодРегистрации = Новый ПараметрКомпоновкиДанных("ПериодРегистрации");
	 ЗначениеПараметрПериодРегистрации = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодРегистрации);
	 Если ЗначениеПараметрПериодРегистрации <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодРегистрации, ЭтотОбъект.ПериодРегистрации);
	 КонецЕсли;
	 
	 МасПериодичности = новый Массив;
	 МасПериодичности.Добавить(Перечисления.Периодичность.Месяц);
	 //МасПериодичности.Добавить(Перечисления.Периодичность.Квартал);
	 //МасПериодичности.Добавить(Перечисления.Периодичность.Год);

	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрПериодичность = Новый ПараметрКомпоновкиДанных("Периодичность");
	 ЗначениеПараметрПериодичность = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрПериодичность);
	 Если ЗначениеПараметрПериодичность <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрПериодичность, МасПериодичности);
	 КонецЕсли;
	
	 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	 ПараметрТолькоОрганизация = Новый ПараметрКомпоновкиДанных("Организация");
	 ЗначениеТолькоОрганизация = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоОрганизация);
	 Если ЗначениеТолькоОрганизация <> Неопределено Тогда
	     ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоОрганизация, ЭтотОбъект.Организация);
	 КонецЕсли;
 
	 СтруктураОтбора=Новый Структура("Организация, Объект", ЭтотОбъект.Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	 СтруктураСведений=РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(КонецМесяца(ЭтотОбъект.ПериодРегистрации),СтруктураОтбора);
	 
	 Если ЗначениеЗаполнено(СтруктураСведений.Значение) тогда
		 
		 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		 ПараметрТолькоДиректорДолжность = Новый ПараметрКомпоновкиДанных("ДолжностьДиректора");
		 ЗначениеТолькоДиректорДолжность = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоДиректорДолжность);
		 Если ЗначениеТолькоДиректорДолжность <> Неопределено Тогда
			 ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоДиректорДолжность, СтруктураСведений.Значение.Должность);
		 КонецЕсли;
		 
		 ПараметрыДанных = ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		 ПараметрТолькоДиректор = Новый ПараметрКомпоновкиДанных("Директор");
		 ЗначениеТолькоДиректор = ПараметрыДанных.НайтиЗначениеПараметра(ПараметрТолькоДиректор);
		 Если ЗначениеТолькоДиректор <> Неопределено Тогда
			 ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрТолькоДиректор, Мотивация.ФИО(СтруктураСведений.Значение));
		 КонецЕсли;
		 
	 КонецЕсли;

КонецПроцедуры


