#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печать
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ВводВЭксплуатацию" , "Ввод в эксплуатацию");
	СтруктураМакетов.Вставить("ОС1"               , "Акт ОС-1");
	СтруктураМакетов.Вставить("М11"               , "М-11 (Требование-накладная)");
	СтруктураМакетов.Вставить("ЭтикетокИЦенников" , "Печать этикеток и ценников");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти