#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// добавляет сообщение/предупреждение в список
// Сообщение - Строка. Само сообщение. 
// СтатусСообщения - Строка. Формата "СтатусСообщения&Группировка". 
//								СтатусСообщения - строка совпадающая с глобальным перечислением "СтатусыСообщения"
//								Группировка - некоторая строковая группировка сообщений
// Объект - сам объект.
// ОбъектДетализации - ссылка на некий объект для дополнительной детализации сообщения
Процедура ДобавитьСтрокуСообщения(Сообщение,СтатусСообщения,Объект,ОбъектДетализации) Экспорт
	// проверка
	Если Объект<>Неопределено И Объект.Ссылка<>Ссылка Тогда
		Ссылка=Объект.Ссылка;
	КонецЕсли;
	// добавляем
	НоваяСтрока=Сообщения.Добавить();
	НоваяСтрока.ГруппаСообщений="Прочие ошибки и предупреждения:";
	// разберем статус сообщения
	ВремСтатусСообщения=СтатусСообщения;
	Если ПустаяСтрока(СтатусСообщения) Тогда 
		ВремСтатусСообщения="Важное"
	ИначеЕсли Найти(ВремСтатусСообщения,"&")>0 Тогда
		НоваяСтрока.ГруппаСообщений=Сред(ВремСтатусСообщения,Найти(ВремСтатусСообщения,"&")+1);
		ВремСтатусСообщения=Лев(ВремСтатусСообщения,Найти(ВремСтатусСообщения,"&")-1);
	КонецЕсли;
	НоваяСтрока.СтатусСообщения=ВремСтатусСообщения;
	НоваяСтрока.Сообщение=Сообщение;
	НоваяСтрока.ОбъектДетализации=ОбъектДетализации;
КонецПроцедуры
#КонецЕсли