
&НаКлиенте
Процедура ПредставлениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодБюджета 	= ДобавитьМесяц(Объект.ПериодБюджета, ?(Направление, 1, -1));
	СтандартнаяОбработка 	= Ложь;                                                      
	
	ПредставлениеПериода 	= Формат(Объект.ПериодБюджета, "ДФ='MMMM yyyy ''г.'''");
	

КонецПроцедуры

&НаКлиенте
Процедура ДонорПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДонорПередНачаломИзменения(Элемент, Отказ)
//	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицы(Команда)   
	
	Если Объект.Донор.Количество() Тогда
		
		Ответ = Вопрос("Очистить табличные чати?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			Объект.Донор.Очистить();
						
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьТаблицыНаСервере();     
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыНаСервере()
	
	Если не ЗначениеЗаполнено(Объект.ПериодБюджета) Тогда
		
		Сообщить("Не указан период бюджета");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ПланДДС.Сценарий КАК Сценарий,
		|	БТ_ПланДДС.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(БТ_ПланДДС.Сумма) КАК Сумма,
		|	БТ_ПланДДС.Организация КАК Организация,
		|	БТ_ПланДДС.ПодразделениеКомпании КАК Подразделение
		|ПОМЕСТИТЬ Планы
		|ИЗ
		|	РегистрНакопления.БТ_ПланДДС КАК БТ_ПланДДС
		|ГДЕ
		|	БТ_ПланДДС.Период < &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	БТ_ПланДДС.Сценарий,
		|	БТ_ПланДДС.СтатьяДДС,
		|	БТ_ПланДДС.Организация,
		|	БТ_ПланДДС.ПодразделениеКомпании
		|
		|ИМЕЮЩИЕ
		|	СУММА(БТ_ПланДДС.Сумма) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение КАК СтруктурнаяЕдиницаПодразделение,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение.Организация КАК СтруктурнаяЕдиницаПодразделениеОрганизация,
		|	ПлатежныйКалендарьОбороты.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(ПлатежныйКалендарьОбороты.РасходФактОборот) КАК РасходФактОборот
		|ПОМЕСТИТЬ Факт
		|ИЗ
		|	РегистрНакопления.ПлатежныйКалендарь.Обороты(&НачПериода, &Период, , ) КАК ПлатежныйКалендарьОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежныйКалендарьОбороты.СтатьяДДС,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Планы.Сценарий КАК Сценарий,
		|	Планы.СтатьяДДС КАК СтатьяДДС,
		|	Планы.Организация КАК Организация,
		|	Планы.Подразделение КАК Подразделение,
		|	СУММА(Планы.Сумма - ЕстьNULL(Факт.РасходФактОборот,0)) КАК Сумма
		|ИЗ
		|	Планы КАК Планы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Факт КАК Факт
		|		ПО Планы.СтатьяДДС = Факт.СтатьяДДС
		|			И Планы.Организация = Факт.СтруктурнаяЕдиницаПодразделениеОрганизация
		|			И Планы.Подразделение = Факт.СтруктурнаяЕдиницаПодразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	Планы.Организация,
		|	Планы.Сценарий,
		|	Планы.СтатьяДДС,
		|	Планы.Подразделение"; 
	
	Запрос.УстановитьПараметр("Период", 		КонецМесяца(Объект.ПериодБюджета)); 
	Запрос.УстановитьПараметр("НачПериода", 		НачалоМесяца(Объект.ПериодБюджета));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.Донор.Добавить(), ВыборкаДетальныеЗаписи);
		//ЗаполнитьЗначенияСвойств(Объект.Реципиент.Добавить(), ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Донор.Очистить();;
	Объект.Реципиент.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Если Объект.Реципиент.Итог("Сумма") > Объект.Донор.Итог("Сумма") Тогда
		
		Отказ = истина;
		Сообщить("В таблице Реципиент, сумма превышает сумму донора, запись отменена");
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Донор.Сценарий КАК Сценарий,
		|	Донор.СтатьяДДС КАК СтатьяДДС,
		|	Донор.Сумма КАК Сумма,
		|	Донор.Организация КАК Организация,
		|	Донор.Подразделение КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ Донор
		|ИЗ
		|	&Донор КАК Донор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БТ_ПланДДС.Сценарий КАК Сценарий,
		|	БТ_ПланДДС.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(БТ_ПланДДС.Сумма) КАК Сумма,
		|	БТ_ПланДДС.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	БТ_ПланДДС.Организация КАК Организация
		|ПОМЕСТИТЬ ВБазе
		|ИЗ
		|	РегистрНакопления.БТ_ПланДДС КАК БТ_ПланДДС
		|ГДЕ
		|	БТ_ПланДДС.Период < &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	БТ_ПланДДС.Сценарий,
		|	БТ_ПланДДС.СтатьяДДС,
		|	БТ_ПланДДС.ПодразделениеКомпании,
		|	БТ_ПланДДС.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(БТ_ПланДДС.Сумма) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Донор.Сценарий КАК Сценарий,
		|	Донор.СтатьяДДС КАК СтатьяДДС,
		|	ЕСТЬNULL(ВБазе.Сумма, 0) - Донор.Сумма КАК Превышение,
		|	Донор.Организация КАК Организация,
		|	Донор.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	Донор КАК Донор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВБазе КАК ВБазе
		|		ПО Донор.Сценарий = ВБазе.Сценарий
		|			И Донор.СтатьяДДС = ВБазе.СтатьяДДС
		|			И Донор.Организация = ВБазе.Организация
		|			И Донор.ПодразделениеКомпании = ВБазе.ПодразделениеКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Сценарий КАК Сценарий,
		|	Итог.СтатьяДДС КАК СтатьяДДС,
		|	Итог.Превышение КАК Превышение,
		|	Итог.Организация КАК Организация,
		|	Итог.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	Итог.Превышение < 0"; 
	
	Запрос.УстановитьПараметр("Период", 		КонецМесяца(Объект.ПериодБюджета)-1);
	Запрос.УстановитьПараметр("Донор", 			Объект.Донор.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отказ = истина;
		Сообщить(СтрШаблон("В таблице дохов привышение:
			| - Статья ДДС: %1
			| - Сценарий: %2
			| - Организация: %3
			| - ПодразделениеКомпании: %4
			| - на сумму: %5",
			Выборка.СтатьяДДС, 
			Выборка.Сценарий, 
			Выборка.Организация, 
			Выборка.ПодразделениеКомпании, 
			-Выборка.Превышение));
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая()  Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериодБюджета) Тогда
		
		Объект.ПериодБюджета 	= НачалоМесяца(ТекущаяДата());
		ПредставлениеПериода 	= Формат(Объект.ПериодБюджета, "ДФ='MMMM yyyy ''г.'''");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодБюджетаРегулирование(Элемент, Направление, СтандартнаяОбработка)   
	
	Объект.ПериодБюджета 	= ДобавитьМесяц(Объект.ПериодБюджета, ?(Направление, 1, -1));
	СтандартнаяОбработка 	= Ложь;
	// Вставить содержимое обработчика.
КонецПроцедуры
