// Функция обновления кэша статусов документов
Функция ОбновитьКэшСтатусов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналОтправкиВЕАИСТО.Документ,
	|	ЖурналОтправкиВЕАИСТО.Статус
	|ИЗ
	|	РегистрСведений.ЖурналОтправкиВЕАИСТО КАК ЖурналОтправкиВЕАИСТО
	|ГДЕ
	|	//ЖурналОтправкиВЕАИСТО.Статус = &Статус И
	|	ЖурналОтправкиВЕАИСТО.Документ.Проведен = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналОтправкиВЕАИСТО.Документ,
	|	ЖурналОтправкиВЕАИСТО.Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДокументаТО.Отправлено);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции

Функция ПолучитьНомерКартчки(Ссылка) Экспорт
	Если обЗначениеНеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналОтправкиВЕАИСТО.НомерКаточкиНаСервере
	|ИЗ
	|	РегистрСведений.ЖурналОтправкиВЕАИСТО КАК ЖурналОтправкиВЕАИСТО
	|ГДЕ
	|	ЖурналОтправкиВЕАИСТО.Документ = &Ссылка";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Если НЕ обЗначениеНеЗаполнено(Результат.НомерКаточкиНаСервере) Тогда
			Возврат Результат.НомерКаточкиНаСервере;
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
КонецФункции

// печать из арма ЕАИС ТО
Функция ПечатьДубликатаДиагностическойКарты(СтрПечать) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ДиагностическаяКарта");
	ОбластьМакета = Макет.ПолучитьОбласть("ЛицеваяСторона");
	
	Если ЗначениеЗаполнено(СтрПечать.ДатаГодности) Тогда
		ДатаСтрокой = СтрЗаменить(Лев(СтрПечать.ДатаГодности,10),".","");
		ДатаСтрокой = Сред(ДатаСтрокой,7,2)+Сред(ДатаСтрокой,5,2)+Сред(ДатаСтрокой,1,4);
		Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
			ОбластьМакета.Параметры["С"+Сч] = Сред(ДатаСтрокой,Сч,1);
		КонецЦикла;
	
	КонецЕсли;
	
	Попытка
		ОбластьМакета.Параметры.Оператор = СтрПечать.ПолноеИмяОрганизации +" ("+СтрПечать.КраткоеИмяОрганизации+")";
	Исключение
	КонецПопытки;
	
	Попытка
		ТипПроверки = СтрПечать.ТипПроверки;
	Исключение
		ТипПроверки = "Вторичная"
	КонецПопытки;
	Если ТипПроверки = "Первичная" Тогда
		ОбластьМакета.Параметры.Первичная = "x";
		ОбластьМакета.Параметры.Повторная = "";
	Иначе
		ОбластьМакета.Параметры.Первичная = "";
		ОбластьМакета.Параметры.Повторная = "х";
	КонецЕсли;
	
	Попытка
		ОбластьМакета.Параметры.Оператор = ОбластьМакета.Параметры.ПолноеИмяОрганизации = СтрПечать.ПолноеИмяОрганизации + " ("+ СтрПечать.КраткоеИмяОрганизации +").";
	Исключение
	КонецПопытки;
	
	ОбластьМакета.Параметры.ГосНомер = СтрПечать.ГосНомер;
	ОбластьМакета.Параметры.Модель = СтрПечать.Марка + " " + СтрПечать.Модель;
	ОбластьМакета.Параметры.VIN = СтрПечать.Vin;
	ОбластьМакета.Параметры.КатегорияТС = СтрПечать.КатегорияТС2;
	Попытка
		ОбластьМакета.Параметры.ГодВыпуска = СтрПечать.ГодВыпуска;
	Исключение
	КонецПопытки;
	Попытка
		ОбластьМакета.Параметры.ПТС = "ПТС " + СтрПечать.СерияПТС + " №" + СтрПечать.НомерПТС + " от " + Лев(СтрПечать.ДатаПТС,10);
	Исключение
	КонецПопытки;
	ОбластьМакета.Параметры.НомерКузова = СтрПечать.НомерКузова;
	
	Попытка
		ТабДетальныеЗаписи  = СтрПечать.ТаблицаРезультатовПроверки;
		ЕстьДетальныеЗаписи = ТабДетальныеЗаписи.Количество() > 0;
	Исключение
		ЕстьДетальныеЗаписи = Ложь;
	КонецПопытки;
	
	ОбластьМакетаОбратнаяШапка    = Макет.ПолучитьОбласть("ОборотнаяШапка");
	ОбластьМакетаОбратнаяСтрока   = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
	ОбластьМакетаТребованияШапка  = Макет.ПолучитьОбласть("ОборотнаяТребованияШапка");
	ОбластьМакетаТребованияСтрока = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
	
	Если НЕ ЕстьДетальныеЗаписи Тогда
		Сч = 1;
		Пока Сч <= 67 Цикл
			ОбластьМакета.Параметры["Показатель"+Сч] = " ";
			Сч = Сч + 1;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьМакета);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДок.Вывести(ОбластьМакетаОбратнаяШапка);
		Сч = 0;
		Пока Сч < 8 Цикл
			ТабДок.Вывести(ОбластьМакетаОбратнаяСтрока);
			Сч = Сч + 1;
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьМакетаТребованияШапка);
		Сч = 0;
		Пока Сч < 8 Цикл
			ТабДок.Вывести(ОбластьМакетаТребованияСтрока);
			Сч = Сч + 1;
		КонецЦикла;
	Иначе
		КоличествоСтрок = ТабДетальныеЗаписи.Количество();
		Для Каждого стрДетальнаяЗапись Из ТабДетальныеЗаписи Цикл
			ОбластьМакета.Параметры["Показатель"+стрДетальнаяЗапись.НомерТеста] = ?(стрДетальнаяЗапись.Результат = 0," ","х");
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьМакета);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДок.Вывести(ОбластьМакетаОбратнаяШапка);
		Для Каждого стрДетальнаяЗапись Из ТабДетальныеЗаписи Цикл
			Если стрДетальнаяЗапись.Результат = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Тест = Справочники.ТребованияКТранспортнымСредствам.НайтиПоРеквизиту("Номер",стрДетальнаяЗапись.НомерТеста);
			ОбластьМакетаОбратнаяСтрока.Параметры.НГраница   = Тест.ЗначениеМин;
			ОбластьМакетаОбратнаяСтрока.Параметры.ВГраница   = Тест.ЗначениеМакс;
			ОбластьМакетаОбратнаяСтрока.Параметры.Требование = Лев(Тест.НаименованиеПолное,1000);
			ОбластьМакетаОбратнаяСтрока.Параметры.Номер      = Тест.Номер;
			
			ТабДок.Вывести(ОбластьМакетаОбратнаяСтрока);
		КонецЦикла;
		
		Для Сч = (КоличествоСтрок+1) По 8 Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
			ТабДок.Вывести(ОбластьМакета);
		КонецЦикла;

		
		ТабДок.Вывести(ОбластьМакетаТребованияШапка);
		Для Каждого стрДетальнаяЗапись Из ТабДетальныеЗаписи Цикл
			Если стрДетальнаяЗапись.Результат = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Тест = Справочники.ТребованияКТранспортнымСредствам.НайтиПоРеквизиту("Номер",стрДетальнаяЗапись.НомерТеста);
			ОбластьМакетаТребованияСтрока.Параметры.Деталь     = Тест.Родитель.Наименование;
			ОбластьМакетаТребованияСтрока.Параметры.Требование = Лев(Тест.НаименованиеПолное,1000);
			ОбластьМакетаТребованияСтрока.Параметры.Номер      = Тест.Номер;
			
			ТабДок.Вывести(ОбластьМакетаТребованияСтрока);
		КонецЦикла;
		
		Для Сч = (КоличествоСтрок+1) По 8 Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
			ТабДок.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли;
	
	//
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяПодвал");
	ОбластьМакета.Параметры.Заполнить(СтрПечать);
	//ОбластьМакета.Параметры.МассаБезНагрузки = МассаБезНагрузки;
	//ОбластьМакета.Параметры.ТипТоплива = ТипТоплива;
	//ОбластьМакета.Параметры.ТипТормознойСистемы = ТипПриводаТормознойСистемы;
	//ОбластьМакета.Параметры.МаркаШин = МаркаШин;
	//ОбластьМакета.Параметры.МаксимальнаяМасса = РазрешеннаяМаксимальнаяМасса;
	
	ОбластьМакета.Параметры.НомерЕАИСТО = СтрПечать.НомерВЕАИСТО;
	Попытка
		ОбластьМакета.Параметры.Автор = СтрПечать.ФамилияЭксперт + ?(ПустаяСтрока(СтрПечать.ФамилияЭксперт),""," ") + СтрПечать.ИмяЭксперт
		+ ?(ПустаяСтрока(СтрПечать.ФамилияЭксперт) И ПустаяСтрока(СтрПечать.ИмяЭксперт),""," ") + СтрПечать.ОтчествоЭксперт;
	Исключение
	КонецПопытки;
	
	Если НЕ обЗначениеНеЗаполнено(СтрПечать.ДатаДиагностики) Тогда
		ДатаСтрокой = СтрЗаменить(Лев(СтрПечать.ДатаДиагностики,10),".","");
		ДатаСтрокой = Сред(ДатаСтрокой,7,2)+Сред(ДатаСтрокой,5,2)+Сред(ДатаСтрокой,1,4);
		Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
			ОбластьМакета.Параметры["Д"+Сч] = Сред(ДатаСтрокой,Сч,1);
		КонецЦикла;
	КонецЕсли;
	Если СтрПечать.РезультатПроверки = "пройдено" Тогда
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Возможно);
	Иначе
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Невозможно);
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьМакета);
	
	Возврат ТабДок;
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ДиагностическаяКарта", "Диагностическая карта");
	Если ДокументСсылка.ХозОперация <> Справочники.ХозОперации.ТехническоеДиагностированиеДубликат Тогда
		СтруктураМакетов.Вставить("ДиагностическаяКартаПустая", "Диагностическая карта (незаполненная)");
	КонецЕсли;
	Если ДокументСсылка.ХозОперация = Справочники.ХозОперации.ТехническоеДиагностированиеПовторное Тогда
		СтруктураМакетов.Вставить("ДиагностическаяКартаПовторное", "Диагностическая карта (повторный осмотр)");
	КонецЕсли;
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()

#КонецОбласти
