// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра "Операции прослеживаемых товаров"
//
// Возвращаемое значение:
//  Строка - текст запроса
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
	|	ОстаткиАвтомобилей.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОстаткиАвтомобилей.ГТД.РНПТ
	|	И ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей";
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПоступлениеАвтомобилей", "Приходная накладная");
	СтруктураМакетов.Вставить("АктПриема", "Акт приема на комиссию");
	СтруктураМакетов.Вставить("ДоговорКомиссии", "Договор комиссии");
	СтруктураМакетов.Вставить("ТОРГ1",  "ТОРГ-1 (Акт о приемке товара)");
	СтруктураМакетов.Вставить("ТОРГ2", "ТОРГ-2 (Акт о расхождении по количеству и качеству)");
	СтруктураМакетов.Вставить("ТОРГ4",  "ТОРГ-4 (Акт о приемке товаров без счета поставщика)");
	СтруктураМакетов.Вставить("ТОРГ12", "ТОРГ-12 (Товарная накладная за поставщика)");
	СтруктураМакетов.Вставить("ТОРГ13", "ТОРГ-13 (накладная на внутреннее перемещение)");
	СтруктураМакетов.Вставить("М4", "М-4 (Приходный ордер)");
	СтруктураМакетов.Вставить("МХ1","МХ-1 (Акт о приеме-передаче ТМЦ)");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти