
Функция АдресСервераСписокВыбора() Экспорт
	Список = Новый СписокЗначений;
	//Список.Добавить("193.9.246.3:8080", "Демо-сервер: ""193.9.246.3:8080""");
	Список.Добавить("alfa.rarus-cloud.ru", "Основной: ""alfa.rarus-cloud.ru""");
	Возврат Список;
КонецФункции

Функция ОписаниеСервиса() Экспорт
	Возврат "Сервис ""Альфа-Авто: ""Помощник продаж"" предоставляет доступ к иллюстрированным оригинальным каталогам автопроизводителей.
			|
			|Позволяет получать информации про автозапчасти (такую как аналоги, применяемость, технические характеристики автозапчастей) непосредственно в конфигурации.
			|
			|Предоставляет доступ к онлайн прайс-листам различных поставщиков.
			|
			|Сохраняет информацию о подбранных для автомобиля деталях и идентификации автомобиля в каталогах.";
КонецФункции

Функция СоответствиеСтатусовПользователя()
	
	СтатусыПользователя = Новый Соответствие;
	СтатусыПользователя.Вставить(0, Новый Структура("Заголовок, Описание, Ошибка", "Доступ запрещен",, Ложь));
	СтатусыПользователя.Вставить(1, Новый Структура("Заголовок, Описание, Ошибка", "Не указан логин",, Истина));
	СтатусыПользователя.Вставить(2, Новый Структура("Заголовок, Описание, Ошибка", "Ожидание авторизации",, Ложь));
	СтатусыПользователя.Вставить(3, Новый Структура("Заголовок, Описание, Ошибка", "Авторизован",, Ложь)); // Ок
	СтатусыПользователя.Вставить(4, Новый Структура("Заголовок, Описание, Ошибка", "Отказ от авторизации",, Ложь));
	СтатусыПользователя.Вставить(5, Новый Структура("Заголовок, Описание, Ошибка", "Ошибка авторизации",, Истина)); // Err
	
	Возврат СтатусыПользователя;
	
КонецФункции

Функция ОписаниеСтатусаПользователя(Знач СтатусПользователя) Экспорт
	
	Возврат СоответствиеСтатусовПользователя().Получить(СтатусПользователя);
	
КонецФункции

Функция СоответствиеСтатусовСервера()
	
	СтатусыСервера = Новый Соответствие;
	СтатусыСервера.Вставить(0, Новый Структура("Заголовок, Описание, Ошибка", "Сервис не используется в системе",, Ложь));
	СтатусыСервера.Вставить(1, Новый Структура("Заголовок, Описание, Ошибка", "Не указаны данные партнера",, Истина)); // Партнер еще не подключен к сервису?
	СтатусыСервера.Вставить(2, Новый Структура("Заголовок, Описание, Ошибка", "Параметры заполнены (статус не проверялся)",, Ложь)); // Статус сервера не проверялся
	СтатусыСервера.Вставить(3, Новый Структура("Заголовок, Описание, Ошибка", "Сервер не доступен",, Истина)); // Пинг не прошел
	СтатусыСервера.Вставить(4, Новый Структура("Заголовок, Описание, Ошибка", "Сервис ОК",, Ложь)); // Ок, Пинг партнера прошел
	СтатусыСервера.Вставить(5, Новый Структура("Заголовок, Описание, Ошибка", "Ошибка авторизации партнера",, Истина)); // Err, Пинг партнера не прошел
	СтатусыСервера.Вставить(6, Новый Структура("Заголовок, Описание, Ошибка", "Доступ запрещен",, Истина)); // Err, Пинг партнера прошел, но запрещен доступ
	
	Возврат СтатусыСервера;
	
КонецФункции

Функция ОписаниеСтатусаСервера(СтатусСервера) Экспорт
	
	Возврат СоответствиеСтатусовСервера().Получить(СтатусСервера);
	
КонецФункции

Функция ВыполнитьЗапросКСервису(Знач ИмяСервиса, Знач ИмяМетода, Знач ИмяМетода2, Знач ТелоЗапроса, Ошибка) Экспорт
	
	Возврат атСервер.ВыполнитьЗапросКСервису(ИмяСервиса, ИмяМетода, ИмяМетода2, ТелоЗапроса, Ошибка);
	
КонецФункции

Функция СоздатьHTTPСоединение(АвторизацияПартнера) Экспорт
	
	Возврат атСервер.СоздатьHTTPСоединение(АвторизацияПартнера);
	
КонецФункции

Функция ПолучитьНастройку(Объект, ВидНастройки) Экспорт 
	
	Возврат атСервер.ПолучитьНастройку(Объект, ВидНастройки, Ложь);
	
КонецФункции

Функция ПолучитьТаблицуСловарей() Экспорт
	
	ТаблицаСловарей = Новый ТаблицаЗначений;
	ТаблицаСловарей.Колонки.Добавить("Имя");               // Имя словаря в сервисе
	ТаблицаСловарей.Колонки.Добавить("Представление");
	ТаблицаСловарей.Колонки.Добавить("ИмяСправочника");    // Имя справочника 1С
	ТаблицаСловарей.Колонки.Добавить("СоздаватьВИБ");      // Создавать в 1С
	ТаблицаСловарей.Колонки.Добавить("СоздаватьВСервисе"); // Создавать в сервисе
	ТаблицаСловарей.Колонки.Добавить("ПолучатьСписок");    // Доступен метод список
	ТаблицаСловарей.Колонки.Добавить("РеквизитСинхронизации");
	ТаблицаСловарей.Колонки.Добавить("Автосинхронизация"); // Автоматически искать сопоставления
	ТаблицаСловарей.Колонки.Добавить("Автосоздание");      // Автоматически создавать новые объекты в ИБ
	ТаблицаСловарей.Колонки.Добавить("ФормаСписка");       // Форма администрирования словаря
	ТаблицаСловарей.Колонки.Добавить("ФормаОбъекта");      // Форма объекта словаря
	
	// Синхронизируемые словари     Имя,                Представление,               Имя1С,                    в ИБ,   в Сервисе, Список, Реквизит синхр, Автопоиск, Автосоздание, ФормаСписка, ФормаОбъекта
	ДобавитьСтроку(ТаблицаСловарей, "Валюты",           "(Общие) Валюты",            "Валюты",                 Ложь,   Ложь,      Истина, "Код",          Истина,    Неопределено, "Словари", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "ВебПрайсЛисты",    "(Общие) Веб прайс-листы",   "ПрайсЛистыКонтрагентов", Ложь,   Ложь,      Истина, "",             Ложь,      Неопределено, "Словари", "ОбъектВебПрайсЛист"); // СловарьВебПрайсЛисты 
	ДобавитьСтроку(ТаблицаСловарей, "Производители",    "(Общие) Производители",     "Производители",          Истина, Ложь,      Истина, "Наименование", Истина,    Неопределено, "Словари", "ОбъектПроизводитель");// СловарьПроизводители
	ДобавитьСтроку(ТаблицаСловарей, "Номенклатура",     "(Общие) Номенклатура",      "Номенклатура",           Истина, Ложь,      Ложь,   "Артикул",      Ложь,      Неопределено, "", "ОбъектНоменклатура"); // СловарьНоменклатура
	//ДобавитьСтроку(ТаблицаСловарей, "ТипыНоменклатуры", "(Общие) Типы номенклатуры", "ТипыНоменклатуры",       Истина, Ложь,      Истина, "Наименование", Истина,    Ложь,         "Словари", "ОбъектСервиса");      // СловарьТипыНоменклатуры
	ДобавитьСтроку(ТаблицаСловарей, "ТипыНоменклатуры", "(Общие) Типы номенклатуры", "ТипыНоменклатуры",       Истина, Ложь,      Истина, "Наименование", Истина,    Ложь,         "", "ОбъектСервиса");      // СловарьТипыНоменклатуры
	ДобавитьСтроку(ТаблицаСловарей, "ВидыСвойств",      "(Общие) Виды свойств",      "СвойстваОбъектов",       Истина, Ложь,      Ложь,   "Наименование", Истина,    Ложь,         "",        "ОбъектСервиса");      // СловарьТипыНоменклатуры
	ДобавитьСтроку(ТаблицаСловарей, "ЗначенияСвойств",  "(Общие) Значения свойств",  "ЗначенияСвойств",        Истина, Ложь,      Ложь,   "Наименование", Истина,    Истина,       "",        "ОбъектСервиса");      // СловарьТипыНоменклатуры
	
	//Словари, которых нет в системе Имя,          Представление,                Имя1С,в ИБ, в Сервисе, Список, Рекв, Автопоиск, Автосоздание, ФормаСписка, ФормаОбъекта
	ДобавитьСтроку(ТаблицаСловарей, "ПакетыУслуг", "(Сервис) Услуги (лицензии)", "",   Ложь, Ложь,      Истина, "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "Сервисы",     "(Сервис) Сервисы",           "",   Ложь, Ложь,      Истина, "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "Марки",       "(Сервис) Марки",             "",   Ложь, Ложь,      Истина, "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "Каталоги",    "(Сервис) Каталоги",          "",   Ложь, Ложь,      Истина, "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "Модели",      "(Сервис) Модели",            "",   Ложь, Ложь,      Ложь,   "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	ДобавитьСтроку(ТаблицаСловарей, "Модификации", "(Сервис) Модификации",       "",   Ложь, Ложь,      Ложь,   "",   Ложь,      Неопределено, "", "ОбъектСервиса");
	
	// Партнерские справочники      Имя,             Представление,             Имя1С,                   в ИБ, в Сервисе, Список, Реквизит, Автопоиск, Автосоздание, ФормаСписка, ФормаОбъекта
	ДобавитьСтроку(ТаблицаСловарей, "Подразделения", "(Партнер) Подразделения", "ПодразделенияКомпании", Ложь, Истина,    Истина, "",       Ложь,      Неопределено, "", "ОбъектСервиса"); // СловариПартнера
	ДобавитьСтроку(ТаблицаСловарей, "Пользователи",  "(Партнер) Пользователи",  "",                      Ложь, Истина,    Истина, "",       Ложь,      Неопределено, "Словари", "ОбъектСервиса"); // Словари
	ДобавитьСтроку(ТаблицаСловарей, "ПрайсЛисты",    "(Партнер) Прайс-листы",   "ВидыПрайсЛистов",       Ложь, Истина,    Истина, "",       Ложь,      Неопределено, "", "ОбъектСервиса"); // СловариПартнера
	ДобавитьСтроку(ТаблицаСловарей, "Автомобили",    "(Партнер) Автомобили",    "Автомобили",            Ложь, Истина,    Истина, "",       Ложь,      Неопределено, "", "ОбъектСервиса"); // СловариПартнера
	
	ТаблицаСловарей.Сортировать("Представление");
	
	Возврат ТаблицаСловарей;
	
КонецФункции

Процедура ДобавитьСтроку(Таблица, Имя, Представление, ИмяСправочника, СоздаватьВИБ, СоздаватьВСервисе, ПолучатьСписок, РеквизитСинхронизации, Автосинхронизация, Автосоздание, ФормаСписка, ФормаОбъекта)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Имя = Имя;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.ИмяСправочника = ИмяСправочника;
	НоваяСтрока.СоздаватьВИБ = СоздаватьВИБ;
	НоваяСтрока.СоздаватьВСервисе = СоздаватьВСервисе;
	НоваяСтрока.ПолучатьСписок = ПолучатьСписок;
	
	НоваяСтрока.РеквизитСинхронизации = РеквизитСинхронизации;
	НоваяСтрока.Автосинхронизация = Автосинхронизация;
	НоваяСтрока.Автосоздание = Автосоздание;
	НоваяСтрока.ФормаСписка = ФормаСписка;
	НоваяСтрока.ФормаОбъекта = ФормаОбъекта;
	
КонецПроцедуры

Функция ПолучитьНастройкуСинхронизацииПоУмолчанию(ИмяСловаря) Экспорт

	Результат = Новый Структура("ИмяСправочника, РеквизитСинхронизации, Автосинхронизация, Автосоздание", "", "", Ложь, Ложь);
	
	ТаблицаСловарей = ПолучитьТаблицуСловарей();
	СтрокаСловаря = ТаблицаСловарей.Найти(ИмяСловаря, "Имя");
	Если СтрокаСловаря <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, СтрокаСловаря);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьНастройкуСинхронизацииПоУмолчанию(ИмяСловаря)

Функция ПолучитьНастройкуСинхронизации(ИмяСловаря) Экспорт
	
	НастройкаСинхронизации = ПолучитьНастройкуСинхронизацииПоУмолчанию(ИмяСловаря);
	
	Если ЗначениеЗаполнено(НастройкаСинхронизации.ИмяСправочника) Тогда
		
		ЗначениеНастройки = ПолучитьНастройку(ИмяСловаря, "Автосинхронизация");
		Если Не ЗначениеНастройки = Неопределено Тогда
			НастройкаСинхронизации.Автосинхронизация = ЗначениеНастройки;
		КонецЕсли;

		ЗначениеНастройки = ПолучитьНастройку(ИмяСловаря, "Автосоздание");
		Если Не ЗначениеНастройки = Неопределено Тогда
			НастройкаСинхронизации.Автосоздание = ЗначениеНастройки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НастройкаСинхронизации;
	
КонецФункции
