Функция ОбязательныеРеквизиты() Экспорт
	СписокКолонок = Новый Массив;
	СписокКолонок.Добавить("Марка");
	СписокКолонок.Добавить("Модель");
	СписокКолонок.Добавить("Поколение");
	СписокКолонок.Добавить("Серия");
	//СписокКолонок.Добавить("Комплектация");
	СписокКолонок.Добавить("Модификация");
	СписокКолонок.Добавить("Цвет");
	СписокКолонок.Добавить("Отделка");

	Возврат СписокКолонок;
	
КонецФункции

Функция АналогичныйРеквизитАвто(Реквизит)
	Если Реквизит = "Марка" Тогда
		Возврат "БТ_МаркаАвто";
	ИначеЕсли Реквизит = "Модель" Тогда 
		Возврат "Модель"
	ИначеЕсли Реквизит = "Поколение" Тогда
		Возврат "ВариантКомплектации"
	ИначеЕсли Реквизит = "Серия" Тогда 
		Возврат "ВариантКомплектации"
	ИначеЕсли Реквизит = "Модификация" Тогда 
		Возврат "ВариантКомплектации"	
	ИначеЕсли Реквизит = "Комплектация" Тогда
		Возврат "ВариантКомплектации"	
	ИначеЕсли Реквизит = "Цвет" Тогда
		Возврат "Цвет"
	ИначеЕсли Реквизит = "Отделка" Тогда			
        Возврат "ТипСалона"
	КонецЕсли;	
КонецФункции	

Функция ПолучитьАналогичныйРеквизит(Реквизит, Запись, ВызовИзСправочника = Ложь) Экспорт

	_Модель = ?(Не ВызовИзСправочника, Запись.Модель1С, Запись.Модель);
	
	РеквизитАвто = "";
	Если ВызовИзСправочника Тогда
		РеквизитАвто = АналогичныйРеквизитАвто(Реквизит);	
	КонецЕсли; 
	
	Если Реквизит = "Марка" Тогда
		
		//Марка = ПолучитьАналогичныйРеквизитПоЗначению(Запись, "Модель1С", Реквизит);
		Марка = ПолучитьАналогичныйРеквизитПоЗначению(Запись, "Марка1С", Реквизит, РеквизитАвто);
		
		Если ЗначениеЗаполнено(Марка) Тогда
			
			Возврат Марка
			
		КонецЕсли;	
	ИначеЕсли Реквизит = "Модель" Тогда
		
		//Марка = ПолучитьАналогичныйРеквизитПоЗначению(Запись, "Модель1С", Реквизит);
		Марка = ПолучитьАналогичныйРеквизитПоЗначению(Запись, "Модель1С", Реквизит, РеквизитАвто);
		
		Если ЗначениеЗаполнено(Марка) Тогда
			
			Возврат Марка
			
		КонецЕсли;		
		
	ИначеЕсли Реквизит = "Отделка" Тогда	
		
		_Салон = ?(Не ВызовИзСправочника, Запись.Салон1С, Запись.ТипСалона);
		
		Если Не ЗначениеЗаполнено(_Салон) Тогда
			Возврат Неопределено;
		КонецЕсли;	             
		
		Отделка = ПолучитьАналогичнуюОтделку(_Модель, _Салон);
		
		Если ЗначениеЗаполнено(Отделка) Тогда
			
			Возврат Отделка;
			
		КонецЕсли;
		
	ИначеЕсли Реквизит = "Цвет" Тогда	
		_Цвет = ?(Не ВызовИзСправочника, Запись.Цвет1С, Запись.Цвет);
        
		Если Не ЗначениеЗаполнено(_Цвет) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Цвет = ПолучитьАналогичныйЦвет(_Модель, _Цвет);
		
		Если ЗначениеЗаполнено(Цвет) Тогда
			
			Возврат Цвет;
			
		КонецЕсли;	
	//	
	Иначе
	    _Комплектация = ?(Не ВызовИзСправочника, Запись.Комплектация1С, Запись.ВариантКомплектации);
	
		Если Не ЗначениеЗаполнено(_Комплектация) Тогда
			Возврат Неопределено;
		КонецЕсли;

	
		Модель = ПолучитьАналогичныйРеквизитПоЗначению(Запись, "Комплектация1С", Реквизит, РеквизитАвто);
		
		Если ЗначениеЗаполнено(Модель) Тогда
			
			Возврат Модель;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьАналогичныйРеквизитПоЗначению(Запись, Реквизит1С, Реквизит, Реквизит1САвто = "")
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилей.Марка КАК ИскомыйРеквизит
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |ГДЕ
	                      |	CRM_ВыгрузкаАвтомобилей.Поколение = &Значение
	                      |	И CRM_ВыгрузкаАвтомобилей.Марка <> &ПустоеЗначение");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Поколение", Реквизит1С);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Марка", Реквизит);
	Запрос.УстановитьПараметр("Значение", Запись[?(ПустаяСтрока(Реквизит1САвто), Реквизит1С, Реквизит1САвто)]);
	Запрос.УстановитьПараметр("ПустоеЗначение", ПустоеЗначениеТипаРеквизита(Реквизит));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ИскомыйРеквизит;
		
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьАналогичныйЦвет(Модель1С, Цвет1С)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилей.Цвет КАК Цвет
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |ГДЕ
	                      |	CRM_ВыгрузкаАвтомобилей.Модель1С = &Модель1С
						  |	И CRM_ВыгрузкаАвтомобилей.Цвет1С = &Цвет1С
	                      |	И CRM_ВыгрузкаАвтомобилей.Цвет <> &ПустоеЗначение");
	
	Запрос.УстановитьПараметр("Модель1С", Модель1С);
	Запрос.УстановитьПараметр("Цвет1С", Цвет1С);
	Запрос.УстановитьПараметр("ПустоеЗначение", Справочники.CRM_ЦветаАвтомобилей.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Цвет;
		
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьАналогичнуюОтделку(Модель1С, Салон1С)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилей.Отделка КАК Отделка
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |ГДЕ
	                      |	CRM_ВыгрузкаАвтомобилей.Модель1С = &Модель1С
						  |	И CRM_ВыгрузкаАвтомобилей.Салон1С = &Салон1С
	                      |	И CRM_ВыгрузкаАвтомобилей.Салон1С <> &ПустоеЗначение");
	
	Запрос.УстановитьПараметр("Модель1С", Модель1С);
	Запрос.УстановитьПараметр("Салон1С", Салон1С);
	Запрос.УстановитьПараметр("ПустоеЗначение", Справочники.CRM_ОтделкиСалона.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Отделка;
		
	КонецЕсли;	
	
КонецФункции

Функция ПустоеЗначениеТипаРеквизита(Реквизит)
	
	Если Реквизит = "Марка" Тогда
		Возврат Справочники.CRM_МаркиАвтомобилей.ПустаяСсылка();
	ИначеЕсли Реквизит = "Модель" Тогда
		Возврат Справочники.CRM_МоделиАвтомобилей.ПустаяСсылка();	
	ИначеЕсли Реквизит = "Поколение" Тогда
		Возврат Справочники.CRM_ПоколенияАвтомобилей.ПустаяСсылка();		
	ИначеЕсли Реквизит = "Серия" Тогда
		Возврат Справочники.CRM_СерииАвтомобилей.ПустаяСсылка();			
	ИначеЕсли Реквизит = "Комплектация" Тогда
		Возврат Справочники.CRM_КомплектацииАвтомобилей.ПустаяСсылка();				
	ИначеЕсли Реквизит = "Модификация" Тогда
		Возврат Справочники.CRM_МодификацииАвтомобилей.ПустаяСсылка();					
	КонецЕсли;	
КонецФункции