Перем ИсключаемыйАвтомобиль Экспорт;

Процедура ПередЗаписью(Отказ, Замещение)
	
	если обменданными.Загрузка  тогда 
		возврат;
	КонецЕсли;	
	
	СписокКолонок = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.ОбязательныеРеквизиты();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.Салон1С) И ЗначениеЗаполнено(Запись.Автомобиль.ТипСалона) Тогда
			Запись.Салон1С = Запись.Автомобиль.ТипСалона;
		КонецЕсли;	
		
		НельзяВыгружать = Ложь;
		Для Каждого Реквизит Из СписокКолонок Цикл
			
			Если Не ЗначениеЗаполнено(Запись[Реквизит]) Тогда
				
				АналогичныйРеквизит = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.ПолучитьАналогичныйРеквизит(Реквизит, Запись);
				
				Если ЗначениеЗаполнено(АналогичныйРеквизит) Тогда
					
					Запись[Реквизит] = АналогичныйРеквизит;
					
				Иначе		        
					
					НельзяВыгружать = Истина;
					
					Если Не Запись.НеВыгружать Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнены не все обязательные реквизиты для выгрузки - " + Реквизит);
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		Если Не Запись.НеВыгружать И НельзяВыгружать Тогда
			Запись.НеВыгружать = Истина;
		Иначе
			Если Не НельзяВыгружать И Не ЗначениеЗаполнено(Запись.ID) и Запись.НеВыгружать Тогда 
				Запись.НеВыгружать = Ложь
			КонецЕсли;	
		КонецЕсли;	
			
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение) 
	
	если обменданными.Загрузка  тогда
		возврат;
	КонецЕсли;	
	
	СписокКолонок = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.ОбязательныеРеквизиты();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(ИсключаемыйАвтомобиль) И Запись.Автомобиль = ИсключаемыйАвтомобиль Тогда
			Продолжить;
		КонецЕсли;	
		
		ЕстьКонтакт = Ложь;
		Для Каждого Колонка Из СписокКолонок Цикл
			
			Если ЗначениеЗаполнено(Запись[Колонка]) Тогда
				
				ЕстьКонтакт = Истина;
				Прервать;
				
			КонецЕсли;	
		КонецЦикла;	
		
		Если ЕстьКонтакт Тогда
			ЗаполнитьДанныеВАналогичныхЗаписях(Запись);
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ID) и Не Запись.НеВыгружать Тогда
			ВыгрузитьАвто(Запись.Автомобиль);
		КонецЕсли;	
	КонецЦикла;	

	
КонецПроцедуры   

Процедура ВыгрузитьАвто(Автомобиль)
	обр = обработки.БТ_црмОтправитьАвтомобильСПробегом.Создать();
	Обр.Автомобиль = Автомобиль;
	Обр.ОтправитьАвтомобилиCRM(Автомобиль);
КонецПроцедуры	

Процедура ЗаполнитьДанныеВАналогичныхЗаписях(Запись)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ВыгрузкаАвтомобилей.Автомобиль КАК Автомобиль
	                      |ИЗ
	                      |	РегистрСведений.CRM_ВыгрузкаАвтомобилей КАК CRM_ВыгрузкаАвтомобилей
	                      |ГДЕ
	                      |	(CRM_ВыгрузкаАвтомобилей.Автомобиль <> &Автомобиль
	                      |				И НЕ CRM_ВыгрузкаАвтомобилей.Принят
	                      |				И CRM_ВыгрузкаАвтомобилей.Марка = &ПустаяМарка
	                      |				И CRM_ВыгрузкаАвтомобилей.Марка1С = &Марка1С
	                      |				И &Марка <> &ПустаяМарка
	                      |			ИЛИ CRM_ВыгрузкаАвтомобилей.Модель1С = &Модель1С
	                      |				И (&Модель <> &ПустаяМодель
	                      |						И CRM_ВыгрузкаАвтомобилей.Модель = &ПустаяМодель
	                      |					ИЛИ &Поколение <> &ПустоеПоколение
	                      |						И CRM_ВыгрузкаАвтомобилей.Поколение = &ПустоеПоколение
	                      |					ИЛИ &Серия <> &ПустаяСерия
	                      |						И CRM_ВыгрузкаАвтомобилей.Серия = &ПустаяСерия
	                      |					ИЛИ &Комплектация <> &ПустаяКомплектация
	                      |						И CRM_ВыгрузкаАвтомобилей.Комплектация = &ПустаяКомплектация
	                      |					ИЛИ &Модификация <> &ПустаяМодификация
	                      |						И CRM_ВыгрузкаАвтомобилей.Модификация = &ПустаяМодификация
	                      |					ИЛИ &Цвет <> &ПустойЦвет
	                      |						И CRM_ВыгрузкаАвтомобилей.Цвет = &ПустойЦвет))");
	Запрос.УстановитьПараметр("Автомобиль", запись.Автомобиль);
	Запрос.УстановитьПараметр("Марка", запись.Марка);
	Запрос.УстановитьПараметр("Модель", запись.Модель); 
	
	Запрос.УстановитьПараметр("Марка1С", запись.Марка1С);
	Запрос.УстановитьПараметр("Модель1С", запись.Модель1С);
	
	Запрос.УстановитьПараметр("Поколение", запись.Поколение);
	Запрос.УстановитьПараметр("Серия", запись.Серия);
	Запрос.УстановитьПараметр("Комплектация", запись.Комплектация);
	Запрос.УстановитьПараметр("Модификация", запись.Модификация);
	Запрос.УстановитьПараметр("Цвет", запись.Цвет);
	
	Запрос.УстановитьПараметр("ПустаяМарка", Справочники.CRM_МаркиАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяМодель", Справочники.CRM_МоделиАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустоеПоколение", Справочники.CRM_ПоколенияАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСерия", Справочники.CRM_СерииАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяКомплектация", Справочники.CRM_КомплектацииАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяМодификация", Справочники.CRM_МодификацииАвтомобилей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойЦвет", Справочники.CRM_ЦветаАвтомобилей.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.CRM_ВыгрузкаАвтомобилей.СоздатьНаборЗаписей();
		Набор.Отбор.Автомобиль.Установить(Выборка.АВтомобиль);
		Набор.ИсключаемыйАвтомобиль = Выборка.Автомобиль;
		Набор.Прочитать();
		Набор.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	

	

	

	
