
Функция КодПризнакаАгента(КодПризнакаАгента) Экспорт
	
	ПризнакиАгента = Новый Соответствие(); 
	
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.БанковскийПлатежныйАгент   , 0);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.БанковскийПлатежныйСубагент, 1);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.ПлатежныйАгент             , 2);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.ПлатежныйСубагент          , 3);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.Поверенный                 , 4);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.Комиссионер                , 5);
	ПризнакиАгента.Вставить(Перечисления.ПризнакиАгента.Агент                      , 6);
	
	Возврат ПризнакиАгента.Получить(КодПризнакаАгента);
	
КонецФункции

//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	// Другие виды не используются в программе
	Список = Новый СписокЗначений;
	Список.Добавить(Перечисления.ПризнакиАгента.Агент, Метаданные.Перечисления.ПризнакиАгента.ЗначенияПеречисления.Агент.Синоним);
	Список.Добавить(Перечисления.ПризнакиАгента.Комиссионер, Метаданные.Перечисления.ПризнакиАгента.ЗначенияПеречисления.Комиссионер.Синоним);
	Список.Добавить(Перечисления.ПризнакиАгента.Поверенный, Метаданные.Перечисления.ПризнакиАгента.ЗначенияПеречисления.Поверенный.Синоним);
	Возврат Список;
КонецФункции
#КонецЕсли
