
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вставить содержимое обработчика.
	Если Параметры.Свойство("СхемаКомпоновки") Тогда
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.СхемаКомпоновки));
	Иначе
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.НастройкиОтчета);
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		ТекПоле = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.ПолучитьОбъектПоИдентификатору(Параметры.ТекущаяСтрока);
		ЗаголовокПоля             = ТекПоле.Заголовок;
		ВыражениеДетальныхЗаписей = ТекПоле.ПолучитьВыражениеДетальныхЗаписей();
		ВыражениеИтоговыхЗаписей  = ТекПоле.ПолучитьВыражениеИтоговыхЗаписей();
	КонецЕсли;
	
	НовоеОграничение = Элементы.КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбора.ОграниченияИспользования.Добавить();
	НовоеОграничение.Доступность = Ложь;
	НовоеОграничение.Поле        = Новый ПолеКомпоновкиДанных("ПользовательскиеПоля");
	
	СписокАгрегатныеФункции.Добавить("СУММА(<Выражение>)", "СУММА");
	СписокАгрегатныеФункции.Добавить("МИНИМУМ(<Выражение>)", "МИНИМУМ");
	СписокАгрегатныеФункции.Добавить("МАКСИМУМ(<Выражение>)", "МАКСИМУМ");
	СписокАгрегатныеФункции.Добавить("СРЕДНЕЕ(<Выражение>)", "СРЕДНЕЕ");
	СписокАгрегатныеФункции.Добавить("КОЛИЧЕСТВО(<Выражение>)", "КОЛИЧЕСТВО");
	СписокАгрегатныеФункции.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ <Выражение>)", "КОЛИЧЕСТВО(РАЗЛИЧНЫЕ)");
	СписокАгрегатныеФункции.Добавить("МАССИВ(<Выражение>)", "МАССИВ");
	СписокАгрегатныеФункции.Добавить("ТАБЛИЦАЗНАЧЕНИЙ(<Выражение>, <Выражение>,...)", "ТАБЛИЦА ЗНАЧЕНИЙ");
	СписокАгрегатныеФункции.Добавить("СВЕРНУТЬ(<Таблица/Массив>, <Колонки>)", "СВЕРНУТЬ");
	СписокАгрегатныеФункции.Добавить("ПОЛУЧИТЬЧАСТЬ(<Таблица>, <Колонки>)", "ПОЛУЧИТЬ ЧАСТЬ");
	СписокАгрегатныеФункции.Добавить("УПОРЯДОЧИТЬ(<Таблица/Массив>, <Колонка>)", "УПОРЯДОЧИТЬ");
	СписокАгрегатныеФункции.Добавить("СОЕДИНИТЬСТРОКИ(<Таблица/Массив>, <Разделитель строк/элементов>, <Разделитель колонок>)", "СОЕДИНИТЬ СТРОКИ");
	
	СписокОператоры.Добавить("ВЫБОР
	|	КОГДА <Выражение> ТОГДА
	|		<Выражение>
	|	ИНАЧЕ
	|		<Выражение>
	|	КОНЕЦ", "ВЫБОР");
	СписокОператоры.Добавить("ЕСТЬ NULL", "ЕСТЬ NULL");
	СписокОператоры.Добавить("ЕСТЬ НЕ NULL", "ЕСТЬ НЕ NULL");
	СписокОператоры.Добавить("ВЫРАЗИТЬ(<Выражение> КАК <Тип>)", "ВЫРАЗИТЬ");
	СписокОператоры.Добавить("ЗНАЧЕНИЕ(<Имя>)", "ЗНАЧЕНИЕ");
	
	СписокФункции.Добавить("ВЫЧИСЛИТЬ(<Выражение>, <Группировка>, <Тип расчета>)", "ВЫЧИСЛИТЬ");
	СписокФункции.Добавить("УРОВЕНЬ()", "УРОВЕНЬ");
	СписокФункции.Добавить("УРОВЕНЬВГРУППИРОВКЕ ()", "УРОВЕНЬ В ГРУППИРОВКЕ");
	СписокФункции.Добавить("ЗНАЧЕНИЕЗАПОЛНЕНО(<Выражение>)", "ЗНАЧЕНИЕ ЗАПОЛНЕНО");
	СписокФункции.Добавить("НОМЕРПОПОРЯДКУ()", "НОМЕР ПО ПОРЯДКУ");
	СписокФункции.Добавить("НОМЕРПОПОРЯДКУВГРУППИРОВКЕ()", "НОМЕР ПО ПОРЯДКУ В ГРУППИРОВКЕ");
	СписокФункции.Добавить("ПОДСТРОКА(<Выражение>, <Позиция>, <Длина>)", "ПОДСТРОКА");
	СписокФункции.Добавить("ДЛИНАСТРОКИ(<Выражение>)", "ДЛИНА СТРОКИ");
	СписокФункции.Добавить("ФОРМАТ(<Выражение>, <Форматная строка>)", "ФОРМАТ");
	СписокФункции.Добавить("ЕСТЬNULL(<Выражение>, <Выражение>)", "ЕСТЬNULL");
	
	СписокФункцииДаты.Добавить("ДАТАВРЕМЯ(<Год>,<Месяц>,<День>,<Час>,<Минута>,<Секунда>)", "ДАТА-ВРЕМЯ");
	СписокФункцииДаты.Добавить("ТЕКУЩАЯДАТА()", "ТЕКУЩАЯ ДАТА");
	СписокФункцииДаты.Добавить("ГОД(<Дата>)", "ГОД");
	СписокФункцииДаты.Добавить("КВАРТАЛ(<Дата>)", "КВАРТАЛ");
	СписокФункцииДаты.Добавить("МЕСЯЦ(<Дата>)", "МЕСЯЦ");
	СписокФункцииДаты.Добавить("ДЕНЬГОДА(<Дата>)", "ДЕНЬ ГОДА");
	СписокФункцииДаты.Добавить("ДЕНЬ(<Дата>)", "ДЕНЬ");
	СписокФункцииДаты.Добавить("НЕДЕЛЯ(<Дата>)", "НЕДЕЛЯ");
	СписокФункцииДаты.Добавить("ДЕНЬНЕДЕЛИ(<Дата>)", "ДЕНЬ НЕДЕЛИ");
	СписокФункцииДаты.Добавить("ЧАС(<Дата>)", "ЧАС");
	СписокФункцииДаты.Добавить("МИНУТА(<Дата>)", "МИНУТА");
	СписокФункцииДаты.Добавить("СЕКУНДА(<Дата>)", "СЕКУНДА");
	СписокФункцииДаты.Добавить("НАЧАЛОПЕРИОДА(<Дата>, <Период>)", "НАЧАЛО ПЕРИОДА");
	СписокФункцииДаты.Добавить("КОНЕЦПЕРИОДА(<Дата>, <Период>)", "КОНЕЦ ПЕРИОДА");
	СписокФункцииДаты.Добавить("ДОБАВИТЬКДАТЕ(<Дата>, <Тип>, <Количество>)", "ДОБАВИТЬ К ДАТЕ");
	СписокФункцииДаты.Добавить("РАЗНОСТЬДАТ(<Дата1>, <Дата2>, <Тип>)", "РАЗНОСТЬ ДАТ");
	
	Элементы.КнопкаОтображатьФункции.Пометка       = Истина;
	Элементы.КнопкаОтображатьДоступныеПоля.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Индекс = 0;
		Для Каждого ТекЭлемент Из ПараметрыПеретаскивания.Значение Цикл
			//СтрокаДанных = КомпоновщикНастроек.Настройки.Выбор.Элементы[ТекЭлемент];
			//ПараметрыПеретаскивания.Значение[Индекс] = "["+Строка(ТекЭлемент.Поле)+"]";
			ПараметрыПеретаскивания.Значение[Индекс] = Строка(ТекЭлемент.Поле);
			Индекс = Индекс + 1;
		КонецЦикла;
	Иначе
		СтрокаДанных = КомпоновщикНастроек.Настройки.Выбор.Элементы[ПараметрыПеретаскивания.Значение];
		ПараметрыПеретаскивания.Значение = "["+СтрокаДанных.Заголовок+"]";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПеретаскиванияТекста(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	Если ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтаФорма.ТекущийЭлемент = Неопределено И ЭтаФорма.ТекущийЭлемент.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
		ТекстЗамены = "";
		
		Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
			Для Каждого ТекЭлемент Из ПараметрыПеретаскивания.Значение Цикл
				ТекстЗамены = ТекстЗамены + ?(ТекстЗамены = "", "", " ") + СокрЛП(ТекЭлемент);
			КонецЦикла;
		Иначе
			ТекстЗамены = СокрЛП(ПараметрыПеретаскивания.Значение);
		КонецЕсли;
		ЭтаФорма.ТекущийЭлемент.ВыделенныйТекст = ТекстЗамены;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПеретаскиванияТекста(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		Индекс = 0;
		Для Каждого ТекЭлемент Из ПараметрыПеретаскивания.Значение Цикл
			//СтрокаДанных = Объект.ДеревоМетаданных[ТекЭлемент];
			СтрокаДанных = Элемент.ДанныеСтроки(ТекЭлемент);
			ПараметрыПеретаскивания.Значение[Индекс] = СтрокаДанных.Значение;
			Индекс = Индекс + 1;
		КонецЦикла;
	Иначе
		ПараметрыПеретаскивания.Значение = КомпоновщикНастроек.Настройки.Выбор.Элементы[ПараметрыПеретаскивания.Значение];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокКомандВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ТекущаяСтраница = Элементы.ГруппаЗапросы.ТекущаяСтраница;
	//Если ТекущаяСтраница = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	//Элементы.ВыражениеИтоговыхЗаписей.ДобавитьСтроку(ТекущиеДанные.Значение);
	ВыражениеИтоговыхЗаписей = ВыражениеИтоговыхЗаписей + Символы.ПС + ТекущиеДанные.Значение;
	
	//ИмяЗапроса = СтрЗаменить(ТекущаяСтраница.Имя, "Группа", "");
	//ТекстЗапроса = ЭтаФорма["ТекстЗапроса"+ИмяЗапроса];
	//ТекстЗапроса.ДобавитьСтроку(ТекущиеДанные.Значение);
	
	//Док = Новый ТекстовыйДокумент;
	//Док.ВставитьСтроку(
	//Док.ДобавитьСтроку(
	//Док.ЗаменитьСтроку(1, "ваа");
	//Док.КоличествоСтрок();
	//Док.Очистить();
	//Док.Показать(
	//Док.ПолучитьОбласть(
	//Док.ПолучитьСтроку(
	//Док.Прочитать(
	//Док.РазделительСтрок
	//Док.УдалитьСтроку(
	//Док.УстановитьТекст(
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбораНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда
		ЗначенияПеретаскивания = Новый Массив;
		Для Каждого ТекЭлемент Из ПараметрыПеретаскивания.Значение Цикл
			
			Если ТекЭлемент.Папка Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначенияПеретаскивания.Добавить(Строка(ТекЭлемент.Поле));
			
		КонецЦикла;
		Если ЗначенияПеретаскивания.Количество() = 0 Тогда
			Выполнение = Ложь;
		Иначе
			ПараметрыПеретаскивания.Значение = ЗначенияПеретаскивания;
		КонецЕсли;
	Иначе
		
		//Если ПараметрыПеретаскивания.Значение.Папка Тогда
		//	ПараметрыПеретаскивания.Значение = "";
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	Если ПустаяСтрока(ЗаголовокПоля) Тогда
		Предупреждение("Не заполнен заголовок поля!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НовоеПоле = КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
	НовоеПоле.Использование = Истина;
	НовоеПоле.Заголовок     = ЗаголовокПоля;
	Попытка
		НовоеПоле.УстановитьВыражениеДетальныхЗаписей(СокрЛП(ВыражениеДетальныхЗаписей));
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		
		Позиция = Найти(ТекстОшибки, ": ");
		Пока Позиция> 0 Цикл
			ТекстОшибки = Сред(ТекстОшибки, Позиция+2);
			Позиция = Найти(ТекстОшибки, ": ");
		КонецЦикла;
		
		Предупреждение(ТекстОшибки);
		
		КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Удалить(НовоеПоле);
		
		Отказ = Истина;
		Возврат;
		
	КонецПопытки;
	
	Попытка
		НовоеПоле.УстановитьВыражениеИтоговыхЗаписей(СокрЛП(ВыражениеИтоговыхЗаписей));
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		
		Позиция = Найти(ТекстОшибки, ": ");
		Пока Позиция> 0 Цикл
			ТекстОшибки = Сред(ТекстОшибки, Позиция+2);
			Позиция = Найти(ТекстОшибки, ": ");
		КонецЦикла;
		
		Предупреждение(ТекстОшибки);
		
		КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Удалить(НовоеПоле);
		
		Отказ = Истина;
		
		Возврат;
		
	КонецПопытки;
	
	Если НЕ Отказ Тогда
		Закрыть(КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтображатьДоступныеПоля(Команда)
	
	Элементы.КнопкаОтображатьДоступныеПоля.Пометка = НЕ Элементы.КнопкаОтображатьДоступныеПоля.Пометка;
	Элементы.КомпоновщикНастроекНастройкиВыборДоступныеПоляВыбора.Видимость = Элементы.КнопкаОтображатьДоступныеПоля.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтображатьФункции(Команда)
	
	Элементы.КнопкаОтображатьФункции.Пометка = НЕ Элементы.КнопкаОтображатьФункции.Пометка;
	Элементы.ГруппаПраваяЧасть.Видимость = Элементы.КнопкаОтображатьФункции.Пометка;
	
КонецПроцедуры

