Функция ВыгрузкаСправочников(ADOСоединение) Экспорт
	
	СоответсвиеОрганизаций = БТ_РасчетПоказателей.ВыгрузкаОрганизаций(ADOСоединение);
	
	Если СоответсвиеОрганизаций = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СоотвествиеВидовРасчета = БТ_РасчетПоказателей.УзнатьСоответсвиеВидовРасчета(ADOСоединение);	
	
	Если СоотвествиеВидовРасчета = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СоответствиеПодразделений = БТ_РасчетПоказателей.ВыгрузкаПодразделения(ADOСоединение);	
	
	Если СоответствиеПодразделений = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СоотвествиеПоказателей = БТ_РасчетПоказателей.ВыгрузитьПоказатели(ADOСоединение,СоотвествиеВидовРасчета);	
	
	Если СоотвествиеПоказателей = Неопределено Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Новый Структура("СоответсвиеОрганизаций, СоотвествиеПоказателей, СоответствиеПодразделений", СоответсвиеОрганизаций, СоотвествиеПоказателей, СоответствиеПодразделений);
	
КонецФункции  

Функция КоличествоДнейВМесяце(Дата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ) + 1 КАК КоличествоДнейВМесяце";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КоличествоДнейВМесяце
	КонецЦикла;
	
КонецФункции

Функция ВыгрузитьПоказатели(ПлановыеЗначение, удаление = ложь) Экспорт
	
	ПрофильSQL = Справочники.БТ_ПрофилиSQL.Показатели;
	ADOСоединение = Справочники.БТ_ПрофилиSQL.ПодключитьSQL(ПрофильSQL);
	
	Если ADOСоединение = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Ложь ТОгда
		ПлановыеЗначение = Документы.БТ_ПлановыеПоказатели.СоздатьДокумент();
	КонецЕсли;
	
	ТолькоУдаление = ПлановыеЗначение.ПометкаУдаления или Удаление;
	
	СтруктураОтвета = ВыгрузкаСправочников(ADOСоединение);
	
	Если СтруктураОтвета = Неопределено Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	КоличествоДней = КоличествоДнейВМесяце(ПлановыеЗначение.Период);
	
	МаксимальноеКоличествоЗаписейВТранзакции = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("МаксимальноеКоличествоЗаписейВТранзакции");
	
	Если МаксимальноеКоличествоЗаписейВТранзакции = Неопределено Тогда
		
		МаксимальноеКоличествоЗаписейВТранзакции = 100;
		
	КонецЕсли;      
	
		ОрганизацияССП = БТ_РасчетПоказателей.НайтиОрганизациюДляВыгрузки(ПлановыеЗначение.Организация);
	
	Если ОрганизацияССП = Неопределено Тогда
		
		Сообщить("Не найдено название для ССП");
		Возврат Ложь;
		
	КонецЕсли;

	
	КоличествоЗаписей = 1;
	ТекстЗапроса = "";
	НачатьТранзакцию();
	Команда = Новый ComObject("ADODB.Command");
	
	Для Каждого ТекПоказатель из ПлановыеЗначение.Показатели Цикл
		
		Период = НачалоМесяца(ПлановыеЗначение.Период);
			
		Пока период <= КонецМесяца(ПлановыеЗначение.Период) Цикл
			
			ТекстЗапроса = ТекстЗапроса + Символы.ПС +"DELETE FROM [dbo].[values]
	      	|WHERE [ind_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоотвествиеПоказателей.Получить(Строка(ТекПоказатель.Показатель.ID)))+" 
			|and [org_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоответсвиеОрганизаций.Получить(ОрганизацияССП))+"
			|and [date] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Период)+"
			|and [is_plan] = 0";
			
			Если не ПустаяСтрока(ПлановыеЗначение.Подразделение) Тогда
				
				ТекстЗапроса = ТекстЗапроса + " and ([sub_id] = "+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоответствиеПодразделений.Получить(ПлановыеЗначение.Подразделение))+" or [sub_id] is null)";
				
			КонецЕсли;
			
			ЗначениеПоказателя = ТекПоказатель.Значение;
			
			Если не ТолькоУдаление Тогда
				
				Если ПустаяСтрока(ПлановыеЗначение.Подразделение) Тогда
				
					ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan])
			     	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоотвествиеПоказателей.Получить(Строка(ТекПоказатель.Показатель.ID)))+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоответсвиеОрганизаций.Получить(ОрганизацияССП))+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Период)+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(ЗначениеПоказателя ,"ЧН=0; ЧГ=0"))+",0)";
					
				Иначе
				
					ТекстЗапроса = ТекстЗапроса + Символы.ПС +"INSERT INTO [dbo].[values] ([ind_id],[org_id],[date],[val],[is_plan],[sub_id])
			     	|VALUES ("+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоотвествиеПоказателей.Получить(Строка(ТекПоказатель.Показатель.ID)))+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоответсвиеОрганизаций.Получить(ОрганизацияССП))+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеДатыSQL(Период)+",
			        |"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(Формат(ЗначениеПоказателя ,"ЧН=0; ЧГ=0"))+",0,
					|"+Справочники.БТ_ПрофилиSQL.ПредставлениеЧислаSQL(СтруктураОтвета.СоответствиеПодразделений.Получить(ПлановыеЗначение.Подразделение))+")";
					
				КонецЕсли;
				
			КонецЕсли;
			Если КоличествоЗаписей >= МаксимальноеКоличествоЗаписейВТранзакции Тогда
			
				КоличествоЗаписей = 0;
				ЗафиксироватьТранзакцию();
				НачатьТранзакцию();
				Если не БТ_РасчетПоказателей.ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) Тогда
					
					ОтменитьТранзакцию();
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;	 
				
			МенеджерЗаписей = РегистрыСведений.БТ_ЗначенияПоказателей.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.Значение = ЗначениеПоказателя;
			МенеджерЗаписей.Показатель = ТекПоказатель.Показатель;
			МенеджерЗаписей.Организация = ПлановыеЗначение.Организация;
			МенеджерЗаписей.Период = период;
			МенеджерЗаписей.План = Ложь;
			МенеджерЗаписей.Выгружен = истина;
			МенеджерЗаписей.ДатаВыгрузки = ТекущаяДата();
			МенеджерЗаписей.ДатаДобавления = ТекущаяДатаСеанса();
			МенеджерЗаписей.Подразделение = ПлановыеЗначение.Подразделение;
			МенеджерЗаписей.Записать();
			
			КоличествоЗаписей = КоличествоЗаписей + 1;
			
		
			
			Если ТекПоказатель.Показатель.ПериодичностьРасчетов = Перечисления.БТ_Периодичность.Ежедневно Тогда
						
				период = период + 86400;
				
			ИначеЕсли ТекПоказатель.Показатель.ПериодичностьРасчетов = Перечисления.БТ_Периодичность.Ежемесячно Тогда
				
				период = ДобавитьМесяц(период,1);
				
			Иначе
				
				период = период + 86400;
				
			КонецЕсли;
		КонецЦикла;		
		
	КонецЦикла; 
		
	Если Не ПустаяСтрока(ТекстЗапроса) Тогда
		
		Если не БТ_РасчетПоказателей.ЗаписатьВSQL(ADOСоединение,Команда,ТекстЗапроса) Тогда
			
			ОтменитьТранзакцию();
			
		КонецЕсли;
			
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();

	
	Возврат истина;
	
КонецФункции

Функция УдалитьВсеЗначения(ADOСоединение);
	
КонецФункции