
Функция ЕстьДругойДокумент()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ПлановыеПоказатели.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.БТ_РучныеПоказатели КАК БТ_ПлановыеПоказатели
		|ГДЕ
		|	БТ_ПлановыеПоказатели.Организация = &Организация
		|	И БТ_ПлановыеПоказатели.Период = &Период
		|	И БТ_ПлановыеПоказатели.Ссылка <> &Ссылка
		|	И БТ_ПлановыеПоказатели.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат не РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЕстьДругойДокумент() Тогда
		
		Сообщить("В базе уже есть документ, за выбранный период по выбранной организации, запись отменена!");
		Отказ = истина;
		Возврат;
		
	КонецЕсли;
	
	Если не РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		
		Если не Документы.БТ_РучныеПоказатели.ВыгрузитьПоказатели(ЭтотОбъект,РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
			
			отказ = истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Документы.БТ_РучныеПоказатели.ВыгрузитьПоказатели(ЭтотОбъект,истина);
КонецПроцедуры
