//Заполнить настройки
Процедура ЗапонитьНастройки() Экспорт
	#Если Клиент Тогда
		// сначала востоновим режим
		ВремРежим = ВосстановитьЗначение("РежимЗагрузкиКрасок");
		Если обЗначениеНеЗаполнено(ВремРежим) Тогда
			РежимЗагрузки = "ColorNetPro";
		КонецЕсли;
		РежимЗагрузки = ВремРежим;
		
		// востановим петь к файлу с заданиями
		ПутьКФайлуВр=ВосстановитьЗначение("ФайлОбменаДля"+РежимЗагрузки);
		ПутьКФайлу=?(обЗначениеНеЗаполнено(ПутьКФайлуВр),"",ПутьКФайлуВр);
		
		// востановим путь к каталогу 
		КаталогСФайламиОбменаВр=ВосстановитьЗначение("КаталогОбменаДля"+РежимЗагрузки);
		КаталогСФайламиОбмена=?(обЗначениеНеЗаполнено(КаталогСФайламиОбменаВр),"",КаталогСФайламиОбменаВр);
		
		ГруппаНоменклатурыВр=ВосстановитьЗначение("ГруппаНоменклатуры"+РежимЗагрузки);
		ГруппаНоменклатуры=?(обЗначениеНеЗаполнено(ГруппаНоменклатурыВр),Справочники.Номенклатура.ПустаяСсылка(),ГруппаНоменклатурыВр);
		
		ДобСтроку = ВосстановитьЗначение("ДобавлятьСтрокуВЗНAxalta");
		ДобавлятьСтрокуВЗаказНаряд = ?(ДобСтроку = Неопределено, Ложь, ДобСтроку);
		ОткФорму = ВосстановитьЗначение("ОткрыватьФормуAxalta");
		флОткрыватьФормуКомплектации = ?(ОткФорму = Неопределено, Истина, ОткФорму);
		СипЗам = ВосстановитьЗначение("ИспользоватьЗаменуAxalta");
		ИспользоватьЗамену = ?(СипЗам = Неопределено, Ложь, СипЗам);
		СипЗам = ВосстановитьЗначение("НоменклатураЗаменительAxalta");
		НоменклатураЗаменитель = ?(СипЗам = Неопределено, Справочники.Номенклатура.ПустаяСсылка(), СипЗам);
	#КонецЕсли
КонецПроцедуры

//Сохранить настройки
Процедура СохранитьНастройки(Режим = "ColorNetPro") Экспорт
	#Если Клиент Тогда
		// сохраним пути
		СохранитьЗначение("РежимЗагрузкиКрасок",Режим);
		СохранитьЗначение("ФайлОбменаДля"+Режим,ПутьКФайлу);
		СохранитьЗначение("КаталогОбменаДля"+Режим,КаталогСФайламиОбмена);
		СохранитьЗначение("ГруппаНоменклатуры"+Режим,ГруппаНоменклатуры);
		СохранитьЗначение("ДобавлятьСтрокуВЗНAxalta",ДобавлятьСтрокуВЗаказНаряд);
		СохранитьЗначение("ОткрыватьФормуAxalta", флОткрыватьФормуКомплектации);
		СохранитьЗначение("ИспользоватьЗаменуAxalta",ИспользоватьЗамену);
		СохранитьЗначение("НоменклатураЗаменительAxalta",НоменклатураЗаменитель);
	#КонецЕсли
КонецПроцедуры

//Проверить файл обмена
Функция ПроверитьФайлОбмена() Экспорт
	ВсеОк = Истина;
	Если обЗначениеНеЗаполнено(ПутьКФайлу) Тогда
		ВсеОК = Ложь;
		#Если Клиент Тогда
		Сообщить("Не указан путь к файлу обмена!", СтатусСообщения.Информация);
		#КонецЕсли
		Возврат ВсеОк;
	КонецЕсли;
	
	Файл = Новый Файл(ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		#Если Клиент Тогда
		Сообщить("Не удалось обнаружить файл обмена! Удостоверьтесь в его наличии.", СтатусСообщения.Информация);
		#КонецЕсли
		ВсеОк = Ложь;
	КонецЕсли;
	
	Возврат ВсеОК;
КонецФункции

Процедура ОбновитьПутиПоРежиму() Экспорт
	#Если Клиент Тогда
	// получение нового пути к файлу
	// востановим петь к файлу с заданиями
	ПутьКФайлуВр=ВосстановитьЗначение("ФайлОбменаДля"+РежимЗагрузки);
	ПутьКФайлу=?(обЗначениеНеЗаполнено(ПутьКФайлуВр),"",ПутьКФайлуВр);
	
	// востановим путь к каталогу 
	КаталогСФайламиОбменаВр=ВосстановитьЗначение("КаталогОбменаДля"+РежимЗагрузки);
	КаталогСФайламиОбмена=?(обЗначениеНеЗаполнено(КаталогСФайламиОбменаВр),"",КаталогСФайламиОбменаВр);
	
	ГруппаНоменклатурыВр=ВосстановитьЗначение("ГруппаНоменклатуры"+РежимЗагрузки);
	ГруппаНоменклатуры=?(обЗначениеНеЗаполнено(ГруппаНоменклатурыВр),Справочники.Номенклатура.ПустаяСсылка(),ГруппаНоменклатурыВр);
	#КонецЕсли
КонецПроцедуры

//Добавить строку в файл обмена
Процедура ДобавитьСтрокуВФайлОбмена(ЗаказНаряд,Стр=Неопределено) Экспорт
	// посмотрим есть ли по этому ЗН записи
	Чтение = Новый ЧтениеТекста;
	Попытка
		Чтение.Открыть(ПутьКФайлу);
	Исключение
		Сообщить("Неудалось открыть файл обмена с Axalta!", СтатусСообщения.Внимание);
		Возврат;
	КонецПопытки;
	
	СтрокаПоиска = кмТранслитерация(ЗаказНаряд.Номер);
	Стр = Чтение.ПрочитатьСтроку();
	ЕстьЗапись = Ложь;
	Пока Стр <> Неопределено Цикл
		Если ЕстьЗапись Тогда
			Прервать;
		КонецЕсли;
		
		Положение = Найти(Стр,СтрокаПоиска);
		ЕстьЗапись = (Положение<>0);
		Стр = Чтение.ПрочитатьСтроку();
	КонецЦикла;
	Чтение.Закрыть();
	Если ЕстьЗапись Тогда
		Сообщить("Запись об этом заказ-наряде уже есть в файле обмена!", СтатусСообщения.Информация);
	Иначе
		// сформируем строку для записи
		Запись = Новый ЗаписьТекста;
		Запись.Открыть(ПутьКФайлу,,,Истина,);
		Авто = ЗаказНаряд.Автомобиль;
		СтруктураОтбора=Новый Структура("Автомобиль,ВидЗначения",Авто.Ссылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		СтруктураСведений=РегистрыСведений.Автомобили.ПолучитьПоследнее(ТекущаяДата(),СтруктураОтбора);
		СтрокаЗапись = кмТранслитерация(ЗаказНаряд.Номер) + ", " + кмТранслитерация(Авто.Модель.Наименование) + ", " + кмТранслитерация(Строка(СтруктураСведений.Значение));
		Попытка
			Запись.ЗаписатьСтроку(СтрокаЗапись);
			Сообщить("Добавление данных в файл прошло успешно.", СтатусСообщения.Информация);
		Исключение
			Сообщить("При добавление данных в файл обмена роизошла ожибка!", СтатусСообщения.Внимание);
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		Запись.Закрыть();
	КонецЕсли;
КонецПроцедуры

//Удалить строку из файла обмена
Процедура УдалитьСтрокуИзФайлаОбмена(ЗаказНаряд) Экспорт
	СтрокаПоиска = кмТранслитерация(ЗаказНаряд.Номер);
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.Прочитать(ПутьКФайлу);
	МассивНаУдаление = Новый Массив;
	КолСтрок=ТекстДок.КоличествоСтрок();
	Для Сч = 1 По КолСтрок Цикл
		Стр = ТекстДок.ПолучитьСтроку(Сч);
		Если Найти(Стр,СокрЛП(СтрокаПоиска))<>0 Тогда
			МассивНаУдаление.Добавить(Сч-МассивНаУдаление.Количество());
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрМасс Из МассивНаУдаление Цикл
		ТекстДок.УдалитьСтроку(СтрМасс);
	КонецЦикла;
	ТекстДок.Записать(ПутьКФайлу,КодировкаТекста.ANSI);
	
	Если НЕ обЗначениеНеЗаполнено(КаталогСФайламиОбмена) Тогда
		УдалитьФайлы(КаталогСФайламиОбмена,ЗаказНаряд.Номер+"*");
	КонецЕсли;
КонецПроцедуры

//Удалить строку из файла обмена
Процедура УдалитьСтрокуИзФайлаОбменаGlasurit(ЗаказНаряд) Экспорт
	Если обЗначениеНеЗаполнено(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	СтрокаЗН = кмТранслитерация(ЗаказНаряд.Номер);
	Попытка
		ЧтениеТекста = Новый ТекстовыйДокумент;
		ЧтениеТекста.Прочитать(ПутьКФайлу);
		ТекстXML = ЧтениеТекста.ПолучитьТекст();
		
		ЧтениеФайла = Новый ЧтениеXML;
		ЧтениеФайла.УстановитьСтроку(ТекстXML);
		СписокЗаказов = Новый СписокЗначений;
		Пока ЧтениеФайла.Прочитать() Цикл
			Если ЧтениеФайла.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеФайла.Имя = "Job" Тогда
				стрЗаказа = Новый Структура;
				Пока ЧтениеФайла.Прочитать() Цикл
					Если ЧтениеФайла.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеФайла.Имя = "Job" Тогда
						СписокЗаказов.Добавить(стрЗаказа);
						Прервать;
					ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
						ИмяРеквизита = ЧтениеФайла.Имя;
						ЧтениеФайла.Прочитать();
						ЗначениеРеквизита = ЧтениеФайла.Значение;
						стрЗаказа.Вставить(ИмяРеквизита,ЗначениеРеквизита);
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеФайла.Имя = "Jobs" Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЗаписьФайл = Новый ЗаписьXML;
		ЗаписьФайл.ОткрытьФайл(ПутьКФайлу);
		ЗаписьФайл.ЗаписатьНачалоЭлемента("Jobs");
		Для Каждого Заказ Из СписокЗаказов Цикл
			ДанныеЗаказ = Заказ.Значение;
			Попытка
				Если ДанныеЗаказ.JobNumber = СтрокаЗН Тогда
					ЭтоНеПишем = Истина;
				Иначе
					ЭтоНеПишем = Ложь;
				КонецЕсли;
			Исключение
				ЭтоНеПишем = Ложь;
			КонецПопытки;
			
			Если ЭтоНеПишем Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаписьФайл.ЗаписатьНачалоЭлемента("Job");
			Для Каждого Реквизит Из ДанныеЗаказ Цикл
				ЗаписьФайл.ЗаписатьНачалоЭлемента(Реквизит.Ключ);
				ЗаписьФайл.ЗаписатьТекст(Реквизит.Значение);
				ЗаписьФайл.ЗаписатьКонецЭлемента();
			КонецЦикла;
			ЗаписьФайл.ЗаписатьКонецЭлемента();
		КонецЦикла;
		ЗаписьФайл.ЗаписатьКонецЭлемента();
		ЗаписьФайл.Закрыть();
		ЧтениеТекста.Прочитать(ПутьКФайлу);
		ЧтениеТекста.Записать(ПутьКФайлу,КодировкаТекста.ANSI);
	Исключение
		Сообщить("При удалении данных из файл обмена произошла ожибка!", СтатусСообщения.Внимание);
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

//Добавить строку в файл обмена
Процедура ДобавитьСтрокуВФайлОбменаGlasurit(ЗаказНаряд) Экспорт
	Если обЗначениеНеЗаполнено(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЧтениеТекста = Новый ТекстовыйДокумент;
		ЧтениеТекста.Прочитать(ПутьКФайлу);
		ТекстXML = ЧтениеТекста.ПолучитьТекст();
		
		ЗаписьФайл = Новый ЗаписьXML;
		ЗаписьФайл.ОткрытьФайл(ПутьКФайлу);
		ЧтениеФайла = Новый ЧтениеXML;
		ЧтениеФайла.УстановитьСтроку(ТекстXML);
		ЕстьТакойЗН = Ложь; 
		СтрокаЗН = кмТранслитерация(ЗаказНаряд.Номер);
		Пока ЧтениеФайла.Прочитать() Цикл
			Если ЧтениеФайла.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеФайла.Имя = "Jobs" Тогда
				Если НЕ ЕстьТакойЗН Тогда
					// запишим наши данные
					ЗаписьФайл.ЗаписатьНачалоЭлемента("Job");
						ЗаписьФайл.ЗаписатьНачалоЭлемента("JobNumber");
							ЗаписьФайл.ЗаписатьТекст(СтрокаЗН);
						ЗаписьФайл.ЗаписатьКонецЭлемента();
						ЗаписьФайл.ЗаписатьНачалоЭлемента("Customer");
							ЗаписьФайл.ЗаписатьТекст(кмТранслитерация(ЗаказНаряд.Контрагент));
						ЗаписьФайл.ЗаписатьКонецЭлемента();
						ЗаписьФайл.ЗаписатьНачалоЭлемента("VINnumber");
							ЗаписьФайл.ЗаписатьТекст(ЗаказНаряд.Автомобиль.VIN);
						ЗаписьФайл.ЗаписатьКонецЭлемента();
						ЗаписьФайл.ЗаписатьНачалоЭлемента("CreatedDate");
							ЗаписьФайл.ЗаписатьТекст(Строка(ЗаказНаряд.Дата));
						ЗаписьФайл.ЗаписатьКонецЭлемента();
						ЗаписьФайл.ЗаписатьНачалоЭлемента("JobStatus");
							ЗаписьФайл.ЗаписатьТекст(?(ЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт,"2","1"));
						ЗаписьФайл.ЗаписатьКонецЭлемента();
					ЗаписьФайл.ЗаписатьКонецЭлемента();
				Иначе
					Сообщить("Запись об этом заказ-наряде уже есть в файле обмена!", СтатусСообщения.Информация);
				КонецЕсли;
				ЗаписьФайл.ЗаписатьКонецЭлемента();
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеФайла.Имя = "Jobs" Тогда
				ЗаписьФайл.ЗаписатьНачалоЭлемента("Jobs");
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеФайла.Имя = "Job"  Тогда
				ЗаписьФайл.ЗаписатьНачалоЭлемента("Job");
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				ЗаписьФайл.ЗаписатьНачалоЭлемента(ЧтениеФайла.Имя);
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.Текст Тогда
				ЗаписьФайл.ЗаписатьТекст(ЧтениеФайла.Значение);
				Если ЧтениеФайла.Значение = СтрокаЗН Тогда
					ЕстьТакойЗН = Истина;
				КонецЕсли;
			ИначеЕсли ЧтениеФайла.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				ЗаписьФайл.ЗаписатьКонецЭлемента();
			КонецЕсли;
		КонецЦикла;
		ЗаписьФайл.Закрыть();
		ЧтениеТекста.Прочитать(ПутьКФайлу);
		ЧтениеТекста.Записать(ПутьКФайлу,КодировкаТекста.ANSI);
	Исключение
		Сообщить("При добавление данных в файл обмена произошла ожибка!", СтатусСообщения.Внимание);
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Процедура ДобавитьНовыйФайлОбмена() Экспорт
	ВсеОк = Истина;
	Если обЗначениеНеЗаполнено(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		ЗаписьФайл = Новый ЗаписьXML;
		ЗаписьФайл.ОткрытьФайл(ПутьКФайлу);
		ЗаписьФайл.ЗаписатьНачалоЭлемента("Jobs");
		ЗаписьФайл.ЗаписатьКонецЭлемента();
		ЗаписьФайл.Закрыть();
	КонецЕсли;
КонецПроцедуры