#Если Клиент Тогда
	
// Добавление ячейки
Процедура ДобавитьЯчейку(Макет, Таб, СтрТаблицаЯчеек, Столбик, Ряд);
	Столбик	= ?(Столбик = 2, 0 , Столбик+1);
	Ряд		= ?(Столбик = 2, Ряд + 1, Ряд);

	Если Ряд >2 Тогда
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
		Ряд = 0;
	КонецЕсли;
	
	Область = Макет.ПолучитьОбласть("Строка|Колонка");
	Область.Параметры.Ячейка = СокрЛП(СтрТаблицаЯчеек.Ячейка.Код);
	
 	Если Столбик = 0 Тогда
 		Таб.Вывести(Область);
 	Иначе
 		Таб.Присоединить(Область);
 	КонецЕсли;
КонецПроцедуры

// сформировать печатную форму
Процедура Сформировать(Таб = Неопределено, Таблица = Неопределено)
	Если Таблица = Неопределено Тогда
		Таблица = ТаблицаЯчеек;
	КонецЕсли;
	ОбщееКоличество = Таблица.Количество();
	
	Если ОбщееКоличество = 0 Тогда
		Предупреждение("Нет данных для печати");
		Возврат;
	КонецЕсли;
	
	Если Таб = Неопределено Тогда
		Таб = Новый ТабличныйДокумент;
	КонецЕсли;	
	
	Столбик = 2;
 	Ряд     = 0;

	Макет = ПолучитьМакет("Макет");
	Счетчик = 0;
 	Для Каждого СтрТаблицаЯчеек Из Таблица Цикл
		ДобавитьЯчейку(Макет, Таб, СтрТаблицаЯчеек, Столбик, Ряд);
		Счетчик = Счетчик + 1;
		Состояние("Выполнено: " + Цел(Счетчик * 100 / ОбщееКоличество) + "%");
	КонецЦикла;
	
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ПолеСверху = 2;
	Таб.ПолеСлева = 2;
	Таб.ПолеСнизу = 2;
	Таб.ПолеСправа = 2;
	Таб.Показать("Печать");
КонецПроцедуры

// процедура печати
Процедура Печать(ТабличныйДокумент, Таблица = Неопределено) Экспорт
	Сформировать(ТабличныйДокумент, Таблица);
КонецПроцедуры	
#КонецЕсли