
//возвращает по значению перечисления картинку из библиотеки                
Функция ПолучитьИмяКартинки(ВыбЗначение) Экспорт
	
	Если ТипЗнч(ВыбЗначение) <> ТипЗнч(Перечисления.Важность.ПустаяСсылка()) Тогда
		Возврат "ПриоритетСредний";
	КонецЕсли;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.Важность.Высокая, 	"ПриоритетВысокий");
	СоответствиеКартинки.Вставить(Перечисления.Важность.Средняя, 	"ПриоритетСредний");
	СоответствиеКартинки.Вставить(Перечисления.Важность.Низкая,		"ПриоритетНизкий");
	
 	ИмяКартинки = СоответствиеКартинки.Получить(ВыбЗначение);
	Если ИмяКартинки = Неопределено Тогда
		Возврат "ПриоритетСредний";
	КонецЕсли;
	
	Возврат ИмяКартинки;
КонецФункции

//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	Список = Новый СписокЗначений;
	Для Каждого ТекПеречисление Из Метаданные.Перечисления.Важность.ЗначенияПеречисления Цикл
		ЗнПеречисление = Перечисления.Важность[ТекПеречисление.Имя];
		ИмяКартинки = ПолучитьИмяКартинки(ЗнПеречисление);
		Список.Добавить(ЗнПеречисление,ТекПеречисление.Синоним,,БиблиотекаКартинок[ИмяКартинки]);	
	КонецЦикла;
	Возврат Список;
КонецФункции
#КонецЕсли

