// процедура заполнения предопределенных элементов справочника
//
// Параметры:
// ЗаполнятьВсе - Булево - Признак заполнение всей информации
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	ПредопределенныйОсновнойСклад = Справочники.СкладыКомпании.ОсновнойСкладКомпании.ПолучитьОбъект();
	////ищем с таким же наименованием
	//Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	СкладыКомпании.Ссылка КАК СкладКомпанииСсылка
	//	|ИЗ
	//	|	Справочник.СкладыКомпании КАК СкладыКомпании
	//	|ГДЕ
	//	|	СкладыКомпании.Наименование = &Наименование И СкладыКомпании.ЭтоГруппа = Ложь И СкладыКомпании.Предопределенный = Ложь 
	//	|");
	//Запрос.УстановитьПараметр("Наименование",ПредопределенныйОсновнойСклад.Наименование);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Номер = 0;
	//Пока Выборка.Следующий() Цикл
	//	//заменяем
	//	ФормаЗаменаЗначений = Обработки.ПоискИЗаменаЗначений.ПолучитьФорму();
	//	ФормаЗаменаЗначений.Программно = Истина;
	//	СтрокаЗамены = ФормаЗаменаЗначений.ЗаменяемыеЗначения.Добавить();
	//	СтрокаЗамены.ЧтоЗаменять = Выборка.СкладКомпании;
	//	СтрокаЗамены.НаЧтоЗаменять = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
	//	СтрокаЗамены.Пометка = Истина;
	//	Сообщить("Справочник ""Склады компании"". Произведена замена ссылок на элемент """ + Выборка.СкладКомпании + """ ссылками на элемент """ + Справочники.СкладыКомпании.ОсновнойСкладКомпании + """");		
	//	ФормаЗаменаЗначений.Открыть();
	//	//
	//	ОбъектСклад = Выборка.СкладКомпании.ПолучитьОбъект();
	//	ОбъектСклад.Наименование = ПредопределенныйОсновнойСклад.Наименование+"_"+Номер;
	//	ОбъектСклад.Записать();
	//	Номер = Номер + 1;
	//КонецЦикла;
	//перезаполняем реквизиты
	Если ЗаполнятьВсе Тогда
		Если СтрДлина(СокрЛП(ПредопределенныйОсновнойСклад.Код))=1 Тогда
			ПредопределенныйОсновнойСклад.УстановитьНовыйКод();
		КонецЕсли;
		ПредопределенныйОсновнойСклад.Код=Формат(ПредопределенныйОсновнойСклад.Код,"ЧЦ=8; ЧВН=; ЧГ=");
		ПредопределенныйОсновнойСклад.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		ПредопределенныйОсновнойСклад.Организация = Справочники.Организации.ОсновнаяОрганизация;
		ПредопределенныйОсновнойСклад.Розничный = Ложь;
		ПредопределенныйОсновнойСклад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
		Если Не обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы) Тогда
			ПредопределенныйОсновнойСклад.ГрафикРаботы = ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы;
		КонецЕсли;
	Иначе
		Если СтрДлина(СокрЛП(ПредопределенныйОсновнойСклад.Код))=1 Тогда
			ПредопределенныйОсновнойСклад.УстановитьНовыйКод();
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение) Тогда
			ПредопределенныйОсновнойСклад.Подразделение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Организация) Тогда
			ПредопределенныйОсновнойСклад.Организация = Справочники.Организации.ОсновнаяОрганизация;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Розничный) Тогда
			ПредопределенныйОсновнойСклад.Розничный = Ложь;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.ВидСклада) Тогда
			ПредопределенныйОсновнойСклад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.ГрафикРаботы) Тогда
			Если Не обЗначениеНеЗаполнено(ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы) Тогда
				ПредопределенныйОсновнойСклад.ГрафикРаботы = ПредопределенныйОсновнойСклад.Подразделение.ГрафикРаботы;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Сохранение справочника
	НовыйЭлемент = ПредопределенныйОсновнойСклад.ЭтоНовый();
	Если ПредопределенныйОсновнойСклад.Модифицированность() Тогда
		Попытка
			ПредопределенныйОсновнойСклад.Записать();
			Сообщить("Справочник ""Склады компании"". "+?(НовыйЭлемент,"Добавлен","Обновлен")+" элемент """+СокрЛП(ПредопределенныйОсновнойСклад.Наименование)+"""");
		Исключение
		КонецПопытки;
	КонецЕсли;
	// Заполним для всех складов реквизит "ВидСклада"
	ВыборкаСклады = Справочники.СкладыКомпании.Выбрать();
	Пока ВыборкаСклады.Следующий() Цикл
		Склад = ВыборкаСклады.ПолучитьОбъект();
		Если Склад.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли; 
		Если обЗначениеНеЗаполнено(Склад.ВидСклада) Тогда
			Склад.ВидСклада = Перечисления.ВидыСкладов.Обычный;
			Попытка		
			    Склад.Записать();
				Сообщить("Справочник ""Склады компании"". Модифицирован элемент """+СокрЛП(Склад.Наименование)+"""");
			Исключение
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
