#Если Клиент Тогда
// Обработка обновления информационной базы при первом запуске и смене релиза.
// Не имеет ни форм ни макетов, вызывается только из сеанса клиента и только программно !
// Вызывается из обработки СтартСистемы при несоответствии версии конфигурации константе.

// Основная точка входа обработки, осуществляющая последовательный вызов
// всех проверок и изменений данных в информационной базе
Процедура ВыполнитьОбновление(ПервыйЗапускВДочернемУзле = Ложь) Экспорт

	// Отключим проверки и сообщения на время обновления
	Если НЕ ЗначениеЗаполнено(глПрава) Тогда // Если еще не инициализированы
		Состояние("Получение прав и настроек текущего пользователя...");
		глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	КонецЕсли;
	// Сначала запомним их текущие состояния
	ПВХ = ПланыВидовХарактеристик.ПраваИНастройки;
	ВыводитьСообщенияПроверкиПравДоступа = обПраво(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,глПрава);
	ПроверкаДоступаКСправочникамИДокументам = обПраво(ПВХ.ПроверкаДоступаКСправочникамИДокументам,глПрава);
	ПроверкаЗаполненияСправочниковИДокументов = обПраво(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,глПрава);

	ВыводитьСообщениеОбОшибкахВИнформационноеПоле = обПраво(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,глПрава);
	// Потом отключим
	глПрава.Вставить(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,Ложь);
	глПрава.Вставить(ПВХ.ПроверкаДоступаКСправочникамИДокументам,Ложь);
	глПрава.Вставить(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,Ложь);
	глПрава.Вставить(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,Ложь);
	
	// SUIG+ дополнение - не требуется выполнять заполнение прав и настроек в случае,
	// если это подчиненный узел, в котором отцепили главный узел, затем загрузили конфигурацию
	// главного узла. При появлении нового документа в главном узле это чревато дублированием
	// настроек - одна создасется прямо сейчас, другая - при чтении сообщения от главного
	ЗаполнятьПрава = Ложь;
	ЭтотУзел = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Ссылка;
	ЭтотУзелИБ = ЭтотУзел.ИнформационнаяБаза;
	Если НЕ ЭтотУзелИБ.Пустая() Тогда
		РодительЭтотУзелИБ = ЭтотУзелИБ.Родитель; // верный родитель в соотв.со структурой ИБ
		
		ГлавныйУзел = ПланыОбмена.ГлавныйУзел();
		// проверка - если нет узла -> родитель по Структуре ИБ, но подчиненный по узлам, то отцепления не было
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдаленныеПодразделения.Ссылка КАК УзелОбмена
		|ИЗ
		|	ПланОбмена.УдаленныеПодразделения КАК УдаленныеПодразделения
		|ГДЕ
		|	УдаленныеПодразделения.Ссылка <> &ЭтотУзел
		|	И УдаленныеПодразделения.Ссылка <> &ГлавныйУзел
		|	И УдаленныеПодразделения.ИнформационнаяБаза = &РодительЭтотУзелИБ ";
		Запрос.УстановитьПараметр("ЭтотУзел",ЭтотУзел);
		Запрос.УстановитьПараметр("ГлавныйУзел",ГлавныйУзел);
		Запрос.УстановитьПараметр("РодительЭтотУзелИБ",РодительЭтотУзелИБ);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() Тогда
			ЗаполнятьПрава = Истина; 
		КонецЕсли;
	Иначе
		ЗаполнятьПрава = Истина; // не с чем сравнить
	КонецЕсли; 
	
	Если НЕ ЗаполнятьПрава Тогда
		СтрСообщения = "При проверке заполнения прав и настроек обнаружено несоответствие иерархии узлов плана обмена <" + ЭтотУзелИБ.Наименование + ">"
		+ " и <" + РодительЭтотУзелИБ.Наименование + ">. Возможно было произведено ""снятие"" главного узла для текущего узла"
		+ Символы.ПС + " <" + ЭтотУзелИБ.Наименование + ">. В данном случае необходимо установить узел <" + РодительЭтотУзелИБ.Наименование + ">"
		+ " в качестве главного узла"; 
		#Если Клиент Тогда
			ТекДата = Формат(ТекущаяДата(),"ДФ='HH:mm:ss dd.MM'") + " ";
			Сообщить(ТекДата + СтрСообщения,СтатусСообщения.Внимание);
		#КонецЕсли 
		ЗаписьЖурналаРегистрации("Обновление", УровеньЖурналаРегистрации.Предупреждение, , , СтрСообщения);
	КонецЕсли; 
	// SUIG-

	Если НЕ ПервыйЗапускВДочернемУзле И ЗаполнятьПрава Тогда
		// Это все барахло мы все равно сейчас будем получать в сообщении от главного узла
		//так что лучше пропустим эти лишние в данный момент действия
		Объект=ПланыВидовХарактеристик.ПраваИНастройки.СоздатьЭлемент();
		Состояние("Выполняются проверки правил префиксации...");
		Объект.ПроверитьПравилаПрефиксации();
		Состояние("Выполняются проверки правил доступа...");
		Объект.ПроверитьПраваДоступа();
		Состояние("Выполняются проверки правил миграции...");
		Объект.ПроверитьПравилаМиграции();
		глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	КонецЕсли;

	//выполним проверку и заполнение предопределенных элементов справочников
	ЗаполнитьПредопределенныеЭлементы();
	Сообщить("--------------------------------------------------------");
	
	//// Подготовка к выводу формы изменений в новом релизе
	ФормаОбновлений = ПолучитьФорму("ФормаОбновлений");
	МакетОбновлений    = ПодготовитьМакетОписаниеОбновлений(ФормаОбновлений);
	ДокументОбновлений = ФормаОбновлений.ЭлементыФормы.ДокументОписаниеОбновлений;
	ДокументОбновлений.Очистить();
	ФормаОбновлений.НеПоказыватьИзмененияПриОткрытии = Истина;
	
	//НомерРелизаКонфигурации = Лев(Константы.НомерРелизаКонфигурации.Получить(),7);
    НомерРелизаКонфигурации = Лев(Константы.НомерРелизаКонфигурации.Получить(),10);
	
	// Case по вариантам обновления
	Если ПустаяСтрока(НомерРелизаКонфигурации) Тогда
		// Начальное заполнение базы
		Сообщить("Производится начальное заполнение информационной базы...");
		Сообщить("--------------------------------------------------------");
		
		// Вывод строк описания при первом старте
		ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("ШапкаЗаполнениеПустойИБ"));
		ДокументОбновлений.НачатьГруппуСтрок("Заполнение пустой ИБ");
		ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("ЗаполнениеПустойИБ"));
		ДокументОбновлений.ЗакончитьГруппуСтрок();
		
		Константы.ИнтервалПроверкиНапоминаний.Установить(5);
		Сообщить("Константа ""Интервал проверки напоминаний"" установлена в 5 минут");
		
		// Заполним порядок распределения статей доходов и расходов
		// Если регистр уже содержит записи, то очистим
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПорядокЗакрытияБалансовыхСтатей.Статья.Ссылка
		|ИЗ
		|	РегистрСведений.ПорядокЗакрытияБалансовыхСтатей КАК ПорядокЗакрытияБалансовыхСтатей";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			// Удаляем все движения
			НаборЗаписей = РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.СоздатьНаборЗаписей();
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		// Заполнение регистра
		РегистрыСведений.ПорядокЗакрытияБалансовыхСтатей.ЗаполнитьПредопределенныеЭлементы();
		Сообщить("Заполнен регистр порядок распределения статей доходов и расходов");
	Иначе // Никаких общих сообщений не выводим
	КонецЕсли; 
	
	// Обновление информационной базы до релиза 5.0.02.01
	Если НомерРелизаКонфигурации < "5.0.02.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.02.01");
		Попытка		ОбновитьДо_5_0_02_01();
		Исключение	Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500201", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.03.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.03.01");
		Попытка
			ОбновитьДо_5_0_03_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500301", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.02");
		Попытка
			ОбновитьДо_5_0_05_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500502", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.07" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.07");
		Попытка
			ОбновитьДо_5_0_05_07();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500507", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.08" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.08");
		Попытка
			ОбновитьДо_5_0_05_08();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500508", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.05.09" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.05.09");
		Попытка
			ОбновитьДо_5_0_05_09();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500509", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.06.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.06.01");
		Попытка
			ОбновитьДо_5_0_06_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500601", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.01");
		Попытка
			ОбновитьДо_5_0_07_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.02");
		Попытка
			ОбновитьДо_5_0_07_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.07.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.07.03");
		Попытка
			ОбновитьДо_5_0_07_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.08.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.08.04");
		Попытка
			ОбновитьДо_5_0_08_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.10.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.10.02");
		Попытка
			ОбновитьДо_5_0_10_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.11.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.11.05");
		Попытка
			ОбновитьДо_5_0_11_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.13.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.13.03");
		Попытка
			ОбновитьДо_5_0_13_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.0.13.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.0.13.04");
		Попытка
			ОбновитьДо_5_0_13_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.01.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.01.03");
		Попытка
			ОбновитьДо_5_1_01_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.02.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.02.02");
		Попытка
			ОбновитьДо_5_1_02_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
		// Необходимо заменить первый параметр хххххх на номер релиза,
		// для которого выводится описание изменений из шаблона
		//ВывестиОписаниеИзменений("500701", ДокументОбновлений, МакетОбновлений);
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.02.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.02.03");
		Попытка
			ОбновитьДо_5_1_02_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.02.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.02.04");
		Попытка
			ОбновитьДо_5_1_02_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.02.09" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.02.09");
		Попытка
			ОбновитьДо_5_1_02_09();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
		
	Если НомерРелизаКонфигурации < "5.1.03.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.03.03");
		Попытка
			ОбновитьДо_5_1_03_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.03.07" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.03.07");
		Попытка
			ОбновитьДо_5_1_03_07();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.03.08" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.03.08");
		Попытка
			ОбновитьДо_5_1_03_08();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.05.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.05.02");
		Попытка
			ОбновитьДо_5_1_05_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.05.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.05.03");
		Попытка
			ОбновитьДо_5_1_05_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.05.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.05.05");
		Попытка
			ОбновитьДо_5_1_05_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.06.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.06.03");
		Попытка
			ОбновитьДо_5_1_06_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.06.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.06.05");
		Попытка
			ОбновитьДо_5_1_06_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.07.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.07.02");
		Попытка
			ОбновитьДо_5_1_07_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.07.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.07.04");
		Попытка
			ОбновитьДо_5_1_07_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.07.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.07.05");
		Попытка
			ОбновитьДо_5_1_07_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.08.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.08.02");
		Попытка
			ОбновитьДо_5_1_08_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.10.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.10.02");
		Попытка
			ОбновитьДо_5_1_10_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.10.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.10.05");
		Попытка
			ОбновитьДо_5_1_10_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.11.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.11.02");
		Попытка
			ОбновитьДо_5_1_11_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.13.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.13.03");
		Попытка
			ОбновитьДо_5_1_13_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.15.16" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.15.16");
		Попытка
			ОбновитьДо_5_1_15_16();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.17.09" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.17.09");
		Попытка
			ОбновитьДо_5_1_17_09();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.19.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.19.02");
		Попытка
			ОбновитьДо_5_1_19_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.20.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.20.02");
		Попытка
			ОбновитьДо_5_1_20_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.22.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.22.02");
		Попытка
			ОбновитьДо_5_1_22_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.23.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.23.05");
		Попытка
			ОбновитьДо_5_1_23_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.23.06" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.23.06");
		Попытка
			ОбновитьДо_5_1_23_06();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.24.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.24.05");
		Попытка
			ОбновитьДо_5_1_24_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.24.06" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.24.06");
		Попытка
			ОбновитьДо_5_1_24_06();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.25.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.25.03");
		Попытка
			ОбновитьДо_5_1_25_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.30.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.30.03");
		Попытка
			ОбновитьДо_5_1_30_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.30.06" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.30.06");
		Попытка
			ОбновитьДо_5_1_30_06();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.31.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.31.03");
		Попытка
			ОбновитьДо_5_1_31_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.31.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.31.04");
		Попытка
			ОбновитьДо_5_1_31_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;

	Если НомерРелизаКонфигурации < "5.1.33.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.33.05");
		Попытка
			ОбновитьДо_5_1_33_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.34.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.34.03");
		Попытка
			ОбновитьДо_5_1_34_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;

	Если НомерРелизаКонфигурации < "5.1.37.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.37.02");
		Попытка
			ОбновитьДо_5_1_37_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;	
	
	Если НомерРелизаКонфигурации < "5.1.37.03" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.37.03");
		Попытка
			ОбновитьДо_5_1_37_03();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.37.04" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.37.04");
		Попытка
			ОбновитьДо_5_1_37_04();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.38.02" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.38.02");
		Попытка
			ОбновитьДо_5_1_38_02();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	Если НомерРелизаКонфигурации < "5.1.41.01" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.41.01");
		Попытка
			ОбновитьДо_5_1_41_01();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;

	Если НомерРелизаКонфигурации < "5.1.41.05" Тогда
		Сообщить("Производится обновление ИБ до релиза 5.1.41.05");
		Попытка
			ОбновитьДо_5_1_41_05();
		Исключение
			Сообщить("Ошибка при обновлении - "+ОписаниеОшибки(),СтатусСообщения.Важное);
		КонецПопытки;
		Сообщить("--------------------------------------------------------");
	КонецЕсли;
	
	// Восстановим исходное состояние проверок и сообщений
	глПрава.Вставить(ПВХ.ВыводитьСообщенияПроверкиПравДоступа,ВыводитьСообщенияПроверкиПравДоступа);
	глПрава.Вставить(ПВХ.ПроверкаДоступаКСправочникамИДокументам,ПроверкаДоступаКСправочникамИДокументам);
	глПрава.Вставить(ПВХ.ПроверкаЗаполненияСправочниковИДокументов,ПроверкаЗаполненияСправочниковИДокументов);
	глПрава.Вставить(ПВХ.ВыводитьСообщениеОбОшибкахВИнформационноеПоле,ВыводитьСообщениеОбОшибкахВИнформационноеПоле);
	
	// Обновление выполнено успешно
	Константы.НомерРелизаКонфигурации.Установить(Метаданные.Версия);
	Сообщить("Обновление информационной базы до релиза <"+Метаданные.Версия+"> завершено !");
	
	//Выведем Форму со списком обновлений в релизе
	#Если Клиент Тогда
	Если ДокументОбновлений.ВысотаТаблицы > 0 Тогда
		ФормаОбновлений.Открыть();
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

// Функция получает макет описания обновлений и заполняет его параметры расшифровок.
//
// Параметры:
//  ФормаОписаниеОбновлений - форма обработки "ОписаниеОбновлений", 
//                            назначается владельцем открываемых из нее форм.
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет "ОписаниеОбновлений" с заполненными параметрами расшифровок.
//
Функция ПодготовитьМакетОписаниеОбновлений(ФормаОписаниеОбновлений) Экспорт

	МакетОписаниеОбновлений = ПолучитьМакет("МакетОбновлений");
	Параметры               = МакетОписаниеОбновлений.Параметры;

	// Заполнение параметров расшифровок макета описания обновлений,

	Параметры.ФормаПодбораВалют            = Справочники.Валюты.ПолучитьФорму("ФормаПодбораИзКлассификатора");
	Параметры.ФормаСпискаВалют             = Справочники.Валюты.ПолучитьФормуСписка();
	Параметры.ФормаЗагрузкиКурсов          = Обработки.КурсыВалютРБК.ПолучитьФорму();
	Параметры.ФормаПодбораЕдиниц           = Справочники.КлассификаторЕдиницИзмерения.ПолучитьФорму("ФормаПодбораИзКлассификатора");
	Параметры.ФормаСпискаЕдиниц            = Справочники.КлассификаторЕдиницИзмерения.ПолучитьФормуСписка();
	
	Параметры.ФормаСпискаКонтрагентов      = Справочники.Контрагенты.ПолучитьФормуСписка();
	Параметры.ФормаСпискаСотрудников       = Справочники.Сотрудники.ПолучитьФормуСписка();
	Параметры.ФормаСпискаНоменклатуры      = Справочники.Номенклатура.ПолучитьФормуСписка();
	Параметры.ФормаСпискаТиповНоменклатуры = Справочники.ТипыНоменклатуры.ПолучитьФормуСписка();
	Параметры.ФормаСпискаСклады			   = Справочники.СкладыКомпании.ПолучитьФормуСписка();
	Параметры.ФормаСпискаТиповЦен          = Справочники.ТипыЦен.ПолучитьФормуСписка();
	Параметры.ФормаНовойОрганизации 	   = Справочники.Организации.ОсновнаяОрганизация.ПолучитьФорму();
	Параметры.ФормаСпискаОрганизаций       = Справочники.Организации.ПолучитьФормуСписка();
	Параметры.ФормаСпискаПодразделений     = Справочники.ПодразделенияКомпании.ПолучитьФормуСписка();

	Параметры.ФормаКонстант                = Константы.ПолучитьФорму();
	Параметры.ФормаСпискаПользователей     = Справочники.Пользователи.ПолучитьФормуСписка();
	Параметры.ФормаПользователя            = ПараметрыСеанса.Пользователь;
	Параметры.ФормаПравИНастроек	       = "ФормаПравИНастроек";
	
	Параметры.ФормаАдресногоКлассификатора = РегистрыСведений.АдресныйКлассификатор.ПолучитьФормуСписка();
	Параметры.ФормаСтанцииМетро			   = Справочники.СтанцииМетро.ПолучитьФормуСписка();
	Параметры.ФормаРайонов				   = Справочники.Районы.ПолучитьФормуСписка();

	Возврат МакетОписаниеОбновлений;

КонецФункции // ПодготовитьМакетОписаниеОбновлений()

// Заполнение предопределенных элементов справочников, ПВХ и т.п.
// Предназначена для установки незаполненных реквизитов предопределенных элементов
// Выполняется при любом обновлении конфигурации и вызывает приватные процедуры
// заполнения каждого справочника (ПВХ), где это поддерживается, через его макет.
// Процедура универсальна для нескольких типовых решений и обрабатывает каждый
// конкретный объект через Попытку/Исключение (некоторых может не быть в конфигурации)
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	//Подготовим список объектов, подлежащих первоначальному заполнению
	//Порядок следования объектов заполнения от подчиненных
	СписокЗначенийЗаполнения=Новый СписокЗначений;
	//Классификаторы и свойства
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.НазначенияСвойствОбъектов,Метаданные.ПланыВидовХарактеристик.НазначенияСвойствОбъектов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Валюты,Метаданные.Справочники.Валюты.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Должности,Метаданные.Справочники.Должности.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КлассификаторЕдиницИзмерения,Метаданные.Справочники.КлассификаторЕдиницИзмерения.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатьиДДС,Метаданные.Справочники.СтатьиДДС.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатьиДоходовИРасходов,Метаданные.Справочники.СтатьиДоходовИРасходов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СтавкиНДС,Метаданные.Справочники.СтавкиНДС.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыОплат,Метаданные.Справочники.ТипыОплат.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыНоменклатуры,Метаданные.Справочники.ТипыНоменклатуры.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыЦен,Метаданные.Справочники.ТипыЦен.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ТипыСделок,Метаданные.ПланыВидовХарактеристик.ТипыСделок.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ТипыПартий,Метаданные.ПланыВидовХарактеристик.ТипыПартий.Представление(),Ложь);
	//Контактная информация
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыКонтактнойИнформации,Метаданные.Справочники.ВидыКонтактнойИнформации.Представление(),Ложь);
	//Графики и смены
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыИнтервалов,Метаданные.Справочники.ВидыИнтервалов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Смены,Метаданные.Справочники.Смены.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ГрафикиРаботы,Метаданные.Справочники.ГрафикиРаботы.Представление(),Ложь);
	//Организационная структура компании
	СписокЗначенийЗаполнения.Добавить(Справочники.Организации,Метаданные.Справочники.Организации.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ПодразделенияКомпании,Метаданные.Справочники.ПодразделенияКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Пользователи,Метаданные.Справочники.Пользователи.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КассыКомпании,Метаданные.Справочники.КассыКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.СкладыКомпании,Метаданные.Справочники.СкладыКомпании.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Цеха,Метаданные.Справочники.Цеха.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовРасчета.НачисленияИУдержания,Метаданные.ПланыВидовРасчета.НачисленияИУдержания.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.УчетныеЗаписиЭлектроннойПочты,Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.АналитическиеРазрезыПланирования,Метаданные.ПланыВидовХарактеристик.АналитическиеРазрезыПланирования.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ПараметрыПланирования,Метаданные.ПланыВидовХарактеристик.ПараметрыПланирования.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыПлановКомпании,Метаданные.Справочники.ВидыПлановКомпании.Представление(),Ложь);
	//Номенклатура
	СписокЗначенийЗаполнения.Добавить(Справочники.Номенклатура,Метаданные.Справочники.Номенклатура.Представление(),Ложь);
	//Внешние печатные формы
	СписокЗначенийЗаполнения.Добавить(Справочники.ВнешниеПечатныеФормы,Метаданные.Справочники.ВнешниеПечатныеФормы.Представление(),Ложь);
	//Распределенная структура информационной базы
	СписокЗначенийЗаполнения.Добавить(Справочники.НастройкиДоставкиСообщений,Метаданные.Справочники.НастройкиДоставкиСообщений.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ПравилаМиграцииИДоступа,Метаданные.Справочники.ПравилаМиграцииИДоступа.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(ПланыОбмена.УдаленныеПодразделения,Метаданные.ПланыОбмена.УдаленныеПодразделения.Представление(),Ложь);
	//Идентификация
	СписокЗначенийЗаполнения.Добавить(Справочники.Контрагенты,Метаданные.Справочники.Контрагенты.Представление(),Ложь);
	//Прочее
	СписокЗначенийЗаполнения.Добавить(Справочники.Карточки,Метаданные.Справочники.Карточки.Представление(),Ложь);
	//Автосервис
	СписокЗначенийЗаполнения.Добавить(Справочники.Автоработы,Метаданные.Справочники.Автоработы.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Нормочасы,Метаданные.Справочники.Нормочасы.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВариантыКомплектации,Метаданные.Справочники.ВариантыКомплектации.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыОтметокВремени,Метаданные.Справочники.ВидыОтметокВремени.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыСостоянийЗаказНарядов,Метаданные.Справочники.ВидыСостоянийЗаказНарядов.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ВидыРемонта,Метаданные.Справочники.ВидыРемонта.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.КатегорииТранспортныхСредств,Метаданные.Справочники.КатегорииТранспортныхСредств.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Дефекты,Метаданные.Справочники.Дефекты.Представление(),Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.ШаблоныТекстовыхСообщений,Метаданные.Справочники.ШаблоныТекстовыхСообщений.Предопределенные,Ложь);
	СписокЗначенийЗаполнения.Добавить(Справочники.Действия,Метаданные.Справочники.Действия.Предопределенные,Ложь);
	
	// ККТ
	СписокЗначенийЗаполнения.Добавить(Справочники.ТипыМаркировки,Метаданные.Справочники.ТипыМаркировки.Предопределенные,Ложь);
	
	// Взаимоотношения с клиентами
	СписокЗначенийЗаполнения.Добавить(Справочники.СтатусыРабочегоЛиста,Метаданные.Справочники.СтатусыРабочегоЛиста.Представление(),Ложь);
	// // Заполняем ПВХ ВопросыДляАнкетирования, а именно предопределенные вопросы.
	СписокЗначенийЗаполнения.Добавить(ПланыВидовХарактеристик.ВопросыДляАнкетирования,Метаданные.ПланыВидовХарактеристик.ВопросыДляАнкетирования.Представление(),Ложь);
		
	//Заполним предопределенные элементы объектов
	Для каждого ЭлементЗаполнения Из СписокЗначенийЗаполнения Цикл
		Попытка
			Состояние("Проверка заполнения <"+ЭлементЗаполнения.Представление+">");
			ЭлементЗаполнения.Значение.ЗаполнитьПредопределенныеЭлементы(ЭлементЗаполнения.Пометка);
		Исключение
			Сообщить("Ошибка при заполнении объектов <"+ЭлементЗаполнения.Представление+">: "+ОписаниеОшибки());
		КонецПопытки; 
	КонецЦикла; 
	
КонецПроцедуры

// Обновление до х.х.хх.хх
//
Процедура ОбновитьДо_5_0_01_01()
	//Шаблон процедуры обновления	
КонецПроцедуры

// Обновление до 5.0.02.01
//
Процедура ОбновитьДо_5_0_02_01()
	//Обновление флага выработки сотрудников по заказ-нарядам
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЗаказНаряд.Ссылка КАК ЗаказНаряд,
	             |	ЗаказНаряд.Представление КАК Представление,
	             |	ЗаказНаряд.ВидРемонта КАК ВидРемонта,
	             |	ЗаказНаряд.ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда КАК ВидРемонтаВыработкаСотрудниковПоВыполнениюЗаказНаряда,
				 |	ЗаказНаряд.Состояние КАК Состояние,
				 |	ЗаказНаряд.ДатаОкончания КАК ДатаОкончания,
				 |	ЗаказНаряд.ДатаЗакрытия КАК ДатаЗакрытия
				 |ИЗ
	             |	Документ.ЗаказНаряд КАК ЗаказНаряд
	             |ГДЕ
	             |	ЗаказНаряд.ВыработкаСотрудниковПоВыполнениюЗаказНаряда <> ЗаказНаряд.ВидРемонта.ВыработкаСотрудниковПоВыполнениюЗаказНаряда
	             |	ИЛИ
				 |	(ЗаказНаряд.Состояние=ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт) И ЗаказНаряд.ДатаЗакрытия = &ДатаПустая)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ЗаказНаряд.Дата";
	Запрос.УстановитьПараметр("ДатаПустая",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление флага начисления выработки сотрудников по заказ-нарядам ...");
		Пока Выборка.Следующий() Цикл
			ЗаказНарядОбъект=Выборка.ЗаказНаряд.ПолучитьОбъект();
			ЗаказНарядОбъект.ВыработкаСотрудниковПоВыполнениюЗаказНаряда=Выборка.ВидРемонтаВыработкаСотрудниковПоВыполнениюЗаказНаряда;
			Если Выборка.Состояние=Справочники.ВидыСостоянийЗаказНарядов.Закрыт И обЗначениеНеЗаполнено(Выборка.ДатаЗакрытия) Тогда
				ЗаказНарядОбъект.ДатаЗакрытия=Выборка.ДатаОкончания;
			КонецЕсли; 
			ЗаказНарядОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ЗаказНарядОбъект.Записать();
				Сообщить("Обновлен заказ-наряд <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления заказ-наряда <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление флага начисления выработки сотрудников по заказ-нарядам завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.03.01
//
Процедура ОбновитьДо_5_0_03_01()
	
	//Обновление уведомления о резервировании заказов покупателей
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Свойство.Использование = Истина;
	НаборЗаписей.Отбор.Свойство.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Свойство.Значение      = ПланыВидовХарактеристик.СвойстваОбъектов.УведомлениеОРезервировании;
	НаборЗаписей.Прочитать();
	
	Счетчик = 0;
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ТипЗнч(ТекЗапись.Значение) = Тип("Булево") Тогда
			Если ТекЗапись.Значение = Истина Тогда
				ТекЗапись.Значение = 1;
			Иначе
				ТекЗапись.Значение = 0;
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	Если Счетчик > 0 Тогда
		НаборЗаписей.Записать(Истина);
		Сообщить("Обновлены уведомления о резервировании заказов покупателей.");
	КонецЕсли;
	
	// Обновление наименования клиента в рабочих листах
	ЗапросРабочихЛистов			= Новый Запрос();
	ЗапросРабочихЛистов.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛист.Ссылка КАК Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛист КАК РабочийЛист";
	ВыборкаРабочихЛистов	= ЗапросРабочихЛистов.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистов.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистов.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Контрагент) Тогда
			ТекОбъект	= ВыборкаРабочихЛистов.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Контрагент	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Обновление наименования клиента в рабочих листах кредитного отдела
	ЗапросРабочихЛистовКО	= Новый Запрос();
	ЗапросРабочихЛистовКО.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛистКредитногоОтдела.Ссылка КАК Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела";
	ВыборкаРабочихЛистовКО	= ЗапросРабочихЛистовКО.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистовКО.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистовКО.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Клиент) Тогда
			ТекОбъект	= ВыборкаРабочихЛистовКО.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Клиент	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Обновление наименования клиента в рабочих листах отдела страхования
	ЗапросРабочихЛистовОС	= Новый Запрос();
	ЗапросРабочихЛистовОС.Текст	= "ВЫБРАТЬ
	                         	  |	РабочийЛистОтделаСтрахования.Ссылка
	                         	  |ИЗ
	                         	  |	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования";
	ВыборкаРабочихЛистовОС	= ЗапросРабочихЛистовОС.Выполнить().Выбрать();
	Пока ВыборкаРабочихЛистовОС.Следующий() Цикл
		СсылкаНаДокумент	= ВыборкаРабочихЛистовОС.Ссылка;
		// Чтобы не потерять наименование клиента, когда не заполнен контрагент, его
		// необходимо перенести
		Если обЗначениеНеЗаполнено(СсылкаНаДокумент.Страхователь) Тогда
			ТекОбъект	= ВыборкаРабочихЛистовОС.Ссылка.ПолучитьОбъект();
			Если ТекОбъект<>Неопределено Тогда
				ТекОбъект.Страхователь	= СсылкаНаДокумент.УдалитьНаименованиеКлиента;
				Попытка
					ТекОбъект.Записать();
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// В регистр сведений добавлено измерение Автор, которое необходимо заполнить
	ЗапросКонтактов			= Новый Запрос();
	ЗапросКонтактов.Текст	= "ВЫБРАТЬ
	                     	  |	РегистрацияЗвонковИКонтактов.Автор,
	                     	  |	РегистрацияЗвонковИКонтактов.ДатаДень,
	                     	  |	РегистрацияЗвонковИКонтактов.ДатаВремя,
	                     	  |	РегистрацияЗвонковИКонтактов.Сотрудник,
	                     	  |	РегистрацияЗвонковИКонтактов.Клиент,
	                     	  |	РегистрацияЗвонковИКонтактов.Организация,
	                     	  |	РегистрацияЗвонковИКонтактов.Подразделение,
	                     	  |	РегистрацияЗвонковИКонтактов.Модель,
	                     	  |	РегистрацияЗвонковИКонтактов.ВидКонтакта,
	                     	  |	РегистрацияЗвонковИКонтактов.Реклама,
	                     	  |	РегистрацияЗвонковИКонтактов.ВторичныйКонтакт,
	                     	  |	РегистрацияЗвонковИКонтактов.ЮридическоеЛицо,
	                     	  |	РегистрацияЗвонковИКонтактов.Примечание
	                     	  |ИЗ
	                     	  |	РегистрСведений.РегистрацияЗвонковИКонтактов КАК РегистрацияЗвонковИКонтактов";
	ВыборкаКонтактов		= ЗапросКонтактов.Выполнить().Выбрать();
	ТаблицаЗвонковВстреч	= РегистрыСведений.РегистрацияЗвонковИКонтактов.СоздатьНаборЗаписей();
	Пока ВыборкаКонтактов.Следующий() Цикл		
		Если НЕ обЗначениеНеЗаполнено(ВыборкаКонтактов.Автор) Тогда Продолжить; КонецЕсли;
		
		ТаблицаЗвонковВстреч.Отбор.Автор.Установить(Справочники.Пользователи.ПустаяСсылка());
		ТаблицаЗвонковВстреч.Отбор.ДатаДень.Установить(ВыборкаКонтактов.ДатаДень);
		ТаблицаЗвонковВстреч.Отбор.ДатаВремя.Установить(ВыборкаКонтактов.ДатаВремя);
		ТаблицаЗвонковВстреч.Отбор.Сотрудник.Установить(ВыборкаКонтактов.Сотрудник);
		ТаблицаЗвонковВстреч.Отбор.Клиент.Установить(ВыборкаКонтактов.Клиент);
		ТаблицаЗвонковВстреч.Прочитать();
		ТаблицаЗвонковВстреч.Очистить();
		Попытка
			ТаблицаЗвонковВстреч.Записать();
		Исключение КонецПопытки;
		
		ТаблицаЗвонковВстреч.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
		ТаблицаЗвонковВстреч.Прочитать();
		
		НоваяСтрока						= ТаблицаЗвонковВстреч.Добавить();
		НоваяСтрока.Автор				= ПараметрыСеанса.Пользователь;
		НоваяСтрока.ДатаДень			= ВыборкаКонтактов.ДатаДень;
		НоваяСтрока.ДатаВремя			= ВыборкаКонтактов.ДатаВремя;
		НоваяСтрока.Сотрудник			= ВыборкаКонтактов.Сотрудник;
		НоваяСтрока.Клиент				= ВыборкаКонтактов.Клиент;
		НоваяСтрока.ВидКонтакта			= ВыборкаКонтактов.ВидКонтакта;
		НоваяСтрока.Реклама				= ВыборкаКонтактов.Реклама;
		НоваяСтрока.Модель				= ВыборкаКонтактов.Модель;
		НоваяСтрока.ВторичныйКонтакт	= ВыборкаКонтактов.ВторичныйКонтакт;
		НоваяСтрока.ЮридическоеЛицо		= ВыборкаКонтактов.ЮридическоеЛицо;
		НоваяСтрока.Организация			= ВыборкаКонтактов.Организация;
		НоваяСтрока.Подразделение		= ВыборкаКонтактов.Подразделение;
		НоваяСтрока.Примечание			= ВыборкаКонтактов.Примечание;
		
		Попытка
			ТаблицаЗвонковВстреч.Записать();
		Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Обновление до 5.0.05.02
//
Процедура ОбновитьДо_5_0_05_02()
	// Обновление работ по видам ремонта
	Запрос=Новый Запрос();
	Запрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
	            	  |	ВидыРемонтаРаботы.Ссылка КАК ВидРемонта
	            	  |ИЗ
	            	  |	Справочник.ВидыРемонта.Работы КАК ВидыРемонтаРаботы
	            	  |ГДЕ
	            	  |	ВидыРемонтаРаботы.Количество = 0";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление работ по видам ремонта ...");
		Пока Выборка.Следующий() Цикл
			ВидРемонтаСсылка=Выборка.ВидРемонта;
			ВидРемонтаОбъект=ВидРемонтаСсылка.ПолучитьОбъект();
			Для каждого СтрокаРабот Из ВидРемонтаОбъект.Работы Цикл
				Если СтрокаРабот.Количество=0 Тогда
					СтрокаРабот.Количество=1;
				КонецЕсли; 
			КонецЦикла; 
			ВидРемонтаОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ВидРемонтаОбъект.Записать();
				Сообщить("Обновлен вид ремонта <"+ВидРемонтаСсылка+">.");
			Исключение
				Сообщить("Ошибка обновления вида ремонта <"+ВидРемонтаСсылка+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление работ по видам ремонта завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.05.07
//
Процедура ОбновитьДо_5_0_05_07()
	// Обновление переразмещений товаров
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ПереразмещениеТоваров.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПереразмещениеТоваров КАК ПереразмещениеТоваров
	             |ГДЕ
	             |	ПереразмещениеТоваров.СкладПолучатель = &СкладПустой
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
	Запрос.УстановитьПараметр("СкладПустой",Справочники.СкладыКомпании.ПустаяСсылка());
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление документов ""Переразмещение товаров"" ...");
		Пока Выборка.Следующий() Цикл
			ПереразмещениеТоваровСсылка=Выборка.Ссылка;
			ПереразмещениеТоваровОбъект=ПереразмещениеТоваровСсылка.ПолучитьОбъект();
			ПереразмещениеТоваровОбъект.СкладПолучатель=ПереразмещениеТоваровОбъект.СкладКомпании;
			ПереразмещениеТоваровОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ПереразмещениеТоваровОбъект.Записать();
				Сообщить("Обновлен документ <"+ПереразмещениеТоваровСсылка+">.");
			Исключение
				Сообщить("Ошибка обновления документа <"+ПереразмещениеТоваровСсылка+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЦикла;
		Сообщить("Обновление документов ""Переразмещение товаров"" завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.05.08
//
Процедура ОбновитьДо_5_0_05_08()
	// Обновление состояний заказ-нарядов
	Сообщить("Обновление справочника ""Состояния заказ-нарядов"" ...");
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.НачатьРаботу.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Древесный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.ВРаботе.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.БледноМиндальный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.Выполнен.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.ГолубойСоСтальнымОттенком);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.ВидыСостоянийЗаказНарядов.Закрыт.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Розовый);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	Сообщить("Обновление справочника ""Состояния заказ-нарядов"" завершено.");
КонецПроцедуры

// Обновление до 5.0.05.09
//
Процедура ОбновитьДо_5_0_05_09()
	Сообщить("Обновление регистра сведений ""Журнал состояний"" ...");
	// перезапись автора из регистра ЖурналСостояний из типа строка в тип пользователи
	НаборЗаписейЖурналСостояний = РегистрыСведений.ЖурналСостояний.СоздатьНаборЗаписей();
	НаборЗаписейЖурналСостояний.Прочитать();
	
	Для Каждого ЗаписьРегистра Из НаборЗаписейЖурналСостояний Цикл
		Если ТипЗнч(ЗаписьРегистра.Автор) = Тип("Строка") Тогда
			// так как длинна наименования в справочнике 100, а в регистре 50 то поиск по не полному соответствию
			СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ЗаписьРегистра.Автор,Ложь,,);
			Если НЕ обЗначениеНеЗаполнено(СсылкаНаПользователя) Тогда
				ЗаписьРегистра.Автор =СсылкаНаПользователя;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		НаборЗаписейЖурналСостояний.Записать();
	Исключение
		Сообщить("Ошибка обновления регистра сведений ""Журнал состояний"": "+ОписаниеОшибки());
	КонецПопытки;
	
	Сообщить("Обновление регистра сведений ""Журнал состояний"" завершено.");
КонецПроцедуры

// Обновление до 5.0.06.01
//
Процедура ОбновитьДо_5_0_06_01()
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("ПроверкаСМС");
	Если РегламентноеЗадание.Параметры.Количество() = 0 Тогда
		СтруктураПараметров = Новый Структура;
		Параметры = Новый Массив;
		Параметры.Добавить(СтруктураПараметров);
		РегламентноеЗадание.Параметры = Параметры;
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Обновление до 5.0.07.01
//
Процедура ОбновитьДо_5_0_07_01()
	// Обновление переразмещений товаров
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Автомобили.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Автомобили КАК Автомобили
	             |ГДЕ
	             |	Автомобили.ЭтоГруппа = ЛОЖЬ
	             |	И (ВЫРАЗИТЬ(Автомобили.НаименованиеПолное КАК СТРОКА(10))) = """"
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Ссылка";
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление справочника ""Автомобили"" ...");
		Пока Выборка.Следующий() Цикл
			АвтомобильСсылка=Выборка.Ссылка;
			АвтомобильОбъект=АвтомобильСсылка.ПолучитьОбъект();
			ГосНомер=Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(АвтомобильСсылка,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
			АвтомобильОбъект.ФормированиеНаименованияАвтомобиля(ГосНомер,"НаименованиеПолное");
			Если АвтомобильОбъект.Модифицированность() Тогда
				АвтомобильОбъект.ОбменДанными.Загрузка=Истина;
				Попытка
					АвтомобильОбъект.Записать();
					Сообщить("Обновлено полное наименование автомобиля <"+АвтомобильСсылка+">.");
				Исключение
					Сообщить("Ошибка обновления полного наименования автомобиля <"+АвтомобильСсылка+">: "+ОписаниеОшибки());
				КонецПопытки; 
			КонецЕсли; 
		КонецЦикла;
		Сообщить("Обновление справочника ""Автомобили"" завершено.");
	КонецЕсли; 
КонецПроцедуры

// Обновление до 5.0.07.02
//
Процедура ОбновитьДо_5_0_07_02()
	Справочники.ДополнительныеКодыAudatex.ЗаполнитьИзМакета();
КонецПроцедуры

// Обновление до 5.0.07.03
//
Процедура ОбновитьДо_5_0_07_03()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваКомпании.Период КАК Период,
	|	ДенежныеСредстваКомпании.Регистратор,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.Выписка ТОГДА
	|			1
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ВыплатаЗарплаты ТОГДА
	|			2
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств ТОГДА
	|			3
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ТОГДА
	|			4
	|		КОГДА ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер ТОГДА
	|			5
	|	КОНЕЦ КАК ВидДокумента
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
	|ГДЕ
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.Выписка ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ВыплатаЗарплаты ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПеремещениеДенежныхСредств ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер ИЛИ 
	|	ДенежныеСредстваКомпании.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|";
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	НаборЗаписей = РегистрыНакопления.ПлатежныйКалендарь.СоздатьНаборЗаписей();
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщить("Обновление регистра ""Платежный календарь""");
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		//НаборЗаписей = Движения.ПлатежныйКалендарь;
		НаборЗаписей.ДокументОбъект  = Выборка.Регистратор;
		
		Если Выборка.ВидДокумента = 1 Тогда
			Отказ = Не НаборЗаписей.ФактВыписка();
		ИначеЕсли Выборка.ВидДокумента = 2 Тогда
			Отказ = Не НаборЗаписей.ФактВыплата();
		ИначеЕсли Выборка.ВидДокумента = 3 Тогда
			Отказ = Не НаборЗаписей.ФактПеремещение() ИЛИ Отказ;
		ИначеЕсли Выборка.ВидДокумента = 4 Тогда
			НаборЗаписей.Поступление = Истина;
			Отказ = Не НаборЗаписей.Факт();
		ИначеЕсли Выборка.ВидДокумента = 5 Тогда
			НаборЗаписей.Поступление = Ложь;
			Отказ = Не НаборЗаписей.Факт();
		КонецЕсли;
		
		Для Каждого ТекСтрока Из НаборЗаписей Цикл
			ТекСтрока.Период = Выборка.Период;
		КонецЦикла;
		
		Попытка
			Если Не Отказ Тогда
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				НаборЗаписей.ОбменДанными.Загрузка = Ложь;
			КонецЕсли;
		Исключение
				Сообщить("Ошибка обновления регистра ""Платежный календарь"" "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщить("Обновление регистра ""Платежный календарь"" завершено.");
	
КонецПроцедуры

// Обновление до 5.0.08.04
//
Процедура ОбновитьДо_5_0_08_04()
	
	ХранилищаНастроек.ХранилищеВариантовОтчетов.ОбновитьВариантыОтчетов();
	
КонецПроцедуры

// Обновление до 5.0.10.02
//
Процедура ОбновитьДо_5_0_10_02()
	
	//Обновление ДатаНачалаДействия
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИзменениеЦенАвтомобилей.Ссылка КАК ИзменениеЦенАвтомобилей,
	             |	ИзменениеЦенАвтомобилей.Представление
	             |ИЗ
	             |	Документ.ИзменениеЦенАвтомобилей КАК ИзменениеЦенАвтомобилей
	             |ГДЕ
	             |	ИзменениеЦенАвтомобилей.ДатаНачалаДействия = &ДатаНачалаДействия";
	Запрос.УстановитьПараметр("ДатаНачалаДействия",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление даты начала действия цены");
		Пока Выборка.Следующий() Цикл
			ИзменениеЦенАвтомобилейОбъект = Выборка.ИзменениеЦенАвтомобилей.ПолучитьОбъект();
			ИзменениеЦенАвтомобилейОбъект.ДатаНачалаДействия = ИзменениеЦенАвтомобилейОбъект.Дата;
			
			ИзменениеЦенАвтомобилейОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ИзменениеЦенАвтомобилейОбъект.Записать();
				Сообщить("Обновление изменения цен автомобиля <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления изменения цен автомобиля <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	//Обновление ДатаНачалаДействия
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ИзменениеЦенОпций.Ссылка КАК ИзменениеЦенОпций,
	             |	ИзменениеЦенОпций.Представление
	             |ИЗ
	             |	Документ.ИзменениеЦенОпций КАК ИзменениеЦенОпций
	             |ГДЕ
	             |	ИзменениеЦенОпций.ДатаНачалаДействия = &ДатаНачалаДействия";
	Запрос.УстановитьПараметр("ДатаНачалаДействия",Дата('00010101'));
	Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Количество()>0 Тогда
		Сообщить("Обновление даты начала действия цены");
		Пока Выборка.Следующий() Цикл
			ИзменениеЦенОпцийОбъект = Выборка.ИзменениеЦенОпций.ПолучитьОбъект();
			ИзменениеЦенОпцийОбъект.ДатаНачалаДействия = ИзменениеЦенОпцийОбъект.Дата;
			
			ИзменениеЦенОпцийОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ИзменениеЦенОпцийОбъект.Записать();
				Сообщить("Обновление изменения цен автомобиля <"+Выборка.Представление+">.");
			Исключение
				Сообщить("Ошибка обновления изменения цен автомобиля <"+Выборка.Представление+">: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	Сообщить("Обновление справочника ""Варианты отчетов""");
	
	КлючОтчета = Метаданные.Отчеты.ЗагрузкаРесурсовАвтосервиса.ПолноеИмя();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	               |	ВариантыОтчетов.Ссылка
	               |ИЗ
	               |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	               |ГДЕ
	               |	ВариантыОтчетов.КлючОтчета = &КлючОтчета
	               |	И ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ ВариантыОтчетов.ЭтоПредопределенный";
	Запрос.УстановитьПараметр("КлючОтчета", КлючОтчета);
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаВариантов.Количество()>0 Тогда
		МассивИсключений = ТаблицаВариантов.ВыгрузитьКолонку("КлючВарианта");
	КонецЕсли;
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.СоздатьВариантыОтчета(КлючОтчета, МассивИсключений);
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.ОбновитьПризнакПредопределенногоУВариантовОтчета(КлючОтчета, ТаблицаВариантов);
	
	Сообщить("Обновление справочника ""Варианты отчетов"" завершено.");
	
	
КонецПроцедуры

// Обновление до 5.0.11.01
//
Процедура ОбновитьДо_5_0_11_05()
	
	Сообщить("Обновление справочника ""Варианты отчетов""");
	
	КлючОтчета = Метаданные.Отчеты.ЗагрузкаРесурсовАвтосервиса.ПолноеИмя();
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	               |	ВариантыОтчетов.Ссылка
	               |ИЗ
	               |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	               |ГДЕ
	               |	ВариантыОтчетов.КлючОтчета = &КлючОтчета
	               |	И ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	               |	И НЕ ВариантыОтчетов.ЭтоПредопределенный";
	Запрос.УстановитьПараметр("КлючОтчета", КлючОтчета);
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаВариантов.Количество()>0 Тогда
		МассивИсключений = ТаблицаВариантов.ВыгрузитьКолонку("КлючВарианта");
	КонецЕсли;
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.СоздатьВариантыОтчета(КлючОтчета, МассивИсключений);
	
	Отчеты.ЗагрузкаРесурсовАвтосервиса.ОбновитьПризнакПредопределенногоУВариантовОтчета(КлючОтчета, ТаблицаВариантов);
	
	Сообщить("Обновление справочника ""Варианты отчетов"" завершено.");
	
	
	//Обновление статусов рабочих листов
	Сообщить("Обновление справочника ""Статусы рабочего листа"" ...");
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Интерес.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.БледноМиндальный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Одобрен.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.ГолубойСоСтальнымОттенком);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Отказ.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.БледноМиндальный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Подготовка.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Древесный);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Продажа.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.ГолубойСоСтальнымОттенком);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Рассмотрение.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Белый);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Сделка.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Розовый);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки;
	
	СостояниеОбъект=Справочники.СтатусыРабочегоЛиста.Создан.ПолучитьОбъект();
	СостояниеОбъект.Цвет=Новый ХранилищеЗначения(WebЦвета.Белый);
	СостояниеОбъект.ОбменДанными.Загрузка=Истина;
	Попытка
		СостояниеОбъект.Записать();
		Сообщить("Обновлен элемент <"+СостояниеОбъект+">.");
	Исключение
		Сообщить("Ошибка обновления элемента <"+СостояниеОбъект+">: "+ОписаниеОшибки());
	КонецПопытки; 
	Сообщить("Обновление справочника ""Состояния заказ-нарядов"" завершено.");
	
	
КонецПроцедуры

// Обновление до 5.0.13.03
//
Процедура ОбновитьДо_5_0_13_03()
	
	// обновим ауто пад вэб
	#Если Клиент Тогда
		Состояние("Начало обновления AutoPad Web...");
	#КонецЕсли
	
	// получим записи регистра
	НаборЗаписей = РегистрыСведений.ОбменСAudaPadWeb.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	// создадим протатипы таблиц
	Если НаборЗаписей.Количество() > 0 Тогда
		ПрототипТаблицыТоваров = Новый ТаблицаЗначений();
		ПрототипТаблицыТоваров.Колонки.Добавить("ТипРемонта");
		ПрототипТаблицыТоваров.Колонки.Добавить("КодДетали");
		ПрототипТаблицыТоваров.Колонки.Добавить("НаименованиеДетали", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
		ПрототипТаблицыТоваров.Колонки.Добавить("НомерДетали", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ПрототипТаблицыТоваров.Колонки.Добавить("СтоимостьДетали");
		ПрототипТаблицыТоваров.Колонки.Добавить("ЦенаРубли");
		ПрототипТаблицыТоваров.Колонки.Добавить("ЦенаЕвро");
		ПрототипТаблицыТоваров.Колонки.Добавить("Источник");
		ПрототипТаблицыТоваров.Колонки.Добавить("КоличествоДеталей");
		
		ПрототипТаблицыАвторабот = Новый ТаблицаЗначений();
		ПрототипТаблицыАвторабот.Колонки.Добавить("ТипРемонта");
		ПрототипТаблицыАвторабот.Колонки.Добавить("КодДетали");
		ПрототипТаблицыАвторабот.Колонки.Добавить("НомерРаботы"       , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
		ПрототипТаблицыАвторабот.Колонки.Добавить("НаименованиеРаботы", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
		ПрототипТаблицыАвторабот.Колонки.Добавить("НаименованиеДетали", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
		ПрототипТаблицыАвторабот.Колонки.Добавить("СтоимостьРабот");
		ПрототипТаблицыАвторабот.Колонки.Добавить("СтоимостьРабот_Валюта");
		ПрототипТаблицыАвторабот.Колонки.Добавить("ЦенаРубли");
		ПрототипТаблицыАвторабот.Колонки.Добавить("ЦенаЕвро");
		ПрототипТаблицыАвторабот.Колонки.Добавить("КоличествоРП");
		ПрототипТаблицыАвторабот.Колонки.Добавить("КоличествоРП_Измерение");
		ПрототипТаблицыАвторабот.Колонки.Добавить("Время");
		ПрототипТаблицыАвторабот.Колонки.Добавить("Время_Измерение");
		ПрототипТаблицыАвторабот.Колонки.Добавить("Источник");
		ПрототипТаблицыАвторабот.Колонки.Добавить("ОписаниеРаботы", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	КонецЕсли;
	
	// обходим записи
	#Если Клиент Тогда
		КоличествоЗаписей = НаборЗаписей.Количество();
		Сч = 0;
	#КонецЕсли
	
	МассивНекорректныхДанных = Новый Массив;

	Для Каждого Запись Из НаборЗаписей Цикл
		
		#Если Клиент Тогда
			Сч = Сч + 1;
			Состояние("Выполнено "+Окр(Сч/КоличествоЗаписей*100,0)+"%...",);
		#КонецЕсли
		
		Калькуляция = Запись.Калькуляция.Получить();

		Если ПустаяСтрока(Запись.ИдентификаторДела) Тогда
			Запись.ИдентификаторДела = Калькуляция.Получить("ИдДела");
		КонецЕсли;
		
		Товары = Калькуляция.Получить("Товары");
		Автоработы = Калькуляция.Получить("Работы");
		
		ПрототипТаблицыТоваров.Очистить();
		ПрототипТаблицыАвторабот.Очистить();
		
		Для Каждого Строка Из Товары Цикл
			ЗаполнитьЗначенияСвойств(ПрототипТаблицыТоваров.Добавить(), Строка);
		КонецЦикла;
		
		Калькуляция.Вставить("Товары", ПрототипТаблицыТоваров);
		
		Для Каждого Строка Из Автоработы Цикл
			ЗаполнитьЗначенияСвойств(ПрототипТаблицыАвторабот.Добавить(), Строка);
		КонецЦикла;
		
		Калькуляция.Вставить("Работы", ПрототипТаблицыАвторабот);

		Запись.Калькуляция = Новый ХранилищеЗначения(Калькуляция, Новый СжатиеДанных(6));
		
		Если ПустаяСтрока(Запись.ИдентификаторДела) ИЛИ ПустаяСтрока(Запись.ИдентификаторЗадания) Тогда
			МассивНекорректныхДанных.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
		Состояние("Удаление некорректных данных...");
	#КонецЕсли
	
	Для Каждого Запись Из МассивНекорректныхДанных Цикл
		НаборЗаписей.Удалить(Запись);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	#Если Клиент Тогда
		Состояние("Конец обновления AutoPad Web...");
	#КонецЕсли
	
КонецПроцедуры

// Обновление до 5.0.13.04
//
Процедура ОбновитьДо_5_0_13_04()
	
	#Если Клиент Тогда
	Сообщить("Обновление ячеек хранения номенклатуры по умолчанию ...");
	#КонецЕсли
	
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	             |	НоменклатураЯчейкиХраненияУдалить.Ссылка КАК Номенклатура,
	             |	НоменклатураЯчейкиХраненияУдалить.СкладКомпании КАК СкладКомпании,
	             |	НоменклатураЯчейкиХраненияУдалить.ЯчейкаХранения КАК ЯчейкаХранения
	             |ИЗ
	             |	Справочник.Номенклатура.ЯчейкиХраненияУдалить КАК НоменклатураЯчейкиХраненияУдалить";
	ТаблицаЯчеекХранения=Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейЯчейкиХраненияПоУмолчанию=РегистрыСведений.ЯчейкиХраненияПоУмолчанию.СоздатьНаборЗаписей();
	НаборЗаписейЯчейкиХраненияПоУмолчанию.Прочитать();
	Если НаборЗаписейЯчейкиХраненияПоУмолчанию.Количество()=0 Тогда
		Для каждого ЯчейкаХранения Из ТаблицаЯчеекХранения Цикл
			ЯчейкаХраненияПоУмолчанию=НаборЗаписейЯчейкиХраненияПоУмолчанию.Добавить();
			ЯчейкаХраненияПоУмолчанию.Номенклатура=ЯчейкаХранения.Номенклатура;
			ЯчейкаХраненияПоУмолчанию.СкладКомпании=ЯчейкаХранения.СкладКомпании;
			ЯчейкаХраненияПоУмолчанию.ЯчейкаХранения=ЯчейкаХранения.ЯчейкаХранения;
		КонецЦикла;
	КонецЕсли; 
	Попытка
		НаборЗаписейЯчейкиХраненияПоУмолчанию.Записать();
	Исключение
		БылиОшибки=Истина;
		Сообщить("Ошибка записи ячеек хранения номенклатуры по умолчанию: "+ОписаниеОшибки());
	КонецПопытки;
	
	#Если Клиент Тогда
	Сообщить("Обновление ячеек хранения номенклатуры по умолчанию завершено.");
	#КонецЕсли
	
КонецПроцедуры

// Обновление до 5.1.01.03
//
Процедура ОбновитьДо_5_1_01_03()
	
	#Если Клиент Тогда
	Сообщить("Обновление документов поступления допрасходов ...");
	#КонецЕсли
	
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеДопРасходов.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ПоступлениеДопРасходов.МоментВремени";
	Выборка=Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументПоступлениеДопРасходов=Выборка.Ссылка.ПолучитьОбъект();
		Если ДокументПоступлениеДопРасходов.ДокументыОснования.Количество()=0 Тогда
			НоваяСтрока=ДокументПоступлениеДопРасходов.ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование=ДокументПоступлениеДопРасходов.ДокументОснование;		
			ДокументПоступлениеДопРасходов.ОбменДанными.Загрузка=Истина;
			Попытка
				ДокументПоступлениеДопРасходов.Записать();
				Сообщить("Обновлен документ <"+ДокументПоступлениеДопРасходов+">.");
			Исключение
				Сообщить("Ошибка обновления документа <"+ДокументПоступлениеДопРасходов+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли; 
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление документов поступления допрасходов завершено.");
	#КонецЕсли
	
КонецПроцедуры

// Обновление до 5.1.02.02
//
Процедура ОбновитьДо_5_1_02_02()
	
	#Если Клиент Тогда
	Сообщить("Обновление справочников ""Договоры взаиморасчетов""");
	#КонецЕсли
	
	ЕстьПодсистемаАвтосалон = зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаАвтосалон");
	
	МассивПрочие = Новый Массив;
	МассивСервис = Новый Массив;
	МассивСалон  = Новый Массив;
	
	МакетВидыДеятельности = Справочники.ДоговорыВзаиморасчетов.ПолучитьМакет("ВидыДеятельности");
	
	ОбластьПрочее = МакетВидыДеятельности.ПолучитьОбласть("Прочее");
	Для Ном = 1 По ОбластьПрочее.ВысотаТаблицы Цикл
		МассивПрочие.Добавить(ОбластьПрочее.Область(Ном, 1, Ном, 1).Текст);
	КонецЦикла;
	
	ОбластьСервис = МакетВидыДеятельности.ПолучитьОбласть("Сервис");
	Для Ном = 1 По ОбластьСервис.ВысотаТаблицы Цикл
		МассивСервис.Добавить(ОбластьСервис.Область(Ном, 1, Ном, 1).Текст);
	КонецЦикла;
	
	Если ЕстьПодсистемаАвтосалон Тогда
		ОбластьСалон = МакетВидыДеятельности.ПолучитьОбласть("Салон");
		Для Ном = 1 По ОбластьСалон.ВысотаТаблицы Цикл
			МассивСалон.Добавить(ОбластьСалон.Область(Ном, 1, Ном, 1).Текст);
		КонецЦикла;
	КонецЕсли;
	
	ТипДоговора = Тип("СправочникСсылка.ДоговорыВзаиморасчетов");
	
	ТекстЗапроса = "";
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		
		ДляАвтосалона  = "Ложь";
		ДляАвтосервиса = "Ложь";
		Внутренний     = "Ложь";
		
		ИмяДокумента = МетаданныеДокумента.Имя;
		
		Обрабатывать = Ложь;
		
		Если НЕ МассивСалон.Найти(ИмяДокумента) = Неопределено Тогда
			ДляАвтосалона = "Истина";
			Обрабатывать  = Истина;
		КонецЕсли;
		
		Если НЕ МассивСервис.Найти(ИмяДокумента) = Неопределено Тогда
			ДляАвтосервиса = "Истина";
			Обрабатывать   = Истина;
		КонецЕсли;
		
		Если НЕ МассивПрочие.Найти(ИмяДокумента) = Неопределено Тогда
			Внутренний   = "Истина";
			Обрабатывать = Истина;
		КонецЕсли;
		
		Если НЕ Обрабатывать Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекМетаданные Из МетаданныеДокумента.Реквизиты Цикл
			
			Если ТекМетаданные.Тип.СодержитТип(ТипДоговора) Тогда
				
				ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС) + "
				|	ВЫБРАТЬ
				|		ТаблицаДокумента."+ТекМетаданные.Имя+" КАК ДоговорВзаиморасчетов,
				|		"+Строка(ДляАвтосалона) + " КАК ДляАвтосалона,
				|		"+Строка(ДляАвтосервиса) + " КАК ДляАвтосервиса,
				|		"+Строка(Внутренний) + " КАК Внутренний
				|	ИЗ
				|		Документ." + МетаданныеДокумента.Имя + " КАК ТаблицаДокумента
				|	ГДЕ
				|		НЕ ТаблицаДокумента."+ТекМетаданные.Имя+" = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
				|		ТипЗначения(ТаблицаДокумента."+ТекМетаданные.Имя+") = Тип(Справочник.ДоговорыВзаиморасчетов)
				|	СГРУППИРОВАТЬ ПО
				|		ТаблицаДокумента."+ТекМетаданные.Имя+"
				|";
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
			
			Для Каждого ТекМетаданные Из ТабличнаяЧасть.Реквизиты Цикл
				
				Если ТекМетаданные.Тип.СодержитТип(ТипДоговора) Тогда
					
					ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС) + "
					|	ВЫБРАТЬ
					|		ТаблицаДокумента."+ТекМетаданные.Имя+" КАК ДоговорВзаиморасчетов,
					|		"+Строка(ДляАвтосалона) + " КАК ДляАвтосалона,
					|		"+Строка(ДляАвтосервиса) + " КАК ДляАвтосервиса,
					|		"+Строка(Внутренний) + " КАК Внутренний
					|	ИЗ
					|		Документ." + МетаданныеДокумента.Имя + "."+ ТабличнаяЧасть.Имя + " КАК ТаблицаДокумента
					|	ГДЕ
					|		НЕ ТаблицаДокумента."+ТекМетаданные.Имя+" = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) И 
					|		ТипЗначения(ТаблицаДокумента."+ТекМетаданные.Имя+") = Тип(Справочник.ДоговорыВзаиморасчетов)
					|	СГРУППИРОВАТЬ ПО
					|		ТаблицаДокумента."+ТекМетаданные.Имя+"
					|";
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	Если НЕ ТекстЗапроса = "" Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаДоговоров.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	МАКСИМУМ(ТаблицаДоговоров.ДляАвтосалона) КАК ДляАвтосалона,
		|	МАКСИМУМ(ТаблицаДоговоров.ДляАвтосервиса) КАК ДляАвтосервиса,
		|	МАКСИМУМ(ТаблицаДоговоров.Внутренний) КАК Внутренний
		|ИЗ
		|	("+ТекстЗапроса+") КАК ТаблицаДоговоров
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаДоговоров.ДоговорВзаиморасчетов";
		
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ДоговорВзаиморасчетов = Выборка.ДоговорВзаиморасчетов.ПолучитьОбъект();
			
			ДоговорИзменен = Ложь;
			
			Если (НЕ Выборка.ДляАвтосалона = ДоговорВзаиморасчетов.ДляАвтосалона) Тогда
				ДоговорВзаиморасчетов.ДляАвтосалона = Выборка.ДляАвтосалона;
				ДоговорИзменен = Истина;
			КонецЕсли;
			
			Если (НЕ Выборка.Внутренний = ДоговорВзаиморасчетов.Внутренний) Тогда
				ДоговорВзаиморасчетов.Внутренний = Выборка.Внутренний;
				ДоговорИзменен = Истина;
			КонецЕсли;
			
			Если (НЕ Выборка.ДляАвтосервиса = ДоговорВзаиморасчетов.ДляАвтосервиса) Тогда
				ДоговорВзаиморасчетов.ДляАвтосервиса = Выборка.ДляАвтосервиса;
				ДоговорИзменен = Истина;
			КонецЕсли;
			
			Если ДоговорВзаиморасчетов.ТипДоговора.Пустая() Тогда
				ДоговорВзаиморасчетов.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
				ДоговорИзменен = Истина;
			КонецЕсли;
			
			Если НЕ ДоговорИзменен Тогда
				Продолжить;
			КонецЕсли;
			
			ДоговорВзаиморасчетов.ОбменДанными.Загрузка=Истина;
			Попытка
				ДоговорВзаиморасчетов.Записать();
				Сообщить("Обновлен справочник <"+ДоговорВзаиморасчетов+">.");
			Исключение
				Сообщить("Ошибка обновления справочника <"+ДоговорВзаиморасчетов+">: "+ОписаниеОшибки());
			КонецПопытки; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка,
	             |	ДоговорыВзаиморасчетов.Наименование КАК Наименование
	             |ИЗ
	             |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	             |ГДЕ
	             |	ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ И 
	             |	ДоговорыВзаиморасчетов.ДляАвтосервиса = ЛОЖЬ И 
	             |	ДоговорыВзаиморасчетов.ДляАвтосалона = ЛОЖЬ И 
	             |	ДоговорыВзаиморасчетов.Внутренний = ЛОЖЬ
	             |УПОРЯДОЧИТЬ ПО
	             |	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДоговорВзаиморасчетов = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорВзаиморасчетов.ДляАвтосервиса = Истина;
		ДоговорВзаиморасчетов.ДляАвтосалона  = ЕстьПодсистемаАвтосалон;
		ДоговорВзаиморасчетов.Внутренний     = Истина;
		ДоговорВзаиморасчетов.ТипДоговора    = Перечисления.ТипыДоговоров.Договор;
		
		ДоговорВзаиморасчетов.ОбменДанными.Загрузка = Истина;
		Попытка
			ДоговорВзаиморасчетов.Записать();
			Сообщить("Обновлен справочник <"+ДоговорВзаиморасчетов+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+ДоговорВзаиморасчетов+">: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление справочников ""Договоры взаиморасчетов"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

// Обновление до 5.1.02.03
//
Процедура ОбновитьДо_5_1_02_03()
	
	РаботаСКонтактнымиЛицами.ОбновитьКонтактныеЛица();
	
КонецПроцедуры

// Обновление до 5.1.02.04
//
Процедура ОбновитьДо_5_1_02_04()
	
	//Установим значения новых реквизитов производителей по умолчанию
	УстановитьРеквизитыПроизводителейПоУмолчанию();
	
	//Произведем заполнение артикула и артикула для поиска в Номенклатуре
	ЗаполнитьАртикулДляПоискаНоменклатуры();
	
	КоличествоЗаписей = ПолучитьКоличествоЗаписейРегистров();
	Если КоличествоЗаписей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	//Если в регистрах большое количество записей, то зададим вопрос о целесообразности немедленного обновления
	Если КоличествоЗаписей > 1000000 Тогда
		ТекстВопроса = "В регистрах имеется " + КоличествоЗаписей + " записей,
						|подлежащих модификации при обновлении релиза.
						|Обновление может занять несколько часов.
						|Запустить процедуры обновления сейчас?";
		Если НЕ Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Сообщить("Преобразование Артикула в регистрах не выполнено.
				|Функций поиска в аналогах и в прайс-листах контрагентов могут работать некорректно!
				|Процедуру обновления можно будет вызвать из меню ""Обработки"" - ""Служебные"" - ""Обновить 'Артикул для поиска' в регистрах""
				|");
			Возврат;
		КонецЕсли;	
	КонецЕсли;
	#КонецЕсли

	РегистрыСведений.ГруппыАналогов.		ЗаполнитьАртикулДляПоиска();
	РегистрыСведений.Замены.				ЗаполнитьАртикулДляПоиска();
	РегистрыСведений.ПрайсЛистыКонтрагентов.ЗаполнитьАртикулДляПоиска();
	РегистрыСведений.УпущенныйСпрос.		ЗаполнитьАртикулДляПоиска();
	
КонецПроцедуры

// Обновление до 5.1.02.09
//
Процедура ОбновитьДо_5_1_02_09()
	
	#Если Клиент Тогда
	НомерПрошлогоРелиза=Константы.НомерРелизаКонфигурации.Получить();
	Если НомерПрошлогоРелиза="5.1.02.07" Тогда
		Сообщить("ВНИМАНИЕ! Перепроверьте плательщиков по заявкам на ремонт и заказ-нарядам, введенным после 22 мая 2015.");
		Возврат;
	КонецЕсли; 
	#КонецЕсли
	
КонецПроцедуры

// Обновление до 5.1.03.03
//
Процедура ОбновитьДо_5_1_03_03()
	//Rarus Alkoko 17.08.2015 {
	СоздатьПравилаСопоставленияНоменклатуры();
	ОбновитьПрайсЛистыКонтрагентов();
	//Rarus Alkoko 17.08.2015 }
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Корзина""'"));
	#КонецЕсли
	
	НаборЗаписей = РегистрыСведений.Корзина.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	// Заполним измерение "Подразделение компании"
	Для Каждого Запись Из НаборЗаписей Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.ПодразделениеКомпании) Тогда
			Запись.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить("Ошибка обновления регистра ""Корзина"" "+ОписаниеОшибки());
	КонецПопытки;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление регистра сведений ""Корзина"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_03_03()

// Обновление до 5.1.03.07
//
Процедура ОбновитьДо_5_1_03_07()
	
	// Выполним проверку повторной установки данного релиза
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.ОтменаКонтроляСуммыКредита = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		// Установка реквизита "Отмена контроля суммы кредита" у договра ранее уже производилась, повторное заполнение не требуется
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Договоры взаиморасчетов"". Установка реквизита ""Отмена контроля суммы кредита"" для договоров с нулевой максимальной суммой кредита.'"));
	#КонецЕсли
	
	//У всех договоров с суммой кредита 0.00 взводим флаг не контролировать кредит
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыВзаиморасчетов.Ссылка,
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.ДатаНачала
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ЭтоГруппа = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.МаксимальныйКредит = 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДоговорыВзаиморасчетов.Владелец,
	               |	ДоговорыВзаиморасчетов.ДатаНачала";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоговорСсылка = Выборка.Ссылка;
		ДоговорОбъект = ДоговорСсылка.ПолучитьОбъект();
		ДоговорОбъект.ОтменаКонтроляСуммыКредита = Истина;
		Если ДоговорОбъект.Модифицированность() Тогда
			ДоговорОбъект.ОбменДанными.Загрузка=Истина;
			Попытка
				ДоговорОбъект.Записать();
				Сообщить("Контрагент <"+Выборка.Владелец+">. Обновлен договор <"+ДоговорСсылка+">.");
			Исключение
				Сообщить("Контрагент <"+Выборка.Владелец+">. Ошибка обновления договора <"+ДоговорСсылка+">: "+ОписаниеОшибки());
			КонецПопытки; 
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Договоры взаиморасчетов"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_03_07()

// Обновление до 5.1.03.08
//
Процедура ОбновитьДо_5_1_03_08()
	
	#Если Клиент Тогда
		Состояние("Обновление справочника ""Прайс-листы контрагентов""");
		Сообщить("Обновление справочника ""Прайс-листы контрагентов""");
	#КонецЕсли
	
	ИзмеренияПрайсЛиста    = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Измерения;
	РесурсыПрайсЛиста      = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Ресурсы;
	РеквизитыПрайсЛиста    = Метаданные.РегистрыСведений.ПрайсЛистыКонтрагентов.Реквизиты;
	
	Выборка = Справочники.ПрайсЛистыКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Если обЗначениеНеЗаполнено(Объект.ВидПрайсЛиста) Тогда
			Объект.ВидПрайсЛиста = Перечисления.ВидыПрайсЛистов.ПрайсЛистПоставщика;
		КонецЕсли;
		
		МассивСтарыхПолей = Новый Массив;
		Для Каждого ПолеСтруктуры ИЗ Объект.СтруктураФайлаПрайсЛиста Цикл
			МассивСтарыхПолей.Добавить(ПолеСтруктуры);
		КонецЦикла;
		ЕстьНовыеПоля = Ложь;
		
		//заполним табличку с полями
		ВсеСсылки = Новый ОписаниеТипов(Справочники.ТипВсеСсылки());
		ВсеСсылки = Новый ОписаниеТипов(ВсеСсылки,Документы.ТипВсеСсылки().Типы());
		ВсеСсылки = Новый ОписаниеТипов(ВсеСсылки,ПланыВидовХарактеристик.ТипВсеСсылки().Типы());
		ВсеСсылки = Новый ОписаниеТипов(ВсеСсылки,Перечисления.ТипВсеСсылки().Типы());

		//Загрузим реквизиты регистра
		Для каждого Рек Из РеквизитыПрайсЛиста Цикл
			ЭтоСсылка = Ложь;
			Для каждого ТипРеквизита Из Рек.Тип.Типы() Цикл
				Если ВсеСсылки.СодержитТип(ТипРеквизита) Тогда
					ЭтоСсылка = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
			
			Если НЕ ЭтоСсылка
				И НЕ Рек.Имя = "ПроизводительВПрайсЛисте" Тогда
				СтарыеПоля = Объект.СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста", Рек.Имя));
				Если СтарыеПоля.Количество() = 0 Тогда
					ЕстьНовыеПоля = Истина;
					
					НовоеПоле = Объект.СтруктураФайлаПрайсЛиста.Добавить();
					НовоеПоле.ИмяРеквизитаПрайсЛиста = Рек.Имя;
					
				Иначе
					Для Каждого СтароеПоле Из СтарыеПоля Цикл
						ИндексСтроки = МассивСтарыхПолей.Найти(СтароеПоле);
						МассивСтарыхПолей.Удалить(ИндексСтроки);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;
		
		//Загрузим измерения регистра
		Для каждого Рек Из ИзмеренияПрайсЛиста Цикл
			ЭтоСсылка = Ложь;
			Для каждого ТипРеквизита Из Рек.Тип.Типы() Цикл
				Если ВсеСсылки.СодержитТип(ТипРеквизита) Тогда
					ЭтоСсылка = Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
				
			Если НЕ ЭтоСсылка 
				И НЕ Рек.Имя = "АртикулДляПоиска"
				И НЕ Рек.Имя = "ДатаЗаписи"
				И НЕ Рек.Имя = "КодПредложения"
				ИЛИ Рек.Имя = "Производитель" Тогда
				СтарыеПоля = Объект.СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста",Рек.Имя));
				Если СтарыеПоля.Количество() = 0 Тогда
					ЕстьНовыеПоля = Истина;
					
					НовоеПоле = Объект.СтруктураФайлаПрайсЛиста.Добавить();
					НовоеПоле.ИмяРеквизитаПрайсЛиста = Рек.Имя;
					
				Иначе
					Для Каждого СтароеПоле Из СтарыеПоля Цикл
						ИндексСтроки = МассивСтарыхПолей.Найти(СтароеПоле);
						МассивСтарыхПолей.Удалить(ИндексСтроки);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;
		
		//Загрузим ресурсы регистра
		Для каждого Рек Из РесурсыПрайсЛиста Цикл
			ЭтоСсылка = Ложь;
			Для каждого ТипРеквизита Из Рек.Тип.Типы() Цикл
				Если ВсеСсылки.СодержитТип(ТипРеквизита) И НЕ ТипРеквизита = Тип("СправочникСсылка.Валюты") Тогда
					ЭтоСсылка=Истина;
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
			
			Если НЕ ЭтоСсылка
				И НЕ Рек.Имя = "СрокПоставкиМинимальный"
				И НЕ Рек.Имя = "СрокПоставкиМаксимальный" Тогда
				СтарыеПоля = Объект.СтруктураФайлаПрайсЛиста.НайтиСтроки(Новый Структура("ИмяРеквизитаПрайсЛиста", Рек.Имя));
				Если СтарыеПоля.Количество() = 0 Тогда
					ЕстьНовыеПоля = Истина;
					
					НовоеПоле = Объект.СтруктураФайлаПрайсЛиста.Добавить();
					НовоеПоле.ИмяРеквизитаПрайсЛиста = Рек.Имя;
					
				Иначе
					Для Каждого СтароеПоле Из СтарыеПоля Цикл
						ИндексСтроки = МассивСтарыхПолей.Найти(СтароеПоле);
						МассивСтарыхПолей.Удалить(ИндексСтроки);
					КонецЦикла;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;
		
		Если МассивСтарыхПолей.Количество() > 0 ИЛИ ЕстьНовыеПоля Тогда
			// У нас поменялась структура регистра и надо удалить старые поля
			Для Каждого СтароеПоле Из МассивСтарыхПолей Цикл
				Объект.СтруктураФайлаПрайсЛиста.Удалить(СтароеПоле);
			КонецЦикла;
		КонецЕсли;
		
		Если Объект.Модифицированность() Тогда
			Сообщить("Обновлен элемент """+Объект.Наименование+"""");
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Объект.Записать();
			Исключение
				Сообщить("Ошибка обновления элемента справочника ""Прайс-листы контрагентов"" "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Прайс-листы контрагентов"" завершено");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_03_08()

// Обновление до 5.1.05.02
//
Процедура ОбновитьДо_5_1_05_02()
	
	Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаТехосмотр",Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Требования к транспортным средствам""");
	#КонецЕсли
	
	// Обновим данные из макета для элементов справочника "Требования к ТС", которые были измены
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТребованияКТранспортнымСредствам.НаименованиеПолное,
	               |	ТребованияКТранспортнымСредствам.Ссылка,
	               |	ТребованияКТранспортнымСредствам.Родитель
	               |ИЗ
	               |	Справочник.ТребованияКТранспортнымСредствам КАК ТребованияКТранспортнымСредствам
	               |ГДЕ
	               |	ТребованияКТранспортнымСредствам.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТребованияКТранспортнымСредствам.Номер";
	ТаблицаЭлементовВСправочнике = Запрос.Выполнить().Выгрузить();
	
	Макет = Справочники.ТребованияКТранспортнымСредствам.ПолучитьМакет("Приложение1");
	Попытка
		ОбластьТаблицаТребований = Макет.ПолучитьОбласть("СписокТребований");
		// получим таблицу из макета
		ТаблицаТребований = Новый ТаблицаЗначений;
		ТаблицаТребований.Колонки.Добавить("Загрузка");
		ТаблицаТребований.Колонки.Добавить("Номер");
		ТаблицаТребований.Колонки.Добавить("Родитель");
		ТаблицаТребований.Колонки.Добавить("НаименованиеПолное");
		ТаблицаТребований.Колонки.Добавить("Описание");
		ТаблицаТребований.Колонки.Добавить("КатегорияM1Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияM1МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияM1МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN1Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияN1МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN1МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияM2Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияM2МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияM2МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN2Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияN2МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN2МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияM3Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияM3МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияM3МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN3Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияN3МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияN3МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияO1O2Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияO1O2МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияO1O2МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияO3O4Использование");
		ТаблицаТребований.Колонки.Добавить("КатегорияO3O4МинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияO3O4МаксЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияLИспользование");
		ТаблицаТребований.Колонки.Добавить("КатегорияLМинЗнач");
		ТаблицаТребований.Колонки.Добавить("КатегорияLМаксЗнач");
		
		ВысотаТаблицы = Макет.ПолучитьОбласть("СписокТребований").ВысотаТаблицы;
		
		Для НомерСтроки = 1 По ВысотаТаблицы Цикл
			
			// проверим заполнение текущей строки макета
			НомерТребования = ОбластьТаблицаТребований.Область(НомерСтроки, 1).Текст;	
			Если ПустаяСтрока(НомерТребования) Тогда
				Прервать;
			КонецЕсли;
			СтрокаТаблицыТребований 							= ТаблицаТребований.Добавить();
			СтрокаТаблицыТребований.Номер 						= НомерТребования;
			СтрокаТаблицыТребований.Родитель 					= ОбластьТаблицаТребований.Область(НомерСтроки, 2).Текст;
			СтрокаТаблицыТребований.НаименованиеПолное 			= ОбластьТаблицаТребований.Область(НомерСтроки, 3).Текст;
			СтрокаТаблицыТребований.Описание 					= ОбластьТаблицаТребований.Область(НомерСтроки, 4).Текст;
			СтрокаТаблицыТребований.КатегорияM1Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 5).Текст;
			СтрокаТаблицыТребований.КатегорияM1МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 6).Текст;
			СтрокаТаблицыТребований.КатегорияM1МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 7).Текст;
			СтрокаТаблицыТребований.КатегорияN1Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 8).Текст;
			СтрокаТаблицыТребований.КатегорияN1МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 9).Текст;
			СтрокаТаблицыТребований.КатегорияN1МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 10).Текст;
			СтрокаТаблицыТребований.КатегорияM2Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 11).Текст;
			СтрокаТаблицыТребований.КатегорияM2МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 12).Текст;
			СтрокаТаблицыТребований.КатегорияM2МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 13).Текст;
			СтрокаТаблицыТребований.КатегорияN2Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 14).Текст;
			СтрокаТаблицыТребований.КатегорияN2МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 15).Текст;
			СтрокаТаблицыТребований.КатегорияN2МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 16).Текст;
			СтрокаТаблицыТребований.КатегорияM3Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 17).Текст;
			СтрокаТаблицыТребований.КатегорияM3МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 18).Текст;
			СтрокаТаблицыТребований.КатегорияM3МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 19).Текст;
			СтрокаТаблицыТребований.КатегорияN3Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 20).Текст;
			СтрокаТаблицыТребований.КатегорияN3МинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 21).Текст;
			СтрокаТаблицыТребований.КатегорияN3МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 22).Текст;
			СтрокаТаблицыТребований.КатегорияO1O2Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 23).Текст;
			СтрокаТаблицыТребований.КатегорияO1O2МинЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 24).Текст;
			СтрокаТаблицыТребований.КатегорияO1O2МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 25).Текст;
			СтрокаТаблицыТребований.КатегорияO3O4Использование	= ОбластьТаблицаТребований.Область(НомерСтроки, 26).Текст;
			СтрокаТаблицыТребований.КатегорияO3O4МинЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 27).Текст;
			СтрокаТаблицыТребований.КатегорияO3O4МаксЗнач 		= ОбластьТаблицаТребований.Область(НомерСтроки, 28).Текст;
			СтрокаТаблицыТребований.КатегорияLИспользование		= ОбластьТаблицаТребований.Область(НомерСтроки, 29).Текст;
			СтрокаТаблицыТребований.КатегорияLМинЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 30).Текст;
			СтрокаТаблицыТребований.КатегорияLМаксЗнач 			= ОбластьТаблицаТребований.Область(НомерСтроки, 31).Текст;
		КонецЦикла;
		
		ТС_M1 = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые;
		ТС_M2 = Справочники.КатегорииТранспортныхСредств.АвтобусыДо5000;
		ТС_M3 = Справочники.КатегорииТранспортныхСредств.Автобусы;
		
		ТС_N1 = Справочники.КатегорииТранспортныхСредств.ГрузовикиДо3500;
		ТС_N2 = Справочники.КатегорииТранспортныхСредств.ГрузовикиДо12000;
		ТС_N3 = Справочники.КатегорииТранспортныхСредств.Грузовики;
		
		ТС_O1 = Справочники.КатегорииТранспортныхСредств.ПрицепыДо750;
		ТС_O2 = Справочники.КатегорииТранспортныхСредств.ПрицепыДо3500;
		ТС_O3 = Справочники.КатегорииТранспортныхСредств.ПрицепыДо10000;
		ТС_O4 = Справочники.КатегорииТранспортныхСредств.Прицепы;
		
		ТС_L1 = Справочники.КатегорииТранспортныхСредств.МопедыДвухколесные;
		ТС_L2 = Справочники.КатегорииТранспортныхСредств.МопедыТрехколесные;
		ТС_L3 = Справочники.КатегорииТранспортныхСредств.МотоциклыДвухколесные;
		ТС_L4 = Справочники.КатегорииТранспортныхСредств.МотоциклыТрехколесныеАссиметричные;
		ТС_L5 = Справочники.КатегорииТранспортныхСредств.МотоциклыТрехколесныеСиметричные;
		ТС_L6 = Справочники.КатегорииТранспортныхСредств.КвадроциклыДо350;
		ТС_L7 = Справочники.КатегорииТранспортныхСредств.КвадроциклыДо400;
		
		Для Каждого СтрокаТаблицыТребований Из ТаблицаТребований Цикл
			
			СтрокаТаблицыТребованийВСправочнике = ТаблицаЭлементовВСправочнике.Найти(СокрЛП(СтрокаТаблицыТребований.НаименованиеПолное), "НаименованиеПолное");
			
			Если СтрокаТаблицыТребованийВСправочнике = Неопределено Тогда
				Продолжить;
			Иначе
				ТекущийЭлемент = СтрокаТаблицыТребованийВСправочнике.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
			ТекущийЭлемент.Номер = СтрокаТаблицыТребований.Номер;
			ТекущийЭлемент.Наименование = СокрЛП(СтрокаТаблицыТребований.НаименованиеПолное);
			ТекущийЭлемент.НаименованиеПолное =  СокрЛП(СтрокаТаблицыТребований.НаименованиеПолное);
			ТекущийЭлемент.Описание = СокрЛП(СтрокаТаблицыТребований.Описание);
			
			ТЧ = ТекущийЭлемент.ДиапазонЗначений;
			ТЧ.Очистить();
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияM1Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_M1;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияM1МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияM1МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияN1Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_N1;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияN1МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияN1МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияM2Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_M2;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияM2МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияM2МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияN2Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_N2;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияN2МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияN2МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияM3Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_M3;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияM3МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияM3МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияN3Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_N3;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияN3МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияN3МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияO1O2Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_O1;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияO1O2МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияO1O2МаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_O2;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияO1O2МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияO1O2МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияO3O4Использование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_O3;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияO3O4МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияO3O4МаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_O4;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияO3O4МинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияO3O4МаксЗнач;
			КонецЕсли;
			Если СокрЛП(СтрокаТаблицыТребований.КатегорияLИспользование) = "Х" Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L1;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L2;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L3;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L4;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L5;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L6;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.КатегорияТранспортногоСредства = ТС_L7;
				НоваяСтрока.ЗначениеМин = СтрокаТаблицыТребований.КатегорияLМинЗнач;
				НоваяСтрока.ЗначениеМакс = СтрокаТаблицыТребований.КатегорияLМаксЗнач;
			КонецЕсли;
			ТекущийЭлемент.ОбменДанными.Загрузка=Истина;
			Попытка
				ТекущийЭлемент.Записать();
				Сообщить("Обновлен элемент """+ТекущийЭлемент.Наименование+"""");
			Исключение
				Сообщить("Ошибка обновления элемента справочника ""Требования к транспортным средствам"" """+ТекущийЭлемент.Наименование+""": "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	Исключение
		#Если Клиент Тогда
			Сообщить("Ошибка при обновлении справочника ""Требования к транспортным средствам"": "+ОписаниеОшибки());
		#КонецЕсли
	КонецПопытки;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Требования к транспортным средствам"" завершено");
	#КонецЕсли
	
	#Если Клиент Тогда
		ТекстВопроса = "Добавлены новые требования к транспортным средствам.
						|Произвести автозаполнение справочника требований к транспортным средствам?";
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Справочники.ТребованияКТранспортнымСредствам.ЗагрузитьТребованияИзМакета();
	
КонецПроцедуры // ОбновитьДо_5_1_05_02()

// Обновление до 5.1.05.03
//
Процедура ОбновитьДо_5_1_05_03()
	
	#Если Клиент Тогда
		Сообщить("Обновление плана обмена ""Обмен с сайтом автосервиса""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтомАвтосервиса.Ссылка КАК УзелСсылка
	               |ИЗ
	               |	ПланОбмена.ОбменССайтомАвтосервиса КАК ОбменССайтомАвтосервиса
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	УзелСсылка";
	ПланыОбменаОбменССайтомАвтосервиса=Запрос.Выполнить().Выгрузить();
	
	Для Каждого УзелОбмена Из ПланыОбменаОбменССайтомАвтосервиса Цикл
		УзелОбменаОбъект=УзелОбмена.УзелСсылка.ПолучитьОбъект();
		УзелОбменаОбъект.ЗагружатьДанныеССайта=Истина;
		УзелОбменаОбъект.ВыгружатьДанныеНаСайт=Истина;
		УзелОбменаОбъект.ВыгружатьТолькоИзменения=Истина;
		УзелОбменаОбъект.ОбменМоделями=Истина;
		УзелОбменаОбъект.ОбменКонтрагентами=Истина;
		УзелОбменаОбъект.ОбменАвтомобилями=Истина;
		УзелОбменаОбъект.ОбменЗаявками=Истина;
		УзелОбменаОбъект.ОбменЗаказНарядами=Истина;
		УзелОбменаОбъект.ОбменЦенами=Истина;
		УзелОбменаОбъект.ОбменТО=Истина;
		УзелОбменаОбъект.ОбменДанными.Загрузка=Истина;
		Попытка
			УзелОбменаОбъект.Записать();
			Сообщить("Обновлен элемент """+УзелОбменаОбъект+"""");
		Исключение
			Сообщить("Ошибка обновления узла плана обмена ""Обмен с сайтом автосервиса"" """+УзелОбменаОбъект+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление плана обмена ""Обмен с сайтом автосервиса"" завершено");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_05_02()

// Обновление до 5.1.05.05
//
Процедура ОбновитьДо_5_1_05_05()
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Статусы рабочего листа"". Обновление элемента ""Отказ""");
	#КонецЕсли
	
	СтатусРабочегоЛиста = Справочники.СтатусыРабочегоЛиста.Отказ.ПолучитьОбъект();
	
	// Установим использование статуса "Отказ" во всех рабочих листах
	Если НЕ СтатусРабочегоЛиста.ИспользоватьВРабочемЛисте Тогда
		СтатусРабочегоЛиста.ИспользоватьВРабочемЛисте			= Истина;
	КонецЕсли;
	Если НЕ СтатусРабочегоЛиста.ИспользоватьВРабочемЛистеОтделаСтрахования Тогда
		СтатусРабочегоЛиста.ИспользоватьВРабочемЛистеОтделаСтрахования		= Истина;
	КонецЕсли;
	Если НЕ СтатусРабочегоЛиста.ИспользоватьВРабочемЛистеКредитногоОтдела Тогда
		СтатусРабочегоЛиста.ИспользоватьВРабочемЛистеКредитногоОтдела= Истина;
	КонецЕсли;
	
	СтатусРабочегоЛиста.ОбменДанными.Загрузка = Истина;
	
	Попытка
		СтатусРабочегоЛиста.Записать();
		Сообщить("Справочник ""Статусы рабочего листа"". Обновлен элемент """+СокрЛП(СтатусРабочегоЛиста.Наименование)+"""");
	Исключение
		Сообщить("Справочник ""Статусы рабочего листа"". Ошибка обновления элемента """+СокрЛП(СтатусРабочегоЛиста.Наименование)+""": "+ОписаниеОшибки());
	КонецПопытки;
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Статусы рабочего листа"". Обновление завершено");
	#КонецЕсли
	
	#Если Клиент Тогда
		Сообщить("Обновление рабочих листов");
	#КонецЕсли
	
	// Заполним реквизит "Вид первичного контакта" для рабочих листов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочийЛист.Ссылка,
	               |	РабочийЛист.ДокументОснование КАК Основание
	               |ИЗ
	               |	Документ.РабочийЛист КАК РабочийЛист
	               |ГДЕ
	               |	ВЫРАЗИТЬ(РабочийЛист.ДокументОснование КАК Документ.Событие) <> ЗНАЧЕНИЕ(Документ.Событие.ПустаяССылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РабочийЛистКредитногоОтдела.Ссылка
	               |ИЗ
	               |	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
	               |ГДЕ
	               |	РабочийЛистКредитногоОтдела.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РабочийЛист.ПустаяССылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РабочийЛистОтделаСтрахования.Ссылка
	               |ИЗ
	               |	Документ.РабочийЛистОтделаСтрахования КАК РабочийЛистОтделаСтрахования
	               |ГДЕ
	               |	РабочийЛистОтделаСтрахования.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РабочийЛист.ПустаяСсылка)";
	Результат = Запрос.ВыполнитьПакет();
	
	РабочиеЛисты = Результат[0].Выбрать();
	
	Пока РабочиеЛисты.Следующий() Цикл
		ДокументОбъект = РабочиеЛисты.Ссылка.ПолучитьОбъект();
		Если РабочиеЛисты.Основание.ВидСобытия = Перечисления.ВидыСобытий.ТелефонныйЗвонок Тогда
			ДокументОбъект.ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.Телефон;
		ИначеЕсли РабочиеЛисты.Основание.ВидСобытия = Перечисления.ВидыСобытий.ЛичнаяВстреча Тогда
			ДокументОбъект.ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.ЛичнаяВстреча;
		ИначеЕсли РабочиеЛисты.Основание.ВидСобытия = Перечисления.ВидыСобытий.ЭлектронноеПисьмо ИЛИ РабочиеЛисты.Основание.ВидСобытия = Перечисления.ВидыСобытий.ИнтернетЗапрос Тогда
			ДокументОбъект.ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.ИнтернетЗапрос;
		КонецЕсли;
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка обновления документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	РабочиеЛисты = Результат[1].Выбрать();
	
	Пока РабочиеЛисты.Следующий() Цикл
		ДокументОбъект = РабочиеЛисты.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ВидПервичногоКонтакта = Перечисления.ВидыПервичногоКонтакта.СмежныйОтдел;
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка обновления документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление рабочих листов завершено");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_05_02()

// Обновление до 5.1.06.03
//
Процедура ОбновитьДо_5_1_06_03()
	
	#Если Клиент Тогда
		Состояние("Обновление справочника ""Прайс-листы контрагентов""");
		Сообщить("Обновление справочника ""Прайс-листы контрагентов""");
	#КонецЕсли
	
	Выборка = Справочники.ПрайсЛистыКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		
		ОписаниеИзменений = Новый Массив;
		Если Не Объект.ПроверитьСтруктуруСтраницПрайсЛиста(ОписаниеИзменений) Тогда
			Сообщить("Обновление элемента """+Объект.Наименование+"""");
			Для Каждого ОписаниеИзменения Из ОписаниеИзменений Цикл
				#Если Клиент Тогда
					Сообщить("   - " + ОписаниеИзменения);
				#КонецЕсли
			КонецЦикла;
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Объект.Записать();
			Исключение
				#Если Клиент Тогда
					Сообщить("Ошибка при обновлении элемента справочника ""Прайс-листы контрагентов"" "+ОписаниеОшибки());
				#КонецЕсли
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Прайс-листы контрагентов"" завершено");
		Состояние("Обновление регистра сведений ""Корзина""");
		Сообщить("Обновление регистра сведений ""Корзина""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Корзина.Номер,
	|	Корзина.Дата КАК Дата,
	|	Корзина.Клиент КАК Клиент,
	|	Корзина.Значение
	|ИЗ
	|	РегистрСведений.Корзина КАК Корзина
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	Клиент";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура");
	СтруктураПоиска.Вставить("АртикулДляПоиска");
	СтруктураПоиска.Вставить("Производитель");
	СтруктураПоиска.Вставить("Поставщик");
	СтруктураПоиска.Вставить("КлючСтрокиПоставщика");
	
	Пока Выборка.Следующий() Цикл
		ВариантыПоставкиПользователей = Новый Соответствие;
		ВыборкаКорзин = Выборка.Выбрать();
		Пока ВыборкаКорзин.Следующий() Цикл
			Корзина = ВыборкаКорзин.Значение.Получить();
			Если Корзина.Свойство("Менеджер") И ЗначениеЗаполнено(Корзина.Менеджер) Тогда
				Если Корзина.Свойство("ВариантыПоставки") Тогда
					ВариантыПоставкиПользователя = ВариантыПоставкиПользователей.Получить(Корзина.Менеджер);
					Если ВариантыПоставкиПользователя = Неопределено Тогда
						ВариантыПоставкиПользователей.Вставить(Корзина.Менеджер, Корзина.ВариантыПоставки);
					Иначе
						Для Каждого СтрокаВариантПоставки Из Корзина.ВариантыПоставки Цикл
							ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаВариантПоставки);
							Если ВариантыПоставкиПользователя.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
								НоваяСтрока = ВариантыПоставкиПользователя.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариантПоставки);
							КонецЕсли;
						КонецЦикла;
						ВариантыПоставкиПользователей.Вставить(Корзина.Менеджер, ВариантыПоставкиПользователя);
					КонецЕсли;
					НаборЗаписей = РегистрыСведений.Корзина.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Номер.Установить(ВыборкаКорзин.Номер);
					НаборЗаписей.Отбор.Дата.Установить(ВыборкаКорзин.Дата);
					НаборЗаписей.Прочитать();
					Если Корзина.Свойство("Товары") И Корзина.Товары.Количество() = 0 Тогда
						НаборЗаписей.Очистить();
						Попытка
							НаборЗаписей.Записать();
							СтатусТекСообщения = СтатусСообщения.Обычное;
							ТекстСообщения = "   - Удалена пустая корзина №";
						Исключение
							СтатусТекСообщения = СтатусСообщения.Важное;
							ТекстСообщения = "   - Не удалось удалить пустую корзину №";
						КонецПопытки;
					Иначе
						НоваяКорзина = ВыборкаКорзин.Значение.Получить();
						НоваяКорзина.Удалить("ВариантыПоставки");
						НаборЗаписей[0].Значение = Новый ХранилищеЗначения(НоваяКорзина);
						Попытка
							НаборЗаписей.Записать();
							СтатусТекСообщения = СтатусСообщения.Обычное;
							ТекстСообщения = "   - Удалены варианты поставки из корзины №";
						Исключение
							СтатусТекСообщения = СтатусСообщения.Важное;
							ТекстСообщения = "   - Не удалось обновить корзину №";
						КонецПопытки;
					КонецЕсли;
					#Если Клиент Тогда
						Сообщить(ТекстСообщения + ВыборкаКорзин.Номер + " от " + Формат(ВыборкаКорзин.Дата, "ДФ=dd.MM.yyyy") + " для клиента: " + Строка(ВыборкаКорзин.Клиент), СтатусТекСообщения);
					#КонецЕсли
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого КлючЗначение Из ВариантыПоставкиПользователей Цикл
			
			Если КлючЗначение.Значение.Количество() > 0 Тогда
				
				Контрагент = Выборка.Клиент;
				Автор = КлючЗначение.Ключ;
				ВариантыПоставки = КлючЗначение.Значение;
				
				Если ТипЗнч(Контрагент)= Тип("Строка") Тогда
					ОтборОбъект = "Клиент: "+Контрагент;
				Иначе
					ОтборОбъект = Контрагент;
				КонецЕсли;
				
				Объект = Контрагент;
				
				МенеджерЗаписи = РегистрыСведений.атРабочиеЛисты.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Объект = ОтборОбъект;
				МенеджерЗаписи.Автор = Автор;
				МенеджерЗаписи.Прочитать();
				Если Не МенеджерЗаписи.Выбран() Тогда
					ТипОбновления = "Создан";
					МенеджерЗаписи.Объект     = ОтборОбъект;
					МенеджерЗаписи.Автор      = Автор;
					МенеджерЗаписи.ВидОбъекта = "Клиент";
					МенеджерЗаписи.Дата       = ТекущаяДата();
					Структура = Новый Структура;
				Иначе
					ТипОбновления = "Обновлен";
					Структура = МенеджерЗаписи.Значение.Получить();
				КонецЕсли;
				
				Если Не Структура.Свойство("ВариантыПоставки") Тогда
					Обновлен = Истина;
					Структура.Вставить("ВариантыПоставки", ВариантыПоставки);
				Иначе
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Номенклатура");
					СтруктураПоиска.Вставить("АртикулДляПоиска");
					СтруктураПоиска.Вставить("Производитель");
					СтруктураПоиска.Вставить("Поставщик");
					СтруктураПоиска.Вставить("КлючСтрокиПоставщика");
					Для Каждого СтрокаВариантПоставки Из ВариантыПоставки Цикл
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаВариантПоставки);
						Если Структура.ВариантыПоставки.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							Обновлен = Истина;
							НоваяСтрока = Структура.ВариантыПоставки.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариантПоставки);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если Обновлен = Истина Тогда
					МенеджерЗаписи.Значение = Новый ХранилищеЗначения(Структура);
					Попытка
						МенеджерЗаписи.Записать();
						#Если Клиент Тогда
							Сообщить("   - " + ТипОбновления + " рабочий лист " + Автор + " для " + Контрагент, СтатусСообщения.Обычное);
						#КонецЕсли
					Исключение
						#Если Клиент Тогда
							Сообщить("   - Ошибка при " + ТипОбновления + "ии рабочего листа " + Автор + " для " + Контрагент + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
						#КонецЕсли
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление регистра сведений ""Корзина"" завершено");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_06_03()

// Обновление до 5.1.06.05
//
Процедура ОбновитьДо_5_1_06_05()
	
	#Если Клиент Тогда
		Состояние("Обновление регистра сведений ""Рабочие листы""");
		Сообщить("Обновление регистра сведений ""Рабочие листы""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	атРабочиеЛисты.Автор.Подразделение КАК Подразделение,
	|	атРабочиеЛисты.Объект КАК Объект,
	|	атРабочиеЛисты.Автор КАК Автор,
	|	атРабочиеЛисты.Дата,
	|	атРабочиеЛисты.Значение
	|ИЗ
	|	РегистрСведений.атРабочиеЛисты КАК атРабочиеЛисты
	|ГДЕ
	|	НЕ атРабочиеЛисты.Автор ССЫЛКА Справочник.ПодразделенияКомпании
	|	И атРабочиеЛисты.ВидОбъекта = ""Клиент""
	|	И НЕ атРабочиеЛисты.Запросы
	|ИТОГИ ПО
	|	Подразделение,
	|	Объект";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Номенклатура");
	СтруктураПоиска.Вставить("АртикулДляПоиска");
	СтруктураПоиска.Вставить("Производитель");
	СтруктураПоиска.Вставить("Поставщик");
	СтруктураПоиска.Вставить("КлючСтрокиПоставщика");
	
	БылиОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл // Подразделения
		
		НачатьТранзакцию();
		
		ВыборкаКлиентов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКлиентов.Следующий() Цикл // Клиенты
			
			Успешно = Истина;
			
			ВариантыПоставки = Неопределено;
			ДатаРабочегоЛиста = ТекущаяДата();
			
			ВыборкаРабочихЛистов = ВыборкаКлиентов.Выбрать();
			
			Пока ВыборкаРабочихЛистов.Следующий() Цикл // Авторы
				
				РабочийЛист = ВыборкаРабочихЛистов.Значение.Получить();
				
				Если НЕ РабочийЛист.Свойство("ВариантыПоставки") ИЛИ обЗначениеНеЗаполнено(РабочийЛист.ВариантыПоставки) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВариантыПоставки = Неопределено Тогда
					ВариантыПоставки = РабочийЛист.ВариантыПоставки;
					Для Каждого СтрокаВариантПоставки Из ВариантыПоставки Цикл
						Попытка
							СтрокаВариантПоставки.Автор = ВыборкаРабочихЛистов.Автор;
						Исключение КонецПопытки;
					КонецЦикла;
				Иначе
					Для Каждого СтрокаВариантПоставки Из РабочийЛист.ВариантыПоставки Цикл
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаВариантПоставки);
						Если ВариантыПоставки.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
							НоваяСтрока = ВариантыПоставки.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариантПоставки);
							Попытка
								НоваяСтрока.Автор = ВыборкаРабочихЛистов.Автор;
							Исключение КонецПопытки;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				РабочийЛист.Удалить("ВариантыПоставки");
				
				НаборЗаписей = РегистрыСведений.атРабочиеЛисты.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Автор.Установить(ВыборкаРабочихЛистов.Автор);
				НаборЗаписей.Отбор.Объект.Установить(ВыборкаКлиентов.Объект);
				НаборЗаписей.Прочитать();
				
				Если Не РабочийЛист.Свойство("НомераДеталей") ИЛИ обЗначениеНеЗаполнено(РабочийЛист.НомераДеталей) Тогда
					// Надо удалить рабочий лист!
					НаборЗаписей.Очистить();
					ТекстСообщения = "   - Удален пустой рабочий лист "+ВыборкаРабочихЛистов.Автор+" для "+ВыборкаКлиентов.Объект;
				Иначе
					// Сохраним рабочий лист
					СтрокаНабора = НаборЗаписей[0];
					СтрокаНабора.Значение = Новый ХранилищеЗначения(РабочийЛист);
					ТекстСообщения = "   - Удалены варианты поставки из рабочего листа "+ВыборкаРабочихЛистов.Автор+" для "+ВыборкаКлиентов.Объект;
				КонецЕсли;
				
				Попытка
					НаборЗаписей.Записать();
					#Если Клиент Тогда
						Сообщить(ТекстСообщения);
					#КонецЕсли
				Исключение
					// Прервем цикл по авторам
					Успешно = Ложь;
					Прервать;
				КонецПопытки;
				
			КонецЦикла;
			
			// Создадим новый рабочий лист только с вариантами поставки!!
			
			Если Не Успешно Тогда
				// Прервем цикл по клиентам
				Прервать;
			КонецЕсли;
			
			Если ВариантыПоставки <> Неопределено Тогда
				Если Не ЗаписатьДанныеРабочегоЛиста(ВыборкаКлиентов.Объект, Выборка.Подразделение, ВариантыПоставки) Тогда
					// Прервем цикл по клиентам
					Успешно = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Успешно Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			// Где-то возникла ошибка
			БылиОшибки = Истина;
			ОтменитьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление регистра сведений ""Рабочие листы"" завершено "+?(БылиОшибки, "с ошибками", "успешно"), ?(БылиОшибки, СтатусСообщения.ОченьВажное, СтатусСообщения.Обычное));
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_06_05()

// Обновление до 5.1.07.02
//
Процедура ОбновитьДо_5_1_07_02()
	
	#Если Клиент Тогда
		Состояние("Обновление регистров сведений ""Рабочие листы"", ""Рабочие листы. История""");
		Сообщить("Обновление регистров сведений ""Рабочие листы"", ""Рабочие листы. История""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	атРабочиеЛисты.Автор КАК Автор,
	|	атРабочиеЛисты.Объект КАК Объект,
	|	атРабочиеЛисты.Клиент КАК Клиент,
	|	атРабочиеЛисты.ВидОбъекта,
	|	МАКСИМУМ(атРабочиеЛисты.Дата) КАК Дата
	|ИЗ
	|	РегистрСведений.атРабочиеЛисты КАК атРабочиеЛисты
	|ГДЕ
	|	НЕ атРабочиеЛисты.Автор ССЫЛКА Справочник.ПодразделенияКомпании
	|	И НЕ атРабочиеЛисты.Автор.Предопределенный
	|	И НЕ атРабочиеЛисты.Запросы
	|	И НЕ атРабочиеЛисты.ВариантыПоставки
	|	И НЕ атРабочиеЛисты.Клиент = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	атРабочиеЛисты.Автор,
	|	атРабочиеЛисты.Объект,
	|	атРабочиеЛисты.Клиент,
	|	атРабочиеЛисты.ВидОбъекта";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Телефон = Новый Структура;
	Телефон.Вставить("ВидТелефона", Неопределено);
	Телефон.Вставить("КодРегиона", "");
	Телефон.Вставить("КодГорода", "");
	Телефон.Вставить("НомерТелефона", "");
	Телефон.Вставить("ВнутреннийНомер", "");
	Телефон.Вставить("ПредставлениеТелефона", "");
	Значение = Новый ХранилищеЗначения(Новый Структура("Телефон", Телефон));
	
	БылиОшибки = Ложь;
	
	Пока Выборка.Следующий() Цикл // Подразделения
		
		МенеджерЗаписи = РегистрыСведений.атРабочиеЛисты.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.Прочитать();
		
		Клиент = Неопределено;
		Автомобиль = "";
		Модель = Справочники.Модели.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(Выборка.ВидОбъекта) Тогда
			Если Выборка.ВидОбъекта = "Клиент" Тогда
				Если ТипЗнч(Выборка.Объект) = Тип("Строка") Тогда
					Клиент = СтрЗаменить(Выборка.Объект, "Клиент: ", "");
				Иначе
					Клиент = Выборка.Объект;
				КонецЕсли;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Автомобили") Тогда
					Автомобиль = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			ИначеЕсли Выборка.ВидОбъекта = "Автомобиль" Тогда
				Если ТипЗнч(Выборка.Объект) = Тип("Строка") Тогда
					Автомобиль = СтрЗаменить(Выборка.Объект, "Автомобиль: ", "");
				Иначе
					Автомобиль = Выборка.Объект;
				КонецЕсли;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					Клиент = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			ИначеЕсли Выборка.ВидОбъекта = "Модель" Тогда
				Модель = Выборка.Объект;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					Клиент = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Автомобили") Тогда
					Автомобиль = Выборка.Клиент;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТипЗнч(Выборка.Объект) = Тип("Строка") И Найти(Выборка.Объект, "Клиент:") > 0 Тогда
				Клиент = СтрЗаменить(Выборка.Объект, "Клиент: ", "");
			ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("Строка") И Найти(Выборка.Объект, "Автомобиль:") > 0 Тогда
				Автомобиль = СтрЗаменить(Выборка.Объект, "Автомобиль: ", "");
			ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("Строка") Тогда
				Клиент = Выборка.Объект;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Автомобили") Тогда
					Автомобиль = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					Автомобиль = Выборка.Объект;
					Клиент = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				Клиент = Выборка.Объект;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Автомобили") Тогда
					Автомобиль = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Автомобили") Тогда
				Автомобиль = Выборка.Объект;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					Клиент = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("СправочникСсылка.Модели") Тогда
				Модель = Выборка.Объект;
				Если ТипЗнч(Выборка.Клиент) = Тип("Строка") ИЛИ ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Контрагенты") Тогда
					Клиент = Выборка.Клиент;
				ИначеЕсли ТипЗнч(Выборка.Клиент) = Тип("СправочникСсылка.Модели") Тогда
					Модель = Выборка.Клиент;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(Автомобиль) Тогда
			Модель = Автомобиль.Модель;
		КонецЕсли;
		
		МенеджерЗаписи.Клиент = Неопределено;
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
			Продолжить;
		КонецПопытки;
		
		МенеджерЗаписи = РегистрыСведений.атРабочиеЛистыИстория.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Автор      = Выборка.Автор;
		МенеджерЗаписи.Дата       = Выборка.Дата;
		МенеджерЗаписи.Клиент     = Клиент;
		МенеджерЗаписи.Автомобиль = Автомобиль;
		МенеджерЗаписи.Модель     = Модель;
		МенеджерЗаписи.Телефон = "";
		МенеджерЗаписи.Значение = Значение;
		
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьДо_5_1_07_02()

// Обновление до 5.1.07.04
//
Процедура ОбновитьДо_5_1_07_04()
	
	#Если Клиент Тогда
		Состояние("Обновление справочника ""Прайс-листы контрагентов""");
		Сообщить("Заполнение параметров учета НДС в справочнике ""Прайс-листы контрагентов""");
	#КонецЕсли
	
	Выборка = Справочники.ПрайсЛистыКонтрагентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураАвтозагрузки = ПолучитьСтарыйСценарийАвтозагрузки(Выборка.Ссылка);
		Если СтруктураАвтозагрузки <> Неопределено И СтруктураАвтозагрузки.ПеремещатьОбработанныеФайлы <> Неопределено Тогда
			СтруктураАвтозагрузки.Вставить("ДействиеСОбработаннымиФайлами", ?(СтруктураАвтозагрузки.ПеремещатьОбработанныеФайлы, "upload", ""));
			СтруктураАвтозагрузки.Вставить("СохранятьВКаталог", ЗначениеЗаполнено(СтруктураАвтозагрузки.КаталогФайлаПрайсЛиста));
			Если Не СтруктураАвтозагрузки.ПрайсИзИнтернета Тогда
				СтруктураАвтозагрузки.ТранспортПротокол = "FILE";
			КонецЕсли;
			СтруктураАвтозагрузки.Удалить("ПеремещатьОбработанныеФайлы");
			Справочники.ПрайсЛистыКонтрагентов.СохранитьСценарийАвтозагрузки(Выборка.Ссылка, СтруктураАвтозагрузки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СтавкаНДС) Тогда
			Продолжить;
		КонецЕсли;
		Объект = Выборка.ПолучитьОбъект();
		Объект.ЦенаВключаетНДС = Истина;
		Объект.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		Объект.ОбменДанными.Загрузка = Истина;
		Попытка
			Объект.Записать();
		Исключение
			#Если Клиент Тогда
				Сообщить("Ошибка при обновлении элемента справочника ""Прайс-листы контрагентов"" "+ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Прайс-листы контрагентов"" завершено");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_07_04()

// Обновление до 5.1.07.05
//
Процедура ОбновитьДо_5_1_07_05()
	ОбменССайтомАвтосервиса = Обработки.ОбменССайтомАвтосервиса.Создать();
	ОбменССайтомАвтосервиса.ВыполнитьОбновлениеКонфигурацииПереходОтСвойствОбъектовКРеквизитам();
КонецПроцедуры

// Обновление до 5.1.08.02
//
Процедура ОбновитьДо_5_1_08_02()
	сфпОбновитьПодсистемуСофтФон(); 
КонецПроцедуры

// Обновление до 5.1.10.02
//
Процедура ОбновитьДо_5_1_10_02()
	
	Сообщить("Обновление справочника ""Варианты отчетов""");
	
	// Найдем все сохраненные варианты отчета "Рекомендации по автомобилям"
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтчетов.Ссылка КАК ВариантОтчета,
		|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта
		|ИЗ
		|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		|ГДЕ
		|	ВариантыОтчетов.ИмяОтчета = ""РекомендацииПоАвтомобилям""";
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	ОтчетОбъект = Отчеты["РекомендацииПоАвтомобилям"].Создать();
	
	// Для каждого найденного варианты установим настройки по умолчанию
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбъектВариантаОтчета = ВыборкаДетальныеЗаписи.ВариантОтчета.ПолучитьОбъект();
		ОбъектВариантаОтчета.Настройки = Новый ХранилищеЗначения(ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек.Найти(ВыборкаДетальныеЗаписи.КлючВарианта).Настройки);
		ОбъектВариантаОтчета.Записать();
	КонецЦикла;
	
	Сообщить("Обновление справочника ""Варианты отчетов"" завершено.");
	
КонецПроцедуры

// Обновление до 5.1.10.05
//
Процедура ОбновитьДо_5_1_10_05()
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Организации"". Обновление видов налогообложения.");
	#КонецЕсли
	
	ОрганизацииВыборка=Справочники.Организации.Выбрать();
	
	Пока ОрганизацииВыборка.Следующий() Цикл
		ОрганизацияОбъект=ОрганизацииВыборка.ПолучитьОбъект();
		Если ОрганизацияОбъект.ОсвобожденОтНДС Тогда
			ОрганизацияОбъект.СистемаНалогообложения=Перечисления.СистемыНалогообложения.Упрощенная;
			ОрганизацияОбъект.ОбъектНалогообложения=Перечисления.ВидыОбъектовНалогообложения.Доходы;
		Иначе
			Если НЕ ЗначениеЗаполнено(ОрганизацияОбъект.СистемаНалогообложения) Тогда
				ОрганизацияОбъект.СистемаНалогообложения=Перечисления.СистемыНалогообложения.Общая;
			КонецЕсли; 
		КонецЕсли; 
		ОрганизацияОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ОрганизацияОбъект.Записать();
			Сообщить("Обновлена организация """+ОрганизацияОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка обновления организации """+ОрганизацияОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла; 
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Организации"". Обновление видов налогообложения завершено.");
	#КонецЕсли
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Подразделения компании"". Обновление видов налогообложения.");
	#КонецЕсли
	
	ПодразделенияКомпанииВыборка=Справочники.ПодразделенияКомпании.Выбрать();
	
	Пока ПодразделенияКомпанииВыборка.Следующий() Цикл
		ПодразделенияКомпанииОбъект=ПодразделенияКомпанииВыборка.ПолучитьОбъект();
		Если ПодразделенияКомпанииОбъект.ОсвобожденОтНДС Тогда
			ПодразделенияКомпанииОбъект.ВидНалога=Перечисления.ВидыНалогов.ЕНВД;
			ПодразделенияКомпанииОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ПодразделенияКомпанииОбъект.Записать();
				Сообщить("Обновлено подразделение компании """+ПодразделенияКомпанииОбъект.Ссылка+"""");
			Исключение
				Сообщить("Ошибка обновления подразделения компании """+ПодразделенияКомпанииОбъект.Ссылка+""": "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли; 
	КонецЦикла; 
	
	#Если Клиент Тогда
		Сообщить("Справочник ""Подразделения компании"". Обновление видов налогообложения завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_10_05()

// Обновление до 5.1.11.02
//
Процедура ОбновитьДо_5_1_11_02()
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Контрагенты и контакты"". Установка согласия на получения SMS.");
	#КонецЕсли
	
	// Найдем контрагентов, которые дали согласие на обработку персональных данных.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.СогласиеНаОбработкуПерсональныхДанных = ЗНАЧЕНИЕ(Перечисление.ВариантыОтветов.Да)";
	
	ВыборкаКонтрагентов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКонтрагентов.Следующий() Цикл
		КонтрагентОбъект = ВыборкаКонтрагентов.Контрагент.ПолучитьОбъект();
		КонтрагентОбъект.СогласиеНаПолучениеSMS = Истина;
		КонтрагентОбъект.ОбменДанными.Загрузка  = Истина;
		Попытка
			КонтрагентОбъект.Записать();
			Сообщить("Обновлен контрагент """+КонтрагентОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка обновления контрагента """+КонтрагентОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Контрагенты и контакты"" завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_11_02()

// Обновление до 5.1.13.03
//
Процедура ОбновитьДо_5_1_13_03()
	
	#Если Клиент Тогда
		Сообщить("Обновление справочников ""Типы номенклатуры"" и ""Типы оплат"". Заполнение обязательных реквизитов.");
	#КонецЕсли
	
	ЗапросТипыноменклатуры = Новый Запрос;
	ЗапросТипыноменклатуры.Текст =
	"ВЫБРАТЬ
	|	ТипыНоменклатуры.Ссылка,
	|	ТипыНоменклатуры.ВидНоменклатуры,
	|	ТипыНоменклатуры.Предопределенный,
	|	ТипыНоменклатуры.Представление,
	|	ТипыНоменклатуры.ПризнакПредметаРасчета
	|ИЗ
	|	Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры
	|ГДЕ
	|	НЕ ТипыНоменклатуры.ЭтоГруппа";
	
	Результат = ЗапросТипыноменклатуры.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ПризнакПредметаРасчета) Тогда
				ВыборкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Если Выборка.Предопределенный Тогда
					Если Выборка.Ссылка = Справочники.ТипыНоменклатуры.Авторабота Тогда
						ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Работа;
					ИначеЕсли Выборка.Ссылка = Справочники.ТипыНоменклатуры.Услуга Тогда
						ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
					Иначе
						ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
					КонецЕсли;
				Иначе
					Если Выборка.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
						ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
					Иначе
						ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
					КонецЕсли;
				КонецЕсли;
				
				ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
				
				Попытка
					ВыборкаОбъект.Записать();
					Сообщить("Обновлен тип номенклатуры """+Выборка.Представление+"""");
				Исключение
					Сообщить("Ошибка обновления типа номенклатуры """+Выборка.Представление+""": "+ОписаниеОшибки());
				КонецПопытки;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВыборкаОплаты = Справочники.ТипыОплат.Выбрать();
	Пока ВыборкаОплаты.Следующий() Цикл
		Если ВыборкаОплаты.Предопределенный Тогда
			ВыборкаОбъект = ВыборкаОплаты.Ссылка.ПолучитьОбъект();
			Если ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.Наличные Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные;
			ИначеЕсли ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.Безналичные Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
			ИначеЕсли ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.ЗачетАванса Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата;
				ВыборкаОбъект.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				ВыборкаОбъект.Объект = Перечисления.ТипыОплатыВРознице.ЗаСчетЗаведения;
			ИначеЕсли ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.Кредит Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
			ИначеЕсли ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.ОплатаВРассрочку Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата;
				ВыборкаОбъект.ВидОплаты = Перечисления.ВидыОплаты.ПроизвольнаяОплата;
				ВыборкаОбъект.Объект = Перечисления.ТипыОплатыВРознице.ЗаСчетЗаведения;
			ИначеЕсли ВыборкаОплаты.Ссылка = Справочники.ТипыОплат.Талон Тогда
				ВыборкаОбъект.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата;
			КонецЕсли;
			
			ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ВыборкаОбъект.Записать();
				Сообщить("Обновлен тип оплаты """+ВыборкаОплаты.Наименование+"""");
			Исключение
				Сообщить("Ошибка обновления типа оплаты """+ВыборкаОплаты.Наименование+""": "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочников ""Типы номенклатуры"" и ""Типы оплат"" завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_13_03()

// Обновление до 5.1.15.16
//
Процедура ОбновитьДо_5_1_15_16()
	
	#Если Клиент Тогда
		Сообщить("Обновление документа ""Корректировка поступления автомобилей"". Заполнение реквизитов.");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаПоступленияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	               |	КорректировкаПоступленияАвтомобилейАвтомобили.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.КорректировкаПоступленияАвтомобилей.Автомобили КАК КорректировкаПоступленияАвтомобилейАвтомобили
	               |ГДЕ
	               |	КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоПоДокументуПоступления = 0
	               |	И КорректировкаПоступленияАвтомобилейАвтомобили.Количество = 0
	               |	И КорректировкаПоступленияАвтомобилейАвтомобили.КоличествоРазница = 0
	               |ИТОГИ ПО
	               |	Ссылка";
	
	ВыборкаДокумента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумента.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокумента.Ссылка.ПолучитьОбъект();
		
		ВыборкаСтрокДокумента = ВыборкаДокумента.Выбрать();
		
		Пока ВыборкаСтрокДокумента.Следующий() Цикл
			СтрокаАвтомобиля = ДокументОбъект.Автомобили.Найти(ВыборкаСтрокДокумента.НомерСтроки, "НомерСтроки");
			Если НЕ СтрокаАвтомобиля = Неопределено Тогда
				СтрокаАвтомобиля.КоличествоПоДокументуПоступления = 1;
				СтрокаАвтомобиля.Количество = 1;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление документа ""Корректировка поступления автомобилей"" завершено.");
	#КонецЕсли
	
	#Если Клиент Тогда
		Сообщить("Обновление документа ""Корректировка реализация автомобилей"". Заполнение реквизитов.");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализацииАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	               |	КорректировкаРеализацииАвтомобилейАвтомобили.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК КорректировкаРеализацииАвтомобилейАвтомобили
	               |ГДЕ
	               |	КорректировкаРеализацииАвтомобилейАвтомобили.КоличествоПоДокументуРеализации = 0
	               |	И КорректировкаРеализацииАвтомобилейАвтомобили.Количество = 0
	               |	И КорректировкаРеализацииАвтомобилейАвтомобили.КоличествоРазница = 0
	               |ИТОГИ ПО
	               |	Ссылка";
	
	ВыборкаДокумента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумента.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокумента.Ссылка.ПолучитьОбъект();
		
		ВыборкаСтрокДокумента = ВыборкаДокумента.Выбрать();
		
		Пока ВыборкаСтрокДокумента.Следующий() Цикл
			СтрокаАвтомобиля = ДокументОбъект.Автомобили.Найти(ВыборкаСтрокДокумента.НомерСтроки, "НомерСтроки");
			Если НЕ СтрокаАвтомобиля = Неопределено Тогда
				СтрокаАвтомобиля.КоличествоПоДокументуРеализации = 1;
				СтрокаАвтомобиля.Количество = 1;
			КонецЕсли;
		КонецЦикла;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Обновление документа ""Корректировка реализация автомобилей"" завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_15_16()

// Обновление до 5.1.17.09
//
Процедура ОбновитьДо_5_1_17_09()
	
	#Если Клиент Тогда
		Сообщить("Обновление документов оплаты для пробития. Заполнение реквизита <Тип расчета>.");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Выписка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Выписка КАК Выписка
	               |ГДЕ
	               |	Выписка.ДляПробитияНаФР
	               |	И Выписка.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	               |ГДЕ
	               |	ПриходныйКассовыйОрдер.ДляПробитияНаФР
	               |	И ПриходныйКассовыйОрдер.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасходныйКассовыйОрдер.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.ДляПробитияНаФР
	               |	И РасходныйКассовыйОрдер.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка)";
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаВыписки = ПакетЗапроса[0].Выбрать();
	
	Пока ВыборкаВыписки.Следующий() Цикл
		
		ДокументОбъект = ВыборкаВыписки.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТипРасчета = дкТипРасчетаДокумента(ВыборкаВыписки.Ссылка);
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	ВыборкаПКО = ПакетЗапроса[1].Выбрать();
	
	Пока ВыборкаПКО.Следующий() Цикл
		
		ДокументОбъект = ВыборкаПКО.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТипРасчета = дкТипРасчетаДокумента(ВыборкаПКО.Ссылка);
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	ВыборкаРКО = ПакетЗапроса[2].Выбрать();
	
	Пока ВыборкаРКО.Следующий() Цикл
		
		ДокументОбъект = ВыборкаРКО.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТипРасчета = дкТипРасчетаДокумента(ВыборкаРКО.Ссылка);
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	
	#Если Клиент Тогда
		Сообщить("Обновление документов оплаты для пробития. Заполнение реквизита <Тип расчета> завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_15_16()

// Обновление до 5.1.19.02
//
Процедура ОбновитьДо_5_1_19_02()
	
	Если НЕ зфЗащищенныеФункцииСервер.ПодсистемаДоступна("ЗащитаТехосмотр",Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		ТекстВопроса = "Добавлены новые требования к транспортным средствам.
						|Произвести автозаполнение справочника требований к транспортным средствам?";
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	Справочники.ТребованияКТранспортнымСредствам.ЗагрузитьТребованияИзМакета();
	
КонецПроцедуры // ОбновитьДо_5_1_19_02()

Процедура ОбновитьДо_5_1_20_03()
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Ставки НДС"".");
	#КонецЕсли
	
	Справочники.СтавкиНДС.ЗаполнитьПредопределенныеЭлементы();
	
КонецПроцедуры // ОбновитьДо_5_1_20_03()

Процедура ОбновитьДо_5_1_22_02()
	
	#Если Клиент Тогда
		Сообщить("Обновление регистра сведений ""Состояния кодов маркировки"".");
	#КонецЕсли
	
	РегистрыСведений.КодыМаркировкиДляПечати.ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры // ОбновитьДо_5_1_22_02()

Процедура ОбновитьДо_5_1_23_05()
	
	#Если Клиент Тогда
		Сообщить("Обновление регистра накопления ""Маркировка товаров в производстве"".");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаркировкаТоваровВПроизводстве.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.МаркировкаТоваровВПроизводстве КАК МаркировкаТоваровВПроизводстве";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбработкаШК = Обработки.ШтрихКоды.Создать();
	
	// Заполним новые реквизиты по заказ-нарядам
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.МаркировкаТоваровВПроизводстве.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
			
			Если ЗначениеЗаполнено(ТекущаяЗапись.GTIN) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМаркировки =
				ОбработкаШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяЗапись.УдалитьКодМаркировки, Истина);
			Если НЕ СтруктураМаркировки.Разобран Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Код маркировки <%1> не разобран. Проверьте его корректность.'"),
					СокрЛП(ТекущаяЗапись.УдалитьКодМаркировки)
					);
				#Если Клиент Тогда
					Сообщить(ТекстСообщения);
				#КонецЕсли
				Продолжить;
			КонецЕсли;
			
			ТекущаяЗапись.GTIN = СтруктураМаркировки.ДанныеШтрихкода["01"].Значение;
			ТекущаяЗапись.СерийныйНомер = СтруктураМаркировки.ДанныеШтрихкода["21"].Значение;
			ТекущаяЗапись.КодМаркировки = ТекущаяЗапись.УдалитьКодМаркировки;
			ТекущаяЗапись.УдалитьКодМаркировки = "";
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Завершено обновление регистра накопления ""Маркировка товаров в производстве"".");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_23_05()

Процедура ОбновитьДо_5_1_23_06()
	
	#Если Клиент Тогда
		Сообщить("Очистка криптохвостов в документах и справочниках.");
	#КонецЕсли
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокументыСМаркировкой = ДокументыСКодамиМаркировки();
	Для Каждого ДокументСМаркировкой Из ДокументыСМаркировкой Цикл
		ОтрезатьКриптохвосты(ДокументСМаркировкой);
	КонецЦикла;
	
	ОтрезатьКриптохвостыСостоянияКодовМаркировки();
	ОтрезатьКриптохвостыМаркировкаТоваровВПроизводстве();
	
	#Если Клиент Тогда
		Сообщить("Очистка криптохвостов в документах и справочниках завершена.");
	#КонецЕсли

КонецПроцедуры

Процедура ОбновитьДо_5_1_24_05()
	
	#Если Клиент Тогда
		Сообщить("Заполнение реквизита ""Товарная группа""");
	#КонецЕсли
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводВОборотКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВводВОборотКодовМаркировки КАК ВводВОборотКодовМаркировки
	|ГДЕ
	|	ВводВОборотКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратВОборотКодовМаркировки.Ссылка
	|ИЗ
	|	Документ.ВозвратВОборотКодовМаркировки КАК ВозвратВОборотКодовМаркировки
	|ГДЕ
	|	ВозвратВОборотКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыводИзОборотаКодовМаркировки.Ссылка
	|ИЗ
	|	Документ.ВыводИзОборотаКодовМаркировки КАК ВыводИзОборотаКодовМаркировки
	|ГДЕ
	|	ВыводИзОборотаКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКодовМаркировки.Ссылка
	|ИЗ
	|	Документ.ЗаказКодовМаркировки КАК ЗаказКодовМаркировки
	|ГДЕ
	|	ЗаказКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтгрузкаТоваровКодовМаркировки.Ссылка
	|ИЗ
	|	Документ.ОтгрузкаТоваровКодовМаркировки КАК ОтгрузкаТоваровКодовМаркировки
	|ГДЕ
	|	ОтгрузкаТоваровКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Перемаркировка.Ссылка
	|ИЗ
	|	Документ.Перемаркировка КАК Перемаркировка
	|ГДЕ
	|	Перемаркировка.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеКодовМаркировки.Ссылка
	|ИЗ
	|	Документ.СписаниеКодовМаркировки КАК СписаниеКодовМаркировки	
	|ГДЕ
	|	СписаниеКодовМаркировки.ТоварнаяГруппа = ЗНАЧЕНИЕ(Справочник.ТипыМаркировки.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТоварнаяГруппа = Справочники.ТипыМаркировки.ШиныИАвтопокрышки;
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ """+ДокументОбъект.Ссылка+"""");
		Исключение
			Сообщить("Ошибка при обновлении документа """+ДокументОбъект.Ссылка+""": "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Заполнение реквизита ""Товарная группа"" завершено");
	#КонецЕсли

КонецПроцедуры

Процедура ОбновитьДо_5_1_24_06()
	
	#Если Клиент Тогда
		Сообщить("Заполнение документа ""Перемаркировка""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Перемаркировка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Перемаркировка КАК Перемаркировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеКодовМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СписаниеКодовМаркировки КАК СписаниеКодовМаркировки
	|ГДЕ
	|	СписаниеКодовМаркировки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСписанияКодовМаркировки.Выполнен)
	|	И СписаниеКодовМаркировки.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.СписаниеНанесенныхКодовМаркировки)";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	// Заполним код ТНВЭД для табличной части Товаров
	ВыборкаПеремаркировки = ПакетЗапросов[0].Выбрать();
	
	Пока ВыборкаПеремаркировки.Следующий() Цикл
		
		ДокументПеремаркировки = ВыборкаПеремаркировки.Ссылка.ПолучитьОбъект();
		
		ЕстьОбновление = Ложь;
		
		Для Каждого ТекущаяСтрока Из ДокументПеремаркировки.Товары Цикл
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодТНВЭД) Тогда
				
				ТекущаяСтрока.КодТНВЭД = ТекущаяСтрока.Номенклатура.КодТНВЭД;
				ЕстьОбновление = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьОбновление Тогда
			
			ДокументПеремаркировки.ОбменДанными.Загрузка = Истина;
			
			Попытка
				ДокументПеремаркировки.Записать();
				Сообщить("Обновлен документ """+ДокументПеремаркировки.Ссылка+"""");
			Исключение
				
				Сообщить("Ошибка при обновлении документа """+ДокументПеремаркировки.Ссылка+""": "+ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Перезаполним статус кода маркировки при списании
	ВыборкаСписания = ПакетЗапросов[1].Выбрать();
	
	Пока ВыборкаСписания.Следующий() Цикл
		
		НаборЗаписи = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписи.Отбор.ДокументОснование.Установить(ВыборкаСписания.Ссылка);
		НаборЗаписи.Прочитать();
		
		Для Каждого ТекущаяСтрока Из НаборЗаписи Цикл
			
			ТекущаяСтрока.Состояние =
				Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаПриУтратеИлиПовреждении;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписи.Записать();
		Исключение
			
			Сообщить("Ошибка при обновлении документа """+ВыборкаСписания.Ссылка+""": "+ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить("Заполнение документа ""Перемаркировка"" завершено");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_25_03()
	
	#Если Клиент Тогда
	Сообщить("Обновление справочников ""Договоры взаиморасчетов""");
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах = ЗНАЧЕНИЕ(Перечисление.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДоговорВзаиморасчетов = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияПрочерк;
		ДоговорВзаиморасчетов.ОбменДанными.Загрузка = Истина;
		Попытка
			ДоговорВзаиморасчетов.Записать();
			Сообщить("Обновлен справочник <"+ДоговорВзаиморасчетов+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+ДоговорВзаиморасчетов+">: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление справочников ""Договоры взаиморасчетов"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_30_03()
	
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Классификатор единиц измерения""");
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|ГДЕ
	|	КлассификаторЕдиницИзмерения.МераКоличестваПредметаРасчетаККТ = ЗНАЧЕНИЕ(Перечисление.МераКоличестваПредметаРасчетаККТ.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		КлассификаторЕдиницИзмерения = Выборка.Ссылка.ПолучитьОбъект();
		КлассификаторЕдиницИзмерения.МераКоличестваПредметаРасчетаККТ = Перечисления.МераКоличестваПредметаРасчетаККТ.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(КлассификаторЕдиницИзмерения.Код);
		КлассификаторЕдиницИзмерения.ОбменДанными.Загрузка = Истина;
		Попытка
			КлассификаторЕдиницИзмерения.Записать();
			Сообщить("Обновлен справочник <"+КлассификаторЕдиницИзмерения+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+КлассификаторЕдиницИзмерения+">: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Классификатор единиц измерения"" завершено.");
	Сообщить("Обновление справочника ""Контрагенты и контакты""");
	#КонецЕсли
	
	СтранаРоссия = Справочники.КлассификаторСтранМира.НайтиПоКоду("643");
	Если СтранаРоссия = Справочники.КлассификаторСтранМира.ПустаяСсылка() Тогда
		СтранаРоссияОбъект = Справочники.КлассификаторСтранМира.СоздатьЭлемент();
		СтранаРоссияОбъект.Код = "643";
		СтранаРоссияОбъект.Наименование       = "РОССИЯ";
		СтранаРоссияОбъект.НаименованиеПолное = "Российская Федерация";
		НовыйПрефикс = СтранаРоссияОбъект.ПрефиксыШК.Добавить();
		НовыйПрефикс.Префикс = "46";
		СтранаРоссияОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			СтранаРоссияОбъект.Записать();
			Сообщить("Создан элемент справочника <Классификатор стран мира> <"+СтранаРоссияОбъект+">.");
			СтранаРоссия = СтранаРоссияОбъект.Ссылка;
		Исключение
			Сообщить("Ошибка создания элемента справочника <Классификатор стран мира>: "+ОписаниеОшибки());
			СтранаРоссия = Справочники.КлассификаторСтранМира.ПустаяСсылка();
		КонецПопытки;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	НЕ Контрагенты.ЭтоГруппа
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И Контрагенты.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
	|	И Контрагенты.Гражданство = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Контрагент = Выборка.Ссылка.ПолучитьОбъект();
		Если обЗначениеНеЗаполнено(Контрагент.ИНН) Тогда
			Продолжить;
		КонецЕсли;
		Если СтрДлина(СокрЛП(Контрагент.ИНН)) <> 12 Тогда
			Продолжить;
		КонецЕсли;
		Контрагент.Гражданство = СтранаРоссия;
		Контрагент.ОбменДанными.Загрузка = Истина;
		Попытка
			Контрагент.Записать();
			Сообщить("Обновлен справочник <"+Контрагент+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+Контрагент+">: "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Контрагенты и контакты"" завершено.");
	Сообщить("Обновление справочника ""Подтверждающие документы""");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	ВидыПодтверждающихДокументов = Новый Массив;
	ВидыПодтверждающихДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВидНаЖительствоИностранногоГражданина"));
	ВидыПодтверждающихДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВоенныйБилет"));
	ВидыПодтверждающихДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Паспорт"));
	ВидыПодтверждающихДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Свидетельство"));
	ВидыПодтверждающихДокументов.Добавить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Удостоверение"));
	Запрос.УстановитьПараметр("ВидыПодтверждающихДокументов", ВидыПодтверждающихДокументов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Ссылка КАК Ссылка,
	|	ПодтверждающиеДокументы.ВидПодтверждающегоДокумента КАК ВидПодтверждающегоДокумента
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	НЕ ПодтверждающиеДокументы.ПометкаУдаления
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента В (&ВидыПодтверждающихДокументов)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПодтверждающийДокумент = Выборка.Ссылка.ПолучитьОбъект();
		ПодтверждающийДокумент.КодВидаДокументаУдостоверяющегоЛичность = Перечисления.ВидДокументаУдостоверяющегоЛичность.КодВидаДокументаУдостоверяющегоЛичностьПоВидуПодтверждающегоДокумента(Выборка.ВидПодтверждающегоДокумента);
		ПодтверждающийДокумент.ОбменДанными.Загрузка = Истина;
		Попытка
			ПодтверждающийДокумент.Записать();
			Сообщить("Обновлен справочник <"+ПодтверждающийДокумент+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+ПодтверждающийДокумент+">: "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Подтверждающие документы"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_30_06()
	
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Классификатор стран мира""");
	#КонецЕсли
	
	Макет = Справочники.КлассификаторСтранМира.ПолучитьМакет("Классификатор");
	КлассификаторXML = Макет.ПолучитьТекст();
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(КлассификаторXML);
	ТаблицаСтран = СериализаторXDTO.ПрочитатьXML(Чтение);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлассификаторСтранМира.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира";
	
	Выборка = Запрос.Выполнить().Выбрать();
	УдаляемыеОбъекты = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ЕстьСоответствие = Ложь;
		КлассификаторСтранМира = Выборка.Ссылка.ПолучитьОбъект();
		ПараметрыОтбора = Новый Структура("Наименование");
		ПараметрыОтбора.Наименование = ВРег(КлассификаторСтранМира.Наименование);
		НайденныеСтроки = ТаблицаСтран.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			ЗаполнитьЗначенияСвойств(КлассификаторСтранМира, НайденныеСтроки[0]);
			Если ПустаяСтрока(КлассификаторСтранМира.НаименованиеПолное) Тогда
				КлассификаторСтранМира.НаименованиеПолное=КлассификаторСтранМира.Наименование;
			КонецЕсли;
			ЕстьСоответствие = Истина;
		Иначе
			ПараметрыОтбора = Новый Структура("Код");
			ПараметрыОтбора.Код = КлассификаторСтранМира.Код;
			НайденныеСтроки = ТаблицаСтран.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество()>0 Тогда
				ЗаполнитьЗначенияСвойств(КлассификаторСтранМира, НайденныеСтроки[0]);
				Если ПустаяСтрока(КлассификаторСтранМира.НаименованиеПолное) Тогда
					КлассификаторСтранМира.НаименованиеПолное=КлассификаторСтранМира.Наименование;
				КонецЕсли;
				ЕстьСоответствие = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЕстьСоответствие Тогда
			УдаляемыеОбъекты.Добавить(КлассификаторСтранМира.Ссылка);
			Продолжить;
		КонецЕсли;
		
		КлассификаторСтранМира.ОбменДанными.Загрузка = Истина;
		Попытка
			КлассификаторСтранМира.Записать();
			Сообщить("Обновлен справочник <"+КлассификаторСтранМира+">.");
		Исключение
			Сообщить("Ошибка обновления справочника <"+КлассификаторСтранМира+">: "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	// удалим отсутствующие в классификаторе страны (если есть)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ДайТекстЗапросаПоНесуществующимСтранам();
	
	Запрос.УстановитьПараметр("Страна", УдаляемыеОбъекты);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = "В классификаторе стран мира нет записи с кодом <" + Выборка.Страна.Код+"> и наименованием <"+Выборка.Страна.Наименование+">.
		|Используется в следующих объектах:";
		ДетальнаяВыборка = Выборка.Выбрать();
		Пока ДетальнаяВыборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения+Символы.ПС+Символы.Таб+ТипЗнч(ДетальнаяВыборка.Ссылка)+" "+ДетальнаяВыборка.Ссылка;
			Если НЕ обЗначениеНеЗаполнено(ДетальнаяВыборка.ИмяТаблицы) Тогда
				ТекстСообщения = ТекстСообщения+" в табличной части <"+ДетальнаяВыборка.ИмяТаблицы+">.";
			КонецЕсли;
		КонецЦикла;
		Сообщить(ТекстСообщения);
	КонецЦикла;
	
	Страны = Пакет[2].Выгрузить().ВыгрузитьКолонку("Страна");
	
	Для Каждого Страна Из УдаляемыеОбъекты Цикл
		Если Страны.Найти(Страна) = Неопределено Тогда
			Объект = Страна.ПолучитьОбъект();
			Попытка
				Объект.Удалить();
			Исключение
				Сообщить("Ошибка удаления справочника <"+КлассификаторСтранМира+">: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	// удалим задвоенные объекты
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	КлассификаторСтранМира.Ссылка КАК Ссылка,
	|	КлассификаторСтранМира.Код КАК Код,
	|	1 КАК Количество
	|ИЗ
	|	Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество = 1 Тогда
			Продолжить;
		КонецЕсли;
		НетОшибок = Истина;
		ДетальнаяВыборка = Выборка.Выбрать();
		ДублиСтран = Новый Массив;
		Пока ДетальнаяВыборка.Следующий() Цикл
			ДублиСтран.Добавить(ДетальнаяВыборка.Ссылка);
		КонецЦикла;
		
		ОсновнаяСтрана = ДублиСтран[0];
		ДублиСтран.Удалить(0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ДайТекстЗапросаПоДублямСтран();
		Запрос.УстановитьПараметр("Страна", ДублиСтран);
		
		ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОбъектов.Следующий() Цикл
			Объект = ВыборкаОбъектов.Ссылка.ПолучитьОбъект();
			ДетальнаяВыборка=ВыборкаОбъектов.Выбрать();
			Пока ДетальнаяВыборка.Следующий() Цикл
				
				Если обЗначениеНеЗаполнено(ДетальнаяВыборка.ИмяТаблицы) Тогда
					// это реквизит объекта
					Объект[ДетальнаяВыборка.ИмяРеквизита] = ОсновнаяСтрана;
				Иначе
					// Это таблица
					ТаблицаТоваров = Объект[ДетальнаяВыборка.ИмяТаблицы];
					Для Каждого Дубль Из ДублиСтран Цикл
						НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Новый Структура(ДетальнаяВыборка.ИмяРеквизита, Дубль));
						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							НайденнаяСтрока[ДетальнаяВыборка.ИмяРеквизита] = ОсновнаяСтрана;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
			Объект.ОбменДанными.Загрузка = Истина;
			Попытка
				Объект.Записать();
			Исключение
				НетОшибок = Ложь;
			КонецПопытки;
		КонецЦикла;
		
		Если НетОшибок Тогда
			Для Каждого Дубль Из ДублиСтран Цикл
				ДубльОбъект = Дубль.ПолучитьОбъект();
				Попытка
					ДубльОбъект.Удалить();
				Исключение
					Сообщить("Ошибка удаления справочника <"+ДубльОбъект+">: "+ОписаниеОшибки());
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	#Если Клиент Тогда
	Сообщить("Обновление справочника ""Классификатор стран мира"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_31_03()
	
	#Если Клиент Тогда
	Сообщить("Заполнение справочника ""Коды операций прослеживаемости""");
	#КонецЕсли
	
	// Получим описание операций
	ВидыОпераций = Новый Соответствие;
	
	Макет = Справочники.КодыОперацийПрослеживаемости.ПолучитьМакет("ВидыОпераций");
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		
		КодОперации = СокрЛП(Макет.Область(НомерСтроки, 1).Текст);
		Если ПустаяСтрока(КодОперации) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = Новый Структура();
		Значение.Вставить("Описание", СокрЛП(Макет.Область(НомерСтроки, 2).Текст));
		Значение.Вставить("Условие", СокрЛП(Макет.Область(НомерСтроки, 3).Текст));
		ВидыОпераций.Вставить(СокрЛП(КодОперации), Значение);
		
	КонецЦикла;
	
	// Найдем операции
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КодыОперацийПрослеживаемости.Ссылка КАК Ссылка,
	|	КодыОперацийПрослеживаемости.Код КАК Код
	|ИЗ
	|	Справочник.КодыОперацийПрослеживаемости КАК КодыОперацийПрослеживаемости";
	
	// Заполним операции описанием
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОписаниеОперации = ВидыОпераций.Получить(СокрЛП(Выборка.Код));
		Если ОписаниеОперации <> Неопределено Тогда
			ОбъектОперации = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектОперации.Описание = ОписаниеОперации.Описание;
			ОбъектОперации.Условие = ОписаниеОперации.Условие;
			ОбъектОперации.ОбменДанными.Загрузка = Истина;
			Попытка
				ОбъектОперации.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Заполнение справочника ""Коды операций прослеживаемости"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_31_04()
	
	#Если Клиент Тогда
	Сообщить("Заполнение регистра сведений ""Операции прослеживаемых товаров""");
	#КонецЕсли
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Метаданные.Документы.ВозвратОтПокупателя);
	ТипыДокументов.Добавить(Метаданные.Документы.ВозвратОтПокупателяАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.ВозвратПоставщику);
	ТипыДокументов.Добавить(Метаданные.Документы.ВозвратПоставщикуАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.ЗаказНаряд);
	ТипыДокументов.Добавить(Метаданные.Документы.ИнвентаризацияАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.ЗакрытиеСмены);
	ТипыДокументов.Добавить(Метаданные.Документы.Инвентаризация);
	ТипыДокументов.Добавить(Метаданные.Документы.КорректировкаПоступления);
	ТипыДокументов.Добавить(Метаданные.Документы.КорректировкаПоступленияАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.КорректировкаРеализации);
	ТипыДокументов.Добавить(Метаданные.Документы.КорректировкаРеализацииАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.ПоступлениеАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.ПоступлениеТоваров);
	ТипыДокументов.Добавить(Метаданные.Документы.РеализацияАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.РеализацияТоваров);
	ТипыДокументов.Добавить(Метаданные.Документы.СписаниеАвтомобилей);
	ТипыДокументов.Добавить(Метаданные.Документы.СписаниеТоваров);
	
	Для Каждого ТипДокумента Из ТипыДокументов Цикл
		
		#Если Клиент Тогда
			Сообщить("Обработка документов """ + ТипДокумента.Синоним + """");
		#КонецЕсли
		
		ЗаполнитьДанныеОбОперацияхПрослеживаемогоТовара(ТипДокумента.Имя);
		
		#Если Клиент Тогда
			Сообщить("Обработка документов """ + ТипДокумента.Синоним + """ завершена");
		#КонецЕсли
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Заполнение регистра сведений ""Операции прослеживаемых товаров"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_33_05()
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Модели автомобилей"". Заполнение обязательных реквизитов.");
	#КонецЕсли
	
	ЗапросМоделиАвтомобилей = Новый Запрос;
	ЗапросМоделиАвтомобилей.Текст =
	"ВЫБРАТЬ
	|	Модели.Ссылка,
	|	Модели.ПризнакПредметаРасчета
	|ИЗ
	|	Справочник.Модели КАК Модели
	|ГДЕ
	|	НЕ Модели.ЭтоГруппа";
	
	Результат = ЗапросМоделиАвтомобилей.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка.ПризнакПредметаРасчета) Тогда
				ВыборкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ВыборкаОбъект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
				ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
				Попытка
					ВыборкаОбъект.Записать();
					Сообщить("Обновлена модель автомобиля """ + Выборка.Ссылка + """");
				Исключение
					Сообщить("Ошибка обновления модели автомобиля """ + Выборка.Ссылка + """: " + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Модели автомобилей"" завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_33_05()

Процедура ОбновитьДо_5_1_34_03()
	
	// Обновления признака предмета расчетов в таблмчных частях документов Чек, Чек на оплату, Чек коррекции
	
	// Обновление документов ЧЕК
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек""");
	#КонецЕсли

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Чек.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Чек КАК Чек
	               |ГДЕ
	               |	Чек.Товары.ПризнакПредметаРасчета = ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТоваров.ПризнакПредметаРасчета) Тогда
				СтрокаТоваров.ПризнакПредметаРасчета = СтрокаТоваров.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета;
			КонецЕсли;
		КонецЦикла;
			
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ <" + ДокументОбъект + ">.");
		Исключение
			Сообщить("Ошибка обновления документа <" + ДокументОбъект + ">: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек"" завершено.");
	#КонецЕсли
	
	// Обновление документов ЧЕК НА ОПЛАТУ
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек на оплату""");
	#КонецЕсли

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЧекНаОплату.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЧекНаОплату КАК ЧекНаОплату
	               |ГДЕ
	               |	ЧекНаОплату.Товары.ПризнакПредметаРасчета = ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТоваров.ПризнакПредметаРасчета) Тогда
				СтрокаТоваров.ПризнакПредметаРасчета = СтрокаТоваров.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета;
			КонецЕсли;
		КонецЦикла;
			
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ <" + ДокументОбъект + ">.");
		Исключение
			Сообщить("Ошибка обновления документа <" + ДокументОбъект + ">: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек на оплату"" завершено.");
	#КонецЕсли
	
	// Обновление документов ЧЕК КОРРЕКЦИИ
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек коррекции""");
	#КонецЕсли

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЧекКоррекции.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЧекКоррекции КАК ЧекКоррекции
	               |ГДЕ
	               |	ЧекКоррекции.Товары.ПризнакПредметаРасчета = ЗНАЧЕНИЕ(Перечисление.ПризнакиПредметаРасчета.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Для Каждого СтрокаТоваров Из ДокументОбъект.Товары Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТоваров.ПризнакПредметаРасчета) Тогда
				СтрокаТоваров.ПризнакПредметаРасчета = СтрокаТоваров.Номенклатура.ТипНоменклатуры.ПризнакПредметаРасчета;
			КонецЕсли;
		КонецЦикла;
			
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументОбъект.Записать();
			Сообщить("Обновлен документ <" + ДокументОбъект + ">.");
		Исключение
			Сообщить("Ошибка обновления документа <" + ДокументОбъект + ">: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек коррекции"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_37_02()
	
	Если НЕ ДозаполнениеКорректировкаПоступления() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДозаполнениеКорректировкаПоступленияАвтомобилей() Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Учетные записи электронной почты"". Заполнение обязательных реквизитов.");
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ВыборкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ВыборкаОбъект.ПриниматьПисьмаПриСтартеСистемы = Истина;
			ВыборкаОбъект.КоличествоДнейПриемаНовойПочты = 0;
			ВыборкаОбъект.ПротоколВходящейПочты = "POP3";
			
			ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ВыборкаОбъект.Записать();
				Сообщить("Обновлена учетная запись электронной почты """ + Выборка.Ссылка + """");
			Исключение
				Сообщить("Ошибка обновления учетной записи электронной почты """ + Выборка.Ссылка + """: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	#Если Клиент Тогда
		Сообщить("Обновление справочника ""Модели автомобилей"" завершено.");
	#КонецЕсли
	
КонецПроцедуры // ОбновитьДо_5_1_33_05()

Процедура ОбновитьДо_5_1_37_03()
	
	// Обновление документов ЧЕК
	#Если Клиент Тогда
	Сообщить("Обновление констант");
	#КонецЕсли

	Попытка
		Константы.ВосстанавливатьРазмерыФорм.Установить(Истина);
		Сообщить("Обновлена константа <Восстанавливать размеры форм>.");
	Исключение
		Сообщить("Ошибка обновления документа <Восстанавливать размеры форм>: " + ОписаниеОшибки());
	КонецПопытки;
	
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Чек"" завершено.");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_37_04()

	Справочники.КлассификаторСтранМира.ОбработатьДанныеДляПереходаНаНовуюВерсию();	
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_38_02()

	Справочники.ТипыОплат.ЗаполнитьПредопределенныеЭлементы();	
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_41_01()

	Справочники.ТипыНоменклатуры.ЗаполнитьПредопределенныеМаркируемыеЭлементы();	
	
КонецПроцедуры

Процедура ОбновитьДо_5_1_41_05()

	РегистрыНакопления.Продажи.ОчиститьСкладыДляЗаписейУслуг();
	
КонецПроцедуры

Функция ДозаполнениеКорректировкаПоступления()
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Корректировка поступления"".");
	#КонецЕсли
	
	ОшибкиОбновления = Ложь;
	
	ЗапросДокументов = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	КорректировкаПоступления.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	                      |ГДЕ
	                      |	КорректировкаПоступления.Товары.ГТДДоКорректировки = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка");
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		ВыборкаОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		ТребуетсяЗаписьОбъекта = Ложь;
		
		МассивНоменклатурыДляПоиска = Новый Массив();
		МассивХарактеристикНоменклатурыДляПоиска = Новый Массив();
		Для Каждого СтрокаОбъекта Из ВыборкаОбъект.Товары Цикл		
			Если СтрокаОбъекта.ГТДДоКорректировки.Пустая() Тогда
				МассивНоменклатурыДляПоиска.Добавить(СтрокаОбъекта.Номенклатура);
				МассивХарактеристикНоменклатурыДляПоиска.Добавить(СтрокаОбъекта.ХарактеристикаНоменклатуры);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивНоменклатурыДляПоиска.Количество() > 0 Тогда
			ЗапросГТДПартийТоваровКомпании = Новый Запрос(
				"ВЫБРАТЬ
				|	ГТДПартийТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
				|	ГТДПартийТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ГТДПартийТоваровКомпанииОстатки.Партия КАК Партия,
				|	ГТДПартийТоваровКомпанииОстатки.ГТД КАК ГТД,
				|	ГТДПартийТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток
				|ИЗ
				|	РегистрНакопления.ГТДПартийТоваровКомпании.Остатки(
				|			&МоментВремени,
				|			СкладКомпании = &СкладКомпании
				|				И Номенклатура В (&Номенклатура)
				|				И ХарактеристикаНоменклатуры В (&ХарактеристикаНоменклатуры)
				|				И Партия = &Партия) КАК ГТДПартийТоваровКомпанииОстатки");
			ЗапросГТДПартийТоваровКомпании.УстановитьПараметр("МоментВремени", Новый Граница(ВыборкаОбъект.МоментВремени(), ВидГраницы.Исключая));
			ЗапросГТДПартийТоваровКомпании.УстановитьПараметр("СкладКомпании", ВыборкаОбъект.СкладКомпании);
			ЗапросГТДПартийТоваровКомпании.УстановитьПараметр("Номенклатура", МассивНоменклатурыДляПоиска);
			ЗапросГТДПартийТоваровКомпании.УстановитьПараметр("ХарактеристикаНоменклатуры", МассивХарактеристикНоменклатурыДляПоиска);
			ЗапросГТДПартийТоваровКомпании.УстановитьПараметр("Партия", ВыборкаОбъект.ДокументОснование);
			
			РезультатГТДПартийТоваровКомпании = ЗапросГТДПартийТоваровКомпании.Выполнить().Выгрузить();
			
			Если РезультатГТДПартийТоваровКомпании.Количество() > 0 Тогда 
				Для Каждого СтрокаТоваров Из ВыборкаОбъект.Товары Цикл
					Если СтрокаТоваров.ГТДДоКорректировки = Справочники.ГТД.ПустаяСсылка() Тогда
						//СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ГТД", СтрокаТоваров.Номенклатура, СтрокаТоваров.ХарактеристикаНоменклатуры, СтрокаТоваров.ГТД);	
						СтруктураОтбора = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", СтрокаТоваров.Номенклатура, СтрокаТоваров.ХарактеристикаНоменклатуры);	
						НайденныеСтрокиГТДПартийТоваровКомпании = РезультатГТДПартийТоваровКомпании.НайтиСтроки(СтруктураОтбора);
						Если НайденныеСтрокиГТДПартийТоваровКомпании.Количество() > 0 Тогда
							Если СтрокаТоваров.ГТДДоКорректировки <> НайденныеСтрокиГТДПартийТоваровКомпании[0].ГТД Тогда
								СтрокаТоваров.ГТДДоКорректировки = НайденныеСтрокиГТДПартийТоваровКомпании[0].ГТД;
								РезультатГТДПартийТоваровКомпании.Удалить(НайденныеСтрокиГТДПартийТоваровКомпании[0]);
								ТребуетсяЗаписьОбъекта = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТребуетсяЗаписьОбъекта Тогда 
			ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ВыборкаОбъект.Записать();
				Сообщить("Обновлен документ """ + ВыборкаДокументов.Ссылка + """");
			Исключение
				ОшибкиОбновления = Истина;
				Сообщить("Ошибка обновления документа """ + ВыборкаДокументов.Ссылка + """: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
	Если ОшибкиОбновления = Ложь Тогда 
		Сообщить("Обновление документов ""Корректировка поступления"" завершено успешно.");
	Иначе
		Сообщить("При обновлении документов ""Корректировка поступления"" были зафиксированы ошибки.");
	КонецЕсли;
	#КонецЕсли

	Возврат НЕ ОшибкиОбновления;

КонецФункции

Функция ДозаполнениеКорректировкаПоступленияАвтомобилей()
	#Если Клиент Тогда
	Сообщить("Обновление документов ""Корректировка поступления автомобилей"".");
	#КонецЕсли
	
	ОшибкиОбновления = Ложь;
	
	ЗапросДокументов = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	КорректировкаПоступленияАвтомобилей.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.КорректировкаПоступленияАвтомобилей КАК КорректировкаПоступленияАвтомобилей
						  |ГДЕ
						  |	КорректировкаПоступленияАвтомобилей.Автомобили.ГТДДоКорректировки = ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка");
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		ВыборкаОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		ТребуетсяЗаписьОбъекта = Ложь;
		
		МассивАвтомобилейДляПоиска = Новый Массив();
		Для Каждого СтрокаОбъекта Из ВыборкаОбъект.Автомобили Цикл		
			Если СтрокаОбъекта.ГТДДоКорректировки.Пустая()  Тогда
				МассивАвтомобилейДляПоиска.Добавить(СтрокаОбъекта.Автомобиль);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивАвтомобилейДляПоиска.Количество() > 0 Тогда
			ЗапросОстаткиАвтомобилей = Новый Запрос(
				"ВЫБРАТЬ
				|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
				|	ОстаткиАвтомобилейОстатки.Партия КАК Партия,
				|	ОстаткиАвтомобилейОстатки.ГТД КАК ГТД,
				|	ОстаткиАвтомобилейОстатки.КоличествоОстаток КАК КоличествоОстаток
				|ИЗ
				|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(
				|			&МоментВремени,
				|			Автомобиль В (&Автомобиль)
				|				И СкладКомпании = &СкладКомпании
				|				И Партия = &Партия) КАК ОстаткиАвтомобилейОстатки");
			ЗапросОстаткиАвтомобилей.УстановитьПараметр("МоментВремени", Новый Граница(ВыборкаОбъект.МоментВремени(), ВидГраницы.Исключая));
			ЗапросОстаткиАвтомобилей.УстановитьПараметр("Автомобиль", МассивАвтомобилейДляПоиска);
			ЗапросОстаткиАвтомобилей.УстановитьПараметр("СкладКомпании", ВыборкаОбъект.СкладКомпании);
			ЗапросОстаткиАвтомобилей.УстановитьПараметр("Партия", ВыборкаОбъект.ДокументОснование);
			
			РезультатОстаткиАвтомобилей = ЗапросОстаткиАвтомобилей.Выполнить().Выгрузить();
			
			Если РезультатОстаткиАвтомобилей.Количество() > 0 Тогда 
				Для Каждого СтрокаАвтомобилей Из ВыборкаОбъект.Автомобили Цикл
					Если СтрокаАвтомобилей.ГТДДоКорректировки = Справочники.ГТД.ПустаяСсылка() Тогда
						//СтруктураОтбора = Новый Структура("Автомобиль, ГТД", СтрокаАвтомобилей.Автомобиль, СтрокаАвтомобилей.ГТД);	
						СтруктураОтбора = Новый Структура("Автомобиль", СтрокаАвтомобилей.Автомобиль);	
						НайденныеСтрокиОстаткиАвтомобилей = РезультатОстаткиАвтомобилей.НайтиСтроки(СтруктураОтбора);
						Если НайденныеСтрокиОстаткиАвтомобилей.Количество() > 0 Тогда
							Если СтрокаАвтомобилей.ГТДДоКорректировки <> НайденныеСтрокиОстаткиАвтомобилей[0].ГТД Тогда
								СтрокаАвтомобилей.ГТДДоКорректировки = НайденныеСтрокиОстаткиАвтомобилей[0].ГТД;
								РезультатОстаткиАвтомобилей.Удалить(НайденныеСтрокиОстаткиАвтомобилей[0]);
								ТребуетсяЗаписьОбъекта = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ТребуетсяЗаписьОбъекта Тогда 
			ВыборкаОбъект.ОбменДанными.Загрузка = Истина;
			Попытка
				ВыборкаОбъект.Записать();
				Сообщить("Обновлен документ """ + ВыборкаДокументов.Ссылка + """");
			Исключение
				ОшибкиОбновления = Истина;
				Сообщить("Ошибка обновления документа """ + ВыборкаДокументов.Ссылка + """: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	#Если Клиент Тогда
	Если ОшибкиОбновления = Ложь Тогда 
		Сообщить("Обновление документов ""Корректировка поступления автомобилей"" завершено успешно.");
	Иначе
		Сообщить("При обновлении документов ""Корректировка поступления автомобилей"" были зафиксированы ошибки.");
	КонецЕсли;
	#КонецЕсли

	Возврат НЕ ОшибкиОбновления;

КонецФункции

Функция СформироватьСтаруюСтруктуруСценарияАвтозагрузки()
	
	СтруктураАвтозагрузки = Новый Структура;
	
	СтруктураАвтозагрузки.Вставить("ИспользоватьАвтозагрузку");
	СтруктураАвтозагрузки.Вставить("ИспользоватьАвтообновление");
	СтруктураАвтозагрузки.Вставить("КаталогФайлаПрайсЛиста");
	
	СтруктураАвтозагрузки.Вставить("МаскаФайлаПрайсЛиста");
	СтруктураАвтозагрузки.Вставить("ФорматМаскиФайла");
	
	СтруктураАвтозагрузки.Вставить("флФайлВАрхиве");
	СтруктураАвтозагрузки.Вставить("МаскаАрхива");
	СтруктураАвтозагрузки.Вставить("ФорматМаскиАрхива");
	
	СтруктураАвтозагрузки.Вставить("ПеремещатьОбработанныеФайлы");
	СтруктураАвтозагрузки.Вставить("ПрайсИзИнтернета");
	
	СтруктураАвтозагрузки.Вставить("ТранспортПротокол");
	СтруктураАвтозагрузки.Вставить("URL");
	СтруктураАвтозагрузки.Вставить("ТранспортСервер");
	СтруктураАвтозагрузки.Вставить("ТранспортПорт");
	СтруктураАвтозагрузки.Вставить("Таймаут");
	
	СтруктураАвтозагрузки.Вставить("ТребуетсяАвторизация");
	СтруктураАвтозагрузки.Вставить("ТранспортЛогин");
	СтруктураАвтозагрузки.Вставить("ТранспортПароль");
	
	СтруктураАвтозагрузки.Вставить("FtpКаталог");
	СтруктураАвтозагрузки.Вставить("FtpПассивныйРежим");
	
	СтруктураАвтозагрузки.Вставить("SSL");
	СтруктураАвтозагрузки.Вставить("EMailАутентификация");
	
	СтруктураАвтозагрузки.Вставить("ПочтовыйЯщик");
	
	СтруктураАвтозагрузки.Вставить("EmailАдресОтправителя");
	СтруктураАвтозагрузки.Вставить("EmailТемаПисьма");
	СтруктураАвтозагрузки.Вставить("EmailТекстПисьма");
	
	СтруктураАвтозагрузки.Вставить("ПериодичностьПроверкиНовыхДанных");
	СтруктураАвтозагрузки.Вставить("ДатаСледующейПроверки");
	СтруктураАвтозагрузки.Вставить("ИнтервалПроверкиНачало");
	СтруктураАвтозагрузки.Вставить("ИнтервалПроверкиКонец");
	
	СтруктураАвтозагрузки.Вставить("ДатаФайла");
	СтруктураАвтозагрузки.Вставить("ХешФайла");
	
	Возврат СтруктураАвтозагрузки;
	
КонецФункции

Функция ПолучитьСтарыйСценарийАвтозагрузки(ПрайсЛист)
	
	СтруктураАвтозагрузки = СформироватьСтаруюСтруктуруСценарияАвтозагрузки();
	
	Менеджер = РегистрыСведений.ПрайсЛистыКонтрагентовАвтообновление.СоздатьМенеджерЗаписи();
	Менеджер.ПрайсЛист = ПрайсЛист;
	Менеджер.Прочитать();
	
	Если Менеджер.Выбран() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураАвтозагрузки, Менеджер); // ПериодичностьПроверкиНовыхДанных, ДатаСледующейПроверки, ИнтервалПроверкиНачало, ИнтервалПроверкиКонец, ДатаФайла, ХешФайла, ДатаФайлаЗагруженного, ХешФайлаЗагруженного
		НастройкаКаталогов = Менеджер.НастройкаКаталогов.Получить(); // Каталоги и маски файлов
		Если ТипЗнч(НастройкаКаталогов) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураАвтозагрузки, НастройкаКаталогов);
		КонецЕсли;
		НастройкаТранспорта = Менеджер.НастройкаТранспорта.Получить(); // Настройки транспорта
		Если ТипЗнч(НастройкаТранспорта) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(СтруктураАвтозагрузки, НастройкаТранспорта);
		КонецЕсли;
		
		Возврат СтруктураАвтозагрузки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаписатьДанныеРабочегоЛиста(Объект, Автор, ВариантыПоставки)
	
	МенеджерЗаписи = РегистрыСведений.атРабочиеЛисты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Объект;
	МенеджерЗаписи.Автор = Автор;
	МенеджерЗаписи.Прочитать();
	
	Если Не МенеджерЗаписи.Выбран() Тогда
		ТипОбновления = "Создан";
		МенеджерЗаписи.Объект     = Объект;
		МенеджерЗаписи.Автор      = Автор;
		МенеджерЗаписи.ВидОбъекта = "";
		МенеджерЗаписи.Дата       = ТекущаяДата();
		Структура = Новый Структура;
	Иначе
		ТипОбновления = "Обновлен";
		Структура = МенеджерЗаписи.Значение.Получить();
	КонецЕсли;
	
	Если Не Структура.Свойство("ВариантыПоставки") Тогда
		Обновлен = Истина;
		Структура.Вставить("ВариантыПоставки", ВариантыПоставки);
	Иначе
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Номенклатура");
		СтруктураПоиска.Вставить("АртикулДляПоиска");
		СтруктураПоиска.Вставить("Производитель");
		СтруктураПоиска.Вставить("Поставщик");
		СтруктураПоиска.Вставить("КлючСтрокиПоставщика");
		Для Каждого СтрокаВариантПоставки Из ВариантыПоставки Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаВариантПоставки);
			Если Структура.ВариантыПоставки.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				Обновлен = Истина;
				НоваяСтрока = Структура.ВариантыПоставки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВариантПоставки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Успешно = Истина;
	
	Если Обновлен = Истина Тогда
		МенеджерЗаписи.Значение = Новый ХранилищеЗначения(Структура);
		МенеджерЗаписи.ВариантыПоставки = Истина;
		МенеджерЗаписи.Клиент = "";
		Попытка
			МенеджерЗаписи.Записать();
			#Если Клиент Тогда
				Сообщить("   - "+ТипОбновления + " рабочий лист варианты поставки " + Автор + " для " + Объект);
			#КонецЕсли
		Исключение
			Успешно = Ложь;
			#Если Клиент Тогда
				Сообщить("   - Ошибка при " + ТипОбновления + "ии рабочего листа варианты поставки " + Автор + " для " + Объект, СтатусСообщения.ОченьВажное);
			#КонецЕсли
		КонецПопытки;
	Иначе
		//#Если Клиент Тогда
		//	Сообщить("Рабочий лист " + Автор + " для " + Объект + " не требует обновления", СтатусСообщения.Важное);
		//#КонецЕсли
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

//Rarus Alkoko 11.08.2015 {

Процедура СоздатьПравилаСопоставленияНоменклатуры()
	#Если Клиент Тогда
		Состояние(НСтр("ru='Анализ прайс-листов'"));
		Сообщить(НСтр("ru='Создание правил сопоставления номенклатуры'"));
	#КонецЕсли
	//Для всех записей РС ПрайсЛистыКонтрагентов, у которых заполнено измерение "Номенклатура" создадим соответствующее правило
	
	//Получим количество записей редактирования для представления прогресса пользователю
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
	|ГДЕ
	|	ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	ВыборкаКоличество = Результат.Выбрать();
 	ВыборкаКоличество.Следующий();
	КоличествоЗаписей = ВыборкаКоличество.Количество;
		
	//Получим ключевые поля прайс-листов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрайсЛистыКонтрагентовСтруктураФайлаПрайсЛиста.Ссылка КАК ПрайсЛист,
	               |	ПрайсЛистыКонтрагентовСтруктураФайлаПрайсЛиста.ИмяРеквизитаПрайсЛиста
	               |ИЗ
	               |	Справочник.ПрайсЛистыКонтрагентов.СтруктураФайлаПрайсЛиста КАК ПрайсЛистыКонтрагентовСтруктураФайлаПрайсЛиста
	               |ГДЕ
	               |	ПрайсЛистыКонтрагентовСтруктураФайлаПрайсЛиста.Ключевое
	               |ИТОГИ ПО
	               |	ПрайсЛист";
	
	Результат = Запрос.Выполнить();
	ВыборкаПрайсЛистов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//Создадим таблицу правил прайс-листов
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("ПрайсЛист",              Новый ОписаниеТипов("СправочникСсылка.ПрайсЛистыКонтрагентов"));
	ТаблицаПравил.Колонки.Добавить("НазначениеПравила",      Новый ОписаниеТипов("ПеречислениеСсылка.НазначениеПравилЗагрузки"));
	ТаблицаПравил.Колонки.Добавить("ОбъектПравила",          Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	ТаблицаПравил.Колонки.Добавить("ИдентификаторПравила",   Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаПравил.Колонки.Добавить("ВидПравила",             Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПравилЗагрузки"));
	ТаблицаПравил.Колонки.Добавить("ИмяРеквизитаПрайсЛиста", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
	ТаблицаПравил.Колонки.Добавить("Значение",               Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	НазначениеПравила = Перечисления.НазначениеПравилЗагрузки.КлючСтроки;
	ВидПравила        = Перечисления.ВидыПравилЗагрузки.ПрисвоитьЗначение;
	СЧ                = 0;
	ЕстьОшибки        = Ложь;
	Пока ВыборкаПрайсЛистов.Следующий() Цикл
		ТаблицаПравил.Очистить();
		МассивКлючевыхПолей = Новый Массив;
		ВыборкаКлючевыхПолей = ВыборкаПрайсЛистов.Выбрать();
		Пока ВыборкаКлючевыхПолей.Следующий() Цикл
			МассивКлючевыхПолей.Добавить(ВыборкаКлючевыхПолей.ИмяРеквизитаПрайсЛиста);
		КонецЦикла;	 
		Если МассивКлючевыхПолей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		ПрайсЛист = ВыборкаПрайсЛистов.ПрайсЛист;
		//Сгенерируем запрос, в котором получим значения ключевых полей регистра
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПрайсЛистыКонтрагентов.Номенклатура";
		Для Каждого КлючевоеПоле ИЗ МассивКлючевыхПолей Цикл
			Запрос.Текст = Запрос.Текст + "
			|	, ПрайсЛистыКонтрагентов." + КлючевоеПоле;
		КонецЦикла;			   
		Запрос.Текст = Запрос.Текст + "
		               |ИЗ
		               |	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		               |ГДЕ
		               |	ПрайсЛистыКонтрагентов.ПрайсЛист = &ПрайсЛист
		               |	И ПрайсЛистыКонтрагентов.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
					   
		Запрос.УстановитьПараметр("ПрайсЛист", ПрайсЛист);			   
		ВыборкаКлючевыхЗаписей = Запрос.Выполнить().Выбрать();
		//Заполним таблицу правил для текущего прайс-листа
		CчЗаписейВТранзакции = 0;
		ЗаписатьОднимНабором = Истина;
		Пока ВыборкаКлючевыхЗаписей.Следующий() Цикл
			СЧ = СЧ + 1;
			CчЗаписейВТранзакции = CчЗаписейВТранзакции + 1;
			#Если Клиент Тогда
				Состояние(НСтр("ru='Создание правил сопоставления номенклатуры: '") + Строка(Цел(СЧ*100/КоличествоЗаписей))+"%");
			#КонецЕсли
			НоваяСтрока = ТаблицаПравил.Добавить();
			//Сформируем объет правила
			КлючЗаписи = "";
			ПустойКлюч = Истина;
			Для Каждого КлючевоеПоле ИЗ МассивКлючевыхПолей Цикл
				КлючЗаписи = КлючЗаписи + "_" + ВыборкаКлючевыхЗаписей[КлючевоеПоле];
				Если Не ПустаяСтрока(КлючевоеПоле) Тогда
					ПустойКлюч = Ложь;
				КонецЕсли;
			КонецЦикла; 
			Если ПустойКлюч Тогда
				Продолжить;
			КонецЕсли;
			Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
			Хеш.Добавить(КлючЗаписи);
			ХешСумма = Строка(Хеш.ХешСумма);
			ОбъектПравила = НРег(СтрЗаменить(ХешСумма," ",""));
			
			НоваяСтрока.ОбъектПравила        = ОбъектПравила;
			НоваяСтрока.Значение             = ВыборкаКлючевыхЗаписей.Номенклатура;
			НоваяСтрока.ИдентификаторПравила = Новый УникальныйИдентификатор;
			Если CчЗаписейВТранзакции >= 20000 Тогда
				ТаблицаПравил.ЗаполнитьЗначения(ПрайсЛист,         "ПрайсЛист");
				ТаблицаПравил.ЗаполнитьЗначения(НазначениеПравила, "НазначениеПравила");
				ТаблицаПравил.ЗаполнитьЗначения(ВидПравила,        "ВидПравила");
				ТаблицаПравил.ЗаполнитьЗначения("Номенклатура",    "ИмяРеквизитаПрайсЛиста");
				
				ЗаписьУспешна = ЗаписатьПравилаВРегистр(ТаблицаПравил, ЗаписатьОднимНабором);
				Если НЕ ЗаписьУспешна Тогда
					ЕстьОшибки = Истина;
				КонецЕсли;	
				ЗаписатьОднимНабором = Ложь;
				CчЗаписейВТранзакции = 0;
				ТаблицаПравил.Очистить();
			КонецЕсли;	
		КонецЦикла;
		ТаблицаПравил.ЗаполнитьЗначения(ПрайсЛист,         "ПрайсЛист");
		ТаблицаПравил.ЗаполнитьЗначения(НазначениеПравила, "НазначениеПравила");
		ТаблицаПравил.ЗаполнитьЗначения(ВидПравила,        "ВидПравила");
		ТаблицаПравил.ЗаполнитьЗначения("Номенклатура",    "ИмяРеквизитаПрайсЛиста");
	
		ЗаписьУспешна = ЗаписатьПравилаВРегистр(ТаблицаПравил, ЗаписатьОднимНабором);
		Если НЕ ЗаписьУспешна Тогда
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	#Если Клиент Тогда
		Если ЕстьОшибки Тогда
			Сообщить(НСтр("ru='Создание правил сопоставления номенклатуры завершено с ошиками.'"));
		Иначе	
			Сообщить(НСтр("ru='Создание правил сопоставления номенклатуры успешно завершено.'"));
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры //СоздатьПравилаСопоставленияНоменклатуры()

Функция ЗаписатьПравилаВРегистр(ТаблицаПравил, ЗаписатьОднимНабором)
	Результат = Истина;
	Если ТаблицаПравил.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;	
	//Создадим правила
	НачатьТранзакцию();
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаПравил;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПрайсЛист",            "ПрайсЛист");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НазначениеПравила",    "НазначениеПравила");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ОбъектПравила",        "ОбъектПравила");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ИдентификаторПравила", "ИдентификаторПравила");
	
	Блокировка.Заблокировать();
	Если ЗаписатьОднимНабором Тогда
				
		НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрайсЛист.Установить(ТаблицаПравил[0].ПрайсЛист);
		НаборЗаписей.Отбор.НазначениеПравила.Установить(ТаблицаПравил[0].НазначениеПравила);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(ТаблицаПравил);
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			#Если Клиент Тогда
				ТекстСообщения = НСтр("ru='Ошибка создания правил сопоставления номенклатуры: '") + ОписаниеОшибки();
				Сообщить(ТекстСообщения,СтатусСообщения.Важное);
			#КонецЕсли
			Результат = Ложь;
		КонецПопытки;
	Иначе
		Для Каждого СтрокаТЗ ИЗ ТаблицаПравил Цикл
			НаборЗаписей = РегистрыСведений.ПрайсЛистыКонтрагентовПравилаЗагрузки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПрайсЛист.Установить           (СтрокаТЗ.ПрайсЛист);
			НаборЗаписей.Отбор.НазначениеПравила.Установить   (СтрокаТЗ.НазначениеПравила);
			НаборЗаписей.Отбор.ОбъектПравила.Установить       (СтрокаТЗ.ОбъектПравила);
			НаборЗаписей.Отбор.ИдентификаторПравила.Установить(СтрокаТЗ.ИдентификаторПравила);
						
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаТЗ); 
						
			Попытка
				НаборЗаписей.Записать();
			Исключение
				#Если Клиент Тогда
					ТекстСообщения = НСтр("ru='Ошибка создания правил сопоставления номенклатуры: '") + ОписаниеОшибки();
					Сообщить(ТекстСообщения,СтатусСообщения.Важное);
				#КонецЕсли
				Результат = Ложь;
			КонецПопытки;
		КонецЦикла;	
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	Возврат Результат;
КонецФункции //ЗаписатьПравилаВРегистр()

Процедура ОбновитьПрайсЛистыКонтрагентов()
	#Если Клиент Тогда
		Состояние(НСтр("ru='Обновление прайс-листов контрагентов'"));
		Сообщить(НСтр("ru='Обновление прайс-листов контрагентов'"));
	#КонецЕсли
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрайсЛистыКонтрагентов.ПрайсЛист
		|ПОМЕСТИТЬ ЛокальныеПЛ
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		|ГДЕ
		|	НЕ ПрайсЛистыКонтрагентов.ПрайсЛист.ФайлИсточникДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрайсЛистыКонтрагентов.Ссылка КАК ПрайсЛист,
		|	ВЫБОР
		|		КОГДА ЛокальныеПЛ.ПрайсЛист ЕСТЬ NULL 
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Локальный
		|ИЗ
		|	Справочник.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЛокальныеПЛ КАК ЛокальныеПЛ
		|		ПО (ЛокальныеПЛ.ПрайсЛист = ПрайсЛистыКонтрагентов.Ссылка)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПрайсЛистОбъект = Выборка.ПрайсЛист.ПолучитьОбъект();
		ПрайсЛистОбъект.ОбменДанными.Загрузка = Истина;
		ПрайсЛистОбъект.ВидПрайсЛиста = Перечисления.ВидыПрайсЛистов.ПрайсЛистПоставщика;
		Если Выборка.Локальный Тогда
			ПрайсЛистОбъект.ХранитьДанныеЛокально = Истина;
		КонецЕсли;
		Попытка
			ПрайсЛистОбъект.Записать();
		Исключение
			Сообщить("Ошибка обновления элемента справочника ""Прайс-листы контрагентов"" "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	#Если Клиент Тогда
		Сообщить(НСтр("ru='Обновление справочника прайс-листы контрагентов завершено'"));
	#КонецЕсли
	
КонецПроцедуры

//Rarus Alkoko 11.08.2015 }

//Функция получает количество записей регистров, которое необходимо обновить
//
Функция ПолучитьКоличествоЗаписейРегистров()    
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК Количество
		|ПОМЕСТИТЬ ТабКоличеств
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.Артикул = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*)
		|ИЗ
		|	РегистрСведений.Замены КАК Замены
		|ГДЕ
		|	(Замены.Артикул = """"
		|			ИЛИ Замены.АртикулЗамены = """")
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*)
		|ИЗ
		|	РегистрСведений.УпущенныйСпрос КАК УпущенныйСпрос
		|ГДЕ
		|	УпущенныйСпрос.Артикул = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*)
		|ИЗ
		|	РегистрСведений.ПрайсЛистыКонтрагентов КАК ПрайсЛистыКонтрагентов
		|ГДЕ
		|	НЕ ПрайсЛистыКонтрагентов.АртикулДляПоиска = """"
		|	И ПрайсЛистыКонтрагентов.Артикул = """"
		|	И ПрайсЛистыКонтрагентов.ДатаЗаписи = ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ТабКоличеств.Количество) КАК Количество
		|ИЗ
		|	ТабКоличеств КАК ТабКоличеств";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	КоличествоЗаписей = 0;
	Если Выборка.Следующий() Тогда
	    КоличествоЗаписей = Выборка.Количество;
	КонецЕсли;
	
	Возврат КоличествоЗаписей;
	
КонецФункции //ПолучитьКоличествоЗаписейРегистров()

//Поцедура заполняет значение новых реквизитов справочника "Производители" по умолчанию  
Процедура УстановитьРеквизитыПроизводителейПоУмолчанию() Экспорт 
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Производители""'"));
	#КонецЕсли

	Выборка = Справочники.Производители.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПроизводительОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПроизводительОбъект.ОбменДанными.Загрузка = Истина;
		ПроизводительОбъект.АртикулыОбязательны   = Истина;
		Попытка
			ПроизводительОбъект.Записать();
		Исключение
			#Если Клиент Тогда
			Сообщить(НСтр("ru='Ошибка обновления справочника <'")+ПроизводительОбъект+">: "+ОписаниеОшибки());	
			#КонецЕсли
		КонецПопытки;
	КонецЦикла;	
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Производители"" завершено.'"));
	#КонецЕсли

КонецПроцедуры

//Процедура заполняет АртикулДляПоиска у элементов номенклатуры
Процедура ЗаполнитьАртикулДляПоискаНоменклатуры() Экспорт 
	#Если Клиент Тогда
	Состояние(НСтр("ru='Проверка номенклатуры.'"));
	#КонецЕсли
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.Производитель КАК Производитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.АртикулДляПоиска = """"";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой()Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Номенклатура""'"));
	#КонецЕсли
	
	Выборка = Результат.Выбрать();
	РазмерВыборки = Выборка.Количество();
			
	НачатьТранзакцию();
	СчЦикла = 0;
	СчВсего = 0;
	Пока Выборка.Следующий() Цикл
		СчВсего = СчВсего + 1;
		СчЦикла = СчЦикла + 1;
		
		#Если Клиент Тогда
		Если (СчВсего*100)%РазмерВыборки = 0 Тогда
			Состояние(НСтр("ru='Обработка номенклатуры: '") + Строка(Цел(СчВсего*100/РазмерВыборки))+"%");
		КонецЕсли;
		#КонецЕсли
		
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		НоменклатураОбъект.АртикулДляПоиска = Справочники.Номенклатура.ПреобразоватьВАртикулДляПоиска(Выборка.Артикул, Выборка.Производитель);
		Попытка
			НоменклатураОбъект.Записать();
		Исключение
			#Если Клиент Тогда
			Сообщить(НСтр("ru='Ошибка обновления справочника <'")+НоменклатураОбъект+">: "+ОписаниеОшибки());	
			#КонецЕсли
		КонецПопытки;
		Если СчЦикла > 1000 Тогда
			ЗафиксироватьТранзакцию();
			НачатьТранзакцию();
			СчЦикла = 0;
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	#Если Клиент Тогда
	Сообщить(НСтр("ru='Обновление справочника ""Номенклатура"" завершено.'"));
	#КонецЕсли
	
КонецПроцедуры //ЗаполнитьАртикулДляПоискаНоменклатуры()


// +Софтфон

// Обновление подсистемы СФ, переход на Софтфон 3.1 с версии 2.0
//
Процедура сфпОбновитьПодсистемуСофтФон() Экспорт
	//Устаналиваем значение новых констант
	Если Константы.сфпИспользоватьCLON.Получить() ИЛИ Константы.сфпИспользоватьСпрут7.Получить() Тогда
		Константы.сфпИспользоватьЗаписьПереговоров.Установить(Истина);
	КонецЕсли;		
	// Обновляем настройки пользователей
	ДейстиеНетДействий	= Нстр("ru='Нет действий'");
	ДейстиеСобытие		= Нстр("ru='Открыть событие'");
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПраваИНастройки.ПравоНастройка,
	|	ПраваИНастройки.Объект,
	|	ПраваИНастройки.Значение
	|ИЗ
	|	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	|ГДЕ
	|	ПраваИНастройки.ПравоНастройка В(&МассивНастроек)";
	
	МассивНастроек = Новый Массив();
	МассивНастроек.Добавить(ПланыВидовХарактеристик.ПраваИНастройки.сфпОткрыватьДокументПриСнятииТрубки);
	МассивНастроек.Добавить(ПланыВидовХарактеристик.ПраваИНастройки.сфпОткрыватьДокументПриСнятииТрубкиПриИсходящем);
	Запрос.УстановитьПараметр("МассивНастроек", МассивНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПравоНастройка = ПланыВидовХарактеристик.ПраваИНастройки.сфпОткрыватьДокументПриСнятииТрубки Тогда
			Если Выборка.Значение Тогда
				CRMУстановитьЗначениеНастройкиПользователя(Выборка.Объект, "сфпДействиеПриВходящемЗвонке", ДейстиеСобытие); 
			Иначе
				CRMУстановитьЗначениеНастройкиПользователя(Выборка.Объект, "сфпДействиеПриВходящемЗвонке", ДейстиеНетДействий); 
			КонецЕсли;				
		ИначеЕсли Выборка.ПравоНастройка = ПланыВидовХарактеристик.ПраваИНастройки.сфпОткрыватьДокументПриСнятииТрубкиПриИсходящем Тогда			
			Если Выборка.Значение Тогда
				CRMУстановитьЗначениеНастройкиПользователя(Выборка.Объект, "сфпДействиеПриИсходящемЗвонке", ДейстиеСобытие); 
			Иначе
				CRMУстановитьЗначениеНастройкиПользователя(Выборка.Объект, "сфпДействиеПриИсходящемЗвонке", ДейстиеНетДействий); 
			КонецЕсли;				
		КонецЕсли;
	КонецЦикла;		
	
	// Добавляем новые настройки
	ТекПользователь		= Справочники.Пользователи.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПраваИНастройки.Объект
	|ИЗ
	|	РегистрСведений.ПраваИНастройки КАК ПраваИНастройки
	|ГДЕ
	|	ПраваИНастройки.Объект ССЫЛКА Справочник.Пользователи";
	Выборка = Запрос.Выполнить().Выгрузить();
	МассивЭлементов = Выборка.ВыгрузитьКолонку("Объект");
	Для Каждого ЭлементМассива Из МассивЭлементов Цикл
		CRMУстановитьЗначениеНастройкиПользователя(ЭлементМассива, "сфпЗакрыватьПанельПриЗавершенииРаботы", Ложь);
		Если ЗначениеЗаполнено(ЭлементМассива.сфпТекущийВнутреннийНомер) Тогда
			CRMУстановитьЗначениеНастройкиПользователя(ЭлементМассива, "сфпТекущийВнутреннийНомер", ЭлементМассива.сфпТекущийВнутреннийНомер);
		КонецЕсли;			
	КонецЦикла;		

	// Обновляем регистр поиска по номерам телефонов
	сфпСофтФонПроСервер.сфпПерезаполнитьРегистрПоискаПоНомерам();
	ПоследниеЦифрыТелефонногоНомера = Константы.CRM_КоличествоХранимыхЦифрТелефона.Получить();
	Если ПоследниеЦифрыТелефонногоНомера = 0 Тогда Возврат; КонецЕсли;	
	// Создаем новые документы ТелефонныйЗвонок и записи в регистре сведений сфпИсторияЗвонков
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_Событие.Ссылка,
	               |	CRM_Событие.Дата,
	               |	CRM_Событие.Автор,
	               |	CRM_Событие.ТипСообщения КАК ВходящееИсходящее,
	               |	CRM_Событие.КонтактноеЛицо,
	               |	CRM_Событие.НомерТелефона КАК Место,
	               |	CRM_Событие.ДатаОкончания КАК ОкончаниеСобытия,
	               |	CRM_Событие.Содержание КАК Описание,
	               |	CRM_Событие.Контрагент КАК Партнер,
	               |	CRM_Событие.сфпИдентификаторЗвонка,
	               |	CRM_Событие.Менеджер КАК Ответственный,
	               |	CRM_Событие.Приоритет КАК Важность,
	               |	CRM_Событие.Организация,
	               |	CRM_Событие.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.Событие КАК CRM_Событие
	               |ГДЕ
	               |	CRM_Событие.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыСобытий.ТелефонныйЗвонок)
	               |	И CRM_Событие.сфпИдентификаторЗвонка > 0
	               |	И ВЫРАЗИТЬ(CRM_Событие.ДокументОснование КАК Документ.ТелефонныйЗвонок) ЕСТЬ NULL ";
	Выборка = Запрос.Выполнить().Выбрать();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелефонныйЗвонок.Ссылка
	               |ИЗ
	               |	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	               |ГДЕ
	               |	ТелефонныйЗвонок.ВзаимодействиеОснование = &Основание";
	Пока Выборка.Следующий() Цикл
		Запрос.УстановитьПараметр("Основание", Выборка.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			НовыйЗвонок							= Документы.ТелефонныйЗвонок.СоздатьДокумент();
			НовыйЗвонок.Дата					= Выборка.Дата;
			НовыйЗвонок.Организация				= Выборка.Организация;
			НовыйЗвонок.ПодразделениеКомпании	= Выборка.ПодразделениеКомпании;
			НовыйЗвонок.Автор					= Выборка.Автор;
			НовыйЗвонок.Ответственный			= Выборка.Ответственный;
			НовыйЗвонок.Важность				= Выборка.Важность;
			НовыйЗвонок.ВзаимодействиеОснование	= Выборка.Ссылка;
			НовыйЗвонок.Описание				= Выборка.Описание;
			НовыйЗвонок.Тема					= НСтр("ru='#Создан автоматически средствами СофтФон'");
			НовыйЗвонок.сфпИдентификаторЗвонка	= Выборка.сфпИдентификаторЗвонка;
			НовыйЗвонок.Входящий				= (Выборка.ВходящееИсходящее = Перечисления.ТипыСообщений.Входящее);
			НовыйЗвонок.сфпСостояниеЗвонка		= Перечисления.сфпСостоянияЗвонков.Отвеченный;
			НовыйЗвонок.ОбменДанными.Загрузка	= Истина;
			// Получаем записи разговора
			МассивЗаписей = сфпСофтФонПроСерверПереопределяемый.сфпПолучитьСписокЗаписейТелефонногоРазговора(Выборка.сфпИдентификаторЗвонка, Выборка.Дата);
			Если МассивЗаписей.Количество() = 0 Тогда
				// Создаем документ ТелефонныйЗвонок по данным события
				Если Выборка.ОкончаниеСобытия = Дата('00010101') Тогда
					НовыйЗвонок.сфпДлительностьЗвонка	= 0;
				Иначе	
					НовыйЗвонок.сфпДлительностьЗвонка	= Выборка.ОкончаниеСобытия - Выборка.Дата;
				КонецЕсли;	
				Если ЗначениеЗаполнено(Выборка.КонтактноеЛицо) Тогда
					НовыйЗвонок.АбонентКонтакт		= Выборка.КонтактноеЛицо;
				Иначе
					НовыйЗвонок.АбонентКонтакт		= Выборка.Партнер;
				КонецЕсли;
				НовыйЗвонок.АбонентПредставление	= Выборка.Партнер.Наименование;
				Если ЗначениеЗаполнено(Выборка.Место) Тогда
					СтруктураНомера	= сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Выборка.Место);
					НомерТелефона = Прав(СтрЗаменить(СтруктураНомера.КодСтраны, "+", "") + СтруктураНомера.КодГорода + СтруктураНомера.НомерТелефона, ПоследниеЦифрыТелефонногоНомера);
					НовыйЗвонок.АбонентКакСвязаться		= НомерТелефона;
				КонецЕсли;					
			Иначе 
				// Создаем документ ТелефонныйЗвонок по данным регистра
				НовыйЗвонок.Дата					= МассивЗаписей[0].НачалоЗаписи;
				НовыйЗвонок.АбонентКонтакт			= МассивЗаписей[0].Контакт;
				Если ЗначениеЗаполнено(МассивЗаписей[0].Контакт) Тогда
					НовыйЗвонок.АбонентПредставление	= МассивЗаписей[0].Контакт.Наименование;
				Иначе
					НовыйЗвонок.АбонентПредставление	= НСтр("ru='!!!Не определен!!!'");
				КонецЕсли;	
				НовыйЗвонок.АбонентКакСвязаться		= МассивЗаписей[0].НомерТелефона;
				НовыйЗвонок.Ответственный			= МассивЗаписей[0].Пользователь;
				НовыйЗвонок.сфпДлительностьЗвонка	= МассивЗаписей[0].ПродолжительностьЗаписи;
				НовыйЗвонок.сфпИдентификаторЗаписи	= МассивЗаписей[0].ИдентификаторЗаписи;
			КонецЕсли;
			Попытка
				НовыйЗвонок.Записать();
			Исключение
			КонецПопытки;
			// Добавляем запись в регистр ИсторииЗвонков
			НоваяЗапись = РегистрыСведений.сфпИсторияЗвонков.СоздатьМенеджерЗаписи();
			НоваяЗапись.ДатаНачала			= НовыйЗвонок.Дата;
			НоваяЗапись.ДатаОкончания		= НовыйЗвонок.Дата + НовыйЗвонок.сфпДлительностьЗвонка;
			НоваяЗапись.ДатаОтвета			= НовыйЗвонок.Дата;
			НоваяЗапись.Входящий			= НовыйЗвонок.Входящий;
			Если МассивЗаписей.Количество() = 0 Тогда
				НоваяЗапись.ВнутреннийНомер		= сфпСофтФонПроСервер.сфпТекущийВнутреннийНомер(НовыйЗвонок.Ответственный);
			Иначе
				НоваяЗапись.ВнутреннийНомер		= МассивЗаписей[0].НомерВнТелефона;
			КонецЕсли;	
			НоваяЗапись.НомерТелефона		= НовыйЗвонок.АбонентКакСвязаться;
			НоваяЗапись.ИдентификаторЗаписи	= НовыйЗвонок.сфпИдентификаторЗаписи;
			НоваяЗапись.ИдентификаторЗвонка	= НовыйЗвонок.сфпИдентификаторЗвонка;
			НоваяЗапись.Звонок				= НовыйЗвонок.Ссылка;
			НоваяЗапись.АбонентКонтакт		= НовыйЗвонок.АбонентКонтакт;
			НоваяЗапись.Ответственный		= НовыйЗвонок.Ответственный;
			Попытка
				НоваяЗапись.Записать(Истина);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры // сфпОбновитьПодсистемуСофтФон()

// -Софтфон

//Выводит описание изменений для соответствующего номера релиза
//из МакетаОбновлений в ДокументОбновлений
//Зарезервировано на будущее
Процедура ВывестиОписаниеИзменений(НомерРелиза, ДокументОбновлений, МакетОбновлений)
	ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("Шапка" + НомерРелиза));
	ДокументОбновлений.НачатьГруппуСтрок("Релиз" + НомерРелиза);
	ДокументОбновлений.Вывести(МакетОбновлений.ПолучитьОбласть("Релиз" + НомерРелиза));
	ДокументОбновлений.ЗакончитьГруппуСтрок();
КонецПроцедуры

// +Обрезка криптохвостов

Функция ДокументыСКодамиМаркировки()
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Документы.ВводВОборотКодовМаркировки.Имя);
	Результат.Добавить(Метаданные.Документы.ВводОстатковТоваровВПроизводстве.Имя);
	Результат.Добавить(Метаданные.Документы.ВозвратОтПокупателя.Имя);
	Результат.Добавить(Метаданные.Документы.ВозвратВОборотКодовМаркировки.Имя);
	Результат.Добавить(Метаданные.Документы.ВыводИзОборотаКодовМаркировки.Имя);
	Результат.Добавить(Метаданные.Документы.ЗакрытиеСмены.Имя);
	Результат.Добавить(Метаданные.Документы.ИзвлечениеТоваровИзПроизводства.Имя);
	Результат.Добавить(Метаданные.Документы.КорректировкаПоступления.Имя);
	Результат.Добавить(Метаданные.Документы.КорректировкаРеализации.Имя);
	Результат.Добавить(Метаданные.Документы.ОтгрузкаТоваровКодовМаркировки.Имя);
	Результат.Добавить(Метаданные.Документы.Перемаркировка.Имя);
	Результат.Добавить(Метаданные.Документы.ПеремещениеНезавершенногоПроизводства.Имя);
	Результат.Добавить(Метаданные.Документы.ПеремещениеТоваровВПроизводство.Имя);
	Результат.Добавить(Метаданные.Документы.ПоступлениеТоваров.Имя);
	Результат.Добавить(Метаданные.Документы.РеализацияТоваров.Имя);
	Результат.Добавить(Метаданные.Документы.СписаниеКодовМаркировки.Имя);
	Результат.Добавить(Метаданные.Документы.СписаниеТоваров.Имя);
	Результат.Добавить(Метаданные.Документы.Чек.Имя);
	Результат.Добавить(Метаданные.Документы.ЧекНаОплату.Имя);
	
	Возврат Результат;
	
КонецФункции

Процедура ОтрезатьКриптохвосты(ИмяДокумента);
	
	ИмяТабличнойЧасти = ДайИмяТабличнойЧасти(ИмяДокумента);
	ИмяРеквизитов = ДайИмяРеквизитов(ИмяДокумента);
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧасть.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.%1.%2 КАК ТабличнаяЧасть
	|ГДЕ
	|	%3";
	
	ТекстУсловия = Новый Массив;
	Для Каждого ИмяРеквизита Из ИмяРеквизитов Цикл
		ТекстУсловия.Добавить(СтрШаблон("ТабличнаяЧасть.%1 <> """"", ИмяРеквизита));
	КонецЦикла;
	ТекстУсловия = СтрСоединить(ТекстУсловия, Строка(Символы.ПС + "ИЛИ "));
	Запрос.Текст = СтрШаблон(ТекстЗапроса, ИмяДокумента, ИмяТабличнойЧасти, ТекстУсловия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого СтрокаТоваров Из ДокументОбъект[ИмяТабличнойЧасти] Цикл
			Для Каждого ИмяРеквизита Из ИмяРеквизитов Цикл
				ОбъектШК.РазобратьСтрокуШтрихкодаGS1(СтрокаТоваров[ИмяРеквизита], Истина, Истина);
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Отрезает криптохвосты кодов маркировки.
//
Процедура ОтрезатьКриптохвостыСостоянияКодовМаркировки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СостоянияКодовМаркировки.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			ОбъектШК.РазобратьСтрокуШтрихкодаGS1(Запись.КодМаркировки, Истина, Истина);
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Отрезает криптохвосты кодов маркировки.
//
Процедура ОтрезатьКриптохвостыМаркировкаТоваровВПроизводстве()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаркировкаТоваровВПроизводстве.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.МаркировкаТоваровВПроизводстве КАК МаркировкаТоваровВПроизводстве";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОбъектШК = Обработки.ШтрихКоды.Создать();
	
	// Заполним новые реквизиты по заказ-нарядам
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыНакопления.МаркировкаТоваровВПроизводстве.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		
		Для Каждого ТекущаяЗапись Из НаборЗаписей Цикл
			ОбъектШК.РазобратьСтрокуШтрихкодаGS1(ТекущаяЗапись.КодМаркировки, Истина, Истина);
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДайИмяТабличнойЧасти(ИмяДокумента)
	
	Если ИмяДокумента = "ВозвратВОборотКодовМаркировки"
		ИЛИ ИмяДокумента = "Перемаркировка"
		ИЛИ ИмяДокумента = "СписаниеКодовМаркировки" Тогда
		Возврат "Товары"
	КонецЕсли;
	
	Возврат "КодыМаркировки"
	
КонецФункции

Функция ДайИмяРеквизитов(ИмяДокумента)
	
	Результат = Новый Массив;
	Результат.Добавить("КодМаркировки");
	
	Если ИмяДокумента = "Перемаркировка" Тогда
		Результат.Добавить("КодМаркировкиНовый");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// -Обрезка криптохвостов

Функция ДайТекстЗапросаПоНесуществующимСтранам()
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	ГТД.Ссылка КАК Ссылка,
	|	ГТД.Страна КАК Страна,
	|	""Страна"" КАК ИмяРеквизита,
	|	"""" КАК ИмяТаблицы
	|ПОМЕСТИТЬ втСтраны
	|ИЗ
	|	Справочник.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Страна В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Гражданство,
	|	""Гражданство"",
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Гражданство В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.СтранаРегистрации,
	|	""СтранаРегистрации"",
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.СтранаРегистрации В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""""
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Производители.Ссылка,
	|	Производители.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""""
	|ИЗ
	|	Справочник.Производители КАК Производители
	|ГДЕ
	|	Производители.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводВОборотКодовМаркировкиТовары.Ссылка,
	|	ВводВОборотКодовМаркировкиТовары.СтранаПроизводства,
	|	""СтранаПроизводства"",
	|	""Товары""
	|ИЗ
	|	Документ.ВводВОборотКодовМаркировки.Товары КАК ВводВОборотКодовМаркировкиТовары
	|ГДЕ
	|	ВводВОборотКодовМаркировкиТовары.СтранаПроизводства В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремаркировкаТовары.Ссылка,
	|	ПеремаркировкаТовары.СтранаПроизводства,
	|	""СтранаПроизводства"",
	|	""Товары""
	|ИЗ
	|	Документ.Перемаркировка.Товары КАК ПеремаркировкаТовары
	|ГДЕ
	|	ПеремаркировкаТовары.СтранаПроизводства В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортРазделы.Ссылка,
	|	ТаможеннаяДекларацияИмпортРазделы.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Разделы""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортРазделы.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка,
	|	ТаможеннаяДекларацияИмпортТовары.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Товары""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортАвтомобили.Ссылка,
	|	ТаможеннаяДекларацияИмпортАвтомобили.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Автомобили""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Автомобили КАК ТаможеннаяДекларацияИмпортАвтомобили
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортАвтомобили.СтранаПроисхождения В(&Страна)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСтраны.Ссылка КАК Ссылка,
	|	втСтраны.Страна КАК Страна,
	|	втСтраны.ИмяРеквизита КАК ИмяРеквизита,
	|	втСтраны.ИмяТаблицы КАК ИмяТаблицы
	|ИЗ
	|	втСтраны КАК втСтраны
	|ИТОГИ ПО
	|	Страна
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСтраны.Страна КАК Страна
	|ИЗ
	|	втСтраны КАК втСтраны";
	Возврат ТекстЗапроса;
КонецФункции

Функция ДайТекстЗапросаПоДублямСтран()
	ТекстЗапроса=
	"ВЫБРАТЬ
	|	ГТД.Ссылка КАК Ссылка,
	|	ГТД.Страна КАК Страна,
	|	""Страна"" КАК ИмяРеквизита,
	|	"""" КАК ИмяТаблицы
	|ПОМЕСТИТЬ втСтраны
	|ИЗ
	|	Справочник.ГТД КАК ГТД
	|ГДЕ
	|	ГТД.Страна В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.Гражданство,
	|	""Гражданство"",
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Гражданство В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка,
	|	Контрагенты.СтранаРегистрации,
	|	""СтранаРегистрации"",
	|	""""
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.СтранаРегистрации В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""""
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Производители.Ссылка,
	|	Производители.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""""
	|ИЗ
	|	Справочник.Производители КАК Производители
	|ГДЕ
	|	Производители.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВводВОборотКодовМаркировкиТовары.Ссылка,
	|	ВводВОборотКодовМаркировкиТовары.СтранаПроизводства,
	|	""СтранаПроизводства"",
	|	""Товары""
	|ИЗ
	|	Документ.ВводВОборотКодовМаркировки.Товары КАК ВводВОборотКодовМаркировкиТовары
	|ГДЕ
	|	ВводВОборотКодовМаркировкиТовары.СтранаПроизводства В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремаркировкаТовары.Ссылка,
	|	ПеремаркировкаТовары.СтранаПроизводства,
	|	""СтранаПроизводства"",
	|	""Товары""
	|ИЗ
	|	Документ.Перемаркировка.Товары КАК ПеремаркировкаТовары
	|ГДЕ
	|	ПеремаркировкаТовары.СтранаПроизводства В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортРазделы.Ссылка,
	|	ТаможеннаяДекларацияИмпортРазделы.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Разделы""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Разделы КАК ТаможеннаяДекларацияИмпортРазделы
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортРазделы.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортТовары.Ссылка,
	|	ТаможеннаяДекларацияИмпортТовары.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Товары""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Товары КАК ТаможеннаяДекларацияИмпортТовары
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортТовары.СтранаПроисхождения В(&Страна)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаможеннаяДекларацияИмпортАвтомобили.Ссылка,
	|	ТаможеннаяДекларацияИмпортАвтомобили.СтранаПроисхождения,
	|	""СтранаПроисхождения"",
	|	""Автомобили""
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт.Автомобили КАК ТаможеннаяДекларацияИмпортАвтомобили
	|ГДЕ
	|	ТаможеннаяДекларацияИмпортАвтомобили.СтранаПроисхождения В(&Страна)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСтраны.Ссылка КАК Ссылка,
	|	втСтраны.Страна КАК Страна,
	|	втСтраны.ИмяРеквизита КАК ИмяРеквизита,
	|	втСтраны.ИмяТаблицы КАК ИмяТаблицы
	|ИЗ
	|	втСтраны КАК втСтраны
	|ИТОГИ ПО
	|	Ссылка";
	Возврат ТекстЗапроса;
КонецФункции

Процедура ЗаполнитьДанныеОбОперацияхПрослеживаемогоТовара(ИмяДокумента)
	
	ЗапросРегистраторов = Новый Запрос;
	ЗапросРегистраторов.Текст = Документы[ИмяДокумента].ЗапросРегистраторовОперацийПрослеживаемогоТовара();
	
	ДатаНачала = Дата('20210701');
	ДатаОкончания = ТекущаяДатаСеанса();
	
	ЗапросРегистраторов.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросРегистраторов.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Выборка = ЗапросРегистраторов.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ОбъектДокумента = Выборка.Регистратор.ПолучитьОбъект();
			
			ТаблицаПрослеживаемости = ОбъектДокумента.ОперацииСПрослеживаемымиТоварами();
			
			Если ТаблицаПрослеживаемости.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.ОперацииПрослеживаемыхТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Для Каждого ТекущаяЗапись Из ТаблицаПрослеживаемости Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяЗапись);
				НоваяЗапись.Регистратор = Выборка.Регистратор;
				НоваяЗапись.Период = Выборка.Период;
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		Исключение
			ТекстСообщения = "Не удалось создать запись регистра ""ОперацииПрослеживаемыхТоваров"" по регистратору %Регистратор%
			                            |по причине %Причина%";
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ИнформацияОбОшибке());
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Регистратор%", Выборка.Регистратор);
			Сообщить(ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
