Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем НДС18 Экспорт;
Перем НДС118 Экспорт;
Перем Брэнд Экспорт;
Перем СуммаМаржи Экспорт;



Функция МакетВТаблицуЗначений(Макет, _ТЗ=Неопределено, флДобавлятьКолонки=истина) Экспорт
    Перем ТЗ;
    
    Если _ТЗ=Неопределено Тогда
        ТЗ=Новый ТаблицаЗначений();
        флЗаполняем=ложь;
    Иначе
        ТЗ=_ТЗ;
        флЗаполняем=истина;
    КонецЕсли;
    
    //Считываем колонки
    КоличествоКолонок=0;
    ИменаКолонок=Новый Массив();
    Кол=1;
    Пока истина Цикл
        Адрес="R179C"+Формат(Кол,"ЧГ=");
        ИмяКол=Макет.Область(Адрес).Текст;
        Если ПустаяСтрока(ИмяКол) Тогда
            Прервать;
        КонецЕсли;
        КоличествоКолонок=КоличествоКолонок+1;
        Если НЕ флЗаполняем или (флЗаполняем И флДобавлятьКолонки) И ТЗ.Колонки.Найти(ИмяКол)=Неопределено Тогда
            ТЗ.Колонки.Добавить(ИмяКол);
        КонецЕсли;
        ИменаКолонок.Добавить(ИмяКол);
        Кол=Кол+1;
    КонецЦикла;
    
    //Считываем строки
    Стр=180; Кол=1;
    Пока истина Цикл
        Вставлено=ложь; Первая=истина;
        Для Инд=1 По КоличествоКолонок Цикл
            Адрес="R"+Формат(Стр,"ЧГ=")+"C"+Формат(Инд,"ЧГ=");
            Зн=СокрЛП(Макет.Область(Адрес).Текст);
            Если ПустаяСтрока(Зн) Тогда
                Продолжить;
            КонецЕсли;
            Если Первая Тогда
                ТСтр=ТЗ.Добавить();
                Первая=ложь;
                Вставлено=истина;
            КонецЕсли;
            ИмяКолонки=ИменаКолонок[Инд-1];
            Если ТЗ.Колонки.Найти(ИмяКолонки)<>Неопределено Тогда
                Если флЗаполняем Тогда
                    //Проверяем тип - число, строка, булево
                    ОписаниеТипаКолонки=ТЗ.Колонки[ИмяКолонки].ТипЗначения;
                    Если ОписаниеТипаКолонки.СодержитТип(Тип("Число")) Тогда
                        РезЗн=Число(Зн);
                    ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Строка")) Тогда
                        РезЗн=Строка(Зн);
                    ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Булево")) Тогда
                        РезЗн=Булево(Зн);
                    ИначеЕсли ОписаниеТипаКолонки.СодержитТип(Тип("Дата")) Тогда
                        РезЗн=Дата(Зн);
                    Иначе
                        РезЗн=Зн;
                    КонецЕсли;
                Иначе
                    РезЗн=Зн;
                КонецЕсли;
                ТСтр[ИмяКолонки]=РезЗн;
            КонецЕсли;
        КонецЦикла;
        Если Не вставлено Тогда
            Прервать;
        КонецЕсли;
        Стр=Стр+1;
        Кол=1;
    КонецЦикла;
    
    Возврат ТЗ;
    
КонецФункции

Функция ПолучитьВозмещениеМинус(Автомобиль,Организация) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|Сумма(ПодтверждениеВозмещенияПоставщикомВозмещенияВсебестоимости.Сумма-ПодтверждениеВозмещенияПоставщикомВозмещенияВсебестоимости.СуммаНДС) КАК Сумма
	|ИЗ
	|Документ.ПодтверждениеВозмещенияПоставщиком.ВозмещенияВсебестоимости КАК ПодтверждениеВозмещенияПоставщикомВозмещенияВсебестоимости
	|ГДЕ
	|ПодтверждениеВозмещенияПоставщикомВозмещенияВсебестоимости.Автомобиль = &Автомобиль
	|И ПодтверждениеВозмещенияПоставщикомВозмещенияВсебестоимости.Ссылка.Организация = &Организация";

	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();
	Сумма=0;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) Тогда
			Сумма= ВыборкаДетальныеЗаписи.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции	

Функция ПолучитьВозмещение(Автомобиль) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|СУММА(тт_ВозмещенияСрезПоследних.СуммаВозмещения-тт_ВозмещенияСрезПоследних.СуммаНДС) КАК Сумма
	|ИЗ
	|РегистрСведений.тт_Возмещения.СрезПоследних(&Период) КАК тт_ВозмещенияСрезПоследних
	|ГДЕ
	|тт_ВозмещенияСрезПоследних.Автомобиль = &Автомобиль
	|И тт_ВозмещенияСрезПоследних.СтатусВозмещения = &СтатусВозмещения";
	Запрос.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Запрос.УстановитьПараметр("СтатусВозмещения", Справочники.ТТ_СтатусыВозмещений.КоррОтчет);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) Тогда
			Возврат ВыборкаДетальныеЗаписи.Сумма;
		Иначе
			Запрос.УстановитьПараметр("СтатусВозмещения", Справочники.ТТ_СтатусыВозмещений.Отчет);
			РезультатЗапроса1 = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
			Если ВыборкаДетальныеЗаписи1.Следующий() Тогда
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи1.Сумма) Тогда
					Возврат ВыборкаДетальныеЗаписи1.Сумма;
				Иначе
					Возврат 0
				КонецЕсли;	
			Иначе
				Возврат 0;
			КонецЕсли;	
			
		КонецЕсли;	
	Иначе
		Запрос.УстановитьПараметр("СтатусВозмещения", Справочники.ТТ_СтатусыВозмещений.Отчет);
		РезультатЗапроса1 = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
		Если ВыборкаДетальныеЗаписи1.Следующий() Тогда
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи1.Сумма) Тогда
					Возврат ВыборкаДетальныеЗаписи1.Сумма;
				Иначе
					Возврат 0
				КонецЕсли;	
		Иначе
			Возврат 0;
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьПараметрСотрудникПлан(Сотрудник,Параметр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_ПланыЗПМенеджер.План КАК План
		|ИЗ
		|РегистрСведений.ТТ_ПланыЗПМенеджер.СрезПоследних(&Период) КАК ТТ_ПланыЗПМенеджер
		|ГДЕ
		|ТТ_ПланыЗПМенеджер.Сотрудник = &Сотрудник
		|И ТТ_ПланыЗПМенеджер.Параметр = &Параметр
		|И ТТ_ПланыЗПМенеджер.Бренд = &Бренд";
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Количество=ВыборкаДетальныеЗаписи.План;
	Иначе
		Количество=0;
	КонецЕсли;
	Возврат Количество;
КонецФункции	

Функция ПолучитьПараметрСотрудникПроцент(Сотрудник,Параметр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_ПланыЗПМенеджер.Процент КАК Процент
		|ИЗ
		|РегистрСведений.ТТ_ПланыЗПМенеджер.СрезПоследних(&Период) КАК ТТ_ПланыЗПМенеджер
		|ГДЕ
		|ТТ_ПланыЗПМенеджер.Сотрудник = &Сотрудник
		|И ТТ_ПланыЗПМенеджер.Параметр = &Параметр
		|И ТТ_ПланыЗПМенеджер.Бренд = &Бренд";
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Количество=ВыборкаДетальныеЗаписи.Процент;
	Иначе
		Количество=0;
	КонецЕсли;
	Возврат Количество;
КонецФункции	

Функция ПолучитьТрейдИнПлан() Экспорт
////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|Сумма(ТТ_План_TradeInСрезПоследних.План) КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьТрейдИнПланПремия()  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.БазоваяПремия КАК Премия
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Бренд = &Бренд
		|УПОРЯДОЧИТЬ ПО
		|ТТ_План_TradeInСрезПоследних.Период";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Премия=ВыборкаДетальныеЗаписи.Премия;
	КонецЦикла;
	Возврат Премия;
КонецФункции	

Функция ПолучитьТрейдИнФакт() Экспорт
	
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)";
		
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", ВернутьБрэнд());
		Рез=Запрос.Выполнить().Выгрузить();
		Количество=Рез.Количество();
	Возврат Количество;
КонецФункции	

Функция ПолучитьФинПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланФинПродукт КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьДопПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланДоп КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьНовыеПланСуммаСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланНовыеСумма КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция Печать(ТабДокумент) Экспорт
	
	МакетТИ=ПолучитьМакет("Макет");

	ТЗТИ=МакетВТаблицуЗначений(МакетТИ);
	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("СуммаДОП");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаФИН");
	ТТЗ.Колонки.Добавить("ЧастноеЛицо");
	
	Макет = ПолучитьМакет("Макет");
	
	Брэнд = ВернутьБрэнд();
		
		
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
	СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000031"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000035"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000038"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000041"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000047"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000078"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000145"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000146"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000147"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000164"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000170"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000171"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000175"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000176"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000178"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000179"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000181"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000182"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000183"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000219"));
	
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		Если СтрСотрудников.ФактПродажиКоличество=0 Тогда
			Сообщить("У сотрудника "+СтрСотрудников.Сотрудник+ " нет проданных автомобилей, печать невозможна");
			Продолжить;
		КонецЕсли;	
	Сотрудник=СтрСотрудников.Сотрудник;	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаСотр");
	ОбластьМакета.Параметры.Брэнд=Брэнд;
	ОбластьМакета.Параметры.Сотрудник=СтрСотрудников.Сотрудник;

	ТабДокумент.Вывести(ОбластьМакета);	

		
		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр);   // kunova 16.06.2016 
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Если НЕ БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн ТОгда
			Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		Иначе
			Запрос.УстановитьПараметр("СкладыТИ", Справочники.СкладыКомпании.ПустаяСсылка());
		КонецЕСли;
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		
		СВозмещение=0;
		ИтогМаржа=0;
		ВозмещениеИтог=0;
		ВозмещениеУтилИтог=0;
		СкидкаУчрИтог=0;

		Пока выборка.Следующий() Цикл	
			МинусВозмещение=ПолучитьВозмещениеМинус(Выборка.автомобиль,Выборка.ДокументПродажи.Организация);
			СВозмещение=ПолучитьВозмещение(Выборка.автомобиль)-МинусВозмещение;
			
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1;
			ИтогМаржа = ИтогМаржа + Выборка.Маржа;
				
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка1");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.СуммаПоСтроке = выборка.Маржа + СВозмещение;
			
			ВозмещениеИтог=Выборка.Возмещение+ВозмещениеИтог;
			ВозмещениеУтилИтог=Выборка.ВозмещениеУтил+ВозмещениеУтилИтог;
			СкидкаУчрИтог=Выборка.СкидкаУчр+СкидкаУчрИтог;
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			Если Выборка.ДокументПродажи.Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				СтрТТЗ.ЧастноеЛицо=1;	
			КонецЕсли;	
			
		КонецЦикла;
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента /"+ НДС118+"*"+НДС18 +" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер = &Менеджер
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.СуммаДОП=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;

		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ = ИтогПоРаботам+ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108  
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108   
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
				
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		//
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
					Для Каждого СтрСтрах из ВыборкаСсылка.СсылкаСтрах.ВариантыСтрахования Цикл
						НоваяСтрока.НаименованиеФинПродукта = СтрСтрах.ВидСтрахования;
					КонецЦикла;	
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
				
			КонецЕсли;
			СтрТТЗ.СуммаФИН=НоваяСтрока.Сумма;
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		ПроданоЧастникам=ТТЗ.Итог("ЧастноеЛицо");
		ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаФИН,СуммаДОП,ЧастноеЛицо");
		ИтогоАвто =ТТЗ.Итог("Сумма")+ТТЗ.Итог("СуммаДОП")+ТТЗ.Итог("СуммаФИН");
		
			ТТЗ.Колонки.Добавить("СуммаЗП");
			ТТЗ.Колонки.Добавить("МаржаНаЗП");

			Неликвид=0;
			ОбластьМакетаВАЗСтрока1 = Макет.ПолучитьОбласть("ВАЗСтрока1"); 
			ИтогоАвтоКрасные=0;
			МинусДоп=0;
			МинусМаржа=0;
			ВсегоНаЗП=0;
			Для Каждого СтрТТЗ из ТТЗ Цикл
				Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
					Красная=обПолучитьЗначениеСвойства(СтрТТЗ.Автомобиль,"Красный автомобиль");
					Если Красная Тогда
						Неликвид=Неликвид+1;
					КонецЕсли;	

					СуммаПремии= ПолучитьКмодель(СтрТТЗ.Автомобиль.Модель);
					Если СуммаПремии=0 Тогда
						СуммаПремии=ПолучитьКБренд();
					КонецЕсли;	
					
					Премия=((СтрТТЗ.Сумма+СтрТТЗ.СуммаДОП+СтрТТЗ.СуммаФИН)/100)*СтрСотрудников.Процент;
					Если Премия<=СуммаПремии Тогда
						СтрТТЗ.СуммаЗП=СуммаПремии;
						СтрТТЗ.МаржаНаЗП=0;
						МинусМаржа=МинусМаржа+ СтрТТЗ.Сумма+СтрТТЗ.СуммаДОП+СтрТТЗ.СуммаФИН;
						МинусДоп=МинусДоп + СтрТТЗ.СуммаДОП;
						ВсегоНаЗП=ВсегоНаЗП+СуммаПремии;
					Иначе	
						СтрТТЗ.СуммаЗП=0;
						СтрТТЗ.МаржаНаЗП=СтрТТЗ.Сумма+СтрТТЗ.СуммаДОП+СтрТТЗ.СуммаФИН;

					КонецЕсли;
				Иначе	
					СтрТТЗ.МаржаНаЗП=СтрТТЗ.Сумма+СтрТТЗ.СуммаДОП+СтрТТЗ.СуммаФИН;	
				КонецЕсли;
				
			КонецЦикла;
	
		////  TradeIn
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер=&Менеджер";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Рез=Запрос.Выполнить().Выгрузить();
		СтрСотрудников.TradeInФакт=Рез.Количество();
		
		
		//// Добавляем процент с ТИ
		ПараметрЦенаТИ=СуммаЗаТИ;
		ВсегоДоходФактДляКумулятива=ИтогоАвто+(ПараметрЦенаТИ*СтрСотрудников.TradeInФакт);

		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=0;
		ДАНЕТкум="ДА";
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ФактПродажиКоличество;
				//КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ПланПродажиКоличество;
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
					ДАНЕТкум="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		
		ТЗАвтоТИ=ПолучитьСуммуТИМенеджера(СтрСотрудников.Сотрудник);
		
		Для Каждого СтрТЗТИ из ТЗТИ Цикл
			Если СокрЛП(СтрСотрудников.Сотрудник.Наименование)=СокрЛП(СтрТЗТИ.Менеджер) Тогда
				Авто=Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрТЗТИ.VIN);
				ТЗТИ_А = ПолучитьСуммуТИМенеджераПоТЗ(Авто);
				ТЗАвтоТИ=ДополнитьТаблицу(ТЗТИ_А,ТЗАвтоТИ);
			КонецЕсли;	
		КонецЦикла;
		
		ТЗАвтоТИ.Колонки.Добавить("ФинПродукт");
		Для каждого Стр из ТЗАвтоТИ Цикл
			Стр.ФинПродукт=ПолучитьФинАвто(Стр.Автомобиль);
			Стр.Доход=Стр.Доход+Стр.ФинПродукт;
		КонецЦикла;
		
		СуммаЗаТИа=ТЗАвтоТИ.Итог("Доход");
		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=0;	
		ДАНЕТти="ДА";
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				//КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
					ДАНЕТти="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=0;
		ДАНЕТшт="ДА";
		
		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
					ДАНЕТшт="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		// Доп удельный
		ПланДоп=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
		КДоп=0;
		ДАНЕТдоп="ДА";
		Если ПланДоп<>0 Тогда 
			ПроцентДоп=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
			Если ПроцентДоп<>0 Тогда 
				КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ФактПродажиКоличество;
				//КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ПланПродажиКоличество;
				Если КУДоп<ПланДоп Тогда
					КДоп=ПроцентДоп;
					СуммаПроцентов=СуммаПроцентов+КДоп;
					ДАНЕТдоп="НЕТ";
	 			КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Итого кредитов и страховок
		КоличествоКредитов=0;
		КоличествоКАСКО=0;
		КоличествоОСАГО=0;
		
		Для Каждого Стр из ТаблицаРезультат Цикл
			Если Стр.НаименованиеФинПродукта="АВ" Тогда
				КоличествоКредитов=КоличествоКредитов+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="КАСКО" Тогда
				КоличествоКАСКО=КоличествоКАСКО+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="ОСАГО" Тогда
				КоличествоОСАГО=КоличествоОСАГО+1;
				
			КонецЕсли;	
		КонецЦикла;	
		
		ПланКред=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		ККред=0;
		ДАНЕТкред="ДА";
		
		Если ПланКред<>0 Тогда 
			ПроцентКред=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентКред<>0 Тогда 
				//КУКред=Окр(КоличествоКредитов/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КУКред=Окр(КоличествоКредитов/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КУКред<ПланКред Тогда
					ККред=ПроцентКред;	
					СуммаПроцентов=СуммаПроцентов+ККред;
					ДАНЕТкред="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланКАСКО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.КАСКО);
		ККАСКО=0;
		ДАНЕТкаско="ДА";
		Если ПланКАСКО<>0 Тогда 
			ПроцентКАСКО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.КАСКО);
			Если ПроцентКАСКО<>0 Тогда 
				//КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуКАСКО<ПланКАСКО Тогда
					ККАСКО=ПроцентКАСКО;
					СуммаПроцентов=СуммаПроцентов+ККАСКО;
					ДАНЕТкаско="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		ПланОСАГО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
		КОСАГО=0;
		ДАНЕТосаго="ДА";
		Если ПланОСАГО<>0 Тогда 
			ПроцентОСАГО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
			Если ПроцентОСАГО<>0 Тогда 
				//КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуОСАГО<ПланОСАГО Тогда
					КОСАГО=ПроцентОСАГО;
					СуммаПроцентов=СуммаПроцентов+КОСАГО;
					ДАНЕТосаго="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		/// Неликвид надо выбирать отдельно!!!
		
		ПланНеликвид=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Неликвид);
		КНеликвид=0;
		ДАНЕТнел="ДА";
		
		Если ПланНеликвид<>0 Тогда 
			ПроцентНеликвид=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Неликвид);
			Если ПроцентНеликвид<>0 Тогда 
				Если Неликвид<ПланНеликвид Тогда
					КНеликвид=ПроцентНеликвид;	
					СуммаПроцентов=СуммаПроцентов+КНеликвид;
					ДАНЕТнел="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		
		//Расшифровка ЗП
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка5");
		ОбластьМакета.Параметры.ВсегоСТИ=ИтогоАвто+СуммаЗаТИа-МинусМаржа;
		ОбластьМакета.Параметры.Процент=СтрСотрудников.Процент;
		ОбластьМакета.Параметры.ЗПБаза=ОбластьМакета.Параметры.ВсегоСТИ*(СтрСотрудников.Процент/100);
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
		ОбластьМакета.Параметры.ВсегоЗП=ОбластьМакета.Параметры.ЗПБаза+ВсегоНаЗП;
		ОбластьМакета.Параметры.Красные=ВсегоНаЗП;
		ОбластьМакета.Параметры.ИтогоЗП=СтрСотрудников.ИтогоСумма;
		ТабДокумент.Вывести(ОбластьМакета);
		
		//Все авто
		ОбластьМакетаВАЗЗаголовок = Макет.ПолучитьОбласть("ВАЗЗаголовок");
		ОбластьМакетаВАЗЗаголовок.Параметры.Имя="Автомобиль";
		ТабДокумент.Вывести(ОбластьМакетаВАЗЗаголовок);
		ОбластьМакетаВАЗСтрока = Макет.ПолучитьОбласть("ВАЗСтрока"); 
		Для каждого СтрТТЗ из ТТЗ Цикл
			 ОбластьМакетаВАЗСтрока.Параметры.Автомобиль=СтрТТЗ.Автомобиль;
			 ОбластьМакетаВАЗСтрока.Параметры.Сумма=СтрТТЗ.Сумма;
			 ОбластьМакетаВАЗСтрока.Параметры.ДОП=СтрТТЗ.СуммаДОП;
			 ОбластьМакетаВАЗСтрока.Параметры.ФИН=СтрТТЗ.СуммаФИН;
			 ОбластьМакетаВАЗСтрока.Параметры.Всего=СтрТТЗ.Сумма+СтрТТЗ.СуммаДОП+СтрТТЗ.СуммаФИН;
			 ОбластьМакетаВАЗСтрока.Параметры.Премия=СтрТТЗ.СуммаЗП;
			 ОбластьМакетаВАЗСтрока.Параметры.МаржаНаЗП=СтрТТЗ.МаржаНаЗП;
		     ТабДокумент.Вывести(ОбластьМакетаВАЗСтрока);
		КонецЦикла;
		ОбластьМакетаВАЗИтого = Макет.ПолучитьОбласть("ВАЗИтого"); 
		ОбластьМакетаВАЗИтого.Параметры.Итого=ИтогоАвто;
		ОбластьМакетаВАЗИтого.Параметры.ИтогоСумма=ТТЗ.Итог("Сумма");
		ОбластьМакетаВАЗИтого.Параметры.ИтогоДоп=ТТЗ.Итог("СуммаДОП");
		ОбластьМакетаВАЗИтого.Параметры.ИтогоФИН=ТТЗ.Итог("СуммаФИН");
		ОбластьМакетаВАЗИтого.Параметры.ИтогоПремия=ТТЗ.Итог("СуммаЗП");
		ОбластьМакетаВАЗИтого.Параметры.ИтогоМаржаНаЗП=ТТЗ.Итог("МаржаНаЗП");
		ТабДокумент.Вывести(ОбластьМакетаВАЗИтого);
		
		// Печать проданных ТИ авто
		Если ТЗАвтоТИ.Количество()>0 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ТИЗаголовок");
			ТабДокумент.Вывести(ОбластьМакета);
			Для Каждого СтрТИ из ТЗАвтоТИ Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("ТИСтрокаАвто");
				ОбластьМакета.Параметры.Автомобиль		=СтрТИ.Автомобиль;
				ОбластьМакета.Параметры.Док				=СтрТИ.ДокументПродажи;
				ОбластьМакета.Параметры.СуммаПродажи	=СтрТИ.СуммаПродажи;
				ОбластьМакета.Параметры.СуммаПродажиНДС	=СтрТИ.СуммаПродажиНДС;
				ОбластьМакета.Параметры.Себестоимость	=СтрТИ.Себестоимость;
				ОбластьМакета.Параметры.СебестоимостьНДС=СтрТИ.СебестоимостьНДС;
				ОбластьМакета.Параметры.Доход			=СтрТИ.ДоходФакт;
				ОбластьМакета.Параметры.ФинПродукт		=СтрТИ.ФинПродукт;				
				ОбластьМакета.Параметры.ДоходЗП			=СтрТИ.Доход;
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		
			ОбластьМакета = Макет.ПолучитьОбласть("ТИИтого");
			ОбластьМакета.Параметры.ИтогоДоход			=ТЗАвтоТИ.Итог("ДоходФакт");
			ОбластьМакета.Параметры.ИтогоДоходЗП			=ТЗАвтоТИ.Итог("Доход");
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		
		//Красные авто
			ОбластьМакетаВАЗЗаголовок1 = Макет.ПолучитьОбласть("ВАЗЗаголовок1");
			ОбластьМакетаВАЗЗаголовок1.Параметры.Имя="Красные автомобили";
			ТабДокумент.Вывести(ОбластьМакетаВАЗЗаголовок1);
			ОбластьМакетаВАЗСтрока1 = Макет.ПолучитьОбласть("ВАЗСтрока1"); 
			Для Каждого СтрТТЗ из ТТЗ Цикл
				Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
					Красная=обПолучитьЗначениеСвойства(СтрТТЗ.Автомобиль,"Красный автомобиль");
					Если Красная Тогда
						ОбластьМакетаВАЗСтрока1.Параметры.Автомобиль=СтрТТЗ.Автомобиль;
						ТабДокумент.Вывести(ОбластьМакетаВАЗСтрока1);
			        КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			
		// ТИ принятые	
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок4");
		ТабДокумент.Вывести(ОбластьМакета);	

		Для Каждого СтрРез из Рез Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка4");
			ОбластьМакета.Параметры.ДокументПоступления			 = СтрРез.ПоступлениеАвтомобилей;
			ОбластьМакета.Параметры.Заказ	 = СтрРез.Значение;
			ТабДокумент.Вывести(ОбластьМакета);		
		КонецЦикла;
		
		// Процент
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка"); 
		ОбластьМакета.Параметры.ПараметрЦенаТИ=ПараметрЦенаТИ;
		ОбластьМакета.Параметры.ВсегоДоходФактДляКумулятива=ВсегоДоходФактДляКумулятива;
		
		ОбластьМакета.Параметры.ПланУделК=ПланУделК;
		ОбластьМакета.Параметры.ПроцентУделК=ПроцентУделК;
		ОбластьМакета.Параметры.КУделК=КУделК;
		ОбластьМакета.Параметры.КуУделК=КуУделК;
		ОбластьМакета.Параметры.ДАНЕТкум=ДАНЕТкум;
		
		ОбластьМакета.Параметры.ПланТИ=ПланТИ;
		ОбластьМакета.Параметры.ПроцентТИ=ПроцентТИ;
		ОбластьМакета.Параметры.КТИФакт=КТИФакт;
		ОбластьМакета.Параметры.КТИ=КТИ;
		ОбластьМакета.Параметры.ДАНЕТти=ДАНЕТти;
		
		ОбластьМакета.Параметры.ПланНовые=ПланНовые;
		ОбластьМакета.Параметры.ПроцентНовые=ПроцентНовые;
		ОбластьМакета.Параметры.ФактНовые=СтрСотрудников.ФактПродажиКоличество;
		ОбластьМакета.Параметры.КШт=КШт;
		ОбластьМакета.Параметры.ДАНЕТшт=ДАНЕТшт;
		
		ОбластьМакета.Параметры.ПланДоп=ПланДоп;
		ОбластьМакета.Параметры.ПроцентДоп=ПроцентДоп;
		ОбластьМакета.Параметры.КУДоп=КУДоп;
		ОбластьМакета.Параметры.КДоп=КДоп;
		ОбластьМакета.Параметры.ДАНЕТдоп=ДАНЕТдоп;

		ОбластьМакета.Параметры.ПланКред=ПланКред;
		ОбластьМакета.Параметры.ПроцентКред=ПроцентКред;
		ОбластьМакета.Параметры.КУКред=КУКред;
		ОбластьМакета.Параметры.ККред=ККред;
		ОбластьМакета.Параметры.ДАНЕТкред=ДАНЕТкред;

		ОбластьМакета.Параметры.ПланКАСКО=ПланКАСКО;
		ОбластьМакета.Параметры.ПроцентКАСКО=ПроцентКАСКО;
		ОбластьМакета.Параметры.КуКАСКО=КуКАСКО;
		ОбластьМакета.Параметры.ККАСКО=ККАСКО;
		ОбластьМакета.Параметры.ДАНЕТкаско=ДАНЕТкаско;

		ОбластьМакета.Параметры.ПланОСАГО=ПланОСАГО;
		ОбластьМакета.Параметры.ПроцентОСАГО=ПроцентОСАГО;
		ОбластьМакета.Параметры.КуОСАГО=КуОСАГО;
		ОбластьМакета.Параметры.КОСАГО=КОСАГО;
		ОбластьМакета.Параметры.ДАНЕТосаго=ДАНЕТосаго;
		
		ОбластьМакета.Параметры.ПланНеликвид=ПланНеликвид;
		ОбластьМакета.Параметры.ПроцентНеликвид=ПроцентНеликвид;
		ОбластьМакета.Параметры.Неликвид=Неликвид;
		ОбластьМакета.Параметры.КНеликвид=КНеликвид;
		ОбластьМакета.Параметры.ДАНЕТнел=ДАНЕТнел;
		
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТаблицаРезультат.Очистить();
		ТТЗ.Очистить();
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ВернутьБрэнд() Экспорт
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00000010"));
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00003896"));
		Возврат СписокБрендов;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000025");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000006");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00003896");
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.VOLVO Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000146");			
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.FIAT Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00003902"));
		Возврат СписокБрендов;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.FORD Тогда
		СписокБрендов=Новый СписокЗначений;
		СписокБрендов.Добавить(справочники.Модели.НайтиПоКоду("ЦБ00003901"));
		Возврат СписокБрендов;

	Иначе
		СписокБрендов=Новый СписокЗначений;
		Спр=справочники.Модели.Выбрать();
		Пока Спр.Следующий() Цикл
			Если Спр.ЭтоГруппа = Истина Тогда
				СписокБрендов.Добавить(Спр.Ссылка);	
			КонецЕСли;
		КонецЦикла;
		возврат СписокБрендов; 
	КонецЕсли;

КонецФункции

Процедура ОбработкаЗаполненияЗП(ПериодНачало, ПериодКонец) Экспорт
	
	МакетТИ=ПолучитьМакет("Макет");

	ТЗТИ=МакетВТаблицуЗначений(МакетТИ);
	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("СуммаДОП");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаЗП");
	ТТЗ.Колонки.Добавить("ЧастноеЛицо");
	
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02036");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02037");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02038");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000018");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000014");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ000433");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000031"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000035"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000038"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000041"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000047"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000078"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000145"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000146"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000147"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000164"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000170"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000171"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000175"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000176"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000178"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000179"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000181"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000182"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000183"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000219"));
	
	Брэнд = ВернутьБрэнд();
	СуммыВозмещенийВсего=0;
	
	ПланТрейдин=ПолучитьТрейдИнПлан();
	ФактТрейдин=ПолучитьТрейдИнФакт();
	
	Если НЕ ЗначениеЗаполнено(ПланТрейдин) Тогда
		ПланТрейдин=0;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ФактТрейдин) Тогда
		ФактТрейдин=0;
	КонецЕсли;	
	
	ЕстьПланТрейдИн=Ложь;
	Если ФактТрейдин>=ПланТрейдин Тогда
		ЕстьПланТрейдИн=Истина;	
	Иначе
		ЕстьПланТрейдИн=Ложь;	
	КонецЕсли;	
	
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Штуки);
		Если НЕ Значениезаполнено(ПланНовые) Тогда 
			СтрСотрудников.ПланПродажиКоличество=0;
			Сообщить("Для сотрудника "+СтрСотрудников.Сотрудник+" не заполнен план продаж новых автомобилей, расчет отменен. Заполните план и выполните расчет заново.");
			Продолжить;
		Иначе
			СтрСотрудников.ПланПродажиКоличество=ПланНовые;
		КонецЕсли;	
		

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Если НЕ БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн ТОгда
			Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		Иначе
			Запрос.УстановитьПараметр("СкладыТИ", Справочники.СкладыКомпании.ПустаяСсылка());
		КонецЕСли;
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		Пока выборка.Следующий() Цикл	
			МинусВозмещение=ПолучитьВозмещениеМинус(Выборка.автомобиль,Выборка.ДокументПродажи.Организация);
			СВозмещение=ПолучитьВозмещение(Выборка.автомобиль)-МинусВозмещение;
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1; 
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			Если Выборка.ДокументПродажи.Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				СтрТТЗ.ЧастноеЛицо=1;	
			КонецЕсли;	
			
			
		КонецЦикла;
		
		СуммыВозмещенийВсего=СуммыВозмещенийВсего+СВозмещение;
		СтрСотрудников.ФактПродажиКоличество = КоличествоПродано;
		СтрСотрудников.СуммаАМФакт = СуммаПроданных;
		Если СтрСотрудников.ФактПродажиКоличество=0 Тогда
			Сообщить("У сотрудника "+СтрСотрудников.Сотрудник+ " нет проданных автомобилей, расчет невозможен");
			Продолжить;
		КонецЕсли;	
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента / "+НДС118+"*"+НДС18+" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер = &Менеджер
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = ВидРемонтаКомплектация Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.Сумма=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;
			СтрТТЗ.СуммаДОП=СтрТТЗ.Сумма;			
			
		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ= ИтогПоРаботам++ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		СтрСотрудников.ФактПродажиТюнинга =ИТОГ;
		
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108 
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
					Для Каждого СтрСтрах из ВыборкаСсылка.СсылкаСтрах.ВариантыСтрахования Цикл
						НоваяСтрока.НаименованиеФинПродукта = СтрСтрах.ВидСтрахования;
					КонецЦикла;	
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
				
			КонецЕсли;
			СтрТТЗ.Сумма=НоваяСтрока.Сумма;
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		СтрСотрудников.ФактФинПродукт = ТаблицаРезультат.Итог("Сумма");	
		
		СтрСотрудников.ВсегоДоходФакт =СтрСотрудников.СуммаАМФакт + СтрСотрудников.ФактПродажиТюнинга+ СтрСотрудников.ФактФинПродукт;
		
		ПараметрЦенаТИ=СуммаЗаТИ; 
		ВсегоДоходФактДляКумулятива=СтрСотрудников.ВсегоДоходФакт+(ПараметрЦенаТИ*СтрСотрудников.TradeInФакт);

		
		
		///Убираем неликвид
			Неликвид=0;
			УбратьШтНеликвид=1;
			
			ПроданоЧастникам=ТТЗ.Итог("ЧастноеЛицо");

			ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаЗП,СуммаДОП,ЧастноеЛицо");
			Для Каждого СтрТТЗ из ТТЗ Цикл
				Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
					Красная=обПолучитьЗначениеСвойства(СтрТТЗ.Автомобиль,"Красный автомобиль");
					Если Красная Тогда
						Неликвид=Неликвид+1;
					КонецЕсли;	

					СуммаПремии= ПолучитьКмодель(СтрТТЗ.Автомобиль.Модель);
					Если СуммаПремии=0 Тогда
						СуммаПремии=ПолучитьКБренд();
					КонецЕсли;	
					Премия=(СтрТТЗ.Сумма/100)*СтрСотрудников.Процент;
					Если Премия<=СуммаПремии Тогда
						СтрТТЗ.СуммаЗП=СуммаПремии;
						СтрСотрудников.ВсегоДоходФакт=СтрСотрудников.ВсегоДоходФакт - СтрТТЗ.Сумма;
					Иначе	
						СтрТТЗ.СуммаЗП=0;
					КонецЕсли;	                                                                                  
					
				КонецЕсли;	
			КонецЦикла;
		
		//// Добавляем процент с ТИ
		
		ТЗАвтоТИ=ПолучитьСуммуТИМенеджера(СтрСотрудников.Сотрудник);
		Для Каждого СтрТЗТИ из ТЗТИ Цикл
			Если СокрЛП(СтрСотрудников.Сотрудник.Наименование)=СокрЛП(СтрТЗТИ.Менеджер) Тогда
				Авто=Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрТЗТИ.VIN);
				ТЗТИ_А = ПолучитьСуммуТИМенеджераПоТЗ(Авто);
				ТЗАвтоТИ=ДополнитьТаблицу(ТЗТИ_А,ТЗАвтоТИ);
			КонецЕсли;	
		КонецЦикла;
		
		ТЗАвтоТИ.Колонки.Добавить("ФинПродукт");
		Для каждого Стр из ТЗАвтоТИ Цикл
			Стр.ФинПродукт=ПолучитьФинАвто(Стр.Автомобиль);
			Стр.Доход=Стр.Доход+Стр.ФинПродукт;
		КонецЦикла;
		
		СуммаЗаТИа=ТЗАвтоТИ.Итог("Доход");
		
		СтрСотрудников.ВсегоДоходФакт =СтрСотрудников.ВсегоДоходФакт+СуммаЗаТИа;
		
		СтрСотрудников.Процент = ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.Менеджер, ПериодКонец)[0];
		СтрСотрудников.Начислен= СтрСотрудников.ВсегоДоходФакт*СтрСотрудников.Процент/100;
		
		////  TradeIn
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер=&Менеджер";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Рез=Запрос.Выполнить().Выгрузить();
		СтрСотрудников.TradeInФакт=Рез.Количество();
		
		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=1;
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ФактПродажиКоличество;
				//КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ПланПродажиКоличество;
				
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=1;	
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				//КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=1;
		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		// Доп удельный
		ПланДоп=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
		КДоп=1;
		Если ПланДоп<>0 Тогда 
			ПроцентДоп=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
			Если ПроцентДоп<>0 Тогда 
				КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ФактПродажиКоличество;
				//КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ПланПродажиКоличество;
				Если КУДоп<ПланДоп Тогда
					КДоп=ПроцентДоп;
					СуммаПроцентов=СуммаПроцентов+КДоп;
	 			КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	

		
		//Итого кредитов и страховок
		КоличествоКредитов=0;
		КоличествоКАСКО=0;
		КоличествоОСАГО=0;
		
		Для Каждого Стр из ТаблицаРезультат Цикл
			Если Стр.НаименованиеФинПродукта="АВ" Тогда
				КоличествоКредитов=КоличествоКредитов+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="КАСКО" Тогда
				КоличествоКАСКО=КоличествоКАСКО+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="ОСАГО" Тогда
				КоличествоОСАГО=КоличествоОСАГО+1;
				
			КонецЕсли;	
		КонецЦикла;	
		
		ПланКред=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		ККред=1;
		Если ПланКред<>0 Тогда 
			ПроцентКред=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентКред<>0 Тогда 
				//КУКред=Окр(КоличествоКредитов/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КУКред=Окр(КоличествоКредитов/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КУКред<ПланКред Тогда
					ККред=ПроцентКред;	
					СуммаПроцентов=СуммаПроцентов+ККред;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланКАСКО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.КАСКО);
		ККАСКО=1;
		Если ПланКАСКО<>0 Тогда 
			ПроцентКАСКО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.КАСКО);
			Если ПроцентКАСКО<>0 Тогда 
				//КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуКАСКО<ПланКАСКО Тогда
					ККАСКО=ПроцентКАСКО;
					СуммаПроцентов=СуммаПроцентов+ККАСКО;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланОСАГО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
		КОСАГО=1;
		Если ПланОСАГО<>0 Тогда 
			ПроцентОСАГО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
			Если ПроцентОСАГО<>0 Тогда 
				//КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуОСАГО<ПланОСАГО Тогда
					КОСАГО=ПроцентОСАГО;
					СуммаПроцентов=СуммаПроцентов+КОСАГО;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		/// Неликвид надо выбирать отдельно!!!
		
		ПланНеликвид=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Неликвид);
		КНеликвид=1;
		Если ПланНеликвид<>0 Тогда 
			ПроцентНеликвид=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Неликвид);
			Если ПроцентНеликвид<>0 Тогда 
				Если Неликвид<ПланНеликвид Тогда
					КНеликвид=ПроцентНеликвид;	
					СуммаПроцентов=СуммаПроцентов+КНеликвид;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		Начислен=СтрСотрудников.Начислен+ТТЗ.Итог("СуммаЗП");

		Если СуммаПроцентов<>0 Тогда
			Начислен=Начислен*(1-(СуммаПроцентов/100));		
		КонецЕсли;
		
		СтрСотрудников.TradeInСумма= (СуммаЗаТИа*СтрСотрудников.Процент/100)*(1-(СуммаПроцентов/100));
		СтрСотрудников.ИтогоСумма = Начислен + СтрСотрудников.Акция; //+ТТЗ.Итог("СуммаЗП");
		
		ТаблицаРезультат.Очистить();
		ТТЗ.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ОбработкаЗаполненияПланирования(ПериодНачало, ПериодКонец) Экспорт
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		КоммулятивАвто=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
		//<<Павличенко 09.09.2020
		//ПроцентМаржиКоммулятивной=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
		ПроцентМаржиКоммулятивной = ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.Менеджер, ПериодКонец)[0];
		//>>Павличенко 09.09.2020	
		СуммаЗаНовыеАвто = СтрСотрудников.ПланПродажиКоличество*КоммулятивАвто*ПроцентМаржиКоммулятивной/100;
		
		КоэффициентПроникновенияTradeIN=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.TradeIn)/100;
		
		//КоммулятивАвто=ПолучитьПараметрСотрудникПлан(СтрСотрудников.Сотрудник,Перечисления.ТТ_Параметры_ЗП.Маржа);
		ПроцентТрейдИН = СтрСотрудников.Процент/100;
		СуммаЗаТрейдИН = ОКР(СтрСотрудников.ПланПродажиКоличество*КоэффициентПроникновенияTradeIN,0,1)*ПроцентТрейдИН*КоммулятивАвто;
		
		СтрСотрудников.СуммаЗППлан = СуммаЗаНовыеАвто + СуммаЗаТрейдИН; 
	КонецЦикла;
КонецПроцедуры

Процедура РасчитатьРопа() Экспорт
	
	МакетТИ=ПолучитьМакет("Макет");

	ТЗТИ=МакетВТаблицуЗначений(МакетТИ);
	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("СуммаДОП");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаЗП");
	ТТЗ.Колонки.Добавить("ЧастноеЛицо");
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	
	Брэнд = ВернутьБрэнд();
	СуммыВозмещенийВсего=0;
	
	ПланТрейдин=ПолучитьТрейдИнПлан();
	ФактТрейдин=ПолучитьТрейдИнФакт();
	
	Если НЕ ЗначениеЗаполнено(ПланТрейдин) Тогда
		ПланТрейдин=0;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ФактТрейдин) Тогда
		ФактТрейдин=0;
	КонецЕсли;	
	
	ЕстьПланТрейдИн=Ложь;
	Если ФактТрейдин>=ПланТрейдин Тогда
		ЕстьПланТрейдИн=Истина;	
	Иначе
		ЕстьПланТрейдИн=Ложь;	
	КонецЕсли;	
	
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	Для Каждого СтрРОП из РОПТ Цикл
		СтрРОП.Должность=Перечисления.ДолжностиДляЗП.РОП;
	КонецЦикла;
	
	
	Менеджеры=Новый СписокЗначений;
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		Менеджеры.Добавить(СтрСотрудников.Сотрудник);
	КонецЦикла;	
	
	Для Каждого СтрСотрудников Из РОПТ Цикл
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		Если НЕ Значениезаполнено(ПланНовые) Тогда 
			СтрСотрудников.ПланПродажиКоличество=0;
			Сообщить("Для сотрудника "+СтрСотрудников.РОП+" не заполнен план продаж новых автомобилей, расчет отменен. Заполните план и выполните расчет заново.");
			Продолжить;
		Иначе
			СтрСотрудников.ПланПродажиКоличество=ПланНовые;
		КонецЕсли;	

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер В (&Менеджер)
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Если НЕ БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн ТОгда
			Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		Иначе
			Запрос.УстановитьПараметр("СкладыТИ", Справочники.СкладыКомпании.ПустаяСсылка());
		КонецЕСли;
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		Пока выборка.Следующий() Цикл
			МинусВозмещение=ПолучитьВозмещениеМинус(Выборка.автомобиль,Выборка.ДокументПродажи.Организация);
			СВозмещение=ПолучитьВозмещение(Выборка.автомобиль)-МинусВозмещение;
			
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1; 
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			Если Выборка.ДокументПродажи.Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				СтрТТЗ.ЧастноеЛицо=1;	
			КонецЕсли;	
		КонецЦикла;
		
		СуммыВозмещенийВсего=СуммыВозмещенийВсего+СВозмещение;
		СтрСотрудников.ФактПродажиКоличество = КоличествоПродано;
		СтрСотрудников.СуммаАМФакт = СуммаПроданных;
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента / "+НДС118+"*"+НДС18+" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер В (&Менеджер)
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = ВидРемонтаКомплектация Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.Сумма=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;
			СтрТТЗ.СуммаДОП=СтрТТЗ.Сумма;			
			
		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ= ИтогПоРаботам++ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		СтрСотрудников.ФактПродажиТюнинга =ИТОГ;
		
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст ="ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108  
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования В (&Менеджер)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела В (&Менеджер)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
					Для Каждого СтрСтрах из ВыборкаСсылка.СсылкаСтрах.ВариантыСтрахования Цикл
						НоваяСтрока.НаименованиеФинПродукта = СтрСтрах.ВидСтрахования;
					КонецЦикла;	
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
				
			КонецЕсли;
			СтрТТЗ.Сумма=НоваяСтрока.Сумма;
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		СтрСотрудников.ФактФинПродукт = ТаблицаРезультат.Итог("Сумма");	
		
		СтрСотрудников.ДоходФактРОП =СтрСотрудников.СуммаАМФакт + СтрСотрудников.ФактПродажиТюнинга+ СтрСотрудников.ФактФинПродукт;
		ПараметрЦенаТИ=СуммаЗаТИ; 
		ВсегоДоходФактДляКумулятива=СтрСотрудников.ДоходФактРОП+(ПараметрЦенаТИ*РасчетЗарплаты.Итог("TradeInФакт"));

		
		///Убираем неликвид
			Неликвид=0;
			УбратьШтНеликвид=1;
			ПроданоЧастникам=ТТЗ.Итог("ЧастноеЛицо");
			ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаЗП,СуммаДОП,ЧастноеЛицо");
			Для Каждого СтрТТЗ из ТТЗ Цикл
				Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
					Красная=обПолучитьЗначениеСвойства(СтрТТЗ.Автомобиль,"Красный автомобиль");
					Если Красная Тогда
						Неликвид=Неликвид+1;
			        КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		
		//// Добавляем процент с ТИ
		
		ТЗАвтоТИа=Новый ТаблицаЗначений;
		ТЗАвтоТИа.Колонки.Добавить("Автомобиль");
		ТЗАвтоТИа.Колонки.Добавить("ДокументПродажи");
		ТЗАвтоТИа.Колонки.Добавить("Менеджер");
		ТЗАвтоТИа.Колонки.Добавить("СуммаПродажи");
		ТЗАвтоТИа.Колонки.Добавить("СуммаПродажиНДС");
		ТЗАвтоТИа.Колонки.Добавить("Себестоимость");
		ТЗАвтоТИа.Колонки.Добавить("СебестоимостьНДС");
		ТЗАвтоТИа.Колонки.Добавить("Доход");
		ТЗАвтоТИа.Колонки.Добавить("ДоходФакт");
		
		
		Для Каждого СтрС из РасчетЗарплаты Цикл
			ТЗАвтоТИ=ПолучитьСуммуТИМенеджера(СтрС.Сотрудник);
			
			ТЗАвтоТИ.Колонки.Добавить("ФинПродукт");
			Для каждого Стр из ТЗАвтоТИ Цикл
				Стр.ФинПродукт=ПолучитьФинАвто(Стр.Автомобиль);
				Стр.Доход=Стр.Доход+Стр.ФинПродукт;
			КонецЦикла;
			
			Для Каждого СтрТЗТИ из ТЗТИ Цикл
				Если СокрЛП(СтрС.Сотрудник.Наименование)=СокрЛП(СтрТЗТИ.Менеджер) Тогда
					Авто=Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрТЗТИ.VIN);
					ТЗТИ_А = ПолучитьСуммуТИМенеджераПоТЗ(Авто);
					ТЗАвтоТИ=ДополнитьТаблицу(ТЗТИ_А,ТЗАвтоТИ);
				КонецЕсли;	
			КонецЦикла;
			
			ТЗАвтоТИа=ДополнитьТаблицу(ТЗАвтоТИ,ТЗАвтоТИа);
		КонецЦикла;
		
		СуммаЗаТИа=ТЗАвтоТИа.Итог("Доход");
		
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			СуммаЗаТИа=СуммаЗаТИа+ДоходТИКом();
		КонецЕсли;	
		
		
		СтрСотрудников.ДоходФактРОП =СтрСотрудников.ДоходФактРОП+СуммаЗаТИа;
		
		
		СтрСотрудников.ПроцентРОП = ПолучитьПроцент(БрендДляПоказателей, СтрСотрудников.Должность, ПериодКонец)[0];
		СтрСотрудников.НачисленРОП= (СтрСотрудников.ДоходФактРОП+Стрсотрудников.Бонус-Стрсотрудников.ИнвестБонус)*(СтрСотрудников.ПроцентРОП/100);
		
		////  TradeIn
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер В(&Менеджер)";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер",Менеджеры);
		Рез=Запрос.Выполнить().Выгрузить();
		TradeInФакт=Рез.Количество();
		
		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=1;
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ФактПродажиКоличество;
				//КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ПланПродажиКоличество;
				
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=1;	
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				//КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КТИФакт=Окр(TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=1;
		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		
		// Доп удельный
		ПланДоп=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
		КДоп=1;
		Если ПланДоп<>0 Тогда 
			ПроцентДоп=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
			Если ПроцентДоп<>0 Тогда 
				КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ФактПродажиКоличество;
				//КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ПланПродажиКоличество;
				Если КУДоп<ПланДоп Тогда
					КДоп=ПроцентДоп;
					СуммаПроцентов=СуммаПроцентов+КДоп;
	 			КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//Итого кредитов и страховок
		КоличествоКредитов=0;
		КоличествоКАСКО=0;
		КоличествоОСАГО=0;
		
		Для Каждого Стр из ТаблицаРезультат Цикл
			Если Стр.НаименованиеФинПродукта="АВ" Тогда
				КоличествоКредитов=КоличествоКредитов+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="КАСКО" Тогда
				КоличествоКАСКО=КоличествоКАСКО+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="ОСАГО" Тогда
				КоличествоОСАГО=КоличествоОСАГО+1;
				
			КонецЕсли;	
		КонецЦикла;	
		
		ПланКред=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		ККред=1;
		Если ПланКред<>0 Тогда 
			ПроцентКред=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентКред<>0 Тогда 
				//КУКред=Окр(КоличествоКредитов/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КУКред=Окр(КоличествоКредитов/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КУКред<ПланКред Тогда
					ККред=ПроцентКред;	
					СуммаПроцентов=СуммаПроцентов+ККред;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланКАСКО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.КАСКО);
		ККАСКО=1;
		Если ПланКАСКО<>0 Тогда 
			ПроцентКАСКО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.КАСКО);
			Если ПроцентКАСКО<>0 Тогда 
				//КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуКАСКО<ПланКАСКО Тогда
					ККАСКО=ПроцентКАСКО;
					СуммаПроцентов=СуммаПроцентов+ККАСКО;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		ПланОСАГО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
		КОСАГО=1;
		Если ПланОСАГО<>0 Тогда 
			ПроцентОСАГО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
			Если ПроцентОСАГО<>0 Тогда 
				//КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуОСАГО<ПланОСАГО Тогда
					КОСАГО=ПроцентОСАГО;
					СуммаПроцентов=СуммаПроцентов+КОСАГО;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		
		/// Неликвид надо выбирать отдельно!!!
		
		ПланНеликвид=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Неликвид);
		КНеликвид=1;
		Если ПланНеликвид<>0 Тогда 
			ПроцентНеликвид=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Неликвид);
			Если ПроцентНеликвид<>0 Тогда 
				Если Неликвид<ПланНеликвид Тогда
					КНеликвид=ПроцентНеликвид;	
					СуммаПроцентов=СуммаПроцентов+КНеликвид;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		/// QVN
		
		ПланQVN=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.QVN);
		КQVN=1;
		Если ПланQVN<>0 Тогда 
			ПроцентQVN=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.QVN);
			Если ПроцентQVN<>0 Тогда 
				Если СтрСотрудников.ФактQVN<ПланQVN Тогда
					КQVN=ПроцентQVN;	
					СуммаПроцентов=СуммаПроцентов+КQVN;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		
		ОстатокСклад=ОстатокСклада(КонецДня(ПериодКонец),СтрСотрудников.РОП); 
		ОстатокСкладаПроцент=ОстатокСкладаПроцент(КонецДня(ПериодКонец),СтрСотрудников.РОП); 
		
		ФактСклад=Окр(ОстатокСкладаПроцент/ОстатокСклад,2)*100;

		//Склад
		ПланСклад=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
		КСклад=1;
		Если ПланСклад<>0 Тогда 
			ПроцентСклад=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
			Если ПроцентСклад<>0 Тогда 
				Если ФактСклад>ПланСклад Тогда
					КСклад=ПроцентСклад;	
					СуммаПроцентов=СуммаПроцентов+КСклад;
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;	
		
		
		//
		
		НачисленРОП=СтрСотрудников.НачисленРОП;
		

		Если СуммаПроцентов<>0 Тогда
			СтрСотрудников.НачисленРОП=НачисленРОП*(1-(СуммаПроцентов/100));		
		КонецЕсли;
		
		СтрСотрудников.СуммаTradeIn= ((СуммаЗаТИа/100)*СтрСотрудников.ПроцентРОП)*(1-(СуммаПроцентов/100));

		СтрСотрудников.ИтогоРопФОТ = СтрСотрудников.НачисленРОП;// + СтрСотрудников.Бонус + ТТЗ.Итог("СуммаЗП");
		
		
		ТаблицаРезультат.Очистить();
		ТТЗ.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПечатьРОПа(ТабДокумент) Экспорт
	
	МакетТИ=ПолучитьМакет("Макет");

	ТЗТИ=МакетВТаблицуЗначений(МакетТИ);

	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("СуммаДОП");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаФИН");
	ТТЗ.Колонки.Добавить("ЧастноеЛицо");
	
	Макет = ПолучитьМакет("Макет");
	
	Брэнд = ВернутьБрэнд();
		
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
	СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	
	Менеджеры=Новый СписокЗначений;
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		Менеджеры.Добавить(СтрСотрудников.Сотрудник);
	КонецЦикла;	
	
	Для Каждого СтрСотрудников Из РОПТ Цикл
		
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаСотр");
	ОбластьМакета.Параметры.Брэнд=Брэнд;
	ОбластьМакета.Параметры.Сотрудник=СтрСотрудников.РОП;

	ТабДокумент.Вывести(ОбластьМакета);	
		
		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер В (&Менеджер)
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр);   // kunova 16.06.2016 
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Если НЕ БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн ТОгда
			Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		Иначе
			Запрос.УстановитьПараметр("СкладыТИ", Справочники.СкладыКомпании.ПустаяСсылка());
		КонецЕСли;
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		
		СВозмещение=0;
		ИтогМаржа=0;
		ВозмещениеИтог=0;
		ВозмещениеУтилИтог=0;
		СкидкаУчрИтог=0;

		Пока выборка.Следующий() Цикл	
			МинусВозмещение=ПолучитьВозмещениеМинус(Выборка.автомобиль,Выборка.ДокументПродажи.Организация);
			СВозмещение=ПолучитьВозмещение(Выборка.автомобиль)-МинусВозмещение;
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1;
			ИтогМаржа = ИтогМаржа + Выборка.Маржа;
				
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка1");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.СуммаПоСтроке = выборка.Маржа + СВозмещение;
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ или БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
				
				ВозмещениеИтог=Выборка.Возмещение+ВозмещениеИтог;
				ВозмещениеУтилИтог=Выборка.ВозмещениеУтил+ВозмещениеУтилИтог;
				СкидкаУчрИтог=Выборка.СкидкаУчр+СкидкаУчрИтог;
			Иначе
				ОбластьМакета.Параметры.Возмещение = Выборка.Возмещение/НДС18К;
				ОбластьМакета.Параметры.ВозмещениеУтил = Выборка.ВозмещениеУтил/НДС18К;
				ВозмещениеИтог=Выборка.Возмещение/НДС18К+ВозмещениеИтог;
				ВозмещениеУтилИтог=Выборка.ВозмещениеУтил/НДС18К+ВозмещениеУтилИтог;
				СкидкаУчрИтог=Выборка.СкидкаУчр+СкидкаУчрИтог;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			Если Выборка.ДокументПродажи.Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
				СтрТТЗ.ЧастноеЛицо=1;	
			КонецЕсли;	
			
		КонецЦикла;
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента /"+ НДС118+"*"+НДС18 +" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер В (&Менеджер)
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017") Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.СуммаДОП=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;

		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ = ИтогПоРаботам+ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108 
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования В (&Менеджер)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела В (&Менеджер)
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
				
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		//
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
					Для Каждого СтрСтрах из ВыборкаСсылка.СсылкаСтрах.ВариантыСтрахования Цикл
						НоваяСтрока.НаименованиеФинПродукта = СтрСтрах.ВидСтрахования;
					КонецЦикла;	
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
				
			КонецЕсли;
			СтрТТЗ.СуммаФИН=НоваяСтрока.Сумма;
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		ПроданоЧастникам=ТТЗ.Итог("ЧастноеЛицо");
		ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаФИН,СуммаДОП,ЧастноеЛицо");
		ИтогоАвто =ТТЗ.Итог("Сумма")+ТТЗ.Итог("СуммаДОП")+ТТЗ.Итог("СуммаФИН");
		
			ТТЗ.Колонки.Добавить("СуммаЗП");

			Неликвид=0;
			ОбластьМакетаВАЗСтрока1 = Макет.ПолучитьОбласть("ВАЗСтрока1"); 
			ИтогоАвтоКрасные=0;
			МинусДоп=0;
			МинусМаржа=0;
			ВсегоНаЗП=0;
			Для Каждого СтрТТЗ из ТТЗ Цикл
				Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
					Красная=обПолучитьЗначениеСвойства(СтрТТЗ.Автомобиль,"Красный автомобиль");
					Если Красная Тогда
						Неликвид=Неликвид+1;
			        КонецЕсли;

				КонецЕсли;	
			КонецЦикла;
		
		////  TradeIn
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер В (&Менеджер)";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер", Менеджеры);
		Рез=Запрос.Выполнить().Выгрузить();
		TradeInФакт=Рез.Количество();
		
		
		//// Добавляем процент с ТИ
		ПараметрЦенаТИ=СуммаЗаТИ;
		ВсегоДоходФактДляКумулятива=ИтогоАвто+(ПараметрЦенаТИ*TradeInФакт);

		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=0;
		ДАНЕТкум="ДА";
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ФактПродажиКоличество;
//				КуУделК=ВсегоДоходФактДляКумулятива/СтрСотрудников.ПланПродажиКоличество;
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
					ДАНЕТкум="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ТЗАвтоТИа=Новый ТаблицаЗначений;
		ТЗАвтоТИа.Колонки.Добавить("Автомобиль");
		ТЗАвтоТИа.Колонки.Добавить("ДокументПродажи");
		ТЗАвтоТИа.Колонки.Добавить("Менеджер");
		ТЗАвтоТИа.Колонки.Добавить("СуммаПродажи");
		ТЗАвтоТИа.Колонки.Добавить("СуммаПродажиНДС");
		ТЗАвтоТИа.Колонки.Добавить("Себестоимость");
		ТЗАвтоТИа.Колонки.Добавить("СебестоимостьНДС");
		ТЗАвтоТИа.Колонки.Добавить("Доход");
		ТЗАвтоТИа.Колонки.Добавить("ДоходФакт");
		
		
		Для Каждого СтрС из РасчетЗарплаты Цикл
			ТЗАвтоТИ=ПолучитьСуммуТИМенеджера(СтрС.Сотрудник);
			
			ТЗАвтоТИ.Колонки.Добавить("ФинПродукт");
			Для каждого Стр из ТЗАвтоТИ Цикл
				Стр.ФинПродукт=ПолучитьФинАвто(Стр.Автомобиль);
				Стр.Доход=Стр.Доход+Стр.ФинПродукт;
			КонецЦикла;

			Для Каждого СтрТЗТИ из ТЗТИ Цикл
				Если СокрЛП(СтрС.Сотрудник.Наименование)=СокрЛП(СтрТЗТИ.Менеджер) Тогда
					Авто=Справочники.Автомобили.НайтиПоРеквизиту("VIN",СтрТЗТИ.VIN);
					ТЗТИ_А = ПолучитьСуммуТИМенеджераПоТЗ(Авто);
					ТЗАвтоТИ=ДополнитьТаблицу(ТЗТИ_А,ТЗАвтоТИ);
				КонецЕсли;	
			КонецЦикла;
			
			ТЗАвтоТИа=ДополнитьТаблицу(ТЗАвтоТИ,ТЗАвтоТИа);
		КонецЦикла;
		
		СуммаЗаТИа=ТЗАвтоТИа.Итог("Доход");
		
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			СуммаЗаТИа=СуммаЗаТИа+ДоходТИКом();
		КонецЕсли;	
		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=0;	
		ДАНЕТти="ДА";
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				КТИФакт=Окр(TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
					ДАНЕТти="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=0;
		ДАНЕТшт="ДА";
		
		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
					ДАНЕТшт="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		// Доп удельный
		ПланДоп=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
		КДоп=0;
		ДАНЕТдоп="ДА";
		Если ПланДоп<>0 Тогда 
			ПроцентДоп=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.УдельныйДОП);
			Если ПроцентДоп<>0 Тогда 
				КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ФактПродажиКоличество;
				//КУДоп=СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ПланПродажиКоличество;
				Если КУДоп<ПланДоп Тогда
					КДоп=ПроцентДоп;
					СуммаПроцентов=СуммаПроцентов+КДоп;
					ДАНЕТдоп="НЕТ";
	 			КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Итого кредитов и страховок
		КоличествоКредитов=0;
		КоличествоКАСКО=0;
		КоличествоОСАГО=0;
		
		Для Каждого Стр из ТаблицаРезультат Цикл
			Если Стр.НаименованиеФинПродукта="АВ" Тогда
				КоличествоКредитов=КоличествоКредитов+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="КАСКО" Тогда
				КоличествоКАСКО=КоличествоКАСКО+1;
			ИначеЕсли Стр.НаименованиеФинПродукта="ОСАГО" Тогда
				КоличествоОСАГО=КоличествоОСАГО+1;
				
			КонецЕсли;	
		КонецЦикла;	
		
		ПланКред=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		ККред=0;
		ДАНЕТкред="ДА";
		
		Если ПланКред<>0 Тогда 
			ПроцентКред=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентКред<>0 Тогда 
				КУКред=Окр(КоличествоКредитов/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КУКред<ПланКред Тогда
					ККред=ПроцентКред;	
					СуммаПроцентов=СуммаПроцентов+ККред;
					ДАНЕТкред="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланКАСКО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.КАСКО);
		ККАСКО=0;
		ДАНЕТкаско="ДА";
		Если ПланКАСКО<>0 Тогда 
			ПроцентКАСКО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.КАСКО);
			Если ПроцентКАСКО<>0 Тогда 
				КуКАСКО=Окр(КоличествоКАСКО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуКАСКО<ПланКАСКО Тогда
					ККАСКО=ПроцентКАСКО;
					СуммаПроцентов=СуммаПроцентов+ККАСКО;
					ДАНЕТкаско="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		ПланОСАГО=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
		КОСАГО=0;
		ДАНЕТосаго="ДА";
		Если ПланОСАГО<>0 Тогда 
			ПроцентОСАГО=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ОСАГО);
			Если ПроцентОСАГО<>0 Тогда 
				КуОСАГО=Окр(КоличествоОСАГО/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КуОСАГО<ПланОСАГО Тогда
					КОСАГО=ПроцентОСАГО;
					СуммаПроцентов=СуммаПроцентов+КОСАГО;
					ДАНЕТосаго="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		/// Неликвид надо выбирать отдельно!!!
		
		ПланНеликвид=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Неликвид);
		КНеликвид=0;
		ДАНЕТнел="ДА";
		
		Если ПланНеликвид<>0 Тогда 
			ПроцентНеликвид=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Неликвид);
			Если ПроцентНеликвид<>0 Тогда 
				Если Неликвид<ПланНеликвид Тогда
					КНеликвид=ПроцентНеликвид;	
					СуммаПроцентов=СуммаПроцентов+КНеликвид;
					ДАНЕТнел="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		// QVN
		
		ПланQVN=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.QVN);
		КQVN=0;
		ДАНЕТQVN="ДА";
		
		Если ПланQVN<>0 Тогда 
			ПроцентQVN=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.QVN);
			Если ПроцентQVN<>0 Тогда 
				Если СтрСотрудников.ФактQVN<ПланQVN Тогда
					КQVN=ПроцентQVN;	
					СуммаПроцентов=СуммаПроцентов+КQVN;
					ДАНЕТQVN="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		
		//Склад
		ОстатокСклад=ОстатокСклада(КонецДня(ПериодКонец),СтрСотрудников.РОП); 
		ОстатокСкладаПроцент=ОстатокСкладаПроцент(КонецДня(ПериодКонец),СтрСотрудников.РОП); 
		
		ФактСклад=Окр(ОстатокСкладаПроцент/ОстатокСклад,2)*100;

		ПланСклад=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
		КСклад=0;
		ДАНЕТСклад="ДА";
		Если ПланСклад<>0 Тогда 
			ПроцентСклад=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
			Если ПроцентСклад<>0 Тогда 
				Если ФактСклад>ПланСклад Тогда
					КСклад=ПроцентСклад;	
					СуммаПроцентов=СуммаПроцентов+КСклад;
					ДАНЕТСклад="НЕТ";
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;	

		
		//Расшифровка ЗП
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка9");
		ОбластьМакета.Параметры.ВсегоСТИ=ИтогоАвто-МинусМаржа; 
		ОбластьМакета.Параметры.Бонус=СтрСотрудников.Бонус;
		ОбластьМакета.Параметры.ИнвестБонус=СтрСотрудников.ИнвестБонус;
		ОбластьМакета.Параметры.ВсегоТИ=СуммаЗаТИа;
		
		ОбластьМакета.Параметры.Процент=СтрСотрудников.ПроцентРОП;
		ОбластьМакета.Параметры.ЗПБаза=(ОбластьМакета.Параметры.ВсегоСТИ+СтрСотрудников.Бонус-СтрСотрудников.ИнвестБонус+СуммаЗаТИа)*(СтрСотрудников.ПроцентРОП/100);
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
		ОбластьМакета.Параметры.ИтогоЗП=СтрСотрудников.ИтогоРопФОТ;
		ТабДокумент.Вывести(ОбластьМакета);
		
		
		// Процент
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка8"); 
		ОбластьМакета.Параметры.ПараметрЦенаТИ=ПараметрЦенаТИ;
		ОбластьМакета.Параметры.ВсегоДоходФактДляКумулятива=ВсегоДоходФактДляКумулятива;
		
		ОбластьМакета.Параметры.ПланУделК=ПланУделК;
		ОбластьМакета.Параметры.ПроцентУделК=ПроцентУделК;
		ОбластьМакета.Параметры.КУделК=КУделК;
		ОбластьМакета.Параметры.КуУделК=КуУделК;
		ОбластьМакета.Параметры.ДАНЕТкум=ДАНЕТкум;
		
		ОбластьМакета.Параметры.ПланТИ=ПланТИ;
		ОбластьМакета.Параметры.ПроцентТИ=ПроцентТИ;
		ОбластьМакета.Параметры.КТИФакт=КТИФакт;
		ОбластьМакета.Параметры.КТИ=КТИ;
		ОбластьМакета.Параметры.ДАНЕТти=ДАНЕТти;
		
		ОбластьМакета.Параметры.ПланНовые=ПланНовые;
		ОбластьМакета.Параметры.ПроцентНовые=ПроцентНовые;
		ОбластьМакета.Параметры.ФактНовые=СтрСотрудников.ФактПродажиКоличество;
		ОбластьМакета.Параметры.КШт=КШт;
		ОбластьМакета.Параметры.ДАНЕТшт=ДАНЕТшт;
		
		ОбластьМакета.Параметры.ПланДоп=ПланДоп;
		ОбластьМакета.Параметры.ПроцентДоп=ПроцентДоп;
		ОбластьМакета.Параметры.КУДоп=КУДоп;
		ОбластьМакета.Параметры.КДоп=КДоп;
		ОбластьМакета.Параметры.ДАНЕТдоп=ДАНЕТдоп;

		ОбластьМакета.Параметры.ПланКред=ПланКред;
		ОбластьМакета.Параметры.ПроцентКред=ПроцентКред;
		ОбластьМакета.Параметры.КУКред=КУКред;
		ОбластьМакета.Параметры.ККред=ККред;
		ОбластьМакета.Параметры.ДАНЕТкред=ДАНЕТкред;

		ОбластьМакета.Параметры.ПланКАСКО=ПланКАСКО;
		ОбластьМакета.Параметры.ПроцентКАСКО=ПроцентКАСКО;
		ОбластьМакета.Параметры.КуКАСКО=КуКАСКО;
		ОбластьМакета.Параметры.ККАСКО=ККАСКО;
		ОбластьМакета.Параметры.ДАНЕТкаско=ДАНЕТкаско;

		ОбластьМакета.Параметры.ПланОСАГО=ПланОСАГО;
		ОбластьМакета.Параметры.ПроцентОСАГО=ПроцентОСАГО;
		ОбластьМакета.Параметры.КуОСАГО=КуОСАГО;
		ОбластьМакета.Параметры.КОСАГО=КОСАГО;
		ОбластьМакета.Параметры.ДАНЕТосаго=ДАНЕТосаго;
		
		ОбластьМакета.Параметры.ПланНеликвид=ПланНеликвид;
		ОбластьМакета.Параметры.ПроцентНеликвид=ПроцентНеликвид;
		ОбластьМакета.Параметры.Неликвид=Неликвид;
		ОбластьМакета.Параметры.КНеликвид=КНеликвид;
		ОбластьМакета.Параметры.ДАНЕТнел=ДАНЕТнел;
		
		ОбластьМакета.Параметры.ПланQVN=ПланQVN;
		ОбластьМакета.Параметры.ПроцентQVN=ПроцентQVN;
		ОбластьМакета.Параметры.QVN=СтрСотрудников.ФактQVN;
		ОбластьМакета.Параметры.КQVN=КQVN;
		ОбластьМакета.Параметры.ДАНЕТQVN=ДАНЕТQVN;
		
		ОбластьМакета.Параметры.ПланСклад=ПланСклад;
		ОбластьМакета.Параметры.ПроцентСклад=ПроцентСклад;
		ОбластьМакета.Параметры.Склад=ФактСклад;
		ОбластьМакета.Параметры.КСклад=КСклад;
		ОбластьМакета.Параметры.ДАНЕТСклад=ДАНЕТСклад;
		
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТаблицаРезультат.Очистить();
		ТТЗ.Очистить();
		
		
	КонецЦикла;

//	
	Возврат ТабДокумент;
КонецФункции


Функция ПолучитьК(Параметр,Должность,Процент) Экспорт


	Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ТТ_ПараметрыЗПСрезПоследних.Предел КАК Предел,
		|(ВЫБОР КОГДА 
		|ТТ_ПараметрыЗПСрезПоследних.Значение ЕСТЬ NULL
		|ТОГДА 0
		|ИНАЧЕ
		|ТТ_ПараметрыЗПСрезПоследних.Значение
		|КОНЕЦ ) КАК ЗначениеК
		|ИЗ
		|РегистрСведений.ТТ_ПараметрыЗП.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗПСрезПоследних
		|ГДЕ
		|ТТ_ПараметрыЗПСрезПоследних.Бренд = &Бренд
		|И ТТ_ПараметрыЗПСрезПоследних.Должность = &Должность
		|И ТТ_ПараметрыЗПСрезПоследних.Параметр = &Параметр
		|
		|УПОРЯДОЧИТЬ ПО
		|Предел";
	Запрос.УстановитьПараметр("Период",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	
	К=0;
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		Если  Процент<Рез.Предел Тогда
			К=Рез.ЗначениеК;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
			Возврат(К);
	
КонецФункции	

Функция ПолучитьПлан(Параметр,Должность) Экспорт
	Запрос=новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|ТТ_ПланыЗПСрезПоследних.План
	|ИЗ
	|РегистрСведений.ТТ_ПланыЗП.СрезПоследних(&Дата) КАК ТТ_ПланыЗПСрезПоследних
	|ГДЕ
	|ТТ_ПланыЗПСрезПоследних.Бренд = &Бренд
	|И ТТ_ПланыЗПСрезПоследних.Должность = &Должность
	|И ТТ_ПланыЗПСрезПоследних.Параметр = &Параметр";
	Запрос.УстановитьПараметр("Дата",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Возврат(Рез.План);
	КонецЦикла;	
	
	
КонецФункции	


Функция ПолучитьПланПроцент(Параметр,Должность) Экспорт
	Запрос=новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|ТТ_ПланыЗПСрезПоследних.Процент
	|ИЗ
	|РегистрСведений.ТТ_ПланыЗП.СрезПоследних(&Дата) КАК ТТ_ПланыЗПСрезПоследних
	|ГДЕ
	|ТТ_ПланыЗПСрезПоследних.Бренд = &Бренд
	|И ТТ_ПланыЗПСрезПоследних.Должность = &Должность
	|И ТТ_ПланыЗПСрезПоследних.Параметр = &Параметр";
	Запрос.УстановитьПараметр("Дата",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Возврат(Рез.Процент);
	КонецЦикла;	
	
	
КонецФункции	


Функция ДоходТИ() Экспорт
	
	СуммаТИ=0;
	Менеджеры=Новый Массив;
	Для каждого Стр из РасчетЗарплаты Цикл
		Менеджеры.Добавить(Стр.Сотрудник);
	КонецЦикла;	
		
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|     ЕСТЬNULL((СУММА(ПродажиАвтомобилейОбороты.СуммаОборот)-СУММА(ПродажиАвтомобилейОбороты.СуммаНДСОборот))-(СУММА(ПродажиАвтомобилейОбороты.СебестоимостьОборот)-СУММА(ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот)),0 ) КАК Доход
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПродажиАвтомобилейОбороты.Партия = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение.Менеджер В (&Менеджер)";
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Менеджер",Менеджеры);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СуммаТИ=Рез.Доход;
	КонецЕсли;	
	Возврат(СуммаТИ);
КонецФункции	


Функция ДоходТИКом() Экспорт
	
	СуммаТИ=0;
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|ЕСТЬNULL(СУММА(ПродажиАвтомобилейОбороты.СуммаОборот) - СУММА(ПродажиАвтомобилейОбороты.СуммаНДСОборот) - (СУММА(ПродажиАвтомобилейОбороты.СебестоимостьОборот) - СУММА(ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот)), 0) КАК Доход
	|ИЗ
	|РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|ПродажиАвтомобилейОбороты.СкладКомпании = &СкладКомпании";
	
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("СкладКомпании",Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СуммаТИ=Рез.Доход;
	КонецЕсли;	
	Возврат(СуммаТИ);
КонецФункции	


Функция ОстатокСклада(ДатаОстатка,РОП) Экспорт
	
Запрос= Новый Запрос;
Запрос.Текст="
|ВЫБРАТЬ
|	ЗначенияСвойствОбъектов.Значение.Код КАК ЗначениеКод
|ПОМЕСТИТЬ табКодыВнутрКонтрагенты
|ИЗ
|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
|ГДЕ
|	ЗначенияСвойствОбъектов.Свойство.Код = ""02037""
|
|СГРУППИРОВАТЬ ПО
|	ЗначенияСвойствОбъектов.Значение.Код
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(тАвто.НачКоличество) КАК Количество
|ИЗ
|	(ВЫБРАТЬ
|		НачОстАвто.СкладКомпании.Организация КАК Организация,
|		НачОстАвто.Автомобиль КАК Автомобиль,
|		НачОстАвто.СкладКомпании КАК Склад,
|		НачОстАвто.КоличествоОстаток КАК НачКоличество,
|		ЕСТЬNULL(НачОстАвто.СуммаОстаток / 1000, 0) КАК НачСумма,
|		0 КАК РасходКоличество,
|		0 КАК РасходСумма,
|		0 КАК КонКоличество,
|		0 КАК КонСумма,
|		&НачПериод КАК СтатусАвтоПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус КАК СтатусАвто,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период КАК ПервыйСтатусАвтоПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус КАК ПервыйСтатусАвто,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&НачПериод, ДЕНЬ), ДЕНЬ) КАК ДнейНаСкладе,
|		ВЫБОР
|			КОГДА НачОстАвто.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА НачОстАвто.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА НачОстАвто.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ НачОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ КАК Автомобили,
|		""ПокупательКод"" КАК ПокупательКод
|	ИЗ
|		РегистрНакопления.ОстаткиАвтомобилей.Остатки(&НачПериод, ) КАК НачОстАвто
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&НачПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО НачОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО НачОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		ПродажиАвтомобилейОбороты.ДокументПродажи.Организация,
|		ПродажиАвтомобилейОбороты.Автомобиль,
|		ПродажиАвтомобилейОбороты.СкладКомпании,
|		0,
|		0,
|		ПродажиАвтомобилейОбороты.КоличествоОборот,
|		ЕСТЬNULL(ПродажиАвтомобилейОбороты.СебестоимостьОборот / 1000, 0),
|		0,
|		0,
|		ПродажиАвтомобилейОбороты.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ПродажиАвтомобилейОбороты.Период, ДЕНЬ), ДЕНЬ),
|		ВЫБОР
|			КОГДА ПродажиАвтомобилейОбороты.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА ПродажиАвтомобилейОбороты.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ,
|		ПродажиАвтомобилейОбороты.Покупатель.Код
|	ИЗ
|		РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачПериод, &КонПериод, Месяц, ) КАК ПродажиАвтомобилейОбороты
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&КонПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО ПродажиАвтомобилейОбороты.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО ПродажиАвтомобилейОбороты.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль
|	ГДЕ
|		ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		КонОстАвто.СкладКомпании.Организация,
|		КонОстАвто.Автомобиль,
|		КонОстАвто.СкладКомпании,
|		0,
|		0,
|		0,
|		0,
|		КонОстАвто.КоличествоОстаток,
|		ЕСТЬNULL(КонОстАвто.СуммаОстаток / 1000, 0),
|		&КонПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&КонПериод, ДЕНЬ), ДЕНЬ),
|		ВЫБОР
|			КОГДА КонОстАвто.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА КонОстАвто.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА КонОстАвто.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ КонОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ,
|		""ПокупательКод""
|	ИЗ
|		РегистрНакопления.ОстаткиАвтомобилей.Остатки(&КонПериод, ) КАК КонОстАвто
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&КонПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО КонОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО КонОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль) КАК тАвто
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТ_СтатусАвтомобиля.ПериодыСтавки КАК ТТ_СтатусАвтомобиляПериодыСтавки
|		ПО тАвто.СтатусАвто = ТТ_СтатусАвтомобиляПериодыСтавки.Ссылка
|			И тАвто.ДнейНаСкладе >= ТТ_СтатусАвтомобиляПериодыСтавки.Начало
|			И тАвто.ДнейНаСкладе <= ТТ_СтатусАвтомобиляПериодыСтавки.Конец
|ГДЕ
|	ВЫБОР
|			КОГДА &ОтборПоОрганизациям
|				ТОГДА тАвто.Организация В (&Организация)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ОтборПоБрендам
|				ТОГДА тАвто.Автомобили В (&Бренды)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И НЕ тАвто.ПокупательКод В
|				(ВЫБРАТЬ
|					табКодыВнутрКонтрагенты.ЗначениеКод
|				ИЗ
|					табКодыВнутрКонтрагенты)
|	И НЕ тАвто.Склад.Наименование ПОДОБНО ""%тест%""
|	//И НЕ ТТ_СтатусАвтомобиляПериодыСтавки.Процент = &Процент
|";
Запрос.Параметры.Вставить("Бренды", ВернутьБрэнд()); // <Не определено>[]
Запрос.Параметры.Вставить("КонПериод", ДатаОстатка); // <Дата>[01.01.0001 0:00:00]
Запрос.Параметры.Вставить("НачПериод", НачалоМесяца(ДатаОстатка)); // <Дата>[01.01.0001 0:00:00]
Запрос.Параметры.Вставить("Организация", РОП.Организация); // <Организации>[], Справочники.Организации.ПустаяСсылка();
Запрос.Параметры.Вставить("ОтборПоБрендам", Истина); // <Булево>[Нет]
Запрос.Параметры.Вставить("ОтборПоОрганизациям", Истина); // <Булево>[Нет]

	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	Иначе	
		Возврат 0;
	КонецЕсли;	
	

КонецФункции


Функция ОстатокСкладаПроцент(ДатаОстатка,РОП) Экспорт
	
Запрос= Новый Запрос;
Запрос.Текст="
|ВЫБРАТЬ
|	ЗначенияСвойствОбъектов.Значение.Код КАК ЗначениеКод
|ПОМЕСТИТЬ табКодыВнутрКонтрагенты
|ИЗ
|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
|ГДЕ
|	ЗначенияСвойствОбъектов.Свойство.Код = ""02037""
|
|СГРУППИРОВАТЬ ПО
|	ЗначенияСвойствОбъектов.Значение.Код
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	СУММА(тАвто.НачКоличество) КАК Количество
|ИЗ
|	(ВЫБРАТЬ
|		НачОстАвто.СкладКомпании.Организация КАК Организация,
|		НачОстАвто.Автомобиль КАК Автомобиль,
|		НачОстАвто.СкладКомпании КАК Склад,
|		НачОстАвто.КоличествоОстаток КАК НачКоличество,
|		ЕСТЬNULL(НачОстАвто.СуммаОстаток / 1000, 0) КАК НачСумма,
|		0 КАК РасходКоличество,
|		0 КАК РасходСумма,
|		0 КАК КонКоличество,
|		0 КАК КонСумма,
|		&НачПериод КАК СтатусАвтоПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус КАК СтатусАвто,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период КАК ПервыйСтатусАвтоПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус КАК ПервыйСтатусАвто,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&НачПериод, ДЕНЬ), ДЕНЬ) КАК ДнейНаСкладе,
|		ВЫБОР
|			КОГДА НачОстАвто.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА НачОстАвто.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА НачОстАвто.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель
|					КОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА НачОстАвто.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ НачОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ КАК Автомобили,
|		""ПокупательКод"" КАК ПокупательКод
|	ИЗ
|		РегистрНакопления.ОстаткиАвтомобилей.Остатки(&НачПериод, ) КАК НачОстАвто
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&НачПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО НачОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО НачОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		ПродажиАвтомобилейОбороты.ДокументПродажи.Организация,
|		ПродажиАвтомобилейОбороты.Автомобиль,
|		ПродажиАвтомобилейОбороты.СкладКомпании,
|		0,
|		0,
|		ПродажиАвтомобилейОбороты.КоличествоОборот,
|		ЕСТЬNULL(ПродажиАвтомобилейОбороты.СебестоимостьОборот / 1000, 0),
|		0,
|		0,
|		ПродажиАвтомобилейОбороты.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(ПродажиАвтомобилейОбороты.Период, ДЕНЬ), ДЕНЬ),
|		ВЫБОР
|			КОГДА ПродажиАвтомобилейОбороты.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА ПродажиАвтомобилейОбороты.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель
|					КОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ ПродажиАвтомобилейОбороты.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ,
|		ПродажиАвтомобилейОбороты.Покупатель.Код
|	ИЗ
|		РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачПериод, &КонПериод, Месяц, ) КАК ПродажиАвтомобилейОбороты
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&КонПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО ПродажиАвтомобилейОбороты.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО ПродажиАвтомобилейОбороты.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль
|	ГДЕ
|		ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		КонОстАвто.СкладКомпании.Организация,
|		КонОстАвто.Автомобиль,
|		КонОстАвто.СкладКомпании,
|		0,
|		0,
|		0,
|		0,
|		КонОстАвто.КоличествоОстаток,
|		ЕСТЬNULL(КонОстАвто.СуммаОстаток / 1000, 0),
|		&КонПериод,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Статус,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период,
|		ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Статус,
|		РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Период, ДЕНЬ), НАЧАЛОПЕРИОДА(&КонПериод, ДЕНЬ), ДЕНЬ),
|		ВЫБОР
|			КОГДА КонОстАвто.СкладКомпании.тт_КатегорияСклада.КакБренд
|				ТОГДА КонОстАвто.СкладКомпании.тт_КатегорияСклада
|			ИНАЧЕ ВЫБОР
|					КОГДА КонОстАвто.Автомобиль.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель
|					КОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)
|						ТОГДА КонОстАвто.Автомобиль.Модель.Родитель.Родитель
|					ИНАЧЕ КонОстАвто.Автомобиль.Модель.Родитель.Родитель.Родитель
|				КОНЕЦ
|		КОНЕЦ,
|		""ПокупательКод""
|	ИЗ
|		РегистрНакопления.ОстаткиАвтомобилей.Остатки(&КонПериод, ) КАК КонОстАвто
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПоследних(&КонПериод, ) КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних
|			ПО КонОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПоследних.Автомобиль
|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТТ_ТекущиеСтатусыАвтомобилей.СрезПервых КАК ТТ_ТекущиеСтатусыАвтомобилейСрезПервых
|			ПО КонОстАвто.Автомобиль = ТТ_ТекущиеСтатусыАвтомобилейСрезПервых.Автомобиль) КАК тАвто
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТТ_СтатусАвтомобиля.ПериодыСтавки КАК ТТ_СтатусАвтомобиляПериодыСтавки
|		ПО тАвто.СтатусАвто = ТТ_СтатусАвтомобиляПериодыСтавки.Ссылка
|			И тАвто.ДнейНаСкладе >= ТТ_СтатусАвтомобиляПериодыСтавки.Начало
|			И тАвто.ДнейНаСкладе <= ТТ_СтатусАвтомобиляПериодыСтавки.Конец
|ГДЕ
|	ВЫБОР
|			КОГДА &ОтборПоОрганизациям
|				ТОГДА тАвто.Организация В (&Организация)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И ВЫБОР
|			КОГДА &ОтборПоБрендам
|				ТОГДА тАвто.Автомобили В (&Бренды)
|			ИНАЧЕ ИСТИНА
|		КОНЕЦ
|	И НЕ тАвто.ПокупательКод В
|				(ВЫБРАТЬ
|					табКодыВнутрКонтрагенты.ЗначениеКод
|				ИЗ
|					табКодыВнутрКонтрагенты)
|	И НЕ тАвто.Склад.Наименование ПОДОБНО ""%тест%""
|	И НЕ ТТ_СтатусАвтомобиляПериодыСтавки.Процент = &Процент
|";
Запрос.Параметры.Вставить("Бренды", ВернутьБрэнд()); // <Не определено>[]
Запрос.Параметры.Вставить("КонПериод", ДатаОстатка); // <Дата>[01.01.0001 0:00:00]
Запрос.Параметры.Вставить("НачПериод", НачалоМесяца(ДатаОстатка)); // <Дата>[01.01.0001 0:00:00]
Запрос.Параметры.Вставить("Организация", РОП.Организация); // <Организации>[], Справочники.Организации.ПустаяСсылка();
Запрос.Параметры.Вставить("ОтборПоБрендам", Истина); // <Булево>[Нет]
Запрос.Параметры.Вставить("ОтборПоОрганизациям", Истина); // <Булево>[Нет]
Запрос.Параметры.Вставить("Процент", 0); 


	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	Иначе	
		Возврат 0;
	КонецЕсли;	
	

КонецФункции

Функция ПолучитьПроцент(бренд,должность,период) Экспорт
	
	МассивПроцентов=Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентыПоБрендамЗПСрезПоследних.Процент
		|ИЗ
		|	РегистрСведений.ПроцентыПоБрендамЗП.СрезПоследних(&Период, ) КАК ПроцентыПоБрендамЗПСрезПоследних
		|ГДЕ
		|	ПроцентыПоБрендамЗПСрезПоследних.Должность = &Должность
		|	И ПроцентыПоБрендамЗПСрезПоследних.Бренд = &Бренд";
	
	Запрос.УстановитьПараметр("Бренд", Бренд);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПроцентов.Добавить(ВыборкаДетальныеЗаписи.Процент);
		Возврат МассивПроцентов;	
	КонецЦикла;
	
	МассивПроцентов.Добавить(0);
	Возврат МассивПроцентов;
	
Конецфункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//KamikadZe begin add 01.08.2020 12:51:49
	// регистр ТТ_УПР_ЗП Приход
	Движения.ТТ_УПР_ЗП.Записывать = Истина;
	Движения.ТТ_УПР_ЗП.Очистить();
	ДатаДвижения = КонецДня(ПериодКонец);
	Для Каждого ТекСтрокаДанныеЗУП Из РасчетЗарплаты Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.Сотрудник;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Бренд = БрендДляПоказателей;
		Если ПлановыйРасчет тогда
			Движение.ОтветственныйМенеджер = Автор;
			Движение.СуммаЗППлан = ТекСтрокаДанныеЗУП.СуммаЗППлан;
		КонецЕсли;
		//Если Движение.Бренд = Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн Тогда
			Движение.ТинЗП = ТекСтрокаДанныеЗУП.TradeInСумма;
		//Иначе	
			Движение.АвтоЗП = ТекСтрокаДанныеЗУП.ИтогоСумма;
		//КонецЕсли;
		//<<Павличенко 10.09.2020
		Движение.Кумулятив = ТекСтрокаДанныеЗУП.СуммаАМФакт;
		Движение.КолвоАМПлан = ТекСтрокаДанныеЗУП.ПланПродажиКоличество;
		Движение.КолвоАМФакт = ТекСтрокаДанныеЗУП.ФактПродажиКоличество;
		Движение.ФинПродуктФакт = ТекСтрокаДанныеЗУП.ФактФинПродукт;
		Движение.ФактДоп = ТекСтрокаДанныеЗУП.ФактПродажиТюнинга;
		//>>Павличенко 10.09.2020
	КонецЦикла;
	Для Каждого ТекСтрокаДанныеЗУП Из РОПТ Цикл
		Движение = Движения.ТТ_УПР_ЗП.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ДатаДвижения;
		Движение.Сотрудник = ТекСтрокаДанныеЗУП.РОП;
		Движение.Организация = Движение.Сотрудник.Организация;
		Движение.Подразделение = Движение.Сотрудник.Подразделение;
		Движение.Должность = Движение.Сотрудник.Должность;
		Движение.Бренд = БрендДляПоказателей;
		//Если Движение.Бренд = Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн Тогда
			Движение.ТинЗП = ТекСтрокаДанныеЗУП.СуммаTradeIn;
		//Иначе	
			Движение.АвтоЗП = ТекСтрокаДанныеЗУП.ИтогоРопФОТ;
		//КонецЕсли;
	КонецЦикла;
	//KamikadZe end add
КонецПроцедуры


Функция ПолучитьКмодель(Параметр) Экспорт

	Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ТТ_ПараметрыЗПСрезПоследних.Значение  КАК ЗначениеК
		|ИЗ
		|РегистрСведений.ТТ_ПараметрыЗП.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗПСрезПоследних
		|ГДЕ
		|ТТ_ПараметрыЗПСрезПоследних.Параметр = &Параметр";
		
	Запрос.УстановитьПараметр("Период",ПериодКонец);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Рез=Запрос.Выполнить().Выбрать();
	К=0;
	Если Рез.Следующий() Тогда
		К=Рез.ЗначениеК;
	КонецЕсли;	
	Возврат(К);
	
КонецФункции	

Функция ПолучитьКБренд() Экспорт


	Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ТТ_ПараметрыЗПСрезПоследних.Значение  КАК ЗначениеК
		|ИЗ
		|РегистрСведений.ТТ_ПараметрыЗП.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗПСрезПоследних
		|ГДЕ
		|ТТ_ПараметрыЗПСрезПоследних.Бренд В ИЕРАРХИИ (&Бренд)";
		
	Запрос.УстановитьПараметр("Период",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",ВернутьБрэнд());
	Рез=Запрос.Выполнить().Выбрать();
	К=0;
	Если Рез.Следующий() Тогда
		К=Рез.ЗначениеК;
	КонецЕсли;	
	Возврат(К);
	
КонецФункции	

Функция ПолучитьСуммуТИМенеджера(Менеджер) Экспорт
	СпрХоз=Новый СписокЗначений;
	СпрХоз.Добавить(Справочники.ХозОперации.РеализацияАвтомобилей);
	СпрХоз.Добавить(Справочники.ХозОперации.ОтчетКомиссионераЗаАвтомобили);	
	
	Запрос=Новый Запрос;
		Запрос.Текст="
		
		|ВЫБРАТЬ
		|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаПродажи,
		|	ПродажиАвтомобилейОбороты.СуммаНДСОборот КАК СуммаПродажиНДС,
		|	ПродажиАвтомобилейОбороты.СебестоимостьОборот КАК Себестоимость,
		|	ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот КАК СебестоимостьНДС,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ЗначенияСвойствОбъектов.Значение.Менеджер  КАК  Менеджер
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ПродажиАвтомобилейОбороты.Партия = ЗначенияСвойствОбъектов.Объект
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение.Менеджер = &Менеджер
		|   И ЗначенияСвойствОбъектов.Значение.Модель В ИЕРАРХИИ (&Бренд)
		|   И ПродажиАвтомобилейОбороты.ХозОперация  В (&ХозОперация)";

		
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("Менеджер",Менеджер);
		Запрос.УстановитьПараметр("Бренд",ВернутьБрэнд());
		Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("ХозОперация",СпрХоз);
		
		Рез=Запрос.Выполнить().Выбрать();
		
		ТЗАвтоТИ=Новый ТаблицаЗначений;
		ТЗАвтоТИ.Колонки.Добавить("Автомобиль");
		ТЗАвтоТИ.Колонки.Добавить("ДокументПродажи");
		ТЗАвтоТИ.Колонки.Добавить("Менеджер");
		ТЗАвтоТИ.Колонки.Добавить("СуммаПродажи");
		ТЗАвтоТИ.Колонки.Добавить("СуммаПродажиНДС");
		ТЗАвтоТИ.Колонки.Добавить("Себестоимость");
		ТЗАвтоТИ.Колонки.Добавить("СебестоимостьНДС");
		ТЗАвтоТИ.Колонки.Добавить("Доход");
		ТЗАвтоТИ.Колонки.Добавить("ДоходФакт");
		
		Пока Рез.Следующий() Цикл
			Стр=ТЗАвтоТИ.Добавить();
			Стр.Автомобиль=Рез.Автомобиль;
			Стр.ДокументПродажи=Рез.ДокументПродажи;
			Стр.Менеджер=Рез.Менеджер;
			Стр.СуммаПродажи=Рез.СуммаПродажи;
			Стр.СуммаПродажиНДС=Рез.СуммаПродажиНДС;
			Стр.Себестоимость=Рез.Себестоимость;
			Стр.СебестоимостьНДС=Рез.СебестоимостьНДС;
			Стр.ДоходФакт=(Рез.СуммаПродажи-Рез.СуммаПродажиНДС)-(Рез.Себестоимость-Рез.СебестоимостьНДС);
			
		КонецЦикла;	
		
        Процент= ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.Менеджер, ПериодКонец)[0];
		ПСуммаЗаТИ=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Перечисления.ДолжностиДляЗП.ПустаяСсылка(),0);
		МинДоход=(ПСуммаЗаТИ/Процент)*100;
		Для каждого Стр Из ТЗАвтоТИ Цикл
			Если Стр.ДоходФакт<МинДоход Тогда
				Стр.Доход=МинДоход;
			Иначе
				Стр.Доход=Стр.ДоходФакт;
			КонецЕсли;	
		КонецЦикла;	
		
		
		Возврат(ТЗАвтоТИ);
КонецФункции	

Функция ПолучитьСуммуТИМенеджераПоТЗ(Автомобиль) Экспорт
	СпрХоз=Новый СписокЗначений;
	СпрХоз.Добавить(Справочники.ХозОперации.РеализацияАвтомобилей);
	
	Запрос=Новый Запрос;
		Запрос.Текст="
		
		|ВЫБРАТЬ
		|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаПродажи,
		|	ПродажиАвтомобилейОбороты.СуммаНДСОборот КАК СуммаПродажиНДС,
		|	ПродажиАвтомобилейОбороты.СебестоимостьОборот КАК Себестоимость,
		|	ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот КАК СебестоимостьНДС,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.Автомобиль = &Автомобиль
		|   И ПродажиАвтомобилейОбороты.ХозОперация  В (&ХозОперация)";

		
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("Автомобиль",Автомобиль);
		Запрос.УстановитьПараметр("ХозОперация",СпрХоз);
		
		Рез=Запрос.Выполнить().Выбрать();
		
		ТЗАвтоТИ=Новый ТаблицаЗначений;
		ТЗАвтоТИ.Колонки.Добавить("Автомобиль");
		ТЗАвтоТИ.Колонки.Добавить("ДокументПродажи");
		ТЗАвтоТИ.Колонки.Добавить("Менеджер");
		ТЗАвтоТИ.Колонки.Добавить("СуммаПродажи");
		ТЗАвтоТИ.Колонки.Добавить("СуммаПродажиНДС");
		ТЗАвтоТИ.Колонки.Добавить("Себестоимость");
		ТЗАвтоТИ.Колонки.Добавить("СебестоимостьНДС");
		ТЗАвтоТИ.Колонки.Добавить("Доход");
		ТЗАвтоТИ.Колонки.Добавить("ДоходФакт");
		
		Пока Рез.Следующий() Цикл
			Стр=ТЗАвтоТИ.Добавить();
			Стр.Автомобиль=Рез.Автомобиль;
			Стр.ДокументПродажи=Рез.ДокументПродажи;
			Стр.Менеджер=Рез.ДокументПродажи.Менеджер;
			Стр.СуммаПродажи=Рез.СуммаПродажи;
			Стр.СуммаПродажиНДС=Рез.СуммаПродажиНДС;
			Стр.Себестоимость=Рез.Себестоимость;
			Стр.СебестоимостьНДС=Рез.СебестоимостьНДС;
			Стр.ДоходФакт=(Рез.СуммаПродажи-Рез.СуммаПродажиНДС)-(Рез.Себестоимость-Рез.СебестоимостьНДС);
			
		КонецЦикла;	
		
        Процент= ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.Менеджер, ПериодКонец)[0];
		ПСуммаЗаТИ=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Перечисления.ДолжностиДляЗП.ПустаяСсылка(),0);
		МинДоход=(ПСуммаЗаТИ/Процент)*100;
		Для каждого Стр Из ТЗАвтоТИ Цикл
			Если Стр.ДоходФакт<МинДоход Тогда
				Стр.Доход=МинДоход;
			Иначе
				Стр.Доход=Стр.ДоходФакт;
			КонецЕсли;	
		КонецЦикла;	
		
		
		Возврат(ТЗАвтоТИ);
КонецФункции	

Функция ДополнитьТаблицу(ТаблицаИсточник, ТаблицаПриемник) 
    
    Для каждого СтрокаТаблицыИсточник Из ТаблицаИсточник Цикл
        
        ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицыИсточник);
        
    КонецЦикла;
	
	Возврат(ТаблицаПриемник)
КонецФункции

Функция ПолучитьФинАвто(Автомобиль) Экспорт
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02036");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02037");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02038");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108 
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Автомобиль = &Автомобиль
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль = &Автомобиль

		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|";
		
		

		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Свернуть("МодельГруппа, НаименованиеФинПродукта, МесяцПродажи", "Сумма");
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		Возврат(ТаблицаРезультат.Итог("Сумма"));	
		
	
КонецФункции	

Процедура РасчитатьРОПаТИ() Экспорт
	
	МакетТИ=ПолучитьМакет("Макет");

	ТЗТИ=МакетВТаблицуЗначений(МакетТИ);

	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("СуммаДОП");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаЗП");
	ТТЗ.Колонки.Добавить("ЧастноеЛицо");
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СуммыВозмещенийВсего=0;
	
	ПланТрейдин=ПолучитьТрейдИнПлан();
	ФактТрейдин=ПолучитьТрейдИнФакт();
	
	Если НЕ ЗначениеЗаполнено(ПланТрейдин) Тогда
		ПланТрейдин=0;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ФактТрейдин) Тогда
		ФактТрейдин=0;
	КонецЕсли;	
	
	ЕстьПланТрейдИн=Ложь;
	Если ФактТрейдин>=ПланТрейдин Тогда
		ЕстьПланТрейдИн=Истина;	
	Иначе
		ЕстьПланТрейдИн=Ложь;	
	КонецЕсли;	
	
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	Для Каждого СтрРОП из РОПТ Цикл
		СтрРОП.Должность=Перечисления.ДолжностиДляЗП.РОП;
	КонецЦикла;
	
	
	Организации=Новый СписокЗначений;
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000001"));
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000003"));
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));

	
	
	Для Каждого СтрСотрудников Из РОПТ Цикл
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		Если НЕ Значениезаполнено(ПланНовые) Тогда 
			СтрСотрудников.ПланПродажиКоличество=0;
			Сообщить("Для сотрудника "+СтрСотрудников.РОП+" не заполнен план продаж новых автомобилей, расчет отменен. Заполните план и выполните расчет заново.");
			Продолжить;
		Иначе
			СтрСотрудников.ПланПродажиКоличество=ПланНовые;
		КонецЕсли;	

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, СкладКомпании В (&СкладКомпании) ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|   ПродажиАвтомобилейОбороты.ДокументПродажи.Организация В (&Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладКомпании", СкладыТИ);
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		Пока выборка.Следующий() Цикл
			СуммаПроданных = СуммаПроданных + выборка.Маржа;		 
			КоличествоПродано =  КоличествоПродано + 1; 
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.РОП;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа;
			
		КонецЦикла;
		
		СтрСотрудников.ФактПродажиКоличество = КоличествоПродано;
		СтрСотрудников.СуммаАМФакт = СуммаПроданных;
		
		
		СтрСотрудников.ДоходФактРОП =СтрСотрудников.СуммаАМФакт;		
			
		ТТЗ.Колонки.Добавить("ФинПродукт");
		АвтомобильТИ=ТТЗ.ВыгрузитьКолонку("Автомобиль");
		СтрСотрудников.ФактФинПродукт=ПолучитьФинАвтоТИ(АвтомобильТИ);
	
		ТТЗ.Сортировать("Автомобиль");
		СтрСотрудников.ДоходФактРОП =СтрСотрудников.ДоходФактРОП+СтрСотрудников.ФактФинПродукт;
		
		
		СтрСотрудников.ПроцентРОП = ПолучитьПроцент(Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн, СтрСотрудников.Должность, ПериодКонец)[0];
		СтрСотрудников.НачисленРОП= (СтрСотрудников.ДоходФактРОП+Стрсотрудников.Бонус-Стрсотрудников.ИнвестБонус)*(СтрСотрудников.ПроцентРОП/100);
		
		
		////  TradeIn
		
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Рез=Запрос.Выполнить().Выгрузить();
		TradeInФакт=Рез.Количество();

		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=1;
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=СтрСотрудников.ДоходФактРОП/СтрСотрудников.ФактПродажиКоличество;
				//КуУделК=СтрСотрудников.ДоходФактРОП/СтрСотрудников.ПланПродажиКоличество;
				
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=1;	
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				//КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КТИФакт=Окр(TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=1;
		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		
		//Шт посчитали
		ПланФП=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		КФП=1;
		Если ПланФП<>0 Тогда 
			ПроцентФП=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентФП<>0 Тогда 
				Если СтрСотрудников.ФактФинПродукт<ПланФП Тогда
					КФП=ПроцентФП;	
					СуммаПроцентов=СуммаПроцентов+КФП;
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
		//
		ПланДнейСклада=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ДнейСклада);

		ОстатокСклад=ОстатокСкладаТИ(Организации,СкладыТИ,ПланДнейСклада); 

		//Склад
		ПланСклад=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
		КСклад=1;
		Если ПланСклад<>0 Тогда 
			ПроцентСклад=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
			Если ПроцентСклад<>0 Тогда 
				Если ПланСклад>ОстатокСклад Тогда
					КСклад=ПроцентСклад;	
					СуммаПроцентов=СуммаПроцентов+КСклад;
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;	
		//
		НачисленРОП=СтрСотрудников.НачисленРОП;

		Если СуммаПроцентов<>0 Тогда
			СтрСотрудников.НачисленРОП=НачисленРОП*(1-(СуммаПроцентов/100));		
		КонецЕсли;

		СтрСотрудников.ИтогоРопФОТ = СтрСотрудников.НачисленРОП;// + СтрСотрудников.Бонус + ТТЗ.Итог("СуммаЗП");
		
		ТТЗ.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПечатьРОПаТИ(ТабДокумент) Экспорт

	Организации=Новый СписокЗначений;
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000001"));
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000003"));
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));
//	
	Макет = ПолучитьМакет("Макет");

	Для Каждого СтрСотрудников ИЗ РОПТ Цикл
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Рез=Запрос.Выполнить().Выгрузить();
		TradeInФакт=Рез.Количество();
		
		ДоходФактРОП =СтрСотрудников.ДоходФактРОП+СтрСотрудников.ФактФинПродукт; 
		
		
//		
//		//// Добавляем процент с ТИ
//		ПараметрЦенаТИ=СуммаЗаТИ;
//		ВсегоДоходФактДляКумулятива=ИтогоАвто+(ПараметрЦенаТИ*TradeInФакт);

//		
		//Кумул. удел. маржа с ТИ, руб без НДС
        //
		СуммаПроцентов=0;
		
		ПланУделК=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
		КУделК=1;
		ДАНЕТкум="ДА";
		Если ПланУделК<>0 Тогда 
			ПроцентУделК=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Маржа);
			Если ПроцентУделК<>0 Тогда 
				КуУделК=СтрСотрудников.ДоходФактРОП/СтрСотрудников.ФактПродажиКоличество;
				Если КуУделК<ПланУделК Тогда
					КУделК=ПроцентУделК;	
					СуммаПроцентов=СуммаПроцентов+КУделК;
					ДАНЕТкум="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
//		
		ПланТИ=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
		КТИ=1;	
		ДАНЕТти="ДА";
		Если ПланТИ<>0 Тогда 
			ПроцентТИ=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.TradeIn);
			Если ПроцентТИ<>0 Тогда 
				//КТИФакт=Окр(СтрСотрудников.TradeInФакт/СтрСотрудников.ФактПродажиКоличество,2)*100;
				КТИФакт=Окр(TradeInФакт/СтрСотрудников.ПланПродажиКоличество,2)*100;
				Если КТИФакт<ПланТИ Тогда
					КТИ=ПроцентТИ;	
					СуммаПроцентов=СуммаПроцентов+КТИ;
					ДАНЕТти="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
//		
		//Шт посчитали
		ПланНовые=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
		КШт=1;
		ДАНЕТшт="ДА";

		Если ПланНовые<>0 Тогда 
			ПроцентНовые=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Штуки);
			Если ПроцентНовые<>0 Тогда 
				Если СтрСотрудников.ФактПродажиКоличество<ПланНовые Тогда
					КШт=ПроцентНовые;	
					СуммаПроцентов=СуммаПроцентов+КШт;
					ДАНЕТшт="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
//		//
//		
		//Шт посчитали
		ПланФП=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
		КФП=1;
		ДАНЕТкред="ДА";
		Если ПланФП<>0 Тогда 
			ПроцентФП=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Кредиты);
			Если ПроцентФП<>0 Тогда 
				Если СтрСотрудников.ФактФинПродукт<ПланФП Тогда
					КФП=ПроцентФП;	
					СуммаПроцентов=СуммаПроцентов+КФП;
					ДАНЕТкред="НЕТ";
				КонецЕсли;		
  			КонецЕсли;
		КонецЕсли;	
//		//

		ПланДнейСклада=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.ДнейСклада);
		ОстатокСклад=ОстатокСкладаТИ(Организации,СкладыТИ,ПланДнейСклада); 

		//Склад
		ПланСклад=ПолучитьПараметрСотрудникПлан(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
		КСклад=1;
		ДАНЕТСклад="ДА";
		Если ПланСклад<>0 Тогда 
			ПроцентСклад=ПолучитьПараметрСотрудникПроцент(СтрСотрудников.РОП,Перечисления.ТТ_Параметры_ЗП.Склад);
			Если ПроцентСклад<>0 Тогда 
				Если ПланСклад >ОстатокСклад Тогда
					КСклад=ПроцентСклад;	
					СуммаПроцентов=СуммаПроцентов+КСклад;
					ДАНЕТСклад="НЕТ";
				КонецЕсли;		
			КонецЕсли;
		КонецЕсли;	

		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаСотр");
		ОбластьМакета.Параметры.Брэнд=БрендДляПоказателей;
		ОбластьМакета.Параметры.Сотрудник=СтрСотрудников.РОП;
		ТабДокумент.Вывести(ОбластьМакета);
//		
		//Расшифровка ЗП
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка11");
		ОбластьМакета.Параметры.ВсегоСТИ=СтрСотрудников.ДоходФактРОП-СтрСотрудников.ФактФинПродукт; 
		ОбластьМакета.Параметры.ВсегоФП	=СтрСотрудников.ФактФинПродукт;
		ОбластьМакета.Параметры.Бонус=СтрСотрудников.Бонус;
		ОбластьМакета.Параметры.ИнвестБонус=СтрСотрудников.ИнвестБонус;
		ОбластьМакета.Параметры.ВсегоМаржа	=СтрСотрудников.ДоходФактРОП;
		
		ОбластьМакета.Параметры.Процент=СтрСотрудников.ПроцентРОП;
		ОбластьМакета.Параметры.ЗПБаза=(СтрСотрудников.ДоходФактРОП+СтрСотрудников.Бонус-СтрСотрудников.ИнвестБонус)*(СтрСотрудников.ПроцентРОП/100);
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
		ОбластьМакета.Параметры.ИтогоЗП=СтрСотрудников.ИтогоРопФОТ;
		ТабДокумент.Вывести(ОбластьМакета);
//		
//		
		// Процент
		ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка10"); 
		ОбластьМакета.Параметры.ПланДнейСклада=ПланДнейСклада;
		//ОбластьМакета.Параметры.ВсегоДоходФактДляКумулятива=ВсегоДоходФактДляКумулятива;
//		
		ОбластьМакета.Параметры.ПланУделК=ПланУделК;
		ОбластьМакета.Параметры.ПроцентУделК=ПроцентУделК;
		ОбластьМакета.Параметры.КУделК=КУделК;
		ОбластьМакета.Параметры.КуУделК=КуУделК;
		ОбластьМакета.Параметры.ДАНЕТкум=ДАНЕТкум;
//		
		ОбластьМакета.Параметры.ПланТИ=ПланТИ;
		ОбластьМакета.Параметры.ПроцентТИ=ПроцентТИ;
		ОбластьМакета.Параметры.КТИФакт=КТИФакт;
		ОбластьМакета.Параметры.КТИ=КТИ;
		ОбластьМакета.Параметры.ДАНЕТти=ДАНЕТти;
//		
		ОбластьМакета.Параметры.ПланНовые=ПланНовые;
		ОбластьМакета.Параметры.ПроцентНовые=ПроцентНовые;
		ОбластьМакета.Параметры.ФактНовые=СтрСотрудников.ФактПродажиКоличество;
		ОбластьМакета.Параметры.КШт=КШт;
		ОбластьМакета.Параметры.ДАНЕТшт=ДАНЕТшт;
//		
//		ОбластьМакета.Параметры.ПланДоп=ПланДоп;
//		ОбластьМакета.Параметры.ПроцентДоп=ПроцентДоп;
//		ОбластьМакета.Параметры.КУДоп=КУДоп;
//		ОбластьМакета.Параметры.КДоп=КДоп;
//		ОбластьМакета.Параметры.ДАНЕТдоп=ДАНЕТдоп;

		ОбластьМакета.Параметры.ПланФП=ПланФП;
		ОбластьМакета.Параметры.ПроцентФП=ПроцентФП;
		ОбластьМакета.Параметры.ФактФП=СтрСотрудников.ФактФинПродукт;
		ОбластьМакета.Параметры.КФП=КФП;
		ОбластьМакета.Параметры.ДАНЕТкред=ДАНЕТкред;

//		ОбластьМакета.Параметры.ПланКАСКО=ПланКАСКО;
//		ОбластьМакета.Параметры.ПроцентКАСКО=ПроцентКАСКО;
//		ОбластьМакета.Параметры.КуКАСКО=КуКАСКО;
//		ОбластьМакета.Параметры.ККАСКО=ККАСКО;
//		ОбластьМакета.Параметры.ДАНЕТкаско=ДАНЕТкаско;

//		ОбластьМакета.Параметры.ПланОСАГО=ПланОСАГО;
//		ОбластьМакета.Параметры.ПроцентОСАГО=ПроцентОСАГО;
//		ОбластьМакета.Параметры.КуОСАГО=КуОСАГО;
//		ОбластьМакета.Параметры.КОСАГО=КОСАГО;
//		ОбластьМакета.Параметры.ДАНЕТосаго=ДАНЕТосаго;
//		
//		ОбластьМакета.Параметры.ПланНеликвид=ПланНеликвид;
//		ОбластьМакета.Параметры.ПроцентНеликвид=ПроцентНеликвид;
//		ОбластьМакета.Параметры.Неликвид=Неликвид;
//		ОбластьМакета.Параметры.КНеликвид=КНеликвид;
//		ОбластьМакета.Параметры.ДАНЕТнел=ДАНЕТнел;
//		
//		ОбластьМакета.Параметры.ПланQVN=ПланQVN;
//		ОбластьМакета.Параметры.ПроцентQVN=ПроцентQVN;
//		ОбластьМакета.Параметры.QVN=СтрСотрудников.ФактQVN;
//		ОбластьМакета.Параметры.КQVN=КQVN;
//		ОбластьМакета.Параметры.ДАНЕТQVN=ДАНЕТQVN;
//		
		ОбластьМакета.Параметры.ПланСклад=ПланСклад;
		ОбластьМакета.Параметры.ПроцентСклад=ПроцентСклад;
		ОбластьМакета.Параметры.Склад=ОстатокСклад;
		ОбластьМакета.Параметры.КСклад=КСклад;
		ОбластьМакета.Параметры.ДАНЕТСклад=ДАНЕТСклад;
//		
		ОбластьМакета.Параметры.СуммаПроцентов=СуммаПроцентов;
//		
		ТабДокумент.Вывести(ОбластьМакета);
//		
//		ТаблицаРезультат.Очистить();
//		ТТЗ.Очистить();
//		
//		
	КонецЦикла;

	Возврат ТабДокумент;
КонецФункции


Функция ПолучитьФинАвтоТИ(Автомобиль) Экспорт
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02036");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02037");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02038");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии*100)/108 
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.ДокументОснование.Автомобиль В (&Автомобиль)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код<>""ЦБ000017"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			(РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ*100)/108
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		|	РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль.Модель КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02043"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.ДокументОснование.Автомобиль В (&Автомобиль)

		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.Ссылка.ДокументОснование.Автомобиль.Модель, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|";
		
		

		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
		
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 и  ВыборкаСсылка.КВ = 0 Тогда
				Продолжить;
			КонецЕсли;	
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Свернуть("МодельГруппа, НаименованиеФинПродукта, МесяцПродажи", "Сумма");
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		Возврат(ТаблицаРезультат.Итог("Сумма"));	
		
	
КонецФункции	

Функция ОстатокСкладаТИ(Организации,Склады,ДнейСклада) Экспорт
	
	Запрос= Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(МАКСИМУМ(ОстаткиАвтомобилейОстатки.Партия.Дата), МАКСИМУМ(ОстаткиАвтомобилейОстатки.ДокументПродажи.Дата), ДЕНЬ) КАК СрокХранения,
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала,&ДатаОкончания ) КАК ОстаткиАвтомобилейОстатки
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.СкладКомпании В (&Склады)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Организация В (&Организация)
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Автомобиль";
	
	
	Запрос.Параметры.Вставить("ДатаНачала", НачалоДня(ПериодНачало)); // <Дата>[01.01.0001 0:00:00]
	Запрос.Параметры.Вставить("ДатаОкончания", КонецДня(ПериодКонец)); // <Дата>[01.01.0001 0:00:00]
	Запрос.Параметры.Вставить("Организация", Организации); // <Организации>[], Справочники.Организации.ПустаяСсылка();
	Запрос.Параметры.Вставить("Склады", Склады); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КолАвто=0;
	Пока  Выборка.Следующий() Цикл
		Если Выборка.СрокХранения>=ДнейСклада Тогда		
			КолАвто=КолАвто+1;
		КонецЕсли;	
	КонецЦикла;
 	Возврат(КолАВто);
	
КонецФункции


Процедура РасчитатьОценщиков() Экспорт
	
	// Вставить содержимое обработчика.
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000016"));
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000017");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	
	Организации=Новый СписокЗначений;
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000001"));
	Организации.Добавить(Справочники.Организации.НайтиПоКоду("ЦБ000003"));
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000208"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000209"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000058"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000201"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000200"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000056"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000202"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000189"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000190"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000191"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000052"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000184"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000192"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000193"));

	
	

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, СкладКомпании В (&СкладКомпании) ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|   ПродажиАвтомобилейОбороты.ДокументПродажи.Организация В (&Организации)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладКомпании", СкладыТИ);
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		ТЗ=Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Автомобиль");
		ТЗ.Колонки.Добавить("Маржа");
		ТЗ.Колонки.Добавить("ДокПоступления");
		ТЗ.Колонки.Добавить("Сотрудник");
		ТЗ.Колонки.Добавить("ДЦПриема");
		ТЗ.Колонки.Добавить("Количество");
		
		Пока выборка.Следующий() Цикл
			СуммаПроданных = СуммаПроданных + выборка.Маржа;		 
			КоличествоПродано =  КоличествоПродано + 1; 
			Стр=ТЗ.Добавить();
			Стр.Автомобиль=Выборка.автомобиль;
			Стр.Маржа=выборка.Маржа;
		КонецЦикла;
		
		СписокАвто=ТЗ.ВыгрузитьКолонку("Автомобиль");
		
		ЗапросПриема=Новый Запрос;
		ЗапросПриема.Текст="
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейОбороты.Партия,
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход,
		|	ОстаткиАвтомобилейОбороты.Автомобиль

		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Обороты КАК ОстаткиАвтомобилейОбороты
		|ГДЕ
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход = 1
		|	И ОстаткиАвтомобилейОбороты.Автомобиль В(&Автомобиль)

		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилейОбороты.Автомобиль,
		|	ОстаткиАвтомобилейОбороты.Партия,
		|	ОстаткиАвтомобилейОбороты.КоличествоПриход
		|;

		////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Автомобиль КАК Авто,
		|	ВТ.Партия КАК Партия,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ВТ.Партия = ЗначенияСвойствОбъектов.Объект
		|		ГДЕ ЗначенияСвойствОбъектов.Свойство В (&Свойства)


		|СГРУППИРОВАТЬ ПО
		|ВТ.Автомобиль,
		|ВТ.Партия,
		|ЗначенияСвойствОбъектов.Свойство,
		|ЗначенияСвойствОбъектов.Значение
		
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.Партия.Дата	";
		
		СписокСвойств=Новый СписокЗначений;
		СписокСвойств.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12186"));
		СписокСвойств.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов.Получил);
		
		ЗапросПриема.УстановитьПараметр("Автомобиль", СписокАвто);
		ЗапросПриема.УстановитьПараметр("Свойства", СписокСвойств);

		Рез=ЗапросПриема.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Рез.Следующий() Цикл
			Стр=ТЗ.Найти(Рез.Авто,"Автомобиль");
			Стр.ДокПоступления=Рез.Партия;
			Стр.Количество=1;
			Если Рез.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.Получил Тогда
				Стр.Сотрудник=Рез.Значение;
			Иначе	
				Стр.ДЦПриема=Рез.Значение;	
			КонецЕсли;	
		КонецЦикла;
		
		Для каждого СтрСотр ИЗ Оценщики Цикл
			СтрСотр.Продано=0;
			Для каждого СтрАвто из ТЗ Цикл
				Если СтрАвто.Сотрудник=СтрСотр.Сотрудник Тогда
					СтрСотр.Продано=СтрСотр.Продано+1;
					Если СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000161") Тогда //лада
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ;	
					ИначеЕсли СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000162") Тогда //Вольво
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.VOLVO;							
					ИначеЕсли СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000163") Тогда //Уаз
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.УАЗ;	
					ИначеЕсли СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000164") Тогда //ГАЗ
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ;	
					ИначеЕсли СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000165") Тогда //Б/У
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.ТрейдИн;	
					ИначеЕсли СтрАвто.ДЦПриема=Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ000166") Тогда //ФОРД/ФИАТ
						ДЦ=Перечисления.БрендыДляРасчетаЗарплаты.FORD;	
					Иначе
						Сообщить("Неопознанный ДЦ приема "+СтрАвто.ДЦПриема);
					КонецЕсли;	
						
					Процент = ПолучитьПроцент(ДЦ, Перечисления.ДолжностиДляЗП.Оценщик, ПериодКонец)[0];
					СтрСотр.Сумма=(СтрАвто.Маржа/100)*Процент;
				КонецЕсли;	
			КонецЦикла;
			
				ЗапросПостАвто=Новый Запрос;
				ЗапросПостАвто.Текст="
					|ВЫБРАТЬ
					|ОстаткиАвтомобилейОбороты.Партия
					|ПОМЕСТИТЬ ВТ
					|ИЗ
					|РегистрНакопления.ОстаткиАвтомобилей.Обороты(&НачалоПериода,&КонецПериода) КАК ОстаткиАвтомобилейОбороты
					|ГДЕ
					|ОстаткиАвтомобилейОбороты.КоличествоПриход =1
					|;
					
					////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|ВТ.Партия,
					|ЗначенияСвойствОбъектов.Свойство,
					|ЗначенияСвойствОбъектов.Значение
					|ИЗ
					|ВТ КАК ВТ
					|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
					|ПО ВТ.Партия = ЗначенияСвойствОбъектов.Объект
					|ГДЕ ЗначенияСвойствОбъектов.Свойство = &Свойство
					|И  ЗначенияСвойствОбъектов.Значение= &Сотрудник";
					
				ЗапросПостАвто.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодНачало));
				ЗапросПостАвто.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
				ЗапросПостАвто.УстановитьПараметр("Свойство",Планывидовхарактеристик.СвойстваОбъектов.Получил);	
				ЗапросПостАвто.УстановитьПараметр("Сотрудник",СтрСотр.Сотрудник);
				Результат = ЗапросПостАвто.Выполнить().Выбрать();
				СтрСотр.Принято = Результат.Количество();
				
		КонецЦикла
				
КонецПроцедуры


Процедура ПечатьОценщиков() Экспорт
	
КонецПроцедуры

Права   = Неопределено;

#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли 