// Модуль обработки АвтоматическоеСнятиеРезервовАвтомобилей

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

// Возвращает таблицу заказов с истекшим сроком снятия резервов
//
Функция ПолучитьДеревоЗаказовАвтомобилей() Экспорт
	
	Если СхемаКомпановкиДанных = Неопределено Тогда
		СхемаКомпановкиДанных = ПолучитьМакет("ЗаказыСоСроками");
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпановкиДанных));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);	
	КонецЕсли;
	
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпановкиДанных));
	КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпановкиДанных.НастройкиПоУмолчанию);	
	
	ДеревоРезультат = Новый ДеревоЗначений();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпановкиДанных, КомпоновщикНастроекКомпоновкиДанных.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДеревоРезультат);
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	ПроцессорВывода.ЗакончитьВывод();
	
	Возврат ДеревоРезультат;
	
КонецФункции

// Создает запись напоминание автору(менеджеру) документа о списании резерва
//
Процедура СоздатьНапоминание(НаборЗаписей, ТаблицаЗаказов, СнятиеРезервов=Неопределено,Корректировка=Неопределено) Экспорт
	
	ТаблицаЗаказов.Свернуть("Заказ,Автор,Менеджер");
	
	// Получим пользователей, кому требуется создать напоминание
	Запрос = Новый Запрос;
	// вариант запроса, который вернет всех пользователей, если для 1 сотрудника заведено несколько пользователей
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗаказов.Заказ    КАК Заказ,
	|	ТаблицаЗаказов.Менеджер КАК Менеджер,
	|	ТаблицаЗаказов.Автор    КАК Автор
	|ПОМЕСТИТЬ ТаблицаЗаказов
	|ИЗ
	|	&ТаблицаЗаказов КАК ТаблицаЗаказов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаАвтомобиль.Заказ КАК Заказ,
	|	ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Автор) КАК Пользователь
	|ИЗ
	|	ТаблицаЗаказов КАК ЗаказНаАвтомобиль
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ЗаказНаАвтомобиль.Менеджер = Пользователи.Сотрудник
	|			И (НЕ Пользователи.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	|			И (Пользователи.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ЕСТЬNULL(Пользователи.Ссылка, ЗаказНаАвтомобиль.Автор) <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|ИТОГИ ПО
	|	Пользователь";
	Запрос.УстановитьПараметр("ТаблицаЗаказов", ТаблицаЗаказов);
	
	ВыборкаПользователи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДатаОповещений  = ТекущаяДата();
	
	Пока ВыборкаПользователи.Следующий() Цикл
		ВыборкаЗаказы = ВыборкаПользователи.Выбрать();
		
		//сформируем СтрЗаказы - список заказов по пользователю через запятую
		СтрЗаказы = "";
		Первый = Истина;
		ПервыйЗаказ = Неопределено;
		Пока ВыборкаЗаказы.Следующий() Цикл;
			Если Первый Тогда
				СтрЗаказы = "<" + Строка(ВыборкаЗаказы.Заказ) + ">";		
				ПервыйЗаказ = ВыборкаЗаказы.Заказ;
				Первый = Ложь;
			Иначе
				СтрЗаказы = СтрЗаказы + ", <" + Строка(ВыборкаЗаказы.Заказ) + ">";  	
			КонецЕсли;
		КонецЦикла;
		СтрЗаказы = ?(ВыборкаЗаказы.Количество()=1, "по заказу " + СтрЗаказы, "по заказам " + СтрЗаказы);
		
		Если СнятиеРезервов<>Неопределено Тогда
			Описание = "Сформирован документ снятия резервов <" + Строка(СнятиеРезервов) + "> " + СтрЗаказы;
		ИначеЕсли Корректировка<>Неопределено Тогда
			Описание = "Сформирован документ отмены <" + Строка(Корректировка) + "> " + СтрЗаказы;
		Иначе
			Описание = "Истек срок снятия резерва " + СтрЗаказы + ".  Необходимо выполнить снятие резерва.";
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Пользователь            = ВыборкаПользователи.Пользователь;
		НоваяЗапись.Автор                   = ПараметрыСеанса.Пользователь;
		НоваяЗапись.Завершено               = Ложь;
		НоваяЗапись.РеальнаяДатаОповещения  = ДатаОповещений;
		НоваяЗапись.ДатаНачала              = ДатаОповещений;
		НоваяЗапись.ДатаОповещения          = ДатаОповещений;
		НоваяЗапись.Редактирование          = Ложь;
		Если СнятиеРезервов<>Неопределено Тогда
			НоваяЗапись.Объект = СнятиеРезервов;
		ИначеЕсли Корректировка<>Неопределено Тогда
			НоваяЗапись.Объект = Корректировка;
		Иначе
			НоваяЗапись.Объект = ПервыйЗаказ;
		КонецЕсли;
		НоваяЗапись.Описание                = Описание;
		НоваяЗапись.Тема                    = "Автоматическое снятие резервов по заказам автомобилей."; 
		НоваяЗапись.ТипПериода              = "00";
		НоваяЗапись.УдалитьПоИстеченииСрока = Истина;
	КонецЦикла;
КонецПроцедуры

// Формирует документы снятие резервов и возвращает результат работы
Функция ВыполнитьСнятиеРезервовАвтомобилей(ТаблицаЗаказовДляСписания,  СоздаватьНапоминание = Ложь, ФоновыйРежим = Ложь) Экспорт
	ДокументыДляПроведения = Новый Массив; ЗаказыПоДокументам = Новый Соответствие();
	
	КэшСнятиеРезервов = Новый ТаблицаЗначений;
	КэшСнятиеРезервов.Колонки.Добавить("Ссылка");
	КэшСнятиеРезервов.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
	
	#Если Клиент Тогда
		РазрешениеСнятияРезервов = обПраво("РазрешениеСнятияРезервов", глПрава);
	#Иначе
		РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Разрешено;	
	#КонецЕсли
	
	Если РазрешениеСнятияРезервов = Перечисления.РезервыСпособыСписания.Запрещено Тогда
		Если НЕ ФоновыйРежим Тогда 
			#Если Клиент Тогда
				Предупреждение("Недостаточно прав для снятия резервов!");
			#КонецЕсли
		КонецЕсли;
		
		Возврат КэшСнятиеРезервов;		
	КонецЕсли;
	
	//если ничего не выбрано, прерываем обработку
	Если ТаблицаЗаказовДляСписания.Количество() = 0 Тогда
		Если НЕ ФоновыйРежим Тогда 
			#Если Клиент Тогда
				Предупреждение("Не выбрано заявок для формирования снятия резервов");
			#КонецЕсли
		КонецЕсли;
		Возврат КэшСнятиеРезервов;
	КонецЕсли;
	
	Если СоздаватьНапоминание Тогда
		НаборЗаписейНапоминания = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
		НаборЗаписейНапоминания.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
		НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
		НаборЗаписейНапоминания.Прочитать();
	КонецЕсли;
	
	#Если Клиент Тогда
		Состояние("Подготовка данных...");
	#КонецЕсли
	
	//таблица содержит заказы, резервы по которым были сняты данным документом
	ТаблицаЗаказовИтоговая = Новый ТаблицаЗначений;
	МассивТиповЗаказа = Новый Массив;
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.ЗаказНаАвтомобиль"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.РезервированиеАвтомобилей"));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Заказ", Новый ОписаниеТипов(МассивТиповЗаказа));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	
	// сначала выгрузим документы корректировки
	Корректировки = ТаблицаЗаказовДляСписания.НайтиСтроки(Новый Структура("Корректировка", Истина));
	Если Корректировки.Количество() > 0 Тогда
		Для Каждого ТекЗаказДляСписания Из Корректировки Цикл
			ОтменаЗаказа = Документы.ЗаказНаАвтомобиль.СоздатьДокумент();
			
			ОтменаЗаказа.ХозОперация        = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена;
			ОтменаЗаказа.ДокументОснование	= ТекЗаказДляСписания.Заказ;
			
			ОтменаЗаказа.Заполнить(ОтменаЗаказа.ДокументОснование);
			ОтменаЗаказа.Комментарий = "Автоматическое снятие резерва и отмена заказа";
			
			НоваяСтрока = ТаблицаЗаказовИтоговая.Добавить();
			НоваяСтрока.Заказ    = ТекЗаказДляСписания.Заказ;
			НоваяСтрока.Автор    = ТекЗаказДляСписания.Заказ.Автор;
			НоваяСтрока.Менеджер = ТекЗаказДляСписания.Заказ.Менеджер;
			
			//ОтменаЗаказа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
			ДокументыДляПроведения.Добавить(ОтменаЗаказа);
			ЗаказыПоДокументам.Вставить(ОтменаЗаказа, ТаблицаЗаказовИтоговая.Скопировать());
			ТаблицаЗаказовИтоговая.Очистить();
			
			ТаблицаЗаказовДляСписания.Удалить(ТекЗаказДляСписания);
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаЗаказовДляСписания.Сортировать("СкладКомпании");
	
	Если ТаблицаЗаказовДляСписания.Количество() > 0 Тогда
		ТекущийСклад = Неопределено; ТекущийДокумент = Неопределено;
		Для Каждого ТекЗаказДляСписания Из ТаблицаЗаказовДляСписания Цикл
			Если ТекущийСклад <> ТекЗаказДляСписания.СкладКомпании ИЛИ ТекущийДокумент = Неопределено Тогда
				Если ТекущийДокумент <> Неопределено Тогда
					ДокументыДляПроведения.Добавить(ТекущийДокумент);
					ЗаказыПоДокументам.Вставить(ТекущийДокумент, ТаблицаЗаказовИтоговая.Скопировать());
					ТаблицаЗаказовИтоговая.Очистить();
				КонецЕсли;
				
				// создаем новый документ и заполняем его реквизиты
				ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.СоздатьДокумент();
				ТекущийДокумент.Заполнить(Неопределено);
				ТекущийДокумент.СкладКомпании = ТекЗаказДляСписания.СкладКомпании;	
				ТекущийДокумент.Комментарий = "Автоматическое снятие резервов автомобилей";
				ТекущийСклад = ТекЗаказДляСписания.СкладКомпании;
			КонецЕсли;
			
			НоваяСтрока = ТекущийДокумент.Автомобили.Добавить();
			НоваяСтрока.Автомобиль = ТекЗаказДляСписания.Автомобиль;
			
			НоваяСтрока = ТаблицаЗаказовИтоговая.Добавить();
			НоваяСтрока.Заказ    = ТекЗаказДляСписания.Заказ;
			НоваяСтрока.Автор    = ТекЗаказДляСписания.Заказ.Автор;
			НоваяСтрока.Менеджер = ТекЗаказДляСписания.Заказ.Менеджер;
		КонецЦикла;
		
		ДокументыДляПроведения.Добавить(ТекущийДокумент);
		ЗаказыПоДокументам.Вставить(ТекущийДокумент, ТаблицаЗаказовИтоговая.Скопировать());
		ТаблицаЗаказовИтоговая.Очистить();
	КонецЕсли;
	
	#Если Клиент Тогда
		Состояние("Проведение документов...");
	#КонецЕсли
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Отказ = Ложь; Ошибки = "";
	
	Для Каждого Документ Из ДокументыДляПроведения Цикл
		Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		
		// запишем автомобили в Кэш
		Если обЭтотТип(Документ, "ДокументОбъект.ЗаказНаАвтомобиль") Тогда
			СтрокаКэша = КэшСнятиеРезервов.Добавить();
			СтрокаКэша.Ссылка     = Документ.Ссылка;
			СтрокаКэша.Автомобиль = Документ.Автомобиль;
		Иначе
			Для Каждого Строка Из Документ.Автомобили Цикл
				СтрокаКэша = КэшСнятиеРезервов.Добавить();
				СтрокаКэша.Ссылка     = Документ.Ссылка;
				СтрокаКэша.Автомобиль = Строка.Автомобиль;
			КонецЦикла;
		КонецЕсли;
		
		Если НЕ ФоновыйРежим Тогда 
			Сообщить("Сформирован и проведен документ <" + Строка(Документ)+ ">");	
		КонецЕсли;
		
		// создодим напоминание
		Если СоздаватьНапоминание Тогда
			СоздатьНапоминание(НаборЗаписейНапоминания, ЗаказыПоДокументам.Получить(Документ),
				?(обЭтотТип(Документ, "ДокументОбъект.ЗаказНаАвтомобиль"), Неопределено, Документ.Ссылка),
				?(обЭтотТип(Документ, "ДокументОбъект.ЗаказНаАвтомобиль"), Документ.Ссылка, Неопределено));
		КонецЕсли;
		Исключение
			Ошибка = ИнформацияОбОшибке();
			Отказ = Истина;
			дкДобавитьОшибку(Ошибки, Строка(Документ));
		КонецПопытки;
	КонецЦикла;
	
	Если Отказ Тогда
		Если НЕ ФоновыйРежим Тогда
			Сообщить("Не удалось провести документы: " + Ошибки + Символы.ПС + "Отменена запись всех документов.");
		КонецЕсли;
		
		ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	//записываем сформированные напоминания
	Если СоздаватьНапоминание И НЕ Отказ Тогда
		Попытка  НаборЗаписейНапоминания.Записать(Истина); 
		Исключение 	
			Если НЕ ФоновыйРежим Тогда 
				Сообщить("Ошибка создания напоминаний о резервировании автомобилей: "+ОписаниеОшибки()); 
			КонецЕсли;
		КонецПопытки;
	КонецЕсли;
	
	#Если Клиент Тогда
		Состояние("Готово.");
	#КонецЕсли
	
	//ТаблицаЗаказовДляСписания.Сортировать("СкладКомпании,Корректировка");
	//
	////для обхода в цикле - если на данной итерации значения станут отличаться от текущих - 
	////выполняется запись предыдущего документа и формирование следующего документа
	// ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
	//ТекущийСклад = Справочники.СкладыКомпании.ПустаяСсылка();
	//ТекФлагКорректировки = Истина;
	//
	////таблица содержит заказы, резервы по которым были сняты данным документом
	//ТаблицаЗаказовИтоговая = Новый ТаблицаЗначений;
	//ТаблицаЗаказовИтоговая.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказНаАвтомобиль"));	
	//		
	//Для Каждого ТекЗаказДляСписания Из ТаблицаЗаказовДляСписания Цикл
	//	
	//	Если ТекущийСклад <> ТекЗаказДляСписания.СкладКомпании ИЛИ ТекФлагКорректировки <> ТекЗаказДляСписания.Корректировка Тогда
	//		
	//		//изменился склад
	//		ТекущийСклад = ТекЗаказДляСписания.СкладКомпании;
	//		ТекФлагКорректировки = ТекЗаказДляСписания.Корректировка;
	//		
	//		//записываем документ
	//		Если НЕ обЗначениеНеЗаполнено(ТекущийДокумент) И ТекущийДокумент.Автомобили.Количество()>0 Тогда
	//			Попытка
	//				ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
	//				Если НЕ ФоновыйРежим Тогда 
	//					Сообщить("Сформирован и проведен документ <" + Строка(ТекущийДокумент)+ ">");	
	//				КонецЕсли;
	//				//формируем данные для страницы "сформированные документы" 	
	//				Для Каждого СтрокаТоваров Из ТекущийДокумент.Ссылка.Автомобили Цикл
	//					СтрокаКэша = КэшСнятиеРезервов.Добавить();
	//					СтрокаКэша.Ссылка = ТекущийДокумент.Ссылка;
	//					СтрокаКэша.Автомобиль = СтрокаТоваров.Автомобиль;
	//				КонецЦикла;
	//				//создаем напоминание автору заказа
	//				Если СоздаватьНапоминание Тогда
	//					Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая, ТекущийДокумент.Ссылка);
	//				КонецЕсли;
	//			Исключение
	//				Если НЕ ФоновыйРежим Тогда 
	//					Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
	//				КонецЕсли;
	//			КонецПопытки;
	// 			ТаблицаЗаказовИтоговая.Очистить();
	//			ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если ТекЗаказДляСписания.Корректировка Тогда
	//		ОтменаЗаказа = Документы.ЗаказНаАвтомобиль.СоздатьДокумент();
	//		ОтменаЗаказа.ХозОперация = Справочники.ХозОперации.ЗаказНаАвтомобильОтмена;
	//		ОтменаЗаказа.ДокументОснование	= ТекЗаказДляСписания.Заказ;
	//		ОтменаЗаказа.Заполнить(ОтменаЗаказа.ДокументОснование);
	//		ОтменаЗаказа.Комментарий = "Автоматическое снятие резерва и отмена заказа";
	//		Попытка
	//			ОтменаЗаказа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
	//			Если НЕ ФоновыйРежим Тогда 
	//				Сообщить("Сформирован и проведен документ <" + Строка(ОтменаЗаказа)+ ">");	
	//			КонецЕсли;
	//			//формируем данные для страницы "сформированные документы" 	
	//			СтрокаКэша = КэшСнятиеРезервов.Добавить();
	//			СтрокаКэша.Автомобиль = ТекЗаказДляСписания.Автомобиль;
	//			СтрокаКэша.Ссылка = ОтменаЗаказа.Ссылка;
	//			//таблица содержит заказы, резервы по которым были сняты данным документом
	//			СтрокаИтоговая = ТаблицаЗаказовИтоговая.Добавить();
	//			СтрокаИтоговая.Заказ = ТекЗаказДляСписания.Заказ;
	//			//создаем напоминание автору заказа
	//			Если СоздаватьНапоминание Тогда
	//				Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая,,ОтменаЗаказа.Ссылка);
	//			КонецЕсли;
	//		Исключение
	//			Если НЕ ФоновыйРежим Тогда 
	//				Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
	//			КонецЕсли;
	//		КонецПопытки;
	// 		ТаблицаЗаказовИтоговая.Очистить();
	//	Иначе
	//		Если обЗначениеНеЗаполнено(ТекущийДокумент) Тогда
	//			// создаем новый документ и заполняем его реквизиты
	//			ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.СоздатьДокумент();
	//			ТекущийДокумент.Заполнить(Неопределено);
	//			ТекущийДокумент.СкладКомпании = ТекЗаказДляСписания.СкладКомпании;	
	//			ТекущийДокумент.Комментарий = "Автоматическое снятие резервов автомобилей";
	//		КонецЕсли;
	//		НоваяСтрока = ТекущийДокумент.Автомобили.Добавить();
	//		НоваяСтрока.Автомобиль = ТекЗаказДляСписания.Автомобиль;
	//		//таблица содержит заказы, резервы по которым были сняты данным документом
	// 		СтрокаИтоговая = ТаблицаЗаказовИтоговая.Добавить();
	//		СтрокаИтоговая.Заказ = ТекЗаказДляСписания.Заказ;
	//	КонецЕсли;

	//КонецЦикла;
	//
	////записываем последний документ, если он не был записан в цикле
	//Если НЕ обЗначениеНеЗаполнено(ТекущийДокумент) И ТекущийДокумент.Автомобили.Количество()>0 Тогда
	//	Попытка
	//		ТекущийДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);	
	//		Если НЕ ФоновыйРежим Тогда 
	//			Сообщить("Сформирован и проведен документ <" + Строка(ТекущийДокумент)+ ">");	
	//		КонецЕсли;
	//		//формируем данные для страницы "сформированные документы" 	
	//		Для Каждого СтрокаТоваров Из ТекущийДокумент.Ссылка.Автомобили Цикл
	//			СтрокаКэша = КэшСнятиеРезервов.Добавить();
	//			СтрокаКэша.Ссылка = ТекущийДокумент.Ссылка;
	//			СтрокаКэша.Автомобиль = СтрокаТоваров.Автомобиль;
	//		КонецЦикла;
	//		//создаем напоминание автору заказа
	//		Если СоздаватьНапоминание Тогда
	//			Обработки.АвтоматическоеСнятиеРезервовАвтомобилей.СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая,ТекущийДокумент.Ссылка);
	//		КонецЕсли;
	//	Исключение
	//		Если НЕ ФоновыйРежим Тогда 
	//			Сообщить("Не удалось записать документ " + Строка(ТекущийДокумент));	
	//		КонецЕсли;
	//	КонецПопытки;
	//	ТекущийДокумент = Документы.СнятиеРезервовАвтомобилей.ПустаяСсылка();
	//КонецЕсли;
	//
	////записываем сформированные напоминания
	//Если СоздаватьНапоминание Тогда
	//	Попытка  НаборЗаписейНапоминания.Записать(Истина); 
	//	Исключение 	
	//		Если НЕ ФоновыйРежим Тогда 
	//			Сообщить("Ошибка создания напоминаний о резервировании автомобилей: "+ОписаниеОшибки()); 
	//		КонецЕсли;
	//	КонецПопытки;
	//КонецЕсли;
	//
	Возврат КэшСнятиеРезервов;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ФОНОВЫЕ ПРОЦЕДУРЫ

// Формирует набор напоминаний по просроченным резервам и записывает их
//
Процедура СформироватьНапоминанияПроСнятиеРезервовАвтомобилей() Экспорт
	
	ДеревоРезультат = ПолучитьДеревоЗаказовАвтомобилей();
	
	НаборЗаписейНапоминания = РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
	НаборЗаписейНапоминания.Отбор.Автор.Установить(ПараметрыСеанса.Пользователь);
	НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
	НаборЗаписейНапоминания.Прочитать();

	//таблица содержит заказы, резервы по которым были сняты данным документом
	ТаблицаЗаказовИтоговая = Новый ТаблицаЗначений;
	МассивТиповЗаказа = Новый Массив;
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.ЗаказНаАвтомобиль"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.РезервированиеАвтомобилей"));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Заказ", Новый ОписаниеТипов(МассивТиповЗаказа));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаЗаказовИтоговая.Колонки.Добавить("Менеджер", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		
	ТекущаяДата = ТекущаяДата();
	
	Для Каждого СтрокаРодитель Из ДеревоРезультат.Строки Цикл
		Для Каждого Строка Из СтрокаРодитель.Строки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.СрокСнятияРезерва) ИЛИ Строка.СрокСнятияРезерва >= ТекущаяДата Тогда Продолжить; КонецЕсли;
			
			НоваяСтрока = ТаблицаЗаказовИтоговая.Добавить();
			НоваяСтрока.Заказ    = Строка.Заказ;
			НоваяСтрока.Автор    = Строка.ЗаказАвтор;
			НоваяСтрока.Менеджер = Строка.ЗаказМенеджер;
		КонецЦикла;
	КонецЦикла;
	
	СоздатьНапоминание(НаборЗаписейНапоминания, ТаблицаЗаказовИтоговая);
	
	//записываем сформированные напоминания
	Попытка  
		НаборЗаписейНапоминания.Записать(Истина); 
	Исключение 	
	КонецПопытки;
	
КонецПроцедуры

// Выполняет регламентное задание по автоматическому снятию резервов
//
Процедура ВыполнитьАвтоматическоеСнятиеРезервовАвтомобилей(СтруктураПараметров) Экспорт
	
	// получим параметры
	ФормированиеНапоминаний      = Ложь; СписаниеРезервовСПредоплатой = Ложь;
	
	Если ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		СтруктураПараметров.Свойство("ФормированиеНапоминаний",ФормированиеНапоминаний);
		СтруктураПараметров.Свойство("СписаниеРезервовСПредоплатой",СписаниеРезервовСПредоплатой);
	КонецЕсли;
	
	ДеревоРезультат = ПолучитьДеревоЗаказовАвтомобилей();
		
	// формируем таблицу заказов, по которым будут списываться резервы
	ТаблицаЗаказовДляСписания = Новый ТаблицаЗначений;
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Заказ");
	ТаблицаЗаказовДляСписания.Колонки.Добавить("СкладКомпании",Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании"));
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Автомобиль",Новый ОписаниеТипов("СправочникСсылка.Автомобили"));	
	ТаблицаЗаказовДляСписания.Колонки.Добавить("Корректировка",Новый ОписаниеТипов("Булево"));	
	
	// заполнение таблиц данными о заказах в соответствии с параметрами
	ТекущаяДата = ТекущаяДата();
	
	Для Каждого СтрокаРодитель Из ДеревоРезультат.Строки Цикл
		Для Каждого Строка Из СтрокаРодитель.Строки Цикл
			Если НЕ ЗначениеЗаполнено(Строка.СрокСнятияРезерва) ИЛИ Строка.СрокСнятияРезерва >= ТекущаяДата Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ СписаниеРезервовСПредоплатой И Строка.Оплата > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаЗаказовДляСписания.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Корректировка = обЭтотТип(Строка.Заказ, "ДокументСсылка.ЗаказНаАвтомобиль");		
		КонецЦикла;
	КонецЦикла;

	ВыполнитьСнятиеРезервовАвтомобилей(ТаблицаЗаказовДляСписания, ФормированиеНапоминаний, Истина);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли