
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Автомобиль");
	СтруктураСвойств.Вставить("Модель");
	СтруктураСвойств.Вставить("ВариантКомплектации");
	СтруктураСвойств.Вставить("СкладКомпании");
	СтруктураСвойств.Вставить("Организация");
	СтруктураСвойств.Вставить("Подразделение");
	СтруктураСвойств.Вставить("Партия");
	СтруктураСвойств.Вставить("Контрагент");
	СтруктураСвойств.Вставить("Заказ");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	
	//ТекстЗапроса = "";
	//
	//СтруктураПоказателей = Новый Структура;
	//СтруктураПоказателей.Вставить("Количество",       "Остатки.Количество");
	//СтруктураПоказателей.Вставить("Резерв",           "ЕСТЬNULL(ОстаткиЗаказыАвтомобилей.РезервОстаток, 0)");
	//СтруктураПоказателей.Вставить("СвободныйОстаток", "Остатки.Количество - ЕСТЬNULL(ОстаткиЗаказыАвтомобилей.РезервОстаток, 0)");
	//СтруктураПоказателей.Вставить("Сумма",            "Остатки.Сумма");
	//СтруктураПоказателей.Вставить("СуммаУпр",         "Остатки.СуммаУпр");
	//СтруктураПоказателей.Вставить("СуммаНДС",         "Остатки.СуммаНДС");
	//СтруктураПоказателей.Вставить("СуммаБезНДС",      "Остатки.Сумма - Остатки.СуммаНДС");
	//
	//ТекстОтбораПоказателей = "";
	//Для Каждого ТекСтрока Из Показатели Цикл
	//	Если Не ТекСтрока.Использование Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Если СтруктураПоказателей.Свойство(ТекСтрока.Имя) Тогда
	//		ТекстОтбораПоказателей = ТекстОтбораПоказателей + ?(ТекстОтбораПоказателей = "", "ГДЕ", " ИЛИ") + Символы.ПС + СтруктураПоказателей[ТекСтрока.Имя] + " <> 0";
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//ВременныйТекстЗапроса = "";
	//Если ТекстОтбораПоказателей <> "" Тогда
	//	ВременныйТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЯ_ПО_ПОКАЗАТЕЛЯМ", ТекстОтбораПоказателей);
	//КонецЕсли;
	//
	//Возврат ВременныйТекстЗапроса;

КонецФункции

// Процедура помогает настроить отчет непосредственно перед выводом
//
Процедура ПередФормированиемМакетаКомпоновки(ПараметрСхемаКомпоновкиДанных, ПараметрКомпоновщикНастроек) Экспорт
	
	Поля = Новый Массив;
	Поля.Добавить("Контрагент");
	Поля.Добавить("Заказ");
	
	ОтчетыСервер.КомпоновщикУстановитьОтборПустыхГруппировок(ПараметрКомпоновщикНастроек.Настройки.Структура, Поля);
	
КонецПроцедуры // ПередФормированиемМакетаКомпоновки()