
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	ПлановыеЗначенияKPI.Ссылка
		|ИЗ
		|	Документ.ПлановыеЗначенияKPI КАК ПлановыеЗначенияKPI
		|ГДЕ
		|	ПлановыеЗначенияKPI.Ссылка <> &Ссылка
		|	И ПлановыеЗначенияKPI.Периодичность = &Периодичность
		|	И ПлановыеЗначенияKPI.ПодразделениеКомпании = &ПодразделениеКомпании
		|	И ПлановыеЗначенияKPI.ПериодПланирования = &ПериодПланирования
		|	И НЕ ПлановыеЗначенияKPI.ПометкаУдаления
		|	И ПлановыеЗначенияKPI.Организация = &Организация");
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ПериодПланирования", ЭтотОбъект.ПериодПланирования);
		Запрос.УстановитьПараметр("Периодичность", ЭтотОбъект.Периодичность);
		Запрос.УстановитьПараметр("ПодразделениеКомпании", ЭтотОбъект.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		
		Выб=Запрос.Выполнить().Выбрать();
		
		Если Выб.Следующий() Тогда
			
			Сообщить("В этот период уже есть аналогичный документ " + Выб.Ссылка);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ПараметрыНастройкиKPI.Период,
	|	ПараметрыНастройкиKPI.ПараметрыДляKPI,
	|	ПараметрыНастройкиKPI.Значение,
	|	ПараметрыНастройкиKPI.Документ
	|ИЗ
	|	РегистрСведений.ПараметрыНастройкиKPI КАК ПараметрыНастройкиKPI
	|ГДЕ
	|	ПараметрыНастройкиKPI.Документ = &Док");
	
	Запрос.УстановитьПараметр("Док",ЭтотОбъект.Ссылка);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		
		МЗ=РегистрыСведений.ПараметрыНастройкиKPI.СоздатьМенеджерЗаписи();
		МЗ.Период=Выб.Период;
		МЗ.ПараметрыДляKPI=Выб.ПараметрыДляKPI;
		МЗ.Прочитать();
		МЗ.Удалить();
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ПланыПоKPI
	Если ПустаяСтрока(ЭтотОбъект.ПодразделениеКомпании) Тогда
		Отказ=истина;
		Сообщить("Не заполнено подразделение компании");
		Возврат;
	КонецЕсли;
	
	Если Не  ПроверитьСостав(истина,истина) Тогда
		Сообщить("Документ не проведен");
		Отказ=истина;
		Возврат;
	КонецЕсли;
	
	Движения.ПлановыеЗначенияKPI.Записывать = Истина;
	Движения.ПлановыеЗначенияKPI.Очистить();
	
	Для Каждого ТекСтрокаПланыKPI Из НаборыKPIДляРасчетаПлана Цикл
		
		Движение = Движения.ПлановыеЗначенияKPI.Добавить();
		Движение.Период = ПериодПланирования;
		Движение.Должность = ТекСтрокаПланыKPI.Должность;
		Движение.Категория = ТекСтрокаПланыKPI.Категория;
		Движение.KPI = ТекСтрокаПланыKPI.KPI;
		Движение.Периодичность = Периодичность;
		Движение.План = ТекСтрокаПланыKPI.План;
		Движение.БазоваяЧасть=Ложь;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация = Организация;
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаПланыБЧ Из ПланыБЧ Цикл
		
		Движение = Движения.ПлановыеЗначенияKPI.Добавить();
		Движение.Период = ПериодПланирования;
		Движение.Должность = ТекСтрокаПланыБЧ.Должность;
		Движение.Категория = ТекСтрокаПланыБЧ.Категория;
		Движение.KPI = ТекСтрокаПланыБЧ.БазоваяЧасть;
		Движение.Периодичность = Периодичность;
		Движение.План = ТекСтрокаПланыБЧ.План;
		Движение.БазоваяЧасть=истина;
		Движение.ПодразделениеКомпании=ПодразделениеКомпании;
		Движение.Организация = Организация;
		
		Если НЕ ПустаяСтрока(ТекСтрокаПланыБЧ.СвязанныйПараметрKPI) Тогда
			
			МЗ=РегистрыСведений.ПараметрыНастройкиKPI.СоздатьМенеджерЗаписи();
			МЗ.Период=ПериодПланирования;
			МЗ.ПараметрыДляKPI=ТекСтрокаПланыБЧ.СвязанныйПараметрKPI;
			МЗ.Значение=ТекСтрокаПланыБЧ.План;
			МЗ.Документ=ЭтотОбъект.Ссылка;
			МЗ.Записать();
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьСостав(ВыводитьИнфо=ложь,ПроверятьНоль=ложь,Инфо="") Экспорт
	
	Было=НаборыKPIДляРасчетаПлана.Выгрузить();
	БылоБЧ=ПланыБЧ.Выгрузить();
	Было.Колонки.Добавить("КС");
	БылоБЧ.Колонки.Добавить("КС");
	Было.ЗаполнитьЗначения(-1,"КС");
	БылоБЧ.ЗаполнитьЗначения(-1,"КС");
	
	Если Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(ПериодПланирования);
		КонПериода=КонецМесяца(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(ПериодПланирования);
		КонПериода=КонецКвартала(ПериодПланирования);
	ИначеЕсли   Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(ПериодПланирования);
		КонПериода=КонецГода(ПериодПланирования);
	Иначе 
		
		#Если Клиент Тогда
			Сообщить("Неверная периодичность");
		#КонецЕсли
		
		Возврат истина;
		
	КонецЕсли;
	
	Для Каждого ТекСтр из Должности Цикл
		
		ЗаполнитьДляДолжностиВТ(ТекСтр.Должность,КонПериода,Было,БылоБЧ,ТекСтр.Категория);
		
	КонецЦикла;
	
	Проверка=истина;
	
	Было.Свернуть("Должность,Категория,KPI","КС, План");
	
	БылоБЧ.Свернуть("Должность,Категория,БазоваяЧасть","КС,План");
	
	Для Каждого ТекСтр из Было Цикл
		
		Если ТекСтр.КС<>0 Тогда
			Если ВыводитьИнфо Тогда
				Инфо=Инфо+?(ТекСтр.КС<0,"Лишний "," Отсутствует ")+"Смарт задачи: "+ТекСтр.KPI+ " у должности "+ТекСтр.Должность+ ?(НЕ ЗначениеЗаполнено(ТекСтр.Категория),""," с категорией "+ТекСтр.Категория)+Символы.ПС;
			КонецЕсли;
			
			Проверка=ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТекСтр из БылоБЧ Цикл
		
		Если ТекСтр.КС<>0 Тогда
			Если ВыводитьИнфо Тогда
				Инфо=Инфо+?(ТекСтр.КС<0,"Лишний "," Отсутствует ")+"Целевые показатели: "+ТекСтр.БазоваяЧасть+" у должности "+ТекСтр.Должность+ ?(НЕ ЗначениеЗаполнено(ТекСтр.Категория),""," с категорией "+ТекСтр.Категория)+Символы.ПС;
			КонецЕсли;
			Проверка=ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПроверятьНоль Тогда
		Проверка=ПроверитьНоль(Было,БылоБЧ,Проверка,ВыводитьИнфо);
	КонецЕсли;
	
	Сообщить(Инфо);
	
	Возврат Проверка;
	
КонецФункции

Функция ПроверитьНоль(Было,БылоБЧ,Проверка,ВыводитьИнфо=ложь) Экспорт
	
	Для Каждого ТекСтр из Было Цикл
		Если ТекСтр.План=0 Тогда
			Если ВыводитьИнфо Тогда
				Сообщить("Не заполнено значение плана по Смарт задаче: "+ТекСтр.KPI+ " у должности "+ТекСтр.Должность);
			КонецЕсли;
			Проверка=ложь;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтр из БылоБЧ Цикл
		Если ТекСтр.План=0 Тогда
			Если ВыводитьИнфо Тогда
				Сообщить("Не заполнено значение плана по Целевым показателям: "+ТекСтр.БазоваяЧасть+" у должности "+ТекСтр.Должность);
			КонецЕсли;
			Проверка=ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Проверка;
	
КонецФункции

Процедура ЗаполнитьДляДолжностиВТ(Долж,КонПериода,ТабKPI,ТабБЧ,мКатегория)
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период КАК Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность", Долж);
	Запрос.УстановитьПараметр("Категория", мКатегория);
	Запрос.УстановитьПараметр("Дата", КонПериода);
	Запрос.УстановитьПараметр("Периодичность", Периодичность);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ПослПериод=Выб.Период;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СоставKPI.Должность,
	|	СоставKPI.Категория,
	|	СоставKPI.KPI,
	|	СоставKPI.Вес,
	|	СоставKPI.Период
	|ИЗ
	|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
	|ГДЕ
	|	СоставKPI.Должность = &Должность
	|	И СоставKPI.Категория = &Категория
	|	И СоставKPI.Периодичность = &Периодичность
	|	И СоставKPI.Период = &Период
	|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ СоставKPI.KPI.НетПлана
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоставKPI.Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность",Долж);
	Запрос.УстановитьПараметр("Категория",мКатегория);
	Запрос.УстановитьПараметр("Дата",КонПериода);
	Запрос.УстановитьПараметр("Периодичность",Периодичность);
	Запрос.УстановитьПараметр("Период",ПослПериод);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Нов=ТабKPI.Добавить();
		Нов.KPI=Выб.KPI;
		Нов.Должность=Выб.Должность;
		Нов.Категория=мКатегория;
		Нов.КС=1;
	КонецЦикла;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЦелевыеПоказатели.Период КАК Период,
	|	ЦелевыеПоказатели.Должность,
	|	ЦелевыеПоказатели.Категория,
	|	ЦелевыеПоказатели.Периодичность,
	|	ЦелевыеПоказатели.БазоваяЧасть
	|ИЗ
	|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
	|ГДЕ
	|	ЦелевыеПоказатели.Должность = &Должность
	|	И ЦелевыеПоказатели.Категория = &Категория
	|	И ЦелевыеПоказатели.Периодичность = &Периодичность
	|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	Запрос.УстановитьПараметр("Должность",Долж);
	Запрос.УстановитьПараметр("Категория",мКатегория);
	Запрос.УстановитьПараметр("Дата",КонПериода);
	Запрос.УстановитьПараметр("Периодичность",Периодичность);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);	
	
	Выб=Запрос.Выполнить().Выбрать();
	
	ПослПериод=Дата("01.01.01 00:00:00");
	
	Выб=Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		ПослПериод=Выб.Период;
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ЦелевыеПоказатели.Период КАК Период,
	|	ЦелевыеПоказатели.Должность,
	|	ЦелевыеПоказатели.Категория,
	|	ЦелевыеПоказатели.Периодичность,
	|	ЦелевыеПоказатели.БазоваяЧасть
	|ИЗ
	|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
	|ГДЕ
	|	ЦелевыеПоказатели.Должность = &Должность
	|	И ЦелевыеПоказатели.Категория = &Категория
	|	И ЦелевыеПоказатели.Периодичность = &Периодичность
	|	И ЦелевыеПоказатели.Период = &Период
	|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
	|	И НЕ ЦелевыеПоказатели.БазоваяЧасть.НетПлана
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Должность",Долж);
	Запрос.УстановитьПараметр("Категория",мКатегория);
	Запрос.УстановитьПараметр("Дата",КонПериода);
	Запрос.УстановитьПараметр("Периодичность",Периодичность);
	Запрос.УстановитьПараметр("Период",ПослПериод);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",ПодразделениеКомпании);
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Если ТипЗнч(Выб.БазоваяЧасть)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
			Нов=ТабБЧ.Добавить();
			Нов.БазоваяЧасть=Выб.БазоваяЧасть;
			Нов.Должность=Долж;
			Нов.Категория=мКатегория;
			Нов.КС=1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
