#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ИзвлечениеТоваровИзПроизводства" , "Извлечение товаров из производства");
	СтруктураМакетов.Вставить("ТОРГ13"                          , "ТОРГ-13 (накладная на внутреннее перемещение)");
	СтруктураМакетов.Вставить("Т1"                              , "1-Т (Товарно-транспортная накладная)");
	СтруктураМакетов.Вставить("Приложение4"                     , "Приложение №4 (Транспортная накладная)");
	СтруктураМакетов.Вставить("ЭтикетокИЦенников"               , "Печать этикеток и ценников");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти