
#Область КомандыФормы

&НаКлиенте
Процедура ПодключитьсяКСервису(Команда)
	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.ПодключениеКСервису",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Авторизация(Команда)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ОткрытьФормуМодально("Обработка.атПомощникПродаж.Форма.АвторизацияПользователя",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступом(Команда)
	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.УправлениеДоступом",, ЭтаФорма);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СервисДоступенНаСервере()
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ПараметрыСеанса.атКодСостояния = 0;
	атСервер.ИнициализироватьКодСостояния();
	атСервер.СервисДоступен(, Истина); // Требуется Пинг сервера
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьСервиса(Команда)
	
	СервисДоступенНаСервере();
	
	ЗаполнитьДанныеСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаСтарт(Команда)
	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.Старт");
КонецПроцедуры


&НаСервереБезКонтекста
Функция СохранитьПараметрыСервисаНаСервере(Знач ПараметрыСервиса=Неопределено, Знач ИспользоватьИнтеграцию=Неопределено, ЗначенияПрав)
	
	ЕстьИзменения = Ложь;
	
	Если ПараметрыСервиса <> Неопределено Тогда
		Для Каждого КлючЗначение Из ПараметрыСервиса Цикл
			
			СтароеЗначение = атСервер.ПолучитьНастройку("Партнер", КлючЗначение.Ключ);
			Если СтароеЗначение <> КлючЗначение.Значение Тогда
				ЕстьИзменения = Истина;
				атСервер.ЗаписатьНастройку("Партнер", КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ИспользоватьИнтеграцию <> Неопределено Тогда
		СтароеИспользоватьИнтеграцию = обПраво("атИспользоватьИнтеграцию");
		Если СтароеИспользоватьИнтеграцию <> ИспользоватьИнтеграцию Тогда
			ЕстьИзменения = Истина;
			атСервер.СохранитьПравоНастройку(Неопределено, ПредопределенноеЗначение("ПланВидовХарактеристик.ПраваИНастройки.атИспользоватьИнтеграцию"), ИспользоватьИнтеграцию, ЗначенияПрав);
		КонецЕсли;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		сфЗаписатьДанныеСеансаОбновитьПрава();
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции
 

&НаКлиенте
Процедура СохранитьПараметрыСервиса(Команда)
	
	Модифицированность = Ложь;
	Элементы.СохранитьПараметрыСервиса.Доступность = Ложь;
	
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("АдресСервиса", атАдресСервиса);
	ПараметрыСервиса.Вставить("ПортСервиса", атПортСервиса);
	ПараметрыСервиса.Вставить("ПользовательПартнера", атЛогин);
	ПараметрыСервиса.Вставить("ПарольПартнера", атПароль);
	
	Если СохранитьПараметрыСервисаНаСервере(ПараметрыСервиса, атИспользоватьИнтеграцию, глПрава) Тогда
		СервисДоступенНаСервере();
		ЗаполнитьДанныеСервиса();
		
		// Для остальных форм оповестим
		Оповестить("ОбновитьПрава", ПараметрыСеанса.Пользователь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеСервиса()
	
	атЛогин = атСервер.ПолучитьНастройку("Партнер", "ПользовательПартнера");
	атПароль = атСервер.ПолучитьНастройку("Партнер", "ПарольПартнера");
	
	атИспользоватьИнтеграцию = обПраво("атИспользоватьИнтеграцию");
	
	КодСостояния = ПараметрыСеанса.атКодСостояния;
	
	СтатусСервера = Цел(КодСостояния/10);
	//(0, "Сервис не используется");
	//(1, "Не указаны параметры партнера"); // Партнер еще не подключен к сервису?
	//(2, "Параметры партнера заполнены"); // Статус сервера не проверялся
	//(3, "Сервер не доступен"); // Пинг не прошел
	//(4, "Сервис доступен"); // Ок, Пинг партнера прошел
	//(5, "Ошибка данных партнера"); // Err, Пинг партнера не прошел
	//(6, "Доступ запрещен"); // Err, Пинг партнера прошел, Доступ запрещен
	
	СтатусПользователя = КодСостояния%10;
	//(0, "Запрещено использование");
	//(1, "Не указан логин");
	//(2, "Сохранен логин");
	//(3, "Авторизован"); // Ок
	//(4, "Отказ от авторизации");
	//(5, "Ошибка авторизации"); // Err
	
	СтруктураСтатусаСервера = атПовторноеИспользование.ОписаниеСтатусаСервера(СтатусСервера);
	Элементы.СтатусСервиса.Заголовок = СтруктураСтатусаСервера.Заголовок;
	Если СтруктураСтатусаСервера.Ошибка Тогда
		Элементы.СтатусСервиса.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
	Иначе
		Элементы.СтатусСервиса.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	КонецЕсли;
	
	СтруктураСтатусаПользователя = атПовторноеИспользование.ОписаниеСтатусаПользователя(СтатусПользователя);
	Элементы.СтатусПользователя.Заголовок = СтруктураСтатусаПользователя.Заголовок;
	Если СтруктураСтатусаПользователя.Ошибка Тогда
		Элементы.СтатусПользователя.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
	Иначе
		Элементы.СтатусПользователя.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	КонецЕсли;
	
	Элементы.Авторизация.Доступность = СтатусСервера = 4;
	
	ЭтоАдминистраторСервиса = (СтатусПользователя = 3) И ПараметрыСеанса.атДоступныеСервисы.Администратор;
	
	Элементы.ГруппаДемоДоступ.Видимость = СтатусСервера <= 1;
	Элементы.ПодключитьсяКСервису.Доступность = ЭтоАдминистатор;
	
	Элементы.ГруппаФормыОбработки.Видимость = СтатусСервера > 1;
	Элементы.ПараметрыТекущегоПользователя.Видимость = СтатусСервера > 1;
	
	Элементы.УправлениеСервисами.Видимость = ЭтоАдминистраторСервиса;
	
	СписокПодключенныхСервисов.Очистить();
	СписокПодключенныхУслуг.Очистить();
	СписокУслуг.Очистить();
	
	Если Не ЭтоАдминистраторСервиса Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка = "";
	Результат = атСервер.ПолучитьПодключенныеУслуги(Ошибка);
	
	Если Результат = Неопределено Тогда
		// это ошибка подключения
		Сообщить(Ошибка, СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	Сервисы = Результат.Сервисы;
	Для каждого ЭлементМассива Из Сервисы Цикл
		НоваяСтрока = СписокПодключенныхСервисов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		НоваяСтрока.Наименование = ЭлементМассива.Сервис.Наименование;
		НоваяСтрока.Код = ЭлементМассива.Сервис.Код;
	КонецЦикла;
	
	Услуги = Результат.Услуги;
	Для каждого ЭлементМассива Из Услуги Цикл
		НоваяСтрока = СписокПодключенныхУслуг.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		НоваяСтрока.Наименование = ЭлементМассива.ПакетУслуг.Наименование;
		НоваяСтрока.Код = ЭлементМассива.ПакетУслуг.Код;
	КонецЦикла;
	
	Результат = атСервер.ВыполнитьЗапрос("dictionaries", "ПакетыУслуг",, "Список", Истина, Ошибка);
	Если Результат = Неопределено Тогда
		Сообщить(Ошибка, СтатусСообщения.Внимание);
	Иначе
		Для Каждого ЭлементМассива Из Результат Цикл
			НоваяСтрока = СписокУслуг.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
	ТелоЗапроса = СокрЛП(атСервер.ПолучитьТекстСообщения(Новый Структура("Фильтр", Новый Структура("ДатаНачала", НачалоМесяца(ТекущаяДата()) ))));
	Результат = атСервер.ВыполнитьЗапрос("partner", "Статистика", ТелоЗапроса,,, Ошибка);
	Если Результат = Неопределено Тогда
		Сообщить(Ошибка, СтатусСообщения.Внимание);
	Иначе
		// пока не выводим лимиты, будем получать из статистики
		
		//СтруктураОтбора = Новый Структура("Код");
		//Для каждого СтрокаУслуги Из СписокПодключенныхУслуг Цикл
		//	ТелоЗапроса = СокрЛП(атСервер.ПолучитьТекстСообщения(Новый Структура("Отбор", Новый Структура("Код",СокрЛП(СтрокаУслуги.Код) ))));
		//	Результат = атСервер.ВыполнитьЗапрос("dictionaries", "ПакетыУслуг", ТелоЗапроса, "Объект",, Истина);
		//	
		//	Для каждого ОписаниеЛимита Из Результат.ЛимитыЗапросов Цикл
		//		//Результат.ЛимитыЗапросов[0].Сервис.Код;
		//		//ОписаниеЛимита.Сервис.Код;
		//		СтруктураОтбора.Вставить("Код", ОписаниеЛимита.Сервис.Код);
		//		НайденныеСтроки = СписокПодключенныхСервисов.НайтиСтроки(СтруктураОтбора);
		//		Если НайденныеСтроки.Количество() > 0 Тогда // можно обход по всем элементам сделать
		//			НайденныеСтроки[0].ЛимитМинута = НайденныеСтроки[0].ЛимитМинута + ОписаниеЛимита.ЛимитМинута;
		//			НайденныеСтроки[0].ЛимитЧас = НайденныеСтроки[0].ЛимитЧас + ОписаниеЛимита.ЛимитЧас;
		//			НайденныеСтроки[0].ЛимитДень = НайденныеСтроки[0].ЛимитДень + ОписаниеЛимита.ЛимитДень;
		//		КонецЕсли;
		//	КонецЦикла;
		//КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиСинхронизацииСловарей()
	
	//Для каждого СтрокаСловаря Из ТаблицаСловарей Цикл
	//	
	//	Если ПустаяСтрока(СтрокаСловаря.РеквизитСинхронизации) Тогда
	//		Элементы[СтрокаСловаря.Имя + "Автосинхронизация"].Видимость = Ложь;
	//		Элементы[СтрокаСловаря.Имя + "Автосоздание"].Видимость = Ложь;
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Автосинхронизация = атСервер.ПолучитьНастройку(СтрокаСловаря.Имя, "Автосинхронизация");
	//	Если Автосинхронизация = Неопределено Тогда
	//		Автосинхронизация = СтрокаСловаря.Автосинхронизация;
	//	КонецЕсли;
	//	
	//	Элементы[СтрокаСловаря.Имя + "Автосоздание"].Видимость = Автосинхронизация = Истина;
	//	
	//	Автосоздание = атСервер.ПолучитьНастройку(СтрокаСловаря.Имя, "Автосоздание");
	//	Если Автосоздание = Неопределено Тогда
	//		Автосоздание = СтрокаСловаря.Автосоздание <> Неопределено И СтрокаСловаря.Автосоздание;
	//	КонецЕсли;
	//	
	//	Элементы[СтрокаСловаря.Имя + "Автосоздание"].Доступность = СтрокаСловаря.Автосоздание <> Неопределено;
	//	
	//	ЭтаФорма[СтрокаСловаря.Имя + "Автосинхронизация"] = Автосинхронизация;
	//	ЭтаФорма[СтрокаСловаря.Имя + "Автосоздание"] = Автосоздание;
	//	
	//КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Описание = атПовторноеИспользование.ОписаниеСервиса();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ, Ошибка)
	
	Если ПараметрыСеанса.атКодСостояния%10 = 0 Тогда
		Ошибка = "Пользователю запрещено использовать сервис ""Помощник продаж"".";
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	атСервер.СервисДоступен(Ошибка, Ложь); // Принудительный Пинг сервера не требуется, только если сохранены логин и пароль!
	
	Если ПравоДоступа("Администрирование", Метаданные) Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(ПараметрыСеанса.Пользователь.Код));
		ЭтоАдминистатор = ПользовательИБ <> Неопределено И ПользовательИБ.Роли.Содержит(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
	Элементы.атИспользоватьИнтеграцию.Доступность = ЭтоАдминистатор;
	Элементы.атАдресСервиса.Доступность = ЭтоАдминистатор;
	Элементы.атПортСервиса.Доступность = ЭтоАдминистатор;
	Элементы.атЛогин.Доступность = ЭтоАдминистатор;
	Элементы.атПароль.Доступность = ЭтоАдминистатор;
	
	СписокВыбора = атПовторноеИспользование.АдресСервераСписокВыбора();
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		Элементы.атАдресСервиса.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
	Если атСервер.ПолучитьНастройку("Партнер", "АдресСервиса") = Неопределено Тогда
		// Первое открытие
		ВыбранноеЗначение = Элементы.атАдресСервиса.СписокВыбора[0].Значение;
		Поз_ = Найти(ВыбранноеЗначение, ":");
		Если Поз_ > 0 Тогда
			атАдресСервиса = СокрЛП(Лев(ВыбранноеЗначение, Поз_-1));
			атПортСервиса = Число(Сред(ВыбранноеЗначение, Поз_+1));
		Иначе
			атАдресСервиса = ВыбранноеЗначение;
			атПортСервиса = 80;
		КонецЕсли;
		атСервер.ЗаписатьНастройку("Партнер", "АдресСервиса", атАдресСервиса);
		атСервер.ЗаписатьНастройку("Партнер", "ПортСервиса", атПортСервиса);
	Иначе
		атАдресСервиса = атСервер.ПолучитьНастройку("Партнер", "АдресСервиса");
		атПортСервиса = атСервер.ПолучитьНастройку("Партнер", "ПортСервиса");
	КонецЕсли;
	
	ЗаполнитьДанныеСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Ошибка = "";
	ПриОткрытииНаСервере(Отказ, Ошибка);
	
	Если Отказ Тогда
		Если ЗначениеЗаполнено(Ошибка) Тогда
			Предупреждение(Ошибка);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Если пароль пользователя сохранен, то мы автоматически авторизуемся
	атКлиент.АвторизацияПройдена(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Функция ПолучитьОбъектНаСервере(Знач ИмяСловаря, Знач Код)
	Возврат атСервер.ПолучитьОбъект(ИмяСловаря, Код);
КонецФункции

&НаКлиенте
Процедура СписокПодключенныхСервисовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = СписокПодключенныхСервисов.Получить(ВыбраннаяСтрока);
	Код = ТекСтрока.Код;
	
	Результат = ПолучитьОбъектНаСервере("Сервисы", Код);
	
	//Если ТекСтрока.Наименование = "Веб прайс-листы" и ЭтоАдминистатор Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьВебПрайсЛисты", Новый Структура("Описание", Результат.Описание), ЭтаФорма, "ВебПрайсЛисты");
	//Иначе
		ОткрытьФормуМодально("Обработка.атПомощникПродаж.Форма.ОписаниеОбъекта", Новый Структура("Описание", Результат.Описание), ЭтаФорма);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = СписокУслуг.Получить(ВыбраннаяСтрока);
	Код = ТекСтрока.Код;
	
	Результат = ПолучитьОбъектНаСервере("ПакетыУслуг", Код);
	
	// открыть форму работы с планом
	// Результат.Описание - описание
	// кнопка ПодключитьУслугу
	ОткрытьФормуМодально("Обработка.атПомощникПродаж.Форма.ОписаниеОбъекта", Новый Структура("Описание, ПодключатьУслуги, ТаблицаЛимитов", Результат.Описание, ЭтоАдминистатор, Результат.ЛимитыЗапросов), ЭтаФорма);
	//Оповестить("атПомощникПродаж_ОписаниеОбъекта_ПриОткрытии", Новый Структура("Описание, ПодключатьУслуги, ТаблицаЛимитов", Результат.Описание, ЭтоАдминистатор, Результат.ЛимитыЗапросов), "АдминистрированиеСервиса");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаСловаря(Элемент)
	
	СтрокиСловарей = ТаблицаСловарей.НайтиСтроки(Новый Структура("Имя", Элемент.Имя));
	Если СтрокиСловарей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСловаря = СтрокиСловарей[0];
	ФормаСписка = СтрокаСловаря.ФормаСписка;
	ОткрытьФорму("Обработка.атПомощникПродаж.Форма."+ФормаСписка, Новый Структура("ТекущаяСтраница", Элемент.Имя), ЭтаФорма, Элемент.Имя);
	
	//Если Элемент.Имя = "Пользователи" Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьПользователи",, ЭтаФорма);
	//ИначеЕсли Элемент.Имя = "ВебПрайсЛисты" Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьВебПрайсЛисты",, ЭтаФорма, "ВебПрайсЛисты");
	//ИначеЕсли Элемент.Имя = "ТипыНоменклатуры" Или Элемент.Имя = "ВидыСвойств" Или Элемент.Имя = "ЗначенияСвойств" Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьТипыНоменклатуры",, ЭтаФорма, "ТипыНоменклатуры");
	//ИначеЕсли Элемент.Имя = "Производители" Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьПроизводители",, ЭтаФорма, "Производители");
	//ИначеЕсли Элемент.Имя = "Номенклатура" Тогда
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.СловарьНоменклатура",, ЭтаФорма);
	//Иначе
	//	// общая форма
	//	ОткрытьФорму("Обработка.атПомощникПродаж.Форма.Словари", Новый Структура("ТекущаяСтраница", Элемент.Имя), ЭтаФорма, Элемент.Имя);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СловариПараметрыСинхронизацииПриИзменении(Элемент)
	
	Если Найти(Элемент.Имя, "Автосинхронизация") > 0 Тогда
		ИмяСловаря = СтрЗаменить(Элемент.Имя, "Автосинхронизация","");
		ВидНастройки = "Автосинхронизация";
		
		Элементы[ИмяСловаря + "Автосоздание"].Видимость = ЭтаФорма[Элемент.Имя];
		
	ИначеЕсли Найти(Элемент.Имя, "Автосоздание") > 0 Тогда
		ИмяСловаря = СтрЗаменить(Элемент.Имя, "Автосоздание","");
		ВидНастройки = "Автосоздание";
		
	Иначе
		Возврат;
	КонецЕсли;
	
	атСервер.ЗаписатьНастройку(ИмяСловаря, ВидНастройки, ЭтаФорма[Элемент.Имя]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "атПомощникПродаж_Авторизация"
		ИЛИ (ИмяСобытия = "ОбновитьПрава" И Параметр = ПараметрыСеанса.Пользователь) Тогда
		
		ЗаполнитьДанныеСервиса();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатистикаСервиса(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьУслугу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьУслугу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура атАдресСервисаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поз_ = Найти(ВыбранноеЗначение, ":");
	Если Поз_ > 0 Тогда
		атАдресСервиса = СокрЛП(Лев(ВыбранноеЗначение, Поз_-1));
		атПортСервиса = Число(Сред(ВыбранноеЗначение, Поз_+1));
	Иначе
		атАдресСервиса = ВыбранноеЗначение;
		атПортСервиса = 80;
	КонецЕсли;
	Модифицированность = Истина;
	Элементы.СохранитьПараметрыСервиса.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПартнераПриИзменении(Элемент)
	Модифицированность = Истина;
	Элементы.СохранитьПараметрыСервиса.Доступность = Истина;
	//Элементы.атАдресСервиса.Доступность = атИспользоватьИнтеграцию;
	//Элементы.атЛогин.Доступность = атИспользоватьИнтеграцию;
	//Элементы.атПароль.Доступность = атИспользоватьИнтеграцию;
	//Элементы.атПортСервиса.Доступность = атИспользоватьИнтеграцию;
КонецПроцедуры

#КонецОбласти