
Процедура ПриЗаписи(Отказ)
	Если AB_ОбщийМодульАльфаБанкСервер.ПроверитьДоступностьТерминала(ЭтотОбъект.Ссылка) = Неопределено Тогда
		НоваяЗапись = РегистрыСведений.AB_РаботаСТерминаломАльфаБанк.СоздатьМенеджерЗаписи();
		НоваяЗапись.Терминал = ЭтотОбъект.Ссылка;
		НоваяЗапись.Организация = ЭтотОбъект.Ссылка.Организация;
		НоваяЗапись.ПодразделениеКомпании = ЭтотОбъект.Ссылка.ПодразделениеКомпании;
		НоваяЗапись.Статус = Перечисления.AB_СтатусыТерминаловАльфабанк.Открыт;
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.Записать();
	КонецЕсли;
КонецПроцедуры
