//       tehno-temp-krasnodar
//       aCgt3NyMZi2DHEjdZ7sP
//      tehno-temp-krasnodar-sandbox
// 		Ut4n2xttJjNRDrehm6P2
Функция ПолучитьНастройкиВыгрузи(ДатВыгрузки)
	
	ДанныеКонстанты = Константы.CMExpertНастройки.Получить().Получить();
	Если ДанныеКонстанты = Неопределено Тогда
		ДанныеКонстанты = Новый Структура("ДатаПоследнейВыгрузки, ИдентификаторДилера, Логин, Пароль, Склад, ВнутренниеКонтрагенты");
	КонецЕсли;
	нДанные = Новый Структура("ДатаПоследнейВыгрузки, ИдентификаторДилера, Логин, Пароль, Склад, ВнутренниеКонтрагенты");
	ЗаполнитьЗначенияСвойств(нДанные, ДанныеКонстанты);
	нДанные.ДатаПоследнейВыгрузки = ДатВыгрузки;
	Константы.CMExpertНастройки.Установить(Новый ХранилищеЗначения(нДанные));
	
	Возврат ДанныеКонстанты;
	
КонецФункции

Процедура ПолучитьДилеров(ДатВыгрузки = Неопределено) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДатВыгрузки) Тогда
		ДатВыгрузки = ТекущаяДата();
	КонецЕсли;
	
	НастройкиВыгрузи = ПолучитьНастройкиВыгрузи(ДатВыгрузки);
	
	//Получу Соединение
	Соединение = ПолучитьСоединениеCMExpert(НастройкиВыгрузи);
	
	//Получу токен
	Токен = ПолучитьAccessToken(Соединение);
	
	Запрос = ПолучитьЗапросHTTP_ПолучениеДилеров(Токен, "", НастройкиВыгрузи);
	
	Результат = Соединение.Получить(Запрос);
	
	Данные=Результат.ПолучитьТелоКакСтроку();
	
	//СтруктураДанных = ПолучитьОбъектИзJSON(Данные);
	
	Сообщить(Данные);

КонецПроцедуры

Функция GetCar(ДатВыгрузки = Неопределено, Код="") Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ДатВыгрузки) Тогда
		ДатВыгрузки = ТекущаяДата();
	КонецЕсли;
	
	НастройкиВыгрузи = ПолучитьНастройкиВыгрузи(ДатВыгрузки);
	
	//Получу Соединение
	Соединение = ПолучитьСоединениеCMExpert(НастройкиВыгрузи);
	
	//Получу токен
	Токен = ПолучитьAccessToken(Соединение);
	
	Запрос = ПолучитьЗапросHTTP_GET_Car(Токен, НастройкиВыгрузи, Код);
	
	Результат = Соединение.Получить(Запрос);
	
	Данные=Результат.ПолучитьТелоКакСтроку();
	
	//СтруктураДанных = ПолучитьОбъектИзJSON(Данные);
	
	Сообщить("GET_CAR: "+Данные);

	Возврат Данные;
	
КонецФункции

Процедура ВыгрузитьДанные(ДатВыгрузки = Неопределено, Остатки=Ложь, Автомобиль=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатВыгрузки) Тогда
		ДатВыгрузки = ТекущаяДата();
	КонецЕсли;
	
	НастройкиВыгрузи = ПолучитьНастройкиВыгрузи(ДатВыгрузки);
	
	Если Остатки Тогда
		РезультатЗапроса = ПолучитьДанныеДляВыгрузкиОстатки(ДатВыгрузки, НастройкиВыгрузи.ДатаПоследнейВыгрузки, НастройкиВыгрузи.Склад, НастройкиВыгрузи.ИдентификаторДилера, НастройкиВыгрузи.ВнутренниеКонтрагенты);
	Иначе
		РезультатЗапроса = ПолучитьДанныеДляВыгрузки(ДатВыгрузки, НастройкиВыгрузи.ДатаПоследнейВыгрузки, НастройкиВыгрузи.Склад, НастройкиВыгрузи.ИдентификаторДилера, НастройкиВыгрузи.ВнутренниеКонтрагенты, Автомобиль);
	КонецЕсли;
		
	//Подготовлю данные
	МассивДанных = ПолучитьПодготовленныеДанные(РезультатЗапроса);
	
	//Получу Соединение
	Соединение = ПолучитьСоединениеCMExpert(НастройкиВыгрузи);
	
	//Получу токен
	Токен = ПолучитьAccessToken(Соединение);
	
	Для Каждого ДанныеВыгрузки Из МассивДанных Цикл
		
		//Получу запрос
		Метод = ДанныеВыгрузки.Метод;
		СтатусМашины = ?(ДанныеВыгрузки.Свойство("stockState"), ДанныеВыгрузки.stockState, "in");
		Авто = ДанныеВыгрузки.Автомобиль;
		Запрос = ПолучитьЗапросHTTP(Токен, ДанныеВыгрузки, НастройкиВыгрузи, Метод);
		
		//anton
		//Возврат;                               
		//anton
		                                          
		//Выполню запрос
		Если Метод = "Перечисления.МетодыHTTP.PUT" Тогда
			Результат = Соединение.Записать(Запрос);
		ИначеЕсли Метод = "Перечисления.МетодыHTTP.PATCH" Тогда
			//Результат = Соединение.Записать(Запрос);
			Результат = Соединение.Изменить(Запрос);
		ИначеЕсли Метод = "Перечисления.МетодыHTTP.DELETE" Тогда
			Результат = Соединение.Удалить(Запрос);
		ИначеЕсли Метод = "Перечисления.МетодыHTTP.GET" Тогда
			Результат = Соединение.Получить(Запрос);
		КонецЕсли;		
		
		Если Результат.КодСостояния <> 200 И Результат.КодСостояния <> 201 Тогда
			ТекстОтвета=Результат.ПолучитьТелоКакСтроку();
			
			ЗаписатьОшибку("Ошибка отправки данных:
			|Ответ:
			|" + ТекстОтвета + "
			|Запрос:
			|" + Запрос.ПолучитьТелоКакСтроку());
			
			Сообщить(ТекстОтвета);
			
		Иначе
			ЗаписатьДанныеОВыгрузке(Авто, Запрос.ПолучитьТелоКакСтроку(), СтатусМашины, ДатВыгрузки);
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаписатьОшибку(ОписаниеОшибки)
	
	Сообщить(ОписаниеОшибки);
	ЗаписьЖурналаРегистрации(	"CM Expert", 
								УровеньЖурналаРегистрации.Ошибка,
								,
								,
								ОписаниеОшибки);
								
КонецПроцедуры

Процедура ЗаписатьДанныеОВыгрузке(Автомобиль, ДанныеВыгрузки, Метод, ДатаВыгрузки)
	
	//Удалить
	Набор = РегистрыСведений.CMExpert_ИсторияОбмена.СоздатьНаборЗаписей();
	Набор.Отбор.Автомобиль.Установить(Автомобиль);
	
	//Если Метод <> "out" Тогда
		//Добавить Обновить
		Запись = Набор.Добавить();
		Запись.Автомобиль = Автомобиль;
		Запись.ДатаВыгрузки = ДатаВыгрузки;
		Запись.ВыгруженныеДанные = ДанныеВыгрузки;
	//КонецЕсли;
	
	Набор.Записать();
	
КонецПроцедуры

Функция ПолучитьПодготовленныеДанные(Данные)
	
	Рез = Новый Массив;
	
	УдаляемыеСвойства = "dealerId,createdAt,updatedAt,brand,model,generation,saleAt,inStockPeriod,markupPercent,pendingPriceSetAt,
	|pendingPriceSetBy ,lastPublishedPrice,publishedActualPricesDiscount,sellingPriceSetById,sellingPriceSetBy,expenses,
	|lastPriceChangedAt,publishedDays,publishStatus,publishStartedAt,publishFinishedAt,similarCarsTotal,similarCarsMedianPrice, 
	|similarCarsAdjustedPrice,similarCarsAvgMillage,expensesPercent,markupPotential,sellingPricePercent,marketPricesRating,
	|marketPricesMileageRating,priceMileageCategory,priceCategory,complexMdsDays,complexEstimate,avgImpressionsPerDay,
	|attentionSimilarCarsTotal,attentionRating,attentionCategory,priceIsEmpty,priceOutOfTarget,attentionOutOfTarget,tooLongSelling,
	|tooLongSamePrice,smallMarket,salesTactic,dealer,acceptanceDealer,requiresFillingForPublication,requiresFillingForAccounting,
	|pendingSimilarCarsTotal,pendingPricePercent,pendingMarketPricesRating,pendingMarketPricesMileageRating,pendingPriceCategory,
	|pendingPriceMileageCategory,appraisedBy,appraisalInitializedBy,soldBy,totalCallCount,recentDaysCallCount,startedSaleAt,
	|standardAutoCheckId,groi,groiCategory,profitPotentialPercent,salePeriod";
	
	СтруктураДляУдаления=Новый Структура(УдаляемыеСвойства);	
	
	//СравниваемыеСвойства = "vehicleType,sellingPrice,repairCost,year,mileage,body,gear,drive,engine,volume,power,dealerId";	
	СравниваемыеСвойства = "stockState,sellingPrice,repairCost,mileage";
	ОснСтруктураСравнения = Новый Структура(СравниваемыеСвойства);
	
	Для Каждого Стр Из Данные Цикл
		
		ДанныеDmsCar = ПодготовитьОбъектDmsCar(Стр);
		//ДанныеDmsCar.id = Число(ВыделитьНужныеСимволыВСтроке(ДанныеDmsCar.id, "0123456789", Ложь));
		
		Если Стр.stockState = "out" Тогда
			
			ДанныеDmsCar.Вставить("outReason", Стр.outReason);
			ДанныеDmsCar.Вставить("outAt", Формат(Стр.outAt,"ДФ=yyyy-MM-ddTHH:mm:ssZ"));
			
		КонецЕсли;	
		
		//Если ЗначениеЗаполнено(Стр.ВыгруженныеДанные) Тогда
			
			//anton
			//СтарыеДанные = ЗаполнитьСтруктуруИзОтветаJSON(Стр.ВыгруженныеДанные);
			//anton			
			//СтарыеДанные.dealerId = СтрЗаменить(Строка(СтарыеДанные.dealerId), Символы.НПП, "");
			//
			//ДанныеDmsCar.dealerId = СтарыеДанные.dealerId;
			//
		ЗаполнитьЗначенияСвойств(ОснСтруктураСравнения, Стр);
			
			//Если СтруктурыРавны(ОснСтруктураСравнения, СтарыеДанные) Тогда			
			//	//В данных ничего не изменилось, идем дааальше
			//	Продолжить;
			//КонецЕсли;
			
		ДанныеDmsCar.Вставить("stockState", Стр.StockState);						;
			
		//КонецЕсли;
		
		ДанныеDmsCar.Вставить("Автомобиль", Стр.Автомобиль);
		
		Если ДанныеDmsCar.sellingPrice=0 Тогда
			ДанныеDmsCar.Удалить("sellingPrice");
		КонецЕсли;
		
		ДанныеDmsCar.arrivedAt = Формат(ДанныеDmsCar.arrivedAt,"ДФ=yyyy-MM-ddTHH:mm:ssZ");
		
		//ПРОВЕРКА НА НАЛИЧИЕ ДАННЫХ
		Попытка
			ТекущиеДанныеCmExpert = GetCar(,ДанныеDmsCar.Автомобиль.Код);
		Исключение
			Продолжить;
		КонецПопытки;
		
		//PUT если машина не найдена.
		Если Найти(ТекущиеДанныеCmExpert,"DmsCar was not found")>0 Тогда
			ДанныеDmsCar.Вставить("Метод", "Перечисления.МетодыHTTP.PUT");											
			Рез.Добавить(ДанныеDmsCar);
			Продолжить; 
		КонецЕсли;		
		
		//Если найдена, изменим
		СтруктураДанных = ЗаполнитьСтруктуруИзОтветаJSON(ТекущиеДанныеCmExpert);
		
		Если СтруктурыРавны(ОснСтруктураСравнения, СтруктураДанных) Тогда			
			//В данных ничего не изменилось, идем дааальше
			Продолжить;
		КонецЕсли;
		
		//Удалим Read-only 		
		Для каждого Эл Из СтруктураДляУдаления Цикл
			СтруктураДанных.Удалить(Эл.Ключ);
		КонецЦикла;
		
		//Вернем ебучие запятые
		Для каждого ЭлементExpert Из СтруктураДанных Цикл			
			Если ТипЗнч(ЭлементExpert.Значение)= Тип("Строка") Тогда
				СтруктураДанных[ЭлементExpert.Ключ]=СтрЗаменить(СтруктураДанных[ЭлементExpert.Ключ],"****",",");
				СтруктураДанных[ЭлементExpert.Ключ]=СтрЗаменить(СтруктураДанных[ЭлементExpert.Ключ],"@@@@","[");
				СтруктураДанных[ЭлементExpert.Ключ]=СтрЗаменить(СтруктураДанных[ЭлементExpert.Ключ],"&&&&","]");				
			КонецЕсли;
			
			Попытка 
				ПреобразованноеЗначение=Число(СтруктураДанных[ЭлементExpert.Ключ]);
				СтруктураДанных[ЭлементExpert.Ключ]=Формат(ПреобразованноеЗначение, "ЧРД=.; ЧГ=");
			Исключение
			КонецПопытки;
			
			//Удалим null		
			Если ЭлементExpert.Значение="null" Тогда
				СтруктураДанных.Удалить(ЭлементExpert.Ключ);				
			КонецЕсли;
		КонецЦикла;
		
		Для каждого ЭлементDms из СтруктураДанных Цикл
			
			Если ДанныеDmsCar.Свойство(ЭлементDms.Ключ) Тогда //Есть ли ключ
				
				Если СтрЗаменить(Строка( ДанныеDmsCar[ЭлементDms.Ключ])," ","") <> СтруктураДанных[ЭлементDms.Ключ] Тогда  //и не равен
					
					Если ЭлементDms.Ключ="sellingPrice"  Тогда
						Если СтруктураДанных[ЭлементDms.Ключ]=Неопределено ИЛИ 
							СтруктураДанных[ЭлементDms.Ключ]=null ИЛИ
							СтруктураДанных[ЭлементDms.Ключ]=0 Тогда 
							СтруктураДанных[ЭлементDms.Ключ]=ДанныеDmsCar[ЭлементDms.Ключ];	
						КонецЕсли;
					Иначе
						СтруктураДанных[ЭлементDms.Ключ]=ДанныеDmsCar[ЭлементDms.Ключ];	
					КонецЕсли; 
					
				КонецЕсли;
			Иначе
				СтруктураДанных.Удалить(ЭлементDms.Ключ);													
			КонецЕсли;	
			
		КонецЦикла;
		
		


		СтруктураДанных.Вставить("Метод", "Перечисления.МетодыHTTP.PATCH");
		СтруктураДанных.Вставить("Автомобиль", Стр.Автомобиль);
		
		Рез.Добавить(СтруктураДанных);
		Продолжить;
		
		
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

//backup
Функция ПолучитьДанныеДляВыгрузкиСтар(ДатаВыгрузки, ДатаПоследнейВыгрузки, Склад, dealerId, ВнутренниеКонтрагенты)
	
	//ТекстОтбора="";
	//Если ЗначениеЗаполнено(Автомобиль) Тогда
	//	ТекстОтбора=ТекстОтбора+"
	//	|ГДЕ
	//	|	ВТ_Остатки.Автомобиль = &Автомобиль ";	
	//КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиАвтомобилейОбороты.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль) КАК Автомобиль,
	|	&DealerID КАК dealerId,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|				ТОГДА -1 * (ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0))
	|		КОНЕЦ) КАК buyoutPrice,
	|	ОстаткиАвтомобилейОбороты.Партия.Дата КАК arrivedAt,
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки) КАК ПоследняяДатаАктуальности,
	|	""tradein"" КАК contractType,
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000)) КАК ВыгруженныеДанные
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(&ДатаПоследнейВыгрузки, &ДатаВыгрузки, Регистратор, СкладКомпании В (&СкладКомпании)) КАК ОстаткиАвтомобилейОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CMExpert_ИсторияОбмена КАК CMExpert_ИсторияОбмена
	|		ПО ОстаткиАвтомобилейОбороты.Автомобиль = CMExpert_ИсторияОбмена.Автомобиль
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ПоступлениеАвтомобилей)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратОтПокупателяАвтомобилей))
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОбороты.Партия.Дата,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОбороты.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль),
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки),
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0)) КАК sellingPrice,
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период КАК outAt,
	|	""selling"" КАК outReason
	|ПОМЕСТИТЬ ВТ_Продажа
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаПоследнейВыгрузки, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-1 * (ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0))),
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период,
	|	""return""
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратОтПокупателяАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Автомобиль.VIN КАК vin,
	|	ВТ_Остатки.Автомобиль.Код КАК dmsCarId,
	|	ВТ_Остатки.dealerId,
	|	МАКСИМУМ(ВТ_Остатки.buyoutPrice) КАК buyoutPrice,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Продажа.sellingPrice, ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0)) КАК ЧИСЛО(15, 0))) КАК sellingPrice,
	|	ВТ_Продажа.outAt,
	|	ВТ_Продажа.outReason,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВложенныйЗапрос.repairCost, 0) КАК ЧИСЛО(15, 0))) КАК repairCost,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска КАК year,
	|	МАКСИМУМ(ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0)) КАК mileage,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|				ИЛИ ВТ_Продажа.outReason = ""return""
	|			ТОГДА ""in""
	|		ИНАЧЕ ""out""
	|	КОНЕЦ КАК stockState,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	""offsale"" КАК saleStatus
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ЗаказНаряд.СуммаДокумента) КАК repairCost,
	|			ЗаказНаряд.Автомобиль КАК Автомобиль,
	|			ЗаказНаряд.Дата КАК Дата
	|		ИЗ
	|			Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ГДЕ
	|			ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказНаряд.Автомобиль,
	|			ЗаказНаряд.Дата) КАК ВложенныйЗапрос
	|		ПО ВТ_Остатки.Автомобиль = ВложенныйЗапрос.Автомобиль
	|			И ВТ_Остатки.arrivedAt <= ВложенныйЗапрос.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Продажа КАК ВТ_Продажа
	|		ПО ВТ_Остатки.Автомобиль = ВТ_Продажа.Автомобиль
	|			И (ВТ_Продажа.outAt > ВТ_Остатки.arrivedAt)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ДатаВыгрузки, ) КАК АвтомобилиСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|			И (АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = ЦеныАвтомобилейСрезПоследних.Автомобиль
	|			И (ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦенПродажи)
	|ГДЕ
	|	ВТ_Остатки.dealerId <> """"
	|	И (ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВТ_Продажа.sellingPrice, 0) <> 0)
	|	И ЕСТЬNULL(ВТ_Остатки.Автомобиль.ГодВыпуска, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0) > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Автомобиль.VIN,
	|	ВТ_Остатки.dealerId,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	ВТ_Остатки.Автомобиль.Код,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска,
	|	ВТ_Продажа.outAt,
	|	ВТ_Продажа.outReason,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|				ИЛИ ВТ_Продажа.outReason = ""return""
	|			ТОГДА ""in""
	|		ИНАЧЕ ""out""
	|	КОНЕЦ";
	
	//Запрос.УстановитьПараметр("НачалоПериода",	ДобавитьМесяц(ДатаВыгрузки,-3));
	Запрос.УстановитьПараметр("dealerId",	dealerId);
	Запрос.УстановитьПараметр("ДатаВыгрузки",	ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаПоследнейВыгрузки",	НачалоДня(ДатаПоследнейВыгрузки)-7*24*3600); 	//минус неделя
	//Запрос.УстановитьПараметр("Автомобиль",	Автомобиль);
	Запрос.УстановитьПараметр("ТипЦенПродажи",	Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	//Запрос.УстановитьПараметр("СвойствоCMExpert_КодСклада",	ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("CMExpert_КодСклада"));
	Запрос.УстановитьПараметр("ВнутренниеКонтрагенты",	ВнутренниеКонтрагенты);
	Запрос.УстановитьПараметр("СкладКомпании",	Склад);

	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции
//backup


//Техно-Темп
Функция ПолучитьДанныеДляВыгрузки(ДатаВыгрузки, ДатаПоследнейВыгрузки, Склад, dealerId, ВнутренниеКонтрагенты, Автомобиль)
	
	ТекстОтбора="";
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		ТекстОтбора=ТекстОтбора+" И ВТ_Остатки.Автомобиль = &Автомобиль ";	
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиАвтомобилейОбороты.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль) КАК Автомобиль,
	|	&DealerID КАК dealerId,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|					ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратПоставщикуАвтомобилей)
	|				ТОГДА -1 * (ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0)))
	|			ИНАЧЕ ВЫРАЗИТЬ(ОстаткиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0))
	|		КОНЕЦ) КАК buyoutPrice,
	|	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Партия.Дата) КАК arrivedAt,
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки) КАК ПоследняяДатаАктуальности,
	|	""tradein"" КАК contractType,
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000)) КАК ВыгруженныеДанные,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратПоставщикуАвтомобилей)
	|			ТОГДА ""other""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК OutReason,
	|	МАКСИМУМ(ОстаткиАвтомобилейОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Обороты(&ДатаПоследнейВыгрузки, &ДатаВыгрузки, Регистратор, СкладКомпании В (&СкладКомпании)) КАК ОстаткиАвтомобилейОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CMExpert_ИсторияОбмена КАК CMExpert_ИсторияОбмена
	|		ПО ОстаткиАвтомобилейОбороты.Автомобиль = CMExpert_ИсторияОбмена.Автомобиль
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ПоступлениеАвтомобилей)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратОтПокупателяАвтомобилей))
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОстаткиАвтомобилейОбороты.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль),
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки),
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000)),
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратПоставщикуАвтомобилей)
	|			ТОГДА ""other""
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0)) КАК sellingPrice,
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период КАК outAt,
	|	""selling"" КАК outReason
	|ПОМЕСТИТЬ ВТ_Продажа
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаПоследнейВыгрузки, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-1 * (ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0))),
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период,
	|	""return""
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратОтПокупателяАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Автомобиль.VIN КАК vin,
	|	ВТ_Остатки.Автомобиль.Код КАК dmsCarId,
	|	ВТ_Остатки.dealerId,
	|	МАКСИМУМ(ВТ_Остатки.buyoutPrice) КАК buyoutPrice,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Продажа.sellingPrice, ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0)) КАК ЧИСЛО(15, 0))) КАК sellingPrice,
	|	ВЫБОР
	|		КОГДА ВТ_Остатки.OutReason = ""other""
	|			ТОГДА ВТ_Остатки.Период
	|		ИНАЧЕ ВТ_Продажа.outAt
	|	КОНЕЦ КАК outAt,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.outReason ЕСТЬ NULL 
	|			ТОГДА ВТ_Остатки.OutReason
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК outReason,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВложенныйЗапрос.repairCost, 0) КАК ЧИСЛО(15, 0))) КАК repairCost,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска КАК year,
	|	МАКСИМУМ(ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0)) КАК mileage,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Остатки.OutReason = ""other""
	|						ТОГДА ""out""
	|					ИНАЧЕ ""in""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Продажа.outReason = ""return""
	|					ТОГДА ""in""
	|				ИНАЧЕ ""out""
	|			КОНЕЦ
	|	КОНЕЦ КАК stockState,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	""offsale"" КАК saleStatus
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ЗаказНаряд.СуммаДокумента) КАК repairCost,
	|			ЗаказНаряд.Автомобиль КАК Автомобиль,
	|			ЗаказНаряд.Дата КАК Дата
	|		ИЗ
	|			Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ГДЕ
	|			ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказНаряд.Автомобиль,
	|			ЗаказНаряд.Дата) КАК ВложенныйЗапрос
	|		ПО ВТ_Остатки.Автомобиль = ВложенныйЗапрос.Автомобиль
	|			И ВТ_Остатки.arrivedAt <= ВложенныйЗапрос.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Продажа КАК ВТ_Продажа
	|		ПО ВТ_Остатки.Автомобиль = ВТ_Продажа.Автомобиль
	|			И (ВТ_Продажа.outAt > ВТ_Остатки.arrivedAt)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ДатаВыгрузки, ) КАК АвтомобилиСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|			И (АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = ЦеныАвтомобилейСрезПоследних.Автомобиль
	|			И (ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦенПродажи)
	|ГДЕ
	|	ВТ_Остатки.dealerId <> """"
	|	И (ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВТ_Продажа.sellingPrice, 0) <> 0)
	|	И ЕСТЬNULL(ВТ_Остатки.Автомобиль.ГодВыпуска, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0) > 0
	|   "+ТекстОтбора+"
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Автомобиль.VIN,
	|	ВТ_Остатки.dealerId,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	ВТ_Остатки.Автомобиль.Код,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	ВЫБОР
	|		КОГДА ВТ_Остатки.OutReason = ""other""
	|			ТОГДА ВТ_Остатки.Период
	|		ИНАЧЕ ВТ_Продажа.outAt
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.outReason ЕСТЬ NULL 
	|			ТОГДА ВТ_Остатки.OutReason
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_Остатки.OutReason = ""other""
	|						ТОГДА ""out""
	|					ИНАЧЕ ""in""
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТ_Продажа.outReason = ""return""
	|					ТОГДА ""in""
	|				ИНАЧЕ ""out""
	|			КОНЕЦ
	|	КОНЕЦ";
	
	//Запрос.УстановитьПараметр("НачалоПериода",	ДобавитьМесяц(ДатаВыгрузки,-3));
	Запрос.УстановитьПараметр("dealerId",	dealerId);
	Запрос.УстановитьПараметр("ДатаВыгрузки",	ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаПоследнейВыгрузки",	НачалоДня(ДатаПоследнейВыгрузки)-30*24*3600); 	//минус неделя
	Запрос.УстановитьПараметр("Автомобиль",	Автомобиль);
	Запрос.УстановитьПараметр("ТипЦенПродажи",	Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	//Запрос.УстановитьПараметр("СвойствоCMExpert_КодСклада",	ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("CMExpert_КодСклада"));
	Запрос.УстановитьПараметр("ВнутренниеКонтрагенты",	ВнутренниеКонтрагенты);
	Запрос.УстановитьПараметр("СкладКомпании",	Склад);

	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции

Функция ПолучитьДанныеДляВыгрузкиОстатки(ДатаВыгрузки, ДатаПоследнейВыгрузки, Склад, dealerId, ВнутренниеКонтрагенты)
	
	//ТекстОтбора="";
	//Если ЗначениеЗаполнено(Автомобиль) Тогда
	//	ТекстОтбора=ТекстОтбора+"
	//	|ГДЕ
	//	|	ВТ_Остатки.Автомобиль = &Автомобиль ";	
	//КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль) КАК Автомобиль,
	|	&DealerID КАК dealerId,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ОстаткиАвтомобилейОстатки.СуммаОстаток КАК ЧИСЛО(15, 0))) КАК buyoutPrice,
	|	ОстаткиАвтомобилейОстатки.Партия.Дата КАК arrivedAt,
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки) КАК ПоследняяДатаАктуальности,
	|	""tradein"" КАК contractType,
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000)) КАК ВыгруженныеДанные
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаВыгрузки, СкладКомпании В (&СкладКомпании)) КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CMExpert_ИсторияОбмена КАК CMExpert_ИсторияОбмена
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = CMExpert_ИсторияОбмена.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.Партия.Дата,
	|	ЕСТЬNULL(ОстаткиАвтомобилейОстатки.Автомобиль, CMExpert_ИсторияОбмена.Автомобиль),
	|	ЕСТЬNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки),
	|	ВЫРАЗИТЬ(CMExpert_ИсторияОбмена.ВыгруженныеДанные КАК СТРОКА(1000))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0)) КАК sellingPrice,
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период КАК outAt,
	|	""selling"" КАК outReason
	|ПОМЕСТИТЬ ВТ_Продажа
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаПоследнейВыгрузки, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.РеализацияАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	-1 * (ВЫРАЗИТЬ(ПродажиАвтомобилейОбороты.СуммаОборот КАК ЧИСЛО(15, 0))),
	|	ПродажиАвтомобилейОбороты.Автомобиль,
	|	ПродажиАвтомобилейОбороты.Период,
	|	""return""
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(, &ДатаВыгрузки, Регистратор, ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ПродажиАвтомобилейОбороты.Регистратор) = ТИП(Документ.ВозвратОтПокупателяАвтомобилей)
	|	И НЕ ПродажиАвтомобилейОбороты.Покупатель В (&ВнутренниеКонтрагенты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Автомобиль.VIN КАК vin,
	|	ВТ_Остатки.Автомобиль.Код КАК dmsCarId,
	|	ВТ_Остатки.dealerId,
	|	МАКСИМУМ(ВТ_Остатки.buyoutPrice) КАК buyoutPrice,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Продажа.sellingPrice, ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0)) КАК ЧИСЛО(15, 0))) КАК sellingPrice,
	|	ВТ_Продажа.outAt,
	|	ВТ_Продажа.outReason,
	|	СУММА(ВЫРАЗИТЬ(ЕСТЬNULL(ВложенныйЗапрос.repairCost, 0) КАК ЧИСЛО(15, 0))) КАК repairCost,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска КАК year,
	|	МАКСИМУМ(ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0)) КАК mileage,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|				ИЛИ ВТ_Продажа.outReason = ""return""
	|			ТОГДА ""in""
	|		ИНАЧЕ ""out""
	|	КОНЕЦ КАК stockState,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	""offsale"" КАК saleStatus
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ЗаказНаряд.СуммаДокумента) КАК repairCost,
	|			ЗаказНаряд.Автомобиль КАК Автомобиль,
	|			ЗаказНаряд.Дата КАК Дата
	|		ИЗ
	|			Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ГДЕ
	|			(ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
	|					ИЛИ ЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказНаряд.Автомобиль,
	|			ЗаказНаряд.Дата) КАК ВложенныйЗапрос
	|		ПО ВТ_Остатки.Автомобиль = ВложенныйЗапрос.Автомобиль
	|			И ВТ_Остатки.arrivedAt <= ВложенныйЗапрос.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Продажа КАК ВТ_Продажа
	|		ПО ВТ_Остатки.Автомобиль = ВТ_Продажа.Автомобиль
	|			И (ВТ_Продажа.outAt > ВТ_Остатки.arrivedAt)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ДатаВыгрузки, ) КАК АвтомобилиСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|			И (АвтомобилиСрезПоследних.ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.Пробег))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныАвтомобилей.СрезПоследних КАК ЦеныАвтомобилейСрезПоследних
	|		ПО ВТ_Остатки.Автомобиль = ЦеныАвтомобилейСрезПоследних.Автомобиль
	|			И (ЦеныАвтомобилейСрезПоследних.ТипЦен = &ТипЦенПродажи)
	|ГДЕ
	|	ВТ_Остатки.dealerId <> """"
	|	И (ЕСТЬNULL(ЦеныАвтомобилейСрезПоследних.Цена, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВТ_Продажа.sellingPrice, 0) <> 0)
	|	И ЕСТЬNULL(ВТ_Остатки.Автомобиль.ГодВыпуска, ДАТАВРЕМЯ(1, 1, 1)) <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЕСТЬNULL(АвтомобилиСрезПоследних.Значение, 0) > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Автомобиль.VIN,
	|	ВТ_Остатки.dealerId,
	|	ВТ_Остатки.arrivedAt,
	|	ВТ_Остатки.contractType,
	|	ВТ_Остатки.Автомобиль.Код,
	|	ВТ_Остатки.Автомобиль.ГодВыпуска,
	|	ВТ_Продажа.outAt,
	|	ВТ_Продажа.outReason,
	|	ВТ_Остатки.ВыгруженныеДанные,
	|	ВТ_Остатки.Автомобиль,
	|	ВЫБОР
	|		КОГДА ВТ_Продажа.Автомобиль ЕСТЬ NULL 
	|				ИЛИ ВТ_Продажа.outReason = ""return""
	|			ТОГДА ""in""
	|		ИНАЧЕ ""out""
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("НачалоПериода",	ДобавитьМесяц(ДатаВыгрузки,-3));
	Запрос.УстановитьПараметр("ДатаВыгрузки",	ДатаВыгрузки);
	Запрос.УстановитьПараметр("dealerId",	dealerId);
	Запрос.УстановитьПараметр("ДатаПоследнейВыгрузки",	ДатаПоследнейВыгрузки);	
	//Запрос.УстановитьПараметр("Автомобиль",	Автомобиль);
	Запрос.УстановитьПараметр("ТипЦенПродажи",	Справочники.ТипыЦен.ОсновнойТипЦенПродажи);
	//Запрос.УстановитьПараметр("СвойствоCMExpert_КодСклада",	ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("CMExpert_КодСклада"));
	Запрос.УстановитьПараметр("СкладКомпании",	Склад);
	Запрос.УстановитьПараметр("ВнутренниеКонтрагенты",	ВнутренниеКонтрагенты);
	
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции
//Техно-Темп

Функция ПолучитьДанныеДляВыгрузкиДляУТ(ДатаВыгрузки, ДатаПоследнейВыгрузки)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеID.Идентификатор, ""349"") КАК dealerId,
	|	ВЫБОР
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Обмен)
	|			ТОГДА ""tradein""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Выкуп)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Комиссия)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Возврат)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.ОС)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Подменные)
	|			ТОГДА ""internalpark""
	|		ИНАЧЕ ""internalpark""
	|	КОНЕЦ КАК contractType,	
	|	ЕСТЬNULL(Партии.Номенклатура, CMExpert_ИсторияОбмена.Автомобиль) КАК Номенклатура,
	|	СтоимостьОстаток КАК Стоимость,
	|	ВЫБОР 
	|		КОГДА Партии.Номенклатура = CMExpert_ИсторияОбмена.Автомобиль
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверкаИзменения,
	|	ЕстьNULL(CMExpert_ИсторияОбмена.ДатаВыгрузки, &ДатаПоследнейВыгрузки) КАК ПоследняяДатаАктуальности,
	|	CMExpert_ИсторияОбмена.ВыгруженныеДанные,
	|	ВЫБОР
	|		КОГДА CMExpert_ИсторияОбмена.Автомобиль ЕСТЬ NULL
	|			ТОГДА ""in""
	|		КОГДА Партии.Номенклатура ЕСТЬ NULL
	|			ТОГДА ""out""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК stockState,
	|	Партии.ДокументОприходования.Дата КАК arrivedAt
	|ПОМЕСТИТЬ
	|	СписокАвто
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(&ДатаВыгрузки, Номенклатура В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Номенклатура.Автомобили), ЗНАЧЕНИЕ(Справочник.Номенклатура.ОСАвтомобили))) КАК Партии
	|ПОЛНОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.CMExpert_ИсторияОбмена КАК CMExpert_ИсторияОбмена
	|ПО 
	|	Партии.Номенклатура = CMExpert_ИсторияОбмена.Автомобиль
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаВыгрузки, Номенклатура В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.Номенклатура.Автомобили), ЗНАЧЕНИЕ(Справочник.Номенклатура.ОСАвтомобили))) КАК Остатки
	|ПО
	|	Остатки.Номенклатура = Партии.Номенклатура
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ИдентификаторыВнешнихОбъектов КАК ДанныеID
	|ПО
	|	ДанныеID.Объект = Остатки.Склад
	|	И ДанныеID.ТипВнешнейСистемы = ЗНАЧЕНИЕ(Перечисление.ТипыВнешнихСистем.CMExpert) 
	|;
	|
	|ВЫБРАТЬ
	|	ОснДанные.Номенклатура,
	|	ДокументОприходования.Дата КАК ДатаПоступления,
	|	ВЫБОР
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Обмен)
	|			ТОГДА ""tradein""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Выкуп)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Комиссия)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Возврат)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.ОС)
	|			ТОГДА ""internalpark""
	|		КОГДА ДокументОприходования.ТипСделкиБУАвто = ЗНАЧЕНИЕ(Перечисление.ТипыСделокБУАвто.Подменные)
	|			ТОГДА ""internalpark""
	|		ИНАЧЕ ""internalpark""
	|	КОНЕЦ КАК contractType,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Продажи.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг)
	|				ИЛИ ТИПЗНАЧЕНИЯ(Продажи.Регистратор) = ТИП(Документ.ЧекККМ)
	|			ТОГДА ""selling""
	|		КОГДА ТИПЗНАЧЕНИЯ(Продажи.Регистратор) = ТИП(Документ.ВозвратТоваровОтПокупателя)
	|			ТОГДА ""return""
	|		ИНАЧЕ ""other""
	|	КОНЕЦ КАК outReason,
	|	Продажи.Период КАК outAt,	
	|	СтоимостьОборот КАК Стоимость	
	|ПОМЕСТИТЬ
	|	ДанныеДвижения
	|ИЗ
	|	СписокАвто КАК ОснДанные
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ПродажиСебестоимость.Обороты(	, 
	|													&ДатаВыгрузки, 
	|													Регистратор, 
	|													Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ СписокАвто)
	|												) КАК Продажи
	|ПО
	|	Продажи.Номенклатура = ОснДанные.Номенклатура
	|	И Продажи.Период >= ПоследняяДатаАктуальности
	|	
	|;
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(Ссылка) КАК Ссылка,
	|	Автомобиль
	|ПОМЕСТИТЬ
	|	ПоследниеБП
	|ИЗ
	|	БизнесПроцесс.ОсмотрБУАвто
	|ГДЕ
	|	Автомобиль В (ВЫБРАТЬ Номенклатура ИЗ СписокАвто)
	|СГРУППИРОВАТЬ ПО
	|	Автомобиль
	|;
	|
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОснСписокАвто.dealerId, ""349"") КАК dealerId,
	|	ЕСТЬNULL(ОснСписокАвто.arrivedAt, Движения.ДатаПоступления) КАК arrivedAt,
	|	ЕСТЬNULL(Движения.outReason, """") КАК outReason,
	|	ЕСТЬNULL(Движения.outAt, """") КАК outAt,
	|	ОснСписокАвто.ПроверкаИзменения,
	|	ОснСписокАвто.ВыгруженныеДанные,
	|   ВЫРАЗИТЬ(ЕСТЬNULL(ОснСписокАвто.Стоимость, ЕСТЬNULL(Движения.Стоимость,0)) КАК ЧИСЛО(15)) КАК buyoutPrice,
	|   ЕСТЬNULL(Движения.contractType, ЕСТЬNULL(ОснСписокАвто.contractType,"""")) КАК contractType,
	|  	ОснСписокАвто.stockState,	
	|	ОсмотрБУАвто.Ссылка,
	|	ОсмотрБУАвто.Автомобиль,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.НеВыгружатьНаСайт
	|			ТОГДА ""offsale""
	|		ИНАЧЕ ""onsale""
	|	КОНЕЦ КАК saleStatus,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.КоммерческийТранспорт
	|			ТОГДА ""lcv""
	|		ИНАЧЕ ""pc""
	|	КОНЕЦ КАК vehicleType,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) + ЕСТЬNULL(ВЫРАЗИТЬ(СвойствоСуммаДопОборудования.Значение КАК ЧИСЛО(15,2)),0) КАК sellingPrice,
	|	
	|	ВЫРАЗИТЬ(ЕСТЬNULL(Затраты.СуммаЗатрат, 0) КАК ЧИСЛО(15)) КАК repairCost,
	|	ОсмотрБУАвто.Цвет КАК Цвет,
	|	ОсмотрБУАвто.Автомобиль.Код КАК id,
	|	ОсмотрБУАвто.Автомобиль.Наименование КАК dmsCarId,
	|	ОсмотрБУАвто.ГодВыпуска КАК year,
	|	ОсмотрБУАвто.Пробег КАК mileage,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Седан)
	|			ТОГДА ""sed""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Хетчбэк)
	|			ТОГДА ""hatch""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Универсал)
	|			ТОГДА ""wag""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Внедорожник)
	|			ТОГДА ""off""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Пикап)
	|			ТОГДА ""pick""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Купе)
	|			ТОГДА ""coupe""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Кабриолет)
	|			ТОГДА ""conv""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Минивен)
	|			ТОГДА ""miniwan""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.МикроАвтобус)
	|			ТОГДА ""minibus""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.Фургон)
	|			ТОГДА ""cargovan""
	|		КОГДА ОсмотрБУАвто.Кузов = ЗНАЧЕНИЕ(Справочник.ТипыКузовов.ШассиСКабиной)
	|			ТОГДА ""chassis""
	|		ИНАЧЕ ""sed""
	|	КОНЕЦ КАК body,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.Автомат)
	|			ТОГДА ""at""
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.Механика)
	|			ТОГДА ""mt""
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.МТА)
	|			ТОГДА ""amt""
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.Вариатор)
	|			ТОГДА ""cvt""
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.Прочее)
	|			ТОГДА ""at""
	|		КОГДА ОсмотрБУАвто.ТипКПП = ЗНАЧЕНИЕ(Перечисление.ТипКПП.DSG)
	|			ТОГДА ""amt""
	|		ИНАЧЕ ""mt""
	|	КОНЕЦ КАК gear,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.Привод = ЗНАЧЕНИЕ(Перечисление.Привод.Передний)
	|			ТОГДА ""fwd""
	|		КОГДА ОсмотрБУАвто.Привод = ЗНАЧЕНИЕ(Перечисление.Привод.Задний)
	|			ТОГДА ""rwd""
	|		КОГДА ОсмотрБУАвто.Привод = ЗНАЧЕНИЕ(Перечисление.Привод.Полный)
	|			ТОГДА ""awd""
	|		ИНАЧЕ ""fwd""
	|	КОНЕЦ КАК drive,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.ТипДвигателя = ЗНАЧЕНИЕ(Справочник.ТипыДвигателя.TDI)
	|			ТОГДА ""diesel""
	|		КОГДА ОсмотрБУАвто.ТипДвигателя = ЗНАЧЕНИЕ(Справочник.ТипыДвигателя.TSI)
	|			ТОГДА ""petrol""
	|		КОГДА ОсмотрБУАвто.ТипДвигателя = ЗНАЧЕНИЕ(Справочник.ТипыДвигателя.Бензиновый)
	|			ТОГДА ""petrol""
	|		КОГДА ОсмотрБУАвто.ТипДвигателя = ЗНАЧЕНИЕ(Справочник.ТипыДвигателя.Газ)
	|			ТОГДА ""gas""
	|		КОГДА ОсмотрБУАвто.ТипДвигателя = ЗНАЧЕНИЕ(Справочник.ТипыДвигателя.Дизельный)
	|			ТОГДА ""diesel""
	|		ИНАЧЕ ""petrol""
	|	КОНЕЦ КАК engine,
	|	ВЫБОР
	|		КОГДА ОсмотрБУАвто.ОбъемДвигателя > 100
	|			ТОГДА ОсмотрБУАвто.ОбъемДвигателя / 1000
	|		ИНАЧЕ ОсмотрБУАвто.ОбъемДвигателя
	|	КОНЕЦ КАК volume,
	|	ОсмотрБУАвто.МощностьДвигателя КАК power,
	|	ЕСТЬNULL(ОсмотрБУАвто.Автомобиль.Наименование, ОсмотрБУАвто.Автомобиль) КАК vin
	|ИЗ
	|	БизнесПроцесс.ОсмотрБУАвто КАК ОсмотрБУАвто
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	СписокАвто КАК ОснСписокАвто
	|ПО
	|	ОснСписокАвто.Номенклатура = ОсмотрБУАвто.Автомобиль
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ДанныеДвижения КАК Движения
	|ПО
	|	Движения.Номенклатура = ОсмотрБУАвто.Автомобиль
	|
	|	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаВыгрузки, ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.Розничная)) КАК ЦеныНоменклатуры
	|ПО
	|	ЦеныНоменклатуры.Номенклатура = ОсмотрБУАвто.Автомобиль
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСуммаДопОборудования
	|ПО 
	|	ОсмотрБУАвто.Автомобиль = СвойствоСуммаДопОборудования.Объект
	|	И СвойствоСуммаДопОборудования.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СуммаДопОборудования)	
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|		(ВЫБРАТЬ
	|			ЗатратыОбороты.НоменклатураЗатрат КАК Номенклатура,
	|			СУММА(ЗатратыОбороты.СуммаОборот) КАК СуммаЗатрат
	|		ИЗ
	|			РегистрНакопления.Затраты.Обороты(
	|					,
	|					&ДатаВыгрузки,
	|					Регистратор,
	|					НоменклатураЗатрат В
	|						(ВЫБРАТЬ Номенклатура ИЗ ДанныеДвижения)) КАК ЗатратыОбороты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеДвижения КАК СписокВыгр
	|				ПО (СписокВыгр.Номенклатура = ЗатратыОбороты.НоменклатураЗатрат)
	|					И ЗатратыОбороты.Период >= СписокВыгр.ДатаПоступления
	|
	|		СГРУППИРОВАТЬ ПО
	|			ЗатратыОбороты.НоменклатураЗатрат
	|		) КАК Затраты
	|ПО
	|	Затраты.Номенклатура = ОсмотрБУАвто.Автомобиль
	|ГДЕ
	|	ОсмотрБУАвто.Ссылка В (ВЫБРАТЬ Ссылка ИЗ ПоследниеБП)
	|";
	
	Запрос.УстановитьПараметр("ДатаВыгрузки",	ДатаВыгрузки);
	Запрос.УстановитьПараметр("ДатаПоследнейВыгрузки",	ДатаПоследнейВыгрузки);	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция СтруктурыРавны(Структура1, Структура2, ПоляСРазличиями = "")

	ЕстьРазличия = Ложь;
	
	Для Каждого Поле1 Из Структура1 Цикл
		Если НЕ Структура2.Свойство(Поле1.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Структура2[Поле1.Ключ] <> СтрЗаменить(Строка(Поле1.Значение)," ","") Тогда
			ПоляСРазличиями = ПоляСРазличиями + Поле1.Ключ + ",";
			ЕстьРазличия = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НЕ ЕстьРазличия;
	
КонецФункции


Функция ПолучитьСоединениеCMExpert(НастройкиВыгрузи = Неопределено)
	
	Сервер = "lk.cm.expert";
	Порт = 443;
	
	Если НастройкиВыгрузи = Неопределено Тогда
		Логин = "tehno-temp-krasnodar-sandbox";
		Пароль = "pass";
	Иначе
		Логин = НастройкиВыгрузи.Логин;
		Пароль = НастройкиВыгрузи.Пароль;
	КонецЕсли;

	Ssl = Новый ЗащищенноеСоединениеOpenSSL();
	Прокси = Новый ИнтернетПрокси(Истина);

	СоединениеHTTP = Новый HTTPСоединение(Сервер, Порт, Логин, Пароль, Прокси,,Ssl);
   
	Возврат СоединениеHTTP;	
	
КонецФункции

 Функция ПолучитьСоединениеCMExpertБезСервера(НастройкиВыгрузи = Неопределено)
	
	Сервер = "lk.cm.expert";
	Порт = 443;
	
	Если НастройкиВыгрузи = Неопределено Тогда
		Логин = "tehno-temp-krasnodar-sandbox";
		Пароль = "pass";
	Иначе
		Логин = НастройкиВыгрузи.Логин;
		Пароль = НастройкиВыгрузи.Пароль;
	КонецЕсли;

	Ssl = Новый ЗащищенноеСоединениеOpenSSL();
	Прокси = Новый ИнтернетПрокси(Истина);

	СоединениеHTTP = Новый HTTPСоединение(Сервер, Порт, Логин, Пароль, Прокси,,Ssl);
   
	Возврат СоединениеHTTP;	
	
КонецФункции

         
Функция ПолучитьAccessToken(СоединениеHTTP = Неопределено)
	
	Сервис = "/oauth/token";
	
	Если СоединениеHTTP = Неопределено Тогда
		СоединениеHTTP = ПолучитьСоединениеCMExpert();
	КонецЕсли;
	
	СоответствиеПараметры = Новый Соответствие;
	СоответствиеПараметры.Вставить("grant_type","client_credentials");

	ЗапросHTTP = ОбщПолучитьЗапросHTTP(Сервис);
	ЗаполнитьPOSTЗапросДаннымиFormData(ЗапросHTTP, СоответствиеПараметры);
	
	Результат = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);

	Если Результат.КодСостояния <> 200 Тогда
	   Возврат Неопределено;
	КонецЕсли;

	Данные = Результат.ПолучитьТелоКакСтроку();	
	
	//anton
	СтруктураДанных = ЗаполнитьСтруктуруИзОтветаJSON(Данные);
	//anton
	
	Если НЕ СтруктураДанных.Свойство("access_token") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураДанных.access_token;
	
КонецФункции

Функция ПолучитьЗапросHTTP(Токен, Знач Данные, НастройкиВыгрузи = Неопределено,Метод)
	
	dmsCarId = Данные.dmsCarId;
	
	//Если ЕстьСвойство(Данные, "dealerId") Тогда
	dealerId = СтрЗаменить(Строка(НастройкиВыгрузи.ИдентификаторДилера), Символы.НПП, "");			
	//КонецЕсли;
	
	Если обЗначениеНеЗаполнено(dealerId) Тогда
		ВызватьИсключение("Не заполнен Код дилера!");
	КонецЕсли;
		
	ЗапросHTTP = Новый HTTPЗапрос("api/v1/dealers/"+ dealerId +"/dms/cars/" + СтрЗаменить(Строка(dmsCarId), Символы.НПП, ""));
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	ЗапросHTTP.Заголовки.Вставить("Accept", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	
	Данные.Удалить("Метод");
	Данные.Удалить("Автомобиль");
	
	ЗапросHTTP.УстановитьТелоИзСтроки(СформироватьСтрокуJSON(Данные),"CESU-8");
	
	Возврат ЗапросHTTP;
	
КонецФункции

Функция ПолучитьЗапросHTTP_ПолучениеДилеров(Токен, Знач Данные, НастройкиВыгрузи = Неопределено)

	
	ЗапросHTTP = Новый HTTPЗапрос("api/v1/dealers/");
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	ЗапросHTTP.Заголовки.Вставить("Accept", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	
	Данные="";
	
	ЗапросHTTP.УстановитьТелоИзСтроки(СформироватьСтрокуJSON(Данные));
	
	Возврат ЗапросHTTP;
	
КонецФункции

Функция ПолучитьЗапросHTTP_GET_Car(Токен, НастройкиВыгрузи = Неопределено, Код="")
	
	Если Код="" Тогда Код="ЦБ00012436"; КонецЕсли;	

	dealerId = СтрЗаменить(Строка(НастройкиВыгрузи.ИдентификаторДилера), Символы.НПП, "");			
   
	ЗапросHTTP = Новый HTTPЗапрос("api/v1/dealers/"+ dealerId +"/dms/cars/"+Код);
	ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	ЗапросHTTP.Заголовки.Вставить("Accept", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	
	Данные="";
	
	ЗапросHTTP.УстановитьТелоИзСтроки(СформироватьСтрокуJSON(Данные));
	
	Возврат ЗапросHTTP;
	
КонецФункции


Функция ПодготовитьОбъектDmsCar(Данные)
	
	//ПоляDmsCar = "stockState,contractType,saleStatus,vehicleType,sellingPrice,buyoutPrice,repairCost,id,dmsCarId,year,mileage,body,gear,drive,engine,volume,power,vin,arrivedAt,dealerId";
	ПоляDmsCar = "stockState,contractType,saleStatus,buyoutPrice,repairCost,dmsCarId,sellingPrice,mileage,vin,arrivedAt,dealerId";
	
	ДанныеDmsCar = Новый Структура(ПоляDmsCar);
	ЗаполнитьЗначенияСвойств(ДанныеDmsCar, Данные);

	Возврат ДанныеDmsCar;
	
КонецФункции


// << 19.04.2018 Леонов Александр: Перенес из консоли HTTP

Функция ПолучитьТелоPOSTЗапросаFormData(СписокСоответствий, РазделительBound = Неопределено, Кодировка = Неопределено)

	ТекстТелаЗапроса = "";
	
	Если НЕ ЗначениеЗаполнено(Кодировка) Тогда
		Кодировка = "UTF-8";
	КонецЕсли;
	
	//Получу разделитель
	Если Не ЗначениеЗаполнено(РазделительBound) Тогда
		РазделительBound = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	Для Каждого СтрСписка Из СписокСоответствий Цикл
		ТекстТелаЗапроса = 	ТекстТелаЗапроса 
							+ Символы.ПС
							+ "--" + РазделительBound
							+ Символы.ПС
							+ "Content-Type: text/plain; charset="
							+ Кодировка
							+ Символы.ПС
							+ "Content-Disposition: form-data; name='"
							+ СтрСписка.Ключ
							+ "'"
							+ Символы.ПС
							+ Символы.ПС
							+ СтрСписка.Значение
							+ Символы.ПС
							+ "--" + РазделительBound;
							
	КонецЦикла;
	
	Возврат ТекстТелаЗапроса + "--";
	
КонецФункции

Процедура ЗаполнитьPOSTЗапросДаннымиFormData(ЗапросHTTP, СписокСоответствий, Кодировка = Неопределено) Экспорт
	
	//Получу разделитель
	РазделительBound = Строка(Новый УникальныйИдентификатор());
	
	ТекстТелаЗапроса = ПолучитьТелоPOSTЗапросаFormData(СписокСоответствий, РазделительBound, Кодировка);
	
	ЗапросHTTP.УстановитьТелоИзСтроки(ТекстТелаЗапроса);
	ЗапросHTTP.Заголовки.Вставить("Content-Type","multipart/form-data; boundary=""" + РазделительBound + """");
	
КонецПроцедуры

Функция ПолучитьПрокси(ПроксиПоУмолчанию = Ложь, ЭтоHTTPS = Ложь, Сервер = "", Порт = 0, Пользователь = "", Пароль = "", ИспользоватьАутентификациюОС = Истина) Экспорт 
	
	нПрокси = Новый ИнтернетПрокси(ПроксиПоУмолчанию);
	
	Если ПроксиПоУмолчанию = Ложь И ЗначениеЗаполнено(Сервер) Тогда
		Протокол = ?(ЭтоHTTPS, "https", "http");
		нПрокси.Установить(Протокол, Сервер, Порт, Пользователь, Пароль, ИспользоватьАутентификациюОС);
	КонецЕсли;
	
	Возврат нПрокси;
	
КонецФункции

Функция ПолучитьСоединениеHTTP(	Сервер, 
								Порт, 
								ЭтоHTTPS = Ложь, 
								Логин = Неопределено, 
								Пароль = Неопределено, 
								Таймаут = Неопределено, 
								Прокси = Неопределено) Экспорт
	
	Если ЭтоHTTPS Тогда
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
	Иначе
		ssl = Неопределено;
	КонецЕсли;
	
	Если Прокси = Неопределено Тогда
		Прокси = Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Сервер, Порт, Логин, Пароль, Прокси, Таймаут, ssl);
	
	Возврат Соединение;
	
КонецФункции

Функция ОбщПолучитьЗапросHTTP(Сервис, Заголовки = Неопределено, ТелоЗапроса = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Заголовки) ИЛИ ТипЗнч(Заголовки) <> Тип("Соответствие") Тогда
		Заголовки = Новый Соответствие;
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(Сервис, Заголовки);
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция РезультатHTTPЗапросаСодержитОшибку(РезультатHttpЗапроса, ТекстОшибки = "", ВывестиСообщениеОбОшибке = Ложь) Экспорт
	
	Если РезультатHttpЗапроса.КодСостояния = 200 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если РезультатHttpЗапроса.КодСостояния = 100 Тогда 
		ОписаниеСостояния = "Continue («продолжай»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 101 Тогда 
		ОписаниеСостояния = "Switching Protocols («переключение протоколов»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 102 Тогда 
		ОписаниеСостояния = "Processing («идёт обработка»)";
		
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 200 Тогда 
		ОписаниеСостояния = "OK («хорошо»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 201 Тогда 
		ОписаниеСостояния = "Created («создано»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 202 Тогда 
		ОписаниеСостояния = "Accepted («принято»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 203 Тогда 
		ОписаниеСостояния = "Non-Authoritative Information («информация не авторитетна»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 204 Тогда 
		ОписаниеСостояния = "No Content («нет содержимого»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 205 Тогда 
		ОписаниеСостояния = "Reset Content («сбросить содержимое»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 206 Тогда 
		ОписаниеСостояния = "Partial Content («частичное содержимое»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 207 Тогда 
		ОписаниеСостояния = "Multi-Status («многостатусный»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 208 Тогда 
		ОписаниеСостояния = "Already Reported («уже сообщалось»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 226 Тогда 
		ОписаниеСостояния = "IM Used («использовано IM»)";
		
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 300 Тогда 
		ОписаниеСостояния = "Multiple Choices («множество выборов»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 301 Тогда 
		ОписаниеСостояния = "Moved Permanently («перемещено навсегда»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 302 Тогда 
		ОписаниеСостояния = "Moved Temporarily («перемещено временно»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 302 Тогда 
		ОписаниеСостояния = "Found («найдено»)[7]";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 303 Тогда 
		ОписаниеСостояния = "See Other («смотреть другое»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 304 Тогда 
		ОписаниеСостояния = "Not Modified («не изменялось»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 305 Тогда 
		ОписаниеСостояния = "Use Proxy («использовать прокси»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 306 Тогда 
		ОписаниеСостояния = "зарезервировано (код использовался только в ранних спецификациях)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 307 Тогда 
		ОписаниеСостояния = "Temporary Redirect («временное перенаправление»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 308 Тогда 
		ОписаниеСостояния = "Permanent Redirect («постоянное перенаправление»)";
		
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 400 Тогда 
		ОписаниеСостояния = "Bad Request («плохой, неверный запрос»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 401 Тогда 
		ОписаниеСостояния = "Unauthorized («не авторизован»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 402 Тогда 
		ОписаниеСостояния = "Payment Required («необходима оплата»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 403 Тогда 
		ОписаниеСостояния = "Forbidden («запрещено»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 404 Тогда 
		ОписаниеСостояния = "Not Found («не найдено»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 405 Тогда 
		ОписаниеСостояния = "Method Not Allowed («метод не поддерживается»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 406 Тогда 
		ОписаниеСостояния = "Not Acceptable («неприемлемо»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 407 Тогда 
		ОписаниеСостояния = "Proxy Authentication Required («необходима аутентификация прокси»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 408 Тогда 
		ОписаниеСостояния = "Request Timeout («истекло время ожидания»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 409 Тогда 
		ОписаниеСостояния = "Conflict («конфликт»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 410 Тогда 
		ОписаниеСостояния = "Gone («удалён»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 411 Тогда 
		ОписаниеСостояния = "Length Required («необходима длина»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 412 Тогда 
		ОписаниеСостояния = "Precondition Failed («условие ложно»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 413 Тогда 
		ОписаниеСостояния = "Payload Too Large («полезная нагрузка слишком велика»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 414 Тогда 
		ОписаниеСостояния = "URI Too Long («URI слишком длинный»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 415 Тогда 
		ОписаниеСостояния = "Unsupported Media Type («неподдерживаемый тип данных»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 416 Тогда 
		ОписаниеСостояния = "Range Not Satisfiable («диапазон не достижим»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 417 Тогда 
		ОписаниеСостояния = "Expectation Failed («ожидание не удалось»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 418 Тогда 
		ОписаниеСостояния = "I’m a teapot («я — чайник»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 421 Тогда 
		ОписаниеСостояния = "Misdirected Request [10]";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 422 Тогда 
		ОписаниеСостояния = "Unprocessable Entity («необрабатываемый экземпляр»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 423 Тогда 
		ОписаниеСостояния = "Locked («заблокировано»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 424 Тогда 
		ОписаниеСостояния = "Failed Dependency («невыполненная зависимость»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 426 Тогда 
		ОписаниеСостояния = "Upgrade Required («необходимо обновление»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 428 Тогда 
		ОписаниеСостояния = "Precondition Required («необходимо предусловие»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 429 Тогда 
		ОписаниеСостояния = "Too Many Requests («слишком много запросов»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 431 Тогда 
		ОписаниеСостояния = "Request Header Fields Too Large («поля заголовка запроса слишком большие»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 444 Тогда 
		ОписаниеСостояния = "Закрывает соединение без передачи заголовка ответа. Нестандартный код";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 449 Тогда 
		ОписаниеСостояния = "Retry With («повторить с»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 451 Тогда 
		ОписаниеСостояния = "Unavailable For Legal Reasons («недоступно по юридическим причинам»)";

	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 500 Тогда 
		ОписаниеСостояния = "Internal Server Error («внутренняя ошибка сервера»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 501 Тогда 
		ОписаниеСостояния = "Not Implemented («не реализовано»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 502 Тогда 
		ОписаниеСостояния = "Bad Gateway («плохой, ошибочный шлюз»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 503 Тогда 
		ОписаниеСостояния = "Service Unavailable («сервис недоступен»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 504 Тогда 
		ОписаниеСостояния = "Gateway Timeout («шлюз не отвечает»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 505 Тогда 
		ОписаниеСостояния = "HTTP Version Not Supported («версия HTTP не поддерживается»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 506 Тогда 
		ОписаниеСостояния = "Variant Also Negotiates («вариант тоже проводит согласование»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 507 Тогда 
		ОписаниеСостояния = "Insufficient Storage («переполнение хранилища»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 508 Тогда 
		ОписаниеСостояния = "Loop Detected («обнаружено бесконечное перенаправление»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 509 Тогда 
		ОписаниеСостояния = "Bandwidth Limit Exceeded («исчерпана пропускная ширина канала»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 510 Тогда 
		ОписаниеСостояния = "Not Extended («не расширено»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 511 Тогда 
		ОписаниеСостояния = "Network Authentication Required («требуется сетевая аутентификация»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 520 Тогда 
		ОписаниеСостояния = "Unknown Error («неизвестная ошибка»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 521 Тогда 
		ОписаниеСостояния = "Web Server Is Down («веб-сервер не работает»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 522 Тогда 
		ОписаниеСостояния = "Connection Timed Out («соединение не отвечает»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 523 Тогда 
		ОписаниеСостояния = "Origin Is Unreachable («источник недоступен»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 524 Тогда 
		ОписаниеСостояния = "A Timeout Occurred («время ожидания истекло»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 525 Тогда 
		ОписаниеСостояния = "SSL Handshake Failed («квитирование SSL не удалось»)";
	ИначеЕсли РезультатHttpЗапроса.КодСостояния = 526 Тогда 
		ОписаниеСостояния = "Invalid SSL Certificate («недействительный сертификат SSL»)";
	Иначе
		ОписаниеСостояния = "";
	КонецЕсли;
	
	ОписаниеОшибки = 	"HTTP сервис вернул ошибку с кодом " 
						+ РезультатHttpЗапроса.КодСостояния 
						+ " " 
						+ ОписаниеСостояния 
						+ " " 
						+ РезультатHttpЗапроса.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТекстОшибки = ОписаниеОшибки;
	Иначе
		ТекстОшибки = ТекстОшибки + "; " + ОписаниеОшибки;
	КонецЕсли;
	
	Если ВывестиСообщениеОбОшибке Тогда
		Сообщить(ОписаниеОшибки);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСтрокуПараметровGetЗапроса(СтруктураПараметров) Экспорт
	
	РезСтрока = "";
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Возврат РезСтрока;
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		РезСтрока = РезСтрока + ЭлементСтруктуры.Ключ + "=" + СокрЛП(ЭлементСтруктуры.Значение) + "&";
	КонецЦикла;
	
	РезСтрока = Лев(РезСтрока, СтрДлина(РезСтрока) - 1);
	
	Если НЕ ПустаяСтрока(РезСтрока) Тогда
		РезСтрока = "?" + РезСтрока;
	КонецЕсли;
	
	Возврат РезСтрока;

КонецФункции

Функция ПолучитьСоответствиеПараметровПоСтрокеGetЗапроса(СтрокаЗапроса) Экспорт
	
	Рез = Новый Соответствие;
	
	СтрокаПараметров = Прав(СтрокаЗапроса, СтрДлина(СтрокаЗапроса) - Найти(СтрокаЗапроса,"?"));
	Попытка
		МассивПараметров = Вычислить("СтрРазделить(СтрокаПараметров,""&"",Ложь)");
	Исключение
		МассивПараметров = Вычислить("СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметров,""&"")");
	КонецПопытки;
	
	Для Каждого ЭлементПараметра Из МассивПараметров Цикл
		
		Попытка
			ДанныеПараметра = Вычислить("СтрРазделить(ЭлементПараметра,""="",Истина)");
		Исключение
			ДанныеПараметра = Вычислить("СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЭлементПараметра,""="")");
		КонецПопытки;
		
		Если ДанныеПараметра.Количество()<2 Тогда 
			Продолжить; 
		КонецЕсли;
		
		Рез.Вставить(СокрЛП(ДанныеПараметра[0]), СокрЛП(ДанныеПараметра[1])); 
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

//++Леонов 22.07.2015
Функция ВыделитьНужныеСимволыВСтроке(ЗНАЧ ИсходнаяСтрока, СписокСимволов, Исключать=Истина,СимволЗамены="") Экспорт
	
	СтрокаРезультат = "";
	Если Исключать Тогда//Убираем из строки все символы из списка символов		
		СтрокаРезультат = ИсходнаяСтрока;
		Для Инд=1 ПО СтрДлина(СписокСимволов) Цикл
			ТекСимвол = Сред(СписокСимволов,Инд,1);
			СтрокаРезультат = СтрЗаменить(СтрокаРезультат,ТекСимвол,СимволЗамены);
		КонецЦикла;
	Иначе//Оставляем в строке только символы из списка символов
		Для Инд=1 ПО СтрДлина(ИсходнаяСтрока) Цикл
			ТекСимвол = Сред(ИсходнаяСтрока,Инд,1);
			Если Найти(ВРЕГ(СписокСимволов),ВРег(ТекСимвол))>0 Тогда
				СтрокаРезультат = СтрокаРезультат + ТекСимвол;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтрокаРезультат;
	
КонецФункции
//--Леонов 22.07.2015

Функция ЕстьСвойство(ОбъектПроверки, ИмяСвойства) Экспорт
	
	СтруктураДляПроверки = Новый Структура(ИмяСвойства, "ТестовоеЗначениеДляПроверкиРеквизита");
	ЗаполнитьЗначенияСвойств(СтруктураДляПроверки, ОбъектПроверки);
	
	Возврат СтруктураДляПроверки[ИмяСвойства] <> "ТестовоеЗначениеДляПроверкиРеквизита"; 
		
КонецФункции

// >> 19.04.2018 Леонов Александр


// 05.04.2017 Леонов Александр - Добавил

//anton   Функции переопределены для подержки 1С 8.2

//Функция ПолучитьТекстJSON(СтруктураДанных) Экспорт
//	
//	ЗаписьJSON = Новый ЗаписьJSON;
//	ЗаписьJSON.УстановитьСтроку();
//	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
//	
//	Возврат ЗаписьJSON.Закрыть();
//	
//КонецФункции

// 01.08.2017 Леонов Александр - Добавил e1cib
//Функция ПолучитьОбъектИзJSON(ТекстJSON) Экспорт
//	Чтение = Новый ЧтениеJSON;
//	Чтение.УстановитьСтроку(СтрЗаменить(ТекстJSON,"==","NevW"));
//	
//	Возврат ПрочитатьJSON(Чтение,,);
//КонецФункции

//anton   Функции переопределены для подержки 1С 8.2


//Работа с JSON  для версий 1С менее 8.3.6

Функция ПреобразоватьвСистему(Число10,система) Экспорт
	Если система > 36 или система < 2 тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система*(ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	КонецЦикла;
	
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	Если Нечётное тогда
		СтрокаСистема = "0"+СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
КонецФункции

Функция URLEncode(стр) Экспорт	
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимвола(Знак);
		
		если ((Знак>="a")и(Знак<="z")) или
			 ((Знак>="A")и(Знак<="Z")) или
			 ((Знак>="0")и(Знак<="9")) тогда
			Итог=Итог+Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
			Иначе
				Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
КонецФункции

Функция СформироватьСтрокуJSONИзМассива(Объект)
	СтрокаJSON = "[";
	
	Для каждого Элемент Из Объект Цикл
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент + """";
		ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент), Символы.НПП, "");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
		ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
		Иначе
			СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "]";
КонецФункции

Функция СформироватьСтрокуJSONИзСтруктуры(Объект)
	СтрокаJSON = "{"+Символы.ПС;
	
	Для каждого Элемент Из Объект Цикл
		Если Элемент.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + """" + ": ";
		
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент.Значение + """";
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, "");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
		Иначе
			СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ","+Символы.ПС;
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 2) = ","+Символы.ПС Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-2);
	КонецЕсли;
	
	СтрокаJSON = СтрокаJSON + Символы.ПС;	
		
	Возврат СтрокаJSON + "}";
КонецФункции

Функция СформироватьСтрокуJSON(Объект) Экспорт
	СтрокаJSON = "";
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Объект);
	ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
		СоставСтруктуры = "";
		Для каждого Колонка Из Объект.Колонки Цикл
			СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
		КонецЦикла;
		
		МассивСтрок = Новый Массив;
		Для каждого Строка Из Объект Цикл
			СтруктураКолонок = Новый Структура(СоставСтруктуры);
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
			МассивСтрок.Добавить(СтруктураКолонок);
		КонецЦикла;
		
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(МассивСтрок);
	КонецЕсли;
	
	Возврат СтрокаJSON;
КонецФункции

Процедура ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, ТипДанных)
	ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));	
	НомерЗначения = 0;
	
	Пока ТекстJSON <> "" Цикл
		ПервыйСимвол = Лев(ТекстJSON, 1);
		Если ПервыйСимвол = "{" Тогда
			Значение = Новый Структура;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			ИначеЕсли ТипДанных = "Массив" Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
		ИначеЕсли ПервыйСимвол = "[" Тогда
			Значение = Новый Массив;
			ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
			
			Если ТипДанных = "Структура" Тогда
				Результат.Вставить("Значение" + ?(НомерЗначения = 0, "", НомерЗначения), Значение);
				НомерЗначения = НомерЗначения + 1;
			Иначе
				Результат.Добавить(Значение);
			КонецЕсли;
		ИначеЕсли ПервыйСимвол = "}" И ТипДанных = "Структура" Тогда
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
		ИначеЕсли ПервыйСимвол = "]" И ТипДанных = "Массив" Тогда
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			Если Лев(ТекстJSON, 1) = "," Тогда
				ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
			КонецЕсли;
			
			Возврат;
		Иначе
			Если ТипДанных = "Структура" Тогда
				
				Поз = Найти(ТекстJSON, ":");
				Если Поз = 0 Тогда
					Прервать;
				КонецЕсли;
				
				ИмяЗначения = СокрЛП(Лев(ТекстJSON, Поз-1));
				
				ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз+1));
				
				Если Лев(ТекстJSON, 1) = "{" Тогда
					Значение = Новый Структура;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Структура");
				ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
					Значение = Новый Массив;
					ЗаполнитьДанныеИзОтветаJSON(Значение, ТекстJSON, "Массив");
				Иначе
					Поз = 0;
					Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
						Символ = Сред(ТекстJSON, Сч, 1);
						Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
							Поз = Сч;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если Поз = 0 Тогда
						Значение = ТекстJSON;
						ТекстJSON = "";
					Иначе
						Значение = Лев(ТекстJSON, Поз-1);
						ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
					КонецЕсли;
					
					Значение = СокрЛП(Значение);
				КонецЕсли;
				
				Результат.Вставить(ИмяЗначения, Значение);
			ИначеЕсли ТипДанных = "Массив" Тогда
				Поз = 0;
				Для Сч = 1 По СтрДлина(ТекстJSON) Цикл
					Символ = Сред(ТекстJSON, Сч, 1);
					Если Символ = "," ИЛИ Символ = "]" ИЛИ Символ = "}" Тогда
						Поз = Сч;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Поз = 0 Тогда
					Значение = ТекстJSON;
					ТекстJSON = "";
				Иначе
					Значение = Лев(ТекстJSON, Поз-1);
					ТекстJSON = СокрЛП(Сред(ТекстJSON, Поз + ?(Сред(ТекстJSON, Поз, 1) = ",", 1, 0)));
				КонецЕсли;
				
				Значение = СокрЛП(Значение);
				
				Результат.Добавить(Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач ТекстJSON) Экспорт
	Результат = Новый Структура;
	
	ЗапятыеСПереводомСтроки = ","+Символы.ПС;	
	
	
	Если Найти(ТекстJSON, ЗапятыеСПереводомСтроки) = 0 Тогда
		
		ЗапятыеСКавычкой = ",""";
		Если Найти(ТекстJSON, ",") > 0 Тогда
			ТекстJSON = СтрЗаменить(ТекстJSON, ЗапятыеСКавычкой, "####");
			ТекстJSON = СтрЗаменить(ТекстJSON, ",", "****");
			ТекстJSON = СтрЗаменить(ТекстJSON, "####", ЗапятыеСКавычкой);
		КонецЕсли;
		
		НачалоМассива = "[""";	
		Если Найти(ТекстJSON, "[") > 0 Тогда
			ТекстJSON = СтрЗаменить(ТекстJSON, НачалоМассива, "####");
			ТекстJSON = СтрЗаменить(ТекстJSON, "[", "@@@@");
			ТекстJSON = СтрЗаменить(ТекстJSON, "####", НачалоМассива);
		КонецЕсли;
		
		КонецМассива= """]";
		Если Найти(ТекстJSON, "]") > 0 Тогда
			ТекстJSON = СтрЗаменить(ТекстJSON, КонецМассива, "####");
			ТекстJSON = СтрЗаменить(ТекстJSON, "]", "&&&&");
			ТекстJSON = СтрЗаменить(ТекстJSON, "####", КонецМассива);
		КонецЕсли;
		
		
	Иначе
		ТекстJSON = СтрЗаменить(ТекстJSON, ЗапятыеСПереводомСтроки, "####");
		ТекстJSON = СтрЗаменить(ТекстJSON, ",", " ");
		ТекстJSON = СтрЗаменить(ТекстJSON, "####", ЗапятыеСПереводомСтроки);		
	КонецЕсли;
	
	ТекстJSON = СтрЗаменить(ТекстJSON, "\""", """");
	ТекстJSON = СтрЗаменить(ТекстJSON, """", "");	
	
	Если Лев(ТекстJSON, 1) = "{" Тогда
		ЗаполнитьДанныеИзОтветаJSON(Результат, ТекстJSON, "Структура");
	ИначеЕсли Лев(ТекстJSON, 1) = "[" Тогда
		МассивДанных = Новый Массив;
		ЗаполнитьДанныеИзОтветаJSON(МассивДанных, ТекстJSON, "Массив");
		
		Результат.Вставить("Значение", МассивДанных);
	КонецЕсли;
		
	Возврат Результат;
КонецФункции

