#Если Клиент Тогда

// Выполняет поиск ссылок на указанный объект
//
// Параметры
//  Идентификатор  – Строка – Представление ссылки в виде идентификатора
//
Процедура ПоискСсылокНаОбъект(ИдентификаторПредставление,ЭтаФорма,ВерхСписка,ВысотаСписка,ЭтаФормаСписка = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ИдентификаторПредставление) Тогда
		Предупреждение("Не выбран объект для поиска!");
		Возврат;
	КонецЕсли;
	
	ПолеНайденныеСсылки = ЭтаФорма.ЭлементыФормы.Найти("НайденныеСсылки");
	Если ПолеНайденныеСсылки = неопределено Тогда
		
		ЭтаФорма.Высота = ЭтаФорма.Высота + ВысотаСписка;
		Если ЭтаФормаСписка  Тогда
		    ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ЭтаФорма.Панель,ГраницаЭлементаУправления.Верх);
			ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Высота = ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Высота - ВысотаСписка;
		КонецЕсли; 
		ПолеНайденныеСсылки = ЭтаФорма.ЭлементыФормы.Добавить(Тип("ТабличноеПоле"),
		"НайденныеСсылки",Истина,);
		ПолеНайденныеСсылки.УстановитьДействие("Выбор",Новый Действие("НайденныеСсылкиВыбор"));
		ПолеНайденныеСсылки.УстановитьДействие("ПриВыводеСтроки",Новый Действие("НайденныеСсылкиПриВыводеСтроки"));
		
		ПолеНайденныеСсылки.Верх = ВерхСписка; //155;
		ПолеНайденныеСсылки.Лево = 8;     //513-497     283-144
		ПолеНайденныеСсылки.Ширина = ЭтаФорма.Ширина - 16;
		ПолеНайденныеСсылки.Высота = ВысотаСписка - 3;  //189;
		ПолеНайденныеСсылки.ТолькоПросмотр = Истина;
		ПолеНайденныеСсылки.ИзменятьПорядокСтрок = Истина;
		ПолеНайденныеСсылки.ИзменятьСоставСтрок = Ложь;
		// установка привязок
		Если ЭтаФормаСписка  Тогда
			ПолеНайденныеСсылки.УстановитьПривязку(ГраницаЭлементаУправления.Верх,ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок,ГраницаЭлементаУправления.Низ);
		Иначе
			ПолеНайденныеСсылки.УстановитьПривязку(ГраницаЭлементаУправления.Верх,);
		КонецЕсли;
		ПолеНайденныеСсылки.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ЭтаФорма.Панель,ГраницаЭлементаУправления.Низ);
		ПолеНайденныеСсылки.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭтаФорма.Панель,ГраницаЭлементаУправления.Право);
		ПолеНайденныеСсылки.Данные = "НайденныеСсылки";
		ЭтаФорма.ЭлементыФормы.ОсновныеДействияФормы.УстановитьПривязку(ГраницаЭлементаУправления.Верх,ЭтаФорма.Панель,ГраницаЭлементаУправления.Низ);
		
		Если ЭтаФормаСписка  Тогда
			// добавим сплиттер
			Разделитель1 = ЭтаФорма.ЭлементыФормы.Добавить(Тип("Разделитель"),
				"Разделитель1",Истина,);
			Разделитель1.Верх  = ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Верх
				+ ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.Высота;
			Разделитель1.Лево  = 8;
			Разделитель1.Ширина = ЭтаФорма.Ширина - 16;
			Разделитель1.Высота = 4;  //189;

			Разделитель1.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Разделитель1,ГраницаЭлементаУправления.Низ);
			Разделитель1.УстановитьПривязку(ГраницаЭлементаУправления.Низ,ЭтаФорма.Панель,ГраницаЭлементаУправления.Верх);
			Разделитель1.УстановитьПривязку(ГраницаЭлементаУправления.Право,ЭтаФорма.Панель,ГраницаЭлементаУправления.Право);
			
			ПолеНайденныеСсылки.УстановитьПривязку(ГраницаЭлементаУправления.Верх,Разделитель1,ГраницаЭлементаУправления.Низ);
			ЭтаФорма.ЭлементыФормы.РегистрСведенийСписок.УстановитьПривязку(ГраницаЭлементаУправления.Низ,Разделитель1,ГраницаЭлементаУправления.Верх);
        КонецЕсли;

		// Установим горизонтальный скроллер
		ПолеНайденныеСсылки.ГоризонтальнаяПолосаПрокрутки = ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически;
	КонецЕсли; 
	
	МассивЗаменяемых = Новый Массив;
	МассивЗаменяемых.Добавить(ИдентификаторПредставление);
	ЭтаФорма.НайденныеСсылки = НайтиПоСсылкам(МассивЗаменяемых);
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(20);
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, ,КС);
	ЭтаФорма.НайденныеСсылки.Колонки.Добавить("Тип",ОписаниеТиповС,"Тип объекта",);
	ПолеНайденныеСсылки.СоздатьКолонки();
	ПолеНайденныеСсылки.Колонки.Данные.Ширина = 30;
	ПолеНайденныеСсылки.Колонки.Тип.Ширина = 15;
	ПолеНайденныеСсылки.Колонки.Метаданные.Ширина = 15;
	ПолеНайденныеСсылки.Колонки.Ссылка.Ширина = 10;
	ПолеНайденныеСсылки.Колонки.Сдвинуть(ПолеНайденныеСсылки.Колонки.Данные,-1);
	ПолеНайденныеСсылки.Колонки.Сдвинуть(ПолеНайденныеСсылки.Колонки.Тип,-2);
	ПолеНайденныеСсылки.Колонки.Сдвинуть(ПолеНайденныеСсылки.Колонки.Метаданные,-1);
	Если ЭтаФорма.НайденныеСсылки.Количество() = 0 Тогда
		Предупреждение("Ничего не найдено");
	КонецЕсли;
	
КонецПроцедуры // ПоискСсылокНаОбъект()

#КонецЕсли
