
&НаКлиенте
Процедура Проверить(Команда)
	
	ТекстОшибки="";
	Если ИмяКоманды = "Расчет" Тогда
		
		ЗначKPI = Справочники.KPI.РасчитатьKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Сотрудник, Сотрудник.Должность, ТекущийKPI, ТекстОшибки);
		
	ИначеЕсли ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		
		ЗначKPI = Справочники.KPI.РасчитатьKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания),Сотрудник, Сотрудник.Должность, ТекущийKPI,ТекстОшибки,,истина,ПланФакт);
		
	ИначеЕсли ИмяКоманды = "ПостОбработка" Тогда
		
		ЗначKPI = Справочники.KPI.Постобработка(ПланФакт, ТекущийKPI, ТекстОшибки);

	КонецЕсли;
	
	Сообщить(ТекстОшибки+"Значение="+ЗначKPI);

КонецПроцедуры

&НаКлиенте
Процедура Расшифровка(Команда)
	
	ТекстОшибки="";
	
	Если ИмяКоманды = "Расчет" Тогда

		ТекстФ = Справочники.KPI.ПоказатьРасчетKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания), Сотрудник, Сотрудник.Должность, ТекущийKPI, ТекстОшибки);
		СпПок = ПолучитьСписокПараметров(ТекущийKPI.Формула);
		СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.Формула);
	ИначеЕсли ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		
		ТекстФ = Справочники.KPI.ПоказатьРасчетKPI(Период.ДатаНачала,КонецДня(Период.ДатаОкончания), Сотрудник, Сотрудник.Должность, ТекущийKPI,ТекстОшибки,истина,ПланФакт,Плановая);
		
		Если Плановая тогда
			СпПок = ПолучитьСписокПараметров(ТекущийKPI.ФормулаДляРасчетаПлановойПремии);
			СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.ФормулаДляРасчетаПлановойПремии);
		Иначе
			СпПок = ПолучитьСписокПараметров(ТекущийKPI.ФормулаДляРасчетаПремии);
			СпДоп = ПолучитьСписокДопПараметров(ТекущийKPI.ФормулаДляРасчетаПремии);
		КонецЕсли;
		
	КонецЕсли;
	
	ТабличныйДокумент=Новый ТабличныйДокумент;
	Макет = Отчеты.ИндивидуальныйЛистРасчета.ПолучитьМакет("РасшифровкаПоказателя");
	Обл = Макет.ПолучитьОбласть("Шапка");
	Обл.Параметры.Показатель=ТекущийKPI;
	Обл.Параметры.Формула=ТекстФ;
	
	ТабличныйДокумент.Вывести(Обл);
	Для Каждого ТекЭл из СпПок Цикл
		Обл=Макет.ПолучитьОбласть("Показатель");
		Обл.Параметры.Показатель=ТекЭл.Значение;
		Обл.Параметры.ЕстьРасшифровка="Расшифровка:"+ТекЭл.Значение.ИмеетДетализацию;
		ТабличныйДокумент.Вывести(Обл);
		Если  ТекЭл.Значение.ИмеетДетализацию Тогда
			Об = ТекЭл.Значение.ПолучитьОбъект();
			ТР = Справочники.ПоказателиДляРасчетаМотивации.Расшифровка(Об, Период.ДатаНачала, КонецДня(Период.ДатаОкончания),Сотрудник);
			Выс = ТабличныйДокумент.ВысотаТаблицы;
			ТабличныйДокумент.Вывести(ТР);
			Для а = 1 по ТР.ВысотаТаблицы цикл
				Для а1 = 1 по ТР.ШиринаТаблицы цикл
					б = а+Выс;
					ТабличныйДокумент.Область("R"+Формат(б,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")+"C"+Формат(а1,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")).ШиринаКолонки=ТР.Область("R"+Формат(а,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")+"C"+Формат(а1,"ЧЦ=6; ЧРД=; ЧРГ=; ЧГ=")).ШиринаКолонки;
				конеццикла;
			конеццикла;
		КонецЕсли;
	КонецЦикла;	
    Для Каждого ТекЭл из СпДоп Цикл
		Обл=Макет.ПолучитьОбласть("Показатель");
		Обл.Параметры.Показатель="Параметр "+ТекЭл.Значение;
		ТабличныйДокумент.Вывести(Обл);
	КонецЦикла;	
	
	ТабличныйДокумент.ОтображатьСетку=Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки=Ложь;
	ТабличныйДокумент.ТолькоПросмотр=Истина;
	ТабличныйДокумент.Показать("Расшифровка "+ТекущийKPI);
    ТабличныйДокумент.ПоказатьУровеньГруппировокСтрок(0);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметров(Знач ТекФормула)
	
	СпПар=Новый СписокЗначений;
	Найден=истина;
	Пока Найден Цикл
		Поз1=Найти(ТекФормула,"[");
		Поз2=Найти(ТекФормула,"]");
		Если Поз1>0 Тогда
			Найден=истина;
			ТекКод=Сред(ТекФормула,Поз1+1,Поз2-Поз1-1);
			ТекФормула=Сред(ТекФормула,Поз2+1);
			Эл=Справочники.ПоказателиДляРасчетаМотивации.НайтиПоКоду(ТекКод,,,);
			Если СпПар.НайтиПоЗначению(Эл)=Неопределено Тогда
				НовЗн=СпПар.Добавить();
				НовЗн.Значение=Эл;
				НовЗН.Представление="["+ТекКод+"]";
			КонецЕсли;
		Иначе
			Найден=ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат  СпПар;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДопПараметров(Знач ТекФормула)
	
	СпПар=Новый СписокЗначений;
	 Найден=истина;
	 Пока Найден Цикл
		 Поз1=Найти(ТекФормула,"ͼ");
		 Поз2=Найти(ТекФормула,"ͽ");
		 Если Поз1>0 Тогда
			 Найден=истина;
			 ТекКод=Сред(ТекФормула,Поз1+1,Поз2-Поз1-1);
			 ТекФормула=Сред(ТекФормула,Поз2+1);
			 Эл=Справочники.ПараметрыНастройкиKPI.НайтиПоКоду(ТекКод,,,);
			 Если СпПар.НайтиПоЗначению(Эл)=Неопределено Тогда
				 НовЗн=СпПар.Добавить();
				 НовЗн.Значение=Эл;
				 НовЗН.Представление="ͼ"+ТекКод+"ͽ";
			 КонецЕсли;
		 Иначе
			 Найден=ложь;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат  СпПар;
 КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала    = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	Период.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ТекущийKPI = Параметры.ТекущийKPI;
	
	Плановая = Параметры.Плановая;
	
	ИмяКоманды = Параметры.ИмяКоманды;
	Если ИмяКоманды = "Премия" 
		ИЛИ ИмяКоманды = "ПлановаяПремия" Тогда
		 Элементы.ПланФакт.Видимость = Истина;
		 Элементы.Период.Видимость = Истина;
		 Элементы.Сотрудник.Видимость = Истина;
		 Элементы.ФормаРасшифровка.Видимость=Истина;
	 ИначеЕсли ИмяКоманды = "ПостОбработка" Тогда
		 Элементы.ПланФакт.Видимость = Истина;
		 Элементы.Период.Видимость = Ложь;
		 Элементы.Сотрудник.Видимость = Ложь;
		 Элементы.ФормаРасшифровка.Видимость=Ложь;
	Иначе	 
		 Элементы.ПланФакт.Видимость = Ложь;
		 Элементы.Период.Видимость = Истина;
		 Элементы.Сотрудник.Видимость = Истина;
		 Элементы.ФормаРасшифровка.Видимость=Истина;
	КонецЕсли;	
		
КонецПроцедуры
