
Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("Модель");
	СтруктураСвойств.Вставить("Автомобиль");
	
	Возврат СтруктураСвойств;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
	
	Автомобиль = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Автомобиль").Значение;
	СписокАвтомобилей = Новый СписокЗначений;
	Если ЗначениеЗаполнено(Автомобиль) И КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Автомобиль").Использование Тогда
		СписокАвтомобилей.Добавить(Автомобиль.Модель);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Модели.Ссылка КАК Модель
			|ИЗ
			|	Справочник.Модели КАК Модели";
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СписокАвтомобилей.Добавить(ВыборкаДетальныеЗаписи.Модель);
		КонецЦикла;
	КонецЕсли;
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("АвтомобильМодель", СписокАвтомобилей);
	
	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры