Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем НДС18 Экспорт;
Перем НДС118 Экспорт;
Перем Брэнд Экспорт;
Перем СуммаМаржи Экспорт;

Функция ПолучитьТрейдИнПлан() Экспорт
////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|Сумма(ТТ_План_TradeInСрезПоследних.План) КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьТрейдИнПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.План КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьТрейдИнПланПремия()  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|ТТ_План_TradeInСрезПоследних.БазоваяПремия КАК Премия
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Премия=ВыборкаДетальныеЗаписи.Премия;
	КонецЦикла;
	Возврат Премия;
КонецФункции	

Функция ПолучитьТрейдИнФакт() Экспорт
	
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)";
		
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", ВернутьБрэнд());
		Рез=Запрос.Выполнить().Выгрузить();
		Количество=Рез.Количество();
	Возврат Количество;
КонецФункции	

Функция ПолучитьНовыеПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланНовые КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьФинПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланФинПродукт КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьДопПланСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланДоп КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	

Функция ПолучитьНовыеПланСуммаСотрудник(Сотрудник) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|ТТ_План_TradeInСрезПоследних.ПланНовыеСумма КАК План
		|ИЗ
		|РегистрСведений.ТТ_План_TradeIn.СрезПоследних(&Период) КАК ТТ_План_TradeInСрезПоследних
		|ГДЕ
		|ТТ_План_TradeInСрезПоследних.Сотрудник = &Сотрудник
		|И ТТ_План_TradeInСрезПоследних.Бренд = &Бренд";

	Запрос.УстановитьПараметр("Период", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Бренд", БрендДляПоказателей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Количество=ВыборкаДетальныеЗаписи.План;
	КонецЦикла;
	Возврат Количество;
КонецФункции	


Функция Печать(ТабДокумент) Экспорт
	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаЗП");
	
	Макет = ПолучитьМакет("Макет");
	
	Брэнд = ВернутьБрэнд();
		
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Брэнд=Брэнд;
	ТабДокумент.Вывести(ОбластьМакета);	
		
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
	СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	
	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(СтрСотрудников);
		ОбластьМакета.Параметры.ПроцентШт=Окр((СтрСотрудников.ФактПродажиКоличество/СтрСотрудников.ПланПродажиКоличество)*100,2);
		ТабДокумент.Вывести(ОбластьМакета);	
		
		
		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	СУММА(Реализация.СуммаПродажи - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаДопОборудования - СебестоимостьЗН.СС_П_ТТ - СебестоимостьЗН.СС_П_Кунова) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

//		|	СУММА(Реализация.СуммаНДСПродажи - (ВнутренниеУслуги.СуммаКомплектации *"+ НДС18+"/"+НДС118 +"+ ВнутренниеУслуги.СуммаДопОборудования * "+ НДС18+"/"+НДС118 +")) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
//		|	СУММА(Реализация.СебестоимостьОборот - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаПСО - Реализация.СуммаНДСВходящийОборот - ВнутренниеУслуги.СуммаКомплектацииП - ВнутренниеУслуги.СуммаДопОборудования - ВнутренниеУслуги.СуммаОстальныеВидыРемонта - ВнутренниеУслуги.СуммаДопОборудванияП) КАК Себестоимость,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр);   // kunova 16.06.2016 
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок1");	
		ТабДокумент.Вывести(ОбластьМакета);
		СВозмещение=0;
		ИтогМаржа=0;
		ВозмещениеИтог=0;
		ВозмещениеУтилИтог=0;
		СкидкаУчрИтог=0;

		Пока выборка.Следующий() Цикл	
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ или БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
				СВозмещение = (Выборка.Возмещение + Выборка.ВозмещениеУтил + Выборка.СкидкаУчр );  
			Иначе
				СВозмещение = (Выборка.Возмещение/НДС18К + Выборка.ВозмещениеУтил/НДС18К + Выборка.СкидкаУчр );  
			КонецЕсли;	
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1;
			ИтогМаржа = ИтогМаржа + Выборка.Маржа;
				
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка1");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.СуммаПоСтроке = выборка.Маржа + СВозмещение;
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ или БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
				
				ВозмещениеИтог=Выборка.Возмещение+ВозмещениеИтог;
				ВозмещениеУтилИтог=Выборка.ВозмещениеУтил+ВозмещениеУтилИтог;
				СкидкаУчрИтог=Выборка.СкидкаУчр+СкидкаУчрИтог;
			Иначе
				ОбластьМакета.Параметры.Возмещение = Выборка.Возмещение/НДС18К;
				ОбластьМакета.Параметры.ВозмещениеУтил = Выборка.ВозмещениеУтил/НДС18К;
				ВозмещениеИтог=Выборка.Возмещение/НДС18К+ВозмещениеИтог;
				ВозмещениеУтилИтог=Выборка.ВозмещениеУтил/НДС18К+ВозмещениеУтилИтог;
				СкидкаУчрИтог=Выборка.СкидкаУчр+СкидкаУчрИтог;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			
			ТабДокумент.Вывести(ОбластьМакета);			
		КонецЦикла;
		
		//СтрСотрудников.ФактПродажиКоличество = КоличествоПродано;
		//СтрСотрудников.СуммаАМФакт = СуммаПроданных;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги1");
		ОбластьМакета.Параметры.Итог1 = СуммаПроданных;
		ОбластьМакета.Параметры.МаржаИтог = ИтогМаржа;
		ОбластьМакета.Параметры.ВозмещениеИтог = ВозмещениеИтог;
		ОбластьМакета.Параметры.ВозмещениеУтилИтог = ВозмещениеУтилИтог;
		ОбластьМакета.Параметры.СкидкаУчрИтог = СкидкаУчрИтог;
		
		
		ТабДокумент.Вывести(ОбластьМакета);		
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента /"+ НДС118+"*"+НДС18 +" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер = &Менеджер
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок2");	
		ТабДокумент.Вывести(ОбластьМакета);

		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019") Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			////ИначеЕсли (Выборка.ВидРемонта = Справочники.ВидыРемонта.НайтиПоКоду("00000001")) И (Выборка.ЗаказНаряд.Контрагент = Справочники.Контрагенты.НайтиПоКоду("ЦБ001314")) Тогда
			////	НоваяСтрока.СебестоимостьРаб = Выборка.СуммаДокумента/100*НДС18Ч + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка2");
			ОбластьМакета.Параметры.Документ=Выборка.ЗаказНаряд;
			ОбластьМакета.Параметры.Сумма=НоваяСтрока.Работы + НоваяСтрока.Зч - НоваяСтрока.Себестоимость - НоваяСтрока.СебестоимостьРаб;
			ТабДокумент.Вывести(ОбластьМакета);
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.Сумма=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;
			
		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ = ИтогПоРаботам+ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		//СтрСотрудников.ФактПродажиТюнинга =ИТОГ;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги2");
		ОбластьМакета.Параметры.Итог2=ИТОГ;
		ТабДокумент.Вывести(ОбластьМакета);
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/100)*8)  
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис,
		|	СУММА(ЕСТЬNULL(ВыпискаСостав.СуммаПриход, 0)) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК АВ,
		|	ЗначенияСвойствОбъектов.Значение КАК ДобровольноеКАСКО,
		|	ЗначенияСвойствОбъектов1.Значение КАК КАСКОСУлицы,
		|	ЗначенияСвойствОбъектов2.Значение КАК ОСАГОСУлицы
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ВыпискаСостав.Сделка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоДобровольноеКАСКО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов1
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов1.Объект
		|			И (ЗначенияСвойствОбъектов1.Свойство = &КАСКОСУлицы)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов2
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов2.Объект
		|			И (ЗначенияСвойствОбъектов2.Свойство = &ОСАГОСУлицы)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	ЗначенияСвойствОбъектов1.Значение,
		|	ЗначенияСвойствОбъектов2.Значение,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/100)*8)  
		|	КОНЕЦ  КАК КВ,
		//|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+")  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК КВ,
		|	ЗначенияСвойствОбъектов.Значение КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02072"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("СвойствоДобровольноеКАСКО", СвойствоДобровольноеКАСКО);
		Запрос.УстановитьПараметр("КАСКОСУлицы", КАСКОСУлицы);
		Запрос.УстановитьПараметр("ОСАГОСУлицы", ОСАГОСУлицы);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
				
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок3");	
		ТабДокумент.Вывести(ОбластьМакета);
		
		ИтогАВ=0;
		ИтогКВ=0;
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;

			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.КВ,2);
				ИтогКВ=ИтогКВ+Окр( ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				ИтогАВ=ИтогАВ+Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
			КонецЕсли;	
			
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка3");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСсылка);
			ТабДокумент.Вывести(ОбластьМакета);
			
			СтрТТЗ.Сумма=НоваяСтрока.Сумма;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги4");
		ОбластьМакета.Параметры.ИтогКВ= ИтогКВ;
		ОбластьМакета.Параметры.ИтогАВ= ИтогАВ;
		ТабДокумент.Вывести(ОбластьМакета);

		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Свернуть("МодельГруппа, НаименованиеФинПродукта, МесяцПродажи", "Сумма");
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		//СтрСотрудников.ФактФинПродукт = ТаблицаРезультат.Итог("Сумма");	
				
		ОбластьМакета = Макет.ПолучитьОбласть("Итоги3");
		ОбластьМакета.Параметры.Итог3= ТаблицаРезультат.Итог("Сумма");
		ТабДокумент.Вывести(ОбластьМакета);
		
		////  TradeIn
		
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер=&Менеджер";
		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Рез=Запрос.Выполнить().Выбрать();
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок4");
		ТабДокумент.Вывести(ОбластьМакета);	

		Пока Рез.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Расшифровка4");
			ОбластьМакета.Параметры.ДокументПоступления			 = Рез.ПоступлениеАвтомобилей;
			ОбластьМакета.Параметры.Заказ	 = Рез.Значение;
		ТабДокумент.Вывести(ОбластьМакета);		
		КонецЦикла;
		
		
		ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
		ТабДокумент.Вывести(ОбластьМакета);
		
		//Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		//	ОбластьМакета = Макет.ПолучитьОбласть("ВАЗЗаголовок");
		//	ТабДокумент.Вывести(ОбластьМакета);
		//	
		//    ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаЗП");
		//	Для Каждого СтрТТЗ из ТТЗ Цикл
		//		Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
		//			Если СтрТТЗ.Автомобиль.Модель.Родитель.Код="ЦБ00001077" Тогда
		//				Премия=(СтрТТЗ.Сумма/100)*СтрСотрудников.Процент;
		//				Если Премия<=5000 Тогда
		//					СтрТТЗ.СуммаЗП=5000;
		//				Иначе	
		//					СтрТТЗ.СуммаЗП=Премия;
		//				КонецЕсли;	                                                                                  
		//			Иначе	
		//				Премия=(СтрТТЗ.Сумма/100)*СтрСотрудников.Процент;
		//				Если Премия<=1500 Тогда
		//					СтрТТЗ.СуммаЗП=1500;
		//				Иначе	
		//					СтрТТЗ.СуммаЗП=Премия;
		//				КонецЕсли;	
		//			КонецЕсли;	
		//		КонецЕсли;	
		//		
		//	ОбластьМакета = Макет.ПолучитьОбласть("ВАЗСтрока");
		//	ОбластьМакета.Параметры.Автомобиль	 = СтрТТЗ.Автомобиль;
		//	ОбластьМакета.Параметры.Маржа	 = СтрТТЗ.Сумма;
		//	ОбластьМакета.Параметры.Премия	 = СтрТТЗ.СуммаЗП;
		//	ТабДокумент.Вывести(ОбластьМакета);
		//	
		//	КонецЦикла;
		//   
		//				
		//КонецЕсли;
		//	ОбластьМакета = Макет.ПолучитьОбласть("ВАЗИтого");
		//	ОбластьМакета.Параметры.ИтогоПремия	 = ТТЗ.Итог("СуммаЗП");
		//	ТабДокумент.Вывести(ОбластьМакета);
			ТТЗ.Очистить();
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОбщийИтог");
	ОбластьМакета.Параметры.ВсегоПланПродажиКоличество = РасчетЗарплаты.Итог("ПланПродажиКоличество");
	ОбластьМакета.Параметры.ВсегоФактПродажиКоличество = РасчетЗарплаты.Итог("ФактПродажиКоличество");
    ОбластьМакета.Параметры.ВсегоСуммаАМПлан           = РасчетЗарплаты.Итог("СуммаАМПлан");
    ОбластьМакета.Параметры.ВсегоСуммаАМФакт           = РасчетЗарплаты.Итог("СуммаАМФакт");
    ОбластьМакета.Параметры.ВсегоПланФинПродукт        = РасчетЗарплаты.Итог("ПланФинПродукт");
    ОбластьМакета.Параметры.ВсегоФактФинПродукт        = РасчетЗарплаты.Итог("ФактФинПродукт");
    ОбластьМакета.Параметры.ВсегоПланПродажиТюнинга    = РасчетЗарплаты.Итог("ПланПродажиТюнинга");
    ОбластьМакета.Параметры.ВсегоФактПродажиТюнинга    = РасчетЗарплаты.Итог("ФактПродажиТюнинга");
    ОбластьМакета.Параметры.ВсегоВсегоДоходПлан        = РасчетЗарплаты.Итог("ВсегоДоходПлан");
    ОбластьМакета.Параметры.ВсегоВсегоДоходФакт        = РасчетЗарплаты.Итог("ВсегоДоходФакт");
    ОбластьМакета.Параметры.ВсегоНачислен              = РасчетЗарплаты.Итог("Начислен");
    ОбластьМакета.Параметры.ВсегоАкция                 = РасчетЗарплаты.Итог("Акция");
    ОбластьМакета.Параметры.ВсегоИтогоСумма            = РасчетЗарплаты.Итог("ИтогоСумма");
    ОбластьМакета.Параметры.ВсегоИтогоСКоэф            = РасчетЗарплаты.Итог("ИтогоСКоэф");
    ОбластьМакета.Параметры.ВсегоTradeInПлан           = РасчетЗарплаты.Итог("TradeInПлан");
    ОбластьМакета.Параметры.ВсегоTradeInФакт           = РасчетЗарплаты.Итог("TradeInФакт");
    ОбластьМакета.Параметры.ВсегоTradeInСумма     	   = РасчетЗарплаты.Итог("TradeInСумма");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
КонецФункции

Функция ВернутьБрэнд() Экспорт
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000031");
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000332");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.Джили Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000707");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000004");		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Возврат справочники.Модели.НайтиПоКоду("ЦБ00000124");
	Иначе
		возврат справочники.Модели.ПустаяСсылка();		
	КонецЕсли;
КонецФункции

Функция ВернутьОклад() Экспорт
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		Возврат 8000;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат 8000;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.Джили Тогда
		Возврат 8000;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Возврат 5000;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Возврат 5000;
	Иначе
		возврат 0;		
	КонецЕсли;
КонецФункции

Функция ВернутьКоэф(Показ)
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		Если Показ >= 1.2 Тогда
			Возврат 2.5;
		ИначеЕсли Показ >= 1 Тогда
			Возврат 2.3;
		ИначеЕсли Показ >= 0.8 Тогда
			Возврат 2;
		Иначе
			Возврат 1.5;
		КонецЕсли;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Если Показ >= 0.8 Тогда
			Возврат 2.5;
		Иначе
			Возврат 1;
		КонецЕсли;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.Джили Тогда
		Если Показ >= 1.2 Тогда
			Возврат 2.3;
		ИначеЕсли Показ >= 0.8 Тогда
			Возврат 2;
		Иначе
			Возврат 1.8;
		КонецЕсли;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Если Показ >= 1.2 Тогда
			Возврат 2.3;
		ИначеЕсли Показ >= 0.8 Тогда
			Возврат 2;
		Иначе
			Возврат 1.8;
		КонецЕсли;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Если Показ >= 1.2 Тогда
			Возврат 2.3;
		ИначеЕсли Показ >= 0.8 Тогда
			Возврат 2;
		Иначе
			Возврат 1.5;
		КонецЕсли;
		
	КонецЕсли;
КонецФункции

Функция ВернутьКоэф2()
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		Возврат 0.7;
	Иначе
		Возврат 0.5;
	КонецЕсли;
	
КонецФункции

Функция ВернутьКоэф3()
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

Функция ВернутьКоэфФин()
	
	Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		Возврат 1;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
		Возврат 0.5;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.Джили Тогда
		Возврат 1;		
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
		Возврат 0.5;
	ИначеЕсли БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
		Возврат 0.5;	
	КонецЕсли;
	
КонецФункции


// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("НачислениеЗарплаты","Начисление заработной платы",Истина);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

Процедура ОбработкаЗаполненияЗП(ПериодНачало, ПериодКонец) Экспорт
	
	ТТЗ=Новый ТаблицаЗначений;
	ТТЗ.Колонки.Добавить("Сотрудник");
	ТТЗ.Колонки.Добавить("Автомобиль");
	ТТЗ.Колонки.Добавить("Сумма");
	ТТЗ.Колонки.Добавить("СуммаЗП");
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	
	Брэнд = ВернутьБрэнд();
	СуммыВозмещенийВсего=0;
	
	ПланТрейдин=ПолучитьТрейдИнПлан();
	ФактТрейдин=ПолучитьТрейдИнФакт();
	
	Если НЕ ЗначениеЗаполнено(ПланТрейдин) Тогда
		ПланТрейдин=0;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ФактТрейдин) Тогда
		ФактТрейдин=0;
	КонецЕсли;	
	
	ЕстьПланТрейдИн=Ложь;
	Если ФактТрейдин>=ПланТрейдин Тогда
		ЕстьПланТрейдИн=Истина;	
	Иначе
		ЕстьПланТрейдИн=Ложь;	
	КонецЕсли;	
	
	ПремияТрейдин=ПолучитьТрейдИнПланПремия();
	Если НЕ ЗначениеЗаполнено(ПремияТрейдин) Тогда
		ПремияТрейдин=0;
	КонецЕсли;	

	
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
	
	Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
		ПланНовые=ПолучитьНовыеПланСотрудник(СтрСотрудников.Сотрудник);
		Если НЕ Значениезаполнено(ПланНовые) Тогда 
			СтрСотрудников.ПланПродажиКоличество=0;
			Сообщить("Для сотрудника "+СтрСотрудников.Сотрудник+" не заполнен план продаж новых автомобилей, расчет отменен. Заполните план и выполните расчет заново.");
			Продолжить;
		Иначе
			СтрСотрудников.ПланПродажиКоличество=ПланНовые;
		КонецЕсли;	
		
		СтрСотрудников.ПланПродажиКоличество=ПолучитьНовыеПланСотрудник(СтрСотрудников.Сотрудник);
		СтрСотрудников.СуммаАМПлан=ПолучитьНовыеПланСуммаСотрудник(СтрСотрудников.Сотрудник);
		СтрСотрудников.ПланФинПродукт=ПолучитьФинПланСотрудник(СтрСотрудников.Сотрудник);
		СтрСотрудников.ПланПродажиТюнинга=ПолучитьДопПланСотрудник(СтрСотрудников.Сотрудник);

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	СУММА(Реализация.СуммаПродажи - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаДопОборудования - СебестоимостьЗН.СС_П_ТТ - СебестоимостьЗН.СС_П_Кунова) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

//		|	СУММА(Реализация.СуммаНДСПродажи - (ВнутренниеУслуги.СуммаКомплектации *"+ НДС18+"/"+НДС118 +"+ ВнутренниеУслуги.СуммаДопОборудования * "+ НДС18+"/"+НДС118 +")) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
//		|	СУММА(Реализация.СебестоимостьОборот - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаПСО - Реализация.СуммаНДСВходящийОборот - ВнутренниеУслуги.СуммаКомплектацииП - ВнутренниеУслуги.СуммаДопОборудования - ВнутренниеУслуги.СуммаОстальныеВидыРемонта - ВнутренниеУслуги.СуммаДопОборудванияП) КАК Себестоимость,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		Пока выборка.Следующий() Цикл	
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ или БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
				СВозмещение = Выборка.Возмещение + Выборка.ВозмещениеУтил + Выборка.СкидкаУчр;
			Иначе
				СВозмещение = Выборка.Возмещение/НДС18К + Выборка.ВозмещениеУтил/НДС18К + Выборка.СкидкаУчр;
			КонецЕсли;	
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1; 
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.автомобиль;
			СтрТТЗ.Сумма=выборка.Маржа + СВозмещение;
			
		КонецЦикла;
		
		СуммыВозмещенийВсего=СуммыВозмещенийВсего+СВозмещение;
		СтрСотрудников.ФактПродажиКоличество = КоличествоПродано;
		СтрСотрудников.СуммаАМФакт = СуммаПроданных;
		
		//--------------МАРЖА И КОЛИЧЕСТВО---------------Конец-----------	
		
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента / "+НДС118+"*"+НДС18+" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер = &Менеджер
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			Если Выборка.ВидРемонта = ВидРемонтаКомплектация Тогда //Комплектация К
				Если (Строка(Выборка.ЗаказНаряд.Менеджер.Родитель) = "КОРПОРАТИВНЫЙ ОТДЕЛ") И (Строка(Выборка.ЗаказНаряд.Цех) = "Цех слесарный") Тогда
				Иначе
					НоваяСтрока.СебестоимостьРаб = Выборка.СуммаНДСКомплектации + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот - Выборка.СуммаНДС;
				КонецЕсли;
			//ИначеЕсли (Выборка.ВидРемонта = ВидРемонтаДопОборудование) И (Выборка.ЗаказНаряд.Контрагент = ТТ_Контрагент) Тогда
			//	НоваяСтрока.СебестоимостьРаб = Выборка.СуммаДокумента/100*НДС18Ч + Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			Иначе 
				НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			КонецЕсли;	
			
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			СтрТТЗ.Автомобиль=Выборка.ЗаказНаряд.автомобиль;
			СтрТТЗ.Сумма=НоваяСтрока.Работы+НоваяСтрока.Зч-НоваяСтрока.Себестоимость-НоваяСтрока.СебестоимостьРаб;
			
		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ= ИтогПоРаботам++ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		СтрСотрудников.ФактПродажиТюнинга =ИТОГ;
		
		
		//------------ДОП НОВЫЙ------Конец----------
		
		//------------ФИН ПРОДУКТ-------------------
		
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/100)*8)  
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис,
		|	СУММА(ЕСТЬNULL(ВыпискаСостав.СуммаПриход, 0)) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК АВ,
		|	ЗначенияСвойствОбъектов.Значение КАК ДобровольноеКАСКО,
		|	ЗначенияСвойствОбъектов1.Значение КАК КАСКОСУлицы,
		|	ЗначенияСвойствОбъектов2.Значение КАК ОСАГОСУлицы
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ВыпискаСостав.Сделка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоДобровольноеКАСКО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов1
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов1.Объект
		|			И (ЗначенияСвойствОбъектов1.Свойство = &КАСКОСУлицы)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов2
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов2.Объект
		|			И (ЗначенияСвойствОбъектов2.Свойство = &ОСАГОСУлицы)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	ЗначенияСвойствОбъектов1.Значение,
		|	ЗначенияСвойствОбъектов2.Значение,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/100)*8)  
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК КВ,
		|	ЗначенияСвойствОбъектов.Значение КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02072"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		

		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("СвойствоДобровольноеКАСКО", СвойствоДобровольноеКАСКО);
		Запрос.УстановитьПараметр("КАСКОСУлицы", КАСКОСУлицы);
		Запрос.УстановитьПараметр("ОСАГОСУлицы", ОСАГОСУлицы);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
						
		    СтрТТЗ=ТТЗ.Добавить();
			СтрТТЗ.Сотрудник=СтрСотрудников.Сотрудник;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаСтрах.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаСтрах.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаСтрах.ДокументОснование.автомобиль;
				КонецЕсли;	
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
				
				Если ЗначениеЗаполнено(ВыборкаСсылка.СсылкаКредит.ДокументОснование) и ТипЗнч(ВыборкаСсылка.СсылкаКредит.ДокументОснование)=Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
					СтрТТЗ.Автомобиль=ВыборкаСсылка.СсылкаКредит.ДокументОснование.автомобиль;
				КонецЕсли;	
				
			КонецЕсли;
			СтрТТЗ.Сумма=НоваяСтрока.Сумма;
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Свернуть("МодельГруппа, НаименованиеФинПродукта, МесяцПродажи", "Сумма");
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		СтрСотрудников.ФактФинПродукт = ТаблицаРезультат.Итог("Сумма");	
		
		
		
		////  TradeIn
		
		
		Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ЗначенияСвойствОбъектов.Объект КАК ПоступлениеАвтомобилей,
		|ЗначенияСвойствОбъектов.Значение,
		|ЗначенияСвойствОбъектов.Значение.Менеджер
		|
		|ИЗ
		|РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеАвтомобилей
		|И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|И ЗначенияСвойствОбъектов.Объект.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ) И КОНЕЦПЕРИОДА(&КонецПериода, ДЕНЬ)
		|И ЗначенияСвойствОбъектов.Значение.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|И ЗначенияСвойствОбъектов.Значение.Менеджер=&Менеджер";
		
				
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("Менеджер", СтрСотрудников.Сотрудник);
		Рез=Запрос.Выполнить().Выгрузить();
		СтрСотрудников.TradeInФакт=Рез.Количество();
		
		План=ПолучитьТрейдИнПланСотрудник(СтрСотрудников.Сотрудник);
		Если НЕ Значениезаполнено(План) Тогда 
			План=0;
		КонецЕсли;	
		
		Если БрендДляПоказателей = Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			ЕстьПланТрейдИн=Ложь;
		КонецЕсли;	
		
		СтрСотрудников.TradeInПлан= План;
		Если ЕстьПланТрейдИн Тогда // План отдела выполнен
			Если СтрСотрудников.TradeInФакт>=План Тогда
				СтрСотрудников.TradeInСумма=ПремияТрейдин*СтрСотрудников.TradeInФакт*1.5;	
			Иначе
				СтрСотрудников.TradeInСумма=(ПремияТрейдин*СтрСотрудников.TradeInФакт)/2;	
			КонецЕсли;	
		Иначе
			Если СтрСотрудников.TradeInФакт>=План Тогда
				СтрСотрудников.TradeInСумма=ПремияТрейдин*СтрСотрудников.TradeInФакт;	
			Иначе
				СтрСотрудников.TradeInСумма=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Перечисления.ДолжностиДляЗП.Менеджер,0);;	
			КонецЕсли;	
		КонецЕсли;	
		
		Если БрендДляПоказателей<>Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда 
			СтрСотрудников.TradeInСумма=ПремияТрейдин*СтрСотрудников.TradeInФакт;
		КонецЕсли;	
		
		//Итоги и коэфф
		
		ПланНовые=ПолучитьНовыеПланСотрудник(СтрСотрудников.Сотрудник);
		Если НЕ Значениезаполнено(ПланНовые) Тогда 
			СтрСотрудников.ПланПродажиКоличество=0;
		Иначе
			СтрСотрудников.ПланПродажиКоличество=ПланНовые;
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
				СтрСотрудников.К1=СтрСотрудников.ФактПродажиКоличество/СтрСотрудников.ПланПродажиКоличество;
				Если СтрСотрудников.К1>1.2 Тогда
					СтрСотрудников.К1=1.2;
				КонецЕсли;	
				
			Иначе	
				ПроцентФактПланАм=Окр((СтрСотрудников.ФактПродажиКоличество/СтрСотрудников.ПланПродажиКоличество)*100,2);
				СтрСотрудников.К1=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Штуки,Перечисления.ДолжностиДляЗП.Менеджер,ПроцентФактПланАм);
				Если СтрСотрудников.К1>1.1 Тогда
					СтрСотрудников.К1=1.1;
				КонецЕсли;	

			КонецЕсли;	
		КонецЕсли;	
		
		СтрСотрудников.ВсегоДоходФакт =СтрСотрудников.СуммаАМФакт + СтрСотрудников.ФактПродажиТюнинга+ СтрСотрудников.ФактФинПродукт;
		СтрСотрудников.Процент = ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.Менеджер, ПериодКонец)[0];
		СтрСотрудников.Начислен= СтрСотрудников.ВсегоДоходФакт*СтрСотрудников.Процент/100;
		
		//Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
		//    ТТЗ.Свернуть("Сотрудник,Автомобиль","Сумма,СуммаЗП");
		//	Для Каждого СтрТТЗ из ТТЗ Цикл
		//		Если ЗначениеЗаполнено(СтрТТЗ.Автомобиль) Тогда	
		//			Если СтрТТЗ.Автомобиль.Модель.Родитель.Код="ЦБ00001077" Тогда
		//				Премия=(СтрТТЗ.Сумма/100)*СтрСотрудников.Процент;
		//				Если Премия<=5000 Тогда
		//					СтрТТЗ.СуммаЗП=5000;
		//				Иначе	
		//					СтрТТЗ.СуммаЗП=Премия;
		//				КонецЕсли;	                                                                                  
		//			Иначе	
		//				Премия=(СтрТТЗ.Сумма/100)*СтрСотрудников.Процент;
		//				Если Премия<=1500 Тогда
		//					СтрТТЗ.СуммаЗП=1500;
		//				Иначе	
		//					СтрТТЗ.СуммаЗП=Премия;
		//				КонецЕсли;	
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЦикла;
		//   
		//	СтрСотрудников.Начислен=ТТЗ.Итог("СуммаЗП");
		//	
		//КонецЕсли;	
			ТТЗ.Очистить();
		//ИтогК = (СтрСотрудников.К1 + СтрСотрудников.К2 + СтрСотрудников.К3 + СтрСотрудников.К4)/100;
		Начислен=СтрСотрудников.Начислен;
		Если СтрСотрудников.К1<>0 Тогда
			Начислен=Начислен*СтрСотрудников.К1;
		КонецЕсли;	
		Если СтрСотрудников.К2<>0 Тогда
			Начислен=Начислен*СтрСотрудников.К2;
		КонецЕсли;	
		Если СтрСотрудников.К3<>0 Тогда
			Начислен=Начислен*СтрСотрудников.К3;
		КонецЕсли;	
		Если СтрСотрудников.К4<>0 Тогда
			Начислен=Начислен*СтрСотрудников.К4;
		КонецЕсли;	

		СтрСотрудников.ИтогоСумма = Начислен + СтрСотрудников.Акция+СтрСотрудников.TradeInСумма;
		СтрСотрудников.ИтогоСКоэф = СтрСотрудников.ИтогоСумма*0.87 ;
		
		Если СтрСотрудников.СуммаАМПлан <>0 Тогда 
			СтрСотрудников.ПроцентФактПланАМ = СтрСотрудников.СуммаАМФакт/СтрСотрудников.СуммаАМПлан*100;
		КонецЕсли;
		
		Если СтрСотрудников.ПланПродажиТюнинга <>0 Тогда 
			СтрСотрудников.ПроцентФактПланДоп = СтрСотрудников.ФактПродажиТюнинга/СтрСотрудников.ПланПродажиТюнинга*100;
		КонецЕсли;
		
		Если СтрСотрудников.ПланФинПродукт <>0 Тогда 
			СтрСотрудников.ПроцентФактПланФин = СтрСотрудников.ФактФинПродукт/СтрСотрудников.ПланФинПродукт*100;
		КонецЕсли;
		
		Если СтрСотрудников.ВсегоДоходПлан <>0 Тогда 
			СтрСотрудников.ПроцентФактПланВсего = СтрСотрудников.ВсегоДоходФакт/СтрСотрудников.ВсегоДоходПлан*100;
		КонецЕсли;
		
		
	КонецЦикла;

	Возврат;
	
	//Расчет РОПа
	
	    СвойствоЗ=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("02043"); // СтатьяДДСУПР
	    СвойствоЗ1=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПОКоду("04204"); // ЦФОБренд		
		ЗначениеЗ=Новый Массив;
		ЗначениеЗ.Добавить(Справочники.СтатьиДДСУпрЗначСв.НайтиПокоду("РД0000026"));
		ЗначениеЗ.Добавить(Справочники.СтатьиДДСУпрЗначСв.НайтиПокоду("РД0000027"));
		ЗначениеЗ.Добавить(Справочники.СтатьиДДСУпрЗначСв.НайтиПокоду("РД0000034"));
		ЗначениеЗ.Добавить(Справочники.СтатьиДДСУпрЗначСв.НайтиПокоду("РД0000069"));
		ЗначениеЗ.Добавить(Справочники.СтатьиДДСУпрЗначСв.НайтиПокоду("РД0000030"));
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ Тогда
			ЗначениеЗ1=Справочники.ЗначенияСвойств.НайтиПокоду("ЦБ006243");
		ИначеЕсли БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			ЗначениеЗ1=Справочники.ЗначенияСвойств.НайтиПокоду("ЦБ006244");
		ИначеЕсли БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
			ЗначениеЗ1=Справочники.ЗначенияСвойств.НайтиПокоду("ЦБ006241");
		ИначеЕсли БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
			ЗначениеЗ1=Справочники.ЗначенияСвойств.НайтиПокоду("ЦБ006235");
		КонецЕсли;			

		    Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			|	СУММА(ДенежныеСредстваКомпании.Сумма) КАК Сумма,
			|	ЗначенияСвойствОбъектов.Объект
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваКомпании КАК ДенежныеСредстваКомпании
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|		ПО ДенежныеСредстваКомпании.Регистратор = ЗначенияСвойствОбъектов.Объект
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Значение В(&Значение)
			|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
			|	И ДенежныеСредстваКомпании.Период МЕЖДУ &ДатаНачала И &ДатаКонца
            |
			|СГРУППИРОВАТЬ ПО
			|	ЗначенияСвойствОбъектов.Объект
			|;
            |
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.Сумма)
			|ИЗ
			|	ВТ КАК ВТ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|		ПО ВТ.Объект = ЗначенияСвойствОбъектов.Объект
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Значение В(&Значение1)
			|	И ЗначенияСвойствОбъектов.Свойство = &Свойство1";
		Запрос.УстановитьПараметр("Значение",ЗначениеЗ);
		Запрос.УстановитьПараметр("Свойство",СвойствоЗ);
		Запрос.УстановитьПараметр("ДатаНачала",ПериодНачало);
		Запрос.УстановитьПараметр("ДатаКонца",ПериодКонец);
		
		Запрос.УстановитьПараметр("Значение1",ЗначениеЗ1);
		Запрос.УстановитьПараметр("Свойство1",СвойствоЗ1);
		
		Рез=Запрос.Выполнить().Выгрузить();

	
	Для Каждого Стр из РОПТ Цикл
		Стр.Реклама=Рез[0].Сумма;
		Стр.ДоходФактРОП=РасчетЗарплаты.Итог("ВсегоДоходФакт");//;-СуммыВозмещенийВсего;
		Стр.ЗПМенеджеров = РасчетЗарплаты.Итог("ИтогоСумма");
		Стр.ПроцентРОП = ПолучитьПроцент(БрендДляПоказателей, Перечисления.ДолжностиДляЗП.РОП, ПериодКонец)[0];
		Стр.НачисленРОП= (Стр.ДоходФактРОП-Стр.ЗПМенеджеров-Стр.Реклама-Стр.ПроцентыБанка)*Стр.ПроцентРОП/100;
		ИтогКроп = (Стр.К1роп + Стр.К2роп + Стр.К3роп + Стр.К4роп)/100;
		Стр.ИтогоРопФОТ = Стр.НачисленРОП*(1+ИтогКроп);
		Стр.КвыдачеРОП = Стр.ИтогоРопФОТ*0.87 ;
	
	КонецЦикла;
		
	
КонецПроцедуры

Процедура РасчитатьРопа() Экспорт		
	РОПТ.Очистить();
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015014").СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = БрендДляПоказателей Тогда
			СтрРОП=РОПТ.Добавить();
			СтрРОП.РОП=Стр.Параметр1;
			СтрРОП.Должность=Стр.Параметр2;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр из РОПТ Цикл
		
		СуммаТИ=ДоходТИ();
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			СуммаТИ=СуммаТИ+ДоходТИКом();
		КонецЕсли;

		ФактПродажиТюнинга=ПолучитьДопРОПа(Стр.РОП);

		Стр.ДоходФактРОП=ПолучитьСуммаАмРОПа(Стр.РОП)+РасчетЗарплаты.Итог("СуммаАМФакт");

		ФактФинПродукт=ПолучитьФинРОПа(Стр.РОП);

		
		ВсяМаржа=0;
		ВсяМаржа=ВсяМаржа+Стр.ДоходФактРОП+ФактФинПродукт+РасчетЗарплаты.Итог("ФактФинПродукт")+ФактПродажиТюнинга+РасчетЗарплаты.Итог("ФактПродажиТюнинга")+СуммаТИ;

		ПроцентМаржи=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ДР,Стр.Должность);
		СуммаМаржи=(ВсяМаржа/100)*ПроцентМаржи;
		
		ФактПродажиКоличество=ПолучитьШтРОПа(Стр.РОП);
		
		//Склад
		
		ОстатокНачало=ОстатокСклада(НачалоДня(ПериодНачало));
		ОстатокКонец=ОстатокСклада(КонецДня(ПериодКонец));
        Среднее=((ОстатокНачало+ОстатокКонец)/2)/(ФактПродажиКоличество+РасчетЗарплаты.Итог("ФактПродажиКоличество"));
		
		ПроцентСклад=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.Склад,Стр.Должность);
		СуммаМаржиСклад=(СуммаМаржи/100)*ПроцентСклад;	
		Стр.ПланСклад=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.Склад,Стр.Должность);
		Стр.ФактСклад=Среднее;
		Стр.ПроцентФактПланСклад=Окр((Стр.ПланСклад/Стр.ФактСклад)*100,2);
		К0=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Склад,Стр.Должность,Стр.ПроцентФактПланСклад);
		//К0=К0*Окр((Стр.ПланСклад/Стр.ФактСклад),2);	
		//Если К0>1.5 Тогда К0=1.5 КонецЕсли;
		Стр.СуммаСклад=К0*СуммаМаржиСклад; 
		
		
		//QVN
		Стр.ПланQVN=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.QVN,Стр.Должность);

		//Штуки
		ПроцентШТ=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность);
		СуммаМаржиШт=(СуммаМаржи/100)*ПроцентШт;
		Стр.ПланПродажиКоличество=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность);
		Стр.ФактПродажиКоличество=ФактПродажиКоличество+РасчетЗарплаты.Итог("ФактПродажиКоличество");
		Стр.ПроцентФактПланАм=Окр((Стр.ФактПродажиКоличество/Стр.ПланПродажиКоличество)*100,2);
		К1=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность,Стр.ПроцентФактПланАм);
		//К1=К1*Окр((Стр.ФактПродажиКоличество/Стр.ПланПродажиКоличество),2);	
		//Если К1>1.5 Тогда К1=1.5 КонецЕсли;
		Стр.СуммаКоличество=К1*СуммаМаржиШт; 
		
		// Тюнинг
		ПроцентДоп=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность);
		СуммаМаржиДоп=(СуммаМаржи/100)*ПроцентДоп;
		
		Стр.ПланПродажиТюнинга=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность);
		Стр.ФактПродажиТюнинга=ФактПродажиТюнинга+РасчетЗарплаты.Итог("ФактПродажиТюнинга");
		Стр.ПроцентФактПланДоп=Окр((Стр.ФактПродажиТюнинга/Стр.ПланПродажиТюнинга)*100,2);
		К2=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность,Стр.ПроцентФактПланДоп);
		//К2=К2*Окр((Стр.ФактПродажиТюнинга/Стр.ПланПродажиТюнинга),2);
		//Если К2>1.5 Тогда К2=1.5 КонецЕсли;
		Стр.СуммаТюнинга=К2*СуммаМаржиДоп;
		
		//ФИн
		ПроцентФин=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность);
		СуммаМаржиФин=(СуммаМаржи/100)*ПроцентФин;
		Стр.ПланФинПродукт=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность);
                                          
		Стр.ФактФинПродукт=ФактФинПродукт+РасчетЗарплаты.Итог("ФактФинПродукт");
		Стр.ПроцентФактПланФин=Окр((Стр.ФактФинПродукт/Стр.ПланФинПродукт)*100,2);
		К3=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность,Стр.ПроцентФактПланФин);
		//К3=К3*Окр((Стр.ФактФинПродукт/Стр.ПланФинПродукт),2);	
		//Если К3>1.5 Тогда К3=1.5 КонецЕсли;
		Стр.СуммаФин=К3*СуммаМаржиФин;
		
		
		//  Trade-In
		
		ПланТИ=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность);

		ПроцентДоляТИ=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность);
		СуммаМаржиТИ=(СуммаМаржи/100)*ПроцентДоляТИ;

		ФактТИ=РасчетЗарплаты.Итог("TradeInФакт");
		Если  Стр.ПланПродажиКоличество>Стр.ФактПродажиКоличество Тогда
			КТИФакт=Окр(ФактТИ/Стр.ПланПродажиКоличество,2);
		Иначе
			КТИФакт=Окр(ФактТИ/Стр.ФактПродажиКоличество,2);
		КонецЕсли;	
		
		ПроцентТИ=Окр((Окр(КТИФакт*100,2)/ПланТИ)*100,2);
		К4=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность,ПроцентТИ);
		//К4=К4*(ПроцентТИ/100);
		//Если К4>1.5 Тогда К4=1.5 КонецЕсли;
		Стр.СуммаTradeIn=К4*СуммаМаржиТИ; 
		
		РасчетИтого();
		
	КонецЦикла;
	
КонецПроцедуры	


Процедура РасчитатьРопа1() Экспорт		
	РОПТ.Очистить();
	Для Каждого Стр Из Справочники.ТТ_СписокПараметров.НайтиПоКоду("000015014").СписокПараметров Цикл
		Если Стр.ЗначениеПараметра = БрендДляПоказателей Тогда
			СтрРОП=РОПТ.Добавить();
			СтрРОП.РОП=Стр.Параметр1;
			СтрРОП.Должность=Стр.Параметр2;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр из РОПТ Цикл
		//Штуки
		Стр.ПланПродажиКоличество=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность);
		Стр.ФактПродажиКоличество=РасчетЗарплаты.Итог("ФактПродажиКоличество");
		Стр.ПроцентФактПланАм=Окр((Стр.ФактПродажиКоличество/Стр.ПланПродажиКоличество)*100,2);
		Если Стр.ПроцентФактПланАм>100 Тогда
			К1=Окр(Стр.ФактПродажиКоличество/Стр.ПланПродажиКоличество,2);
			Если К1>1.2 Тогда
				К1=1.2;
			КонецЕсли;	
		Иначе	
			К1=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность,Стр.ПроцентФактПланАм);
		КонецЕсли;	
		Стр.СуммаКоличество=К1*Стр.ФактПродажиКоличество*ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ЦенаЗаШт,Стр.Должность);
		
		// Тюнинг
		Стр.ПланПродажиТюнинга=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность);
		Стр.ФактПродажиТюнинга=РасчетЗарплаты.Итог("ФактПродажиТюнинга");
		Стр.ПроцентФактПланДоп=Окр((Стр.ФактПродажиТюнинга/Стр.ПланПродажиТюнинга)*100,2);
		К2=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность,Стр.ПроцентФактПланДоп);
		Стр.СуммаТюнинга=К2*(Стр.ФактПродажиТюнинга/100);
		
		//ФИн
		Стр.ПланФинПродукт=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность);
		Стр.ФактФинПродукт=РасчетЗарплаты.Итог("ФактФинПродукт");
		Стр.ПроцентФактПланФин=Окр((Стр.ФактФинПродукт/Стр.ПланФинПродукт)*100,2);
		К3=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность,Стр.ПроцентФактПланФин);
		Стр.СуммаФин=К3*(Стр.ФактФинПродукт/100);
		
		
		СуммаTradeIn= ДоходТИ();
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ ИЛИ БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
			Если РасчетЗарплаты.Итог("TradeInФакт")>= РасчетЗарплаты.Итог("TradeInПлан") Тогда
				Стр.СуммаTradeIn=(СуммаTradeIn/100)*1.8;	
			Иначе	
				Стр.СуммаTradeIn=(СуммаTradeIn/100)*(-0.9);	
			КонецЕсли;	
		ИначеЕсли БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.УАЗ Тогда
			Если РасчетЗарплаты.Итог("TradeInФакт")>= РасчетЗарплаты.Итог("TradeInПлан") Тогда
				Стр.СуммаTradeIn=(СуммаTradeIn/100)*3.6;	
			Иначе	
				Стр.СуммаTradeIn=(СуммаTradeIn/100)*(-1.8);	
			КонецЕсли;	
			
		КонецЕсли;
		РасчетИтого();
		
	КонецЦикла;
	
КонецПроцедуры	


Функция РасчитатьДР(ДРФакт,Должность) Экспорт
	
		К4=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ДР,Должность,ДРФакт);
		Возврат К4;
КонецФункции	

Функция ПолучитьК(Параметр,Должность,Процент) Экспорт


	Запрос=новый Запрос;
		Запрос.Текст="
		|ВЫБРАТЬ
		|ТТ_ПараметрыЗПСрезПоследних.Предел КАК Предел,
		|(ВЫБОР КОГДА 
		|ТТ_ПараметрыЗПСрезПоследних.Значение ЕСТЬ NULL
		|ТОГДА 0
		|ИНАЧЕ
		|ТТ_ПараметрыЗПСрезПоследних.Значение
		|КОНЕЦ ) КАК ЗначениеК
		|ИЗ
		|РегистрСведений.ТТ_ПараметрыЗП.СрезПоследних(&Период, ) КАК ТТ_ПараметрыЗПСрезПоследних
		|ГДЕ
		|ТТ_ПараметрыЗПСрезПоследних.Бренд = &Бренд
		|И ТТ_ПараметрыЗПСрезПоследних.Должность = &Должность
		|И ТТ_ПараметрыЗПСрезПоследних.Параметр = &Параметр
		|
		|УПОРЯДОЧИТЬ ПО
		|Предел";
	Запрос.УстановитьПараметр("Период",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	
	К=0;
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		Если  Процент<Рез.Предел Тогда
			К=Рез.ЗначениеК;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
			Возврат(К);
	
КонецФункции	

Функция ПолучитьПлан(Параметр,Должность) Экспорт
	Запрос=новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|ТТ_ПланыЗПСрезПоследних.План
	|ИЗ
	|РегистрСведений.ТТ_ПланыЗП.СрезПоследних(&Дата) КАК ТТ_ПланыЗПСрезПоследних
	|ГДЕ
	|ТТ_ПланыЗПСрезПоследних.Бренд = &Бренд
	|И ТТ_ПланыЗПСрезПоследних.Должность = &Должность
	|И ТТ_ПланыЗПСрезПоследних.Параметр = &Параметр";
	Запрос.УстановитьПараметр("Дата",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Возврат(Рез.План);
	КонецЦикла;	
	
	
КонецФункции	


Функция ПолучитьПланПроцент(Параметр,Должность) Экспорт
	Запрос=новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|ТТ_ПланыЗПСрезПоследних.Процент
	|ИЗ
	|РегистрСведений.ТТ_ПланыЗП.СрезПоследних(&Дата) КАК ТТ_ПланыЗПСрезПоследних
	|ГДЕ
	|ТТ_ПланыЗПСрезПоследних.Бренд = &Бренд
	|И ТТ_ПланыЗПСрезПоследних.Должность = &Должность
	|И ТТ_ПланыЗПСрезПоследних.Параметр = &Параметр";
	Запрос.УстановитьПараметр("Дата",ПериодКонец);
	Запрос.УстановитьПараметр("Бренд",БрендДляПоказателей);
	Запрос.УстановитьПараметр("Параметр",Параметр);
	Запрос.УстановитьПараметр("Должность",Должность);
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Возврат(Рез.Процент);
	КонецЦикла;	
	
	
КонецФункции	


Процедура РасчетИтого() Экспорт
	Для Каждого Стр из РОПТ Цикл
		
		СуммаТИ=ДоходТИ();
		ФактПродажиТюнинга=ПолучитьДопРОПа(Стр.РОП);

		Стр.ДоходФактРОП=ПолучитьСуммаАмРОПа(Стр.РОП)+РасчетЗарплаты.Итог("СуммаАМФакт");

		ФактФинПродукт=ПолучитьФинРОПа(Стр.РОП);

		
		ВсяМаржа=0;
		ВсяМаржа=ВсяМаржа+Стр.ДоходФактРОП+ФактФинПродукт+РасчетЗарплаты.Итог("ФактФинПродукт")+ФактПродажиТюнинга+РасчетЗарплаты.Итог("ФактПродажиТюнинга")+СуммаТИ;

		ПроцентМаржи=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ДР,Стр.Должность);
		СуммаМаржи=(ВсяМаржа/100)*ПроцентМаржи;

		

		Стр.НачисленРОП=Стр.СуммаКоличество+Стр.СуммаТюнинга+Стр.СуммаФин+Стр.СуммаTradeIn+Стр.СуммаQVN+Стр.СуммаСклад;	
		Если Стр.НачисленРОП>СуммаМаржи Тогда
			Стр.НачисленРОП=СуммаМаржи;
		КонецЕсли;	
		Стр.НачисленРОП=Стр.НачисленРОП+Стр.Бонус;
		Стр.ИтогоРопФОТ=Стр.НачисленРОП;//*К1*К2*К3*К4;
	КонецЦикла;	
КонецПроцедуры	

Функция ДоходТИ() Экспорт
	
	СуммаТИ=0;
	Менеджеры=Новый Массив;
	Для каждого Стр из РасчетЗарплаты Цикл
		Менеджеры.Добавить(Стр.Сотрудник);
	КонецЦикла;	
		
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|     ЕСТЬNULL((СУММА(ПродажиАвтомобилейОбороты.СуммаОборот)-СУММА(ПродажиАвтомобилейОбороты.СуммаНДСОборот))-(СУММА(ПродажиАвтомобилейОбороты.СебестоимостьОборот)-СУММА(ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот)),0 ) КАК Доход
	|ИЗ
	|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПродажиАвтомобилейОбороты.Партия = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение.Менеджер В (&Менеджер)
	|   И ПродажиАвтомобилейОбороты.ХозОперация = &ХозОперация";
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("Менеджер",Менеджеры);
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
	Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.РеализацияАвтомобилей);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СуммаТИ=Рез.Доход;
	КонецЕсли;	
	Возврат(СуммаТИ);
КонецФункции	


Функция ДоходТИКом() Экспорт
	
	СуммаТИ=0;
	Запрос=Новый Запрос;
	Запрос.Текст="
	
	|ВЫБРАТЬ
	|ЕСТЬNULL(СУММА(ПродажиАвтомобилейОбороты.СуммаОборот) - СУММА(ПродажиАвтомобилейОбороты.СуммаНДСОборот) - (СУММА(ПродажиАвтомобилейОбороты.СебестоимостьОборот) - СУММА(ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот)), 0) КАК Доход
	|ИЗ
	|РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
	|ГДЕ
	|ПродажиАвтомобилейОбороты.СкладКомпании = &СкладКомпании";
	
	
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
	Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("СкладКомпании",Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СуммаТИ=Рез.Доход;
	КонецЕсли;	
	Возврат(СуммаТИ);
КонецФункции	


Функция ОстатокСклада(ДатаОстатка) Экспорт
	
Запрос= Новый Запрос;
Запрос.Текст="
	|ВЫБРАТЬ
	|	СкладыКомпании.Ссылка
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Справочник.СкладыКомпании КАК СкладыКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО СкладыКомпании.Ссылка = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.ВидАвтомобиля.Новый)
    |
	|СГРУППИРОВАТЬ ПО
	|	СкладыКомпании.Ссылка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ВТ.Ссылка = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = &Свойство1
	|	И ЗначенияСвойствОбъектов.Значение <> &Значение 
    |
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка
	|;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаОстатка, ) КАК ОстаткиАвтомобилейОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
	|		ПО ОстаткиАвтомобилейОстатки.СкладКомпании = ВТ1.Ссылка
	|ГДЕ
	|	ОстаткиАвтомобилейОстатки.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
	|	И ОстаткиАвтомобилейОстатки.СкладКомпании.Наименование НЕ ПОДОБНО ""%тест%""";

	Запрос.УстановитьПараметр("Брэнд", ВернутьБрэнд());
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.ВидАвтомобиля);
	Запрос.УстановитьПараметр("Свойство1", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("04221"));
	Запрос.УстановитьПараметр("ДатаОстатка", ДатаОстатка);
	Запрос.УстановитьПараметр("Значение", Справочники.ЗначенияСвойств.НайтиПоКоду("ЦБ008950"));	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	КонецЕсли;	
	

КонецФункции

Функция ПолучитьПроцент(бренд,должность,период) Экспорт
	
	МассивПроцентов=Новый массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцентыПоБрендамЗПСрезПоследних.Процент
		|ИЗ
		|	РегистрСведений.ПроцентыПоБрендамЗП.СрезПоследних(&Период, ) КАК ПроцентыПоБрендамЗПСрезПоследних
		|ГДЕ
		|	ПроцентыПоБрендамЗПСрезПоследних.Должность = &Должность
		|	И ПроцентыПоБрендамЗПСрезПоследних.Бренд = &Бренд";
	
	Запрос.УстановитьПараметр("Бренд", Бренд);
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Период", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПроцентов.Добавить(ВыборкаДетальныеЗаписи.Процент);
		Возврат МассивПроцентов;	
	КонецЦикла;
	
	МассивПроцентов.Добавить(0);
	Возврат МассивПроцентов;
	
Конецфункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//ДатаОтсчета = НачалоДня(ПериодНачало);
	//пересчет=Истина;
	
	//#Если Клиент Тогда
	//	
	//	Если Вопрос("Пересчитать показатели с начала месяца?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет) = КодВозвратаДиалога.Нет Тогда
	//		ДатаОтсчета = ПериодКонец;	
	//		пересчет= ложь;
	//	Иначе
	//		ДатаОтсчета = НачалоДня(ПериодНачало);	
	//		пересчет=Истина;
	//	КонецЕсли;
	//	
	//#КонецЕсли
	//	
	//	КонПериод = НачалоДня(ТекущаяДата());
	//	
	//	Пока ДатаОтсчета <= КонПериод И ДатаОтсчета <= ПериодКонец Цикл
	//		Если пересчет Тогда
	//			ОбработкаЗаполнения(ПериодНачало, КонецДня(ДатаОтсчета) );
	//		КонецЕсли;
	//		
	//		Для Каждого СтрСотрудников Из РасчетЗарплаты Цикл
	//			
	//			НабЗап =  РегистрыСведений.РасчетЗП.СоздатьНаборЗаписей();
	//			Набзап.Отбор.Бренд.Установить(БрендДляПоказателей);
	//			Набзап.Отбор.Период.Установить(ДатаОтсчета);
	//			НабЗап.Отбор.Сотрудник.Установить(стрсотрудников.Сотрудник);
	//			НабЗап.Прочитать();
	//			
	//			Если набзап.Количество() = 0 Тогда
	//				запись = набзап.Добавить();
	//				запись.Бренд=БрендДляПоказателей;
	//				запись.Период= ДатаОтсчета;
	//				запись.Сотрудник = СтрСотрудников.Сотрудник;
	//				запись.Оклад = СтрСотрудников.Оклад;
	//				запись.ПланПродажиКоличество= СтрСотрудников.ПланПродажиКоличество;
	//				запись.ФактПродажиКоличество= СтрСотрудников.ФактПродажиКоличество;
	//				запись.Показатель1=СтрСотрудников.Показатель1;
	//				запись.Коэф1= СтрСотрудников.Коэф1;
	//				запись.Сумма1=СтрСотрудников.Сумма1;
	//				запись.ПланПродажиМИКСКоличество=СтрСотрудников.ПланПродажиМИКСКоличество;
	//				запись.ФактПродажиМИКСКоличество=СтрСотрудников.ФактПродажиМИКСКоличество;
	//				запись.Показатель2=СтрСотрудников.Показатель2;
	//				запись.Коэф2=СтрСотрудников.Коэф2;
	//				запись.Сумма2=СтрСотрудников.Сумма2;
	//				запись.ПланПродажиТюнинга=СтрСотрудников.ПланПродажиТюнинга;
	//				запись.ФактПродажиТюнинга=СтрСотрудников.ФактПродажиТюнинга;
	//				запись.Показатель3=СтрСотрудников.Показатель3;
	//				запись.Коэф3=СтрСотрудников.Коэф3;
	//				запись.Сумма3=СтрСотрудников.Сумма3;
	//				запись.ПланФинПродукт=СтрСотрудников.ПланФинПродукт;
	//				запись.ФактФинПродукт=СтрСотрудников.ФактФинПродукт;
	//				запись.Показатель4=СтрСотрудников.Показатель4;
	//				запись.Коэф4=СтрСотрудников.Коэф4;
	//				запись.Сумма4=СтрСотрудников.Сумма4;
	//				запись.СуммаПремии = СтрСотрудников.СуммаПремии;
	//				запись.СуммаДобрКАСКО=СтрСотрудников.СуммаДобрКАСКО;
	//				запись.ИтогоСумма=СтрСотрудников.ИтогоСумма;
	//				запись.К1=СтрСотрудников.К1;
	//				запись.К2=СтрСотрудников.К2;
	//				запись.К3=СтрСотрудников.К3;
	//				запись.ИтогоСКоэф=СтрСотрудников.ИтогоСКоэф;
	//				
	//			Иначе
	//				Для каждого запись из НабЗап Цикл
	//					запись.Бренд=БрендДляПоказателей;
	//					запись.Период= ДатаОтсчета;
	//					запись.Сотрудник = СтрСотрудников.Сотрудник;
	//					запись.Оклад = СтрСотрудников.Оклад;
	//					запись.ПланПродажиКоличество= СтрСотрудников.ПланПродажиКоличество;
	//					запись.ФактПродажиКоличество= СтрСотрудников.ФактПродажиКоличество;
	//					запись.Показатель1=СтрСотрудников.Показатель1;
	//					запись.Коэф1= СтрСотрудников.Коэф1;
	//					запись.Сумма1=СтрСотрудников.Сумма1;
	//					запись.ПланПродажиМИКСКоличество=СтрСотрудников.ПланПродажиМИКСКоличество;
	//					запись.ФактПродажиМИКСКоличество=СтрСотрудников.ФактПродажиМИКСКоличество;
	//					запись.Показатель2=СтрСотрудников.Показатель2;
	//					запись.Коэф2=СтрСотрудников.Коэф2;
	//					запись.Сумма2=СтрСотрудников.Сумма2;
	//					запись.ПланПродажиТюнинга=СтрСотрудников.ПланПродажиТюнинга;
	//					запись.ФактПродажиТюнинга=СтрСотрудников.ФактПродажиТюнинга;
	//					запись.Показатель3=СтрСотрудников.Показатель3;
	//					запись.Коэф3=СтрСотрудников.Коэф3;
	//					запись.Сумма3=СтрСотрудников.Сумма3;
	//					запись.ПланФинПродукт=СтрСотрудников.ПланФинПродукт;
	//					запись.ФактФинПродукт=СтрСотрудников.ФактФинПродукт;
	//					запись.Показатель4=СтрСотрудников.Показатель4;
	//					запись.Коэф4=СтрСотрудников.Коэф4;
	//					запись.Сумма4=СтрСотрудников.Сумма4;
	//					запись.СуммаПремии = СтрСотрудников.СуммаПремии;
	//					запись.СуммаДобрКАСКО=СтрСотрудников.СуммаДобрКАСКО;
	//					запись.ИтогоСумма=СтрСотрудников.ИтогоСумма;
	//					запись.К1=СтрСотрудников.К1;
	//					запись.К2=СтрСотрудников.К2;
	//					запись.К3=СтрСотрудников.К3;
	//					запись.ИтогоСКоэф=СтрСотрудников.ИтогоСКоэф;		
	//				КонецЦикла;
	//			КонецЕсли;
	//			
	//			попытка 
	//				Набзап.Записать();
	//			исключение	
	//			конецпопытки;		
	//		КонецЦикла;
	//		
	//		ДатаОтсчета=ДатаОтсчета+24*60*60;	
	//	КонецЦикла;
	//	
	
КонецПроцедуры

Функция ПечатьРОПа(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("Макет");

	Для Каждого Стр из РОПТ Цикл
	ОбластьМакета = Макет.ПолучитьОбласть("РОП");
	
		//Штуки
		ОбластьМакета.Параметры.РОП=Стр.РОП;
		ОбластьМакета.Параметры.Должность=Стр.Должность; 
		//ОбластьМакета.Параметры.Цена=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.ЦенаЗаШт,Стр.Должность);
		
		ВсяМаржа=Стр.ДоходФактРОП+Стр.ФактФинПродукт+Стр.ФактПродажиТюнинга;

		ПроцентМаржи=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.ДР,Стр.Должность);
		

		ОбластьМакета.Параметры.ИтогоМаржа=ВсяМаржа; 
		
		пСуммаТИ	=ДоходТИ();
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			пСуммаТИ=пСуммаТИ+ДоходТИКом();
		КонецЕсли;

		ОбластьМакета.Параметры.ИСуммаТИ	= пСуммаТИ;; 
		ОбластьМакета.Параметры.Всего=ВсяМаржа+ОбластьМакета.Параметры.ИСуммаТИ; 
		СуммаМаржи=Окр((ОбластьМакета.Параметры.Всего/100)*ПроцентМаржи,2);
		
		ОбластьМакета.Параметры.Процент=ПроцентМаржи; 
		ОбластьМакета.Параметры.КРаспределению=СуммаМаржи; 
		
		//  Trade-In
		ПланТИ=ПолучитьПлан(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность);
		ОбластьМакета.Параметры.ПланТИ=ПланТИ;
		
		ФактТИ=РасчетЗарплаты.Итог("TradeInФакт");
		
		Если  Стр.ПланПродажиКоличество>Стр.ФактПродажиКоличество Тогда
			КТИФакт=Окр(ФактТИ/Стр.ПланПродажиКоличество,2);
		Иначе
			КТИФакт=Окр(ФактТИ/Стр.ФактПродажиКоличество,2);
		КонецЕсли;	
		
		ОбластьМакета.Параметры.ФактТИ=Окр(КТИФакт*100,2);

		
		ПроцентТИ=Окр((Окр(КТИФакт*100,2)/ПланТИ)*100,2);
		//К4=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность,ПроцентТИ);
		

		ОбластьМакета.Параметры.ПроцентТИ=ПроцентТИ;
		
		К4=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность,ПроцентТИ);
		//Если К4>1.5 Тогда К4=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КТИ=К4;
		ОбластьМакета.Параметры.СуммаТИ=Стр.СуммаTradeIn;
		
		ДоляТИ=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.TradeIn,Стр.Должность);
		ОбластьМакета.Параметры.ДоляТИ=ДоляТИ;
		ОбластьМакета.Параметры.СуммаДолиТИ=Окр((СуммаМаржи/100)*ДоляТИ,2);


	
		//  QVN
		ОбластьМакета.Параметры.ПланQVN=Стр.ПланQVN;
		ОбластьМакета.Параметры.ФактQVN=Стр.ФактQVN;
		ОбластьМакета.Параметры.ПроцентQVN=Стр.ПроцентФактПланQVN;
		К9=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.QVN,Стр.Должность,Стр.ПроцентФактПланQVN);
		//К9=К9*Окр((Стр.ФактQVN/Стр.ПланQVN),2);	
		//Если К9>1.5 Тогда К9=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КQVN=К9;
		ОбластьМакета.Параметры.СуммаQVN=Стр.СуммаQVN;
		ПроцентQVN=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.QVN,Стр.Должность);
		ОбластьМакета.Параметры.ДоляQVN=ПроцентQVN;
		ОбластьМакета.Параметры.СуммаДолиQVN=Окр((СуммаМаржи/100)*ПроцентQVN,2);
		
		//  Склад
		ОбластьМакета.Параметры.ПланСклад=Стр.ПланСклад;
		ОбластьМакета.Параметры.ФактСклад=Стр.ФактСклад;
		ОбластьМакета.Параметры.ПроцентСклад=Стр.ПроцентФактПланСклад;
		К0=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Склад,Стр.Должность,Стр.ПроцентФактПланСклад);
		//К0=К0*Окр((Стр.ПланСклад/Стр.ФактСклад),2);	
		//Если К0>1.5 Тогда К0=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КСклад=К0;
		ОбластьМакета.Параметры.СуммаСклад=Стр.СуммаСклад;
		ПроцентСклад=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.Склад,Стр.Должность);
		ОбластьМакета.Параметры.ДоляСклад=ПроцентСклад;
		ОбластьМакета.Параметры.СуммаДолиСклад=Окр((СуммаМаржи/100)*ПроцентСклад,2);
		
		ОбластьМакета.Параметры.ОстатокНачало=ОстатокСклада(НачалоДня(ПериодНачало));
		ОбластьМакета.Параметры.ОстатокКонец=ОстатокСклада(КонецДня(ПериодКонец));
		
		//  ШТ
		ОбластьМакета.Параметры.ПланШт=Стр.ПланПродажиКоличество;
		ОбластьМакета.Параметры.ФактШт=Стр.ФактПродажиКоличество;
		ОбластьМакета.Параметры.ПроцентШт=Стр.ПроцентФактПланАм;
		К1=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность,Стр.ПроцентФактПланАм);
		//К1=К1*Окр((Стр.ФактПродажиКоличество/Стр.ПланПродажиКоличество),2);	
		//Если К1>1.5 Тогда К1=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КШт=К1;
		ОбластьМакета.Параметры.СуммаШт=Стр.СуммаКоличество;
		ПроцентШТ=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.Штуки,Стр.Должность);
		ОбластьМакета.Параметры.ДоляШт=ПроцентШТ;
		ОбластьМакета.Параметры.СуммаДолиШт=Окр((СуммаМаржи/100)*ПроцентШт,2);
		
		
		
		
		// Тюнинг
		ОбластьМакета.Параметры.ПланДоп=Стр.ПланПродажиТюнинга;
		ОбластьМакета.Параметры.ФактДоп=Стр.ФактПродажиТюнинга;
		ОбластьМакета.Параметры.ПроцентДоп=Стр.ПроцентФактПланДоп;
		К2=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность,Стр.ПроцентФактПланДоп);
		//К2=К2*Окр((Стр.ФактПродажиТюнинга/Стр.ПланПродажиТюнинга),2);
		//Если К2>1.5 Тогда К2=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КДоп=К2;
		ОбластьМакета.Параметры.СуммаДоп=Стр.СуммаТюнинга;
		ПроцентДоп=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.ДОП,Стр.Должность);
		
		ОбластьМакета.Параметры.ДоляДоп=ПроцентДоп;
		ОбластьМакета.Параметры.СуммаДолиДоп=Окр((СуммаМаржи/100)*ПроцентДоп,2);


		
		
		//ФИн
		ОбластьМакета.Параметры.ПланФин=Стр.ПланФинПродукт;
		ОбластьМакета.Параметры.ФактФин=Стр.ФактФинПродукт;
		ОбластьМакета.Параметры.ПроцентФин=Стр.ПроцентФактПланФин;
		К3=ПолучитьК(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность,Стр.ПроцентФактПланФин);
		//К3=К3*Окр((Стр.ФактФинПродукт/Стр.ПланФинПродукт),2);
		//Если К3>1.5 Тогда К3=1.5 КонецЕсли;
		ОбластьМакета.Параметры.КФин=К3;
		ОбластьМакета.Параметры.СуммаФин=Стр.СуммаФин;
		
		ПроцентФин=ПолучитьПланПроцент(Перечисления.ТТ_Параметры_ЗП.ФинПродукт,Стр.Должность);
		ОбластьМакета.Параметры.ДоляФин=ПроцентФин;
		ОбластьМакета.Параметры.СуммаДолиФин=Окр((СуммаМаржи/100)*ПроцентФин,2);
		
		ОбластьМакета.Параметры.СуммаИТОГО=ОбластьМакета.Параметры.СуммаШт+ОбластьМакета.Параметры.СуммаДоп+
		ОбластьМакета.Параметры.СуммаФин+
		ОбластьМакета.Параметры.СуммаТИ+
		ОбластьМакета.Параметры.СуммаСклад+
		ОбластьМакета.Параметры.СуммаQVN;
		
		Если ОбластьМакета.Параметры.СуммаИТОГО>СуммаМаржи Тогда
			СуммаНачисления=СуммаМаржи;
		Иначе	
			СуммаНачисления=ОбластьМакета.Параметры.СуммаИТОГО;
		КонецЕсли;	
		
		ОбластьМакета.Параметры.Бонус=Стр.Бонус;
		ОбластьМакета.Параметры.СуммаНачисления=СуммаНачисления;
		ОбластьМакета.Параметры.ИтогоРопФот=Стр.ИтогоРопФОТ;
		
		ТабДокумент.Вывести(ОбластьМакета);	
		
		ОбластьМакета = Макет.ПолучитьОбласть("ТИШапка");
		ТабДокумент.Вывести(ОбластьМакета);	
		
		// Расшифровка Трейд-Ин
		
		Менеджеры=Новый Массив;
		Для каждого Стр из РасчетЗарплаты Цикл
			Менеджеры.Добавить(Стр.Сотрудник);
		КонецЦикла;	
			
		Запрос=Новый Запрос;
		Запрос.Текст="
		
		|ВЫБРАТЬ
		|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаПродажи,
		|	ПродажиАвтомобилейОбороты.СуммаНДСОборот КАК СуммаПродажиНДС,
		|	ПродажиАвтомобилейОбороты.СебестоимостьОборот КАК Себестоимость,
		|	ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот КАК СебестоимостьНДС,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ЗначенияСвойствОбъектов.Значение.Менеджер  КАК  Менеджер
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ПродажиАвтомобилейОбороты.Партия = ЗначенияСвойствОбъектов.Объект
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение.Менеджер В (&Менеджер)
		|   И ПродажиАвтомобилейОбороты.ХозОперация = &ХозОперация";

		
		Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("Менеджер",Менеджеры);
		Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.ЗаказНаАвтомобиль);
		Запрос.УстановитьПараметр("ХозОперация",Справочники.ХозОперации.РеализацияАвтомобилей);
		
		Рез=Запрос.Выполнить().Выбрать();
		
		ССуммаПродажи=0;
		ССуммаПродажиНДС=0;
		ССебестоимость=0;
		ССебестоимостьНДС=0;
		СДоход=0;
		НПП=0;
		
		Пока Рез.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("ТИСтрока");
			НПП=НПП+1;
			ОбластьМакета.Параметры.НПП=НПП;
			ОбластьМакета.Параметры.Автомобиль=Рез.Автомобиль;
			ОбластьМакета.Параметры.ДокументПродажи=Рез.ДокументПродажи;
			ОбластьМакета.Параметры.Менеджер=Рез.Менеджер;
			ОбластьМакета.Параметры.СуммаПродажи=Рез.СуммаПродажи;
			ОбластьМакета.Параметры.СуммаПродажиНДС=Рез.СуммаПродажиНДС;
			ОбластьМакета.Параметры.Себестоимость=Рез.Себестоимость;
			ОбластьМакета.Параметры.СебестоимостьНДС=Рез.СебестоимостьНДС;
			ОбластьМакета.Параметры.Доход=(Рез.СуммаПродажи-Рез.СуммаПродажиНДС)-(Рез.Себестоимость-Рез.СебестоимостьНДС);
			ТабДокумент.Вывести(ОбластьМакета);	
			
			ССуммаПродажи=ССуммаПродажи+Рез.СуммаПродажи;
			ССуммаПродажиНДС=ССуммаПродажиНДС+Рез.СуммаПродажиНДС;
			ССебестоимость=ССебестоимость+Рез.Себестоимость;
			ССебестоимостьНДС=ССебестоимостьНДС+Рез.СебестоимостьНДС;
			СДоход=СДоход+ОбластьМакета.Параметры.Доход;
			
		КонецЦикла;	
		
		Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ГАЗ Тогда
			// Тут считаем авто полученное на комиссию , по складу коммерческих авто	
			ЗапросТиКом=Новый Запрос;
			ЗапросТиКом.Текст="
			
			|ВЫБРАТЬ
			|	ПродажиАвтомобилейОбороты.СуммаОборот КАК СуммаПродажи,
			|	ПродажиАвтомобилейОбороты.СуммаНДСОборот КАК СуммаПродажиНДС,
			|	ПродажиАвтомобилейОбороты.СебестоимостьОборот КАК Себестоимость,
			|	ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот КАК СебестоимостьНДС,
			|	ПродажиАвтомобилейОбороты.Автомобиль,
			|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер  КАК  Менеджер,
			|	ПродажиАвтомобилейОбороты.ДокументПродажи
			|ИЗ
			|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиАвтомобилейОбороты
			|ГДЕ
			|	ПродажиАвтомобилейОбороты.СкладКомпании = &СкладКомпании";
			
			ЗапросТиКом.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодНачало));
			ЗапросТиКом.УстановитьПараметр("ДатаКонца",КонецДня(ПериодКонец));
			ЗапросТиКом.УстановитьПараметр("СкладКомпании",Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000230"));
			Рез=ЗапросТиКом.Выполнить().Выбрать();
			
			Пока Рез.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("ТИСтрока");
				НПП=НПП+1;
				ОбластьМакета.Параметры.НПП=НПП;
				ОбластьМакета.Параметры.Автомобиль=Рез.Автомобиль;
				ОбластьМакета.Параметры.ДокументПродажи=Рез.ДокументПродажи;
				ОбластьМакета.Параметры.Менеджер=Рез.Менеджер;
				ОбластьМакета.Параметры.СуммаПродажи=Рез.СуммаПродажи;
				ОбластьМакета.Параметры.СуммаПродажиНДС=Рез.СуммаПродажиНДС;
				ОбластьМакета.Параметры.Себестоимость=Рез.Себестоимость;
				ОбластьМакета.Параметры.СебестоимостьНДС=Рез.СебестоимостьНДС;
				ОбластьМакета.Параметры.Доход=(Рез.СуммаПродажи-Рез.СуммаПродажиНДС)-(Рез.Себестоимость-Рез.СебестоимостьНДС);
				ТабДокумент.Вывести(ОбластьМакета);	
				
				ССуммаПродажи=ССуммаПродажи+Рез.СуммаПродажи;
				ССуммаПродажиНДС=ССуммаПродажиНДС+Рез.СуммаПродажиНДС;
				ССебестоимость=ССебестоимость+Рез.Себестоимость;
				ССебестоимостьНДС=ССебестоимостьНДС+Рез.СебестоимостьНДС;
				СДоход=СДоход+ОбластьМакета.Параметры.Доход;
				
			КонецЦикла;	
		КонецЕсли;
		
		
			ОбластьМакета = Макет.ПолучитьОбласть("ТИИтог");
			ОбластьМакета.Параметры.ССуммаПродажи=ССуммаПродажи;
			ОбластьМакета.Параметры.ССуммаПродажиНДС=ССуммаПродажиНДС;
			ОбластьМакета.Параметры.ССебестоимость=ССебестоимость;
			ОбластьМакета.Параметры.ССебестоимостьНДС=ССебестоимостьНДС;
			ОбластьМакета.Параметры.СДоход=СДоход;
			ТабДокумент.Вывести(ОбластьМакета);	

			Если НПП<>0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ТИВсего");
		   		ОбластьМакета.Параметры.ОдинДоход=Окр(СДоход/НПП,2);
				ТабДокумент.Вывести(ОбластьМакета);	
			КонецЕсли;
		
	КонецЦикла;
	Возврат ТабДокумент;
КонецФункции	

Функция ПолучитьСуммаАмРОПа(Менеджер) Экспорт
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	СУММА(Реализация.СуммаПродажи - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаДопОборудования - СебестоимостьЗН.СС_П_ТТ - СебестоимостьЗН.СС_П_Кунова) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

//		|	СУММА(Реализация.СуммаНДСПродажи - (ВнутренниеУслуги.СуммаКомплектации *"+ НДС18+"/"+НДС118 +"+ ВнутренниеУслуги.СуммаДопОборудования * "+ НДС18+"/"+НДС118 +")) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
//		|	СУММА(Реализация.СебестоимостьОборот - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаПСО - Реализация.СуммаНДСВходящийОборот - ВнутренниеУслуги.СуммаКомплектацииП - ВнутренниеУслуги.СуммаДопОборудования - ВнутренниеУслуги.СуммаОстальныеВидыРемонта - ВнутренниеУслуги.СуммаДопОборудванияП) КАК Себестоимость,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		СуммаПроданных=0;
		КоличествоПродано=0;
		СВозмещение=0;
		
		Пока выборка.Следующий() Цикл	
			Если БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ВАЗ или БрендДляПоказателей=Перечисления.БрендыДляРасчетаЗарплаты.ШевиНива Тогда
				СВозмещение = Выборка.Возмещение + Выборка.ВозмещениеУтил + Выборка.СкидкаУчр;  // /НДС18К;
			Иначе
				СВозмещение = Выборка.Возмещение/НДС18К + Выборка.ВозмещениеУтил/НДС18К + Выборка.СкидкаУчр;
			КонецЕсли;	
			СуммаПроданных = СуммаПроданных + выборка.Маржа + СВозмещение;		 
			КоличествоПродано =  КоличествоПродано + 1;
		КонецЦикла;
		
		Возврат(СуммаПроданных);
КонецФункции	

Функция ПолучитьШтРОПа(Менеджер) Экспорт
	
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	
	ВходятВХолдинг=ПолучитьКонтрагентовХолдинга();
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	

		//--------------МАРЖА И КОЛИЧЕСТВО--------------------------		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПродажи,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СебестоимостьОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СебестоимостьОборот,
		|	СУММА(ВЫБОР
		|			КОГДА ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилей)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.РеализацияАвтомобилейКомиссия)
		|					ИЛИ ПродажиАвтомобилейОбороты.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетКомиссионераЗаАвтомобили)
		|				ТОГДА ПродажиАвтомобилейОбороты.СуммаНДСВходящийОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНДСВходящийОборот,
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.СкладКомпании КАК СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|ПОМЕСТИТЬ Реализация
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода, &КонецПериода, Период, ) КАК ПродажиАвтомобилейОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
		|		ПО ПродажиАвтомобилейОбороты.ДокументПродажи = РеализацияАвтомобилейАвтомобили.Ссылка
		|			И ПродажиАвтомобилейОбороты.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
		|ГДЕ
		|	ПродажиАвтомобилейОбороты.ДокументПродажи.Менеджер = &Менеджер
		|	И ПродажиАвтомобилейОбороты.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|	И ПродажиАвтомобилейОбороты.СкладКомпании НЕ В (&СкладыТИ)
		|	И ПродажиАвтомобилейОбороты.Покупатель НЕ В (&ВходятВХолдинг)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиАвтомобилейОбороты.ДокументПродажи,
		|	ПродажиАвтомобилейОбороты.Автомобиль,
		|	ПродажиАвтомобилейОбороты.СкладКомпании,
		|	ПродажиАвтомобилейОбороты.Партия,
		|	РеализацияАвтомобилейАвтомобили.ЗаказНаАвтомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиАвтомобилей.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И (ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектация
		|						И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаКомплектацияП)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПСО,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ЗаказНаряд)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаКомплектацииП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудование
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудования,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДопОборудванияП,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_Доукомплектации,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.Регистратор.ВидРемонта = ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаДоукомплектации_Доставки_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.Сумма - ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_БезНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиАвтомобилей.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеДопРасходовНаАвтомобили)
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудование
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> &ВидРемонтаДопОборудованиеП
		|					И ОстаткиАвтомобилей.Регистратор.ВидРемонта <> ЗНАЧЕНИЕ(Справочник.ВидыРемонта.ПустаяСсылка)
		|				ТОГДА ОстаткиАвтомобилей.СуммаНДС
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаОстальныеВидыРемонта_НДС
		|ПОМЕСТИТЬ ВнутренниеУслуги
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		|		ПО Реализация.Автомобиль = ОстаткиАвтомобилей.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиАвтомобилей.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Реализация.Автомобиль,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудованиеП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаДопОборудование
		|					И ТоварыВПроизводствеОбороты.ЗаказНаряд.Заказчик = &ТТ_Контрагент
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_П_Кунова_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НДС_СС_К,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектация
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_К_ТТ,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыВПроизводствеОбороты.ЗаказНаряд.ВидРемонта = &ВидРемонтаКомплектацияП
		|				ТОГДА ТоварыВПроизводствеОбороты.СуммаНДСРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СС_НДС_П_ТТ
		|ПОМЕСТИТЬ СебестоимостьЗН
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПроизводстве.Обороты(, , , ) КАК ТоварыВПроизводствеОбороты
		|		ПО Реализация.Автомобиль = ТоварыВПроизводствеОбороты.ЗаказНаряд.Автомобиль
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	СУММА(Реализация.СуммаПродажи - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаДопОборудования - СебестоимостьЗН.СС_П_ТТ - СебестоимостьЗН.СС_П_Кунова) КАК СуммаПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаПродажи) КАК СуммаПродажиБезКомплектации,

//		|	СУММА(Реализация.СуммаНДСПродажи - (ВнутренниеУслуги.СуммаКомплектации *"+ НДС18+"/"+НДС118 +"+ ВнутренниеУслуги.СуммаДопОборудования * "+ НДС18+"/"+НДС118 +")) КАК НДСПродажиБезКомплектации,
		|	СУММА(Реализация.СуммаНДСПродажи - Реализация.СуммаНДСВходящийОборот) КАК НДСПродажиБезКомплектации,
		
//		|	СУММА(Реализация.СебестоимостьОборот - ВнутренниеУслуги.СуммаКомплектации - ВнутренниеУслуги.СуммаПСО - Реализация.СуммаНДСВходящийОборот - ВнутренниеУслуги.СуммаКомплектацииП - ВнутренниеУслуги.СуммаДопОборудования - ВнутренниеУслуги.СуммаОстальныеВидыРемонта - ВнутренниеУслуги.СуммаДопОборудванияП) КАК Себестоимость,
		|	СУММА(Реализация.СебестоимостьОборот)  КАК Себестоимость,
		
		|	Реализация.Автомобиль КАК Автомобиль,
		|	МАКСИМУМ(ЕСТЬNULL(Возмещение.Значение, 0)) КАК Возмещение,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеУтил.Значение, 0)) КАК ВозмещениеУтил,
		|	МАКСИМУМ(ЕСТЬNULL(ВозмещениеДополн.Значение, 0)) КАК ВозмещениеДополн,
		|	МАКСИМУМ(ЕСТЬNULL(СкидкаУчр.Значение, 0)) КАК СкидкаУчр,
		|	Реализация.ДокументПродажи
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Реализация КАК Реализация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнутренниеУслуги КАК ВнутренниеУслуги
		|		ПО Реализация.Автомобиль = ВнутренниеУслуги.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьЗН КАК СебестоимостьЗН
		|		ПО Реализация.Автомобиль = СебестоимостьЗН.Автомобиль
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Возмещение
		|		ПО Реализация.ЗаказНаАвтомобиль = Возмещение.Объект
		|			И (Возмещение.Свойство = &Возмещение)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеУтил
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеУтил.Объект
		|			И (ВозмещениеУтил.Свойство = &ВозмещениеУтил)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ВозмещениеДополн
		|		ПО Реализация.ЗаказНаАвтомобиль = ВозмещениеДополн.Объект
		|			И (ВозмещениеДополн.Свойство = &ВозмещениеДополн)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СкидкаУчр
		|		ПО Реализация.ЗаказНаАвтомобиль = СкидкаУчр.Объект
		|			И (СкидкаУчр.Свойство = &СкидкаУчр)
		|
		|СГРУППИРОВАТЬ ПО
		|	Реализация.Автомобиль,
		|	Реализация.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВнутренниеУслуги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СебестоимостьЗН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СуммаПродажиБезКомплектации,
		|	ВТ.НДСПродажиБезКомплектации,
		|	ВТ.Себестоимость,
		|	ВТ.Автомобиль,
		|	ВТ.Возмещение,
		|	ВТ.ВозмещениеУтил,
		|	ВТ.ВозмещениеДополн,
		|	ВТ.СкидкаУчр,
		|	ВТ.ДокументПродажи,
		|	ВТ.СуммаПродажиБезКомплектации - ВТ.НДСПродажиБезКомплектации - ВТ.Себестоимость КАК Маржа
		|ИЗ
		|	ВТ КАК ВТ";
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		
		Запрос.УстановитьПараметр("Возмещение", Возмещение);
		Запрос.УстановитьПараметр("ВозмещениеУтил", ВозмещениеУтил);
		Запрос.УстановитьПараметр("ВозмещениеДополн", ВозмещениеДополн);  
		Запрос.УстановитьПараметр("СкидкаУчр", СкидкаУчр); // kunova 16.06.2016   
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектация", ВидРемонтаКомплектация);
		Запрос.УстановитьПараметр("ВидРемонтаКомплектацияП", ВидРемонтаКомплектацияП);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудование", ВидРемонтаДопОборудование);
		Запрос.УстановитьПараметр("ВидРемонтаДопОборудованиеП", ВидРемонтаДопОборудованиеП);
		Запрос.УстановитьПараметр("ТТ_Контрагент", ТТ_Контрагент);
		Запрос.УстановитьПараметр("СкладыТИ", СкладыТИ);
		Запрос.УстановитьПараметр("ВходятВХолдинг",ВходятВХолдинг);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();

		КоличествоПродано=0;
		
		Пока выборка.Следующий() Цикл	
			КоличествоПродано =  КоличествоПродано + 1;
		КонецЦикла;	
		
		Возврат(КоличествоПродано);
КонецФункции	

Функция ПолучитьДопРОПа(Менеджер) Экспорт
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
		//-------------ДОП НОВЫЙ--------------
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядРаботы.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядРаботы.СуммаСкидки * ЗаказНарядРаботы.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядРаботы
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
		|ГДЕ
		|	НЕ ЗаказНарядРаботы.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядРаботы.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядРаботы.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядРаботы.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядРаботы.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядРаботы.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядРаботы.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядРаботы.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядРаботы.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядРаботы.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядРаботы.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядРаботы.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядРаботы.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядРаботы.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядРаботы.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядРаботы.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказНарядТовары.Ссылка КАК ЗаказНаряд,
		|	СУММА(ЗаказНарядТовары.СуммаСкидки * ЗаказНарядТовары.Ссылка.КурсДокумента / &КурсВалютыОтчета) КАК СуммаСкидки
		|ПОМЕСТИТЬ ДокументЗаказНарядТовары
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Ссылка.ПометкаУдаления
		|	И НЕ ЗаказНарядТовары.Ссылка.КурсДокумента = 0
		|	И ВЫБОР
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ЗаказНарядТовары.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ЗаказНарядТовары.Ссылка.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|{ГДЕ
		|	ЗаказНарядТовары.Ссылка.Организация.* КАК Организация,
		|	ЗаказНарядТовары.Ссылка.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ЗаказНарядТовары.Ссылка.* КАК ЗаказНаряд,
		|	ЗаказНарядТовары.Ссылка.Цех.* КАК Цех,
		|	ЗаказНарядТовары.Ссылка.ВидРемонта.* КАК ВидРемонта,
		|	ЗаказНарядТовары.Ссылка.Состояние КАК Состояние,
		|	ЗаказНарядТовары.Ссылка.ВидОплаты.* КАК ВидОплаты,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.* КАК Автомобиль,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ЗаказНарядТовары.Ссылка.Автомобиль.Модель.* КАК Модель,
		|	ЗаказНарядТовары.Ссылка.Контрагент.* КАК Контрагент,
		|	ЗаказНарядТовары.Ссылка.ИсточникИнформации.* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНарядТовары.Ссылка
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ЗаказНарядТовары.СуммаСкидки) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВПроизводстве.Регистратор КАК ЗаказНаряд,
		|	СУММА(ТоварыВПроизводстве.СуммаУпр) КАК Себестоимость,
		|	СУММА(ТоварыВПроизводстве.СуммаНДС) КАК СуммаНДС
		|ПОМЕСТИТЬ ТоварыВПроизводствеОбороты
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТоварыВПроизводстве.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ТоварыВПроизводстве.Регистратор ССЫЛКА Документ.ЗаказНаряд
		|{ГДЕ
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Организация).* КАК Организация,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ПодразделениеКомпании).* КАК ПодразделениеКомпании,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд)).* КАК ЗаказНаряд,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Цех).* КАК Цех,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидРемонта).* КАК ВидРемонта,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Состояние) КАК Состояние,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ВидОплаты).* КАК ВидОплаты,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль).* КАК Автомобиль,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.ГодВыпуска) КАК ГодВыпуска,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Автомобиль.Модель).* КАК Модель,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).Контрагент).* КАК Контрагент,
		|	(ВЫРАЗИТЬ(ТоварыВПроизводстве.Регистратор КАК Документ.ЗаказНаряд).ИсточникИнформации).* КАК ИсточникИнформации}
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.Регистратор
		|
		|ИМЕЮЩИЕ
		|	НЕ СУММА(ТоварыВПроизводстве.СуммаУпр) = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокументЗаказНаряд.Ссылка КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Автомобиль.Модель КАК Модель,
		|	ДокументЗаказНаряд.ВидРемонта КАК ВидРемонта,
		|	1 КАК КоличествоАвтомобилей,
		|	ДокументЗаказНаряд.ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаРабот,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) КАК СуммаСкидкиРабот,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаНоменклатуры,
		|	ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиНоменклатуры,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|			ТОГДА 0
		|		ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаДокумента,
		|	ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0) КАК СуммаСкидкиДокумента,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СуммаОплаты,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК Себестоимость,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСуммаОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСОборот, 0) КАК СубподрядСуммаНДСОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0) КАК СубподрядСуммаУпрОборот,
		|	ВЫБОР
		|		КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|				ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|			ТОГДА 0
		|		ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|	КОНЕЦ КАК СубподрядСебестоимостьОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СуммаНДСВходящийОборот, 0) КАК СубподрядСуммаНДСВходящийОборот,
		|	ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0) КАК СубподрядСебестоимостьУпрОборот,
		|	ЕСТЬNULL(ТоварыВПроизводствеОбороты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ДокументЗаказНаряд.ВидРемонта = &КомплК
		|			ТОГДА ВЫРАЗИТЬ(ДокументЗаказНаряд.СуммаДокумента / "+НДС118+"*"+НДС18+" КАК ЧИСЛО(13, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНДСКомплектации
		|{ВЫБРАТЬ
		|	ЗаказНаряд.* КАК ЗаказНаряд,
		|	Модель.* КАК Модель,
		|	ВидРемонта.* КАК ВидРемонта,
		|	КоличествоАвтомобилей КАК КоличествоАвтомобилей,
		|	ВремяВыполненияРабот КАК ВремяВыполненияРабот,
		|	СуммаРабот КАК СуммаРабот,
		|	СуммаСкидкиРабот КАК СуммаСкидкиРабот,
		|	СуммаНоменклатуры КАК СуммаНоменклатуры,
		|	СуммаСкидкиНоменклатуры КАК СуммаСкидкиНоменклатуры,
		|	СуммаДокумента КАК СуммаДокумента,
		|	СуммаСкидкиДокумента КАК СуммаСкидкиДокумента,
		|	СуммаОплаты КАК СуммаОплаты,
		|	Себестоимость КАК Себестоимость,
		|	СубподрядСуммаОборот КАК СубподрядСуммаОборот,
		|	СубподрядСуммаНДСОборот КАК СубподрядСуммаНДСОборот,
		|	СубподрядСуммаУпрОборот КАК СубподрядСуммаУпрОборот,
		|	СубподрядСебестоимостьОборот КАК СубподрядСебестоимостьОборот,
		|	СубподрядСуммаНДСВходящийОборот КАК СубподрядСуммаНДСВходящийОборот,
		|	СубподрядСебестоимостьУпрОборот КАК СубподрядСебестоимостьУпрОборот}
		|ИЗ
		|	Документ.ЗаказНаряд КАК ДокументЗаказНаряд
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядТовары КАК ДокументЗаказНарядТовары
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядТовары.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ДокументЗаказНарядРаботы КАК ДокументЗаказНарядРаботы
		|		ПО ДокументЗаказНаряд.Ссылка = ДокументЗаказНарядРаботы.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПроизводствеОбороты КАК ТоварыВПроизводствеОбороты
		|		ПО ДокументЗаказНаряд.Ссылка = ТоварыВПроизводствеОбороты.ЗаказНаряд}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыКомпании.Остатки(&ДатаОкончания, {(Сделка.Организация).* КАК Организация, (Сделка.ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Сделка).* КАК ЗаказНаряд, (Сделка.Цех).* КАК Цех, (Сделка.ВидРемонта).* КАК ВидРемонта, (Сделка.Состояние) КАК Состояние, (Сделка.ВидОплаты).* КАК ВидОплаты, (Сделка.Автомобиль).* КАК Автомобиль, (Сделка.Автомобиль.ГодВыпуска) КАК ГодВыпуска, (Сделка.Автомобиль.Модель).* КАК Модель, (Сделка.Контрагент).* КАК Контрагент, (Сделка.ИсточникИнформации).* КАК ИсточникИнформации}) КАК ВзаиморасчетыКомпанииОстатки
		|		ПО ДокументЗаказНаряд.Ссылка = ВзаиморасчетыКомпанииОстатки.Сделка}
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Субподряд.Обороты(, &ДатаОкончания, , {(ПодразделениеКомпании.Организация).* КАК Организация, (ПодразделениеКомпании).* КАК ПодразделениеКомпании, (Контрагент).* КАК Покупатель}) КАК СубподрядОбороты
		|		ПО (СубподрядОбороты.ЗаказНаряд = ДокументЗаказНаряд.Ссылка)
		|ГДЕ
		|	НЕ ДокументЗаказНаряд.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|				ТОГДА ДокументЗаказНаряд.ДатаЗакрытия МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			КОГДА ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Выполнен)
		|				ТОГДА ДокументЗаказНаряд.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИНАЧЕ ДокументЗаказНаряд.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		КОНЕЦ
		|	И НЕ ДокументЗаказНаряд.Контрагент В (&СписокПокупателей)
		|	И ДокументЗаказНаряд.Менеджер = &Менеджер
		|	И ДокументЗаказНаряд.ВидРемонта В(&ВыдыРемонта)
		|	И ДокументЗаказНаряд.Состояние = ЗНАЧЕНИЕ(Справочник.ВидыСостоянийЗаказНарядов.Закрыт)
		|	И ДокументЗаказНаряд.Автомобиль.Модель В ИЕРАРХИИ(&Брэнд)
		|{ГДЕ
		|	ДокументЗаказНаряд.Организация.* КАК Организация,
		|	ДокументЗаказНаряд.ПодразделениеКомпании.* КАК ПодразделениеКомпании,
		|	ДокументЗаказНаряд.Ссылка.* КАК ЗаказНаряд,
		|	ДокументЗаказНаряд.Цех.* КАК Цех,
		|	ДокументЗаказНаряд.ВидРемонта.* КАК ВидРемонта,
		|	ДокументЗаказНаряд.Состояние КАК Состояние,
		|	ДокументЗаказНаряд.ВидОплаты.* КАК ВидОплаты,
		|	ДокументЗаказНаряд.Автомобиль.* КАК Автомобиль,
		|	ДокументЗаказНаряд.Автомобиль.ГодВыпуска КАК ГодВыпуска,
		|	ДокументЗаказНаряд.Автомобиль.Модель.* КАК Модель,
		|	ДокументЗаказНаряд.Контрагент.* КАК Контрагент,
		|	ДокументЗаказНаряд.ИсточникИнформации.* КАК ИсточникИнформации,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаРаботДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаРабот,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0)) КАК СуммаСкидкиРабот,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаНоменклатурыДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаНоменклатуры,
		|	(ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиНоменклатуры,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсДокумента = 0
		|				ТОГДА 0
		|			ИНАЧЕ ДокументЗаказНаряд.СуммаДокумента * ДокументЗаказНаряд.КурсДокумента / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаДокумента,
		|	(ЕСТЬNULL(ДокументЗаказНарядРаботы.СуммаСкидки, 0) + ЕСТЬNULL(ДокументЗаказНарядТовары.СуммаСкидки, 0)) КАК СуммаСкидкиДокумента,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ВзаиморасчетыКомпанииОстатки.СуммаУпрОстаток, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СуммаОплаты,
		|	(ВЫБОР
		|			КОГДА ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(ТоварыВПроизводствеОбороты.Себестоимость, 0) * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК Себестоимость,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СуммаУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СуммаУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСуммаОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СуммаУпрОборот, 0)) КАК СубподрядСуммаУпрОборот,
		|	(ВЫБОР
		|			КОГДА СубподрядОбороты.СебестоимостьУпрОборот ЕСТЬ NULL 
		|					ИЛИ ДокументЗаказНаряд.КурсВалютыУпр = 0
		|				ТОГДА 0
		|			ИНАЧЕ СубподрядОбороты.СебестоимостьУпрОборот * ДокументЗаказНаряд.КурсВалютыУпр / &КурсВалютыОтчета
		|		КОНЕЦ) КАК СубподрядСебестоимостьОборот,
		|	(ЕСТЬNULL(СубподрядОбороты.СебестоимостьУпрОборот, 0)) КАК СубподрядСебестоимостьУпрОборот}";
		
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("ДатаНачала", ПериодНачало);
		Запрос.УстановитьПараметр("ВалютаОтчета", Справочники.Валюты.НайтиПоКоду("643"));
		Запрос.УстановитьПараметр("КурсВалютыОтчета", 1);
		
		Запрос.УстановитьПараметр("ВыдыРемонта", ВидРемонтаДопАвтоСписок);
		Запрос.УстановитьПараметр("СписокПокупателей", СписокКонтрагентовДопАвто);
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		Запрос.УстановитьПараметр("КомплК", Справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
		Результат = Запрос.Выполнить();
		а = 0;
		Выборка = Результат.Выбрать();
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Доп оборудование авто
		
		ТаблицаРезультат.Колонки.Добавить("Работы", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Зч", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("Себестоимость", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("СебестоимостьРаб", ОписаниеТиповЧ);
		ТаблицаРезультат.Колонки.Добавить("ЗаказНаряд");
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.Работы        = Выборка.СуммаРабот;
			НоваяСтрока.Зч            = Выборка.СуммаНоменклатуры;
			НоваяСтрока.Себестоимость = Выборка.Себестоимость;
			НоваяСтрока.ЗаказНаряд = Выборка.ЗаказНаряд;
			
			НоваяСтрока.СебестоимостьРаб = Выборка.СубподрядСебестоимостьУпрОборот - Выборка.СубподрядСуммаНДСВходящийОборот;
			
		КонецЦикла;	
		ИтогПоРаботам= ТаблицаРезультат.Итог("Работы");
		ИтогПоЗч= ТаблицаРезультат.Итог("Зч");
		ИтогПоСебестоимости= ТаблицаРезультат.Итог("Себестоимость");	
		ИтогПоСебестоимостиРаб= ТаблицаРезультат.Итог("СебестоимостьРаб");	
		
		ИТОГ= ИтогПоРаботам+ИтогПоЗч-ИтогПоСебестоимости-ИтогПоСебестоимостиРаб;
		Возврат(ИТОГ);
		
	
КонецФункции	

Функция ПолучитьФинРОПа(Менеджер) Экспорт
	Возмещение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02055");
	ВозмещениеУтил = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02062");
	ВозмещениеДополн = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02070");
    СкидкаУчр = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("12082");    // kunova 06.07.2016

	СвойствоДобровольноеКАСКО = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02035");
	КАСКОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02041");
	ОСАГОСУлицы = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("02040");
	
	ВидРемонтаДопАвтоСписок= Новый СписокЗначений;
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019"));
	ВидРемонтаДопАвтоСписок.Добавить(справочники.ВидыРемонта.НайтиПоКоду("00000001"));
	//СписокСотрудниковДопАвто = справочники.Сотрудники.НайтиПоКоду("ЦБ004712");
	
	СписокКонтрагентовДопАвто = Новый СписокЗначений;
	
	ВидРемонтаКомплектация= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000019");
	ВидРемонтаКомплектацияП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000020");
	ВидРемонтаДопОборудование= справочники.ВидыРемонта.НайтиПоКоду("00000001");
	ВидРемонтаДопОборудованиеП= справочники.ВидыРемонта.НайтиПоКоду("ЦБ000033");
	ТТ_Контрагент = справочники.Контрагенты.НайтиПоКоду("ЦБ001314");
	
	СкладыТИ = Новый СписокЗначений;
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000229"));
	СкладыТИ.Добавить(Справочники.СкладыКомпании.НайтиПоКоду("ЦБ000007"));
	
	
	Брэнд = ВернутьБрэнд();
	
	Если Год(ПериодКонец)>=2019 Тогда
		НДС18="20";
		НДС118="120";
		НДС18К=1.2;
		НДС18Ч=20;
		НДС118Ч=120;
	Иначе	
		НДС18="18";
		НДС118="118";
		НДС18К=1.18;
		НДС18Ч=18;
		НДС118Ч=118;
	КонецЕсли;
	
		ТаблицаРезультат = Новый ТаблицаЗначений;
		
		КЧ = Новый КвалификаторыЧисла(15,2);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
		//Страхование
		ТаблицаРезультат.Колонки.Добавить("МодельГруппа", Новый ОписаниеТипов("СправочникСсылка.Модели"));
		ТаблицаРезультат.Колонки.Добавить("МесяцПродажи", Новый ОписаниеТипов("Дата"));
		ТаблицаРезультат.Колонки.Добавить("НаименованиеФинПродукта", Новый ОписаниеТипов("Строка"));
		ТаблицаРезультат.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		
				"ВЫБРАТЬ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма КАК СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии КАК ПроцентКомиссии,
		|   ВЫБОР
		|   	КОГДА РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии-((РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии/100)*8)  
		|	КОНЕЦ  КАК АВ,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии КАК СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка КАК СтраховойПолис,
		|	СУММА(ЕСТЬNULL(ВыпискаСостав.СуммаПриход, 0)) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК АВ,
		|	ЗначенияСвойствОбъектов.Значение КАК ДобровольноеКАСКО,
		|	ЗначенияСвойствОбъектов1.Значение КАК КАСКОСУлицы,
		|	ЗначенияСвойствОбъектов2.Значение КАК ОСАГОСУлицы
		|ПОМЕСТИТЬ РабЛистыСтрах
		|ИЗ
		|	Документ.РабочийЛистОтделаСтрахования.ВариантыСтрахования КАК РабочийЛистОтделаСтрахованияВариантыСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СтраховойПолис КАК СтраховойПолис
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = СтраховойПолис.ДокументОснование
		|			И РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования = СтраховойПолис.ВидСтрахования
		|			И (СтраховойПолис.ПометкаУдаления = ЛОЖЬ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ВыпискаСостав.Сделка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоДобровольноеКАСКО)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов1
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов1.Объект
		|			И (ЗначенияСвойствОбъектов1.Свойство = &КАСКОСУлицы)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов2
		|		ПО РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка = ЗначенияСвойствОбъектов2.Объект
		|			И (ЗначенияСвойствОбъектов2.Свойство = &ОСАГОСУлицы)
		|ГДЕ
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Проведен = ИСТИНА
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.Статус = &Статус
		|	И РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка.МенеджерОтделаСтрахования = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.Ссылка,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПрограммаСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ВидСтрахования,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ЭтоПролонгация,
		|	СтраховойПолис.Ссылка,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	ЗначенияСвойствОбъектов1.Значение,
		|	ЗначенияСвойствОбъектов2.Значение,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаПремии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СтраховаяСумма,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.ПроцентКомиссии,
		|	РабочийЛистОтделаСтрахованияВариантыСтрахования.СуммаКомиссии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|   ВЫБОР
		|   	КОГДА РабочийЛистКредитногоОтдела.Организация.Код=""00001"" ТОГДА
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/"+НДС118+")*"+НДС18+") 
		|       ИНАЧЕ
		|			РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ-((РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ/100)*8)  
		|	КОНЕЦ  КАК КВ,
		|	СУММА(ВыпискаСостав.СуммаПриход) КАК СуммаОплаты,
		//|	РеализацияТоваровТовары.Цена КАК КВ,
		|	ЗначенияСвойствОбъектов.Значение КАК Модель,
		|	Лизинг.Значение КАК Лизинг,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела КАК Менеджер
		|ПОМЕСТИТЬ РабЛистыКредитВТ
		|ИЗ
		|	Документ.РабочийЛистКредитногоОтдела КАК РабочийЛистКредитногоОтдела
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
		|			ПО РеализацияТоваровТовары.Ссылка = ВыпискаСостав.Сделка
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = РеализацияТоваровТовары.Ссылка.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = &СвойствоМодель)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Лизинг
		|		ПО РабочийЛистКредитногоОтдела.Ссылка = Лизинг.Объект
		|			И (Лизинг.Свойство.Код = ""02072"")
		|ГДЕ
		|	РабочийЛистКредитногоОтдела.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И РабочийЛистКредитногоОтдела.Проведен = ИСТИНА
		|	И РабочийЛистКредитногоОтдела.Статус = &Статус
		|	И РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела = &Менеджер
		|
		|СГРУППИРОВАТЬ ПО
		|	РабочийЛистКредитногоОтдела.Ссылка,
		|	РабочийЛистКредитногоОтдела.ОбщаяСуммаАВ,
		//|	РеализацияТоваровТовары.Цена,
		|	ЗначенияСвойствОбъектов.Значение,
		|	Лизинг.Значение,
		|	РабочийЛистКредитногоОтдела.МенеджерКредитногоОтдела
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.Ссылка.Дата
		|		ИНАЧЕ РабЛистыСтрах.Ссылка.Дата
		|	КОНЕЦ КАК Дата,
		|	ЕСТЬNULL(РабЛистыСтрах.ВидСтрахования, ""Кредит"") КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА РабЛистыКредитВТ.Ссылка.Клиент ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.Ссылка.Страхователь
		|		ИНАЧЕ РабЛистыКредитВТ.Ссылка.Клиент
		|	КОНЕЦ КАК Страхователь,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, """") = """"
		|			ТОГДА ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель.Родитель, """") = """"
		|						ТОГДА РабЛистыКредитВТ.Модель.Родитель.Родитель
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель.Родитель, """") = """"
		|								ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|							ИНАЧЕ ВЫБОР
		|									КОГДА НЕ ЕСТЬNULL(РабЛистыКредитВТ.Модель.Родитель, """") = """"
		|										ТОГДА РабЛистыКредитВТ.Модель.Родитель
		|									ИНАЧЕ РабЛистыКредитВТ.Модель
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель.Родитель, """") = """"
		|					ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель
		|				ИНАЧЕ ВЫБОР
		|						КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель.Родитель, """") = """"
		|							ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|						ИНАЧЕ ВЫБОР
		|								КОГДА НЕ ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель, """") = """"
		|									ТОГДА РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство.Родитель
		|								ИНАЧЕ РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Марка,
		|	ЕСТЬNULL(РабЛистыСтрах.СтраховойПолис.ТранспортноеСредство, РабЛистыКредитВТ.Модель) КАК Модель,
		|	РабЛистыКредитВТ.Ссылка.СуммаКредита КАК СуммаКредита,
		|	ВЫБОР
		|		КОГДА НЕ РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыСтрах.АВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КВ,
		|	ВЫБОР
		|		КОГДА РабЛистыСтрах.ВидСтрахования ЕСТЬ NULL 
		|			ТОГДА РабЛистыКредитВТ.КВ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК АВ,
		|	РабЛистыСтрах.СтраховойПолис.НомерПолиса КАК НомерПолиса,
		|	РабЛистыКредитВТ.Ссылка КАК СсылкаКредит,
		|	РабЛистыСтрах.Ссылка КАК СсылкаСтрах
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РабЛистыСтрах КАК РабЛистыСтрах
		|		ПОЛНОЕ СОЕДИНЕНИЕ РабЛистыКредитВТ КАК РабЛистыКредитВТ
		|		ПО РабЛистыСтрах.Ссылка.ВерсияДанных = РабЛистыКредитВТ.Ссылка.ВерсияДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ.Дата,
		|	ВТ.ВидОперации,
		|	ВТ.Страхователь,
		|	ВТ.Марка,
		|	ВТ.Модель,
		|	ВТ.СуммаКредита,
		|	ВТ.КВ,
		|	ВТ.АВ,
		|	ВТ.НомерПолиса,
		|	ВТ.СсылкаСтрах,
		|	ВТ.СсылкаКредит
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Модель В ИЕРАРХИИ(&Брэнд)";
		
		

		
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(ПериодКонец));
		Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		Запрос.УстановитьПараметр("Статус", Справочники.СтатусыРабочегоЛиста.Создан);
		Запрос.УстановитьПараметр("СвойствоМодель", ПланыВидовХарактеристик.СвойстваОбъектов.Модель);
		Запрос.УстановитьПараметр("СвойствоДобровольноеКАСКО", СвойствоДобровольноеКАСКО);
		Запрос.УстановитьПараметр("КАСКОСУлицы", КАСКОСУлицы);
		Запрос.УстановитьПараметр("ОСАГОСУлицы", ОСАГОСУлицы);
		Запрос.УстановитьПараметр("Менеджер", Менеджер);
		Запрос.УстановитьПараметр("Брэнд", Брэнд);
		
		
		Результат = Запрос.Выполнить();
		
		ВыборкаСсылка = Результат.Выбрать();
		
		Пока ВыборкаСсылка.Следующий() Цикл
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.МесяцПродажи = КонецМесяца(ВыборкаСсылка.Дата);
			
			Если  ВыборкаСсылка.Марка <> NULL Тогда
				Если ВыборкаСсылка.Марка.Родитель.Пустая() Тогда
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка;
				Иначе
					НоваяСтрока.МодельГруппа = ВыборкаСсылка.Марка.Родитель;
				КонецЕсли;
			КонецЕсли;
			
			Если ВыборкаСсылка.АВ = 0 Тогда
				НоваяСтрока.НаименованиеФинПродукта = "КВ";
				НоваяСтрока.Сумма = Окр(ВыборкаСсылка.КВ,2);
				
			Иначе
				НоваяСтрока.НаименованиеФинПродукта = "АВ";
				НоваяСтрока.Сумма =Окр( ВыборкаСсылка.АВ,2);
			КонецЕсли;	
		КонецЦикла;
		
		Если НЕ ТаблицаРезультат.Количество() = 0 Тогда
			ТаблицаРезультат.Свернуть("МодельГруппа, НаименованиеФинПродукта, МесяцПродажи", "Сумма");
			ТаблицаРезультат.Сортировать("МесяцПродажи");
		КонецЕсли;
		
		Возврат(ТаблицаРезультат.Итог("Сумма"));	
		
	
КонецФункции	

Функция ПолучитьКонтрагентовХолдинга() Экспорт
	
	СписокКонтрагентовХолдинга=Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство.Код = &КодСвойства
		|	И ЗначенияСвойствОбъектов.Значение= Истина";
	
	Запрос.УстановитьПараметр("КодСвойства", "04202");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокКонтрагентовХолдинга.Добавить(Выборка.Объект)
	КонецЦикла;
		Возврат(СписокКонтрагентовХолдинга);
КонецФункции




Права   = Неопределено;

#Если Клиент Тогда
	Права = глПрава;
#КонецЕсли 