//################################################
// Динамические кнопки
#Если Клиент Тогда

//
// http://superjur.narod.ru
//
// Удаление этих строк незнаконно!
// Гарантия 91 года и 1 месяц!!!
// Послегарантийное обслуживание - бесплатно!!!
// Круглосуточная поддержка - все 48 часов в бою!
// Ссылка на источник обязательна!
// Эти программы защищены законом об авторских правах. Запрещается перепродажа данной программы.
// ПРОВЕРЕНО! ВИРУСОВ НЕТ!!! АНТИВИРУСОВ ТОЖЕ!!!
// Смотри Милячуша в творительном !!
// скупой слепой тупой - пропой!!
// !№№!
// !55! ПадежЫ - для оглы и кызы
// !54!
// !53! Очередное сокращение кода
// !51! Прегромадное спасибо Олегу Дубровскому за оказанную моральную, информационную и материальную поддержку сего проекта.
//      Сергею Толкачёву за напоминание о том, что в русском языке всегда есть место исключениям!
// !50! П:Ответственный за электрохозяйство  Ф:Ацута Груша
// !48! исправлена ошибка при склонении фамилий (спасибо, Mario).
// !47! исправлена ошибка при склонении профессий ( спасибо, Павел Ковалев).
// !46! оптимизация + четвертый параметр задает, что вернуть - фамилия, имя или отчество или всё сразу в нужном падеже
// !42! Осел + Соловей + Воробей + Немец + Кормилец + Силиец
// !41! отчества оканчивающиеся на "ы" считаются женскими ?
// Функция для склонения одного слова!!!
// z1 - само слово
// z2 - номер падежа
// z3 - пол
// z4 - 1-склонять как фамилию, 2-имя, 3-отчество
Функция ПадежС(z1,Знач z2=2,Знач z3="*",z4=0) Экспорт
	z5=Найти(z1,"-");
	z6=?(z5=0,"","-"+ПадежС(Сред(z1,z5+1,СтрДлина(z1)-z5+1),z2,z3,z4));
	z1=НРег(?(z5=0,z1,Лев(z1,z5-1)));
	z7=Прав(z1,3);z8=Прав(z7,2);z9=Прав(z8,1);
	z5=СтрДлина(z1);
	za=Найти("ая ия ел ок яц ий па да ца ша ба та га ка",z8);
	zb=Найти("аеёийоуэюяжнгхкчшщ",Лев(z7,1));
	zc=Макс(z2,-z2);
	zd=?(za=4,5,Найти("айяь",z9));
	zd=?((zc=1)или(z9=".")или((z4=2)и(Найти("оиеу"+?(z3="ч","","бвгджзклмнпрстфхцчшщъ"),z9)>0))или((z4=1)и(Найти("мия мяэ лия кия жая лея",z7)>0)),9,?((zd=4)и(z3="ч"),2,?(z4=1,?(Найти("оеиую",z9)+Найти("их ых аа еа ёа иа оа уа ыа эа юа яа",z8)>0,9,?(z3<>"ч",?(za=1,7,?(z9="а",?(za>18,1,6),9)),?(((Найти("ой ый",z8)>0)и(z5>4)и(Прав(z1,4)<>"опой"))или((zb>10)и(za=16)),8,zd))),zd)));
	ze=Найти("лец вей бей дец пец мец нец рец вец аец иец ыец бер",z7);
	zf=?((zd=8)и(zc<>5),?((zb>15)или(Найти("жий ний",z7)>0),"е","о"),?(z1="лев","ьв",?((Найти("аеёийоуэюя",Сред(z1,z5-3 ,1))=0)и((zb>11)или(zb=0))и(ze<>45),"",?(za=7,"л",?(za=10,"к",?(za=13,"йц",?(ze=0,"",?(ze<12,"ь"+?(ze=1,"ц",""),?(ze<37,"ц",?(ze<49,"йц","р"))))))))));
	zf=?((zd=9)или((z4=3)и(z3="ы")),z1,Лев(z1,z5-?((zd>6)или(zf<>""),2,?(zd>0,1,0)))+zf+СокрП(Сред("а у а "+Сред("оыые",Найти("внч",z9)+1,1)+"ме "+?(Найти("гжкхш",Лев(z8,1))>0,"и","ы")+" е у ойе я ю я ем"+?(za=16,"и","е")+" и е ю ейе и и ь ьюи и и ю ейи ойойу ойойойойуюойойгомуго"+?((zf="е")или(za=16)или((zb>12)и(zb<16)),"и","ы")+"мм",10*zd+2*zc-3,2)));
	Возврат ?(""=z1,"",?(z4>0,ВРег(Лев(zf,1))+?((z2<0)и(z4>1),".",Сред(zf,2)),zf)+z6);
КонецФункции
//_____________________________________________________________________________
// z1 - фамилия имя отчество например Железняков Юрий Юрьевич
// z2 - Падеж ( по  умолчанию = 2 - родительный)
// 2 - родительный  ( нет кого?    ) Железнякова Юрия Юрьевича
// 3 - дательный    ( кому?        ) Железнякову Юрию Юрьевичу
// 4 - винительный  ( вижу кого?   ) Железнякова Юрия Юрьевича
// 5 - творительный ( кем?         ) Железняковым Юрием Юрьевичем
// 6 - предложный   ( о ком?       ) Железнякове Юрии Юрьевиче
// Если задать Z2 меньше 0, то на выходе получим от -1=Железняков Ю. Ю. до -6=Железнякове Ю. Ю.
// z3 - параметр Пол может не указываться, но при наличии фамилий с
// инициалами точное определение пола невозможно, поэтому предлагается задавать пол этим
// параметром  1 - мужской 2 - женский
// ДЛЯ СКЛОНЕНИЯ ПРОФЕССИЙ ИСПОЛЬЗУЙТЕ ФУНКЦИЮ ПАДЕЖП И БУДЕТ ВАМ СЧАСТЬЕ!
// ---------------------------------------------------------------------------------------
// Бибик Галушка Цой Николайчик Наталия Петровна Герценберг Кривошей Капица-Метелица
// Если Падеж(Фио ,1 ,3),       то на выходе получим Фамилия Имя Отчество и т.д.
// Если Падеж(Фио ,1 ,3,"1" ),  то                   Фамилия
// Если Падеж(Фио ,1 ,3,"2" ),  то                   Имя
// Если Падеж(Фио ,1 ,3,"3" ),  то                   Отчество
// Если Падеж(Фио, 1 ,3,"12" ), то                   Фамилия Имя
// Если Падеж(Фио, 1 ,3,"23" ), то                   Имя Отчество
// Если Падеж(Фио,-1 ,3,"231" ),то                   И. О. Фамилия
// Если Падеж(Фио,-1 ,3,"23" ), то                   И. О.
// 10-11-2003 3-20
Функция Падежик(z1,z2=2,z3=3,Знач z4="123",z5=1) Экспорт
	Возврат?(z5<4,Падежик(СокрЛП(СтрЗаменить(Сред(z1,Найти(z1+" "," ")+1),".",". ")),z2,z3,СтрЗаменить(z4,z5,ПадежС(Лев(z1,Найти(z1+" "," ")-1),z2,Сред("ча"+НРег(Прав(СокрП(z1),1)),z3,1),z5)+" "),z5+1),z4);
КонецФункции//Падежик

Функция Падеж(z1,z2=2,z3=3,Знач z4="123") Экспорт
	z1=СокрП(z1);
	z5=Прав(z1,4);
	z6=Найти("оглы кызы огло",z5);
	Возврат Падежик(?(z6>0,Лев(z1,СтрДлина(z1)-5),z1),z2,z3,z4)+?(z6>0,z5,"");
КонецФункции//Падеж

Функция ПадежП(Знач z1,Знач z2,z3=0) Экспорт
	z1=СокрЛП(z1);z4=Найти(z1+" "," ")+1;z5=Лев(z1,z4-2);z6=Прав(z5,2);
	z7=?((Найти("ая ий ый",z6)>0)и(Найти("ющий нный",Сред(z1,z4-5,4))=0)и(z3=0),"1","*");
	Возврат НРег(?((z6="ая")или(Прав(z6,1)="а"),ПадежС(z5,z2,z7,1)+" "+ПадежС(Сред(z1,z4),z2),ПадежС(z5,z2,"ч",1)+?((z6="ий")и(Найти(z1," ")=0),""," "+?(z7="1",ПадежП(Сред(z1,z4),z2,Число(z7)),Сред(z1,z4)))));
КонецФункции//ПадежП
///////////////////////////////////////////////////////////////////////////////////////


Процедура обСформироватьПодменюДействий(ЭтаФорма, ДействияФормы = "ДействияФормы", ПолеСписка = "Список") Экспорт
	Перем Объект,ОбъектСписок,ПанельДействия;
	
	Попытка
		ПанельДействия = ЭтаФорма.ЭлементыФормы[ДействияФормы];
	Исключение
		Возврат;
	КонецПопытки;
	глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	// определим что за форма
	МассивТипы = Новый Массив;
	Попытка
		ОписанияТипов = ЭтаФорма.ЭлементыФормы[ПолеСписка].Значение.Отбор.Ссылка.ТипЗначения.Типы();
		Для Сч = 0 По  ОписанияТипов.ВГраница() Цикл 
			МассивТипы.Добавить(Метаданные.НайтиПоТипу(ОписанияТипов[Сч]));
		КонецЦикла;
		Объект = Неопределено;
	Исключение
		Попытка
			Объект = ЭтаФорма.ЭтотОбъект; 
			МассивТипы.Добавить(Объект.Метаданные());
		Исключение
			Возврат;
		КонецПопытки;	
	КонецПопытки;
	
	Попытка
		ОбъектСписок = ЭтаФорма.ДокументСписок; 
	Исключение
		Попытка
			ОбъектСписок = ЭтаФорма.СправочникСписок; 
		Исключение
			ОбъектСписок = Неопределено;
		КонецПопытки;
	КонецПопытки;	
	
	Попытка
		Если ОбъектСписок<>Неопределено Тогда
			//Если ТипЗнч(ОбъектСписок)=Тип("СправочникСписок.БанковскиеСчета") Тогда
			//	// счет казначейства
			//	Колонка = ЭтаФорма.ЭлементыФормы.Список.Колонки.Добавить("СчетКазначейства");
			//	Колонка.Имя = "СчетКазначейства";
			//	Колонка.ТекстШапки =  "Счет казначейства";
			//	Колонка.ДанныеФлажка="тт_СчетКазначейства";
			//	Колонка.Доступность = Истина;
			//	Колонка.Видимость = Ложь;
			//	Колонка.УстановитьЭлементУправления(Тип("Флажок"));
			//КонецЕсли; // конец БанковскиеСчета
			
			Если ТипЗнч(ОбъектСписок)=Тип("СправочникСписок.ВидыРемонта") Тогда
				// система НО по виду ремонта
				Колонка = ЭтаФорма.ЭлементыФормы.Список.Колонки.Добавить("ОСНО");
				Колонка.Имя = "ОСНО";
				Колонка.ДанныеФлажка="ОСНО";
				Колонка.Доступность = Ложь;
				Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
				
				Колонка = ЭтаФорма.ЭлементыФормы.Список.Колонки.Добавить("НДС");
				Колонка.Имя = "НДС";
				Колонка.ДанныеФлажка="НДС";
				Колонка.Доступность = Ложь;
				Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
			КонецЕсли; // конец вид ремонта
		КонецЕсли; 
		
		Если Объект<>Неопределено Тогда
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.ЗаказНаряд") Тогда
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 				

				Если обПолучитьПраваИНастройкиПользователя(Объект.ПодразделениеКомпании, "ЗаказНарядАнкетаКИА", Объект) Тогда
					Кнопка = ПанельДействия.Кнопки.Найти("АнкетаКИА");
					Если Кнопка = Неопределено Тогда
						АнкетаКИАОтправлена=обПолучитьЗначениеСвойства(Объект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Анкета КИА отправлена"),Ложь);
						Если АнкетаКИАОтправлена Тогда стрОтправлена = " Отправлена!" Иначе стрОтправлена = "" КонецЕсли;
						Кнопка = ПанельДействия.Кнопки.Добавить("АнкетаКИА",ТипКнопкиКоманднойПанели.Действие," Анкета КИА"+стрОтправлена,Новый Действие("ДействияФормыОбОбщие"));
						Если АнкетаКИАОтправлена Тогда
							Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
						Иначе
							Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
						КонецЕсли;
						Кнопка.Подсказка = "Отправить Анкету КИА";
						Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
						//Кнопка.ИзменяетДанные = Истина;
					КонецЕсли; 
					
					Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель1");
					Если Кнопка = Неопределено Тогда
						ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель1",ТипКнопкиКоманднойПанели.Разделитель);
					КонецЕсли; 
				КонецЕсли; 
				
				//Кнопка = ПанельДействия.Кнопки.Найти("Такси");
				//Если Кнопка = Неопределено Тогда
				//	Кнопка = ПанельДействия.Кнопки.Добавить("Такси",ТипКнопкиКоманднойПанели.Действие,"Такси",Новый Действие("ДействияФормыОбОбщие"));
				//	Если Объект.Такси Тогда
				//		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
				//	Иначе
				//		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
				//	КонецЕсли;
				//	Кнопка.Пометка = Объект.Такси;
				//	Кнопка.Подсказка = "Такси для клиента";
				//	Кнопка.Пояснение = "Такси для клиента";
				//	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
				//	Кнопка.ИзменяетДанные = Истина;
				//КонецЕсли; 
				
				//Кнопка = ПанельДействия.Кнопки.Найти("Подтверждение");
				//Если Кнопка = Неопределено Тогда
				//	Кнопка = ПанельДействия.Кнопки.Добавить("Подтверждение",ТипКнопкиКоманднойПанели.Действие,"Подтверждение",Новый Действие("ДействияФормыОбОбщие"));
				//	Если Объект.КлиентПодтверждение Тогда
				//		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
				//	Иначе
				//		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
				//	КонецЕсли;
				//	Кнопка.Пометка = Объект.КлиентПодтверждение;
				//	Кнопка.Подсказка = "Подтверждение прибытия клиента";
				//	Кнопка.Пояснение = "Подтверждение прибытия клиента";
				//	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
				//	Кнопка.ИзменяетДанные = Истина;
				//КонецЕсли; 
				//
				//Кнопка = ПанельДействия.Кнопки.Найти("ПовторныйЗН");
				//Если Кнопка = Неопределено Тогда
				//	Кнопка = ПанельДействия.Кнопки.Добавить("ПовторныйЗН",ТипКнопкиКоманднойПанели.Действие,"Повтор",Новый Действие("ДействияФормыОбОбщие"));
				//	Если Объект.ПовторныйЗН Тогда
				//		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
				//	Иначе
				//		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
				//	КонецЕсли;
				//	Кнопка.Подсказка = "Повторный ЗН";
				//	Кнопка.Пояснение = "Повторный ЗН";
				//	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
				//	//Кнопка.ИзменяетДанные = Истина;
				//	Кнопка.Доступность = обПраво("ЗаказНарядПовторныйЗН");
				//КонецЕсли; 
				//
				//// заполнение списка выбора радиостанций
				//Запрос=Новый Запрос("ВЫБРАТЬ
				//|	Радиостанции.Ссылка КАК Радиостанции,
				//|	Радиостанции.Представление
				//|ИЗ
				//|	Справочник.Радиостанции КАК Радиостанции
				//|ГДЕ
				//|	Радиостанции.ПометкаУдаления = ЛОЖЬ");
				//ТаблицаРадио = Запрос.Выполнить().Выгрузить();
				//ЭтаФорма.ЭлементыФормы.Радиостанция.СписокВыбора.ЗагрузитьЗначения(ТаблицаРадио.ВыгрузитьКолонку("Радиостанции"));
				//
				//// измененеие себестоиомсти 
				//Кнопка = ПанельДействия.Кнопки.Найти("ИзменениеСебестоимости");
				//Если Кнопка = Неопределено Тогда
				//	Кнопка = ПанельДействия.Кнопки.Добавить("ИзменениеСебестоимости",ТипКнопкиКоманднойПанели.Действие,"Изменение себестоимости",Новый Действие("ДействияФормыОбОбщие"));
				//	Если Объект.ИзменениеСебестоимости Тогда
				//		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
				//	Иначе
				//		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
				//	КонецЕсли;
				//	Кнопка.Подсказка = "Разрешить списание ниже себестоимости";
				//	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
				//	Кнопка.Пометка = Объект.ИзменениеСебестоимости;
				//	Кнопка.Доступность =  обПраво("ЗаказНарядИзменениеСебестоимости",глПрава);
				//КонецЕсли; 
				
			КонецЕсли; //конец ЗН
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
				
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель1");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель1",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Если НЕ ЭтаФорма.Заголовок = "АРМ Запись на ремонт" Тогда
					//Кнопка = ПанельДействия.Кнопки.Найти("Такси");
					//Если Кнопка = Неопределено Тогда
					//	Кнопка = ПанельДействия.Кнопки.Добавить("Такси",ТипКнопкиКоманднойПанели.Действие,"Такси",Новый Действие("ДействияФормыОбОбщие"));
					//	Если Объект.Такси Тогда
					//		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
					//	Иначе
					//		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
					//	КонецЕсли;
					//	Кнопка.Пометка = Объект.Такси;
					//	Кнопка.Подсказка = "Такси для клиента";
					//	Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
					//	Кнопка.ИзменяетДанные = Истина;
					//КонецЕсли; 
					//
					Кнопка = ПанельДействия.Кнопки.Найти("Подтверждение");
					Если Кнопка = Неопределено Тогда
						Кнопка = ПанельДействия.Кнопки.Добавить("Подтверждение",ТипКнопкиКоманднойПанели.Действие,"Подтверждение",Новый Действие("ДействияФормыОбОбщие"));
						Если Объект.КлиентПодтверждение Тогда
							Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
						Иначе
							Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
						КонецЕсли;
						Кнопка.Пометка = Объект.КлиентПодтверждение;
						Кнопка.Подсказка = "Подтверждение прибытия клиента";
						Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
						Кнопка.ИзменяетДанные = Истина;
					КонецЕсли; 
					
					Кнопка = ПанельДействия.Кнопки.Найти("ПовторныйЗН");
					Если Кнопка = Неопределено Тогда
						Кнопка = ПанельДействия.Кнопки.Добавить("ПовторныйЗН",ТипКнопкиКоманднойПанели.Действие,"Повтор",Новый Действие("ДействияФормыОбОбщие"));
						Если Объект.ПовторныйЗН Тогда
							Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
						Иначе
							Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
						КонецЕсли;
						Кнопка.Подсказка = "Повторный ЗН";
						Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
						//Кнопка.ИзменяетДанные = Истина;
						Кнопка.Доступность = обПраво("ЗаказНарядПовторныйЗН");
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; //конец ЗНР
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.РеализацияАвтомобилей") Тогда
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка = ПанельДействия.Кнопки.Найти("ИзменениеСебестоимости");
				Если Кнопка = Неопределено Тогда
					Кнопка = ПанельДействия.Кнопки.Добавить("ИзменениеСебестоимости",ТипКнопкиКоманднойПанели.Действие,"Изменение себестоимости",Новый Действие("ДействияФормыОбОбщие"));
					Если Объект.ИзменениеСебестоимости Тогда
						Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
					Иначе
						Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
					КонецЕсли;
					Кнопка.Подсказка = "Разрешить списание ниже себестоимости";
					Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
					Кнопка.Пометка = Объект.ИзменениеСебестоимости;
					Кнопка.Доступность =  обПраво("РеализацияАвтомобилейИзменениеСебестоимости",глПрава);
				КонецЕсли;	
			КонецЕсли; // конец реал авто
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.ОтчетКомиссионераЗаАвтомобили") Тогда
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка = ПанельДействия.Кнопки.Найти("ИзменениеСебестоимости");
				Если Кнопка = Неопределено Тогда
					Кнопка = ПанельДействия.Кнопки.Добавить("ИзменениеСебестоимости",ТипКнопкиКоманднойПанели.Действие,"Изменение себестоимости",Новый Действие("ДействияФормыОбОбщие"));
					Если Объект.ИзменениеСебестоимости Тогда
						Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
					Иначе
						Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
					КонецЕсли;
					Кнопка.Подсказка = "Разрешить списание ниже себестоимости";
					Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
					Кнопка.Пометка = Объект.ИзменениеСебестоимости;
					Кнопка.Доступность =  обПраво("РеализацияАвтомобилейИзменениеСебестоимости",глПрава);
				КонецЕсли;	
			КонецЕсли; // конец отчет комиссионера авто
			
			Попытка	// система ШК
				Если ТипЗнч(Объект) = Тип("ДокументОбъект.ПоступлениеТоваров") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеТоваровВПроизводство") ИЛИ
					ТипЗнч(Объект) = Тип("ДокументОбъект.РеализацияТоваров") ИЛИ ТипЗнч(Объект) = Тип("ДокументОбъект.ИзвлечениеТоваровИзПроизводства") Тогда
					Если обПраво("НоменклатураСистемаШКПросмотр") Тогда
						Колонка = ЭтаФорма.ЭлементыФормы.Товары.Колонки.Вставить(ЭтаФорма.ЭлементыФормы.Товары.Колонки.Индекс(ЭтаФорма.ЭлементыФормы.Товары.Колонки["Количество"]),"КоличествоШК");
						Колонка.Имя = "КоличествоШК";
						Колонка.Данные="КоличествоШК";
						Колонка.Доступность = обПраво("НоменклатураСистемаШКРедактироватьКоличество");
						Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;	// конец системы ШК	
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
				Если обПраво("ПоступлениеТоваровСтрокиПоказыватьСодержание",глПрава) Тогда
					Колонка = ЭтаФорма.ЭлементыФормы.Товары.Колонки.Вставить(ЭтаФорма.ЭлементыФормы.Товары.Колонки.Индекс(ЭтаФорма.ЭлементыФормы.Товары.Колонки["Номенклатура"])+1,"Содержание");
					Колонка.Имя = "Содержание";
					Колонка.Данные="Содержание";
					Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
					Колонка.Ширина = 30;
					
					Колонка = ЭтаФорма.ЭлементыФормы.Товары.Колонки.Вставить(ЭтаФорма.ЭлементыФормы.Товары.Колонки.Индекс(ЭтаФорма.ЭлементыФормы.Товары.Колонки["Номенклатура"])+2,"Счет затрат");
					Колонка.Имя = "КоррСчет";
					Колонка.Данные="КоррСчет";
					Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
					Колонка.Ширина = 10;
					
					Колонка = ЭтаФорма.ЭлементыФормы.Товары.Колонки.Найти("КоличествоШК");
					Если Колонка = Неопределено Тогда
						Колонка = ЭтаФорма.ЭлементыФормы.Товары.Колонки.Вставить(ЭтаФорма.ЭлементыФормы.Товары.Колонки.Индекс(ЭтаФорма.ЭлементыФормы.Товары.Колонки["Количество"]),"КоличествоШК");
						Колонка.Имя = "КоличествоШК";
						Колонка.Данные="КоличествоШК";
						Колонка.УстановитьЭлементУправления(Тип("ПолеВвода"));
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; // конец поступления товаров
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.РеализацияТоваров") Тогда
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка = ПанельДействия.Кнопки.Найти("ИзменениеСебестоимости");
				Если Кнопка = Неопределено Тогда
					Кнопка = ПанельДействия.Кнопки.Добавить("ИзменениеСебестоимости",ТипКнопкиКоманднойПанели.Действие,"Изменение себестоимости",Новый Действие("ДействияФормыОбОбщие"));
					Если Объект.ИзменениеСебестоимости Тогда
						Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
					Иначе
						Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
					КонецЕсли;
					Кнопка.Подсказка = "Разрешить списание ниже себестоимости";
					Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
					Кнопка.Пометка = Объект.ИзменениеСебестоимости;
					Кнопка.Доступность =  обПраво("РеализацияТоваровИзменениеСебестоимости",глПрава);
				КонецЕсли; 
			КонецЕсли; // конец реал товары
			
			Если ТипЗнч(Объект)=Тип("ДокументОбъект.РабочийЛистКредитногоОтдела") Тогда
				Если НЕ ОбПраво("Редактирование_АВ_КВ_вРабЛистах") Тогда
					ЭтаФорма.ЭлементыФормы.ПроцентнаяСтавка.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_СуммаКредита.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.ОбщаяСуммаКредита.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.ОбщаяСуммаАВ.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_КАСКО.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_СЖБанк.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_СЖСалон.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_GAPБанк.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_GAPСалон.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_ПрочиеУслуги.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_КАСКО.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_СЖБанк.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_СЖСалон.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_GAPБанк.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_GAPСалон.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.сав_ПрочиеУслуги.ТолькоПросмотр = Истина;
					ЭтаФорма.ЭлементыФормы.пав_ПроцентСоВсейСуммы.Доступность = ЛОЖЬ;
				КонецЕсли; 
			КонецЕсли; // конец РабочийЛистКредитногоОтдела
			
			
			Если ТипЗнч(Объект)=Тип("СправочникОбъект.БанковскиеСчета") Тогда
				// счет казначейста
				СписокВидСчета = ЭтаФорма.ЭлементыФормы.ВидСчета.СписокВыбора;
				СписокВидСчета.Добавить("Казначейство");
				СписокВидСчета.Добавить("Аукцион");
				СписокВидСчета.Добавить("Транзитный");
				
				//Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				//Если Кнопка = Неопределено Тогда
				//	ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				//КонецЕсли; 
				//
				//Кнопка1 = ПанельДействия.Кнопки.Найти("тт_СчетКазначейства");
				//Если Кнопка1 = Неопределено Тогда
				//	Кнопка1 = ПанельДействия.Кнопки.Добавить("тт_СчетКазначейства",ТипКнопкиКоманднойПанели.Действие,"Счет казначейства",Новый Действие("ДействияФормыОбОбщие"));
				//	Кнопка1.Подсказка = "тт_СчетКазначейства";
				//	Кнопка1.Отображение = ОтображениеКнопкиКоманднойПанели.НадписьКартинка;
				//	Кнопка1.Пометка = Объект.тт_СчетКазначейства;
				//	Кнопка1.Доступность = Истина;
				//	Если Кнопка1.Пометка Тогда
				//		Кнопка1.Картинка = БиблиотекаКартинок.УстановитьФлажки;
				//	Иначе
				//		Кнопка1.Картинка = БиблиотекаКартинок.СнятьФлажки;
				//	КонецЕсли;
				//КонецЕсли; 
			КонецЕсли; // конец вид ремонта
			
			Если ТипЗнч(Объект)=Тип("СправочникОбъект.ДоговорыВзаиморасчетов") Тогда
				
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка1 = ПанельДействия.Кнопки.Найти("кнДКП");
				Если Кнопка1 = Неопределено Тогда
					Кнопка1 = ПанельДействия.Кнопки.Добавить("кнДКП",ТипКнопкиКоманднойПанели.Действие,"ДКП",Новый Действие("ДействияФормыОбОбщие"));
					Кнопка1.Подсказка = "Договор купли-продажи а/м";
					Кнопка1.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
					Кнопка1.Доступность = Истина;
				КонецЕсли; 
				
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель1");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель1",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка = ПанельДействия.Кнопки.Найти("кнДТО");
				Если Кнопка = Неопределено Тогда
					Кнопка = ПанельДействия.Кнопки.Добавить("кнДТО",ТипКнопкиКоманднойПанели.Действие,"ТО",Новый Действие("ДействияФормыОбОбщие"));
					Кнопка.Подсказка = "Договор ТО и ремонта";
					Кнопка.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
					Кнопка.Доступность = Истина;
				КонецЕсли; 
				
				// ************* установка доступности реквизитов в карточке договора
				обОбщие.обДоступностьВидовДоговоровДляПрефиксации(ЭтаФорма,Объект);
				
			КонецЕсли; // конец Договора
			
			Если ТипЗнч(Объект)=Тип("СправочникОбъект.Контрагенты") Тогда
				
				//Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				//Если Кнопка = Неопределено Тогда
				//	ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				//КонецЕсли; 
				//
				//Кнопка1 = ПанельДействия.Кнопки.Найти("ЗаполнитьПоИНН");
				//Если Кнопка1 = Неопределено Тогда
				//	Кнопка1 = ПанельДействия.Кнопки.Добавить("ЗаполнитьПоИНН",ТипКнопкиКоманднойПанели.Действие,"Заполнить по ИНН",Новый Действие("ДействияФормыОбОбщие"));
				//	Кнопка1.Подсказка = "Заполнить По ИНН";
				//	Кнопка1.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
				//	Кнопка1.Доступность = Истина;
				//КонецЕсли; 
				
				// блокировка редактирования значащих реквизитов
				Попытка
					Если Не Объект.ЭтоНовый() Тогда
						Если обПраво("КонтрагентыБлокировкаРедактированиеЗначащихРеквизитов") Тогда
							ЭтаФорма.ЭлементыФормы.Наименование.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.Фамилия.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.Имя.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.Отчество.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.НаименованиеПолное.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.ИНН.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.ИННФизлицо.Доступность = Ложь;
						КонецЕсли;
					КонецЕсли;						
				Исключение
				КонецПопытки;
			КонецЕсли; // конец Контрагенты
			
			Если ТипЗнч(Объект)=Тип("СправочникОбъект.ВидыРемонта") Тогда
				// система НО по виду ремонта
				Кнопка = ПанельДействия.Кнопки.Найти("КнопкиобОбщиеРазделитель");
				Если Кнопка = Неопределено Тогда
					ПанельДействия.Кнопки.Добавить("КнопкиобОбщиеРазделитель",ТипКнопкиКоманднойПанели.Разделитель);
				КонецЕсли; 
				
				Кнопка1 = ПанельДействия.Кнопки.Найти("ОСНО");
				Если Кнопка1 = Неопределено Тогда
					Кнопка1 = ПанельДействия.Кнопки.Добавить("ОСНО",ТипКнопкиКоманднойПанели.Действие,"ОСНО",Новый Действие("ДействияФормыОбОбщие"));
					Кнопка1.Подсказка = "ОСНО";
					Кнопка1.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
					Кнопка1.Пометка = Объект.ОСНО;
					Кнопка1.Доступность = Истина;
				КонецЕсли; 
				Кнопка2 = ПанельДействия.Кнопки.Найти("ВидРемонтаНДС");
				Если Кнопка2 = Неопределено Тогда
					Кнопка2 = ПанельДействия.Кнопки.Добавить("ВидРемонтаНДС",ТипКнопкиКоманднойПанели.Действие,"НДС",Новый Действие("ДействияФормыОбОбщие"));
					Кнопка2.Подсказка = "НДС в виде ремонта";
					Кнопка2.Отображение = ОтображениеКнопкиКоманднойПанели.Надпись;
					Кнопка2.Пометка = Объект.НДС;
					Кнопка2.Доступность = Истина;
				КонецЕсли; 
			КонецЕсли; // конец вид ремонта
			
			Если ТипЗнч(Объект)=Тип("СправочникОбъект.Номенклатура") Тогда
				// блокировка редактирования значащих реквизитов
				Попытка
					Если НЕ Объект.ЭтоНовый() Тогда
						Если обПраво("НоменклатураБлокировкаРедактированиеЗначащихРеквизитов") Тогда
							ЭтаФорма.ЭлементыФормы.Артикул.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.Наименование.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.НаименованиеПолное.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.НаименованиеИностранное.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.БазоваяЕдиницаИзмерения.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.ЗапретПродажи.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.ЗапретЗакупки.Доступность = Ложь;
							ЭтаФорма.ЭлементыФормы.КоманднаяПанельПрименяемость1.Доступность=Ложь;
							ЭтаФорма.ЭлементыФОрмы.МинимальныеОстатки.Доступность=Ложь;
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;					
			КонецЕсли; // конец Номенклатура
		КонецЕсли; 
		
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

Функция обОбработкаРеквизита(Кнопка, ЭтаФорма, Элемент) Экспорт
	Перем Статус, Ссылка;
	Отказ = Ложь;
	Если ТипЗнч(Кнопка) = Тип("КнопкаКоманднойПанели") Тогда
		Команда = Кнопка.Имя;
	Иначе
		Команда = Кнопка;
	КонецЕсли; 
	
	Ссылка = Неопределено; 
	
	//Если Команда = "ИзменениеСебестоимости" Тогда
	//	обИзменениеСебестоимости(Кнопка,ЭтаФорма.ЭтотОбъект);
	//ИначеЕсли Команда = "кнДКП" Тогда
	//	обУстановитьНазваниеДоговора("ДКП",Кнопка,ЭтаФорма.ЭтотОбъект);
	//ИначеЕсли Команда = "кнДТО" Тогда
	//	обУстановитьНазваниеДоговора("ДТО",Кнопка,ЭтаФорма.ЭтотОбъект);
	Если Команда = "АнкетаКИА" Тогда
		АнкетаVoc(Кнопка,ЭтаФорма.ЭтотОбъект);
		//ИначеЕсли Команда = "Такси" Тогда
		//	обТакси(Кнопка,ЭтаФорма.ЭтотОбъект);
	//ИначеЕсли Команда = "ЗаполнитьПоИНН" Тогда
		//обЗаполнитьПоИНН(ЭтаФорма.ЭтотОбъект,ЭтаФорма,Истина);
		//ИначеЕсли Команда = "Подтверждение" Тогда
		//	обПодтверждение(Кнопка,ЭтаФорма.ЭтотОбъект);
		//ИначеЕсли Команда = "ПовторныйЗН" Тогда
		//	обПовторныйЗН(Кнопка,ЭтаФорма.ЭтотОбъект);
	//ИначеЕсли Команда = "тт_СчетКазначейства" Тогда
	//	обИзменитьРеквизит(Кнопка,ЭтаФорма.ЭтотОбъект,Команда);
	ИначеЕсли Команда = "ОСНО" Тогда
		обОСНО(Кнопка,ЭтаФорма.ЭтотОбъект);
	ИначеЕсли Команда = "ВидРемонтаНДС" Тогда
		обВидРемонтаНДС(Кнопка,ЭтаФорма.ЭтотОбъект);
	КонецЕсли; 
	Возврат Истина;
КонецФункции

Процедура обЗаполнитьПоИНН(СпрОбъект,Форма,флКонтИнфо) Экспорт
	
	ЭтоЮЛ = Истина;
	
	Если СтрДлина(СокрЛП(СпрОбъект.ИНН)) = 12 Тогда
		РеквизитыКонтрагента = обСервисДанныхЕдиныхГосРеестров.РеквизитыПредпринимателяПоИНН(СокрЛП(СпрОбъект.ИНН));
		СпрОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЧастныйПредприниматель;
		ЭтоЮЛ = Ложь;
	ИначеЕсли СтрДлина(СокрЛП(СпрОбъект.ИНН)) = 10 Тогда
		РеквизитыКонтрагента = обСервисДанныхЕдиныхГосРеестров.РеквизитыЮрЛицаПоИНН(СокрЛП(СпрОбъект.ИНН));
		СпрОбъект.ФормаСобственности = Перечисления.ФормыСобственности.ЮридическоеЛицо;
	ИначеЕсли СокрЛП(СпрОбъект.ИНН) = "" Тогда
		Возврат;
	Иначе	
		Сообщить("Не верно задан ИНН");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыКонтрагента.ОписаниеОшибки) Тогда
		Предупреждение(РеквизитыКонтрагента.ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ЮрАдрес = киПолучитьПредставлениеКИ(СпрОбъект.Ссылка,Справочники.ВидыКонтактнойИнформации.АдресЮридический);	
	ФактАдрес = киПолучитьПредставлениеКИ(СпрОбъект.Ссылка,Справочники.ВидыКонтактнойИнформации.АдресФактический);	
	ПочтАдрес = киПолучитьПредставлениеКИ(СпрОбъект.Ссылка,Справочники.ВидыКонтактнойИнформации.АдресПочтовый);	
	
	ПерезаполняемыеСвойства = Новый Массив;
	ПроверяемыеСвойства = Новый Соответствие;
	ПроверяемыеСвойства.Вставить("Наименование", РеквизитыКонтрагента.Наименование);
	ПроверяемыеСвойства.Вставить("НаименованиеПолное", РеквизитыКонтрагента.НаименованиеПолное);
	Если ЭтоЮЛ Тогда
		ПроверяемыеСвойства.Вставить("КПП", РеквизитыКонтрагента.КПП);
	КонецЕсли;
	
	//ПроверяемыеСвойства.Вставить("ОГРН", РеквизитыКонтрагента.РегистрационныйНомер);
	Если флКонтИнфо И ЭтоЮЛ Тогда
		ПроверяемыеСвойства.Вставить("ЮрАдрес", ЮрАдрес);
		ПроверяемыеСвойства.Вставить("ФактАдрес", ФактАдрес);
		ПроверяемыеСвойства.Вставить("ПочтАдрес", ПочтАдрес);
		Для Каждого Св Из ПроверяемыеСвойства Цикл
			Если Св.Ключ <> "ЮрАдрес" И Св.Ключ <> "ФактАдрес" И Св.Ключ <> "ПочтАдрес" Тогда
				Если ЗначениеЗаполнено(Св.Значение) И ЗначениеЗаполнено(СпрОбъект[Св.Ключ])  Тогда
					ПерезаполняемыеСвойства.Добавить(Св.Ключ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ЮрАдрес) И ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес.Представление) Тогда
			ПерезаполняемыеСвойства.Добавить("ЮрАдрес");
		КонецЕсли;
		Если ЗначениеЗаполнено(ФактАдрес) И ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес.Представление) Тогда
			ПерезаполняемыеСвойства.Добавить("ФактАдрес");
		КонецЕсли;
		Если ЗначениеЗаполнено(ПочтАдрес) И ЗначениеЗаполнено(РеквизитыКонтрагента.ЮридическийАдрес.Представление) Тогда
			ПерезаполняемыеСвойства.Добавить("ПочтАдрес");
		КонецЕсли;
	КонецЕсли;
	Перезаполнять = Истина;
	
	Если ПерезаполняемыеСвойства.Количество()>0 Тогда 
		Перезаполнять = Вопрос("Перезаполнить текущие реквизиты("+обСервисДанныхЕдиныхГосРеестров.СтрокаИзМассиваПодстрок(ПерезаполняемыеСвойства)+")?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да ; 		
	КонецЕсли;
	
	Попытка
		Для Каждого Св Из ПроверяемыеСвойства Цикл
			// Пустые реквизиты объекта перезаполняем всегда
			// Непустые - по выбору пользователя
			Если Перезаполнять Тогда
				Если флКонтИнфо И ЭтоЮЛ Тогда
					Попытка
						Если Св.Ключ = "ЮрАдрес" Тогда
							УстановитьКИ(Форма.НаборКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресЮридический, РеквизитыКонтрагента.ЮридическийАдрес,СпрОбъект)
						ИначеЕсли Св.Ключ = "ФактАдрес" Тогда
							УстановитьКИ(Форма.НаборКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресФактический, РеквизитыКонтрагента.ЮридическийАдрес,СпрОбъект)
						ИначеЕсли Св.Ключ = "ПочтАдрес" Тогда
							УстановитьКИ(Форма.НаборКонтактнойИнформации, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресПочтовый, РеквизитыКонтрагента.ЮридическийАдрес,СпрОбъект)
						Иначе
							СпрОбъект[Св.Ключ] = Св.Значение;
						КонецЕсли;
					Исключение
					КонецПопытки;
				Иначе
					СпрОбъект[Св.Ключ] = Св.Значение;
				КонецЕсли;
				
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
		ЕСли НЕ ЭтоЮл ТОгда
			СпрОбъект.Наименование = СпрОбъект.Наименование + " ИП";
		КонецЕсли;
		
		Попытка
			Если НЕ Форма = Неопределено Тогда
				Попытка
					Форма.ПриСменеФормыСобственности();
				Исключение
				КонецПопытки;
				ВидФИО=(СпрОбъект.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо);
				// элементы ввода наименования
				Форма.ЭлементыФормы.тФамилия.Видимость=ВидФИО;
				Форма.ЭлементыФормы.тИмя.Видимость=ВидФИО;
				Форма.ЭлементыФормы.тОтчество.Видимость=ВидФИО;
				Форма.ЭлементыФормы.Фамилия.Видимость=ВидФИО;
				Форма.ЭлементыФормы.Имя.Видимость=ВидФИО;
				Форма.ЭлементыФормы.Отчество.Видимость=ВидФИО;
				Форма.ЭлементыФормы.Наименование.Видимость = НЕ ВидФИО;
				Форма.ЭлементыФормы.тНаименование.Видимость = НЕ ВидФИО;
				Если НЕ ВидФИО И СпрОбъект.Наименование = "Не заполнено" Тогда
					СпрОбъект.Наименование = "";
				ИначеЕсли ВидФИО И ПустаяСтрока(СпрОбъект.Наименование) Тогда
					СпрОбъект.Наименование = "Не заполнено";
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	Исключение
		
	КонецПопытки;
	
	
КонецПроцедуры

Процедура УстановитьКИ(НаборЗаписей, ТипКИ, ВидКИ, СтруктураАдреса, СпрОбъект)
	
	ЮрАдресНайден = Ложь;
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		Если ЗаписьНабора.Вид = ВидКИ И ЗаписьНабора.Тип = ТипКИ Тогда
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтруктураАдреса);
			ЮрАдресНайден = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Если в наборе записей из формы не найдена запись с юр адресом, добавим
	Если Не ЮрАдресНайден Тогда
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Объект = СпрОбъект.Ссылка;
		ЗаписьНабора.Вид = ВидКИ;
		ЗаписьНабора.Тип = ТипКИ;
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтруктураАдреса);
	КонецЕсли;
	
КонецПроцедуры


#КонецЕсли 
// Динамические кнопки конец
//################################################

//отправка анкеты voc
Процедура АнкетаVoc(Кнопка,ДокументОбъект,Записывать=Истина) Экспорт
	
	Если НЕ обПолучитьПраваИНастройкиПользователя(ДокументОбъект.ПодразделениеКомпании, "ЗаказНарядАнкетаКИА", ДокументОбъект) Тогда
		Возврат;	
	КонецЕсли;
	
		ТелоЗапроса = "{"+
	"'ClientName': '"	+ ?(ЗначениеЗаполнено(ДокументОбъект.Заказчик.НаименованиеПолное),СокрЛП(ДокументОбъект.Заказчик.НаименованиеПолное),"") 	+ "'," +
	"'Vin': '"			+ ?(ЗначениеЗаполнено(ДокументОбъект.Автомобиль.VIN),СокрЛП(ДокументОбъект.Автомобиль.VIN),"") + "'," +
	"'LicNumber': '"	+ Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокументОбъект.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер) 		+ "'," +
	"'Phone': '"		+ киПолучитьПредставлениеКИ(ДокументОбъект.Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый)		+ "'," +
	"'TermCode': '"		+ "23014"		+ "'," +	
	"'TermName': '"		+ "23014"	 	+ "'," +
	"'Dealer': '"		+ "23014"		+ "'"  +		
	"}";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Accept-Language",  "ru");
	Заголовки.Вставить("Accept-Charset",   "utf-8");
	Заголовки.Вставить("Content-Language", "ru");
	Заголовки.Вставить("Content-type",     "application/json");
	Заголовки.Вставить("Content-Length",   СтрДлина(ТелоЗапроса));
	
	//HTTPЗапрос = Новый HTTPЗапрос;
	//HTTPЗапрос.АдресРесурса = "/Account/StartSurvey";
	//HTTPЗапрос.Заголовки = Заголовки;
	//HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	//
	//HTTPСоединение = Новый HTTPСоединение("voc.kia.ru", 1557);
	//HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//
	//Если HTTPОтвет.КодСостояния = 200 Тогда
	//	Сообщить("Анкетирование запущено!");	// Все успешно
	//Иначе
	//	Сообщить("Ошибка запуска анкеты");		// Ошибка
	//КонецЕсли;	
	
	// Альтернативное подключение через COMОбъект:
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	WinHttp.Option(2,"utf-8");
	WinHttp.Option(4, 13056);
	WinHttp.Open("POST","http://voc.kia.ru:1557/Account/StartSurvey",Ложь);
	WinHttp.SetAutoLogonPolicy(0);
	WinHttp.SetRequestHeader("Accept-Language",  "ru");
	WinHttp.SetRequestHeader("Accept-Charset",   "utf-8");
	WinHttp.setRequestHeader("Content-Language", "ru");
	WinHttp.setRequestHeader("Content-type",     "application/json"); 
	WinHttp.setRequestHeader("Content-Length",   СтрДлина(ТелоЗапроса));            
	WinHttp.Send(ТелоЗапроса);
	
	
	Если WinHttp.Status = 200 тогда
		Сообщить("Анкетирование запущено!");	// Все успешно
		РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		РС.Объект=ДокументОбъект.Ссылка;
		РС.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Анкета КИА отправлена");
		РС.Значение=Истина;
		РС.Записать();
	Иначе
		Сообщить("Ошибка запуска анкеты");		// Ошибка
	КонецЕсли;

	
	
	//СервисVOC=WSСсылки.AnketaVoC.СоздатьWSПрокси("http://tempuri.org/", "ActivationInterviewService", "ActivationInterviewServiceSoap");
	//Данные = СервисVOC.ФабрикаXDTO.Пакеты.Получить("http://tempuri.org/").Получить("ActivateInterview");
	//Строка = СервисVOC.ФабрикаXDTO.Создать(Данные);
	//Строка.dealerCode = 23014;
	//Строка.salonCode = "23014";
	//Строка.date=Формат(ДокументОбъект.Дата,"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'Z'""");Сообщить(Формат(ДокументОбъект.Дата,"ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс'Z'"""));
	//Строка.name=?(ЗначениеЗаполнено(ДокументОбъект.Заказчик.НаименованиеПолное),СокрЛП(ДокументОбъект.Заказчик.НаименованиеПолное),"");
	//Строка.phone =  киПолучитьПредставлениеКИ(ДокументОбъект.Заказчик, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	//Строка.vin= ?(ЗначениеЗаполнено(ДокументОбъект.Автомобиль.VIN),СокрЛП(ДокументОбъект.Автомобиль.VIN),"");
	//Строка.licNumber=Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(ДокументОбъект.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
	//Ответ = СервисVOC.ActivateInterview(Строка.dealerCode,Строка.salonCode,Строка.date,Строка.name,Строка.phone,Строка.vin,Строка.licNumber);
	//Сообщить ("Данные по клиенту выгружены!");
	//Предупреждение("Анкета отправлена!");
	//ДокументОбъект.АнкетаКИАОтправлена = Истина;
	//Если Записывать Тогда
	//	ДокументОбъект.Записать();
	//	Кнопка.Текст = " Анкета КИА Отправлена!";
	//	Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	//КонецЕсли;
КонецПроцедуры

Процедура обдкТоварыПриВыводеСтроки(ЭтаФорма, ТабличноеПоле, Элемент, ОформлениеСтроки, ДанныеСтроки, ПраваПользователя = Неопределено) Экспорт
	глПрава = обПолучитьПраваИНастройкиПользователя(ПараметрыСеанса.Пользователь);
	Попытка	// вывод счетов учета затрат текстом
		Если обПраво("ПоступлениеТоваровСтрокиПоказыватьСодержание",глПрава) Тогда
			Если ЭтаФорма.ХозОперация = Справочники.ХозОперации.УслугиСтороннихОрганизаций Тогда
				ОформлениеСтроки.Ячейки.КоличествоШК.Текст = СокрЛП(?(НЕ СокрЛП(Строка(ДанныеСтроки.КоррСчет))="",СокрЛП(Строка(ДанныеСтроки.КоррСчет)),СокрЛП(Строка(ДанныеСтроки.Номенклатура.СтатьяДопРасходов.КоррСчет))) + " " + СокрЛП(Строка(ДанныеСтроки.Номенклатура.СтатьяДопРасходов)));
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура обИзменитьРеквизит(Кнопка,СпрОбъект,ИмяРеквизита) Экспорт
	СпрОбъект[ИмяРеквизита] = НЕ СпрОбъект[ИмяРеквизита];
	Кнопка.Пометка = СпрОбъект[ИмяРеквизита];
	СпрОбъект.Записать();
	Если СпрОбъект[ИмяРеквизита] Тогда
		Кнопка.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	Иначе
		Кнопка.Картинка = БиблиотекаКартинок.СнятьФлажки;
	КонецЕсли;
КонецПроцедуры

Процедура обОСНО(Кнопка,СпрОбъект) Экспорт
	СпрОбъект.ОСНО = НЕ СпрОбъект.ОСНО;
	Кнопка.Пометка = СпрОбъект.ОСНО;
	СпрОбъект.Записать();
КонецПроцедуры

Процедура обВидРемонтаНДС(Кнопка,СпрОбъект) Экспорт
	СпрОбъект.НДС = НЕ СпрОбъект.НДС;
	Кнопка.Пометка = СпрОбъект.НДС;
	СпрОбъект.Записать();
КонецПроцедуры
// система ШК конец

//раскраска заказ покупателя
Процедура обСписокПриПолученииДанных(ЭтаФорма, Элемент, ОформленияСтрок) Экспорт
	
	Попытка
		ИмяДок = Метаданные.НайтиПоТипу(Элемент.ТипЗначения.Типы()[0]).Имя;
		Если ИмяДок = "ЗаказПокупателя" Тогда
			
			СвойствоСостояниеЗаказа =ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("Состояние заказа"); //Состояние заказа	
			ЖелтыйЦвет = Новый Цвет(255, 215, 0);   // желтый
			ЗеленыйЦвет = Новый Цвет(192, 220, 192); // зеленый  
			КрасныйЦвет = Новый Цвет(255, 192, 203);  // красный
			СерыйЦвет = Новый Цвет(192,192,192);    //Серый цвет (списан)
			БелыйЦвет = Новый Цвет(255,255,255); 
			
			Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ЗначенияСвойствОбъектов.Значение КАК Значение
				|ИЗ
				|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				|ГДЕ
				|	ЗначенияСвойствОбъектов.Объект = &Объект
				|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
				
				Запрос.УстановитьПараметр("Объект", ОформлениеСтроки.ДанныеСтроки.Ссылка);
				Запрос.УстановитьПараметр("Свойство", СвойствоСостояниеЗаказа );
				Выборка = Запрос.Выполнить().Выбрать();
				
				Если Выборка.Следующий() Тогда
					Состояние = Выборка.Значение;
					Если Состояние = неопределено или Состояние = Null Тогда
						продолжить;
					КонецЕсли;
					Если Состояние = 4  Тогда        	 		//Отпущена  //Серый
						ОформлениеСтроки.ЦветТекста = СерыйЦвет;	
						ОформлениеСтроки.ЦветФона = БелыйЦвет;
					ИначеЕсли Состояние = 1 Тогда   //нет заказа поставщику //КрасныйЦвет
						ОформлениеСтроки.ЦветФона = КрасныйЦвет;
					ИначеЕсли Состояние = 2 Тогда   //Есть ЗАКАЗ, но не собран //ЖелтыйЦвет
						ОформлениеСтроки.ЦветФона = ЖелтыйЦвет;
					ИначеЕсли Состояние = 3 Тогда   //Есть на складе и собран //ЗеленыйЦвет
						ОформлениеСтроки.ЦветФона = ЗеленыйЦвет;
					Иначе 										
						ОформлениеСтроки.ЦветФона = БелыйЦвет;				
					КонецЕсли;
				КонецЕсли;
				
				// проверим наличие заметок
				НаборРегистра = РегистрыСведений.ЗаметкиПользователей.СоздатьНаборЗаписей();
				НаборРегистра.Отбор.Объект.ВидСравнения  = ВидСравнения.Равно;
				НаборРегистра.Отбор.Объект.Значение      = ОформлениеСтроки.ДанныеСтроки.Ссылка;
				НаборРегистра.Отбор.Объект.Использование = Истина;
				НаборРегистра.Прочитать();
				Попытка
					Если НаборРегистра.Количество() > 0 Тогда
						ОформлениеСтроки.Ячейки.ХозОперация.Текст = НаборРегистра[НаборРегистра.Количество()-1].ТекстЗаметки;
					КонецЕсли;	
				Исключение
				КонецПопытки;
			КонецЦикла; 
		КонецЕсли;	
		Если ИмяДок = "ЗаявкаНаРасходДС" Тогда
			
			ЖелтыйЦвет = Новый Цвет(255, 215, 0);   // желтый
			ЗеленыйЦвет = Новый Цвет(192, 220, 192); // зеленый  
			ФиолетовыйЦвет = Новый Цвет(222, 166, 206);  // фиолетовый
			СерыйЦвет = Новый Цвет(192,192,192);    //Серый цвет (списан)
			БелыйЦвет = Новый Цвет(255,255,255); 
			СинийЦвет = Новый Цвет(176,196,222);    //синий
			ТемноСинийЦвет = Новый Цвет(0, 0, 255);
			
			Для каждого ОформлениеСтроки Из ОформленияСтрок Цикл
				
				//anton 25\03\2019
				//Платежи=ОформлениеСтроки.ДанныеСтроки.Ссылка.Платежи;
				//Если Платежи.Количество() > 0 Тогда
				//	ОформлениеСтроки.Ячейки.ДатаПлатежа.УстановитьТекст(Формат(Платежи[0].ДатаПлатежа,"ДФ=dd.MM.yyyy"));
				//КонецЕсли;
				//anton 25\03\2019
				
				//misha2
				//СтатусДокумента = дкПолучитьСтатусДокумента(ОформлениеСтроки.ДанныеСтроки.Ссылка);
				СтатусДокумента = ОформлениеСтроки.ДанныеСтроки.Ссылка.СтатусТТ;
				
				Если СтатусДокумента = Неопределено или СтатусДокумента = Null Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтатусДокумента = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка  Тогда
				ИначеЕсли СтатусДокумента = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Резерв  Тогда
					ОформлениеСтроки.ЦветФона = ЗеленыйЦвет;
					ОформлениеСтроки.ЦветТекста = ТемноСинийЦвет;	
				ИначеЕсли СтатусДокумента = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.НеВплане  Тогда
					ОформлениеСтроки.ЦветФона = ЖелтыйЦвет;
				ИначеЕсли СтатусДокумента = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Отклонена  Тогда
					ОформлениеСтроки.ЦветФона = ФиолетовыйЦвет;
				ИначеЕсли СтатусДокумента = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплата  Тогда
					ОформлениеСтроки.ЦветФона = ЗеленыйЦвет;
				Иначе 										
					ОформлениеСтроки.ЦветФона = БелыйЦвет;				
				КонецЕсли;
				//ОформлениеСтроки.ЦветФона = СинийЦвет;
				//ОформлениеСтроки.ЦветТекста = СерыйЦвет;	
				//ОформлениеСтроки.ЦветФона = БелыйЦвет;    СерыйЦвет
				//misha2
				//Если СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден  Тогда
				//	ОформлениеСтроки.ЦветТекста = СерыйЦвет;	
				//	ОформлениеСтроки.ЦветФона = БелыйЦвет;
				//ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен  Тогда
				//	ОформлениеСтроки.ЦветФона = ЗеленыйЦвет;
				//ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован  Тогда
				//	ОформлениеСтроки.ЦветФона = ЖелтыйЦвет;
				//ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден0  Тогда
				//	ОформлениеСтроки.ЦветФона = СинийЦвет;
				//ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен  Тогда
				//	ОформлениеСтроки.ЦветФона = ФиолетовыйЦвет;
				//Иначе 										
				//	ОформлениеСтроки.ЦветФона = БелыйЦвет;				
				//КонецЕсли;
				
				//Попытка
				//	Если СокрЛП(ОформлениеСтроки.ДанныеСтроки.Ссылка.Комментарий)<>"" Тогда
				//		ОформлениеСтроки.Ячейки.ХозОперация.Текст = СокрЛП(ОформлениеСтроки.ДанныеСтроки.Ссылка.Платежи[0]);
				//	КонецЕсли;	
				//Исключение
				//КонецПопытки;
			КонецЦикла; 
		КонецЕсли;	
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

// сбЗаказыПокупателейРезервирование
Процедура обСоздатьНапоминанияПоЗаказу(ТаблицаЗаказов,ТаблицаПолныхРезервов,РегистраторАвтор) Экспорт

	ЗаписатьНапоминания = Ложь;
	Для Каждого Выборка Из ТаблицаЗаказов Цикл

		МассивПользователейДляОповещения = Выборка.ЗаказПокупателя.ПользователиДляОповещений.Выгрузить();

		//Добавим в пользователей для оповещения, автора текущего документа, если его там нет..
		Если МассивПользователейДляОповещения.Найти(Выборка.Автор) = 0 Тогда
			МассивПользователейДляОповещения.Добавить(Выборка.Автор);
		КонецЕсли;
		
		ЧастичноеРезервирование = (ТаблицаПолныхРезервов.Найти(Выборка.ЗаказПокупателя, "Заказ") = Неопределено);
		
		Если Выборка.СпособУведомления = 2 И ЧастичноеРезервирование Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПользователейДляОповещения.Свернуть("ПользовательДляОповещения");
				
		Для каждого ТекСтрока Из МассивПользователейДляОповещения Цикл	
			ТекПользователь = ТекСтрока.ПользовательДляОповещения;
			
			НаборЗаписейНапоминания=РегистрыСведений.Напоминания.СоздатьНаборЗаписей();
			НаборЗаписейНапоминания.Отбор.Автор.Установить(РегистраторАвтор);
			НаборЗаписейНапоминания.Отбор.Пользователь.Установить(ТекПользователь);
			НаборЗаписейНапоминания.Отбор.Завершено.Установить(Ложь);
			НаборЗаписейНапоминания.Прочитать();
			ДатаОповещения=ТекущаяДата();
			
			
			//Для каждого автора создадим напоминание
			НоваяЗапись = НаборЗаписейНапоминания.Добавить(); 
			НоваяЗапись.Пользователь            = ТекПользователь;
			НоваяЗапись.Автор                   = РегистраторАвтор;
			НоваяЗапись.Завершено               = Ложь;
			НоваяЗапись.РеальнаяДатаОповещения  = ДатаОповещения;
			НоваяЗапись.Объект                  = Выборка.ЗаказПокупателя;
			НоваяЗапись.ДатаНачала              = ДатаОповещения;
			НоваяЗапись.ДатаОповещения          = ДатаОповещения;
			Если ЧастичноеРезервирование Тогда
				НоваяЗапись.Описание            = СокрЛП(ТекПользователь)+"! Детали по заказу <"+СТРОКА(Выборка.ЗаказПокупателя)+"> для <"+СокрЛП(?(ТипЗнч(Выборка.ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказВнутренний"),Выборка.ЗаказПокупателя.ПодразделениеПолучатель,Выборка.ЗаказПокупателя.Контрагент))+"> частично зарезервированы.";
			Иначе
				НоваяЗапись.Описание            = СокрЛП(ТекПользователь)+"! Детали по заказу <"+СТРОКА(Выборка.ЗаказПокупателя)+"> для <"+СокрЛП(?(ТипЗнч(Выборка.ЗаказПокупателя)=Тип("ДокументСсылка.ЗаказВнутренний"),Выборка.ЗаказПокупателя.ПодразделениеПолучатель,Выборка.ЗаказПокупателя.Контрагент))+"> полностью зарезервированы.";
			КонецЕсли;
			НоваяЗапись.Редактирование          = Ложь;
			НоваяЗапись.Тема                    = "Резервирование товаров"; 
			НоваяЗапись.ТипПериода              = "00"; 
			НоваяЗапись.УдалитьПоИстеченииСрока = Истина; 
			асСч = Ложь;
			ЗаписатьНапоминания = Истина;
			Попытка
				НаборЗаписейНапоминания.Записать(Истина);
			Исключение
				Сообщить("Ошибка создания напоминаний о резервировании товаров: "+ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла; 

КонецПроцедуры // обСоздатьНапоминанияПоЗаказу()

// заполнение пользователей для оповещения в заказе покупателя.
Процедура обЗаполнитьПользователейДляОповещения(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт	
	Если Источник.ЭтоНовый() Тогда
		Источник.ПользователиДляОповещений.Очистить();		
		новСтр = Источник.ПользователиДляОповещений.Добавить();		
		новСтр.ПользовательДляОповещения = Источник.Автор;
		
		//	добавим пользователей из списка параметров 000012022 ДокументыТТ.ЗаказыПокупателяПользователиДляОповещения
		тт_СпПараметров = Справочники.тт_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ЗаказыПокупателяПользователиДляОповещения",Ложь,Источник.Организация,Источник.ПодразделениеКомпании);
		Если НЕ ЗначениеЗаполнено(тт_СпПараметров) Тогда
			тт_СпПараметров = Справочники.тт_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ЗаказыПокупателяПользователиДляОповещения",Ложь,Источник.Организация);
		КонецЕсли;	
		Если ЗначениеЗаполнено(тт_СпПараметров) Тогда
			табДолжности = Новый ТаблицаЗначений;
			табДолжности.Колонки.Добавить("Должность");
			табПодразделений = Новый ТаблицаЗначений;
			табПодразделений.Колонки.Добавить("Подразделение");
			Для каждого стрПарам ИЗ тт_СпПараметров Цикл
				новДолж = табДолжности.Добавить();
				новДолж.Должность = стрПарам.Параметр6;
				новПодр = табПодразделений.Добавить();
				новПодр.Подразделение = стрПарам.Параметр5;
			КонецЦикла;	
			табДолжности.Свернуть("Должность");
			табПодразделений.Свернуть("Подразделение");
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Пользователи.Ссылка КАК Пользователь
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Сотрудник.Подразделение В(&Подразделения)
			|	И Пользователи.Сотрудник.Должность В(&Должности)
			|	И Пользователи.Сотрудник.ПометкаУдаления = ЛОЖЬ
			|	И Пользователи.Сотрудник.ФлагУволен = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Пользователи.Наименование";
			
			Запрос.УстановитьПараметр("Должности", табДолжности);
			Запрос.УстановитьПараметр("Подразделения", табПодразделений);
			
			табРезультата = Запрос.Выполнить().Выгрузить();
			
			Для каждого стрПольз ИЗ табРезультата Цикл
				новСтр = Источник.ПользователиДляОповещений.Добавить();		
				новСтр.ПользовательДляОповещения = стрПольз.Пользователь;
			КонецЦикла;
		КонецЕсли;
		Источник.ПользователиДляОповещений.Свернуть("ПользовательДляОповещения");
	КонецЕсли;	
КонецПроцедуры // обЗаполнитьПользователейДляОповещения()

// Определение ФР по таблице НастрокиФРпоОрганизациям
Процедура обОпределениеФР(ЗагружаемыйЧек, ЭтаФорма, GUID_ФР) Экспорт
	
	Попытка	
		
		КассаККМ = обПолучитьПраваИНастройкиПользователя(ЗагружаемыйЧек.ПодразделениеКомпании, "ОсновнаяКассаККМ", ЗагружаемыйЧек);
		СкладККМ = обПолучитьПраваИНастройкиПользователя(ЗагружаемыйЧек.ПодразделениеКомпании, "СкладДляККМ", ЗагружаемыйЧек);
		ФРПоУмолчанию = обПолучитьПраваИНастройкиПользователя(ЗагружаемыйЧек.ПодразделениеКомпании, "ФРПоУмолчанию", ЗагружаемыйЧек);
		
		ЭтаФорма.Организация 			= ЗагружаемыйЧек.Организация;
		Если НЕ обЗначениеНеЗаполнено(КассаККМ) Тогда
			ЭтаФорма.КассаККМ 				= КассаККМ;
			ЭтаФорма.ПодразделениеКомпании 	= КассаККМ.Подразделение;
		КонецЕсли;
		ЭтаФорма.СкладКомпании 			= СкладККМ;
		
		Если НЕ обЗначениеНеЗаполнено(ФРПоУмолчанию) Тогда
			ЭтаФорма.ФР 					= ФРПоУмолчанию;
			GUID_ФР							= ФРПоУмолчанию.ИдентификаторОборудования;
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
Конецпроцедуры	

Процедура обОпределениеФР_ВключитьОборудование(ЭтотОбъект, ФР, КассаККМ) Экспорт
	
	Попытка	
		
		ФР = обПолучитьПраваИНастройкиПользователя(ЭтотОбъект.ПодразделениеКомпании, "ФРПоУмолчанию", ЭтотОбъект);
		КассаККМ = обПолучитьПраваИНастройкиПользователя(ЭтотОбъект.ПодразделениеКомпании, "ОсновнаяКассаККМ", ЭтотОбъект);
		
	Исключение
	КонецПопытки;
	
Конецпроцедуры	

Процедура обОпределениеФРОтделСНО(ДокументОбъект,ОсновнойОтдел,КодНалогообложения) Экспорт
	
	Попытка
		СтатьяДДС=ДокументОбъект.СтатьяДДС;
		Если СтатьяДДС<>Неопределено И СтатьяДДС<>Справочники.СтатьиДДС.ПустаяСсылка() Тогда
			//Сервис ЕНВД
			Если ДокументОбъект.Организация <> Справочники.Организации.ОсновнаяОрганизация И        //ТТ на ОСН
				ДокументОбъект.Организация <> Справочники.Организации.НайтиПоРеквизиту("ИНН", "090103290098") И 	//Кунова на УСН
				СтатьяДДС.Код = "ЦБ000023" ИЛИ СтатьяДДС.Код = "ЦБ000024" ИЛИ СтатьяДДС.Код = "ЦБ000025" Тогда
				КодНалогообложения = 8; //ЕНВД
			КонецЕсли;	
			////Продажи/возвраты Автомобилей
			//Если СтатьяДДС.Код = "ЦБ000123" ИЛИ СтатьяДДС.Код = "ЦБ000124" ИЛИ СтатьяДДС.Код = "ЦБ000125" ИЛИ СтатьяДДС.Код = "ЦБ000126" Тогда
			//	ОсновнойОтдел = 3;
			//КонецЕсли;	
			
		КонецЕсли;
	Исключение				
	КонецПопытки;  
	
		
	Попытка
		Если НЕ обЗначениеНеЗаполнено(ДокументОбъект.ДокументОснование) И ТипЗнч(ДокументОбъект.ДокументОснование)= Тип("ДокументСсылка.ЗаказНаряд")  Тогда
			Если ДокументОбъект.ДокументОснование.ПодразделениеКомпании.ВидНалога=Перечисления.ВидыНалогов.ЕНВД Тогда
				КодНалогообложения = 8;   //ЕНВД
			КонецЕсли;				
		КонецЕсли;
	Исключение				
	КонецПопытки;
	
	//Условие для чека на возврат
	Попытка
		Если НЕ обЗначениеНеЗаполнено(ДокументОбъект.ДокументОснование) И
			НЕ обЗначениеНеЗаполнено(ДокументОбъект.ДокументОснование.ДокументОснование) И
			ТипЗнч(ДокументОбъект.ДокументОснование.ДокументОснование)= Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Если ДокументОбъект.ДокументОснование.ДокументОснование.ПодразделениеКомпании.ВидНалога=Перечисления.ВидыНалогов.ЕНВД Тогда
				КодНалогообложения = 8;   //ЕНВД
			КонецЕсли;				
		КонецЕсли;
	Исключение				
	КонецПопытки;


Конецпроцедуры	

Процедура обОпределениеФРСтатьяДДС(Источник) Экспорт
	Попытка
		//Если ТипЗнч(Чек) = Тип("ДокументОбъект.ЧекНаОплату") ИЛИ Чек = ЭтотОбъект Тогда
		//	Если ТипЗнч(Чек.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		//		ЭтотОбъект.СтатьяДДС = Справочники.СтатьиДДС.НайтиПоКоду("ЦБ000023");
		//	Иначе
		//		ЭтотОбъект.СтатьяДДС = Справочники.СтатьиДДС.ОплатаОтПокупателя;
		//	КонецЕсли;
		//	//Если ТипЗнч(Чек.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ 
		//	//	ТипЗнч(Чек.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		//	//	ЭтотОбъект.СтатьяДДС = Справочники.СтатьиДДС.НайтиПоНаименованию("Оплата от покупателя (ЕНВД)",Истина);
		//	//КонецЕсли;
		//	//Если ТипЗнч(Чек.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		//	//	ЭтотОбъект.СтатьяДДС = Справочники.СтатьиДДС.ПредоплатаОтПокупателя;
		//	//КонецЕсли;
		//	//Если ТипЗнч(Чек.ДокументОснование) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		//	//	Если Найти(Врег(Чек.ДокументОснование.СкладКомпании.Наименование),Врег("Trade In"))>0 Тогда
		//	//		ЭтотОбъект.СтатьяДДС = Справочники.СтатьиДДС.НайтиПоКоду("00013004");
		//	//	КонецЕсли;
		//	//КонецЕсли;
		//КонецЕсли;
		Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
			тт_СпПараметров = Справочники.тт_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ЗаполнениеСтатьиДДС",Ложь,Источник.ДокументОснование.ХозОперация);
			Если ЗначениеЗаполнено(тт_СпПараметров) Тогда
				//		ТТ_СпПараметровОрг = Справочники.ТТ_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ПроверкаЗаполненияЦФО",Ложь,Источник.ХозОперация,Источник.Организация);
				//		Если НЕ ЗначениеЗаполнено(ТТ_СпПараметровОрг) Тогда
				Источник.СтатьяДДС = тт_СпПараметров[0].Параметр5;
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	Попытка	//доп заполнение чека на оплату
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			Источник.ПолученоНал = Источник.СуммаДокумента;
			Если Источник.Оплаты.Количество()=0 Тогда
				НоваяОплата = Источник.Оплаты.Добавить();
				НоваяОплата.Сумма =  Источник.СуммаДокумента;
				НоваяОплата.ТипОплаты = Справочники.ТипыОплат.Наличные;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
Конецпроцедуры	

//	********** изменение логики кнопок Утверждения	ПроектУтверждения
Процедура обСформироватьСтруктуруКнопокУтверждения(ДокументСсылка, ИсторияУтверждения,СтатусДокумента,СтруктураКнопокУтверждения, ПраваПользователя) Экспорт

	ВидДокумента = ДокументСсылка.Метаданные().Имя;
	ПраваУтверждения = обПраво("Значения Утверждение " + ВидДокумента, ПраваПользователя);
	Если ПраваУтверждения = Неопределено Тогда
		СтруктураКнопокУтверждения.Вставить("Подготовлен",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Согласован",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Утвержден",	Ложь);
		СтруктураКнопокУтверждения.Вставить("Отклонен",		Ложь);
		Возврат;
	КонецЕсли;
	ПравоПодготовлен = ПраваУтверждения[Перечисления.СтатусыДокументов.Подготовлен];
	ПравоСогласован  = ПраваУтверждения[Перечисления.СтатусыДокументов.Согласован];
	ПравоУтвержден0  = ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден0];
	ПравоУтвержден   = ПраваУтверждения[Перечисления.СтатусыДокументов.Утвержден];
	ПравоОтклонен    = ПраваУтверждения[Перечисления.СтатусыДокументов.Отклонен];
	
	ТекПользователь = ПараметрыСеанса.Пользователь;
	// 1. Кнопка Подготовлен
	ЗначениеПодготовлен = Ложь;
	Если ПравоПодготовлен Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.ПустаяСсылка() Тогда
			ЗначениеПодготовлен = Истина;
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Отклонен Тогда
			ЗначениеПодготовлен = Истина;
		КонецЕсли; 
	КонецЕсли; 
	
	// 2. Кнопка Согласован
	ЗначениеСогласован = Ложь;
	Если ПравоСогласован Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			ЗначениеСогласован = Истина;
		КонецЕсли;
	КонецЕсли; 
	
	// 2.1 Без Кнопка Согласован
	ЗначениеУтвержден0 = Ложь;
	ЗначениеУтвержден = Ложь;
	Если ПравоУтвержден0 Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			ЗначениеУтвержден0 = Истина;
		КонецЕсли; 
	КонецЕсли;
	Если ПравоУтвержден Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			ЗначениеУтвержден = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	// 3_5. Кнопка Утвержден0
	Если ПравоУтвержден0 Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			ЗначениеУтвержден0 = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	// 3. Кнопка Утвержден
	Если ПравоУтвержден Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден0 Тогда	
			ЗначениеУтвержден = Истина;
		КонецЕсли; 
	КонецЕсли;
	
	// 4. Кнопка Отклонен
	ЗначениеОтклонен = Ложь;
	Если ПравоОтклонен Тогда
		Если СтатусДокумента = Перечисления.СтатусыДокументов.Подготовлен Тогда
			ЗначениеОтклонен = Истина;
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Согласован Тогда
			ЗначениеОтклонен = Истина;
		ИначеЕсли СтатусДокумента = Перечисления.СтатусыДокументов.Утвержден0 Тогда	
			ЗначениеОтклонен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	// заполняем структуру для кнопок
	СтруктураКнопокУтверждения.Вставить("Подготовлен",	ЗначениеПодготовлен);
	СтруктураКнопокУтверждения.Вставить("Согласован",	ЗначениеСогласован);
	СтруктураКнопокУтверждения.Вставить("Утвержден0",	ЗначениеУтвержден0);
	СтруктураКнопокУтверждения.Вставить("Утвержден",	ЗначениеУтвержден);
	СтруктураКнопокУтверждения.Вставить("Отклонен",		ЗначениеОтклонен);
	
КонецПроцедуры // обСформироватьСтруктуруКнопокУтверждения()

Функция обПроверитьЗаполнениеАдресовКонтрагента(Источник) Экспорт
	Отказ = Ложь;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтактнаяИнформация.Тип,
	                      |	КонтактнаяИнформация.Вид,
	                      |	КонтактнаяИнформация.Представление
	                      |ИЗ
	                      |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	                      |ГДЕ
	                      |	КонтактнаяИнформация.Объект = &Объект");
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Если ТипЗнч(Источник.Заказчик) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.УстановитьПараметр("Объект", Источник.Заказчик);
		РезультатЗаказчик = Запрос.Выполнить().Выгрузить();
		Если РезультатЗаказчик.Количество() = 0 Тогда
			Сообщить("Не заполнены контактные данные у Заказчика!");
		Иначе
			//Проверим телефон
			Если обЗначениеНеЗаполнено(Источник.Заказчик.ОсновнойТелефон) Тогда
				Сообщить("Не заполнен основной телефон у Заказчика!");	
			КонецЕсли;
			Телефоны = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон, "Тип");
			Если Телефоны = Неопределено Тогда
				Сообщить("Не заполнен телефон у Заказчика!");	
			КонецЕсли;
			//Проверим эл. почту
			АдресаЭлПочты = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
			Если АдресаЭлПочты = Неопределено Тогда
				Сообщить("Не заполнен адрес электронной почты у Заказчика!");	
			КонецЕсли;
			//Проверим адреса
			Адреса = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.Адрес, "Тип");
			Если Адреса = Неопределено Тогда
				Сообщить("Не заполнен ни один адрес у Заказчика!");	
			КонецЕсли;

			АдресЮридический = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресЮридический, "Вид");
			АдресФактический = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресФактический, "Вид");
			АдресПочтовый = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресПочтовый, "Вид");
			ТекстСообщения = "Не заполнен ";
			Если АдресЮридический = Неопределено ИЛИ ПустаяСтрока(АдресЮридический.Представление) Тогда
				ТекстСообщения = ТекстСообщения + "юридический";
				Отказ = Истина;
			КонецЕсли;
			Если АдресФактический = Неопределено ИЛИ ПустаяСтрока(АдресФактический.Представление) Тогда
				Если НЕ ТекстСообщения = "Не заполнен " Тогда ТекстСообщения = ТекстСообщения + ", " КонецЕсли;
				ТекстСообщения = ТекстСообщения + "фактический";
				Отказ = Истина;
			КонецЕсли;
			Если АдресПочтовый = Неопределено ИЛИ ПустаяСтрока(АдресПочтовый.Представление) Тогда
				Если НЕ ТекстСообщения = "Не заполнен " Тогда ТекстСообщения = ТекстСообщения + ", " КонецЕсли;
				ТекстСообщения = ТекстСообщения + "почтовый";
				Отказ = Истина;
			КонецЕсли;
			Если Отказ Тогда
				ТекстСообщения = ТекстСообщения + " адрес у Заказчика!";
				Сообщить(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НЕ Источник.Контрагент = Источник.Заказчик Тогда
		Если ТипЗнч(Источник.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			Если НЕ Источник.Контрагент.Пустая() Тогда
				Запрос.УстановитьПараметр("Объект", Источник.Контрагент);
				РезультатЗаказчик = Запрос.Выполнить().Выгрузить();
				Если РезультатЗаказчик.Количество() = 0 Тогда
					Сообщить("Не заполнены контактные данные у Контрагента!");
				Иначе
					//Проверим телефон
					Если обЗначениеНеЗаполнено(Источник.Контрагент.ОсновнойТелефон) Тогда
						Сообщить("Не заполнен основной телефон у Контрагента!");	
					КонецЕсли;
					Телефоны = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.Телефон, "Тип");
					Если Телефоны = Неопределено И обЗначениеНеЗаполнено(Источник.Заказчик.ОсновнойТелефон) Тогда
						Сообщить("Не заполнен телефон у Контрагента!");	
					КонецЕсли;
					//Проверим эл. почту
					АдресаЭлПочты = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, "Тип");
					Если АдресаЭлПочты = Неопределено Тогда
						Сообщить("Не заполнен адрес электронной почты у Контрагента!");	
					КонецЕсли;
					//Проверим адреса
					Адреса = РезультатЗаказчик.Найти(Перечисления.ТипыКонтактнойИнформации.Адрес, "Тип");
					Если Адреса = Неопределено Тогда
						Сообщить("Не заполнен ни один адрес у Контрагента!");	
					КонецЕсли;
					
					АдресЮридический = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресЮридический, "Вид");
					АдресФактический = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресФактический, "Вид");
					АдресПочтовый = РезультатЗаказчик.Найти(Справочники.ВидыКонтактнойИнформации.АдресПочтовый, "Вид");
					ТекстСообщения = "Не заполнен ";
					Если АдресЮридический = Неопределено ИЛИ ПустаяСтрока(АдресЮридический.Представление) Тогда
						ТекстСообщения = ТекстСообщения + "юридический";
						Отказ = Истина;
					КонецЕсли;
					Если АдресФактический = Неопределено ИЛИ ПустаяСтрока(АдресФактический.Представление) Тогда
						Если НЕ ТекстСообщения = "Не заполнен " Тогда ТекстСообщения = ТекстСообщения + ", " КонецЕсли;
						ТекстСообщения = ТекстСообщения + "фактический";
						Отказ = Истина;
					КонецЕсли;
					Если АдресПочтовый = Неопределено ИЛИ ПустаяСтрока(АдресПочтовый.Представление) Тогда
						Если НЕ ТекстСообщения = "Не заполнен " Тогда ТекстСообщения = ТекстСообщения + ", " КонецЕсли;
						ТекстСообщения = ТекстСообщения + "почтовый";
						Отказ = Истина;
					КонецЕсли;
					Если Отказ Тогда
						ТекстСообщения = ТекстСообщения + " адрес у Контрагента!";
						Сообщить(ТекстСообщения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Отказ;
КонецФункции

// Обновляет кэш для регистрации упущенного спроса
Процедура ОбновитьРСУпущенногоСпроса(Объект) Экспорт
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		// В спрос попадают строки с артикулом
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ЗначениеЗаполнено(ТекСтрока.Номенклатура.АртикулДляПоиска) Тогда
						
			КоличествоОстаток = 0;
			ЗапросОстатка = новый Запрос;
			ЗапросОстатка.Текст =
			"ВЫБРАТЬ
			|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки";
			ЗапросОстатка.УстановитьПараметр("Номенклатура", ТекСтрока.Номенклатура);
			ВыборкаОстатка = ЗапросОстатка.Выполнить().Выбрать();
			Если ВыборкаОстатка.Количество()>0 тогда
				ВыборкаОстатка.Следующий();
				КоличествоОстаток = ВыборкаОстатка.КоличествоОстаток;
			КонецЕсли;
			
			//anton 28\03\2019
			КолВстроке=ТекСтрока.Количество*ТекСтрока.Коэффициент;
			
			Если КоличествоОстаток < КолВстроке Тогда
				
				ТекСтрокаАртикул          = ТекСтрока.Номенклатура.Артикул;
				ТекСтрокаАртикулДляПоиска = ТекСтрока.Номенклатура.АртикулДляПоиска;
				ТекСтрокаПроизводитель    = ТекСтрока.Номенклатура.Производитель;
				ТекСтрокаНоменклатура     = ТекСтрока.Номенклатура;
				
				НоваяЗапись = РегистрыСведений.УпущенныйСпрос.СоздатьМенеджерЗаписи();
				НоваяЗапись.Период            = ТекущаяДата();
				НоваяЗапись.Артикул           = ТекСтрокаАртикул;
				НоваяЗапись.АртикулДляПоиска  = ТекСтрокаАртикулДляПоиска;
				НоваяЗапись.Производитель     = ТекСтрокаПроизводитель;
				НоваяЗапись.Номенклатура      = ТекСтрокаНоменклатура;
				НоваяЗапись.Количество        = КолВстроке-КоличествоОстаток;
				НоваяЗапись.КоличествоОстаток = КолВстроке-КоличествоОстаток;
				НоваяЗапись.Автор             = Объект.Автор;
				НоваяЗапись.Комментарий       = Объект.Метаданные().Имя;
				Попытка
				НоваяЗапись.ИсточникЗапроса   = Объект.ИсточникЗапроса;
				Исключение
				КонецПопытки;
			НоваяЗапись.Записать(Истина);
			КонецЕсли;
			//anton 28\03\2019
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//Префиксация договоров.
// заполнить список выбора видов договоров префиксации по штатному виду договора
Процедура обЗаполнитьСписокВыбораВидовДоговоровДляПрефиксации(Договор,Элемент) Экспорт
	
	//ТТ_СпПараметров = Справочники.ТТ_СписокПараметров.ПолучитьТаблицуЗначений("СистемаНумерацииДоговоровТТ",Ложь,Договор.ВидДоговора);
	//Если НЕ ТТ_СпПараметров = Неопределено Тогда
	//	Элемент.СписокВыбора.ЗагрузитьЗначения(ТТ_СпПараметров.ВыгрузитьКолонку("Параметр2"));
	//КонецЕсли;	
	//
	//anton
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тт_ВидыДоговоров.Ссылка
		|ИЗ
		|	Справочник.тт_ВидыДоговоров КАК тт_ВидыДоговоров
		|ГДЕ
		|	тт_ВидыДоговоров.ВидДоговора = &ВидДоговора
		|	И тт_ВидыДоговоров.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДоговора", Договор.ВидДоговора);	
	СписокПрефиксов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	

	Элемент.СписокВыбора.ЗагрузитьЗначения(СписокПрефиксов);	
	//anton
	
КонецПроцедуры // обЗаполнитьСписокВыбораВидовДоговоровДляПрефиксации()

// Установить доступность элементов формы догвора при префиксации
Процедура обДоступностьВидовДоговоровДляПрефиксации(ЭтаФорма,Объект) Экспорт
	Если обПраво("СистемаНумерацииДоговоровТТ") Тогда
		ЭтаФорма.ЭлементыФормы.НомерДоговора.ТолькоПросмотр = НЕ обПраво("СистемаНумерацииДоговоровТТРедактированиеНомеров");
		Если НЕ Объект.ЭтоНовый() Тогда
			ЭтаФорма.ЭлементыФормы.ВидДоговора.ТолькоПросмотр = НЕ обПраво("СистемаНумерацииДоговоровТТРедактированиеНомеров");
			ЭтаФорма.ЭлементыФормы.тт_ВидДоговора.ТолькоПросмотр = НЕ обПраво("СистемаНумерацииДоговоровТТРедактированиеНомеров");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры // обДоступностьВидовДоговоровДляПрефиксации()
	
Процедура обПроверитьЗаполнитьМКУ(Объект) Экспорт
	Попытка
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.ЗаявкаНаРемонт") Тогда
			Если Объект.ЭтоНовый() Тогда
				Если Справочники.тт_СписокПараметров.ПроверитьНаличиеВСписке("ДокументыТТ.ЗаявкаНаРемонтМКУВидыРемонта",Ложь,Объект.ВидРемонта) Тогда
					Если Справочники.тт_СписокПараметров.ПроверитьНаличиеВСписке("ДокументыТТ.ЗаявкаНаРемонтМКУМастерДиспетчер",Ложь,ПараметрыСеанса.Пользователь) Тогда
						Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь.Сотрудник) Тогда
							Объект.Мастер = ПараметрыСеанса.Пользователь.Сотрудник;
							Объект.Диспетчер = Объект.Мастер;
							тт_СпПараметров = Справочники.тт_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ЗаявкаНаРемонтМКУЦеха",Ложь,Объект.Организация);
							Если ЗначениеЗаполнено(тт_СпПараметров) Тогда
								Объект.Цех = тт_СпПараметров[0].Параметр5;
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры 
	
Процедура обПроверитьЗаполнитьМКУСклад(Объект,ТекСтрока) Экспорт
	Попытка
		Если Справочники.тт_СписокПараметров.ПроверитьНаличиеВСписке("ДокументыТТ.ЗаявкаНаРемонтМКУВидыРемонта",Ложь,Объект.ВидРемонта) Тогда
			тт_СпПараметров = Справочники.тт_СписокПараметров.ПолучитьТаблицуЗначений("ДокументыТТ.ЗаявкаНаРемонтМКУЦеха",Ложь,Объект.Организация);
			Если ЗначениеЗаполнено(тт_СпПараметров) Тогда
				ТекСтрока.СкладКомпании = тт_СпПараметров[0].Параметр6;
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры 

