// Возвращает текст запроса для получения регистраторов для первоначального заполнения
//  регистра "Операции прослеживаемых товаров"
//
// Возвращаемое значение:
//  Строка - текст запроса
Функция ЗапросРегистраторовОперацийПрослеживаемогоТовара() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиАвтомобилей.Регистратор КАК Регистратор,
	|	ОстаткиАвтомобилей.Период КАК Период
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
	|ГДЕ
	|	ОстаткиАвтомобилей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ОстаткиАвтомобилей.ГТД.РНПТ
	|	И ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.СписаниеАвтомобилей";
	Возврат ТекстЗапроса;
	
КонецФункции

#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("СписаниеАвтомобилей" , "Акт списания автомобилей");
	СтруктураМакетов.Вставить("ТОРГ16"              , "ТОРГ-16 (Акт о списании товаров)");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти