Функция ПолучитьОбязательныеПоля() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Title");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьОбязательныеПоляШаблона() Экспорт
	ОбязательныеПоля = Новый Массив;
	ОбязательныеПоля.Добавить("Address");
	ОбязательныеПоля.Добавить("Category");
	ОбязательныеПоля.Добавить("Description");
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция ПолучитьДополнительныеОбязательныеПоля(Category, GoodsType) Экспорт
	ОбязательныеПоля = Новый Массив;
	Если Category = ns_ДляДомаИДачиПовтИсп.ПолучитьРемонтИСтроительство() Тогда
		ОбязательныеПоля.Добавить("Condition");
		ОбязательныеПоля.Добавить("GoodsType");
		Если GoodsType = ns_ДляДомаИДачиПовтИсп.ПолучитьСтройматериалы() Тогда
			ОбязательныеПоля.Добавить("GoodsSubType");	
		КонецЕсли;
	ИначеЕсли Category = ns_ДляДомаИДачиПовтИсп.ПолучитьБытоваяТехника() Тогда
		ОбязательныеПоля.Добавить("Condition");
		ОбязательныеПоля.Добавить("GoodsType");
	ИначеЕсли Category = ns_ДляДомаИДачиПовтИсп.ПолучитьМебельИИнтерьер() Тогда
		ОбязательныеПоля.Добавить("Condition");
		ОбязательныеПоля.Добавить("GoodsType");
	ИначеЕсли Category = ns_ДляДомаИДачиПовтИсп.ПолучитьПосудаИТоварыДляКухни() Тогда
		ОбязательныеПоля.Добавить("Condition");
		ОбязательныеПоля.Добавить("GoodsType");
	КонецЕсли; 
	
	Возврат ОбязательныеПоля;
КонецФункции

Функция СнятьБезОстатковСВыгрузки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ДляДомаИДачи.Ссылка КАК Ссылка,
	|	ns_ДляДомаИДачи.Номенклатура КАК Номенклатура,
	|	ns_ДляДомаИДачи.Характеристика КАК Характеристика
	|ИЗ
	|	Справочник.ns_ДляДомаИДачи КАК ns_ДляДомаИДачи
	|ГДЕ
	|	ns_ДляДомаИДачи.Выгружать = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Номенклатура = Выгрузка.ВыгрузитьКолонку("Номенклатура");
	Остатки = ns_Переопределяемый.ПолучитьТаблицуОстатков(Номенклатура);
	
	Для каждого Стр Из Выгрузка Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Стр.Характеристика.УникальныйИдентификатор());
		Иначе
			Идентификатор = Строка(Стр.Номенклатура.УникальныйИдентификатор());
		КонецЕсли; 
		
		Если Остатки[Идентификатор] = Неопределено Тогда
			СпрОбъект = Стр.Ссылка.ПолучитьОбъект();
			СпрОбъект.Выгружать = Ложь;
			СпрОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

Функция ПроверитьОшибкиПриВыгрузке(Данные, ТаблицаОшибок, Картинки = Неопределено) Экспорт
	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Данные.Category) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Category", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Данные.Title) Тогда
		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле Title", Данные, ТаблицаОшибок);
		ЕстьОшибка = Истина;
	КонецЕсли;

	//Если Картинки = Неопределено Тогда
	//	ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
	//	ЕстьОшибка = Истина;
	//Иначе
	//	КартинкиТовара = Картинки[Данные.Ссылка];
	//	Если КартинкиТовара = Неопределено Тогда
	//		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
	//		ЕстьОшибка = Истина; 
	//	ИначеЕсли КартинкиТовара.Количество() = 0 Тогда	
	//		ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не указана картинка товара", Данные, ТаблицаОшибок);
	//		ЕстьОшибка = Истина; 
	//	КонецЕсли;
	//КонецЕсли;	
	
	ДопПоля = ПолучитьДополнительныеОбязательныеПоля(Данные.Category, Данные.GoodsType);
	Для каждого ТекПоле Из ДопПоля Цикл
		Если НЕ ЗначениеЗаполнено(Данные[ТекПоле]) Тогда
			ns_АвитоОбработкаОшибок.ДобавитьОшибку("Не заполнено поле " + ТекПоле, Данные, ТаблицаОшибок);
			ЕстьОшибка = Истина;
		КонецЕсли;
	КонецЦикла;        
	
	Возврат ЕстьОшибка;
КонецФункции

Функция УстановитьВидимость_GoodsType(Category) Экспорт
	Если Category = ns_ДляДомаИДачиПовтИсп.ПолучитьРемонтИСтроительство() ИЛИ
	 Category = ns_ДляДомаИДачиПовтИсп.ПолучитьМебельИИнтерьер() ИЛИ
	 Category = ns_ДляДомаИДачиПовтИсп.ПолучитьБытоваяТехника() ИЛИ 
	 Category = ns_ДляДомаИДачиПовтИсп.ПолучитьПосудаИТоварыДляКухни() Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции

Функция УстановитьВидимость_GoodsSubType(Category, GoodsType) Экспорт
	Если Category = ns_ДляДомаИДачиПовтИсп.ПолучитьРемонтИСтроительство() И GoodsType = ns_ДляДомаИДачиПовтИсп.ПолучитьСтройматериалы() Тогда
		Возврат Истина;	
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции

Функция УстановитьВидимость_Availability(Category, GoodsType) Экспорт
	Если Category = ns_ДляДомаИДачиПовтИсп.ПолучитьМебельИИнтерьер() Тогда 
		Если GoodsType = ns_ДляДомаИДачиПовтИсп.ПолучитьКроватиДиваныИКресла() ИЛИ GoodsType = ns_ДляДомаИДачиПовтИсп.ПолучитьКухонныеГарнитуры() Тогда
			Возврат Истина;	
		КонецЕсли;
	КонецЕсли; 
	
	Возврат Ложь;
КонецФункции
