////////// ПрограммныйИнтерфейс

// Возвращаются реквизиты юридического лица по данным ЕГРЮЛ (наименование, адрес, коды и т.д.)
//
// Параметры:
//  ИНН  - Строка - ИНН юридического лица, реквизиты которого надо получить
//
// Возвращаемое значение:
//   Структура   - реквизиты юридического лица. 
//                 Содержание структуры - см. функцию НовыеРеквизитыЮридическогоЛица
//
Функция РеквизитыЮрЛицаПоИНН(Знач ИНН) Экспорт
	
	РеквизитыЮридическогоЛица = НовыеРеквизитыЮридическогоЛица();
	РеквизитыЮридическогоЛица.ИНН = ИНН;
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;
	Прокси         = ПроксиСервиса(ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
		Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), "getCorporationRequisitesByINN"));
		ВходныеПараметры.INN = ИНН;
		ВходныеПараметры.configurationName = "БухгалтерияПредприятия";
		Попытка
			Ответ      = Прокси.getCorporationRequisitesByINN(ВходныеПараметры);
			ОбъектXDTO = Ответ.РеквизитыЮрЛица;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = ПодставитьПараметрыВСтроку(
			НСтр("ru='ИНН %1:'"), ИНН)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, "getCorporationRequisitesByINN", РеквизитыЮридическогоЛица);
	
	Если ЗначениеЗаполнено(РеквизитыЮридическогоЛица.ОписаниеОшибки) Тогда
		Возврат РеквизитыЮридическогоЛица;
	КонецЕсли;
	
	ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	РеквизитыЮридическогоЛица.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	РеквизитыЮридическогоЛица.КПП = ОбъектXDTO.КПП;
	
	РеквизитыЮридическогоЛица.ДатаРегистрации = ОбъектXDTO.СвНаимЮЛ.ДатаОбрЮЛ;
	
	ЗаполнитьКодОКВЭД(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	ЗаполнитьРеквизитыФондаСоциальногоСтрахования(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	ЗаполнитьЮридическийАдрес(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	ЗаполнитьРуководителяИНомерТелефона(ОбъектXDTO, РеквизитыЮридическогоЛица);
	
	Возврат РеквизитыЮридическогоЛица;
	
КонецФункции

// Возвращаются реквизиты индивидуального предпринимателя по данным ЕГРИП (ФИО, свидетельство о регистрации, коды и т.д.)
//
// Параметры:
//  ИНН  - Строка - ИНН индивидуального предпринимателя, реквизиты которого надо получить
//
// Возвращаемое значение:
//   Структура   - реквизиты индивидуального предпринимателя. 
//                 Содержание структуры - см. функцию НовыеРеквизитыПредпринимателя
//
Функция РеквизитыПредпринимателяПоИНН(Знач ИНН) Экспорт
	
	РеквизитыПредпринимателя = НовыеРеквизитыПредпринимателя();
	РеквизитыПредпринимателя.ИНН = ИНН;
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;
	Прокси         = ПроксиСервиса(ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
		Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), "getEntrepreneurRequisitesByINN"));
		ВходныеПараметры.INN = ИНН;
		ВходныеПараметры.configurationName = "БухгалтерияПредприятия";
		Попытка
			Ответ      = Прокси.getEntrepreneurRequisitesByINN(ВходныеПараметры);
			ОбъектXDTO = Ответ.РеквизитыИП;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = ПодставитьПараметрыВСтроку(
			НСтр("ru='ИНН %1:'"), ИНН)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, "getEntrepreneurRequisitesByINN", РеквизитыПредпринимателя);
	
	Если ЗначениеЗаполнено(РеквизитыПредпринимателя.ОписаниеОшибки) Тогда
		Возврат РеквизитыПредпринимателя;
	КонецЕсли;
	
	РеквизитыПредпринимателя.Фамилия  = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Фамилия);
	РеквизитыПредпринимателя.Имя      = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Имя);
	РеквизитыПредпринимателя.Отчество = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Отчество);
	РеквизитыПредпринимателя.Пол      = ?(ОбъектXDTO.СвФЛ.Пол = "2", 
	Перечисления.ПолФизическихЛиц.Женский, 
	Перечисления.ПолФизическихЛиц.Мужской);
	
	ЗаполнитьКодОКВЭД(ОбъектXDTO, РеквизитыПредпринимателя);
	
	ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, РеквизитыПредпринимателя);
	
	ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, РеквизитыПредпринимателя);
	
	ЗаполнитьСвидетельствоОРегистрации(ОбъектXDTO, РеквизитыПредпринимателя);
	
	РеквизитыПредпринимателя.Наименование = РеквизитыПредпринимателя.Фамилия 
	+ " " + РеквизитыПредпринимателя.Имя
	+ " " + РеквизитыПредпринимателя.Отчество;
	РеквизитыПредпринимателя.НаименованиеПолное = ОбъектXDTO.НаимВидИП
	+ " " + РеквизитыПредпринимателя.Фамилия 
	+ " " + РеквизитыПредпринимателя.Имя
	+ " " + РеквизитыПредпринимателя.Отчество;
	РеквизитыПредпринимателя.НаименованиеСокращенное = ?(ОбъектXDTO.КодВидИП = "1", "ИП ", "") 
	+ РеквизитыПредпринимателя.Наименование;
	РеквизитыПредпринимателя.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	
	Если ОбъектXDTO.СвГражд <> Неопределено Тогда
		РеквизитыПредпринимателя.КодСтраныГражданства = ОбъектXDTO.СвГражд.ОКСМ;
	КонецЕсли;
	
	Если ОбъектXDTO.СвРегИП <> Неопределено Тогда
		РеквизитыПредпринимателя.ДатаРегистрации = ОбъектXDTO.СвРегИП.ДатаРег;
	КонецЕсли;
	
	Возврат РеквизитыПредпринимателя;
	
КонецФункции

// Возвращаются основные реквизиты юридических лиц по данным ЕГРЮЛ, подходящих по условиям поиска по наименованию
//
// Параметры:
//  Наименование - Строка - одно или несколько слов из наименования юридического лица для поиска в ЕГРЮЛ
//  КодРегиона - Строка, 2 - код региона в адресе юр.лица для поиска в ЕГРЮЛ
//  Адрес - Строка - одно или несколько слов из юридического адреса юридического лица (от региона до улицы) для поиска в ЕГРЮЛ
//
// Возвращаемое значение:
//   Структура   - реквизиты найденных юридических лиц. Содержание структуры: 
//                 * РеквизитыЮрЛиц - Массив - реквизиты найденных юр.лиц, элементы массива - Структура, описание см. функцию НовыеРеквизитыЮридическогоЛица
//                 заполняются только основные реквизиты (ИНН, наименование, юр.адрес, ФИО руководителя)
//                 если найдено больше 20 контрагентов - возвращаются реквизиты только первых 20
//                 * КоличествоНайденных - Число - общее количество найденных реквизитов (может быть больше 20)
//                 * ОписаниеОшибки - Строка - служебный реквизит
//
Функция РеквизитыЮрЛицПоНаименованию(Знач Наименование, Знач КодРегиона = "", Знач Адрес = "") Экспорт
	
	РеквизитыЮрЛиц = Новый Структура("РеквизитыЮрЛиц,КоличествоНайденных,ОписаниеОшибки",
	Новый Массив, 0, Неопределено);
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;
	Прокси         = ПроксиСервиса(ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
		Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), "getCorporationRequisitesByNameAndAddress"));
		ВходныеПараметры.name = Наименование;
		ВходныеПараметры.address = Адрес;
		ВходныеПараметры.regionCode = КодРегиона;
		ВходныеПараметры.configurationName = "БухгалтерияПредприятия";
		Попытка
			Ответ      = Прокси.getCorporationRequisitesByNameAndAddress(ВходныеПараметры);
			СписокXDTO = ?(Ответ.CorporationSearchResult = Неопределено, 
			Неопределено, 
			Ответ.CorporationSearchResult.РеквизитыЮрЛица);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = ПодставитьПараметрыВСтроку(
			НСтр("ru='Наименование -  %1:'"), Наименование)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(СписокXDTO, ОписаниеОшибки, "getCorporationRequisitesByNameAndAddress", РеквизитыЮрЛиц);
	
	Если ЗначениеЗаполнено(РеквизитыЮрЛиц.ОписаниеОшибки) Тогда
		Возврат РеквизитыЮрЛиц;
	КонецЕсли;
	
	Для каждого ОбъектXDTO Из СписокXDTO Цикл
		
		РеквизитыЮрЛица     = НовыеРеквизитыЮридическогоЛица();
		РеквизитыЮрЛица.ИНН = ОбъектXDTO.ИНН;
		
		ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, РеквизитыЮрЛица);
		
		ЗаполнитьЮридическийАдрес(ОбъектXDTO, РеквизитыЮрЛица);
		
		ЗаполнитьРуководителяИНомерТелефона(ОбъектXDTO, РеквизитыЮрЛица);
		
		РеквизитыЮрЛиц.РеквизитыЮрЛиц.Добавить(РеквизитыЮрЛица);
		
	КонецЦикла; 
	
	РеквизитыЮрЛиц.КоличествоНайденных = Ответ.CorporationSearchResult.corporationsFound;
	
	Возврат РеквизитыЮрЛиц;
	
КонецФункции

// Возвращается информация о связях юридического лица, его руководителей и учредителей с другими лицами по данным ЕГРЮЛ
//
// Параметры:
//  ИНН  - Строка - ИНН юридического лица, информацию о связях которого надо получить
//
// Возвращаемое значение:
//   Структура   - информация о связях юридического лица. 
//                 Содержание структуры - см. функцию НоваяИнформацияОСвязяхЮридическогоЛица
//
Функция ИнформацияОСвязяхЮридическогоЛицаПоИНН(Знач ИНН) Экспорт
	
	ИнформацияОСвязях = НоваяИнформацияОСвязяхЮридическогоЛица();
	ИнформацияОСвязях.ИНН = ИНН;
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;
	Прокси         = ПроксиСервиса(ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
		Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), "checkCorporationTrustability"));
		ВходныеПараметры.INN = ИНН;
		ВходныеПараметры.configurationName = "БухгалтерияПредприятия";
		Попытка
			Ответ      = Прокси.checkCorporationTrustability(ВходныеПараметры);
			ОбъектXDTO = Ответ.CorporationTrustability;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = ПодставитьПараметрыВСтроку(
			НСтр("ru='ИНН %1:'"), ИНН)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, "checkCorporationTrustability", ИнформацияОСвязях);
	
	Если ЗначениеЗаполнено(ИнформацияОСвязях.ОписаниеОшибки) Тогда
		Возврат ИнформацияОСвязях;
	КонецЕсли;
	
	ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, ИнформацияОСвязях);
	
	ИнформацияОСвязях.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	ИнформацияОСвязях.КПП = ОбъектXDTO.КПП;
	
	ИнформацияОСвязях.ДатаРегистрации = ОбъектXDTO.СвНаимЮЛ.ДатаОбрЮЛ;
	
	ЗаполнитьИнформациюОСтатусе(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьЮридическийАдрес(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРеквизитыФондаСоциальногоСтрахования(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОМассовостиАдреса(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОВидахДеятельности(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОЛицензиях(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОРуководителе(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОбУчрежденныхФирмах(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОбУчредителях(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОбУставномКапитале(ОбъектXDTO, ИнформацияОСвязях);
	
	//ЗаполнитьИнформациюОПодразделениях(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОбИзмененияхВРеестре(ОбъектXDTO, ИнформацияОСвязях);
	
	Возврат ИнформацияОСвязях;
	
КонецФункции

// Возвращается информация о связях индивидуального предпринимателя с другими лицами по данным ЕГРЮЛ и ЕГРИП
//
// Параметры:
//  ИНН  - Строка - ИНН индивидуального предпринимателя, информацию о связях которого надо получить
//
// Возвращаемое значение:
//   Структура   - информация о связях индивидуального предпринимателя. 
//                 Содержание структуры - см. функцию НоваяИнформацияОСвязяхПредпринимателя
//
Функция ИнформацияОСвязяхПредпринимателяПоИНН(Знач ИНН) Экспорт
	
	ИнформацияОСвязях = НоваяИнформацияОСвязяхПредпринимателя();
	ИнформацияОСвязях.ИНН = ИНН;
	
	ОписаниеОшибки = "";
	ОбъектXDTO     = Неопределено;
	Прокси         = ПроксиСервиса(ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		ВходныеПараметры = Прокси.ФабрикаXDTO.Создать(
		Прокси.ФабрикаXDTO.Тип(ПространствоИмен(), "checkPersonTrustabilityByInn"));
		ВходныеПараметры.INN = ИНН;
		ВходныеПараметры.configurationName = "БухгалтерияПредприятия";
		Попытка
			Ответ      = Прокси.checkPersonTrustabilityByInn(ВходныеПараметры);
			ОбъектXDTO = Ответ.PersonTrustability;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки     = ПодставитьПараметрыВСтроку(
			НСтр("ru='ИНН %1:'"), ИНН)
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;
	
	ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, "checkPersonTrustabilityByInn", ИнформацияОСвязях);
	
	Если ЗначениеЗаполнено(ИнформацияОСвязях.ОписаниеОшибки) Тогда
		Возврат ИнформацияОСвязях;
	КонецЕсли;
	
	ИнформацияОСвязях.Фамилия  = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Фамилия);
	ИнформацияОСвязях.Имя      = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Имя);
	ИнформацияОСвязях.Отчество = ТРег(ОбъектXDTO.СвФЛ.ФИОРус.Отчество);
	ИнформацияОСвязях.Пол      = ?(ОбъектXDTO.СвФЛ.Пол = "2", 
	Перечисления.ПолФизическогоЛица.Женский, 
	Перечисления.ПолФизическогоЛица.Мужской);
	
	ИнформацияОСвязях.Наименование = ИнформацияОСвязях.Фамилия 
	+ " " + ИнформацияОСвязях.Имя
	+ " " + ИнформацияОСвязях.Отчество;
	ИнформацияОСвязях.НаименованиеПолное      = "Индивидуальный предприниматель " + ИнформацияОСвязях.Наименование;
	ИнформацияОСвязях.НаименованиеСокращенное = ИнформацияОСвязях.Наименование + " ИП";
	ИнформацияОСвязях.РегистрационныйНомер = ОбъектXDTO.ОГРН;
	
	Если ОбъектXDTO.СвГражд <> Неопределено Тогда
		ИнформацияОСвязях.КодСтраныГражданства = ОбъектXDTO.СвГражд.ОКСМ;
	КонецЕсли;
	
	Если ОбъектXDTO.СвРегИП <> Неопределено Тогда
		ИнформацияОСвязях.ДатаРегистрации = ОбъектXDTO.СвРегИП.ДатаРег;
	КонецЕсли;
	
	ЗаполнитьИнформациюОСтатусе(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьРеквизитыФондаСоциальногоСтрахования(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОВидахДеятельности(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьИнформациюОЛицензиях(ОбъектXDTO, ИнформацияОСвязях);
	
	ЗаполнитьСвязанныеОрганизацииФизическогоЛица(
	ОбъектXDTO, 
	ИнформацияОСвязях, 
	ИнформацияОСвязях.ИНН, 
	ИнформацияОСвязях.ИНН);
	
	ЗаполнитьИнформациюОбИзмененияхВРеестре(ОбъектXDTO, ИнформацияОСвязях);
	
	Возврат ИнформацияОСвязях;
	
КонецФункции

////////// ОписанияРеквизитов

Функция НовыеРеквизитыЮридическогоЛица()
	
	РеквизитыЮрЛица = Новый Структура;
	
	// Заполняется на основе данных ЕГРЮЛ
	
	РеквизитыЮрЛица.Вставить("ИНН");                         // Строка, 10
	РеквизитыЮрЛица.Вставить("КПП");                         // Строка, 9
	РеквизитыЮрЛица.Вставить("Наименование");                // Строка, 0
	РеквизитыЮрЛица.Вставить("НаименованиеПолное");          // Строка, 0
	РеквизитыЮрЛица.Вставить("НаименованиеСокращенное");     // Строка, 0
	РеквизитыЮрЛица.Вставить("РегистрационныйНомер");        // Строка, 13 - ОГРН
	// Следующие свойства могут содержать Неопределено в случае отсутствия в сервисе данных
	РеквизитыЮрЛица.Вставить("ПравоваяФорма");               // Строка, 0
	РеквизитыЮрЛица.Вставить("ЮридическийАдрес");            // Структура из НоваяКонтактнаяИнформация()
	РеквизитыЮрЛица.Вставить("Телефон");                     // Структура из НоваяКонтактнаяИнформация()
	РеквизитыЮрЛица.Вставить("Руководитель");                // Структура из НовоеКонтактноеЛицо()
	РеквизитыЮрЛица.Вставить("РегистрацияВНалоговомОргане"); // Структура из НоваяРегистрацияВНалоговомОргане()
	РеквизитыЮрЛица.Вставить("ДатаРегистрации");             // Дата
	РеквизитыЮрЛица.Вставить("РегистрацияВПенсионномФонде"); // Структура из НоваяРегистрацияВПенсионномФонде()
	РеквизитыЮрЛица.Вставить("РегистрацияВФСС");             // Структура из НоваяРегистрацияВФСС()
	РеквизитыЮрЛица.Вставить("КодОКВЭД");                    // Строка, 8
	
	// Служебный реквизит
	РеквизитыЮрЛица.Вставить("ОписаниеОшибки");              // Строка, 0
	
	Возврат РеквизитыЮрЛица;
	
КонецФункции 

Функция НовыеРеквизитыПредпринимателя()
	
	РеквизитыПредпринимателя = Новый Структура;
	
	// Заполняется на основе данных ЕГРИП
	
	РеквизитыПредпринимателя.Вставить("ИНН");                         // Строка, 12
	РеквизитыПредпринимателя.Вставить("Наименование");                // Строка, 0
	РеквизитыПредпринимателя.Вставить("НаименованиеПолное");          // Строка, 0
	РеквизитыПредпринимателя.Вставить("НаименованиеСокращенное");     // Строка, 0
	РеквизитыПредпринимателя.Вставить("Фамилия");                     // Строка, 0
	РеквизитыПредпринимателя.Вставить("Имя");                         // Строка, 0
	РеквизитыПредпринимателя.Вставить("Отчество");                    // Строка, 0
	РеквизитыПредпринимателя.Вставить("РегистрационныйНомер");        // Строка, 13 - ОГРН
	// Следующие свойства могут содержать Неопределено в случае отсутствия в сервисе данных
	РеквизитыПредпринимателя.Вставить("Пол");                         // ПеречислениеСсылка.ПолФизическогоЛица
	РеквизитыПредпринимателя.Вставить("КодСтраныГражданства");        // Строка, 3
	РеквизитыПредпринимателя.Вставить("РегистрацияВНалоговомОргане"); // Структура из НоваяРегистрацияВНалоговомОргане()
	РеквизитыПредпринимателя.Вставить("РегистрацияВПенсионномФонде"); // Структура из НоваяРегистрацияВПенсионномФонде()
	РеквизитыПредпринимателя.Вставить("РегистрацияВФСС");             // Структура из НоваяРегистрацияВФСС()
	РеквизитыПредпринимателя.Вставить("ДатаРегистрации");             // Дата
	РеквизитыПредпринимателя.Вставить("КодОКВЭД");                    // Строка, 8
	РеквизитыПредпринимателя.Вставить("СвидетельствоОРегистрации");   // Структура из НовоеСвидетельствоОРегистрации()
	
	// Служебный реквизит
	РеквизитыПредпринимателя.Вставить("ОписаниеОшибки");       // Строка, 0
	
	Возврат РеквизитыПредпринимателя;
	
КонецФункции 

Функция НоваяИнформацияОСвязяхЮридическогоЛица()
	
	ИнформацияОСвязях = НовыеРеквизитыЮридическогоЛица();
	
	// Дополнительная информация о юридическом лице и его связях
	
	ИнформацияОСвязях.Вставить("НаименованиеСтатуса"); 	// Строка
	ИнформацияОСвязях.Вставить("КодСтатуса");			// Строка
	
	ИнформацияОСвязях.Вставить("УставныйКапитал");		// Число
	
	ИнформацияОСвязях.Вставить("ВидыДеятельности", НоваяТаблицаВидыДеятельности());
	
	ИнформацияОСвязях.Вставить("Лицензии", НоваяТаблицаЛицензии());
	
	// Все организации, которые зарегистрированы по тому же адресу, что и эта оргазация
	ИнформацияОСвязях.Вставить("ОрганизацииПоАдресу", НоваяТаблицаОрганизации());
	
	// Все организации, где этот руководитель является руководителем
	ИнформацияОСвязях.Вставить("ОрганизацииГдеРуководитель",      НоваяТаблицаОрганизации());
	ИнформацияОСвязях.Вставить("ОрганизацииГдеРуководительПоФИО", Ложь);
	
	// Все организации, где этот руководитель является учредителем
	ИнформацияОСвязях.Вставить("ОрганизацииГдеУчредитель",      НоваяТаблицаОрганизацииГдеУчредитель());
	ИнформацияОСвязях.Вставить("ОрганизацииГдеУчредительПоФИО", Ложь);
	
	// Все организации, где эта организация является учредителем
	ИнформацияОСвязях.Вставить("УчрежденныеФирмы", НоваяТаблицаОрганизацииГдеУчредитель());
	
	// Все учредители этой организации
	ИнформацияОСвязях.Вставить("Учредители", НоваяТаблицаУчредители());
	
	ИнформацияОСвязях.Вставить("Подразделения", НоваяТаблицаПодразделения());
	
	ИнформацияОСвязях.Вставить("ИзмененияВРеестре", НоваяТаблицаИзмененияВРеестре());
	
	Возврат ИнформацияОСвязях;
	
КонецФункции 

Функция НоваяИнформацияОСвязяхПредпринимателя()
	
	ИнформацияОСвязях = НовыеРеквизитыПредпринимателя();
	
	// Дополнительная информация о предпринимателе и его связях
	
	ИнформацияОСвязях.Вставить("НаименованиеСтатуса"); 	// Строка
	ИнформацияОСвязях.Вставить("КодСтатуса");			// Строка
	
	ИнформацияОСвязях.Вставить("ВидыДеятельности", НоваяТаблицаВидыДеятельности());
	
	ИнформацияОСвязях.Вставить("Лицензии", НоваяТаблицаЛицензии());
	
	// Все организации, где этот предприниматель является руководителем
	ИнформацияОСвязях.Вставить("ОрганизацииГдеРуководитель",      НоваяТаблицаОрганизации());
	ИнформацияОСвязях.Вставить("ОрганизацииГдеРуководительПоФИО", Ложь);
	
	// Все организации, где этот предприниматель является учредителем
	ИнформацияОСвязях.Вставить("ОрганизацииГдеУчредитель",      НоваяТаблицаОрганизацииГдеУчредитель());
	ИнформацияОСвязях.Вставить("ОрганизацииГдеУчредительПоФИО", Ложь);
	
	ИнформацияОСвязях.Вставить("ИзмененияВРеестре", НоваяТаблицаИзмененияВРеестре());
	
	Возврат ИнформацияОСвязях;
	
КонецФункции 

Функция НоваяКонтактнаяИнформация()
	
	Результат = Новый Структура;
	Результат.Вставить("КонтактнаяИнформация"); // Строка, 0 - XML 
	Результат.Вставить("Представление");        // Строка, 0
	Результат.Вставить("Комментарий");          // Строка, 0
	Возврат Результат;
	
КонецФункции

Функция НовоеКонтактноеЛицо()
	
	Результат = Новый Структура;
	Результат.Вставить("Должность");     // Строка, 0
	Результат.Вставить("Фамилия");       // Строка, 0
	Результат.Вставить("Имя");           // Строка, 0
	Результат.Вставить("Отчество");      // Строка, 0
	Результат.Вставить("Представление"); // Строка, 0
	Результат.Вставить("ИНН");           // Строка, 12
	Результат.Вставить("ДатаЗаписи");    // Дата
	Возврат Результат;
	
КонецФункции

Функция НоваяРегистрацияВНалоговомОргане()
	
	Результат = Новый Структура;
	Результат.Вставить("Код");             // Строка, 4
	Результат.Вставить("Наименование");    // Строка, 0
	Результат.Вставить("ОКТМО");           // Строка, 11
	Результат.Вставить("ОКАТО");           // Строка, 11
	Результат.Вставить("ДатаРегистрации"); // Дата
	Возврат Результат;
	
КонецФункции

Функция НоваяРегистрацияВПенсионномФонде()
	
	Результат = Новый Структура;
	Результат.Вставить("РегистрационныйНомерПФР"); // Строка, 14
	Результат.Вставить("КодОрганаПФР");            // Строка, 7
	Результат.Вставить("НаименованиеОрганаПФР");   // Строка, 0
	Результат.Вставить("ДатаРегистрации");         // Дата
	Возврат Результат;
	
КонецФункции

Функция НоваяРегистрацияВФСС()
	
	Результат = Новый Структура;
	Результат.Вставить("РегистрационныйНомерФСС"); // Строка, 15
	Результат.Вставить("КодПодчиненности");        // Строка, 5
	Результат.Вставить("КодОрганаФСС");            // Строка, 4
	Результат.Вставить("НаименованиеОрганаФСС");   // Строка, 0
	Результат.Вставить("ДатаРегистрации");         // Дата
	Возврат Результат;
	
КонецФункции

Функция НовоеСвидетельствоОРегистрации()
	
	Результат = Новый Структура;
	Результат.Вставить("Серия");  // Строка, 0
	Результат.Вставить("Номер");  // Строка, 0
	Результат.Вставить("Дата");   // Дата
	Возврат Результат;
	
КонецФункции

Функция НоваяТаблицаВидыДеятельности()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("КодОКВЭД", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаЛицензии()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Лицензия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеЛицензии", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаИзмененияВРеестре()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ДатаИзменения",        Новый ОписаниеТипов("Дата"));
	Результат.Колонки.Добавить("ГосударственныйОрган", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОписаниеИзменения",    Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаПодразделения()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ОписаниеПодразделения", Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаОрганизации()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИНН",                     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтатуса",              Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтатуса",     Новый ОписаниеТипов("Строка"));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаОрганизацииГдеУчредитель()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("КодСтатуса",              Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеСтатуса",     Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПроцентКапитала", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 6)));
	Результат.Колонки.Добавить("СуммаКапитала",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Возврат Результат;
	
КонецФункции 

Функция НоваяТаблицаУчредители()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Учредитель", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИНН", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПроцентКапитала", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 6)));
	Результат.Колонки.Добавить("СуммаКапитала",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	Результат.Колонки.Добавить("ОрганизацииГдеРуководитель");		// Таблица значений
	Результат.Колонки.Добавить("ОрганизацииГдеРуководительПоФИО", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ОрганизацииГдеУчредитель");			// Таблица значений
	Результат.Колонки.Добавить("ОрганизацииГдеУчредительПоФИО", Новый ОписаниеТипов("Булево"));
	Возврат Результат;
	
КонецФункции

////////// ЗаполнениеРеквизитов

Процедура ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, Реквизиты)
	
	ПравовыеФормы = Новый Массив;
	ПравовыеФормы.Добавить("Общество с ограниченной ответственностью");
	ПравовыеФормы.Добавить("Закрытое акционерное общество");
	ПравовыеФормы.Добавить("Открытое акционерное общество");
	ПравовыеФормы.Добавить("Публичное акционерное общество");
	ПравовыеФормы.Добавить("Акционерное общество");
	Если ОбъектXDTO.СвНаимЮЛ.ОПФ <> Неопределено Тогда
		ПравоваяФормаОбъекта = Строка(ОбъектXDTO.СвНаимЮЛ.ОПФ.ПолнНаимОПФ);
		Реквизиты.ПравоваяФорма = ПравоваяФормаОбъекта;
		Если ПравовыеФормы.Найти(ПравоваяФормаОбъекта) = Неопределено Тогда
			ПравовыеФормы.Добавить(ПравоваяФормаОбъекта);
		КонецЕсли;
	КонецЕсли;
	
	Реквизиты.НаименованиеПолное = ОбъектXDTO.СвНаимЮЛ.НаимЮЛПолн;
	Для каждого ПравоваяФорма Из ПравовыеФормы Цикл
		Если ВРег(ПравоваяФорма) = ВРег(Лев(Реквизиты.НаименованиеПолное, СтрДлина(ПравоваяФорма))) Тогда
			Реквизиты.НаименованиеПолное = ПравоваяФорма + Сред(Реквизиты.НаименованиеПолное, СтрДлина(ПравоваяФорма) + 1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Реквизиты.НаименованиеСокращенное = ОбъектXDTO.СвНаимЮЛ.НаимЮЛСокр;
	Если НЕ ЗначениеЗаполнено(Реквизиты.НаименованиеСокращенное) 
		ИЛИ НЕ ЗначениеЗаполнено(СтрЗаменить(Реквизиты.НаименованиеСокращенное, "-", "")) 
		ИЛИ ВРег(Реквизиты.НаименованиеСокращенное) = "НЕТ" Тогда
		Реквизиты.НаименованиеСокращенное = Реквизиты.НаименованиеПолное;
	КонецЕсли;
	
	Реквизиты.Наименование = Реквизиты.НаименованиеСокращенное;
	Поз = Найти(Реквизиты.Наименование, """");
	Если Поз > 0 И Поз <= 10 Тогда
		Реквизиты.Наименование = СокрП(Сред(Реквизиты.Наименование, Поз)) + " " + СокрП(Лев(Реквизиты.Наименование, Поз-1));
		Реквизиты.Наименование = СтрЗаменить(Реквизиты.Наименование, """", "");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектXDTOКонтактнойИнформации(Фабрика, Объект, ИсходныйОбъект)
	
	Для каждого СвойствоИсходногоОбъекта Из ИсходныйОбъект.Свойства() Цикл
		
		СвойствоОбъекта = Объект.Свойства().Получить(СвойствоИсходногоОбъекта.Имя);
		Если СвойствоОбъекта <> Неопределено Тогда
			
			ЗначениеСвойства = ИсходныйОбъект[СвойствоИсходногоОбъекта.Имя];
			Если ЗначениеСвойства = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
				
				Объект[СвойствоОбъекта.Имя] = Фабрика.Создать(СвойствоОбъекта.Тип);
				ЗаполнитьОбъектXDTOКонтактнойИнформации(Фабрика, Объект[СвойствоОбъекта.Имя], ИсходныйОбъект[СвойствоИсходногоОбъекта.Имя]);
				
			ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
				
				Для Каждого ИсходныйЭлемент Из ЗначениеСвойства Цикл
					
					Элемент = Фабрика.Создать(СвойствоОбъекта.Тип);
					ЗаполнитьОбъектXDTOКонтактнойИнформации(Фабрика, Элемент, ИсходныйЭлемент);
					Объект[СвойствоОбъекта.Имя].Добавить(Элемент);
					
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("Строка") Тогда
				
				МассивСлов      = РазложитьСтрокуВМассивСлов(ЗначениеСвойства, " ");
				МаксИндексСлова = ?(МассивСлов.Количество() = 1, 0, МассивСлов.Количество() - 2);
				Для ИндексСлова = 0 По МаксИндексСлова Цикл
					МассивСлов[ИндексСлова] = ТРег(МассивСлов[ИндексСлова]);
				КонецЦикла;
				Объект[СвойствоОбъекта.Имя] = СтрокаИзМассиваПодстрок(МассивСлов, " ");
				
			Иначе
				
				Объект[СвойствоОбъекта.Имя] = ЗначениеСвойства;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРегистрациюВНалоговомОргане(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвУчетНО <> Неопределено
		И ОбъектXDTO.СвУчетНО.СвНО <> Неопределено Тогда
		
		Реквизиты.РегистрацияВНалоговомОргане = НоваяРегистрацияВНалоговомОргане();
		
		Реквизиты.РегистрацияВНалоговомОргане.Код             = ОбъектXDTO.СвУчетНО.СвНО.КодНО;
		Реквизиты.РегистрацияВНалоговомОргане.Наименование    = ОбъектXDTO.СвУчетНО.СвНО.НаимНО;
		Реквизиты.РегистрацияВНалоговомОргане.ДатаРегистрации = ОбъектXDTO.СвУчетНО.ДатаПостУч;
		
		Если ОбъектXDTO.Свойства().Получить("СвАдрес") <> Неопределено // Адрес есть только у юр.лиц
			И ОбъектXDTO.СвАдрес <> Неопределено 
			И ОбъектXDTO.СвАдрес.Адрес <> Неопределено Тогда
			
			Адрес = ОбъектXDTO.СвАдрес.Адрес;
			Реквизиты.РегистрацияВНалоговомОргане.ОКТМО = Адрес.Состав.ОКТМО;
			Реквизиты.РегистрацияВНалоговомОргане.ОКАТО = Адрес.Состав.ОКАТО;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКодОКВЭД(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвОКВЭД <> Неопределено Тогда
		
		СписокОКВЭД = ОбъектXDTO.СвОКВЭД;
		КодОКВЭД  = "";
		ДатаОКВЭД = '00010101';
		Для Каждого ЭлементОКВЭД Из СписокОКВЭД Цикл
			Если ЭлементОКВЭД.ДатаНачДейств > ДатаОКВЭД
				И ЭлементОКВЭД.ПрОснДоп = "1" Тогда
				ДатаОКВЭД = ЭлементОКВЭД.ДатаНачДейств;
				КодОКВЭД  = ЭлементОКВЭД.КодОКВЭД;
			КонецЕсли;
		КонецЦикла;
		Реквизиты.КодОКВЭД = КодОКВЭД;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОВидахДеятельности(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвОКВЭД <> Неопределено Тогда
		
		// Сначала добавляем строку с основным кодом
		Для Каждого ЭлементОКВЭД Из ОбъектXDTO.СвОКВЭД Цикл
			Если ЭлементОКВЭД.ПрОснДоп = "1" Тогда
				НоваяСтрока = ИнформацияОСвязях.ВидыДеятельности.Добавить();
				НоваяСтрока.КодОКВЭД = ЭлементОКВЭД.КодОКВЭД;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		// Затем добавляем строки с неосновными кодами
		Для Каждого ЭлементОКВЭД Из ОбъектXDTO.СвОКВЭД Цикл
			Если ЭлементОКВЭД.ПрОснДоп = "1" Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ИнформацияОСвязях.ВидыДеятельности.Добавить();
			НоваяСтрока.КодОКВЭД = ЭлементОКВЭД.КодОКВЭД;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОЛицензиях(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвЛицензия <> Неопределено Тогда
		
		Для каждого СтрокаЛицензии Из ОбъектXDTO.СвЛицензия Цикл
			НоваяСтрока = ИнформацияОСвязях.Лицензии.Добавить();
			НоваяСтрока.Лицензия = ПодставитьПараметрыВСтроку(
			НСтр("ru='%1 от %2'"),
			СтрокаЛицензии.НомЛиц,
			Формат(СтрокаЛицензии.ДатаЛиц, "ДЛФ=D"));
			Если СтрокаЛицензии.НаимЛицВидДеят <> Неопределено Тогда
				ОписаниеЛицензии = "";
				Для каждого СтрокаОписания Из СтрокаЛицензии.НаимЛицВидДеят Цикл
					ОписаниеЛицензии = ОписаниеЛицензии + ?(ПустаяСтрока(ОписаниеЛицензии), "", ", ") + СтрокаОписания;
				КонецЦикла;
				НоваяСтрока.ОписаниеЛицензии = ОписаниеЛицензии;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбИзмененияхВРеестре(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвЗапДейств <> Неопределено Тогда
		
		Для каждого СтрокаИзменения Из ОбъектXDTO.СвЗапДейств Цикл
			НоваяСтрока = ИнформацияОСвязях.ИзмененияВРеестре.Добавить();
			НоваяСтрока.ДатаИзменения = СтрокаИзменения.ДатаЗап;
			Если СтрокаИзменения.СвРегОрг <> Неопределено Тогда
				НоваяСтрока.ГосударственныйОрган = СтрокаИзменения.СвРегОрг.НаимНО;
			КонецЕсли;
			ОписаниеИзменения = "";
			Если СтрокаИзменения.ВидЗап <> Неопределено Тогда
				ОписаниеИзменения = ОписаниеИзменения + СтрокаИзменения.ВидЗап.НаимВидЗап;
			КонецЕсли;
			Если СтрокаИзменения.СвСвид <> Неопределено Тогда
				Для каждого СтрокаСвидетельства Из СтрокаИзменения.СвСвид Цикл
					ОписаниеИзменения = ОписаниеИзменения + ?(ПустаяСтрока(ОписаниеИзменения), "", Символы.ПС)
					+ ПодставитьПараметрыВСтроку(
					НСтр("ru='Выдано свидетельство %1 %2'"), 
					СтрокаСвидетельства.Серия,
					СтрокаСвидетельства.Номер);
				КонецЦикла;
			КонецЕсли;
			НоваяСтрока.ОписаниеИзменения = ОписаниеИзменения;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОРуководителе(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвУправлДеятСвязЮЛ <> Неопределено
		И ОбъектXDTO.СвУправлДеятСвязЮЛ.СведДолжнФЛСвязЮЛ <> Неопределено Тогда
		
		Для каждого СтрокаРуководителя Из ОбъектXDTO.СвУправлДеятСвязЮЛ.СведДолжнФЛСвязЮЛ Цикл
			
			Если ПолучитьДанныеОРуководителеИНомерТелефона(СтрокаРуководителя.СведДолжнФЛ, ИнформацияОСвязях) Тогда
				ЗаполнитьСвязанныеОрганизацииФизическогоЛица(
				СтрокаРуководителя, 
				ИнформацияОСвязях, 
				ИнформацияОСвязях.ИНН, 
				ИнформацияОСвязях.Руководитель.ИНН);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбУчрежденныхФирмах(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвязЮЛПоУчредителю <> Неопределено
		И ОбъектXDTO.СвязЮЛПоУчредителю.СвязЮЛ <> Неопределено Тогда
		
		Для каждого ОбъектXDTOСвязЮЛ Из ОбъектXDTO.СвязЮЛПоУчредителю.СвязЮЛ Цикл
			ЗаполнитьСтрокуОбУчредителе(ОбъектXDTOСвязЮЛ, ИнформацияОСвязях.УчрежденныеФирмы, ИнформацияОСвязях.ИНН);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбУчредителях(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвУчредитСвязЮЛ <> Неопределено Тогда
		
		// Учредители - российские юридические лица
		
		Если ОбъектXDTO.СвУчредитСвязЮЛ.УчрЮЛРосСвязЮЛ <> Неопределено Тогда
			
			Для каждого ДанныеУчредителя Из ОбъектXDTO.СвУчредитСвязЮЛ.УчрЮЛРосСвязЮЛ Цикл
				
				СтрокаУчредителя = ИнформацияОСвязях.Учредители.Добавить();
				СтрокаУчредителя.ОрганизацииГдеРуководитель = НоваяТаблицаОрганизации();
				СтрокаУчредителя.ОрганизацииГдеУчредитель   = НоваяТаблицаОрганизацииГдеУчредитель();
				
				СтрокаУчредителя.Учредитель = ДанныеУчредителя.УчрЮЛРос.НаимЮЛПолн;
				СтрокаУчредителя.ИНН = ?(СтрДлина(ДанныеУчредителя.УчрЮЛРос.ИННЮЛ) = 10, ДанныеУчредителя.УчрЮЛРос.ИННЮЛ, "");
				
				Если ДанныеУчредителя.УчрЮЛРос.ДоляУстКап <> Неопределено Тогда
					СтрокаУчредителя.СуммаКапитала   = ДанныеУчредителя.УчрЮЛРос.ДоляУстКап.НоминСтоим;
					СтрокаУчредителя.ПроцентКапитала = ДанныеУчредителя.УчрЮЛРос.ДоляУстКап.Процент;
				КонецЕсли;
				
				// Еще организации, где этот учредитель является учредителем
				
				Если ДанныеУчредителя.связЮЛПоУчредителю <> Неопределено
					И ДанныеУчредителя.связЮЛПоУчредителю.связЮЛ <> Неопределено Тогда
					
					Для каждого ОбъектXDTOСвязЮЛ Из ДанныеУчредителя.связЮЛПоУчредителю.связЮЛ Цикл
						ЗаполнитьСтрокуОбУчредителе(ОбъектXDTOСвязЮЛ, СтрокаУчредителя.ОрганизацииГдеУчредитель, ИнформацияОСвязях.ИНН);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Учредители - иностранные юридические лица
		
		Если ОбъектXDTO.СвУчредитСвязЮЛ.УчрЮЛИнСвязЮЛ <> Неопределено Тогда
			
			Для каждого ДанныеУчредителя Из ОбъектXDTO.СвУчредитСвязЮЛ.УчрЮЛИнСвязЮЛ Цикл
				
				СтрокаУчредителя = ИнформацияОСвязях.Учредители.Добавить();
				СтрокаУчредителя.ОрганизацииГдеРуководитель = НоваяТаблицаОрганизации();
				СтрокаУчредителя.ОрганизацииГдеУчредитель   = НоваяТаблицаОрганизацииГдеУчредитель();
				
				Учредитель = ДанныеУчредителя.УчрЮЛИн.НаимЮЛПолн;
				Если ДанныеУчредителя.УчрЮЛИн.СвРегИн <> Неопределено Тогда
					Учредитель = Учредитель + " (" + ДанныеУчредителя.УчрЮЛИн.СвРегИн.НаимСтран + ")";
				КонецЕсли;
				СтрокаУчредителя.Учредитель = Учредитель;
				
				Если ДанныеУчредителя.УчрЮЛИн.ДоляУстКап <> Неопределено Тогда
					СтрокаУчредителя.СуммаКапитала   = ДанныеУчредителя.УчрЮЛИн.ДоляУстКап.НоминСтоим;
					СтрокаУчредителя.ПроцентКапитала = ДанныеУчредителя.УчрЮЛИн.ДоляУстКап.Процент;
				КонецЕсли;
				
				// Еще организации, где этот учредитель является учредителем
				
				Если ДанныеУчредителя.связЮЛПоУчредителю <> Неопределено
					И ДанныеУчредителя.связЮЛПоУчредителю.связЮЛ <> Неопределено Тогда
					
					Для каждого ОбъектXDTOСвязЮЛ Из ДанныеУчредителя.связЮЛПоУчредителю.связЮЛ Цикл
						ЗаполнитьСтрокуОбУчредителе(ОбъектXDTOСвязЮЛ, СтрокаУчредителя.ОрганизацииГдеУчредитель, ИнформацияОСвязях.ИНН);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Учредители - физические лица
		
		Если ОбъектXDTO.СвУчредитСвязЮЛ.УчрФЛСвязЮЛ <> Неопределено Тогда
			
			Для каждого ДанныеУчредителя Из ОбъектXDTO.СвУчредитСвязЮЛ.УчрФЛСвязЮЛ Цикл
				
				СтрокаУчредителя = ИнформацияОСвязях.Учредители.Добавить();
				СтрокаУчредителя.ОрганизацииГдеРуководитель = НоваяТаблицаОрганизации();
				СтрокаУчредителя.ОрганизацииГдеУчредитель   = НоваяТаблицаОрганизацииГдеУчредитель();
				
				Учредитель = НовоеКонтактноеЛицо();
				Если ДанныеУчредителя.УчрФЛ.ФИО <> Неопределено Тогда
					Учредитель.Фамилия  = ТРег(ДанныеУчредителя.УчрФЛ.ФИО.Фамилия);
					Учредитель.Имя      = ТРег(ДанныеУчредителя.УчрФЛ.ФИО.Имя);
					Учредитель.Отчество = ТРег(ДанныеУчредителя.УчрФЛ.ФИО.Отчество);
					Учредитель.ИНН      = ДанныеУчредителя.УчрФЛ.ИННФЛ;
					Учредитель.Представление = СокрЛП(Учредитель.Фамилия
					+ " " + Учредитель.Имя
					+ " " + Учредитель.Отчество);
				КонецЕсли;
				
				СтрокаУчредителя.Учредитель = Учредитель.Представление;
				СтрокаУчредителя.ИНН = ?(СтрДлина(Учредитель.ИНН) = 12, Учредитель.ИНН, "");
				
				Если ДанныеУчредителя.УчрФЛ.ДоляУстКап <> Неопределено Тогда
					СтрокаУчредителя.СуммаКапитала   = ДанныеУчредителя.УчрФЛ.ДоляУстКап.НоминСтоим;
					СтрокаУчредителя.ПроцентКапитала = ДанныеУчредителя.УчрФЛ.ДоляУстКап.Процент;
				КонецЕсли;
				
				ЗаполнитьСвязанныеОрганизацииФизическогоЛица(
				ДанныеУчредителя, 
				СтрокаУчредителя, 
				ИнформацияОСвязях.ИНН, 
				СтрокаУчредителя.ИНН);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСвязанныеОрганизацииФизическогоЛица(ДанныеФизЛица, Результат, ИННКонтрагента, ИННФизЛица)
	
	Если ДанныеФизЛица.СвязЮЛПоПарам <> Неопределено Тогда
		
		// Организации, где это физическое лицо является руководителем
		
		Если ЗначениеЗаполнено(ИННФизЛица)
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоИНН <> Неопределено 
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоИНН.corporationsFound > 0
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоИНН.связЮЛ <> Неопределено Тогда
			
			Для каждого ОбъектXDTOСвязЮЛ Из ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоИНН.связЮЛ Цикл
				ЗаполнитьСтрокуОбОрганизации(ОбъектXDTOСвязЮЛ, Результат.ОрганизацииГдеРуководитель, ИННКонтрагента);
			КонецЦикла;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ИННФизЛица)
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоФИО <> Неопределено 
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоФИО.corporationsFound > 0
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоФИО.связЮЛ <> Неопределено Тогда
			
			Для каждого ОбъектXDTOСвязЮЛ Из ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоДиректоруПоФИО.связЮЛ Цикл
				ЗаполнитьСтрокуОбОрганизации(ОбъектXDTOСвязЮЛ, Результат.ОрганизацииГдеРуководитель, ИННКонтрагента);
			КонецЦикла;
			Результат.ОрганизацииГдеРуководительПоФИО = Истина;
			
		КонецЕсли;
		
		// Организации, где это физическое лицо является учредителем
		
		Если ЗначениеЗаполнено(ИННФизЛица)
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоИНН <> Неопределено 
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоИНН.corporationsFound > 0
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоИНН.связЮЛ <> Неопределено Тогда
			
			Для каждого ОбъектXDTOСвязЮЛ Из ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоИНН.связЮЛ Цикл
				ЗаполнитьСтрокуОбУчредителе(ОбъектXDTOСвязЮЛ, Результат.ОрганизацииГдеУчредитель, ИННКонтрагента);
			КонецЦикла;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ИННФизЛица)
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоФИО <> Неопределено 
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоФИО.corporationsFound > 0
			И ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоФИО.связЮЛ <> Неопределено Тогда
			
			Для каждого ОбъектXDTOСвязЮЛ Из ДанныеФизЛица.СвязЮЛПоПарам.связЮЛПоУчредителюПоФИО.связЮЛ Цикл
				ЗаполнитьСтрокуОбУчредителе(ОбъектXDTOСвязЮЛ, Результат.ОрганизацииГдеУчредитель, ИННКонтрагента);
			КонецЦикла;
			Результат.ОрганизацииГдеУчредительПоФИО = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОбУставномКапитале(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвУстКап <> Неопределено Тогда
		
		ИнформацияОСвязях.УставныйКапитал = ОбъектXDTO.СвУстКап.СумКап;
		
	ИначеЕсли ИнформацияОСвязях.Учредители.Количество() > 0 Тогда
		
		ИнформацияОСвязях.УставныйКапитал = ИнформацияОСвязях.Учредители.Итог("СуммаКапитала");
		
	Иначе
		
		ИнформацияОСвязях.УставныйКапитал = 0;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОСтатусе(ОбъектXDTO, Данные)
	
	Если ОбъектXDTO.СвСтатус_РО <> Неопределено 
		И ОбъектXDTO.СвСтатус_РО.СвСтатус <> Неопределено Тогда
		
		Данные.НаименованиеСтатуса = ОбъектXDTO.СвСтатус_РО.СвСтатус.НаимСтатус;
		Данные.КодСтатуса          = ОбъектXDTO.СвСтатус_РО.СвСтатус.КодСтатус;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьИнформациюОМассовостиАдреса(ОбъектXDTO, ИнформацияОСвязях)
	
	Если ОбъектXDTO.СвязЮЛПоАдресу <> Неопределено
		И ОбъектXDTO.СвязЮЛПоАдресу.СвязЮЛ <> Неопределено Тогда
		
		Для каждого ОбъектXDTOСвязЮЛ Из ОбъектXDTO.СвязЮЛПоАдресу.СвязЮЛ Цикл
			ЗаполнитьСтрокуОбОрганизации(ОбъектXDTOСвязЮЛ, ИнформацияОСвязях.ОрганизацииПоАдресу, ИнформацияОСвязях.ИНН);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыПенсионногоФонда(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвРегПФ <> Неопределено Тогда
		
		РегистрацияВПФР = НоваяРегистрацияВПенсионномФонде();
		
		РегистрационныйНомерПФР = ОбъектXDTO.СвРегПФ.РегНомПФ;
		РегистрационныйНомерПФР = ПодставитьПараметрыВСтроку(НСтр("ru='%1-%2-%3'"), 
		Лев(РегистрационныйНомерПФР, 3), Сред(РегистрационныйНомерПФР,4, 3), Прав(РегистрационныйНомерПФР, 6));
		РегистрацияВПФР.РегистрационныйНомерПФР = РегистрационныйНомерПФР;
		Если ОбъектXDTO.СвРегПФ.СвОргПФ <> Неопределено Тогда
			КодОрганаПФР = ОбъектXDTO.СвРегПФ.СвОргПФ.КодПФ;
			КодОрганаПФР = ПодставитьПараметрыВСтроку(НСтр("ru='%1-%2'"), 
			Лев(КодОрганаПФР, 3), Прав(КодОрганаПФР, 3));
			РегистрацияВПФР.КодОрганаПФР          = КодОрганаПФР;
			РегистрацияВПФР.НаименованиеОрганаПФР = ОбъектXDTO.СвРегПФ.СвОргПФ.НаимПФ;
		КонецЕсли;
		РегистрацияВПФР.ДатаРегистрации = ОбъектXDTO.СвРегПФ.ДатаРег;
		
		Реквизиты.РегистрацияВПенсионномФонде = РегистрацияВПФР;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыФондаСоциальногоСтрахования(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвРегФСС <> Неопределено Тогда
		
		РегистрацияВФСС = НоваяРегистрацияВФСС();
		
		Если СтрДлина(ОбъектXDTO.СвРегФСС.РегНомФСС) <= 10 Тогда
			РегистрацияВФСС.РегистрационныйНомерФСС = СокрЛП(ОбъектXDTO.СвРегФСС.РегНомФСС);
			РегистрацияВФСС.КодПодчиненности        = "";
		Иначе
			РегистрацияВФСС.РегистрационныйНомерФСС = СокрЛП(Лев(ОбъектXDTO.СвРегФСС.РегНомФСС, 10));
			РегистрацияВФСС.КодПодчиненности        = СокрЛП(Сред(ОбъектXDTO.СвРегФСС.РегНомФСС, 11));
			Если СтрДлина(РегистрацияВФСС.КодПодчиненности) <> 5 Тогда
				РегистрацияВФСС.КодПодчиненности = "";
			КонецЕсли;
		КонецЕсли;
		
		Если ОбъектXDTO.СвРегФСС.СвОргФСС <> Неопределено Тогда
			РегистрацияВФСС.КодОрганаФСС            = ОбъектXDTO.СвРегФСС.СвОргФСС.КодФСС;
			РегистрацияВФСС.НаименованиеОрганаФСС   = ОбъектXDTO.СвРегФСС.СвОргФСС.НаимФСС;
		КонецЕсли;
		РегистрацияВФСС.ДатаРегистрации = ОбъектXDTO.СвРегФСС.ДатаРег;
		
		Реквизиты.РегистрацияВФСС = РегистрацияВФСС;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСвидетельствоОРегистрации(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвЗапДейств <> Неопределено Тогда
		
		Свидетельство = НовоеСвидетельствоОРегистрации();
		Свидетельство.Дата = '00010101';
		Для Каждого Запись Из ОбъектXDTO.СвЗапДейств Цикл
			Для Каждого ЗаписьСвидетельства Из Запись.СвСвид Цикл
				Если ЗначениеЗаполнено(ЗаписьСвидетельства.ДатаЗап) Тогда
					ДатаЗап = ЗаписьСвидетельства.ДатаЗап;
				ИначеЕсли ЗначениеЗаполнено(Запись.ДатаЗап) Тогда
					ДатаЗап = Запись.ДатаЗап;
				Иначе
					ДатаЗап = '00010101';
				КонецЕсли;
				Если ДатаЗап > Свидетельство.Дата Тогда
					Свидетельство.Дата  = ДатаЗап;
					Свидетельство.Серия = ЗаписьСвидетельства.Серия;
					Свидетельство.Номер = Прав("000000000" + ЗаписьСвидетельства.Номер, 9);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если Свидетельство.Дата > '00010101' Тогда
			Реквизиты.СвидетельствоОРегистрации = Свидетельство;
		КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЮридическийАдрес(ОбъектXDTO, Реквизиты)
	
	ПространствоИменКИ = ПространствоИменКИ();
	
	Если ОбъектXDTO.СвАдрес <> Неопределено  Тогда 
		
		Реквизиты.ЮридическийАдрес = КонтакнаяИнформацияИзXDTO(ОбъектXDTO.СвАдрес);
		
	КонецЕсли;
	
КонецПроцедуры

Функция КонтакнаяИнформацияИзXDTO(СвАдрес)
	
	СтруктураАдреса = Новый Структура("Поле1,Поле2,Поле3,Поле4,Поле5,Поле6,Поле7,Поле8,Поле9,Поле10,Поле11,Поле12,Представление,КраткоеПредставление,ГородскойРайон,СтанцияМетро,ТипДома,ТипКорпуса,ТипКвартиры");
	СтруктураАдреса.КраткоеПредставление = Ложь;
	СтруктураАдреса.ГородскойРайон = Справочники.Районы.ПустаяСсылка();
	СтруктураАдреса.СтанцияМетро = Справочники.СтанцииМетро.ПустаяСсылка();
	
	СтруктураАдреса.Поле2 = ПредложениеСЗаглавнойБуквы(СвАдрес.Адрес.Состав.СубъектРФ);//Регион	
	СтруктураАдреса.Поле4 = ПредложениеСЗаглавнойБуквы(СвАдрес.Адрес.Состав.Город);//Город
	СтруктураАдреса.Поле5 = ПредложениеСЗаглавнойБуквы(СвАдрес.Адрес.Состав.НаселПункт); // Населенный пункт
	СтруктураАдреса.Поле6 = ПредложениеСЗаглавнойБуквы(СвАдрес.Адрес.Состав.Улица); // улица/переулок
	
	Для Каждого ДопАдр Из СвАдрес.Адрес.Состав.ДопАдрЭл Цикл
		Если ДопАдр.ТипАдрЭл = "10100000" Тогда // Индекс
			СтруктураАдреса.Поле1 = ДопАдр.Значение;
		Иначе
			Если ТипЗнч(ДопАдр.Номер) = Тип("ОбъектXDTO") Тогда
				Если ДопАдр.Номер.Тип = "1010" Тогда // Дом
					СтруктураАдреса.Поле7 = ДопАдр.Номер.Значение;
				ИначеЕсли ДопАдр.Номер.Тип = "1050" Тогда // Корпус
					СтруктураАдреса.Поле8 = ДопАдр.Номер.Значение;	
				ИначеЕсли ДопАдр.Номер.Тип = "2010" Тогда // Квартира
					СтруктураАдреса.Поле9 = ДопАдр.Номер.Значение;
				КонецЕсли;	   
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураАдреса.Вставить("ТипДома", Перечисления.ТипыДомов.Дом);
	СтруктураАдреса.Вставить("ТипКвартиры", Перечисления.ТипыКвартир.Квартира);
	СтруктураАдреса.Вставить("ТипКорпуса", Перечисления.ТипыКорпусов.Корпус);
	СтруктураАдреса.Представление = киПолучитьПредставлениеАдреса(СтруктураАдреса);
	
	Возврат СтруктураАдреса;	
	
КонецФункции

Функция ПредложениеСЗаглавнойБуквы(Строка)
	
	Если ЗначениеЗаполнено(Строка) Тогда
		Возврат ВРег(Лев(Строка, 1)) + НРег(Сред(Строка, 2))
	Иначе
		Возврат Строка;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьРуководителяИНомерТелефона(ОбъектXDTO, Реквизиты)
	
	Если ОбъектXDTO.СвУправлДеят <> Неопределено
		И ОбъектXDTO.СвУправлДеят.СведДолжнФЛ <> Неопределено Тогда
		
		Для каждого СведенияОДолжности Из ОбъектXDTO.СвУправлДеят.СведДолжнФЛ Цикл
			Если ПолучитьДанныеОРуководителеИНомерТелефона(СведенияОДолжности, Реквизиты) Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеОРуководителеИНомерТелефона(СведенияОДолжности, Данные)
	
	//Если Найти(СведенияОДолжности.НаимВидДолжн, "Руководитель") = 0 
	//	ИЛИ СведенияОДолжности.ФИО = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//
	//// Руководитель
	//СтруктураКИ = НовоеКонтактноеЛицо();
	//СтруктураКИ.Фамилия    = ТРег(СведенияОДолжности.ФИО.Фамилия);
	//СтруктураКИ.Имя        = ТРег(СведенияОДолжности.ФИО.Имя);
	//СтруктураКИ.Отчество   = ТРег(СведенияОДолжности.ФИО.Отчество);
	//СтруктураКИ.Должность  = ПредложениеСЗаглавнойБуквы(СведенияОДолжности.НаимДолжн);
	//СтруктураКИ.ИНН        = СведенияОДолжности.ИННФл;
	//СтруктураКИ.ДатаЗаписи = СведенияОДолжности.ДатаНачДейств;
	//СтруктураКИ.Представление = СокрЛП(СтруктураКИ.Фамилия
	//	+ " " + СтруктураКИ.Имя
	//	+ " " + СтруктураКИ.Отчество);
	//
	//Данные.Руководитель = СтруктураКИ;
	//
	//// Номер телефона
	//Если ЗначениеЗаполнено(СведенияОДолжности.НомТел) Тогда
	//	ПространствоИменКИ = УправлениеКонтактнойИнформациейКлиентСерверПовтИсп.ПространствоИмен();
	//	КИ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменКИ, "КонтактнаяИнформация"));
	//	КИ.Состав = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(ПространствоИменКИ, "НомерТелефона"));
	//	Если Лев(СведенияОДолжности.НомТел, 1) = "(" Тогда
	//		КонецКодаГорода     = Найти(СведенияОДолжности.НомТел, ")");
	//		КИ.Состав.КодГорода = Сред(СведенияОДолжности.НомТел, 2, КонецКодаГорода - 2);
	//		КИ.Состав.Номер     = Сред(СведенияОДолжности.НомТел, КонецКодаГорода + 1);
	//	Иначе
	//		КИ.Состав.Номер     = СведенияОДолжности.НомТел;
	//	КонецЕсли;
	//	КИ.Представление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(
	//		КИ, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	//	СтруктураКИ = НоваяКонтактнаяИнформация();
	//	СтруктураКИ.КонтактнаяИнформация = СериализацияОбъектаXDTO(КИ);
	//	СтруктураКИ.Представление = КИ.Представление;
	//	
	//	Данные.Телефон = СтруктураКИ;
	//	
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЗаполнитьСтрокуОбОрганизации(ОбъектXDTO, ТаблицаДанных, ИННКонтрагента)
	
	Если ЗначениеЗаполнено(ОбъектXDTO.ИНН)
		И (ОбъектXDTO.ИНН = ИННКонтрагента
		ИЛИ ТаблицаДанных.Найти(ОбъектXDTO.ИНН, "ИНН") <> Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыЮЛ = НовыеРеквизитыЮридическогоЛица();
	ЗаполнитьНаименованияЮрЛица(ОбъектXDTO, РеквизитыЮЛ);
	НоваяСтрока = ТаблицаДанных.Добавить();
	НоваяСтрока.НаименованиеОрганизации = РеквизитыЮЛ.НаименованиеСокращенное;
	НоваяСтрока.ИНН = ?(СтрДлина(ОбъектXDTO.ИНН) = 10, ОбъектXDTO.ИНН, "");
	ЗаполнитьИнформациюОСтатусе(ОбъектXDTO, НоваяСтрока);
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ЗаполнитьСтрокуОбУчредителе(ОбъектXDTO, ТаблицаДанных, ИННКонтрагента)
	
	НоваяСтрока = ЗаполнитьСтрокуОбОрганизации(ОбъектXDTO, ТаблицаДанных, ИННКонтрагента);
	
	Если НоваяСтрока <> Неопределено
		И ОбъектXDTO.ДоляУстКап <> Неопределено Тогда
		НоваяСтрока.СуммаКапитала   = ОбъектXDTO.ДоляУстКап.НоминСтоим;
		НоваяСтрока.ПроцентКапитала = ОбъектXDTO.ДоляУстКап.Процент;
	КонецЕсли;
	
КонецПроцедуры


////////// СлужебныеПроцедурыИФункции


Функция ПроксиСервиса(ОписаниеОшибки)
	
	Прокси = Неопределено;
	ПараметрыАутентификации = ПараметрыАутентификацииВСервисе();
	
	Если ПараметрыАутентификации = Неопределено Тогда
		
		// Служебный текст. Должен быть обработан на клиенте.
		ОписаниеОшибки = "НеУказаныПараметрыАутентификации"; 
		
	Иначе
		
		Попытка
			Прокси = WSПрокси(
			АдресСервиса(),                             // АдресWSDL
			ПространствоИмен(),                         // URIПространстваИмен
			//"RequisitesWebServiceEndpointImpl3Service", // ИмяСервиса
			//"RequisitesWebServiceEndpointImpl3Port",    // ИмяТочкиПодключения
			"RequisitesWebServiceEndpointImpl7Service", // ИмяСервиса
			"RequisitesWebServiceEndpointImpl7Port",    // ИмяТочкиПодключения
			ПараметрыАутентификации.login,              // ИмяПользователя
			ПараметрыАутентификации.password,           // Пароль
			60);                                        //Таймаут
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки; 
		
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Функция ПараметрыАутентификацииВСервисе()
	
	ДанныеАутентификации = ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации <> Неопределено Тогда
		Возврат Новый Структура("login,password", 
		ДанныеАутентификации.Логин, 
		ДанныеАутентификации.Пароль);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция АдресСервиса()
	
//	Возврат "https://api.orgregister.1c.ru/orgregister/v3?wsdl";
	Возврат "https://api.orgregister.1c.ru/orgregister/v7?wsdl";
	
КонецФункции

Функция ПространствоИмен()
	
	Возврат "http://ws.orgregister.company1c.com/";
	
КонецФункции

Процедура ОбработатьОшибкуСервиса(ОбъектXDTO, ОписаниеОшибки, ИмяМетода, СтруктураРеквизитов)
	
	Если ОбъектXDTO <> Неопределено
		И НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Возврат;
	КонецЕсли;
	
	КодОсновногоЯзыка  = Метаданные.ОсновнойЯзык.КодЯзыка; // Для записи события в журнал регистрации
	ОписаниеОшибкиВРег = ВРег(ОписаниеОшибки);
	ТекстОшибки        = "";
	
	Если ОписаниеОшибкиВРег = Врег("НеУказаныПараметрыАутентификации") Тогда
		
		ТекстОшибки    = "НеУказаныПараметрыАутентификации"; // Служебный текст. Должен быть обработан на клиенте.
		ТекстСобытия   = НСтр("ru='Ошибка доступа'", КодОсновногоЯзыка);
		ОписаниеОшибки = НСтр("ru='Не указаны логин и пароль для доступа к интернет-поддержке'");
		
	ИначеЕсли Найти(ОписаниеОшибкиВРег, """STATUS"":401") > 0 
		ИЛИ Найти(ОписаниеОшибкиВРег, "SERVER-9:") > 0 Тогда
		
		ТекстОшибки  = НСтр("ru='Неверно указаны логин и пароль для доступа к интернет-поддержке'");
		ТекстСобытия = НСтр("ru='Ошибка доступа'", КодОсновногоЯзыка);
		
	ИначеЕсли Найти(ОписаниеОшибкиВРег, "SERVER-1:") > 0 Тогда
		
		Если ИмяМетода = "getCorporationRequisitesByINN" 
			ИЛИ ИмяМетода = "checkCorporationTrustability" Тогда
			ТекстОшибки = НСтр("ru='Не указан ИНН юридического лица'");
		ИначеЕсли ИмяМетода = "getEntrepreneurRequisitesByINN" 
			ИЛИ ИмяМетода = "checkPersonTrustabilityByInn" Тогда
			ТекстОшибки = НСтр("ru='Не указан ИНН предпринимателя'");
		ИначеЕсли ИмяМетода = "getCorporationRequisitesByNameAndAddress" Тогда
			ТекстОшибки = НСтр("ru='Не указано наименование юридического лица'");
		КонецЕсли;
		ТекстСобытия = НСтр("ru='Ошибка получения данных'", КодОсновногоЯзыка);
		
	ИначеЕсли Найти(ОписаниеОшибкиВРег, "SERVER-2:") > 0 Тогда
		
		Если ИмяМетода = "getCorporationRequisitesByINN" 
			ИЛИ ИмяМетода = "checkCorporationTrustability" Тогда
			ТекстОшибки = НСтр("ru='ИНН юридического лица должен состоять из 10 цифр'");
		ИначеЕсли ИмяМетода = "getEntrepreneurRequisitesByINN" 
			ИЛИ ИмяМетода = "checkPersonTrustabilityByInn" Тогда
			ТекстОшибки = НСтр("ru='ИНН предпринимателя должен состоять из 12 цифр'");
		КонецЕсли;
		ТекстСобытия = НСтр("ru='Ошибка получения данных'", КодОсновногоЯзыка);
		
	ИначеЕсли Найти(ОписаниеОшибкиВРег, "SERVER-3:") > 0 Тогда
		
		Если ИмяМетода = "getCorporationRequisitesByINN" 
			ИЛИ ИмяМетода = "checkCorporationTrustability" Тогда
			ТекстОшибки = НСтр("ru='ИНН юридического лица должен содержать только цифры'");
		ИначеЕсли ИмяМетода = "getEntrepreneurRequisitesByINN" 
			ИЛИ ИмяМетода = "checkPersonTrustabilityByInn" Тогда
			ТекстОшибки = НСтр("ru='ИНН предпринимателя должен содержать только цифры'");
		КонецЕсли;
		ТекстСобытия = НСтр("ru='Ошибка получения данных'", КодОсновногоЯзыка);
		
	ИначеЕсли Найти(ОписаниеОшибки, "SERVER-7:") > 0 Тогда
		
		ТекстОшибки  = НСтр("ru='Превышен лимит количества вызовов сервиса за один день'");
		ТекстСобытия = НСтр("ru='Ошибка доступа'", КодОсновногоЯзыка);
		
	ИначеЕсли Найти(ОписаниеОшибки, "SERVER-8:") > 0 Тогда
		
		ТекстОшибки  = НСтр("ru='Отсутствует действующий договор ИТС'");
		ТекстСобытия = НСтр("ru='Ошибка доступа'", КодОсновногоЯзыка);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ОписаниеОшибки)
		И ОбъектXDTO = Неопределено Тогда
		
		Если ИмяМетода = "getCorporationRequisitesByINN" 
			ИЛИ ИмяМетода = "getEntrepreneurRequisitesByINN" Тогда
			ТекстОшибки  = ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось найти данные для заполнения реквизитов по ИНН %1'"),
			СтруктураРеквизитов.ИНН);
		ИначеЕсли ИмяМетода = "getCorporationRequisitesByNameAndAddress" Тогда
			ТекстОшибки  = НСтр("ru='Не удалось выполнить поиск по наименованию'");
		ИначеЕсли ИмяМетода = "checkCorporationTrustability" Тогда
			ТекстОшибки  = ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось найти данные о юридическом лице с ИНН %1'"),
			СтруктураРеквизитов.ИНН);
		ИначеЕсли ИмяМетода = "checkPersonTrustabilityByInn" Тогда
			ТекстОшибки  = ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось найти данные о предпринимателе с ИНН %1'"),
			СтруктураРеквизитов.ИНН);
		КонецЕсли;
		ТекстСобытия   = НСтр("ru='Ошибка получения данных'", КодОсновногоЯзыка);
		ОписаниеОшибки = ТекстОшибки;	
		
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда // Неклассифицированная ошибка
		ТекстОшибки  = НСтр("ru='Ошибка при работе с сервисом (проверьте настройки Интернет-поддержки)'");
		ТекстСобытия = НСтр("ru='Ошибка при работе с сервисом'", КодОсновногоЯзыка);
	КонецЕсли;
	
	СтруктураРеквизитов.ОписаниеОшибки = ТекстОшибки;
	
	ИмяСобытия = НСтр("ru = 'Сервис данных единых гос_реестров.'", КодОсновногоЯзыка) + " " + ТекстСобытия;
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	
КонецПроцедуры

Функция СериализацияОбъектаXDTO(ОбъектXDTO) Экспорт
	
	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиXML(, , Ложь, Ложь, ""));
	Если ОбъектXDTO <> Неопределено Тогда
		ФабрикаXDTO.ЗаписатьXML(Запись, ОбъектXDTO);
	КонецЕсли;
	
	Возврат СтрЗаменить(Запись.Закрыть(), Символы.ПС, "&#10;");
	
КонецФункции

////////// Строковые функции

// Подставляет параметры в строку. Максимально возможное число параметров - 9.
// Параметры в строке задаются как %<номер параметра>. Нумерация параметров начинается с единицы.
//
// Параметры:
//  СтрокаПодстановки  - Строка - шаблон строки с параметрами (вхождениями вида "%ИмяПараметра");
//  Параметр<n>        - Строка - подставляемый параметр.
//
// Возвращаемое значение:
//  Строка   - текстовая строка с подставленными параметрами.
//
// Пример:
//  ПодставитьПараметрыВСтроку(НСтр("ru='%1 пошел в %2'"), "Вася", "Зоопарк") = "Вася пошел в Зоопарк".
//
Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ИспользоватьАльтернативныйАлгоритм = 
	Найти(Параметр1, "%")
	Или Найти(Параметр2, "%")
	Или Найти(Параметр3, "%")
	Или Найти(Параметр4, "%")
	Или Найти(Параметр5, "%")
	Или Найти(Параметр6, "%")
	Или Найти(Параметр7, "%")
	Или Найти(Параметр8, "%")
	Или Найти(Параметр9, "%");
	
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
	СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	
	Возврат СтрокаПодстановки;
	
КонецФункции

// Разбивает строку на несколько строк, используя заданный набор разделителей.
// Если параметр РазделителиСлов не задан, то разделителем слов считается любой из символов, 
// не относящихся к символам латиницы, кириллицы, цифры, подчеркивания.
//
// Параметры:
//  Строка          - Строка - строка, которую необходимо разложить на слова.
//  РазделителиСлов - Строка - строка, содержащая символы-разделители.
//
//  Возвращаемое значение:
//      массив значений, элементы которого - отдельные слова.
//
// Пример:
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три") возвратит массив значений: "один", "два2_", "три";
//  РазложитьСтрокуВМассивСлов("один-@#два2_!три", "#@!_") возвратит массив значений: "один-", "два2", "три".
//
Функция РазложитьСтрокуВМассивСлов(Знач Строка, РазделителиСлов = Неопределено) Экспорт
	
	Слова = Новый Массив;
	
	РазмерТекста = СтрДлина(Строка);
	НачалоСлова = 1;
	Для Позиция = 1 По РазмерТекста Цикл
		КодСимвола = КодСимвола(Строка, Позиция);
		Если ЭтоРазделительСлов(КодСимвола, РазделителиСлов) Тогда
			Если Позиция <> НачалоСлова Тогда
				Слова.Добавить(Сред(Строка, НачалоСлова, Позиция - НачалоСлова));
			КонецЕсли;
			НачалоСлова = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Позиция <> НачалоСлова Тогда
		Слова.Добавить(Сред(Строка, НачалоСлова, Позиция - НачалоСлова));
	КонецЕсли;
	
	Возврат Слова;
	
КонецФункции

///  Объединяет строки из массива в строку с разделителями.
//
// Параметры:
//  Массив      - Массив - массив строк которые необходимо объединить в одну строку;
//  Разделитель - Строка - любой набор символов, который будет использован в качестве разделителя.
//
// Возвращаемое значение:
//  Строка - строка с разделителями.
// 
Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет, является ли символ разделителем.
//
// Параметры:
//  КодСимвола      - Число  - код проверяемого символа;
//  РазделителиСлов - Строка - символы разделителей.
//
// Возвращаемое значение:
//  Булево - истина, если символ является разделителем.
//
Функция ЭтоРазделительСлов(КодСимвола, РазделителиСлов = Неопределено) Экспорт
	
	Если РазделителиСлов <> Неопределено Тогда
		Возврат Найти(РазделителиСлов, Символ(КодСимвола)) > 0;
	КонецЕсли;
	
	Диапазоны = Новый Массив;
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57)); 		// цифры
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90)); 		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122)); 		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103)); 	// кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025)); 	// символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105)); 	// символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95)); 		// символ "_"
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

///////// Вспомогательные

// Возвращает пространство имен для оперирования с XDTO контактной информации.
//
// Возвращаемое значение:
//      Строка - пространство имен.
//
Функция ПространствоИменКИ() Экспорт
	Возврат "http://www.v8.1c.ru/ssl/contactinfo";
КонецФункции

// Возвращает логин и пароль пользователя Интернет-поддержки,
// сохраненные в информационной базе.
//
// Возвращаемое значение:
//	Структура - структура, содержащая логин и пароль пользователя
//		Интернет-поддержки:
//		* Логин - Строка - логин пользователя Интернет-поддержки;
//		* Пароль - Строка - пароль пользователя Интернет-поддержки, отсутствует,
//			если пользователь не установил флаг "Запомнить меня".
//	Неопределено - при отсутствии сохраненных данных авторизации.
//
Функция ДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт
	
//	Возврат Новый Структура("Логин, Пароль", Константы.ИнтернетПоддержкаЛогин.Получить(), Константы.ИнтернетПоддержкаПароль.Получить());
//	Возврат Новый Структура("Логин, Пароль", СокрЛП(обПраво("ИнтернетПоддержкаЛогин")), СокрЛП(обПраво("ИнтернетПоддержкаПароль")));
//	Возврат Новый Структура("Логин, Пароль", "800512926--", "tsk800512926--");
//	Возврат Новый Структура("Логин, Пароль", "800510592", "qwerty800510592");
	Возврат Новый Структура("Логин, Пароль", "9859660a", "qwerty9859660");   
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL - Строка - месторасположение wsdl.
//  URIПространстваИмен - Строка - URI пространства имен web-сервиса.
//  ИмяСервиса - Строка - имя сервиса.
//  ИмяТочкиПодключения - Строка - если не задано, образуется как <ИмяСервиса>Soap.
//  ИмяПользователя - Строка - имя пользователя для входа на сервер.
//  Пароль - Строка - пароль пользователя.
//  Таймаут - Число - таймаут на операции выполняемые через полученное прокси.
//
// Возвращаемое значение:
//  WSПрокси
//
Функция WSПрокси(Знач АдресWSDL,
	Знач URIПространстваИмен,
	Знач ИмяСервиса,
	Знач ИмяТочкиПодключения = "",
	Знач ИмяПользователя,
	Знач Пароль,
	Знач Таймаут = 0,
	Знач ДелатьКонтрольныйВызов = Ложь) Экспорт
	
	WSОпределения = Неопределено;//ОбщегоНазначенияПовтИсп.WSОпределения(АдресWSDL, ИмяПользователя, Пароль);
	
	Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
		ИмяТочкиПодключения = ИмяСервиса + "Soap";
	КонецЕсли;
	
	WSОпределения =  Новый WSОпределения(АдресСервиса(),ИмяПользователя, Пароль);
	
	Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения,  Таймаут);
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль       = Пароль;
	
	Возврат Прокси;
	
КонецФункции


// Контактная информация
