
Функция СформироватьТаблицуСоответствийТоваров(Таблица) Экспорт
	
	
	
КонецФункции

Функция СформироватьТаблицуСоответствийРабот(Таблица, Модель = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Модель" , Модель);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.НомерРаботы КАК НомерРаботы,
	|	NULL КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаРабот
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.НомерРаботы <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРабот.НомерРаботы,
	|	ЕСТЬNULL(ОбменСAudaPadWebТаблицаСоответствий.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
	|ИЗ
	|	ТаблицаРабот КАК ТаблицаРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбменСAudaPadWebТаблицаСоответствий КАК ОбменСAudaPadWebТаблицаСоответствий
	|		ПО ТаблицаРабот.НомерРаботы = ОбменСAudaPadWebТаблицаСоответствий.Актикул
	|ГДЕ
	|	(ОбменСAudaPadWebТаблицаСоответствий.Модель = &Модель
	|			ИЛИ ОбменСAudaPadWebТаблицаСоответствий.Модель = ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка))
	|	И ЕСТЬNULL(ОбменСAudaPadWebТаблицаСоответствий.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) ССЫЛКА Справочник.Автоработы";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

