
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МакетДокумента = Обработки.ЛицензионноеСоглашение.ПолучитьМакет("ЛицензионноеСоглашение");
	
	ТекстЛицензионногоСоглашения = МакетДокумента.ПолучитьТекст();
	ТекстЛицензионногоСоглашения = СтрЗаменить(ТекстЛицензионногоСоглашения, "[ЮридическоеЛицо]", Строка(Метаданные.Поставщик));
	ТекстЛицензионногоСоглашения = СтрЗаменить(ТекстЛицензионногоСоглашения, "[НаименованиеТОРа]", Строка(Метаданные.Синоним));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыПродолжить(Команда)
	
	Результат = ПодтверждениеВыбора = 1;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	ИначеЕсли Результат <> Истина Тогда
		Если Параметры.ПоказыватьПредупреждениеОПерезапуске И НЕ ПропуститьПерезапуск Тогда
			ПрекратитьРаботуСистемы();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
