Функция ПолучитьСвойства() Экспорт
	
	СтруктураСвойств = Новый Структура;
	СтруктураСвойств.Вставить("РабочийЛист");
	СтруктураСвойств.Вставить("Автомобиль");
	СтруктураСвойств.Вставить("ДатаПродажи");
	СтруктураСвойств.Вставить("ИсточникПоступления");
	СтруктураСвойств.Вставить("ЦенаПоступления");  
	
	СтруктураСвойств.Вставить("ЦенаПродажи");
	СтруктураСвойств.Вставить("ЗатратыНаПоготовкуКПродаже");
	СтруктураСвойств.Вставить("КоличествоДнейПодготовкиАвтомобиля");
	СтруктураСвойств.Вставить("ГарМаржа");  
	
	СтруктураСвойств.Вставить("ГарМаржаПроцент");
	СтруктураСвойств.Вставить("ФактМаржаНовый");
	СтруктураСвойств.Вставить("ФактМаржаПроцент");
	СтруктураСвойств.Вставить("ДельтаМаржа");  
	
	СтруктураСвойств.Вставить("КоличествоДнейНаСкладе");
	СтруктураСвойств.Вставить("МенеджерАвтомобиля");
	СтруктураСвойств.Вставить("Оценщик");
	
	Возврат СтруктураСвойств;
	
КонецФункции

Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОтчетыСервер.ЗаполнитьНачальныеОстатки(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт

	ОтчетыСервер.ВывестиОтчет(ЭтотОбъект, СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры


