// Модуль документа СчетФактураВыданный

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА                             

Перем Права Экспорт;                // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;   // результат обработки
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ВалютаУправленческогоУчета;  // Переменная для хранения значения валюты управленческого учета
Перем ВалютаРегламентированногоУчета; // Переменная для хранения значения валюты регламентированного учета
Перем КешСебестоимостиАвтомобилейКупленныхУФизЛица Экспорт; // Переменная для хранения значения валюты регламентированного учета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Функция возвращает положительную себестоимость автомобиля в валюте документа если 
// этот автомобиль был приобретен у физического лица
//
// Параметры:
//  СтрокаТЧ       - строка табличной части Товары
//
// Возвращаемое значение:
//  Себестоимость - Число себестоимость автомобиля в валюте документа
// 
Функция ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТЧ) Экспорт
	
	// Перезаполняем ставки НДС только для сФ введенных на основания Реализации автомобилей
	Если НЕ ДокументОснование.ХозОперация = Справочники.ХозОперации.РеализацияАвтомобилей Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ТипЗнч(СтрокаТЧ.Номенклатура) = Тип("СправочникСсылка.Автомобили") ИЛИ
		СтрокаТЧ.СтавкаНДС = Справочники.СтавкиНДС.БезНДС ИЛИ СтрокаТЧ.СтавкаНДС.Ставка = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
		ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	КонецЕсли;
	
	Если КешСебестоимостиАвтомобилейКупленныхУФизЛица = Неопределено Тогда
		КешСебестоимостиАвтомобилейКупленныхУФизЛица = Новый ТаблицаЗначений;
		КешСебестоимостиАвтомобилейКупленныхУФизЛица.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("СправочникСсылка.Автомобили"));
		КешСебестоимостиАвтомобилейКупленныхУФизЛица.Колонки.Добавить("СебестоимостьУпр", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		КешСебестоимостиАвтомобилейКупленныхУФизЛица.Колонки.Добавить("Себестоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	КонецЕсли;
	
	СтрокаКеша = КешСебестоимостиАвтомобилейКупленныхУФизЛица.Найти(СтрокаТЧ.Номенклатура, "Автомобиль");
	Если СтрокаКеша = Неопределено Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ВЫБОР
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ОстаткиАвтомобилей.СуммаУпр
		                      |	КОНЕЦ КАК СебестоимостьУпр,
		                      |	ВЫБОР
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
		                      |			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ВводОстатковАвтомобилей).Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей
		                      |			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Регистратор КАК Документ.ПоступлениеАвтомобилей).Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
		                      |				И ОстаткиАвтомобилей.Партия ССЫЛКА Документ.ВводОстатковАвтомобилей
		                      |			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Партия КАК Документ.ВводОстатковАвтомобилей).Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
		                      |				И ОстаткиАвтомобилей.Партия ССЫЛКА Документ.ПоступлениеАвтомобилей
		                      |			ТОГДА ВЫРАЗИТЬ(ОстаткиАвтомобилей.Партия КАК Документ.ПоступлениеАвтомобилей).Контрагент.ФормаСобственности = ЗНАЧЕНИЕ(Перечисление.ФормыСобственности.ЧастноеЛицо)
		                      |	КОНЕЦ КАК КупленУЧастногоЛица,
		                      |	ВЫБОР
		                      |		КОГДА ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
		                      |			ТОГДА 0
		                      |		ИНАЧЕ ОстаткиАвтомобилей.Сумма
		                      |	КОНЕЦ КАК Себестоимость
		                      |ИЗ
		                      |	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		                      |ГДЕ
		                      |	ОстаткиАвтомобилей.Период <= &ДатаКон
		                      |	И ОстаткиАвтомобилей.Автомобиль = &Автомобиль
		                      |	И ОстаткиАвтомобилей.СтатусПартии = ЗНАЧЕНИЕ(Перечисление.СтатусыПартий.ТоварКупленный)
		                      |	И (ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводВЭксплуатациюАвтомобилей
		                      |			ИЛИ ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
		                      |			ИЛИ ОстаткиАвтомобилей.Регистратор ССЫЛКА Документ.ПоступлениеАвтомобилей)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ОстаткиАвтомобилей.Период УБЫВ");
		Запрос.УстановитьПараметр("ДатаКон", Дата);
		Запрос.УстановитьПараметр("Автомобиль", СтрокаТЧ.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Себестоимость    = 0;
		СебестоимостьУпр = 0;
		Если Выборка.Следующий() Тогда
			Если Выборка.Себестоимость > 0
				И Выборка.КупленУЧастногоЛица Тогда
				Себестоимость    = Выборка.Себестоимость;
				СебестоимостьУпр = Выборка.СебестоимостьУпр;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаКеша = КешСебестоимостиАвтомобилейКупленныхУФизЛица.Добавить();
		СтрокаКеша.Автомобиль       = СтрокаТЧ.Номенклатура;
		СтрокаКеша.Себестоимость    = Себестоимость;
		СтрокаКеша.СебестоимостьУпр = СебестоимостьУпр;
		
	КонецЕсли;
	
	Себестоимость    = 0;
	Если СтрокаКеша.Себестоимость = 0 Тогда
		Себестоимость    = 0;
	Иначе
		
		Если ВалютаДокумента = ВалютаУправленческогоУчета Тогда
			Себестоимость = СтрокаКеша.СебестоимостьУпр;
		ИначеЕсли ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
			Себестоимость = СтрокаКеша.Себестоимость;
		Иначе
			КурсРегл = 1;
			СтруктураКурса	= обКурсДляВалюты(ВалютаРегламентированногоУчета, Дата);
			КурсРегл		= ?(СтруктураКурса.Кратность = 0, СтруктураКурса.Курс, СтруктураКурса.Курс / СтруктураКурса.Кратность);
			
			Себестоимость = обПересчет(СтрокаКеша.Себестоимость, ВалютаРегламентированногоУчета, КурсРегл, ВалютаДокумента, КурсДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Себестоимость;
	
КонецФункции // ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	Если Хозоперация <> Справочники.ХозОперации.СчетФактураВыданныйКорректировка Тогда
		ОбязательныеТовары.Вставить("Количество",1);
	КонецЕсли;
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("СтавкаНДС",2);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2); 
	ОбязательныеТовары.Вставить("ГТД",2);
	ОбязательныеТовары.Вставить("Партия",2);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование", 1);
	Если Выставлен Тогда
		ОбязательныеРеквизиты.Вставить("ДатаВыставления",1);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснование) И (НЕ ДокументОснование.Метаданные().Реквизиты.Найти("ТипЦенРабот") = Неопределено) Тогда
		ОбязательныеРеквизиты.Вставить("ТипЦенРабот",1);
	КонецЕсли;
	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
		//Документ закрытие смены не содержит контрагент
		//Реквизиты Контрагент, ДоговорВзаиморасчетов, Грузополучатель не заполняем
	Иначе
		ОбязательныеРеквизиты.Вставить("Контрагент",1); 
		
		//<<Павличенко 06.02.18
		//ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
		Если   ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили") Тогда
		 	ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
		КонецЕсли;
		//>>Павличенко 06.02.18  
		
		ОбязательныеРеквизиты.Вставить("Грузополучатель",1);
	КонецЕсли;
	ОбязательныеРеквизиты.Вставить("Товары",ОбязательныеТовары);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// проверять на корректность реквизитов по организации будем только в случае если
	// все нормально с остальными реквизитами
	//Чтение значения для определения способа ведения баланса
	СпособВеденияБаланса = Константы.СпособВеденияБаланса.Получить();
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента", Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
						
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			Если НЕ обЗначениеНеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
			Иначе	
				КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
				КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);
			КонецЕсли;		
			
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли; 	
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("СчетФактураВыданный","Счет-фактура выданный",Истина);
	СписокХозОпераций.Добавить("СчетФактураВыданныйКорректировка","Корректировочный счет-фактура", Ложь);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			- Строка - Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	- Форма	 - Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Если Имя="" Тогда
		//Для приватной обработки изменения реквизитов
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ТОВАРЫ"
	ИначеЕсли Имя="Товары.Номенклатура" Тогда
		Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
			//Если имеем дело с автоработой - обработаем локально
			// установим количество
			Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
			Если ТекСтрока.Коэффициент=0 Тогда ТекСтрока.Коэффициент=1; КонецЕсли; 
			//Перерассчитаем цену текущей работы
			ОбработкаРеквизита("РасчетЦеныРаботы",ТекСтрока,ЭтаФорма,ДопПараметры);
			// Заполним ставку НДС
			ТекСтрока.СтавкаНДС=ТекСтрока.Номенклатура.Номенклатура.СтавкаНДС;
			//Расчет сумм по строке
			Возврат ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		ИначеЕсли ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
			//Если имеем дело с автомобилем - обработаем локально
			//Установим количество
			ТекСтрока.Количество=1;
			ТекСтрока.ЕдиницаИзмерения=Справочники.КлассификаторЕдиницИзмерения.шт;
			ТекСтрока.Коэффициент=1;
			// Заполним ставку НДС
			Если обЗначениеНеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
				ОсвобожденОтНДС=ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
				Если ОсвобожденОтНДС Тогда
					ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.БезНДС;
				Иначе
					ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				КонецЕсли; 
			КонецЕсли; 
			ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации",ТекСтрока.Номенклатура,Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			//Расчет сумм по строке
			Возврат ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			Если ТекСтрока.Номенклатура=Неопределено Тогда
				ТекСтрока.Номенклатура=Справочники.Номенклатура.ПустаяСсылка();
			КонецЕсли; 
			
			//БИЗТЕХ КОВАЛЬ 23.10.2024 ++
			//Конфликтный код, обернем в попытку
			Попытка
				Если ЗначениеЗаполнено(ДокументОснование) Тогда 
					СтруктураПоиска = Новый Структура("Номенклатура, ХарактеристикаНоменклатуры");
					ДокументОснованиеТовары = ДокументОснование.Товары.Выгрузить();
		            СтруктураПоиска.Номенклатура = ТекСтрока.Номенклатура;
		            СтруктураПоиска.ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
					СтрокиДокументаОснования = ДокументОснованиеТовары.НайтиСтроки(СтруктураПоиска);
					Если СтрокиДокументаОснования.Количество() > 0 Тогда 
						Если ТекСтрока.ЕдиницаИзмерения <> СтрокиДокументаОснования[0].ЕдиницаИзмерения Тогда
							ТекСтрока.ЕдиницаИзмерения = СтрокиДокументаОснования[0].ЕдиницаИзмерения;
							ТекСтрока.Коэффициент = СтрокиДокументаОснования[0].ЕдиницаИзмерения.Коэффициент;
							//Рез = ОбработкаРеквизита("Товары.ЕдиницаИзмерения", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			//В противном случае стандартная обработка
			Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя="Товары.Количество" Тогда
		Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
			//Если имеем дело с автоработой - обработаем локально
			Возврат ОбработкаРеквизита("Товары.Коэффициент",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			//В противном случае стандартная обработка
			Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя="Товары.ЕдиницаИзмерения" Тогда
		Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
			//Если имеем дело с автоработой - обработаем локально
			ЦенаНормочаса=ТекСтрока.ЕдиницаИзмерения.Цена;
			ТекСтрока.Цена=обПересчет(ЦенаНормочаса,ТекСтрока.ЕдиницаИзмерения.Валюта,Дата,ВалютаДокумента,КурсДокумента);
			Возврат ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			//В противном случае стандартная обработка
			Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя="Товары.Коэффициент" Тогда
		Если ТипЗнч(ТекСтрока.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
			//Если имеем дело с автоработой - обработаем локально
			Возврат ОбработкаРеквизита("Товары.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		Иначе
			//В противном случае стандартная обработка
			Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
	ИначеЕсли Имя = "Товары.СтавкаНДС" Тогда
		
		Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(ТекСтрока);
		Если Себестоимость = 0 Тогда
			Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		Иначе
			СтавкаНДС = ТекСтрока.СтавкаНДС.Ставка;
			Сумма = ТекСтрока.Сумма;
			Если НЕ (ТипЦен.Пустая() ИЛИ ТипЦен.ЦенаВключаетНДС) Тогда
				Сумма = Сумма + Макс(Окр((Сумма-Себестоимость)*СтавкаНДС/100,2), 0);
			КонецЕсли;
			ТекСтрока.СуммаНДС = Макс(Окр(((Сумма-Себестоимость) * СтавкаНДС)/(100 + СтавкаНДС), 2), 0);
			ТекСтрока.СуммаВсего    = Сумма;
			Результат = Истина;
		КонецЕсли;
		
		Возврат Результат;
		
	ИначеЕсли Имя = "Товары.СуммаВсего" Тогда 
		
		Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(ТекСтрока);
		Если Себестоимость = 0 Тогда
			Результат = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		Иначе
			СтавкаНДС   = ТекСтрока.СтавкаНДС.Ставка;
			// Расчитываем новую сумму НДС.
			ТекСтрока.СуммаНДС = Макс(Окр(((ТекСтрока.СуммаВсего - Себестоимость) * СтавкаНДС)/(100 + СтавкаНДС), 2), 0);
			
			// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
			Если ТипЦен.Пустая() ИЛИ ТипЦен.ЦенаВключаетНДС Тогда
				ТекСтрока.Сумма = ТекСтрока.СуммаВсего;
			Иначе
				ТекСтрока.Сумма = Окр(ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС, 2);
			КонецЕсли;
			
			// Пересчитываем цену.
			ТекКоличество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
			Если ТекКоличество = 0 Тогда
				ТекСтрока.Цена = ТекСтрока.Сумма;
			Иначе
				ТекСтрока.Цена = Окр(ТекСтрока.Сумма / ТекКоличество, 2);
			КонецЕсли;
		КонецЕсли;
		
		Возврат Результат;
		
	ИначеЕсли Имя="РасчетЦеныРаботы" Тогда
		//Расчет цены работы
		Если обЗначениеНеЗаполнено(ТекСтрока.Номенклатура) Тогда Возврат Ложь; КонецЕсли;
		Модель = ПолучитьМодель();
		Попытка
			Цех=ДокументОснование.Цех;
		Исключение
			Цех=Справочники.Цеха.ПустаяСсылка();
		КонецПопытки; 
		Попытка
			ВидРемонта=ДокументОснование.ВидРемонта;
		Исключение
			ВидРемонта=Справочники.ВидыРемонта.ПустаяСсылка();
		КонецПопытки; 
		ЦенаРаботы = орПолучитьЦенуАвтоработы(ТипЦенРабот, ТекСтрока.Номенклатура, Модель,ДоговорВзаиморасчетов,Цех,ВидРемонта,,ВалютаДокумента,КурсДокумента);
		ТекСтрока.ЕдиницаИзмерения=ЦенаРаботы.Нормочас;
		ТекСтрока.Коэффициент=?(обЗначениеНеЗаполнено(ЦенаРаботы.НормаВремени),ТекСтрока.Коэффициент,ЦенаРаботы.НормаВремени);
		ТекСтрока.Цена=ЦенаРаботы.Цена;
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// Получение модели автомобиля для расчета цен
//
Функция ПолучитьМодель()
	
	Модель = Справочники.Модели.ПустаяСсылка();
	Если НЕ обЗначениеНеЗаполнено(ДокументОснование) Тогда
		Если ДокументОснование.Метаданные().Реквизиты.Найти("Автомобиль")<>Неопределено Тогда
			Автомобиль = ДокументОснование.Автомобиль;
			Если ТипЗнч(Автомобиль)=Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(Автомобиль) Тогда
				Если ЗначениеЗаполнено(Автомобиль.ВариантКомплектации) Тогда
					Модель = Автомобиль.ВариантКомплектации;
				Иначе
					Модель = Автомобиль.Модель;
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДокументОснование.Автомобиль)=Тип("СправочникСсылка.Модели") Тогда
				Модель = ДокументОснование.Автомобиль;
				Если ДокументОснование.Метаданные().Реквизиты.Найти("ВариантКомплектации")<>Неопределено Тогда
					Если ЗначениеЗаполнено(ДокументОснование.ВариантКомплектации) Тогда
						Модель = ДокументОснование.ВариантКомплектации;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Модель;
	
КонецФункции

// Пересчет Суммы от СуммыВсего и СуммыНДС
//
Процедура ПересчитатьСумму(ТекСтрока)
	Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(ТекСтрока);
	Если Себестоимость = 0 Тогда
		СтавкаНДС=ТекСтрока.СтавкаНДС;
		ЦенаВключаетНДС=ЭтотОбъект.ТипЦен.Пустая() ИЛИ ЭтотОбъект.ТипЦен.ЦенаВключаетНДС;
		//// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина.
		ТекСтрока.Сумма=?(ЦенаВключаетНДС,ТекСтрока.СуммаВсего,ТекСтрока.СуммаВсего-ТекСтрока.СуммаНДС);
	Иначе
		СтавкаНДС   = ТекСтрока.СтавкаНДС.Ставка;
		// Расчитываем новую сумму НДС.
		ТекСтрока.СуммаНДС = Макс(Окр(((ТекСтрока.СуммаВсего - Себестоимость) * СтавкаНДС)/(100 + СтавкаНДС), 2), 0);
		
		// Рассчитаем значение реквизита "Сумма". Если расчет НДС не ведется, то ЦенаВключаетНДС будет всегда Истина. 
		Если ТипЦен.Пустая() ИЛИ ТипЦен.ЦенаВключаетНДС Тогда
			ТекСтрока.Сумма = ТекСтрока.СуммаВсего;
		Иначе
			ТекСтрока.Сумма = Окр(ТекСтрока.СуммаВсего - ТекСтрока.СуммаНДС, 2);
		КонецЕсли;
	КонецЕсли;
	// Пересчитываем цену.
	ТекКоличество = ТекСтрока.Количество * ТекСтрока.Коэффициент;
	Если ТекКоличество = 0 Тогда
		ТекСтрока.Цена = ТекСтрока.Сумма;
	Иначе
		ТекСтрока.Цена = Окр(ТекСтрока.Сумма / ТекКоличество, 2);
	КонецЕсли;
КонецПроцедуры

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// Сформировать имя платежного документа в сокращенном виде
Функция СформироватьИмяПлатежногоДокумента(ДокументОплаты) Экспорт
	
	Если ТипЗнч(ДокументОплаты) = Тип("Строка") Тогда		
		Возврат СокрЛП(ДокументОплаты);	
	КонецЕсли;
	
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда		
		Префикс = "ПКО ";		
	ИначеЕсли ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.ЧекНаОплату") Тогда		
		Префикс = "Чек "; 	
	Иначе		
		Префикс = "";		
	КонецЕсли;
	
	//<<ЧалапАю БизТех 21.11.2024
	Если ТипЗнч(ДокументОплаты) = Тип("ДокументСсылка.Выписка") Тогда		
		ЗапросСФ = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                        |	ВыпискаСостав.Ссылка КАК Ссылка,
		                        |	ВыпискаСостав.ПлатежноеПоручениеОснование КАК ПлатежноеПоручениеОснование
		                        |ИЗ
		                        |	Документ.Выписка.Состав КАК ВыпискаСостав
		                        |ГДЕ
		                        |	ВыпискаСостав.Сделка = &Сделка
		                        |	И ВыпискаСостав.Ссылка.Проведен
		                        |
		                        |УПОРЯДОЧИТЬ ПО
		                        |	ВыпискаСостав.Ссылка.Дата УБЫВ");
		ЗапросСФ.УстановитьПараметр("Сделка", ДокументОснование.Ссылка);
		
		Результат = ЗапросСФ.Выполнить().Выгрузить();
		
		Если Результат.Количество() тогда
			Возврат Результат[0].ПлатежноеПоручениеОснование
		иначе
			РеквизитыДокумента = обЗначенияРеквизитовОбъекта(ДокументОплаты,"Номер, Дата");
		КонецЕсли;
	иначе
		РеквизитыДокумента = обЗначенияРеквизитовОбъекта(ДокументОплаты,"Номер, Дата");
	КонецЕсли;
	//ЧалапАю БизТех 21.11.2024>>

	//РеквизитыДокумента = обЗначенияРеквизитовОбъекта(ДокументОплаты,"Номер, Дата");	
	НомерБезНулей = СокрЛП(сфпСтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(РеквизитыДокумента.Номер, "0"));
	
	ИмяДокументаСтрокой = СтрШаблон("%1%2 от %3", Префикс, НомерБезНулей, Формат(РеквизитыДокумента.Дата,"ДЛФ=Д"));
	
	Возврат ИмяДокументаСтрокой;

КонецФункции

// заполнение авансовых платежей
Процедура ЗаполнитьАвансовыеПлатежи(Основание) Экспорт
	Если обЗначениеНеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	ПлатежноРасчетныеДокументы = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыКомпании.Сделка КАК Сделка,
	|	ВыпискаСостав.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ВыпискаСостав.Сделка КАК СделкаВыписки,
	|	ВыпискаСостав.ПлатежноеПоручениеОснование КАК ПлатежноеПоручение
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКомпании КАК ВзаиморасчетыКомпании
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка.Состав КАК ВыпискаСостав
	|		ПО ВзаиморасчетыКомпании.Сделка = ВыпискаСостав.Ссылка
	|ГДЕ
	|	ВзаиморасчетыКомпании.Регистратор = &Основание
	|	И (ВзаиморасчетыКомпании.Сделка ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ВзаиморасчетыКомпании.Сделка ССЫЛКА Документ.Выписка
	|			ИЛИ ВзаиморасчетыКомпании.Сделка ССЫЛКА Документ.ЧекНаОплату)";
	
	Запрос.УстановитьПараметр("Основание",Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если обЗначениеНеЗаполнено(Выборка.Сделка) Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтотОбъект.ДоговорВзаиморасчетов=Выборка.ДоговорВзаиморасчетов Тогда
			Если (НЕ ЗначениеЗаполнено(Выборка.СделкаВыписки)) ИЛИ Выборка.СделкаВыписки=Основание Тогда
				
				ПлатежноРасчетныеДокументы = ПлатежноРасчетныеДокументы + ?(ПустаяСтрока(ПлатежноРасчетныеДокументы),"","; ");
				
				Если ЗначениеЗаполнено(Выборка.ПлатежноеПоручение) Тогда
					ПлатежноРасчетныеДокументы = ПлатежноРасчетныеДокументы + СформироватьИмяПлатежногоДокумента(Выборка.ПлатежноеПоручение);
				Иначе
					ПлатежноРасчетныеДокументы = ПлатежноРасчетныеДокументы + СформироватьИмяПлатежногоДокумента(Выборка.Сделка);
				КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

Функция ТаблицаДвиженийПоГТД(Основание) Экспорт
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
		|	ГТДПартийТоваровКомпании.Партия
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.Партия";
		Запрос.УстановитьПараметр("Основание", Основание);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ЕстьЗН = Ложь;
		// составим списко документов движений
		ДокОснование = ДокументОснование;
		СписокОснований = Новый СписокЗначений;
		Пока Истина Цикл
			СписокОснований.Добавить(ДокОснование);
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
				ЕстьЗН = Истина; 
				ЦехОснования = ДокОснование.Цех;
			КонецЕсли;
			Если ТипЗнч(ДокОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Прервать;
			КонецЕсли;
			ДокОснование = ДокОснование.ДокументОснование;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Партия,
		|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор В (&СписокОснований)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.Партия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.ГТД,
		|	ТоварыВПроизводстве.Партия,
		|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Регистратор В (&СписокОснований)
		|	И ТоварыВПроизводстве.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.Партия,
		|	ТоварыВПроизводстве.ГТД
		|";
		Запрос.УстановитьПараметр("СписокОснований",СписокОснований);
		// kraviv
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если обПраво("ВыборочноеСписаниеПартий",Права,,ЭтотОбъект) Тогда
			Если Результат.Количество() > 0 Тогда
				Результат.Колонки.Добавить("ГТДДоКорректировки");
				ТЧКорректировки = ДокументОснование.Товары.Выгрузить();
				Для Каждого Строка Из Результат Цикл 
					СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД,Партия");
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, Строка);		
					НайденныеСтроки = ТЧКорректировки.НайтиСтроки(СтруктураПоиска);
					Если НайденныеСтроки.Количество() = 0 Тогда
						Продолжить;
					Иначе
						Строка.ГТДДоКорректировки = НайденныеСтроки[0].ГТДПоДокументуРеализации;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Возврат Результат;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ
		ТипЗнч(Основание) = Тип("ДокументСсылка.АктРазногласий") Тогда
		
		ИмяДок = ?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд"),"ЗаказНаряд","АктРазногласий");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.ГТД,
		|	ТоварыВПроизводстве.Партия,
		|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
		|ГДЕ
		|	ТоварыВПроизводстве.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
		|	ТоварыВПроизводстве.Номенклатура,
		|	ТоварыВПроизводстве.ГТД,
		|	ТоварыВПроизводстве.Партия
		|";
		Если ИмяДок = "АктРазногласий" Тогда
			Запрос.УстановитьПараметр("Основание",Основание.ДокументОснование);
		Иначе
			Запрос.УстановитьПараметр("Основание",Основание);
		КонецЕсли;
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		|	ПартииТоваровОтданные.ГТД,
		|	ПартииТоваровОтданные.Партия,
		|	СУММА(ПартииТоваровОтданные.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
		|ГДЕ
		|	ПартииТоваровОтданные.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		|	ПартииТоваровОтданные.Партия,
		|	ПартииТоваровОтданные.ГТД";
		Запрос.УстановитьПараметр("Основание",Основание);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	СУММА(-ГТДПартийТоваровКомпании.Количество) КАК Количество,
		|	ГТДПартийТоваровКомпании.Партия
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.Партия";
		Запрос.УстановитьПараметр("Основание",Основание);
		
		Возврат Запрос.Выполнить().Выгрузить();
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.ГТД,
		|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		|ГДЕ
		|	КомплектацияАвтомобилей.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.ГТД,
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
		Запрос.УстановитьПараметр("Основание",Основание);
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
		|	ПартииТоваровОтданные.ГТД,
		|	ПартииТоваровОтданные.Партия,
		|	СУММА(ПартииТоваровОтданные.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
		|ГДЕ
		|	ПартииТоваровОтданные.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ПартииТоваровОтданные.ГТД,
		|	ПартииТоваровОтданные.Партия,
		|	ПартииТоваровОтданные.Номенклатура,
		|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры";
		Запрос.УстановитьПараметр("Основание",Основание);
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание",Основание);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.ГТД,
		|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		|ГДЕ
		|	КомплектацияАвтомобилей.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияАвтомобилей.ГТД,
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сделка"    , Основание.Сделка);
		Запрос.УстановитьПараметр("Основание" , Основание);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.ГТД,
		|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		|ГДЕ
		|	КомплектацияАвтомобилей.Регистратор = &Сделка
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияАвтомобилей.ГТД,
		|	КомплектацияАвтомобилей.Партия,
		|	КомплектацияАвтомобилей.Номенклатура,
		|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание",Основание);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
		|	ГТДПартийТоваровКомпании.Партия
		|ИЗ
		|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
		|ГДЕ
		|	ГТДПартийТоваровКомпании.Регистратор = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
		|	ГТДПартийТоваровКомпании.ГТД,
		|	ГТДПартийТоваровКомпании.Номенклатура,
		|	ГТДПартийТоваровКомпании.Партия";
		
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭтоАвансовыйСчетФактура()
	
	СписокОснований = Новый Массив();
	СписокОснований.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	СписокОснований.Добавить(Тип("ДокументСсылка.Выписка"));
	СписокОснований.Добавить(Тип("ДокументСсылка.ЧекНаОплату"));
	
	Возврат СписокОснований.Найти(ТипЗнч(ДокументОснование)) <> Неопределено;
	
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует печатную форму "СчетФактура"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьСчетФактура(ТабДокумент) Экспорт
	
	Если Дата >= Дата("20210701000000") Тогда
		Возврат ПечатьСчетФактуры2021(ТабДокумент);
	КонецЕсли;
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаТабличнойЧасти=ЭтотОбъект.Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	
	ЕстьМежценоваяРазница = Ложь;
	СтарыйМакет = Ложь;
	НовыйМакет = Ложь;
	ВыводитьКодВидаТовара = Ложь;
	Если Дата<Дата("20060601000000") Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура_2006_06_01");
		СтарыйМакет = Истина;
	ИначеЕсли Дата>Дата("20120124000000") Тогда
		Макет = ПолучитьОбщийМакет("СчетФактура_24_01_2012");
		НовыйМакет = Истина;
		ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
		ВыводитьКодВидаТовара = (ЭтотОбъект.Дата >= Дата('20171001'));
	Иначе
		Макет = ПолучитьОбщийМакет("СчетФактура");
	КонецЕсли;
	Если ТипЗнч(КешСебестоимостиАвтомобилейКупленныхУФизЛица) = Тип("ТаблицаЗначений") Тогда
		СтрокиБезСебестоимости = КешСебестоимостиАвтомобилейКупленныхУФизЛица.НайтиСтроки(Новый Структура("Себестоимость", 0));
		Если НЕ СтрокиБезСебестоимости.Количество() = КешСебестоимостиАвтомобилейКупленныхУФизЛица.Количество() Тогда
			ЕстьМежценоваяРазница = Истина;
		КонецЕсли;
	Иначе
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТоваров);
			Если Себестоимость > 0 Тогда
				ЕстьМежценоваяРазница = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВыводитьКодТНВЭД = обПраво("ВыводитьКодТНВЭД");
	
	Если НЕ СтарыйМакет И НЕ НовыйМакет Тогда
		ОбластьНаимменованиеВалюты = Макет.Область("НаименованиеВалюты");
	КонецЕсли;
	ВставлятьНаменованиеВалюты = Ложь;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КоличествоСтрок = ВыборкаТабличнойЧасти.Количество();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Если ХозОперация = Справочники.ХозОперации.СчетФактураВыданный Тогда
		ТекстЗаголовкаОтчета    = "Счет-фактура № " + дкПолучитьНомерДляПечати(ЭтотОбъект) +" от " + Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
		ТекстЗаголовкаИзменения = "Исправление  № " + "----" +" от " + "----";
	Иначе
		ТекстЗаголовкаИзменения = "Исправление  № " + ?(ЗначениеЗаполнено(ЭтотОбъект.НомерИсправления), ЭтотОбъект.НомерИсправления, "----") +" от " + Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
		// найдем изначальную счет фактуру
		ДокументОсн = ДокументОснование;
		Пока ТипЗнч(ДокументОсн) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
			ДокументОсн = ДокументОсн.ДокументОснование;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОсн";
		Запрос.УстановитьПараметр("ДокументОсн",ДокументОсн);
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда 
			ТекстЗаголовкаОтчета    = "Счет-фактура № " + дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект()) +" от " + Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
		Иначе
			ТекстЗаголовкаОтчета = "Счет-фактура  № " + "----" +" от " + "----";
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.ТекстЗаголовка			  = ТекстЗаголовкаОтчета;
	Если НовыйМакет Тогда
		ОбластьМакета.Параметры.ТекстЗаголовкаИсправление = ТекстЗаголовкаИзменения;
	КонецЕсли;
	ОбластьМакета.Параметры.Поставщик				= ЭтотОбъект.Организация;
	ОбластьМакета.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,Новый Структура("Наименование","Продавец: "));
	ОбластьМакета.Параметры.АдресПоставщика	= спПолучитьПредставление(ЭтотОбъект.ПодразделениеКомпании,Новый Структура("АдресЮридический","Адрес: "));
	Если НовыйМакет Тогда
		ОбластьМакета.Параметры.ВалютаШапка = "Валюта: наименование, код "+ ?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) + ", " + ВалютаПечатногоДокумента.Код;
	КонецЕсли;
	КПП = спПолучитьКППДляПечати(Организация, ПодразделениеКомпании);
	ОбластьМакета.Параметры.ИННпоставщика	 = "ИНН/КПП продавца: " + ОбластьМакета.Параметры.Поставщик.ИНН + "/" + КПП;
	ОбластьМакета.Параметры.Грузоотправитель = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.ПодразделениеКомпании);
	Если ТипЗнч(ОбластьМакета.Параметры.Грузоотправитель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		ОргДляСравнения=ОбластьМакета.Параметры.Грузоотправитель.Организация;
	Иначе
		ОргДляСравнения=ОбластьМакета.Параметры.Грузоотправитель;
	КонецЕсли;
	Если ОргДляСравнения=ЭтотОбъект.Организация Тогда
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= "Грузоотправитель и его адрес: он же";
	Иначе
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,Новый Структура("Наименование,АдресФактический","Грузоотправитель и его адрес: ",""));
	КонецЕсли;
	
	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ГрузополучательДляПечати = ЭтотОбъект.Контрагент;
	Иначе
		ГрузополучательДляПечати = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Грузополучатель);
	КонецЕсли;
	ОбластьМакета.Параметры.Грузополучатель					= ГрузополучательДляПечати;
	ОбластьМакета.Параметры.ГрузополучательПредставление	= спПолучитьПредставление(ГрузополучательДляПечати,Новый Структура("Наименование,АдресФактический","Грузополучатель и его адрес: ",""));
	
	Если КоличествоСтрок>0 Тогда
		ЕстьТовары=Ложь;
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
				Если СтрокаТоваров.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
					ЕстьТовары=Истина; Прервать;
				КонецЕсли; 
			ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
				ЕстьТовары=Истина; Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьТовары Тогда
			ОбластьМакета.Параметры.ГрузоотправительПредставление="Грузоотправитель и его адрес: ----";
			ОбластьМакета.Параметры.ГрузополучательПредставление="Грузополучатель и его адрес: ----";
		КонецЕсли; 
	КонецЕсли; 
	
	ОбластьМакета.Параметры.ПредставлениеПоДокументу = "К платежно-расчетному документу: "+ПлатежноРасчетныеДокументы;
	// mikolv	
	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакета.Параметры.Покупатель				= ЭтотОбъект.Контрагент.ГоловнойКонтрагент;	
	Иначе
		ОбластьМакета.Параметры.Покупатель				= ЭтотОбъект.Контрагент;	
	КонецЕсли;

	ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("Наименование","Покупатель: "));
	
	ОбластьМакета.Параметры.АдресПокупателя	= спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("АдресЮридический","Адрес: "));
	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ИННПокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.ГоловнойКонтрагент.ИНН), ЭтотОбъект.Контрагент.ГоловнойКонтрагент.ИНН, "--");
		КПППокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.КПП), ЭтотОбъект.Контрагент.КПП, "--");
	Иначе
		ИННПокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.ИНН), ЭтотОбъект.Контрагент.ИНН, "--");
		Если ЗначениеЗаполнено(ГрузополучательДляПечати) И ГрузополучательДляПечати.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			КПППокупателя = ?(ЗначениеЗаполнено(ГрузополучательДляПечати.КПП), ГрузополучательДляПечати.КПП, "--");
		Иначе
			КПППокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.КПП), ЭтотОбъект.Контрагент.КПП, "--");
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННПокупателя	= "ИНН/КПП покупателя: " + ИННПокупателя+"/"+КПППокупателя;
	
	// если дата документа позднее 01.07.2017
	Если ВыводитьКодВидаТовара И НовыйМакет Тогда
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
	ИначеЕсли ЭтотОбъект.Дата >= Дата('20170701') Тогда
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// если дата документа позднее 01.07.2017
	Если ЭтотОбъект.Дата >= Дата('20170701') Тогда
		ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
		ЗаголовокИдентификатораГосударственногоКонтракта = "Идентификатор государственного контракта, договора (соглашения)" + ?(ВыводитьКодВидаТовара, " (при наличии)", "")+": ";
		ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = ЗаголовокИдентификатораГосударственногоКонтракта + ЭтотОбъект.ИдентификаторГосударственногоКонтракта;
		ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
	КонецЕсли;
	
	
	Если ЕстьМежценоваяРазница И НЕ СтарыйМакет И НЕ НовыйМакет Тогда
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицыМежценоваяРазница");
	Иначе
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	КонецЕсли;
	
	// вставить выкусывание области наименование номенклатуры
	Если НЕ ВставлятьНаменованиеВалюты  И НЕ СтарыйМакет И НЕ НовыйМакет Тогда
		НовыйТекст = ОбластьШапкаТаблицы.Область(3,ОбластьНаимменованиеВалюты.Право+1,3,ОбластьНаимменованиеВалюты.Право+5).Текст;
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(3,ОбластьНаимменованиеВалюты.Лево,3,ОбластьНаимменованиеВалюты.Право+5);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Текст = НовыйТекст;
		
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(4,ОбластьНаимменованиеВалюты.Лево,4,ОбластьНаимменованиеВалюты.Право+5);
		ОбластьВыреза.Объединить();
		
		//перенумеруем колонки
		ОбластьШапкаТаблицы.Область(4,35,4,42).Текст = "5";
		ОбластьШапкаТаблицы.Область(4,43,4,46).Текст = "6";
		ОбластьШапкаТаблицы.Область(4,47,4,51).Текст = "7";
		ОбластьШапкаТаблицы.Область(4,52,4,56).Текст = "8";
		ОбластьШапкаТаблицы.Область(4,57,4,65).Текст = "9";
		ОбластьШапкаТаблицы.Область(4,66,4,71).Текст = "10";
		ОбластьШапкаТаблицы.Область(4,72,4,81).Текст = "11";
	КонецЕсли;
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара И НовыйМакет Тогда
		
		НовыйТекст = ОбластьШапкаТаблицы.Область(2,ОбластьКодВидаТовара.Лево-11,3,ОбластьКодВидаТовара.Лево-1).Текст;
		
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(2,ОбластьКодВидаТовара.Лево-11,3,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Текст = НовыйТекст;
		
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(4,ОбластьКодВидаТовара.Лево-11,4,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		
		ОбластьШапкаТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Номер таможенной декларации";
		
	ИначеЕсли НовыйМакет Тогда
		
		ОбластьШапкаТаблицы.Параметры.ТекстНомерТаможеннойДекларации = "Регистрационный номер таможенной декларации";
		
	КонецЕсли;
	
	Если НЕ НовыйМакет Тогда
		ОбластьШапкаТаблицы.Параметры.Валюта = ВалютаПечатногоДокумента;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("Сумма, СуммаНДС, СуммаВсего", 0, 0, 0);
	СтруктураОбщихИтогов = Новый Структура("Сумма, СуммаНДС, СуммаВсего", 0, 0, 0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовкаОтчета;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы	 = "Страница: " + НомерСтраницы; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	// вставить выкусывание области наименование валюты
	Если НЕ ВставлятьНаменованиеВалюты И НЕ СтарыйМакет И НЕ НовыйМакет Тогда
		НовыйПараметр = ОбластьМакета.Область(1,ОбластьНаимменованиеВалюты.Право+1,1,ОбластьНаимменованиеВалюты.Право+5).Параметр;
		ОбластьВыреза = ОбластьМакета.Область(1,ОбластьНаимменованиеВалюты.Лево,1,ОбластьНаимменованиеВалюты.Право+5);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Параметр = НовыйПараметр;
		//ОбластьМакета.УдалитьОбласть(ОбластьВыреза, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара И НовыйМакет Тогда
		НовыйПараметр = ОбластьМакета.Область(1,ОбластьКодВидаТовара.Лево-11,1,ОбластьКодВидаТовара.Лево-1).Параметр;
		ОбластьВыреза = ОбластьМакета.Область(1,ОбластьКодВидаТовара.Лево-11,1,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Параметр = НовыйПараметр;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьИтого);
	
	Ном=1;
	СуммаВсегоБезНДС = 0;
	ЕдиницаИзмеренияАвтоработВПечатныхФормах = ЭтотОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
	Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
		
		Если СтрокаТоваров.Номенклатура=Справочники.Номенклатура.Предоплата Или СтрокаТоваров.Номенклатура=Справочники.Номенклатура.КомиссионноеВознаграждение Тогда
			ЗаполнитьПрочерки = Истина;
		Иначе
			ЗаполнитьПрочерки = Ложь;
		КонецЕсли;
		
		Себестоимость = 0;
		Если ЕстьМежценоваяРазница Тогда
			Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТоваров);
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТоваров);
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.Количество = "--";	
		Иначе
			ОбластьМакета.Параметры.Количество = Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		КонецЕсли;
		Если ВставлятьНаменованиеВалюты Тогда
			ОбластьМакета.Параметры.НаименованиеВалюты = ?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование);
		КонецЕсли;
		Наименование = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
		Если ЭтотОбъект.Дата >= Дата(2016, 07, 01) И ЭтотОбъект.Дата < Дата(2017, 10, 01) Тогда
			Попытка
				Если СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС И СокрЛП(СтрокаТоваров.Номенклатура.КодТНВЭД) <> "" Тогда
					Наименование = Наименование + НСтр("ru=', код ТН ВЭД '") + СтрокаТоваров.Номенклатура.КодТНВЭД;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ОбластьМакета.Параметры.ТоварНаименование	= Наименование;
		Если НЕ СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда    
			ОбластьМакета.Параметры.ТоварНаименование = ОбластьМакета.Параметры.ТоварНаименование + ", " + СтрокаТоваров.ХарактеристикаНоменклатуры;	       
		КонецЕсли;
		КоличествоТовара = СтрокаТоваров.Количество;
		Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
			Если НовыйМакет Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = СтрокаТоваров.ЕдиницаИзмерения.Код;
				Если ВыводитьКодВидаТовара Тогда
					КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						ОбластьМакета.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") Тогда
			Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
				КоличествоТовара = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
				ОбластьМакета.Параметры.Количество = КоличествоТовара;
				ОбластьМакета.Параметры.ЕдиницаИзмерения = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
				Если НовыйМакет Тогда
					Если ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас Тогда
						ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "365";
					Иначе
						ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
					КонецЕсли;
					Если ВыводитьКодВидаТовара Тогда
						ОбластьМакета.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КоличествоТовара = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
				ОбластьМакета.Параметры.Количество = КоличествоТовара;
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "ч";
				Если НовыйМакет Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "356";
					Если ВыводитьКодВидаТовара Тогда
						ОбластьМакета.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ЗаполнитьПрочерки Тогда 
			ОбластьМакета.Параметры.Количество = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмерения = "--";
			Если НовыйМакет Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
				Если ВыводитьКодВидаТовара Тогда
					ОбластьМакета.Параметры.КодВидаТовара = "--";
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НовыйМакет Тогда
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
				Если СтрокаТоваров.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				Иначе
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
				КонецЕсли;
			КонецЕсли;
			Если ВыводитьКодВидаТовара Тогда
				КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
				Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
					ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
				Иначе
					ОбластьМакета.Параметры.КодВидаТовара = "--";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.СтавкаНДС = Строка(СтрокаТоваров.СтавкаНДС.Ставка) +"/" + Строка(СтрокаТоваров.СтавкаНДС.Ставка + 100);
		Иначе
			ОбластьМакета.Параметры.СтавкаНДС			= дкПолучитьПредставлениеСтавкиНДС(СтрокаТоваров.СтавкаНДС,"%");
		КонецЕсли;
		
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.ПредставлениеГТД = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны = "--";
			Если НовыйМакет Тогда
				ОбластьМакета.Параметры.ПредставлениеСтраныКод = "--";
			КонецЕсли;
		ИначеЕсли обЗначениеНеЗаполнено(СтрокаТоваров.ГТД) Тогда
			ОбластьМакета.Параметры.ПредставлениеГТД	= "-----";
			ОбластьМакета.Параметры.ПредставлениеСтраны	= "-----";
			Если НовыйМакет Тогда
				ОбластьМакета.Параметры.ПредставлениеСтраныКод = "-----";
			КонецЕсли;
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГТД	= спПолучитьНаименование(СтрокаТоваров.ГТД);
			ОбластьМакета.Параметры.ПредставлениеСтраны	= СтрокаТоваров.ГТД.Страна.Наименование;
			Если НовыйМакет Тогда
				ОбластьМакета.Параметры.ПредставлениеСтраныКод = СтрокаТоваров.ГТД.Страна.Код;
			КонецЕсли;
		КонецЕсли;
		
		СуммаБезНДС=СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС;
		ЦенаБезНДС=СуммаБезНДС/КоличествоТовара;
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.Сумма = "--";
			ОбластьМакета.Параметры.Цена = "--";
			//СуммаВсегоБезНДС = "--";
			ОбластьМакета.Параметры.Акциз = "--";
		Иначе
			ОбластьМакета.Параметры.Сумма = Формат(СуммаБезНДС,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.Цена = Формат(ЦенаБезНДС ,ФорматВыводаСуммы);
			СуммаВсегоБезНДС = СуммаБезНДС + СуммаВсегоБезНДС;
			ОбластьМакета.Параметры.Акциз = "без акциза";
		КонецЕсли;
		ОбластьМакета.Параметры.СуммаНДС = ?(СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС,"Без НДС",Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы));
		ОбластьМакета.Параметры.СуммаВсего = Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);
		
		Если Себестоимость > 0 Тогда
			ОбластьМакета.Параметры.ТоварНаименование = "Межценовая разница " + ОбластьМакета.Параметры.ТоварНаименование;
			ОбластьМакета.Параметры.Сумма = Формат(СтрокаТоваров.СуммаВсего - Себестоимость, ФорматВыводаСуммы);
			ТекстСтавкаНДС = СокрЛП(СтрокаТоваров.СтавкаНДС.Ставка);
			Если Найти(ТекстСтавкаНДС, "/") = 0 Тогда
				ОбластьМакета.Параметры.СтавкаНДС = ТекстСтавкаНДС + "/1" + ТекстСтавкаНДС + "%";
			КонецЕсли;
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
		НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(КоличествоСтрок=Ном, мсвДопОбластиПодвала, Неопределено));
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураОбщихИтогов.Сумма = СтруктураОбщихИтогов.Сумма + СтруктураИтоговПоСтранице.Сумма;
			СтруктураОбщихИтогов.СуммаНДС = СтруктураОбщихИтогов.СуммаНДС + СтруктураИтоговПоСтранице.СуммаНДС;
			СтруктураОбщихИтогов.СуммаВсего = СтруктураОбщихИтогов.СуммаВсего + СтруктураИтоговПоСтранице.СуммаВсего;
			СтруктураИтоговПоСтранице = Новый Структура("Сумма, СуммаНДС,СуммаВсего",0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТоваров, СтруктураИтоговПоСтранице);
		СтруктураИтоговПоСтранице.Сумма = СтруктураИтоговПоСтранице.Сумма - СтрокаТоваров.Сумма + ?(Себестоимость > 0, СтрокаТоваров.Сумма - Себестоимость, СуммаБезНДС);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	СтруктураОбщихИтогов.Сумма = СтруктураОбщихИтогов.Сумма + СтруктураИтоговПоСтранице.Сумма;
	СтруктураОбщихИтогов.СуммаНДС = СтруктураОбщихИтогов.СуммаНДС + СтруктураИтоговПоСтранице.СуммаНДС;
	СтруктураОбщихИтогов.СуммаВсего = СтруктураОбщихИтогов.СуммаВсего + СтруктураИтоговПоСтранице.СуммаВсего;

	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтогоПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
	
	Если НовыйМакет Тогда
		ОбластьИтого.Параметры.ИтогоСумма	= Формат(СтруктураОбщихИтогов.Сумма,ФорматВыводаСуммы);
	КонецЕсли;
	ОбластьИтого.Параметры.ИтогоСуммаНДС	= Формат(СтруктураОбщихИтогов.СуммаНДС,ФорматВыводаСуммы);
	ОбластьИтого.Параметры.ИтогоВсего		= Формат(СтруктураОбщихИтогов.СуммаВсего,ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	КонецЕсли;
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьПодвал.Параметры.ФИОПБОЮЛ=Руководитель.РуководительПредставление;
		ОбластьПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(Организация,Перечисления.ВидыДокументов.Свидетельство);
	КонецЕсли; 
	
	Если НовыйМакет Тогда
		ОбластьПодвал.Параметры.ТекстИндивидуальныйПредприниматель = ?(ВыводитьКодВидаТовара, "Индивидуальный предприниматель или иное уполномоченное лицо", "Индивидуальный предприниматель");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСчетФактура()

Функция ПечатьСчетФактуры2021(ТабДокумент)
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаТабличнойЧасти=ЭтотОбъект.Товары.Выгрузить();
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	
	ЕстьМежценоваяРазница = Ложь;
	ЕстьПрослеживаемыйТовар = Ложь;
	ЕстьСтоимостьТовараПрослеживания = Ложь;
	
	// Проверим, что есть РНПТ в документе
	Для Каждого ТекущаяСтрока Из ВыборкаТабличнойЧасти Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.ГТД) И ТекущаяСтрока.ГТД.РНПТ Тогда
			ЕстьПрослеживаемыйТовар = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Определим макет
	Если ЕстьПрослеживаемыйТовар Тогда
		Если Дата >= Дата('20231001') Тогда
			ЕстьСтоимостьТовараПрослеживания = Истина;
			ИмяМакета = "СчетФактура_01_10_2023_Прослеж";
		Иначе
			ИмяМакета = "СчетФактура_02_04_2021_Прослеж";
		КонецЕсли;
		Макет = ПолучитьОбщийМакет(ИмяМакета);
	Иначе
		
		//Бизтех_СнимченкоАА 12.01.2026--
		Если Дата >= Дата('20260101') Тогда
			Макет = ПолучитьОбщийМакет("СчетФактура_02_04_2021_2026");
		Иначе
			Макет = ПолучитьОбщийМакет("СчетФактура_02_04_2021");
		КонецЕсли;	
		//Бизтех_СнимченкоАА 12.01.2026++
		
	КонецЕсли;

	Если Дата >= Дата('20241001')
		ИЛИ (Исправление И ДатаИсходногоДокумента >= Дата('20241001')) Тогда
		НомерРедакции = 1096;
	Иначе
		НомерРедакции = 534;
	КонецЕсли;
	
	Если ТипЗнч(КешСебестоимостиАвтомобилейКупленныхУФизЛица) = Тип("ТаблицаЗначений") Тогда
		СтрокиБезСебестоимости = КешСебестоимостиАвтомобилейКупленныхУФизЛица.НайтиСтроки(Новый Структура("Себестоимость", 0));
		Если НЕ СтрокиБезСебестоимости.Количество() = КешСебестоимостиАвтомобилейКупленныхУФизЛица.Количество() Тогда
			ЕстьМежценоваяРазница = Истина;
		КонецЕсли;
	Иначе
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТоваров);
			Если Себестоимость > 0 Тогда
				ЕстьМежценоваяРазница = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ВыводитьКодТНВЭД = обПраво("ВыводитьКодТНВЭД");
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	КоличествоСтрок = ВыборкаТабличнойЧасти.Количество();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	Если НомерРедакции = 1096 Тогда 
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 16 августа 2024 г. № 1096)'");
	Иначе 
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 2 апреля 2021 г. № 534)'");
	КонецЕсли;
	
	Если ХозОперация = Справочники.ХозОперации.СчетФактураВыданный Тогда
		ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ЭтотОбъект);
		ОбластьМакета.Параметры.Дата = Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
		ОбластьМакета.Параметры.НомерИсправления = "----";
		ОбластьМакета.Параметры.ДатаИсправления = "----";
		ТекстЗаголовкаОтчета = "Счет-фактура № " + дкПолучитьНомерДляПечати(ЭтотОбъект) +" от " + Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
	Иначе
		ОбластьМакета.Параметры.НомерИсправления = ?(ЗначениеЗаполнено(ЭтотОбъект.НомерИсправления), ЭтотОбъект.НомерИсправления, "----");
		ОбластьМакета.Параметры.ДатаИсправления = Формат(ЭтотОбъект.Дата, "ДФ=""дд ММММ гггг""");
		
		// найдем изначальную счет фактуру
		ДокументОсн = ДокументОснование;
		Пока ТипЗнч(ДокументОсн) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
			ДокументОсн = ДокументОсн.ДокументОснование;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОсн";
		Запрос.УстановитьПараметр("ДокументОсн",ДокументОсн);
		ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		
		Если ВыборкаЗапроса.Следующий() Тогда 
			ОбластьМакета.Параметры.Номер = дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект());
			ОбластьМакета.Параметры.Дата = Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
			ТекстЗаголовкаОтчета    = "Счет-фактура № " + дкПолучитьНомерДляПечати(ВыборкаЗапроса.Ссылка.ПолучитьОбъект()) +" от " + Формат(ВыборкаЗапроса.Ссылка.Дата, "ДФ=""дд ММММ гггг""");
		Иначе
			ОбластьМакета.Параметры.Номер = "----";
			ОбластьМакета.Параметры.Дата = "----";
			ТекстЗаголовкаОтчета = "Счет-фактура  № " + "----" +" от " + "----";
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.Поставщик				= ЭтотОбъект.Организация;
	ОбластьМакета.Параметры.ПредставлениеПоставщика	= спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,Новый Структура("Наименование", ""));
	ОбластьМакета.Параметры.АдресПоставщика	= спПолучитьПредставление(ЭтотОбъект.ПодразделениеКомпании,Новый Структура("АдресЮридический",""));
	ОбластьМакета.Параметры.ВалютаШапка = ?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) + ", " + ВалютаПечатногоДокумента.Код;
	КПП = спПолучитьКППДляПечати(Организация, ПодразделениеКомпании);
	ОбластьМакета.Параметры.ИННпоставщика	 = ОбластьМакета.Параметры.Поставщик.ИНН + "/" + КПП;
	ОбластьМакета.Параметры.Грузоотправитель = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузоотправитель",ЭтотОбъект.ПодразделениеКомпании);
	Если ТипЗнч(ОбластьМакета.Параметры.Грузоотправитель)=Тип("СправочникСсылка.ПодразделенияКомпании") Тогда
		ОргДляСравнения=ОбластьМакета.Параметры.Грузоотправитель.Организация;
	Иначе
		ОргДляСравнения=ОбластьМакета.Параметры.Грузоотправитель;
	КонецЕсли;
	Если ОргДляСравнения=ЭтотОбъект.Организация Тогда
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= "он же";
	Иначе
		ОбластьМакета.Параметры.ГрузоотправительПредставление	= спПолучитьПредставление(ОбластьМакета.Параметры.Грузоотправитель,Новый Структура("Наименование,АдресФактический","",""));
	КонецЕсли;
	
	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ГрузополучательДляПечати = Контрагент;
	Иначе
		ГрузополучательДляПечати = обПолучитьЗначениеСвойства(ЭтотОбъект,"Грузополучатель",ЭтотОбъект.Грузополучатель);
	КонецЕсли;
	ОбластьМакета.Параметры.Грузополучатель					= ГрузополучательДляПечати;
	ОбластьМакета.Параметры.ГрузополучательПредставление	= спПолучитьПредставление(ГрузополучательДляПечати,Новый Структура("Наименование,АдресФактический","",""));
	
	Если КоличествоСтрок>0 Тогда
		ЕстьТовары=Ложь;
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
				Если СтрокаТоваров.Номенклатура.ВидНоменклатуры<>Перечисления.ВидыНоменклатуры.Услуга Тогда
					ЕстьТовары=Истина; Прервать;
				КонецЕсли; 
			ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
				ЕстьТовары=Истина; Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьТовары Тогда
			ОбластьМакета.Параметры.ГрузоотправительПредставление="----";
			ОбластьМакета.Параметры.ГрузополучательПредставление="----";
		КонецЕсли; 
	КонецЕсли; 
	
	ОбластьМакета.Параметры.ПредставлениеПоДокументу = ПлатежноРасчетныеДокументы;
	
	Если ТипЗнч(ЭтотОбъект.ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		ДатаДокументаОтгрузки = ?(обЗначениеНеЗаполнено(ЭтотОбъект.ДокументОснование.ДатаЗакрытия), ЭтотОбъект.ДокументОснование.Дата, ЭтотОбъект.ДокументОснование.ДатаЗакрытия);
	Иначе
		ДатаДокументаОтгрузки = ЭтотОбъект.ДокументОснование.Дата;
	КонецЕсли;
	
	Если НЕ ЭтоАвансовыйСчетФактура() Тогда

		НомераСтрок = "";
		НаименованиеДокумента = "";
		
		Если НомерРедакции = 1096 Тогда 

			ШаблонПодстрокиДокументаОбОтгрузке = "%1, № %2 от %3 г.";
			НаименованиеДокумента = Документы.СчетФактураВыданный.ПолучитьНаименованиеДокументаОтгрузки(Ложь, ВыборкаТабличнойЧасти);

		Иначе

			ШаблонПодстрокиДокументаОбОтгрузке = "№ п/п %1 № %2 от %3 г.";
			Если ВыборкаТабличнойЧасти.Количество() = 1  Тогда
				НомераСтрок = "1";
			Иначе 
				НомераСтрок = "1 - " + Строка(ВыборкаТабличнойЧасти.Количество());
			КонецЕсли;

		КонецЕсли;

		НомерДокументаОтгрузки = дкПолучитьНомерДляПечати(ДокументОснование);
		
		ОбластьМакета.Параметры.ДокументыОбОтгрузке = СтрШаблон(ШаблонПодстрокиДокументаОбОтгрузке,
			?(НомерРедакции = 1096, НаименованиеДокумента, НомераСтрок),
			?(ЗначениеЗаполнено(НомерДокументаОтгрузки), НомерДокументаОтгрузки, "      "),
			?(ЗначениеЗаполнено(ДатаДокументаОтгрузки), ДатаДокументаОтгрузки, "      "));

	КонецЕсли;

	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакета.Параметры.Покупатель				= ЭтотОбъект.Контрагент.ГоловнойКонтрагент;	
	Иначе
		ОбластьМакета.Параметры.Покупатель				= ЭтотОбъект.Контрагент;	
	КонецЕсли;

	ОбластьМакета.Параметры.ПредставлениеПокупателя = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("Наименование", ""));
	
	ОбластьМакета.Параметры.АдресПокупателя	= спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("АдресЮридический", ""));
	Если ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ИННПокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.ГоловнойКонтрагент.ИНН), ЭтотОбъект.Контрагент.ГоловнойКонтрагент.ИНН, "--");
		КПППокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.КПП), ЭтотОбъект.Контрагент.КПП, "--");
	Иначе
		ИННПокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.ИНН), ЭтотОбъект.Контрагент.ИНН, "--");
		Если ЗначениеЗаполнено(ГрузополучательДляПечати) И ГрузополучательДляПечати.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
			КПППокупателя = ?(ЗначениеЗаполнено(ГрузополучательДляПечати.КПП), ГрузополучательДляПечати.КПП, "--");
		Иначе
			КПППокупателя = ?(ЗначениеЗаполнено(ЭтотОбъект.Контрагент.КПП), ЭтотОбъект.Контрагент.КПП, "--");
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.ИННПокупателя	= ИННПокупателя+"/"+КПППокупателя;
	
	ОбластьМакета.Параметры.ИдентификаторГосударственногоКонтракта = ИдентификаторГосударственногоКонтракта;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");

	Если ЕстьСтоимостьТовараПрослеживания Тогда 
		Если НомерРедакции = 1096 Тогда 
			ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога на добавленную стоимость, в рублях'");
		Иначе 
			ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога'");
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("Сумма, СуммаНДС, СуммаВсего", 0, 0, 0);
	СтруктураОбщихИтогов = Новый Структура("Сумма, СуммаНДС, СуммаВсего", 0, 0, 0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовкаОтчета;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы	 = "Страница: " + НомерСтраницы; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьИтого);
	
	Если ЕстьПрослеживаемыйТовар Тогда
		ТаблицаРНПТ = ТаблицаДвиженийПоГТД(ДокументОснование);
		ТаблицаРНПТ.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ГТД", "Количество");
	Иначе
		ТаблицаРНПТ = Неопределено;
	КонецЕсли;
	
	Ном=1;
	СуммаВсегоБезНДС = 0;
	ЕдиницаИзмеренияАвтоработВПечатныхФормах = ЭтотОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
	Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
		
		Если СтрокаТоваров.Номенклатура=Справочники.Номенклатура.Предоплата Или СтрокаТоваров.Номенклатура=Справочники.Номенклатура.КомиссионноеВознаграждение Тогда
			ЗаполнитьПрочерки = Истина;
		Иначе
			ЗаполнитьПрочерки = Ложь;
		КонецЕсли;
		
		Себестоимость = 0;
		Если ЕстьМежценоваяРазница Тогда
			Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТоваров);
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТоваров);
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.Количество = "--";	
		Иначе
			ОбластьМакета.Параметры.Количество = Формат(СтрокаТоваров.Количество,ФорматВыводаКоличества);
		КонецЕсли;
		Наименование = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
		ОбластьМакета.Параметры.ТоварНаименование	= Наименование;
		Если НЕ СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда    
			ОбластьМакета.Параметры.ТоварНаименование = ОбластьМакета.Параметры.ТоварНаименование + ", " + СтрокаТоваров.ХарактеристикаНоменклатуры;	       
		КонецЕсли;
		КоличествоТовара = СтрокаТоваров.Количество;
		Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = СтрокаТоваров.ЕдиницаИзмерения.Код;
			КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
			Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
				ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
			Иначе
				ОбластьМакета.Параметры.КодВидаТовара = "--";
			КонецЕсли
		ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") Тогда
			Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автоработы") Тогда
				КоличествоТовара = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
				ОбластьМакета.Параметры.Количество = КоличествоТовара;
				ОбластьМакета.Параметры.ЕдиницаИзмерения = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
				Если ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "365";
				Иначе
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
				КонецЕсли;
				ОбластьМакета.Параметры.КодВидаТовара = "--";
			Иначе
				КоличествоТовара = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
				ОбластьМакета.Параметры.Количество = КоличествоТовара;
				ОбластьМакета.Параметры.ЕдиницаИзмерения = "ч";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "356";
				ОбластьМакета.Параметры.КодВидаТовара = "--";
			КонецЕсли;
		ИначеЕсли ЗаполнитьПрочерки Тогда 
			ОбластьМакета.Параметры.Количество = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмерения = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			ОбластьМакета.Параметры.КодВидаТовара = "--";
		Иначе
			Если НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
				Если СтрокаТоваров.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				Иначе
					ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
				КонецЕсли;
			КонецЕсли;
			КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
			Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
				ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
			Иначе
				ОбластьМакета.Параметры.КодВидаТовара = "--";
			КонецЕсли;
		КонецЕсли;
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.СтавкаНДС = Строка(СтрокаТоваров.СтавкаНДС.Ставка) +"/" + Строка(СтрокаТоваров.СтавкаНДС.Ставка + 100);
		Иначе
			ОбластьМакета.Параметры.СтавкаНДС			= дкПолучитьПредставлениеСтавкиНДС(СтрокаТоваров.СтавкаНДС,"%");
		КонецЕсли;
		
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.ПредставлениеГТД = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраны = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраныКод = "--";
		ИначеЕсли обЗначениеНеЗаполнено(СтрокаТоваров.ГТД) Тогда
			ОбластьМакета.Параметры.ПредставлениеГТД	= "-----";
			ОбластьМакета.Параметры.ПредставлениеСтраны	= "-----";
			ОбластьМакета.Параметры.ПредставлениеСтраныКод = "-----";
		Иначе
			ОбластьМакета.Параметры.ПредставлениеГТД	= спПолучитьНаименование(СтрокаТоваров.ГТД);
			ОбластьМакета.Параметры.ПредставлениеСтраны	= СтрокаТоваров.ГТД.Страна.Наименование;
			ОбластьМакета.Параметры.ПредставлениеСтраныКод = СтрокаТоваров.ГТД.Страна.Код;
		КонецЕсли;
		
		СуммаБезНДС=СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС;
		ЦенаБезНДС=СуммаБезНДС/КоличествоТовара;
		Если ЗаполнитьПрочерки Тогда
			ОбластьМакета.Параметры.Сумма = "--";
			ОбластьМакета.Параметры.Цена = "--";
			ОбластьМакета.Параметры.Акциз = "--";
		Иначе
			ОбластьМакета.Параметры.Сумма = Формат(СуммаБезНДС,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.Цена = Формат(ЦенаБезНДС ,ФорматВыводаСуммы);
			СуммаВсегоБезНДС = СуммаБезНДС + СуммаВсегоБезНДС;
			ОбластьМакета.Параметры.Акциз = "без акциза";
		КонецЕсли;
		ОбластьМакета.Параметры.СуммаНДС = ?(СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС,"Без НДС",Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы));
		ОбластьМакета.Параметры.СуммаВсего = Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);
		
		Если Себестоимость > 0 Тогда
			ОбластьМакета.Параметры.ТоварНаименование = "Межценовая разница " + ОбластьМакета.Параметры.ТоварНаименование;
			ОбластьМакета.Параметры.Сумма = Формат(СтрокаТоваров.СуммаВсего - Себестоимость, ФорматВыводаСуммы);
			ТекстСтавкаНДС = СокрЛП(СтрокаТоваров.СтавкаНДС.Ставка);
			Если Найти(ТекстСтавкаНДС, "/") = 0 Тогда
				ОбластьМакета.Параметры.СтавкаНДС = ТекстСтавкаНДС + "/1" + ТекстСтавкаНДС + "%";
			КонецЕсли;
		КонецЕсли;
		
		// Получим Количество прослеживаемого товара в единицах прослеживаемости
		Если ЕстьПрослеживаемыйТовар Тогда
			
			Если ЗначениеЗаполнено(СтрокаТоваров.ГТД) И СтрокаТоваров.ГТД.РНПТ Тогда
				Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура")
					И ТаблицаРНПТ <> Неопределено Тогда
					СтруктураПоиска = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД");
					ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТоваров);
					СрокиРНПТ = ТаблицаРНПТ.НайтиСтроки(СтруктураПоиска);
					Если СрокиРНПТ.Количество() > 0 Тогда
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКод = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Код;
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослеж = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
						ОбластьМакета.Параметры.КоличествоПрослеж =СрокиРНПТ[0].Количество;
					Иначе
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКод = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Код;
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослеж = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
						ОбластьМакета.Параметры.КоличествоПрослеж = Окр(СтрокаТоваров.Количество * СтрокаТоваров.Коэффициент, 3);
					КонецЕсли;
					Если ЕстьСтоимостьТовараПрослеживания Тогда 
						ОбластьМакета.Параметры.СтоимПрослеж = СуммаБезНДС;
					КонецЕсли;
				ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКод = "796";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослеж = "шт";
					ОбластьМакета.Параметры.КоличествоПрослеж = 1;
					Если ЕстьСтоимостьТовараПрослеживания Тогда 
						ОбластьМакета.Параметры.СтоимПрослеж = СуммаБезНДС;
					КонецЕсли;
				Иначе
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКод = "--";
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослеж = "--";
					ОбластьМакета.Параметры.КоличествоПрослеж = "--";
					Если ЕстьСтоимостьТовараПрослеживания Тогда 
						ОбластьМакета.Параметры.СтоимПрослеж = "----";
					КонецЕсли;
				КонецЕсли;
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКод = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослеж = "--";
				ОбластьМакета.Параметры.КоличествоПрослеж = "--";
				Если ЕстьСтоимостьТовараПрослеживания Тогда 
					ОбластьМакета.Параметры.СтоимПрослеж = "----";
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
		НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, ?(КоличествоСтрок=Ном, мсвДопОбластиПодвала, Неопределено));
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураОбщихИтогов.Сумма = СтруктураОбщихИтогов.Сумма + СтруктураИтоговПоСтранице.Сумма;
			СтруктураОбщихИтогов.СуммаНДС = СтруктураОбщихИтогов.СуммаНДС + СтруктураИтоговПоСтранице.СуммаНДС;
			СтруктураОбщихИтогов.СуммаВсего = СтруктураОбщихИтогов.СуммаВсего + СтруктураИтоговПоСтранице.СуммаВсего;
			СтруктураИтоговПоСтранице = Новый Структура("Сумма, СуммаНДС,СуммаВсего",0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТоваров, СтруктураИтоговПоСтранице);
		СтруктураИтоговПоСтранице.Сумма = СтруктураИтоговПоСтранице.Сумма - СтрокаТоваров.Сумма + ?(Себестоимость > 0, СтрокаТоваров.Сумма - Себестоимость, СуммаБезНДС);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	СтруктураОбщихИтогов.Сумма = СтруктураОбщихИтогов.Сумма + СтруктураИтоговПоСтранице.Сумма;
	СтруктураОбщихИтогов.СуммаНДС = СтруктураОбщихИтогов.СуммаНДС + СтруктураИтоговПоСтранице.СуммаНДС;
	СтруктураОбщихИтогов.СуммаВсего = СтруктураОбщихИтогов.СуммаВсего + СтруктураИтоговПоСтранице.СуммаВсего;

	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтогоПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
	
	ОбластьИтого.Параметры.ИтогоСумма	= Формат(СтруктураОбщихИтогов.Сумма,ФорматВыводаСуммы);
	ОбластьИтого.Параметры.ИтогоСуммаНДС	= Формат(СтруктураОбщихИтогов.СуммаНДС,ФорматВыводаСуммы);
	ОбластьИтого.Параметры.ИтогоВсего		= Формат(СтруктураОбщихИтогов.СуммаВсего,ФорматВыводаСуммы);
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	КонецЕсли;
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьПодвал.Параметры.ФИОПБОЮЛ=Руководитель.РуководительПредставление;
		
		//Бизтех_СнимченкоАА 11.01.2026--
		Если Дата >= Дата('20260101') Тогда
			ОбластьПодвал.Параметры.Свидетельство = "ОГРНИП " + Организация.ОГРН + " , дата регистрации "+Формат(Организация.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		Иначе
			ОбластьПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(Организация,Перечисления.ВидыДокументов.Свидетельство);
		КонецЕсли;
		//Бизтех_СнимченкоАА 11.01.2026++

	КонецЕсли; 
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьКорректировочныйСчетФактура(ТабДокумент) Экспорт
	
	Если Дата >= Дата("20210701000000") Тогда
		Возврат ПечатьКорректировочныйСчетФактура2021(ТабДокумент);
	КонецЕсли;

	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	Если СтрНайти(ФорматВыводаСуммы, "ЧН") = 0 Тогда 
		ФорматВыводаСуммы = ФорматВыводаСуммы + ";ЧН=0,00";
	КонецЕсли;
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	
	ВыводитьКодВидаТовара = (ЭтотОбъект.Дата >= Дата('20171001'));
	ВыводитьКодТНВЭД      = обПраво("ВыводитьКодТНВЭД");
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//
	ОбластьМакета.Параметры.НомерИсправленияКорректировочного = ?(обЗначениеНеЗаполнено(НомерИсправления),"--",НомерИсправления);
	ОбластьМакета.Параметры.ДатаИсправленияКорректировочного  = ?(обЗначениеНеЗаполнено(НомерИсправления),"--",Формат(Дата,"ДЛФ=DD"));
	Если ДокументОснование.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон
		ИЛИ ДокументОснование.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон Тогда
		
		ОбластьМакета.Параметры.Номер = ?(обЗначениеНеЗаполнено(НомерИсправляемогоКорректировочногоДокумента),дкПолучитьНомерДляПечати(ЭтотОбъект),дкПолучитьНомерДляПечати(ЭтотОбъект,,"НомерИсправляемогоКорректировочногоДокумента"));
		ОбластьМакета.Параметры.Дата  = Формат(?(обЗначениеНеЗаполнено(ДатаИсправляемогоКорректировочногоДокумента),Дата,ДатаИсправляемогоКорректировочногоДокумента),"ДЛФ=DD");
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = "--";
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.Номер = ?(обЗначениеНеЗаполнено(НомерИсправляемогоКорректировочногоДокумента),дкПолучитьНомерДляПечати(ЭтотОбъект),дкПолучитьНомерДляПечати(ЭтотОбъект,,"НомерИсправляемогоКорректировочногоДокумента"));
		ОбластьМакета.Параметры.Дата  = Формат(?(обЗначениеНеЗаполнено(ДатаИсправляемогоКорректировочногоДокумента),Дата,ДатаИсправляемогоКорректировочногоДокумента),"ДЛФ=DD");
	КонецЕсли;
	ОбластьМакета.Параметры.НомерСчетаФактуры = ?(обЗначениеНеЗаполнено(НомерИсходногоДокумента),"--",дкПолучитьНомерДляПечати(ЭтотОбъект,,"НомерИсходногоДокумента"));
	ОбластьМакета.Параметры.ДатаСчетаФактуры  = Формат(?(обЗначениеНеЗаполнено(ДатаИсходногоДокумента),"--",ДатаИсходногоДокумента),"ДЛФ=DD");
	ОбластьМакета.Параметры.НомерИсправления  = ?(обЗначениеНеЗаполнено(НомерИсправленияИсходногоДокумента),"--",НомерИсправленияИсходногоДокумента);
	ОбластьМакета.Параметры.ДатаИсправления   = Формат(?(обЗначениеНеЗаполнено(ДатаИсправленияИсходногоДокумента),"--",ДатаИсправленияИсходногоДокумента),"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Поставщик               = ЭтотОбъект.Организация;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,Новый Структура("Наименование",""));
	ОбластьМакета.Параметры.АдресПоставщика         = спПолучитьПредставление(ЭтотОбъект.ПодразделениеКомпании,Новый Структура("АдресЮридический"," "));
	
	ОбластьМакета.Параметры.ИННПоставщика = ЭтотОбъект.Организация.ИНН + "/" + спПолучитьКППДляПечати(Организация, ПодразделениеКомпании);
	// mikolv	
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакета.Параметры.Покупатель				= Контрагент.ГоловнойКонтрагент;	
	Иначе
		ОбластьМакета.Параметры.Покупатель				= Контрагент;	
	КонецЕсли;

	ОбластьМакета.Параметры.ПредставлениеПокупатель = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("Наименование",""));
	ОбластьМакета.Параметры.АдресПокупателя         = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,Новый Структура("АдресЮридический",""));
	ОбластьМакета.Параметры.ИННПокупателя           = ?(Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение, Контрагент.ГоловнойКонтрагент.ИНН, Контрагент.ИНН) + "/" + Контрагент.КПП;
	
	ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + 
		?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) 
		+ ", " + ВалютаПечатногоДокумента.Код;
	
	// если дата документа позднее 01.07.2017
	Если ВыводитьКодВидаТовара Тогда
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 19 августа 2017 № 981)'");
	ИначеЕсли ЭтотОбъект.Дата >= Дата('20170701') Тогда
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 25 мая 2017 г. № 625)'");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	// если дата документа позднее 01.07.2017
	Если ЭтотОбъект.Дата >= Дата('20170701') Тогда
		ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
		ЗаголовокИдентификатораГосударственногоКонтракта = "Идентификатор государственного контракта, договора (соглашения)" + ?(ВыводитьКодВидаТовара, " (при наличии)", "")+": ";
		ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта = ЗаголовокИдентификатораГосударственногоКонтракта + ЭтотОбъект.ИдентификаторГосударственногоКонтракта;
		ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);
	КонецЕсли;
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара Тогда
		
		ОбластьКодВидаТовара = Макет.Область("КодВидаТовара");
		НовыйТекст = ОбластьШапкаТаблицы.Область(1,ОбластьКодВидаТовара.Лево-4,3,ОбластьКодВидаТовара.Лево-1).Текст;
		
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(1,ОбластьКодВидаТовара.Лево-4,3,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		ОбластьВыреза.Текст = НовыйТекст;
		
		ОбластьВыреза = ОбластьШапкаТаблицы.Область(4,ОбластьКодВидаТовара.Лево-4,4,ОбластьКодВидаТовара.Право);
		ОбластьВыреза.Объединить();
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("Итого");
	СтруктураИтоговПоСтранице =
	Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);
	СтруктураИтоговПоСтраницеИтого =
	Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	// Уберем колонку, вывод которой утвержден с 1 октября 2017 г.
	Если НЕ ВыводитьКодВидаТовара Тогда
		ОбластьКодВидаТовара = Макет.Область("СтрокаКодВидаТовара");
		НомерСтроки = 1;
		Пока НомерСтроки < 5 Цикл
			ТекстЯчейки = ОбластьМакета.Область(НомерСтроки,ОбластьКодВидаТовара.Лево-4,НомерСтроки,ОбластьКодВидаТовара.Лево-1).Текст;
			ОбластьВыреза = ОбластьМакета.Область(НомерСтроки,ОбластьКодВидаТовара.Лево-4,НомерСтроки,ОбластьКодВидаТовара.Право);
			ОбластьВыреза.Объединить();
			ОбластьВыреза.Текст = ТекстЯчейки;
			НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьИтого);
	
	Ном=1;
	СуммаВсегоБезНал = 0;
	ВыборкаТабличнойЧасти = ПолучитьВыборку();
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
	ЕдиницаИзмеренияАвтоработВПечатныхФормах = ЭтотОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
	Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
		ОбластьМакета.Параметры.НаименованиеНоменклатуры = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
		Если СтрокаТоваров.Товар Тогда
			Если ТипЗнч(СтрокаТоваров.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод          = "796";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = "шт";
				Если ВыводитьКодВидаТовара Тогда
					КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						ОбластьМакета.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаТоваров.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод          = СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = СтрокаТоваров.ЕдиницаИзмерения;
				Если ВыводитьКодВидаТовара Тогда
					КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
					Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
						ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
					Иначе
						ОбластьМакета.Параметры.КодВидаТовара = "--";
					КонецЕсли;
				КонецЕсли;
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод          = "--";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = "--";
				Если ВыводитьКодВидаТовара Тогда
					ОбластьМакета.Параметры.КодВидаТовара = "--";
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
			Если ЕдиницаИзмеренияАвтоработВПечатныхФормах = Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "365";
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			КонецЕсли;
			Если ВыводитьКодВидаТовара Тогда
				ОбластьМакета.Параметры.КодВидаТовара = "--";
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТоваров.Товар Тогда
			ОбластьМакета.Параметры.КоличествоПослеИзменения = Формат(СтрокаТоваров.Количество, ?(СтрокаТоваров.Количество = 0, "ЧН=-", ФорматВыводаКоличества));
			ОбластьМакета.Параметры.КоличествоДоИзменения    = Формат(СтрокаТоваров.КоличествоПоДокументуРеализации,?(СтрокаТоваров.КоличествоПоДокументуРеализации = 0, "ЧН=-", ФорматВыводаКоличества));
		Иначе
			КоличествоПослеИзменения = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
			ОбластьМакета.Параметры.КоличествоПослеИзменения = Формат(КоличествоПослеИзменения,?(КоличествоПослеИзменения = 0, "ЧН=-", ФорматВыводаКоличества));
			КоличествоДоИзменения = СтрокаТоваров.КоличествоПоДокументуРеализации*СтрокаТоваров.КоэффициентПоДокументуРеализации;
			ОбластьМакета.Параметры.КоличествоДоИзменения    = Формат(КоличествоДоИзменения,?(КоличествоДоИзменения = 0, "ЧН=-", ФорматВыводаКоличества));
		КонецЕсли;
		ОбластьМакета.Параметры.СтавкаНДС = СтрокаТоваров.СтавкаНДС;
		
		ОбластьМакета.Параметры.СтоимостьСНДСДоИзменения    = Формат(СтрокаТоваров.СуммаВсегоПоДокументуРеализации,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаСНДСУвеличение       = Формат(?(СтрокаТоваров.СуммаВсегоРазница >0,СтрокаТоваров.СуммаВсегоРазница,0),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаСНДСУменьшение       = Формат(?(СтрокаТоваров.СуммаВсегоРазница <0,-СтрокаТоваров.СуммаВсегоРазница,0),ФорматВыводаСуммы);

		ОбластьМакета.Параметры.СуммаНДСДоИзменения     = Формат(СтрокаТоваров.СуммаНДСПоДокументуРеализации,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СуммаНДСПослеИзменения  = Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаНДСУвеличение    = Формат(?(СтрокаТоваров.СуммаНДСРазница >0,СтрокаТоваров.СуммаНДСРазница,0),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаНДСУменьшение    = Формат(?(СтрокаТоваров.СуммаНДСРазница <0,-СтрокаТоваров.СуммаНДСРазница,0),ФорматВыводаСуммы);
		
		ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения    = Формат((СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = Формат((СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС),ФорматВыводаСуммы);
		РазницаБезНДС = (СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)-(СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации);
		ОбластьМакета.Параметры.РазницаБезНДСУвеличение       = Формат(?(РазницаБезНДС >0,РазницаБезНДС,0),ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаБезНДСУменьшение       = Формат(?(РазницаБезНДС <0,-РазницаБезНДС,0),ФорматВыводаСуммы);
		
		Если СтрокаТоваров.Товар Тогда
			Если НЕ СтрокаТоваров.КоличествоПоДокументуРеализации = 0 Тогда
				ОбластьМакета.Параметры.ЦенаДоИзменения    = Формат((СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации)/СтрокаТоваров.КоличествоПоДокументуРеализации,ФорматВыводаСуммы);
			Иначе
				ОбластьМакета.Параметры.ЦенаДоИзменения    = "--";
			КонецЕсли;
			ЦенаПослеИзменения = ?(СтрокаТоваров.Количество=0,0,(СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)/СтрокаТоваров.Количество);
			ОбластьМакета.Параметры.ЦенаПослеИзменения = ?(ЦенаПослеИзменения = 0, "--", Формат(ЦенаПослеИзменения, ФорматВыводаСуммы));
		Иначе
			Если НЕ СтрокаТоваров.КоличествоПоДокументуРеализации = 0 Тогда
				ОбластьМакета.Параметры.ЦенаДоИзменения    = Формат((СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации)/(СтрокаТоваров.КоличествоПоДокументуРеализации*СтрокаТоваров.КоэффициентПоДокументуРеализации),ФорматВыводаСуммы);
			Иначе
				ОбластьМакета.Параметры.ЦенаДоИзменения    = "--";
			КонецЕсли;
			ЦенаПослеИзменения = ?(СтрокаТоваров.Количество=0,0,(СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)/(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент));
			ОбластьМакета.Параметры.ЦенаПослеИзменения = ?(ЦенаПослеИзменения = 0, "--",Формат(ЦенаПослеИзменения, ФорматВыводаСуммы));
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
		НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице
			= Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);
			НомерСтраницыПред = НомерСтраницы;
			//ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		//добавляем итоги
		СтруктураИтоговПоСтранице.РазницаБезНДСУвеличение = СтруктураИтоговПоСтранице.РазницаБезНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаБезНДСУвеличение);
		СтруктураИтоговПоСтранице.РазницаБезНДСУменьшение = СтруктураИтоговПоСтранице.РазницаБезНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаБезНДСУменьшение);
		СтруктураИтоговПоСтранице.РазницаНДСУменьшение    = СтруктураИтоговПоСтранице.РазницаНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаНДСУменьшение);
		СтруктураИтоговПоСтранице.РазницаНДСУвеличение    = СтруктураИтоговПоСтранице.РазницаНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаНДСУвеличение);
		СтруктураИтоговПоСтранице.РазницаСНДСУменьшение   = СтруктураИтоговПоСтранице.РазницаСНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаСНДСУменьшение);
		СтруктураИтоговПоСтранице.РазницаСНДСУвеличение   = СтруктураИтоговПоСтранице.РазницаСНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаСНДСУвеличение);
		
		// итого
		СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУвеличение = СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаБезНДСУвеличение);
		СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУменьшение = СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаБезНДСУменьшение);
		СтруктураИтоговПоСтраницеИтого.РазницаНДСУменьшение    = СтруктураИтоговПоСтраницеИтого.РазницаНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаНДСУменьшение);
		СтруктураИтоговПоСтраницеИтого.РазницаНДСУвеличение    = СтруктураИтоговПоСтраницеИтого.РазницаНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаНДСУвеличение);
		СтруктураИтоговПоСтраницеИтого.РазницаСНДСУменьшение   = СтруктураИтоговПоСтраницеИтого.РазницаСНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаСНДСУменьшение);
		СтруктураИтоговПоСтраницеИтого.РазницаСНДСУвеличение   = СтруктураИтоговПоСтраницеИтого.РазницаСНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаСНДСУвеличение);
		Ном = Ном + 1;
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтогоПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
	
	ОбластьИтого.Параметры.Заполнить(СтруктураИтоговПоСтраницеИтого);
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	КонецЕсли;
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьПодвал.Параметры.ФИОПБОЮЛ=Руководитель.Руководитель;
		ОбластьПодвал.Параметры.Свидетельство = спПолучитьПодтверждающийДокументОбъектаПоВиду(Организация,Перечисления.ВидыДокументов.Свидетельство);
	КонецЕсли;
	
	ОбластьПодвал.Параметры.ТекстИндивидуальныйПредприниматель = ?(ВыводитьКодВидаТовара, "Индивидуальный предприниматель или иное уполномоченное лицо", "Индивидуальный предприниматель");
	
	ТабДокумент.Вывести(ОбластьПодвал);
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьКорректировочныйСчетФактура2021(ТабДокумент)
	
	ВалютаПечатногоДокумента=зфВыборВалютыПечатногоДокумента(ЭтотОбъект);
	Если ВалютаПечатногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	ВыборкаТабличнойЧасти = Документы.СчетФактураВыданный.ПолучитьДанныеДляЗаполненияПФКорректировки(ЭтотОбъект);
	зфПерерасчетТаблицыТоваров(ВыборкаТабличнойЧасти,ЭтотОбъект,ВалютаПечатногоДокумента);
	
	БезУдаленияСтрок = Истина;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Количество") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("КоличествоПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьКоличество = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьКоличество = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("ЕдиницаИзмерения") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("ЕдиницаИзмеренияПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьЕдиницаИзмерения = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьЕдиницаИзмерения = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Коэффициент") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("КоэффициентПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьКоэффициент = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьКоэффициент = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СтавкаНДС") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СтавкаНДСПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСтавкаНДС = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСтавкаНДС = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СуммаНДС") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СуммаНДСПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСуммаНДС = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСуммаНДС = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("СуммаВсего") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("СуммаВсегоПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьСуммаВсего = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьСуммаВсего = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("Партия") <> Неопределено
		 И ВыборкаТабличнойЧасти.Колонки.Найти("ПартияПоДокументуРеализации") <> Неопределено Тогда 
    	 ЕстьПартия = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьПартия = Ложь;
	КонецЕсли;
	Если ВыборкаТабличнойЧасти.Колонки.Найти("ГТД") <> Неопределено
		 ИЛИ ВыборкаТабличнойЧасти.Колонки.Найти("ГТДДоКорректировки") <> Неопределено Тогда 
    	 ЕстьГТД = Истина;
		 БезУдаленияСтрок = Ложь;
	Иначе
    	 ЕстьГТД = Ложь;
	КонецЕсли;
	
    Если БезУдаленияСтрок = Ложь Тогда
		НомерСтроки = ВыборкаТабличнойЧасти.Количество();
		Пока НомерСтроки > 0 Цикл
			УдалитьСтроку = Истина;
			НомерСтроки = НомерСтроки - 1;
			
			СтрокаТабличнойЧасти = ВыборкаТабличнойЧасти[НомерСтроки];
			
			Если УдалитьСтроку И ЕстьКоличество Тогда
				Если СтрокаТабличнойЧасти.Количество <> СтрокаТабличнойЧасти.КоличествоПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьЕдиницаИзмерения Тогда
				Если СтрокаТабличнойЧасти.ЕдиницаИзмерения <> СтрокаТабличнойЧасти.ЕдиницаИзмеренияПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьКоэффициент Тогда
				Если СтрокаТабличнойЧасти.Коэффициент <> СтрокаТабличнойЧасти.КоэффициентПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСтавкаНДС Тогда
				Если СтрокаТабличнойЧасти.СтавкаНДС <> СтрокаТабличнойЧасти.СтавкаНДСПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСуммаНДС Тогда
				Если СтрокаТабличнойЧасти.СуммаНДС <> СтрокаТабличнойЧасти.СуммаНДСПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьСуммаВсего Тогда
				Если СтрокаТабличнойЧасти.СуммаВсего <> СтрокаТабличнойЧасти.СуммаВсегоПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьПартия Тогда
				Если СтрокаТабличнойЧасти.Партия <> СтрокаТабличнойЧасти.ПартияПоДокументуРеализации Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			Если УдалитьСтроку И ЕстьГТД Тогда
				Если СтрокаТабличнойЧасти.ГТД <> СтрокаТабличнойЧасти.ГТДДоКорректировки Тогда
                	УдалитьСтроку = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если УдалитьСтроку Тогда
				ВыборкаТабличнойЧасти.Удалить(НомерСтроки);
			КонецЕсли;
				
		КонецЦикла;
	КонецЕсли;
	
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	Если ПустаяСтрока(ФорматВыводаСуммы) Тогда
		ФорматВыводаСуммы = ФорматВыводаСуммы + "ЧДЦ=2; ЧН=0,00";
	КонецЕсли;
	
	Если СтрНайти(ФорматВыводаСуммы, "ЧН") = 0 Тогда 
		ФорматВыводаСуммы = ФорматВыводаСуммы + ";ЧН=0,00";
	КонецЕсли;
	
	ФорматВыводаКоличества = обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	ФорматВыводаКоличества2021 = обПраво("ПредставлениеНоляВПФУКД", Права,,ЭтотОбъект);
	
	ВыводитьКодТНВЭД      = обПраво("ВыводитьКодТНВЭД");
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ЕстьПрослеживаемыйТовар = Ложь;
	ЕстьСтоимостьТовараПрослеживания = Ложь;
	
	// Проверим, что есть РНПТ в документе
	Для Каждого ТекущаяСтрока Из ВыборкаТабличнойЧасти Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока.ГТД) И ТекущаяСтрока.ГТД.РНПТ Тогда
			ЕстьПрослеживаемыйТовар = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Определим макет
	Если ЕстьПрослеживаемыйТовар Тогда
		Если Дата >= Дата('20231001') Тогда
			ЕстьСтоимостьТовараПрослеживания = Истина;
			ИмяМакета = "КорректировочныйСчетФактура_01_10_2023_прослеж";
		Иначе
			ИмяМакета = "КорректировочныйСчетФактура_02_04_2021_прослеж";
		КонецЕсли;
		Макет = ПолучитьОбщийМакет(ИмяМакета);
	Иначе
		Макет = ПолучитьОбщийМакет("КорректировочныйСчетФактура_02_04_2021");
	КонецЕсли;

	Если Дата >= Дата('20241001')
		ИЛИ (Исправление И ДатаИсходногоДокумента >= Дата('20241001')) Тогда
		НомерРедакции = 1096;
	Иначе
		НомерРедакции = 534;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	Если НомерРедакции = 1096 Тогда 
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 16 августа 2024 г. № 1096)'");
	Иначе 
		ОбластьМакета.Параметры.Редакция = НСтр("ru = '(в редакции постановления Правительства Российской Федерации от 2 апреля 2021 г. № 534)'");
	КонецЕсли;

	ОбластьМакета.Параметры.НомерИсправленияКорректировочного = ?(
								обЗначениеНеЗаполнено(НомерИсправления),"--",НомерИсправления);
	ОбластьМакета.Параметры.ДатаИсправленияКорректировочного  = ?(
								обЗначениеНеЗаполнено(НомерИсправления),"--",Формат(Дата,"ДЛФ=DD"));
	Если ДокументОснование.ХозОперация = 
				Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон
		ИЛИ ДокументОснование.ХозОперация = 
				Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон Тогда
		
		ОбластьМакета.Параметры.Номер = ?(обЗначениеНеЗаполнено(НомерИсправляемогоКорректировочногоДокумента),
											дкПолучитьНомерДляПечати(ЭтотОбъект),
											дкПолучитьНомерДляПечати(ЭтотОбъект,
											,"НомерИсправляемогоКорректировочногоДокумента"));
		ОбластьМакета.Параметры.Дата  = Формат(?(обЗначениеНеЗаполнено(ДатаИсправляемогоКорректировочногоДокумента),
												Дата,
												ДатаИсправляемогоКорректировочногоДокумента),
												"ДЛФ=DD");
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = "--";
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = "--";
	Иначе
		ОбластьМакета.Параметры.Номер = ?(обЗначениеНеЗаполнено(НомерИсправляемогоКорректировочногоДокумента),
											дкПолучитьНомерДляПечати(ЭтотОбъект),
											дкПолучитьНомерДляПечати(ЭтотОбъект,,
											"НомерИсправляемогоКорректировочногоДокумента"));
		ОбластьМакета.Параметры.Дата  = Формат(?(обЗначениеНеЗаполнено(ДатаИсправляемогоКорректировочногоДокумента),
												Дата,
												ДатаИсправляемогоКорректировочногоДокумента),
												"ДЛФ=DD");
	КонецЕсли;
											
	ОбластьМакета.Параметры.НомерСчетаФактуры = ?(обЗначениеНеЗаполнено(НомерИсходногоДокумента),
													"--",
													дкПолучитьНомерДляПечати(ЭтотОбъект,,"НомерИсходногоДокумента"));
	ОбластьМакета.Параметры.ДатаСчетаФактуры  = Формат(?(обЗначениеНеЗаполнено(ДатаИсходногоДокумента),
														"--",
														ДатаИсходногоДокумента),
														"ДЛФ=DD");
	ОбластьМакета.Параметры.НомерИсправления  = ?(обЗначениеНеЗаполнено(НомерИсправленияИсходногоДокумента),
													"--",
													НомерИсправленияИсходногоДокумента);
	ОбластьМакета.Параметры.ДатаИсправления   = Формат(?(обЗначениеНеЗаполнено(ДатаИсправленияИсходногоДокумента),
														"--",
														ДатаИсправленияИсходногоДокумента),
														"ДЛФ=DD");
	
	ОбластьМакета.Параметры.Поставщик               = ЭтотОбъект.Организация;
	ОбластьМакета.Параметры.ПредставлениеПоставщика = спПолучитьПредставление(ОбластьМакета.Параметры.Поставщик,
																				Новый Структура("Наименование",""));
	АдресПоставщика = спПолучитьПредставление(ЭтотОбъект.ПодразделениеКомпании , Новый Структура("АдресЮридический"," ")); 
    ОбластьМакета.Параметры.АдресПоставщика         = ?(АдресПоставщика = "", "--", АдресПоставщика);	
	ОбластьМакета.Параметры.ИННПоставщика = ЭтотОбъект.Организация.ИНН + "/" + 
											спПолучитьКППДляПечати(Организация, ПодразделениеКомпании);
	
	Если Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ОбособленноеПодразделение Тогда
		ОбластьМакета.Параметры.Покупатель				= Контрагент.ГоловнойКонтрагент;	
	Иначе
		ОбластьМакета.Параметры.Покупатель				= Контрагент;	
	КонецЕсли;

	ОбластьМакета.Параметры.ПредставлениеПокупатель = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель,
																				Новый Структура("Наименование",""));
	АдресПокупателя = спПолучитьПредставление(ОбластьМакета.Параметры.Покупатель, Новый Структура("АдресЮридический",""));																			
	ОбластьМакета.Параметры.АдресПокупателя         = ?(АдресПокупателя = "", "--", АдресПокупателя);
	ОбластьМакета.Параметры.ИННПокупателя           = ?(Контрагент.ФормаСобственности = 
														Перечисления.ФормыСобственности.ОбособленноеПодразделение,
														Контрагент.ГоловнойКонтрагент.ИНН, Контрагент.ИНН) + "/" + Контрагент.КПП;
	
	ОбластьМакета.Параметры.Валюта = "Валюта: наименование, код " + 
									?(НЕ обЗначениеНеЗаполнено(ВалютаПечатногоДокумента.НаименованиеПолное), 
									ВалютаПечатногоДокумента.НаименованиеПолное, ВалютаПечатногоДокумента.Наименование) 
									+ ", " + ВалютаПечатногоДокумента.Код;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьШапкаИдГосКонтракта = Макет.ПолучитьОбласть("ШапкаИдГосКонтракта");
	ОбластьШапкаИдГосКонтракта.Параметры.ИдентификаторГосударственногоКонтракта =
											ЭтотОбъект.ИдентификаторГосударственногоКонтракта;
	ТабДокумент.Вывести(ОбластьШапкаИдГосКонтракта);

	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");

	Если ЕстьСтоимостьТовараПрослеживания Тогда 
		Если НомерРедакции = 1096 Тогда 
			ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога на добавленную стоимость, в рублях'");
		Иначе 
			ОбластьШапкаТаблицы.Параметры.ЗаголовокТаблицы14 = НСтр("ru = 'Стоимость товара, подлежащего прослежива-
			|емости, без налога'");
		КонецЕсли;
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("Итого");
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	мсвДопОбластиПодвала = Новый Массив;
	мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
	мсвДопОбластиПодвала.Добавить(ОбластьИтого);
	
	Если ЕстьПрослеживаемыйТовар Тогда
		СтруктураИтоговПоСтранице =
			Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение,КоличествоПрослежУвеличениеВсего,КоличествоПрослежУменьшениеВсего",0,0,0,0,0,0,0,0);
		СтруктураИтоговПоСтраницеИтого =
			Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение,КоличествоПрослежУвеличениеВсего,КоличествоПрослежУменьшениеВсего",0,0,0,0,0,0,0,0);
		Если ЕстьСтоимостьТовараПрослеживания Тогда
			СтруктураИтоговПоСтранице.Вставить("СтоимПрослежУвеличениеВсего", 0);
			СтруктураИтоговПоСтранице.Вставить("СтоимПрослежУменьшениеВсего", 0);
			СтруктураИтоговПоСтраницеИтого.Вставить("СтоимПрослежУвеличениеВсего", 0);
			СтруктураИтоговПоСтраницеИтого.Вставить("СтоимПрослежУменьшениеВсего", 0);
		КонецЕсли;
	Иначе
		СтруктураИтоговПоСтранице =
			Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);
		СтруктураИтоговПоСтраницеИтого =
			Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);

	КонецЕсли;

	Ном=1;
	СуммаВсегоБезНал = 0;
	
	ЕдиницаИзмеренияАвтоработВПечатныхФормах = 
				ЭтотОбъект.ДоговорВзаиморасчетов.ЕдиницаИзмеренияАвтоработВПечатныхФормах;
	Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
		ОбластьМакета.Параметры.НомерСтроки = ?(СтрокаТоваров.НомерИсходнойСтроки = 0, "--", СтрокаТоваров.НомерИсходнойСтроки);
		ОбластьМакета.Параметры.НаименованиеНоменклатуры = спПолучитьНаименование(СтрокаТоваров.Номенклатура);
		Если СтрокаТоваров.Товар Тогда
			Если ТипЗнч(СтрокаТоваров.Номенклатура) = Тип("СправочникСсылка.Автомобили") Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодДо          = "796";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияДо = "шт";
				ОбластьМакета.Параметры.КодВидаТовара = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПосле          = "796";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияПосле = "шт";
				ОбластьМакета.Параметры.КодВидаТовара = "--";
				
				КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
				Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
					ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
				Иначе
					ОбластьМакета.Параметры.КодВидаТовара = "--";
				КонецЕсли;
				
			ИначеЕсли СтрокаТоваров.Номенклатура.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.Услуга Тогда
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодДо          = ?(
				НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмеренияПоДокументуРеализации),СтрокаТоваров.ЕдиницаИзмеренияПоДокументуРеализации.ЕдиницаПоКлассификатору.Код, "--");
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияДо = ?(
				НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмеренияПоДокументуРеализации), СтрокаТоваров.ЕдиницаИзмеренияПоДокументуРеализации, "--");
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПосле          = ?(
								НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения), СтрокаТоваров.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код, "--");
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияПосле = ?(
								НЕ обЗначениеНеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения), СтрокаТоваров.ЕдиницаИзмерения, "--");

				КодТНВЭД = СтрокаТоваров.Номенклатура.КодТНВЭД;
				Если ЗначениеЗаполнено(КодТНВЭД) И ВыводитьКодТНВЭД Тогда
					ОбластьМакета.Параметры.КодВидаТовара = СокрЛП(КодТНВЭД);
				Иначе
					ОбластьМакета.Параметры.КодВидаТовара = "--";
				КонецЕсли;
			Иначе
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодДо          = "--";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияДо= "--";
				ОбластьМакета.Параметры.КодВидаТовара = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПосле          = "--";
				ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияПосле= "--";
				ОбластьМакета.Параметры.КодВидаТовара = "--";

			КонецЕсли;
		Иначе
			
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияДо = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмеренияПосле = ЕдиницаИзмеренияАвтоработВПечатныхФормах;
			Если ЕдиницаИзмеренияАвтоработВПечатныхФормах =
				Перечисления.ЕдиницаИзмеренияАвтоработВПечатныхФормах.ЕдиницаИзмеренияЧас Тогда
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодДо = "365";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодпосле = "365";

				
			Иначе
				
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодДо = "--";
				ОбластьМакета.Параметры.ЕдиницаИзмеренияКодПосле = "--";
			
			КонецЕсли;
			
			ОбластьМакета.Параметры.КодВидаТовара = "--";
		КонецЕсли;
		
			
		Если СтрокаТоваров.Товар Тогда
			ОбластьМакета.Параметры.КоличествоПослеИзменения = Формат(СтрокаТоваров.Количество,
												?(СтрокаТоваров.Количество = 0, ФорматВыводаКоличества2021,
												ФорматВыводаКоличества));
			ОбластьМакета.Параметры.КоличествоДоИзменения    = Формат(СтрокаТоваров.Количество - СтрокаТОваров.КоличествоРазница,
												?(СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница = 0, ФорматВыводаКоличества2021,
												ФорматВыводаКоличества));
		Иначе
			КоличествоПослеИзменения = СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент;
			ОбластьМакета.Параметры.КоличествоПослеИзменения = Формат(КоличествоПослеИзменения,
																	?(КоличествоПослеИзменения = 0, "ЧН=-",
																	ФорматВыводаКоличества));
			КоличествоДоИзменения = (СтрокаТОваров.Количество - СтрокаТоваров.КоличествоРазница)*СтрокаТоваров.КоэффициентПоДокументуРеализации;
			ОбластьМакета.Параметры.КоличествоДоИзменения    = Формат(КоличествоДоИзменения,
																	?(КоличествоДоИзменения = 0, ФорматВыводаКоличества2021,
																	ФорматВыводаКоличества));
		КонецЕсли;
		ОбластьМакета.Параметры.РазницаСНДСУвеличение       = 
														Формат(?(СтрокаТоваров.СуммаВсегоРазница >0,
																СтрокаТоваров.СуммаВсегоРазница,0),
																ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаСНДСУменьшение       = 
														Формат(?(СтрокаТоваров.СуммаВсегоРазница <0,
														-СтрокаТоваров.СуммаВсегоРазница,0),
														ФорматВыводаСуммы);
		
		ОбластьМакета.Параметры.РазницаНДСУвеличение    = Формат(?(СтрокаТоваров.СуммаНДСРазница >0,
																СтрокаТоваров.СуммаНДСРазница,0),
																ФорматВыводаСуммы);
		ОбластьМакета.Параметры.РазницаНДСУменьшение    = Формат(?(СтрокаТоваров.СуммаНДСРазница <0,
																-СтрокаТоваров.СуммаНДСРазница,0),
																ФорматВыводаСуммы);
		
		РазницаБезНДС = (СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)-
									(СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации);
		РазницаБезНДСУвеличение = ?(РазницаБезНДС > 0, РазницаБезНДС, 0);
		ОбластьМакета.Параметры.РазницаБезНДСУвеличение = Формат(РазницаБезНДСУвеличение, ФорматВыводаСуммы);
		РазницаБезНДСУменьшение = ?(РазницаБезНДС <0,-РазницаБезНДС,0);
		ОбластьМакета.Параметры.РазницаБезНДСУменьшение = Формат(РазницаБезНДСУменьшение, ФорматВыводаСуммы);
		
		Если НЕ СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница = 0 Тогда
			ОбластьМакета.Параметры.СтоимостьСНДСДоИзменения  = Формат(СтрокаТоваров.СуммаВсегоПоДокументуРеализации,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.СуммаНДСДоИзменения     = Формат(СтрокаТоваров.СуммаНДСПоДокументуРеализации,
																		ФорматВыводаСуммы);
			СтоимостьБезНДСДоИзменения = СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации;

		Иначе
			ОбластьМакета.Параметры.СтоимостьСНДСДоИзменения = 0;
			ОбластьМакета.Параметры.СуммаНДСДоИзменения = 0;
			СтоимостьБезНДСДоИзменения = 0;
			
		КонецЕсли;
		ОбластьМакета.Параметры.СтоимостьБезНДСДоИзменения = Формат(СтоимостьБезНДСДоИзменения, ФорматВыводаСуммы);

		Если ЗначениеЗаполнено(СтрокаТоваров.ГТДДоКорректировки) Тогда 
			ОбластьМакета.Параметры.ПредставлениеГТДДо = спПолучитьНаименование(СтрокаТоваров.ГТДДоКорректировки);
			ОбластьМакета.Параметры.ПредставлениеСтраныДо = СтрокаТоваров.ГТДДоКорректировки.Страна.Наименование;
			ОбластьМакета.Параметры.СтранаПроисхожденияКодДо = СтрокаТоваров.ГТДДоКорректировки.Страна.Код;
		Иначе 
			ОбластьМакета.Параметры.ПредставлениеГТДДо = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраныДо = "--";
			ОбластьМакета.Параметры.СтранаПроисхожденияКодДо = "--";
		КонецЕсли;
			
		ОбластьМакета.Параметры.СтавкаНДСДо = СтрокаТоваров.СтавкаНДСПоДокументуРеализации;
		ОбластьМакета.Параметры.СтавкаНДСПосле = СтрокаТоваров.СтавкаНДС;
		
		Если НЕ СтрокаТоваров.Количество = 0 Тогда 
			ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = Формат(СтрокаТоваров.СуммаВсего,ФорматВыводаСуммы);
			ОбластьМакета.Параметры.СуммаНДСПослеИзменения  = Формат(СтрокаТоваров.СуммаНДС,ФорматВыводаСуммы);
			СтоимостьБезНДСПослеИзменения = СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС;
			
		Иначе
			ОбластьМакета.Параметры.СтоимостьСНДСПослеИзменения = 0;
			ОбластьМакета.Параметры.СуммаНДСПослеИзменения = 0 ;
			СтоимостьБезНДСПослеИзменения = 0;
		КонецЕсли;
		ОбластьМакета.Параметры.СтоимостьБезНДСПослеИзменения = Формат(СтоимостьБезНДСПослеИзменения, ФорматВыводаСуммы);
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ГТД) Тогда 
			ОбластьМакета.Параметры.ПредставлениеГТДПосле = спПолучитьНаименование(СтрокаТоваров.ГТД);
			ОбластьМакета.Параметры.ПредставлениеСтраныПосле = СтрокаТоваров.ГТД.Страна.Наименование;
			ОбластьМакета.Параметры.СтранаПроисхожденияКодПосле = СтрокаТоваров.ГТД.Страна.Код;
 		Иначе 
			ОбластьМакета.Параметры.ПредставлениеГТДПосле = "--";
			ОбластьМакета.Параметры.ПредставлениеСтраныПосле = "--";
			ОбластьМакета.Параметры.СтранаПроисхожденияКодПосле = "--";
 		КонецЕсли;

		Если СтрокаТоваров.Товар Тогда
			Если НЕ СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница = 0 Тогда
				ОбластьМакета.Параметры.ЦенаДоИзменения    = Формат(
				(СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации)
				/(СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница), ФорматВыводаСуммы);
				
			Иначе
				ОбластьМакета.Параметры.ЦенаДоИзменения    = 0;
							КонецЕсли;
			Если НЕ СтрокаТоваров.Количество = 0 Тогда 
				ОбластьМакета.Параметры.ЦенаПослеИзменения = Формат((СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)/СтрокаТоваров.Количество, ФорматВыводаСуммы);
			 Иначе
				ОбластьМакета.Параметры.ЦенаПослеИзменения = 0;
			КонецЕсли;
			
		Иначе
			Если НЕ СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница = 0 Тогда
				ОбластьМакета.Параметры.ЦенаДоИзменения    = 
					Формат((СтрокаТоваров.СуммаВсегоПоДокументуРеализации - СтрокаТоваров.СуммаНДСПоДокументуРеализации)/
					((СтрокаТоваров.Количество - СтрокаТоваров.КоличествоРазница)*СтрокаТоваров.КоэффициентПоДокументуРеализации),
					ФорматВыводаСуммы);
			Иначе
				ОбластьМакета.Параметры.ЦенаДоИзменения    = 0;
			КонецЕсли;
			ЦенаПослеИзменения = ?(СтрокаТоваров.Количество=0,0,(СтрокаТоваров.СуммаВсего - СтрокаТоваров.СуммаНДС)
									/(СтрокаТоваров.Количество*СтрокаТоваров.Коэффициент));
			ОбластьМакета.Параметры.ЦенаПослеИзменения = ?(ЦенаПослеИзменения = 0, 0,
															Формат(ЦенаПослеИзменения, ФорматВыводаСуммы));
		КонецЕсли;
		
		КоличествоПрослеж = 0;
		
		Если ЕстьПрослеживаемыйТовар Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодДо = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежДо = "--";
			ОбластьМакета.Параметры.КоличествоПрослежДо = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодПосле = "--";
			ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежПосле = "--";
			ОбластьМакета.Параметры.КоличествоПрослежПосле = "--";
			ОбластьМакета.Параметры.КоличествоПрослежУвеличение = 0;
			ОбластьМакета.Параметры.КоличествоПрослежУменьшение = 0;
			Если НомерРедакции = 1096 Тогда 
				ОбластьМакета.Параметры.ПредставлениеГТДУвеличение	= "";
				ОбластьМакета.Параметры.ПредставлениеГТДУменьшение	= "";
			Иначе 
				ОбластьМакета.Параметры.ПредставлениеГТДУвеличение	= "Х";
				ОбластьМакета.Параметры.ПредставлениеГТДУменьшение	= "Х";
			КонецЕсли;
			Если ЕстьСтоимостьТовараПрослеживания Тогда 
				ОбластьМакета.Параметры.СтоимПрослежДо = "--";
				ОбластьМакета.Параметры.СтоимПрослежПосле = "--";
				ОбластьМакета.Параметры.СтоимПрослежУвеличение = "--";
				ОбластьМакета.Параметры.СтоимПрослежУменьшение = "--";
			КонецЕсли;
			
			Если (ЗначениеЗаполнено(СтрокаТоваров.ГТД) И СтрокаТоваров.ГТД.РНПТ)
				ИЛИ (ЗначениеЗаполнено(СтрокаТоваров.ГТДДоКорректировки) И СтрокаТоваров.ГТДДоКорректировки.РНПТ) Тогда
				
				Если ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодДо = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Код;
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежДо = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
					ОбластьМакета.Параметры.КоличествоПрослежДо = СтрокаТоваров.ГТДКоличествоДо;
					
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодПосле = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Код;
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежПосле = СтрокаТоваров.Номенклатура.БазоваяЕдиницаИзмерения.Наименование;
					ОбластьМакета.Параметры.КоличествоПрослежПосле = СтрокаТоваров.ГТДКоличествоПосле;
					КоличествоПрослеж =  СтрокаТоваров.ГТДКоличествоПосле - СтрокаТоваров.ГТДКоличествоДо;
					ОбластьМакета.Параметры.КоличествоПрослежУвеличение = ?(КоличествоПрослеж > 0, КоличествоПрослеж, 0);
					ОбластьМакета.Параметры.КоличествоПрослежУменьшение = ?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0);

				ИначеЕсли ТипЗнч(СтрокаТоваров.Номенклатура)=Тип("СправочникСсылка.Автомобили") Тогда
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодДо ="796" ;
					ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежДо = "шт";
					ОбластьМакета.Параметры.КоличествоПрослежДо =  1;
					
					Если СтрокаТоваров.Количество = 0 Тогда
						
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодПосле = "--";
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежПосле = "--";
						ОбластьМакета.Параметры.КоличествоПрослежПосле = 0;
						КоличествоПрослеж = -1;
						ОбластьМакета.Параметры.КоличествоПрослежУвеличение = ?(КоличествоПрослеж > 0, КоличествоПрослеж, 0);
						ОбластьМакета.Параметры.КоличествоПрослежУменьшение = ?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0);
					Иначе
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежКодПосле = "796";
						ОбластьМакета.Параметры.ЕдиницаИзмеренияПрослежПосле = "шт";
						ОбластьМакета.Параметры.КоличествоПрослежПосле = 1;
					КонецЕсли;
				КонецЕсли;

	            Если ЕстьСтоимостьТовараПрослеживания Тогда 
					ОбластьМакета.Параметры.СтоимПрослежДо = СтоимостьБезНДСДоИзменения;
					ОбластьМакета.Параметры.СтоимПрослежПосле = СтоимостьБезНДСПослеИзменения;
					ОбластьМакета.Параметры.СтоимПрослежУвеличение = РазницаБезНДСУвеличение;
					ОбластьМакета.Параметры.СтоимПрослежУменьшение = РазницаБезНДСУменьшение;
				КонецЕсли;

				Если НомерРедакции = 1096 Тогда 

					Если ТипЗнч(ОбластьМакета.Параметры.СтоимПрослежУвеличение) = Тип("Число") Тогда 
						СтоимПрослежУвеличение = ОбластьМакета.Параметры.СтоимПрослежУвеличение;
					Иначе 
						СтоимПрослежУвеличение = 0;
					КонецЕсли;
					Если ТипЗнч(ОбластьМакета.Параметры.КоличествоПрослежУвеличение) = Тип("Число") Тогда 
						КоличествоПрослежУвеличение = ОбластьМакета.Параметры.КоличествоПрослежУвеличение;
					Иначе 
						КоличествоПрослежУвеличение = 0;
					КонецЕсли;
					Если СтоимПрослежУвеличение > 0 ИЛИ КоличествоПрослежУвеличение > 0 Тогда 
						ОбластьМакета.Параметры.ПредставлениеГТДУвеличение = ОбластьМакета.Параметры.ПредставлениеГТДПосле;
					Иначе
						ОбластьМакета.Параметры.ПредставлениеГТДУвеличение = "";
					КонецЕсли;

					Если ТипЗнч(ОбластьМакета.Параметры.СтоимПрослежУменьшение) = Тип("Число") Тогда 
						СтоимПрослежУменьшение = ОбластьМакета.Параметры.СтоимПрослежУменьшение;
					Иначе 
						СтоимПрослежУменьшение = 0;
					КонецЕсли;
					Если ТипЗнч(ОбластьМакета.Параметры.КоличествоПрослежУменьшение) = Тип("Число") Тогда 
						КоличествоПрослежУменьшение = ОбластьМакета.Параметры.КоличествоПрослежУменьшение;
					Иначе 
						КоличествоПрослежУменьшение = 0;
					КонецЕсли;
					Если СтоимПрослежУменьшение > 0 ИЛИ КоличествоПрослежУменьшение > 0 Тогда 
						ОбластьМакета.Параметры.ПредставлениеГТДУменьшение = ОбластьМакета.Параметры.ПредставлениеГТДДо;
					Иначе
						ОбластьМакета.Параметры.ПредставлениеГТДУменьшение = "";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета,
														ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
														НомерСтраницы, СтруктураИтоговПоСтранице, 
														ЭтотОбъект, мсвДопОбластиПодвала);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			Если ЕстьПрослеживаемыйТовар Тогда
				СтруктураИтоговПоСтранице =
					Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение,КоличествоПрослежУвеличениеВсего,КоличествоПрослежУменьшениеВсего",0,0,0,0,0,0,0,0);
				Если ЕстьСтоимостьТовараПрослеживания Тогда
					СтруктураИтоговПоСтранице.Вставить("СтоимПрослежУвеличениеВсего", 0);
					СтруктураИтоговПоСтранице.Вставить("СтоимПрослежУменьшениеВсего", 0);
				КонецЕсли;
			Иначе
				СтруктураИтоговПоСтранице =
					Новый Структура("РазницаБезНДСУвеличение,РазницаБезНДСУменьшение,РазницаНДСУменьшение,РазницаНДСУвеличение,РазницаСНДСУменьшение,РазницаСНДСУвеличение",0,0,0,0,0,0);
			КонецЕсли;
			НомерСтраницыПред = НомерСтраницы;
		КонецЕсли;
		
		//добавляем итоги
		СтруктураИтоговПоСтранице.РазницаБезНДСУвеличение =
					СтруктураИтоговПоСтранице.РазницаБезНДСУвеличение + РазницаБезНДСУвеличение;
		СтруктураИтоговПоСтранице.РазницаБезНДСУменьшение = 
					СтруктураИтоговПоСтранице.РазницаБезНДСУменьшение + РазницаБезНДСУменьшение;
		СтруктураИтоговПоСтранице.РазницаНДСУменьшение    =
					СтруктураИтоговПоСтранице.РазницаНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаНДСУменьшение);
		СтруктураИтоговПоСтранице.РазницаНДСУвеличение    = 
					СтруктураИтоговПоСтранице.РазницаНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаНДСУвеличение);
		СтруктураИтоговПоСтранице.РазницаСНДСУменьшение   = 
					СтруктураИтоговПоСтранице.РазницаСНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаСНДСУменьшение);
		СтруктураИтоговПоСтранице.РазницаСНДСУвеличение   = 
					СтруктураИтоговПоСтранице.РазницаСНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаСНДСУвеличение);
		
		// итого
		СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУвеличение = 
					СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУвеличение + РазницаБезНДСУвеличение;
		СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУменьшение =
					СтруктураИтоговПоСтраницеИтого.РазницаБезНДСУменьшение + РазницаБезНДСУменьшение;
		СтруктураИтоговПоСтраницеИтого.РазницаНДСУменьшение    =
					СтруктураИтоговПоСтраницеИтого.РазницаНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаНДСУменьшение);
		СтруктураИтоговПоСтраницеИтого.РазницаНДСУвеличение    =
					СтруктураИтоговПоСтраницеИтого.РазницаНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаНДСУвеличение);
		СтруктураИтоговПоСтраницеИтого.РазницаСНДСУменьшение   =
					СтруктураИтоговПоСтраницеИтого.РазницаСНДСУменьшение + Число(ОбластьМакета.Параметры.РазницаСНДСУменьшение);
		СтруктураИтоговПоСтраницеИтого.РазницаСНДСУвеличение   = 
					СтруктураИтоговПоСтраницеИтого.РазницаСНДСУвеличение + Число(ОбластьМакета.Параметры.РазницаСНДСУвеличение);
					
		Если ЕстьПрослеживаемыйТовар Тогда
			СтруктураИтоговПоСтранице.КоличествоПрослежУвеличениеВсего   = 
					СтруктураИтоговПоСтранице.КоличествоПрослежУвеличениеВсего + ?(КоличествоПрослеж > 0, КоличествоПрослеж, 0);
					
			СтруктураИтоговПоСтранице.КоличествоПрослежУменьшениеВсего   = 
					СтруктураИтоговПоСтранице.КоличествоПрослежУменьшениеВсего + ?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0);

		 	СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУвеличениеВсего   = 
					СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУвеличениеВсего + ?(КоличествоПрослеж > 0, КоличествоПрослеж, 0);
					
			СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУменьшениеВсего   = 
					СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУменьшениеВсего + ?(КоличествоПрослеж < 0, - КоличествоПрослеж, 0);
					
            Если ЕстьСтоимостьТовараПрослеживания Тогда 
				СтруктураИтоговПоСтранице.СтоимПрослежУвеличениеВсего = СтруктураИтоговПоСтранице.СтоимПрослежУвеличениеВсего + РазницаБезНДСУвеличение;
				СтруктураИтоговПоСтранице.СтоимПрослежУменьшениеВсего = СтруктураИтоговПоСтранице.СтоимПрослежУменьшениеВсего + РазницаБезНДСУменьшение;
				СтруктураИтоговПоСтраницеИтого.СтоимПрослежУвеличениеВсего = СтруктураИтоговПоСтраницеИтого.СтоимПрослежУвеличениеВсего + РазницаБезНДСУвеличение;
				СтруктураИтоговПоСтраницеИтого.СтоимПрослежУменьшениеВсего = СтруктураИтоговПоСтраницеИтого.СтоимПрослежУменьшениеВсего + РазницаБезНДСУменьшение;
			КонецЕсли;
		КонецЕсли;
		Ном = Ном + 1;
	КонецЦикла;
	
	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		Если ЕстьПрослеживаемыйТовар И НомерРедакции = 1096 Тогда 
			СтруктураИтоговПоСтранице.КоличествоПрослежУменьшениеВсего = "Х";
			СтруктураИтоговПоСтранице.КоличествоПрослежУвеличениеВсего = "Х";
			СтруктураИтоговПоСтранице.СтоимПрослежУвеличениеВсего = "Х";
			СтруктураИтоговПоСтранице.СтоимПрослежУменьшениеВсего = "Х";
		КонецЕсли;
		
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтогоПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект, ЕстьПрослеживаемыйТовар);
	КонецЕсли;
	
	Если ЕстьПрослеживаемыйТовар И НомерРедакции = 1096 Тогда 
		СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУменьшениеВсего = "Х";
		СтруктураИтоговПоСтраницеИтого.КоличествоПрослежУвеличениеВсего = "Х";
		СтруктураИтоговПоСтраницеИтого.СтоимПрослежУвеличениеВсего = "Х";
		СтруктураИтоговПоСтраницеИтого.СтоимПрослежУменьшениеВсего = "Х";
	КонецЕсли;

	ОбластьИтого.Параметры.Заполнить(СтруктураИтоговПоСтраницеИтого);
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Заполним информацию о руководителях организации
	Руководитель = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.Руководитель);
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		ОбластьПодвал.Параметры.Заполнить(Руководитель);
		
		ГлавныйБухгалтер = дкОтветственноеЛицо(ЭтотОбъект,Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер);
		ОбластьПодвал.Параметры.Заполнить(ГлавныйБухгалтер);
	КонецЕсли;
	
	Если Организация.ФормаСобственности=Перечисления.ФормыСобственности.ЧастныйПредприниматель Тогда
		ОбластьПодвал.Параметры.ФИОПБОЮЛ=Руководитель.Руководитель;
		//ОбластьПодвал.Параметры.ФИОПБОЮЛПредставление=Руководитель.РуководительПредставление;
		ОбластьПодвал.Параметры.Свидетельство =
					спПолучитьПодтверждающийДокументОбъектаПоВиду(Организация,Перечисления.ВидыДокументов.Свидетельство);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал);
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

// Формирует печатную форму "УПД"
// Возвращает сформированный табличный документ:
Функция ПечатьУПД(ТабДокумент) Экспорт
	
	// Заполняем таблицу КешСебестоимостиАвтомобилейКупленныхУФизЛица.
	Если НЕ ТипЗнч(КешСебестоимостиАвтомобилейКупленныхУФизЛица) = Тип("ТаблицаЗначений") Тогда
		
		ВыборкаТабличнойЧасти = ЭтотОбъект.Товары.Выгрузить();
		
		Для Каждого СтрокаТоваров Из ВыборкаТабличнойЧасти Цикл
			
			Себестоимость = ПолучитьСебестоимостьАвтомобиляКупленногоУФизЛица(СтрокаТоваров);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТабДокумент = дкПечатьУПД(ЭтотОбъект,ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции //ПечатьУПД()

// Формирует печатную форму "УКД"
// Возвращает сформированный табличный документ:
Функция ПечатьУКД(ТабДокумент) Экспорт
	
	ТабДокумент = дкПечатьУКД(ЭтотОбъект, ТабДокумент);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьУКД

// Функция получения данных для УКД.
//
Функция ПолучитьДанныеДляПечатиУКД() Экспорт
	
	ДанныеОбъекта = Новый Структура();
	
	Если Дата < Дата('20210701') Тогда
		ТаблицаТоваров = ЭтотОбъект.ДокументОснование.ПолучитьОбъект().ПолучитьДанныеДляПечатиУКД().Товары;
	Иначе
		ТаблицаТоваров = Документы.СчетФактураВыданный.ПолучитьДанныеДляЗаполненияПФКорректировки(ДокументОснование.ПолучитьОбъект());
	КонецЕсли;
	
	// Данные документа
	ДанныеОбъекта.Вставить("Дата"                                  , ЭтотОбъект.Дата);
	ДанныеОбъекта.Вставить("Номер"                                 , дкПолучитьНомерДляПечати(ЭтотОбъект));
	ДанныеОбъекта.Вставить("ХозОперация"                           , ЭтотОбъект.ХозОперация);
	ДанныеОбъекта.Вставить("ДокументОснование"                     , ЭтотОбъект.ДокументОснование);
	ДанныеОбъекта.Вставить("ВалютаДокумента"                       , ЭтотОбъект.ВалютаДокумента);
	ДанныеОбъекта.Вставить("Поставщик"                             , ЭтотОбъект.Организация);
	ДанныеОбъекта.Вставить("ПодразделениеКомпании"                 , ЭтотОбъект.ПодразделениеКомпании);
	ДанныеОбъекта.Вставить("ПлатежноРасчетныеДокументы"            , ЭтотОбъект.ПлатежноРасчетныеДокументы);
	ДанныеОбъекта.Вставить("Покупатель"                            , ЭтотОбъект.Контрагент);
	ДанныеОбъекта.Вставить("Организация"                           , ЭтотОбъект.Организация);
	ДанныеОбъекта.Вставить("ДоговорВзаиморасчетов"                 , ?(ЗначениеЗаполнено(ЭтотОбъект.ДоговорВзаиморасчетов), 
																		ЭтотОбъект.ДоговорВзаиморасчетов, 
																		"--"));
	ДанныеОбъекта.Вставить("Товары"                                , ТаблицаТоваров);
	ДанныеОбъекта.Вставить("Статус"                                , 1);
	ДанныеОбъекта.Вставить("Исправление"                           , ЭтотОбъект.Исправление);
	ДанныеОбъекта.Вставить("НомерИсходногоДокумента"               , ?(ЗначениеЗаполнено(ЭтотОбъект.НомерИсходногоДокумента), 
																		дкПолучитьНомерДляПечати(ЭтотОбъект,,"НомерИсходногоДокумента"), 
																		"--"));
	ДанныеОбъекта.Вставить("ДатаИсходногоДокумента"   			   , ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаИсходногоДокумента), 
																		ЭтотОбъект.ДатаИсходногоДокумента, 
																		"--"));
	ДанныеОбъекта.Вставить("НомерИсправленияИсходногоДокумента"	   , ?(ЗначениеЗаполнено(ЭтотОбъект.НомерИсправленияИсходногоДокумента), 
																		ЭтотОбъект.НомерИсправленияИсходногоДокумента, 
																		"--"));
	ДанныеОбъекта.Вставить("ДатаИсправленияИсходногоДокумента"     , ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаИсправленияИсходногоДокумента), 
																		ЭтотОбъект.ДатаИсправленияИсходногоДокумента, 
																		"--"));
	ДанныеОбъекта.Вставить("Ссылка"                                , ЭтотОбъект.Ссылка);
	ДанныеОбъекта.Вставить("ИдентификаторГосударственногоКонтракта", ЭтотОбъект.ИдентификаторГосударственногоКонтракта);
	ДанныеОбъекта.Вставить("ДатаОтгрузки", Неопределено);
	
	// Свойства
	ДанныеОбъекта.Вставить("Руководитель"     		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.Руководитель));
	ДанныеОбъекта.Вставить("ГлавныйБухгалтер" 		, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер));
	ДанныеОбъекта.Вставить("Менеджер" 				, дкОтветственноеЛицо(ЭтотОбъект.ДокументОснование, "Менеджер"));
	
	Возврат ДанныеОбъекта;
	
КонецФункции

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли

Функция ПолучитьВыборку() Экспорт
	Запрос = Новый Запрос;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Товар,
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
		|	КорректировкаРеализацииТовары.Количество,
		|	КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.КоличествоРазница,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмерения,
		|	КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Коэффициент,
		|	КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.Цена,
		|	КорректировкаРеализацииТовары.Сумма,
		|	КорректировкаРеализацииТовары.СтавкаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДС,
		|	КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаНДСРазница,
		|	КорректировкаРеализацииТовары.СуммаВсего,
		|	КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииТовары.СуммаВсегоРазница
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
		|	И (КорректировкаРеализацииТовары.Количество <> КорректировкаРеализацииТовары.КоличествоПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.ЕдиницаИзмерения <> КорректировкаРеализацииТовары.ЕдиницаИзмеренияПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.Коэффициент <> КорректировкаРеализацииТовары.КоэффициентПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СтавкаНДС <> КорректировкаРеализацииТовары.СтавкаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СуммаНДС <> КорректировкаРеализацииТовары.СуммаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииТовары.СуммаВсего <> КорректировкаРеализацииТовары.СуммаВсегоПоДокументуРеализации)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	КорректировкаРеализацииРаботы.Работа,
		|	НЕОПРЕДЕЛЕНО,
		|	КорректировкаРеализацииРаботы.Количество,
		|	КорректировкаРеализацииРаботы.КоличествоПоДокументуРеализации,
		|	КорректировкаРеализацииРаботы.КоличествоРазница,
		|	КорректировкаРеализацииРаботы.Нормочас,
		|	КорректировкаРеализацииРаботы.Нормочас,
		|	КорректировкаРеализацииРаботы.Коэффициент,
		|	КорректировкаРеализацииРаботы.КоэффициентПоДокументуРеализации,
		|	КорректировкаРеализацииРаботы.Цена,
		|	КорректировкаРеализацииРаботы.Сумма,
		|	КорректировкаРеализацииРаботы.СтавкаНДС,
		|	КорректировкаРеализацииРаботы.СуммаНДС,
		|	КорректировкаРеализацииРаботы.СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииРаботы.СуммаНДСРазница,
		|	КорректировкаРеализацииРаботы.СуммаВсего,
		|	КорректировкаРеализацииРаботы.СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииРаботы.СуммаВсегоРазница
		|ИЗ
		|	Документ.КорректировкаРеализации.Работы КАК КорректировкаРеализацииРаботы
		|ГДЕ
		|	КорректировкаРеализацииРаботы.Ссылка = &Ссылка
		|	И (КорректировкаРеализацииРаботы.Количество <> КорректировкаРеализацииРаботы.КоличествоПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.Коэффициент <> КорректировкаРеализацииРаботы.КоэффициентПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СтавкаНДС <> КорректировкаРеализацииРаботы.СтавкаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СуммаНДС <> КорректировкаРеализацииРаботы.СуммаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииРаботы.СуммаВсего <> КорректировкаРеализацииРаботы.СуммаВсегоПоДокументуРеализации)"
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Товар,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
		|	"""" КАК ХарактеристикаНоменклатуры,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.Количество КАК Количество,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.КоличествоПоДокументуРеализации КАК КоличествоПоДокументуРеализации,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.КоличествоРазница КАК КоличествоРазница,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.Цена,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.Сумма,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СтавкаНДС,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДС,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДСПоДокументуРеализации КАК СуммаНДСПоДокументуРеализации,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДСРазница,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсего,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсегоПоДокументуРеализации КАК СуммаВсегоПоДокументуРеализации,
		|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсегоРазница
		|ИЗ
		|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК КорректировкаРеализацииАвтомобилейАвтомобили
		|ГДЕ
		|	КорректировкаРеализацииАвтомобилейАвтомобили.Ссылка = &Ссылка
		|	И (КорректировкаРеализацииАвтомобилейАвтомобили.Количество <> КорректировкаРеализацииАвтомобилейАвтомобили.КоличествоПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииАвтомобилейАвтомобили.Сумма <> КорректировкаРеализацииАвтомобилейАвтомобили.СуммаПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииАвтомобилейАвтомобили.СтавкаНДС <> КорректировкаРеализацииАвтомобилейАвтомобили.СтавкаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДС <> КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДСПоДокументуРеализации
		|			ИЛИ КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсего <> КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсегоПоДокументуРеализации)";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаполнитьНомера(Основание) Экспорт
	Если Основание = Неопределено ИЛИ НЕ ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	ЭтоИсправление = (Основание.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах) ИЛИ
	Основание.ХозОперация = Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах;
	Корректировка     = Неопределено;
	ОригиналОснование = Неопределено;
	ПервоеИсправление = Неопределено;
	ИсправлениеОснования = Неопределено;
	
	//Получим документ оригинал и корректировку
	ДокДокументОснование = Основание.ДокументОснование;
	КорректировкаПоСогласованию = Ложь;
	НайденаКорректировка = Ложь;
	
	Пока Истина Цикл
		Если ДокДокументОснование = Неопределено Тогда
			Прервать;
		КонецЕсли;
		КорректировкаПоСогласованию = (ДокДокументОснование.ХозОперация =
				Справочники.ХозОперации.КорректировкаРеализацииКорректировкаПоСогласованиюСторон
			ИЛИ ДокДокументОснование.ХозОперация =
				Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейКорректировкаПоСогласованиюСторон);
		КорректировкаИсправления = (ДокДокументОснование.ХозОперация =
				Справочники.ХозОперации.КорректировкаРеализацииИсправлениеВПервичныхДокументах
			ИЛИ ДокДокументОснование.ХозОперация =
				Справочники.ХозОперации.КорректировкаРеализацииАвтомобилейИсправлениеВПервичныхДокументах);
		НайденаКорректировка = НайденаКорректировка ИЛИ КорректировкаПоСогласованию;
		
		Если КорректировкаИсправления И ИсправлениеОснования = Неопределено И ОригиналОснование = Неопределено Тогда
			ИсправлениеОснования = ДокДокументОснование;
		КонецЕсли;
		
		Если КорректировкаПоСогласованию И ЭтоИсправление И Корректировка = Неопределено Тогда
			ЕстьКорректировка = Истина;
			Корректировка = ДокДокументОснование;
		КонецЕсли;
		Если КорректировкаИсправления И ПервоеИсправление = Неопределено И НЕ НайденаКорректировка Тогда
			ПервоеИсправление = ДокДокументОснование;
			ЕстьИсправление = Истина;
		КонецЕсли;
		Если ОригиналОснование = Неопределено
			И Корректировка <> ДокДокументОснование
			И КорректировкаПоСогласованию
		Тогда
			ОригиналОснование = ДокДокументОснование;
		КонецЕсли;
		Если ТипЗнч(ДокДокументОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") И ТипЗнч(ДокДокументОснование) <> Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
			Если ОригиналОснование = Неопределено Тогда
				ОригиналОснование = ДокДокументОснование;
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
		Если ОригиналОснование = Неопределено И КорректировкаПоСогласованию Тогда
			ИсправлениеОснования = Неопределено;
		КонецЕсли;
		
		ДокДокументОснование = ДокДокументОснование.ДокументОснование;
	КонецЦикла;
	
	ЕстьОснование = (ОригиналОснование <> Неопределено);
	// получим счет фактуру для документов
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка,
	|	СчетФактураВыданный.ДокументОснование
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.ДокументОснование = &Док1
	|	ИЛИ СчетФактураВыданный.ДокументОснование = &Док2
	|	ИЛИ СчетФактураВыданный.ДокументОснование = &Док3
	|	ИЛИ СчетФактураВыданный.ДокументОснование = &Док4";
	Запрос.УстановитьПараметр("Док1",Корректировка);
	Запрос.УстановитьПараметр("Док2",ОригиналОснование);
	Запрос.УстановитьПараметр("Док3",ПервоеИсправление);
	Запрос.УстановитьПараметр("Док4",ИсправлениеОснования);
	ТаблСФ = Запрос.Выполнить().Выгрузить();
	
	Исправление = ЭтоИсправление;
	Если ЭтоИсправление Тогда
		Если ПервоеИсправление = Неопределено Тогда
			НомерИсправления = 1;
			УчитыватьИсправлениеИсходногоДокумента = Ложь;
		Иначе
			МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",ПервоеИсправление));
			Если МассивСФ.Количество() = 0 Тогда
				Если ЭтоИсправление Тогда
					НомерИсправления = 1;
				Иначе
					НомерИсправления = 0;
				КонецЕсли;
				УчитыватьИсправлениеИсходногоДокумента = Истина;
			Иначе
				УчитыватьИсправлениеИсходногоДокумента = Истина;
				НомерИсправления = МассивСФ[0].Ссылка.НомерИсправления + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьКорректировка Тогда
		МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",Корректировка));
		Если МассивСФ.Количество() > 0 Тогда
			НомерИсправляемогоКорректировочногоДокумента = МассивСФ[0].Ссылка.Номер;
			ДатаИсправляемогоКорректировочногоДокумента  = МассивСФ[0].Ссылка.Дата;
		КонецЕсли;
	КонецЕсли;
	
	Если ОригиналОснование <> Неопределено Тогда
		МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",ОригиналОснование));
		Если МассивСФ.Количество() > 0 Тогда
			НомерИсходногоДокумента = МассивСФ[0].Ссылка.Номер;
			ДатаИсходногоДокумента  = МассивСФ[0].Ссылка.Дата;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИсправлениеОснования) Тогда
			МассивСФ = ТаблСФ.НайтиСтроки(Новый Структура("ДокументОснование",ИсправлениеОснования));
			Если МассивСФ.Количество() > 0 Тогда
				НомерИсправленияИсходногоДокумента = МассивСФ[0].Ссылка.НомерИсправления;
				ДатаИсправленияИсходногоДокумента = МассивСФ[0].Ссылка.Дата;
				УчитыватьИсправлениеИсходногоДокумента = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьНомерИсходнойСтроки() Экспорт
	
	Если ТипЗнч(ЭтотОбъект.ДокументОснование)=Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ 
		ТипЗнч(ЭтотОбъект.ДокументОснование)=Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей")Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданныйТовары.Номенклатура КАК Номенклатура,
		|	СчетФактураВыданныйТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СчетФактураВыданныйТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	СчетФактураВыданныйТовары.ГТД КАК ГТД,
		|	СчетФактураВыданныйТовары.НомерИсходнойСтроки КАК НомерИсходнойСтроки,
		|	СчетФактураВыданныйТовары.Партия КАК Партия
		|ИЗ
		|	Документ.СчетФактураВыданный.Товары КАК СчетФактураВыданныйТовары
		|ГДЕ
		|	СчетФактураВыданныйТовары.Ссылка.ДокументОснование = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование.ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ДанныеИсходнойСФ = РезультатЗапроса.Выгрузить();
			
			СтруктураПоиска = Новый Структура("Номенклатура,ЕдиницаИзмерения,ХарактеристикаНоменклатуры,Партия,ГТД");
			
			Для каждого ТекущаяСтрока Из ЭтотОбъект.Товары Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
				
				НайденныеСтроки = ДанныеИсходнойСФ.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() = 0 Тогда
					ТекущаяСтрока.НомерИсходнойСтроки = 0; 
					Продолжить;
				КонецЕсли;
				ТекущаяСтрока.НомерИсходнойСтроки = НайденныеСтроки[0].НомерИСходнойСтроки; 
				
			КонецЦикла;
			
			
		Иначе
			Для Каждого ТекущаяСтрока Из ЭтотОбъект.Товары Цикл
			
			ТекущаяСтрока.НомерИсходнойСтроки = 0;
			
		КонецЦикла;

		
		КонецЕсли;
	Иначе
		Для Каждого ТекущаяСтрока Из ЭтотОбъект.Товары Цикл
			
			ТекущаяСтрока.НомерИсходнойСтроки = ТекущаяСтрока.НомерСтроки;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	

// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ОбработкаЗаполненияСчетФактураНаАванс(Сделка)
	Товары.Очистить();
	Если НЕ обЗначениеНеЗаполнено(Сделка) Тогда
		СделкаМетаданные=Сделка.Метаданные();
		СделкаИмя=Сделка.Метаданные().Имя;
		ТекстЗапроса="";
		Если СделкаМетаданные.ТабличныеЧасти.Найти("Товары")<>Неопределено Тогда
			ТекстЗапроса="ВЫБРАТЬ
						 |	СделкаТовары.Номенклатура КАК Номенклатура,
						 |	СделкаТовары.Количество КАК Количество,
						 |	СделкаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
						 |	СделкаТовары.Коэффициент КАК Коэффициент,
						 |	СделкаТовары.Цена КАК Цена,
						 |	СделкаТовары.Сумма КАК Сумма,
						 |	СделкаТовары.СтавкаНДС КАК СтавкаНДС,
						 |	СделкаТовары.СуммаНДС КАК СуммаНДС,
						 |	СделкаТовары.СуммаВсего КАК СуммаВсего,
						 |	СделкаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
						 |ИЗ
						 |	Документ."+СделкаИмя+".Товары КАК СделкаТовары
						 |ГДЕ
						 |	СделкаТовары.Ссылка = &Сделка
						 |";
		КонецЕсли;
		Если СделкаМетаданные.ТабличныеЧасти.Найти("Работы")<>Неопределено Тогда
			Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
				ТекстЗапроса=ТекстЗапроса+"
						 |
						 |ОБЪЕДИНИТЬ ВСЕ
						 |";
			КонецЕсли; 
			ТекстЗапроса=ТекстЗапроса+"ВЫБРАТЬ
						 |	СделкаРаботы.Работа КАК Номенклатура,
						 |	СделкаРаботы.Количество КАК Количество,
						 |	СделкаРаботы.Нормочас КАК ЕдиницаИзмерения,
						 |	СделкаРаботы.Коэффициент КАК Коэффициент,
						 |	СделкаРаботы.Цена КАК Цена,
						 |	СделкаРаботы.Сумма КАК Сумма,
						 |	СделкаРаботы.СтавкаНДС КАК СтавкаНДС,
						 |	СделкаРаботы.СуммаНДС КАК СуммаНДС,
						 |	СделкаРаботы.СуммаВсего КАК СуммаВсего,
						 |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК ХарактеристикаНоменклатуры
						 |ИЗ
						 |	Документ."+СделкаИмя+".Работы КАК СделкаРаботы
						 |ГДЕ
						 |	СделкаРаботы.Ссылка = &Сделка";
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
			Запрос=Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Сделка",Сделка);
			Товары.Загрузить(Запрос.Выполнить().Выгрузить());
			Для Каждого СтрокаТоваров Из Товары Цикл
				СуммаНДС=СтрокаТоваров.СуммаНДС;
				ОбработкаРеквизита("Товары.СуммаВсего",СтрокаТоваров);
				СтрокаТоваров.СуммаНДС=СуммаНДС;
				ЭтотОбъект.ОбработкаРеквизита("Товары.СуммаНДС",СтрокаТоваров);
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Знач Основание)
	ОснованиеОригинал=Основание;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		ЗаполнитьНомера(Основание);
	КонецЕсли;
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	// для заполнение по ПКО используется сделка
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
		Если НЕ Основание.СтатьяДДС = Справочники.СтатьиДДС.ПредоплатаОтПокупателя Тогда
			#Если Клиент Тогда
				Предупреждение("Поступление денежных средств не является авансом. Ввод счета-фактура выданной не требуется.");
			#КонецЕсли
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;
		
		СуммаДокумента    = Товары.Итог("СуммаВсего");
		СуммаНДСДокумента = Товары.Итог("СуммаНДС");
		
		//При вводе на основании ПКО добавляем только одну строку в ТЧ
		Товары.Очистить();
		СтрокаТоваров=Товары.Добавить();
		СтрокаТоваров.Номенклатура=Справочники.Номенклатура.Предоплата;
		СтрокаТоваров.Количество=1;
		СтрокаТоваров.ЕдиницаИзмерения=СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
		СтрокаТоваров.Коэффициент=СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		СтрокаТоваров.СтавкаНДС=Основание.СтавкаНДС;
		СтрокаТоваров.СуммаВсего=Основание.СуммаДокумента;
		//ОбработкаРеквизита("Товары.СуммаВсего",СтрокаТоваров,,);
		СтрокаТоваров.СуммаНДС = Основание.СуммаНДС;
		ПересчитатьСумму(СтрокаТоваров); 
		
		//Misha
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.Соллерс_АктДистрибьютораПоГарантии") Тогда 
			дкОбработкаЗаполненияПоУмолчанию(ЭтотОбъект, Основание);
			//<<Павличенко 09.04.19
			Если Организация = Справочники.Организации.ОсновнаяОрганизация тогда 
				Дата =  Основание.Дата;
			КонецЕсли;
			//>>Павличенко 09.04.19
			СтрокаТоваровСФ = ЭтотОбъект.Товары.Добавить();
			СтрокаТоваровСФ.Номенклатура = Основание.Услуга;
			ЭтотОбъект.ДокументОснование = Основание.Ссылка;
			ОбработкаРеквизита("Товары.Номенклатура", СтрокаТоваровСФ);
			СтрокаТоваровСФ.Количество = 1;
			СтрокаТоваровСФ.Цена = Основание.СуммаДокументаПодтвержденная;
			ОбработкаРеквизита("Товары.Цена", СтрокаТоваровСФ);
			//<<Павличенко 09.04.19
			Если Организация = Справочники.Организации.ОсновнаяОрганизация тогда 
				СтрокаТоваровСФ.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
				СтрокаТоваровСФ.СуммаНДС = ЭтотОбъект.СуммаНДСДокумента;
			КонецЕсли;
			//>>Павличенко 09.04.19
		КонецЕсли;
		//Misha	
		
		// заполним авансовые платежи
		ПлатежноРасчетныеДокументы = СформироватьИмяПлатежногоДокумента(Основание);
		Основание = Неопределено;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Выписка") Тогда
		// выберем строку для заполнения
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыпискаСостав.Контрагент КАК Контрагент,
		|	ВыпискаСостав.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВыпискаСостав.СуммаПриход КАК СуммаПриход,
		|	ВыпискаСостав.Сделка КАК Сделка,
		|	ВыпискаСостав.СтавкаНДС КАК СтавкаНДС,
		|	ВыпискаСостав.СуммаНДС КАК СуммаНДС,
		|	ВыпискаСостав.ПлатежноеПоручениеОснование КАК ПлатежноеПоручениеОснование
		|ИЗ
		|	Документ.Выписка.Состав КАК ВыпискаСостав
		|ГДЕ
		|	ВыпискаСостав.Ссылка = &Основание
		|	И ВыпискаСостав.СтатьяДДС = ЗНАЧЕНИЕ(Справочник.СтатьиДДС.ПредоплатаОтПокупателя)
		|	И ВыпискаСостав.СуммаПриход > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВыпискаСостав.НомерСтроки";
		Запрос.УстановитьПараметр("Основание",Основание);
		ТЗВыбора = Запрос.Выполнить().Выгрузить();
		Если ТЗВыбора.Количество() = 0 Тогда
			#Если Клиент Тогда
				Предупреждение("Документ " + Основание + " не содержит авансов. Ввод счета-фактура выданной не требуется.");
			#КонецЕсли
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		ИначеЕсли ТЗВыбора.Количество() > 1 Тогда
			// выбирем строку для заполнения
			ВыбСтрока = ТЗВыбора.ВыбратьСтроку("Выберите строку аванса для ввода СФ");
			Если ВыбСтрока = Неопределено Тогда
				дкОтменаВводаДокумента(ЭтотОбъект);
				Возврат;
			КонецЕсли;
		Иначе
			ВыбСтрока = ТЗВыбора[0];
		КонецЕсли;
		
		Контрагент            = ВыбСтрока.Контрагент;
		ДоговорВзаиморасчетов = ВыбСтрока.ДоговорВзаиморасчетов;
		
		Если ЗначениеЗаполнено(ВыбСтрока.ПлатежноеПоручениеОснование) Тогда
			ПлатежноРасчетныеДокументы = СформироватьИмяПлатежногоДокумента(ВыбСтрока.ПлатежноеПоручениеОснование);
		Иначе
			ЗаполнитьАвансовыеПлатежи(Основание);
		КонецЕсли;
		
		//При вводе на основании банковской выписки добавляем только одну строку в ТЧ
		Товары.Очистить();
		СтрокаТоваров=Товары.Добавить();
		СтрокаТоваров.Номенклатура=Справочники.Номенклатура.Предоплата;
		СтрокаТоваров.Количество=1;
		СтрокаТоваров.ЕдиницаИзмерения=СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
		СтрокаТоваров.Коэффициент=СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		СтрокаТоваров.СуммаВсего=ВыбСтрока.СуммаПриход;
		СтрокаТоваров.СтавкаНДС=ВыбСтрока.СтавкаНДС;
		СтрокаТоваров.СуммаНДС=ВыбСтрока.СуммаНДС;
		ПересчитатьСумму(СтрокаТоваров);
		Основание = Неопределено;
		// заполним авансовые платежи
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") ИЛИ  ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитентуЗаАвтомобили") Тогда
		//Для отчета комитенту только 1 строка с комиссионным вознаграждением
		Товары.Очистить();
		НоваяСтрока=Товары.Добавить();
		НоваяСтрока.Номенклатура=Справочники.Номенклатура.КомиссионноеВознаграждение;
		ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			НоваяСтрока.СуммаВсего=Основание.Товары.Итог("Вознаграждение");
		Иначе
			НоваяСтрока.СуммаВсего=Основание.Автомобили.Итог("Вознаграждение");
		КонецЕсли;
		ОбработкаРеквизита("Товары.СуммаВсего",НоваяСтрока);
		// заполним авансовые платежи
		ЗаполнитьАвансовыеПлатежи(Основание);
		Основание=Неопределено;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЧекНаОплату") Тогда
		//Для чек на оплату заполняется 1 строка предоплаты
		Если НЕ Основание.ТипСпособаРасчетаККТ = Перечисления.ТипыСпособаРасчетаККТ.Предоплата Тогда
			#Если Клиент Тогда
				Предупреждение("Поступление денежных средств не является авансом. Ввод счета-фактура выданной не требуется.");
			#КонецЕсли
			дкОтменаВводаДокумента(ЭтотОбъект);
			Возврат;
		КонецЕсли;

		Товары.Очистить();
		НоваяСтрока=Товары.Добавить();
		Предоплата = Справочники.Номенклатура.Предоплата;
		НоваяСтрока.Номенклатура=Справочники.Номенклатура.Предоплата;
		ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
		НоваяСтрока.СтавкаНДС=Предоплата.СтавкаНДС;
		ОбработкаРеквизита("Товары.СтавкаНДС",НоваяСтрока);
		НоваяСтрока.СуммаВсего=Основание.СуммаДокумента;
		ОбработкаРеквизита("Товары.СуммаВсего",НоваяСтрока);
		ПлатежноРасчетныеДокументы = СформироватьИмяПлатежногоДокумента(Основание);
		Основание=Неопределено;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Чек") Тогда
		// Чек не делает движений по партиям. Все уже заполнено стандартным обработчиком.
		Основание=Неопределено;
	КонецЕсли;
	
	// получим список уже введенных счетов-фактур
	Если ТипЗнч(ОснованиеОригинал) <> Тип("ДокументСсылка.Выписка")
		И НЕ ДополнительныеСвойства.Свойство("НеИскатьСчетФактуру") Тогда
		СчетФактура = Неопределено;
		МассивВидов = Новый Массив(1); 
		МассивВидов[0] = "СчетФактураВыданный";
		МассивПодчиненных = дкПолучитьМассивПодчиненных(ОснованиеОригинал, МассивВидов, Истина);
		Если НЕ обЗначениеНеЗаполнено(МассивПодчиненных) И МассивПодчиненных.Количество()>0 Тогда
			Если НЕ ТипЗнч(ОснованиеОригинал) = Тип("ДокументСсылка.Выписка") Тогда
				Если МассивПодчиненных[0].Ссылка<>Ссылка Тогда
					СчетФактура = МассивПодчиненных[0].Ссылка;
				КонецЕсли;
			Иначе
				Для ин = 0 По МассивПодчиненных.Количество()-1 Цикл
					СчетФактураТек = МассивПодчиненных[ин].Ссылка;
					Если ВыбСтрока.Контрагент = СчетФактураТек.Контрагент И
						ВыбСтрока.ДоговорВзаиморасчетов = СчетФактураТек.ДоговорВзаиморасчетов И 
						ВыбСтрока.СуммаПриход = СчетФактураТек.СуммаДокумента Тогда
						СчетФактура = СчетФактураТек;
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли;
		// откроем введенную ранее СФ, отменим ввод новой
		Если НЕ СчетФактура = Неопределено Тогда 
			Если СчетФактура.Проведен тогда   //ЧалапАЮ БизТех 14.01.2025 - откроем счф только когда проводим доки
				
				ФормаСФ = СчетФактура.ПолучитьФорму();
				Если ФормаСФ.Открыта() Тогда
					ФормаСФ.Активизировать();
				Иначе
					ФормаСФ.Открыть();
				КонецЕсли;   
			КонецЕсли;
			дкОтменаВводаДокумента(ЭтотОбъект);
			Сообщить("На основании документа " + ОснованиеОригинал + " уже введен " + СчетФактура);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	// заполним авансовые платежи
	Если Не ЗначениеЗаполнено(ПлатежноРасчетныеДокументы) Тогда
		ЗаполнитьАвансовыеПлатежи(Основание);
	КонецЕсли;
	
	Если Основание <> Неопределено Тогда
		// талицы для разбора
		РезультатЗапросаПоТоварам = Неопределено;
		РезультатЗапросаПоГТД     = Неопределено;
		РезультатЗапросаПоРаботам = Неопределено;
		РезультатЗапросаПоАвто    = Неопределено;
		
		// флаги заполнения
		ЗаполнятьТоварами     = Истина;
		ЗаполнятьРаботами     = Ложь;
		ЗаполнятьАвтомобилями = Ложь;
		
		// детальные флаги заполнения товарами
		ЗаполнятьПоГТД        = Истина;
		ЗаполнятьПоПартиям    = Истина;

		ТоварыВременная = Товары.Выгрузить();
		ТоварыВременная.Очистить();
		ТоварыВременная.Колонки.Добавить("НомерСтрокиИсходный", Новый ОписаниеТипов("Число"));
		НомерСтрокиИсходный = 0;
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			// почистим ТЧ
			Товары.Очистить();
			// запрос по документу
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(РеализацияТоваровТовары.НомерСтроки) КАК НомерСтроки,
			|	РеализацияТоваровТовары.Номенклатура КАК Номенклатура,
			|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	РеализацияТоваровТовары.СтавкаНДС КАК СтавкаНДС,
			|	РеализацияТоваровТовары.Партия КАК Партия,
			|	РеализацияТоваровТовары.ГТД КАК ГТД,
			|	СУММА(РеализацияТоваровТовары.КоличествоБазовое) КАК Количество,
			|	СУММА(РеализацияТоваровТовары.КоличествоБазовое) КАК КоличествоОсталось,
			|	СУММА(РеализацияТоваровТовары.СуммаВсего) КАК Сумма,
			|	СУММА(РеализацияТоваровТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(РеализацияТоваровТовары.СуммаНДС) КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
			|ГДЕ
			|	РеализацияТоваровТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровТовары.СтавкаНДС,
			|	РеализацияТоваровТовары.ХарактеристикаНоменклатуры,
			|	РеализацияТоваровТовары.ГТД,
			|	РеализацияТоваровТовары.Номенклатура,
			|	РеализацияТоваровТовары.Партия
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РеализацияТоваровТовары.НомерСтроки)";
			
			Запрос.УстановитьПараметр("Основание",Основание.Ссылка);
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
			|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось,
			|	ГТДПартийТоваровКомпании.Партия
			|ИЗ
			|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
			|ГДЕ
			|	ГТДПартийТоваровКомпании.Регистратор = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.Партия";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка;
			Товары.Очистить();
			
			// настройка разбора строок
			ЗаполнятьПоГТД     = Ложь;
			ЗаполнятьПоПартиям = Ложь;
			ЗаполнятьРаботами  = Истина;
			
			// Запрос по документу
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(КорректировкаРеализацииТовары.НомерСтроки) КАК НомерСтроки,
			|	КорректировкаРеализацииТовары.Номенклатура КАК Номенклатура,
			|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.Коэффициент) КАК Количество,
			|	СУММА(КорректировкаРеализацииТовары.Количество * КорректировкаРеализацииТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК Сумма,
			|	СУММА(КорректировкаРеализацииТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(КорректировкаРеализацииТовары.СуммаНДС) КАК СуммаНДСОсталось,
			|	КорректировкаРеализацииТовары.ГТД КАК ГТД,
			|	КорректировкаРеализацииТовары.Партия КАК Партия,
			|	КорректировкаРеализацииТовары.ГТДДоКорректировки КАК ГТДДоКорректировки
			|ИЗ
			|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
			|ГДЕ
			|	КорректировкаРеализацииТовары.Ссылка = &Основание
			|	И КорректировкаРеализацииТовары.Подтверждение = ИСТИНА
			|
			|СГРУППИРОВАТЬ ПО
			|	КорректировкаРеализацииТовары.СтавкаНДС,
			|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры,
			|	КорректировкаРеализацииТовары.Номенклатура,
			|	КорректировкаРеализацииТовары.ГТД,
			|	КорректировкаРеализацииТовары.Партия,
			|	КорректировкаРеализацииТовары.ГТДДоКорректировки
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(КорректировкаРеализацииТовары.НомерСтроки)";
			
			Запрос.УстановитьПараметр("Основание",Основание);
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			
			ЕстьЗН = Ложь;
			// составим списко документов движений
			ДокОснование = ДокументОснование;
			СписокОснований = Новый СписокЗначений;
			Пока Истина Цикл
				СписокОснований.Добавить(ДокОснование);
				Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда 
					ЕстьЗН = Истина; 
					ЦехОснования = ДокОснование.Цех;
				КонецЕсли;
				Если ТипЗнч(ДокОснование) <> Тип("ДокументСсылка.КорректировкаРеализации") Тогда
					Прервать;
				КонецЕсли;
				ДокОснование = ДокОснование.ДокументОснование;
			КонецЦикла;
			
			Запрос.Текст =
				"
				|ВЫБРАТЬ
				|	ГТДПартийТоваровКомпании.Номенклатура КАК Номенклатура,
				|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ГТДПартийТоваровКомпании.ГТД КАК ГТД,
				|	ГТДПартийТоваровКомпании.Партия КАК Партия,
				|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
				|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось
				|ИЗ
				|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
				|ГДЕ
				|	ГТДПартийТоваровКомпании.Регистратор В (&СписокОснований)
				|
				|СГРУППИРОВАТЬ ПО
				|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
				|	ГТДПартийТоваровКомпании.ГТД,
				|	ГТДПартийТоваровКомпании.Номенклатура,
				|	ГТДПартийТоваровКомпании.Партия
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ТоварыВПроизводстве.Номенклатура КАК Номенклатура,
				|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	ТоварыВПроизводстве.ГТД КАК ГТД,
				|	ТоварыВПроизводстве.Партия КАК Партия,
				|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество,
				|	СУММА(ТоварыВПроизводстве.Количество) КАК КоличествоОсталось
				|ИЗ
				|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
				|ГДЕ
				|	ТоварыВПроизводстве.Регистратор В (&СписокОснований)
				|	И ТоварыВПроизводстве.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
				|	ТоварыВПроизводстве.Номенклатура,
				|	ТоварыВПроизводстве.Партия,
				|	ТоварыВПроизводстве.ГТД
				|";
				
				Запрос.УстановитьПараметр("СписокОснований",СписокОснований);
				РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
				
				// запрос по работам
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ЗаказНарядРаботы.НомерСтроки КАК НомерСтроки,
				|	ЗаказНарядРаботы.Работа КАК Номенклатура,
				|	ЗаказНарядРаботы.Нормочас КАК ЕдиницаИзмерения,
				|	ЗаказНарядРаботы.Коэффициент КАК Коэффициент,
				|	ЗаказНарядРаботы.Количество КАК Количество,
				|	ЗаказНарядРаботы.Цена КАК Цена,
				|	ЗаказНарядРаботы.СтавкаНДС КАК СтавкаНДС,
				|	ЗаказНарядРаботы.СуммаНДС КАК СуммаНДС,
				|	ЗаказНарядРаботы.СуммаВсего КАК СуммаВсего,
				|	ЗаказНарядРаботы.Сумма КАК Сумма
				|ИЗ
				|	Документ.КорректировкаРеализации.Работы КАК ЗаказНарядРаботы
				|ГДЕ
				|	ЗаказНарядРаботы.Ссылка = &Основание
				|	И ЗаказНарядРаботы.Подтверждение = ИСТИНА
				|	И ЗаказНарядРаботы.Количество <> 0
				|
				|УПОРЯДОЧИТЬ ПО
				|	ЗаказНарядРаботы.НомерСтроки";
				РезультатЗапросаПоРаботам = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд") ИЛИ
			ТипЗнч(Основание) = Тип("ДокументСсылка.АктРазногласий") Тогда
			// почистим ТЧ
			Товары.Очистить();
			
			// настройка разбора строок
			ЗаполнятьПоГТД     = Ложь;
			ЗаполнятьПоПартиям = Ложь;
			ЗаполнятьРаботами  = Истина;
			
			ИмяДок = ?(ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаряд"),"ЗаказНаряд","АктРазногласий");
			// запрос по товарам докмента
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ЗаказНарядТовары.НомерСтроки) КАК НомерСтроки,
			|	ЗаказНарядТовары.Номенклатура КАК Номенклатура,
			|	ЗаказНарядТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗаказНарядТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент) КАК Количество,
			|	СУММА(ЗаказНарядТовары.Количество * ЗаказНарядТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(ЗаказНарядТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ЗаказНарядТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(ЗаказНарядТовары.СуммаНДС)   КАК СуммаНДС,
			|	СУММА(ЗаказНарядТовары.СуммаНДС)   КАК СуммаНДСОсталось
			|ИЗ
			|	Документ."+ИмяДок+".Товары КАК ЗаказНарядТовары
			|ГДЕ
			|	ЗаказНарядТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаказНарядТовары.ХарактеристикаНоменклатуры,
			|	ЗаказНарядТовары.Номенклатура,
			|	ЗаказНарядТовары.СтавкаНДС
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ЗаказНарядТовары.НомерСтроки)";
			
			Запрос.УстановитьПараметр("Основание",Основание.Ссылка);
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по работам
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказНарядРаботы.НомерСтроки КАК НомерСтроки,
			|	ЗаказНарядРаботы.Работа КАК Номенклатура,
			|	ЗаказНарядРаботы.Нормочас КАК ЕдиницаИзмерения,
			|	ЗаказНарядРаботы.Коэффициент,
			|	ЗаказНарядРаботы.Количество,
			|	ЗаказНарядРаботы.Цена,
			|	ЗаказНарядРаботы.СтавкаНДС,
			|	ЗаказНарядРаботы.СуммаНДС,
			|	ЗаказНарядРаботы.СуммаВсего,
			|	ЗаказНарядРаботы.Сумма
			|ИЗ
			|	Документ."+ИмяДок+".Работы КАК ЗаказНарядРаботы
			|ГДЕ
			|	"+?( ИмяДок = "АктРазногласий","ЗаказНарядРаботы.Подтверждение = ИСТИНА И ","")+"
			|	ЗаказНарядРаботы.Ссылка = &Основание
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказНарядРаботы.НомерСтроки";
			РезультатЗапросаПоРаботам = Запрос.Выполнить().Выгрузить();
			
			Если ИмяДок = "АктРазногласий" Тогда
				Запрос.УстановитьПараметр("Основание",Основание.ДокументОснование);
			КонецЕсли;
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТоварыВПроизводстве.Номенклатура,
			|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
			|	ТоварыВПроизводстве.ГТД,
			|	ТоварыВПроизводстве.Партия,
			|	СУММА(ТоварыВПроизводстве.Количество) КАК Количество,
			|	СУММА(ТоварыВПроизводстве.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.ТоварыВПроизводстве КАК ТоварыВПроизводстве
			|ГДЕ
			|	ТоварыВПроизводстве.Регистратор = &Основание
			|	И ТоварыВПроизводстве.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВПроизводстве.ХарактеристикаНоменклатуры,
			|	ТоварыВПроизводстве.Номенклатура,
			|	ТоварыВПроизводстве.ГТД,
			|	ТоварыВПроизводстве.Партия";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
			Товары.Очистить();
			ЗаполнятьПоПартиям = Ложь;
			// запрос по документу
			Запрос       = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ОтчетКомиссионераТовары.НомерСтроки) КАК НомерСтроки,
			|	ОтчетКомиссионераТовары.Номенклатура КАК Номенклатура,
			|	ОтчетКомиссионераТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ОтчетКомиссионераТовары.ГТД КАК ГТД,
			|	ОтчетКомиссионераТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ОтчетКомиссионераТовары.Количество * ОтчетКомиссионераТовары.Коэффициент) КАК Количество,
			|	СУММА(ОтчетКомиссионераТовары.Количество * ОтчетКомиссионераТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(ОтчетКомиссионераТовары.СуммаНДС)   КАК СуммаНДС,
			|	СУММА(ОтчетКомиссионераТовары.СуммаНДС)   КАК СуммаНДСОсталось,
			|	СУММА(ОтчетКомиссионераТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ОтчетКомиссионераТовары.СуммаВсего) КАК СуммаОсталось
			|ИЗ
			|	Документ.ОтчетКомиссионера.Товары КАК ОтчетКомиссионераТовары
			|ГДЕ
			|	ОтчетКомиссионераТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомиссионераТовары.Номенклатура,
			|	ОтчетКомиссионераТовары.ХарактеристикаНоменклатуры,
			|	ОтчетКомиссионераТовары.ГТД,
			|	ОтчетКомиссионераТовары.СтавкаНДС
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ОтчетКомиссионераТовары.НомерСтроки)";
			
			Запрос.УстановитьПараметр("Основание",Основание);
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПартииТоваровОтданные.Номенклатура,
			|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
			|	ПартииТоваровОтданные.ГТД,
			|	ПартииТоваровОтданные.Партия,
			|	СУММА(ПартииТоваровОтданные.Количество) КАК Количество,
			|	СУММА(ПартииТоваровОтданные.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
			|ГДЕ
			|	ПартииТоваровОтданные.Регистратор = &Основание
			|	И ПартииТоваровОтданные.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровОтданные.Номенклатура,
			|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
			|	ПартииТоваровОтданные.Партия,
			|	ПартииТоваровОтданные.ГТД";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
			Товары.Очистить();
			// запрос по документу
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ВозвратПоставщикуТовары.НомерСтроки) КАК НомерСтроки,
			|	ВозвратПоставщикуТовары.Номенклатура КАК Номенклатура,
			|	ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВозвратПоставщикуТовары.Партия КАК Партия,
			|	ВозвратПоставщикуТовары.ГТД КАК ГТД,
			|	СУММА(ВозвратПоставщикуТовары.Коэффициент * ВозвратПоставщикуТовары.Количество) КАК Количество,
			|	СУММА(ВозвратПоставщикуТовары.Коэффициент * ВозвратПоставщикуТовары.Количество) КАК КоличествоОсталось,
			|	СУММА(ВозвратПоставщикуТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ВозвратПоставщикуТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ВозвратПоставщикуТовары.СуммаНДС) КАК СуммаНДСОсталось,
			|	ВозвратПоставщикуТовары.СтавкаНДС КАК СтавкаНДС
			|ИЗ
			|	Документ.ВозвратПоставщику.Товары КАК ВозвратПоставщикуТовары
			|ГДЕ
			|	ВозвратПоставщикуТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратПоставщикуТовары.ГТД,
			|	ВозвратПоставщикуТовары.Партия,
			|	ВозвратПоставщикуТовары.ХарактеристикаНоменклатуры,
			|	ВозвратПоставщикуТовары.СтавкаНДС,
			|	ВозвратПоставщикуТовары.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ВозвратПоставщикуТовары.НомерСтроки)";
			
			Запрос.УстановитьПараметр("Основание",Основание);
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	СУММА(-ГТДПартийТоваровКомпании.Количество) КАК Количество,
			|	СУММА(-ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось,
			|	ГТДПартийТоваровКомпании.Партия
			|ИЗ
			|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
			|ГДЕ
			|	ГТДПартийТоваровКомпании.Регистратор = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.Партия";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВозвратПоставщикуАвтомобилей") Тогда
			Товары.Очистить();
			// настройка разбора
			ЗаполнятьПоПартиям    = Ложь;
			ЗаполнятьПоГТД        = Ложь;
			ЗаполнятьАвтомобилями = Истина;
			// запрос по товарам
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Основание",Основание);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ВозвратПоставщикуАвтомобилейТовары.НомерСтроки) КАК НомерСтроки,
			|	ВозвратПоставщикуАвтомобилейТовары.Номенклатура КАК Номенклатура,
			|	ВозвратПоставщикуАвтомобилейТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ВозвратПоставщикуАвтомобилейТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.Количество * ВозвратПоставщикуАвтомобилейТовары.Коэффициент) КАК Количество,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.Количество * ВозвратПоставщикуАвтомобилейТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.СуммаНДС)   КАК СуммаНДС,
			|	СУММА(ВозвратПоставщикуАвтомобилейТовары.СуммаНДС)   КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.ВозвратПоставщикуАвтомобилей.Товары КАК ВозвратПоставщикуАвтомобилейТовары
			|ГДЕ
			|	ВозвратПоставщикуАвтомобилейТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратПоставщикуАвтомобилейТовары.ХарактеристикаНоменклатуры,
			|	ВозвратПоставщикуАвтомобилейТовары.Номенклатура,
			|	ВозвратПоставщикуАвтомобилейТовары.СтавкаНДС
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ВозвратПоставщикуАвтомобилейТовары.НомерСтроки)";
			
			РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.ГТД,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
			|ГДЕ
			|	КомплектацияАвтомобилей.Регистратор = &Основание
			|	И КомплектацияАвтомобилей.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.ГТД,
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
			
			// запрос по автомобилям
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ОстаткиАвтомобилей.Партия КАК Партия,
			|	ОстаткиАвтомобилей.ГТД КАК ГТД,
			|	СУММА(-ОстаткиАвтомобилей.Количество) КАК Количество,
			|	СУММА(-ОстаткиАвтомобилей.Сумма + ЕСТЬNULL(ВложенныйЗапрос.Сумма, 0)) КАК СуммаВсего,
			|	СУММА(-ОстаткиАвтомобилей.СуммаНДС + ЕСТЬNULL(ВложенныйЗапрос.СуммаНДС, 0)) КАК СуммаНДС,
			|	ОстаткиАвтомобилей.СтавкаНДС КАК СтавкаНДС,
			|	ВозвратПоставщикуАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
			|	МИНИМУМ(ВозвратПоставщикуАвтомобилейАвтомобили.НомерСтроки) КАК НомерСтроки
			|ИЗ
			|	Документ.ВозвратПоставщикуАвтомобилей.Автомобили КАК ВозвратПоставщикуАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				КомплектацияАвтомобилей.Автомобиль КАК Автомобиль,
			|				СУММА(КомплектацияАвтомобилей.Сумма) КАК Сумма,
			|				СУММА(КомплектацияАвтомобилей.СуммаНДС) КАК СуммаНДС
			|			ИЗ
			|				РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
			|			ГДЕ
			|				КомплектацияАвтомобилей.Номенклатура ССЫЛКА Справочник.Опции
			|				И КомплектацияАвтомобилей.Регистратор = &Основание
			|			
			|			СГРУППИРОВАТЬ ПО
			|				КомплектацияАвтомобилей.Автомобиль) КАК ВложенныйЗапрос
			|			ПО ОстаткиАвтомобилей.Автомобиль = ВложенныйЗапрос.Автомобиль
			|		ПО ВозвратПоставщикуАвтомобилейАвтомобили.Автомобиль = ОстаткиАвтомобилей.Автомобиль
			|			И ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка = ОстаткиАвтомобилей.Регистратор
			|ГДЕ
			|	ОстаткиАвтомобилей.Регистратор = &Основание
			|	И ВозвратПоставщикуАвтомобилейАвтомобили.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ВозвратПоставщикуАвтомобилейАвтомобили.Автомобиль,
			|	ОстаткиАвтомобилей.СтавкаНДС,
			|	ОстаткиАвтомобилей.Партия,
			|	ОстаткиАвтомобилей.ГТД
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			РезультатЗапросаПоАвто = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераЗаАвтомобили") Тогда 
			
			//<<Павличенко 06.02.18
			Контрагент = Основание.Покупатель;
			ЭтотОбъект.ОбработкаРеквизита("Контрагент");
			ДоговорВзаиморасчетов = Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ЭтотОбъект.ОбработкаРеквизита("ДоговорВзаиморасчетов");
			//>>Павличенко 06.02.18			
			
			Товары.Очистить();
			// настройка разбора
			ЗаполнятьПоПартиям    = Ложь;
			ЗаполнятьПоГТД        = Ложь;
			ЗаполнятьАвтомобилями = Истина;
			
			// запрос по товарам
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Основание",Основание);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ОтчетКомиссионераЗаАвтомобилиТовары.НомерСтроки) КАК НомерСтроки,
			|	ОтчетКомиссионераЗаАвтомобилиТовары.Номенклатура КАК Номенклатура,
			|	ОтчетКомиссионераЗаАвтомобилиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ОтчетКомиссионераЗаАвтомобилиТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.Количество * ОтчетКомиссионераЗаАвтомобилиТовары.Коэффициент) КАК Количество,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.Количество * ОтчетКомиссионераЗаАвтомобилиТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.СуммаНДС)   КАК СуммаНДС,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиТовары.СуммаНДС)   КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.ОтчетКомиссионераЗаАвтомобили.Товары КАК ОтчетКомиссионераЗаАвтомобилиТовары
			|ГДЕ
			|	ОтчетКомиссионераЗаАвтомобилиТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомиссионераЗаАвтомобилиТовары.ХарактеристикаНоменклатуры,
			|	ОтчетКомиссионераЗаАвтомобилиТовары.СтавкаНДС,
			|	ОтчетКомиссионераЗаАвтомобилиТовары.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ОтчетКомиссионераЗаАвтомобилиТовары.НомерСтроки)";
			
			РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ПартииТоваровОтданные.Номенклатура,
			|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры,
			|	ПартииТоваровОтданные.ГТД,
			|	ПартииТоваровОтданные.Партия,
			|	СУММА(ПартииТоваровОтданные.Количество) КАК Количество,
			|	СУММА(ПартииТоваровОтданные.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
			|ГДЕ
			|	ПартииТоваровОтданные.Регистратор = &Основание
			|	И ПартииТоваровОтданные.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПартииТоваровОтданные.ГТД,
			|	ПартииТоваровОтданные.Партия,
			|	ПартииТоваровОтданные.Номенклатура,
			|	ПартииТоваровОтданные.ХарактеристикаНоменклатуры";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
			
			// запрос по авто
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ОтчетКомиссионераЗаАвтомобилиАвтомобили.НомерСтроки) КАК НомерСтроки,
			|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.Автомобиль КАК Номенклатура,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиАвтомобили.Количество) КАК Количество,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиАвтомобили.Сумма) КАК Сумма,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиАвтомобили.СуммаВсего) КАК СуммаВсего,
			|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ОтчетКомиссионераЗаАвтомобилиАвтомобили.СуммаНДС) КАК СуммаНДС,
			|	ЕСТЬNULL(АвтомобилиОтданные.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)) КАК Партия,
			|	ЕСТЬNULL(АвтомобилиОтданные.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК ГТД
			|ИЗ
			|	Документ.ОтчетКомиссионераЗаАвтомобили.Автомобили КАК ОтчетКомиссионераЗаАвтомобилиАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.АвтомобилиОтданные КАК АвтомобилиОтданные
			|		ПО ОтчетКомиссионераЗаАвтомобилиАвтомобили.Ссылка = АвтомобилиОтданные.Регистратор
			|			И ОтчетКомиссионераЗаАвтомобилиАвтомобили.Автомобиль = АвтомобилиОтданные.Автомобиль
			|ГДЕ
			|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.Ссылка = &Основание
			|	И АвтомобилиОтданные.Регистратор = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.Автомобиль,
			|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.СтавкаНДС,
			|	ЕСТЬNULL(АвтомобилиОтданные.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)),
			|	ЕСТЬNULL(АвтомобилиОтданные.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка))
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ОтчетКомиссионераЗаАвтомобилиАвтомобили.НомерСтроки)";
			
			РезультатЗапросаПоАвто = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
			Товары.Очистить();
			// настройка распределения
			ЗаполнятьПоГТД        = Ложь;
			ЗаполнятьПоПартиям    = Ложь;
			ЗаполнятьАвтомобилями = Истина;
			
			// запрос по товарам
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Основание",Основание);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(РеализацияАвтомобилейТовары.НомерСтроки) КАК НомерСтроки,
			|	РеализацияАвтомобилейТовары.Номенклатура КАК Номенклатура,
			|	РеализацияАвтомобилейТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	РеализацияАвтомобилейТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(РеализацияАвтомобилейТовары.Количество * РеализацияАвтомобилейТовары.Коэффициент) КАК Количество,
			|	СУММА(РеализацияАвтомобилейТовары.Количество * РеализацияАвтомобилейТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаВсего) КАК Сумма,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаНДС) КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.РеализацияАвтомобилей.Товары КАК РеализацияАвтомобилейТовары
			|ГДЕ
			|	РеализацияАвтомобилейТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияАвтомобилейТовары.СтавкаНДС,
			|	РеализацияАвтомобилейТовары.ХарактеристикаНоменклатуры,
			|	РеализацияАвтомобилейТовары.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РеализацияАвтомобилейТовары.НомерСтроки)";
			
			РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.ГТД,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
			|ГДЕ
			|	КомплектацияАвтомобилей.Регистратор = &Основание
			|	И КомплектацияАвтомобилей.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	КомплектацияАвтомобилей.ГТД,
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
			
			// запрос по автомобилям
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(РеализацияАвтомобилейАвтомобили.НомерСтроки) КАК НомерСтроки,
			|	РеализацияАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
			|	РеализацияАвтомобилейАвтомобили.Количество КАК Количество,
			|	РеализацияАвтомобилейАвтомобили.Сумма КАК Сумма,
			|	РеализацияАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
			|	РеализацияАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
			|	РеализацияАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
			|	ЕСТЬNULL(ОстаткиАвтомобилей.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)) КАК Партия,
			|	ЕСТЬNULL(ОстаткиАвтомобилей.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка))                 КАК ГТД
			|ИЗ
			|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
			|		ПО РеализацияАвтомобилейАвтомобили.Ссылка = ОстаткиАвтомобилей.Регистратор
			|			И РеализацияАвтомобилейАвтомобили.Автомобиль = ОстаткиАвтомобилей.Автомобиль
			|ГДЕ
			|	РеализацияАвтомобилейАвтомобили.Ссылка = &Основание
			|	И ОстаткиАвтомобилей.Регистратор = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияАвтомобилейАвтомобили.Автомобиль,
			|	РеализацияАвтомобилейАвтомобили.Количество,
			|	РеализацияАвтомобилейАвтомобили.Сумма,
			|	РеализацияАвтомобилейАвтомобили.СтавкаНДС,
			|	РеализацияАвтомобилейАвтомобили.СуммаНДС,
			|	РеализацияАвтомобилейАвтомобили.СуммаВсего,
			|	ЕСТЬNULL(ОстаткиАвтомобилей.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)),
			|	ЕСТЬNULL(ОстаткиАвтомобилей.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка))
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РеализацияАвтомобилейАвтомобили.НомерСтроки)";
			
			РезультатЗапросаПоАвто = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
			ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка;
			Товары.Очистить();
			// настройка распределения
			ЗаполнятьПоГТД        = Ложь;
			ЗаполнятьПоПартиям    = Ложь;
			ЗаполнятьАвтомобилями = Истина;
			
			// запрос по товарам
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Сделка"    , Основание.Сделка);
			Запрос.УстановитьПараметр("Основание" , Основание);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализацияАвтомобилейАвтомобили.ИдентификаторАвтомобиля КАК ИдентификаторАвтомобиля
			|ПОМЕСТИТЬ СписокАвтомобилей
			|ИЗ
			|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК КорректировкаРеализацииАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
			|		ПО КорректировкаРеализацииАвтомобилейАвтомобили.Автомобиль = РеализацияАвтомобилейАвтомобили.Автомобиль
			|ГДЕ
			|	КорректировкаРеализацииАвтомобилейАвтомобили.Ссылка = &Основание
			|	И КорректировкаРеализацииАвтомобилейАвтомобили.Количество = 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МИНИМУМ(РеализацияАвтомобилейТовары.НомерСтроки) КАК НомерСтроки,
			|	РеализацияАвтомобилейТовары.Номенклатура КАК Номенклатура,
			|	РеализацияАвтомобилейТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	РеализацияАвтомобилейТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(РеализацияАвтомобилейТовары.Количество * РеализацияАвтомобилейТовары.Коэффициент) КАК Количество,
			|	СУММА(РеализацияАвтомобилейТовары.Количество * РеализацияАвтомобилейТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаВсего) КАК Сумма,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(РеализацияАвтомобилейТовары.СуммаНДС) КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.РеализацияАвтомобилей.Товары КАК РеализацияАвтомобилейТовары
			|ГДЕ
			|	РеализацияАвтомобилейТовары.Ссылка = &Сделка
			|	И РеализацияАвтомобилейТовары.ИдентификаторАвтомобиля В
			|			(ВЫБРАТЬ
			|				СписокАвтомобилей.ИдентификаторАвтомобиля
			|			ИЗ
			|				СписокАвтомобилей КАК СписокАвтомобилей)
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияАвтомобилейТовары.СтавкаНДС,
			|	РеализацияАвтомобилейТовары.ХарактеристикаНоменклатуры,
			|	РеализацияАвтомобилейТовары.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РеализацияАвтомобилейТовары.НомерСтроки)";
			
			РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры,
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.ГТД,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК Количество,
			|	СУММА(КомплектацияАвтомобилей.Количество) КАК КоличествоОсталось
			|ИЗ
			|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
			|ГДЕ
			|	КомплектацияАвтомобилей.Регистратор = &Сделка
			|	И КомплектацияАвтомобилей.ГТД <> ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	КомплектацияАвтомобилей.ГТД,
			|	КомплектацияАвтомобилей.Партия,
			|	КомплектацияАвтомобилей.Номенклатура,
			|	КомплектацияАвтомобилей.ХарактеристикаНоменклатуры";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
			
			// запрос по автомобилям
			Запрос.Текст =
			"ВЫБРАТЬ
			|	КорректировкаРеализацииАвтомобилейАвтомобили.НомерСтроки КАК НомерСтроки,
			|	КорректировкаРеализацииАвтомобилейАвтомобили.Автомобиль КАК Номенклатура,
			|	1 КАК Количество,
			|	КорректировкаРеализацииАвтомобилейАвтомобили.Сумма КАК Сумма,
			|	КорректировкаРеализацииАвтомобилейАвтомобили.СтавкаНДС КАК СтавкаНДС,
			|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаНДС КАК СуммаНДС,
			|	КорректировкаРеализацииАвтомобилейАвтомобили.СуммаВсего КАК СуммаВсего,
			|	ЕСТЬNULL(ОстаткиАвтомобилей.Партия, ЗНАЧЕНИЕ(Документ.ПоступлениеАвтомобилей.ПустаяСсылка)) КАК Партия,
			|	ЕСТЬNULL(ОстаткиАвтомобилей.ГТД, ЗНАЧЕНИЕ(Справочник.ГТД.ПустаяСсылка)) КАК ГТД
			|ИЗ
			|	Документ.КорректировкаРеализацииАвтомобилей.Автомобили КАК КорректировкаРеализацииАвтомобилейАвтомобили
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
			|		ПО КорректировкаРеализацииАвтомобилейАвтомобили.Автомобиль = ОстаткиАвтомобилей.Автомобиль
			|ГДЕ
			|	КорректировкаРеализацииАвтомобилейАвтомобили.Ссылка = &Основание
			|	И ОстаткиАвтомобилей.Регистратор = &Сделка
			|	И КорректировкаРеализацииАвтомобилейАвтомобили.Количество = 1
			|
			|УПОРЯДОЧИТЬ ПО
			|	КорректировкаРеализацииАвтомобилейАвтомобили.НомерСтроки";
			
			РезультатЗапросаПоАвто = Запрос.Выполнить().Выгрузить();

		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗакрытиеСмены") Тогда
			// очистим ТЧ
			Товары.Очистить();
			
			//настроим
			ЗаполнятьПоГТД     = Ложь;
			ЗаполнятьПоПартиям = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Основание",Основание);
			
			// запрос по товарам
			Запрос.Текст =
			"ВЫБРАТЬ
			|	МИНИМУМ(ЗакрытиеСменыТовары.НомерСтроки) КАК НомерСтроки,
			|	ЗакрытиеСменыТовары.Номенклатура КАК Номенклатура,
			|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	ЗакрытиеСменыТовары.СтавкаНДС КАК СтавкаНДС,
			|	СУММА(ЗакрытиеСменыТовары.Количество * ЗакрытиеСменыТовары.Коэффициент) КАК Количество,
			|	СУММА(ЗакрытиеСменыТовары.Количество * ЗакрытиеСменыТовары.Коэффициент) КАК КоличествоОсталось,
			|	СУММА(ЗакрытиеСменыТовары.СуммаВсего) КАК Сумма,
			|	СУММА(ЗакрытиеСменыТовары.СуммаВсего) КАК СуммаОсталось,
			|	СУММА(ЗакрытиеСменыТовары.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ЗакрытиеСменыТовары.СуммаНДС) КАК СуммаНДСОсталось
			|ИЗ
			|	Документ.ЗакрытиеСмены.Товары КАК ЗакрытиеСменыТовары
			|ГДЕ
			|	ЗакрытиеСменыТовары.Ссылка = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗакрытиеСменыТовары.СтавкаНДС,
			|	ЗакрытиеСменыТовары.ХарактеристикаНоменклатуры,
			|	ЗакрытиеСменыТовары.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(ЗакрытиеСменыТовары.НомерСтроки)";
			
			РезультатзапросаПоТоварам = Запрос.Выполнить().Выгрузить();
			
			// запрос по ГТД
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК Количество,
			|	СУММА(ГТДПартийТоваровКомпании.Количество) КАК КоличествоОсталось,
			|	ГТДПартийТоваровКомпании.Партия
			|ИЗ
			|	РегистрНакопления.ГТДПартийТоваровКомпании КАК ГТДПартийТоваровКомпании
			|ГДЕ
			|	ГТДПартийТоваровКомпании.Регистратор = &Основание
			|
			|СГРУППИРОВАТЬ ПО
			|	ГТДПартийТоваровКомпании.ХарактеристикаНоменклатуры,
			|	ГТДПартийТоваровКомпании.ГТД,
			|	ГТДПартийТоваровКомпании.Номенклатура,
			|	ГТДПартийТоваровКомпании.Партия";
			
			РезультатЗапросаПоГТД = Запрос.Выполнить().Выгрузить();
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияАктивов") Тогда
			
			// Почистим ТЧ.
			Товары.Очистить();
			
			// Настройка распределения.
			ЗаполнятьПоГТД     = Ложь; 
			ЗаполнятьПоПартиям = Ложь;
			ЗаполнятьРаботами  = Ложь;
			
			Запрос = Новый Запрос;
			// Получим данные по автомобилям, соответствующие активам ТЧ.
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РеализацияАктивовАктивы.НомерСтроки КАК НомерСтроки,
			               |	РеализацияАктивовАктивы.ПрочийАктив КАК ПрочийАктив,
			               |	РеализацияАктивовАктивы.Количество КАК Количество
			               |ПОМЕСТИТЬ РеализацияАктивовАктивы
			               |ИЗ
			               |	Документ.РеализацияАктивов.Активы КАК РеализацияАктивовАктивы
			               |ГДЕ
			               |	РеализацияАктивовАктивы.Ссылка = &Ссылка
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	ПрочийАктив
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	РеализацияАктивовАктивы.НомерСтроки КАК НомерСтроки,
			               |	ВводВЭксплуатациюАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			               |	РеализацияАктивовАктивы.ПрочийАктив КАК ПрочийАктив,
			               |	РеализацияАктивовАктивы.Количество КАК Количество
			               |ИЗ
			               |	РеализацияАктивовАктивы КАК РеализацияАктивовАктивы
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводВЭксплуатациюАвтомобилей.Автомобили КАК ВводВЭксплуатациюАвтомобилейАвтомобили
			               |		ПО РеализацияАктивовАктивы.ПрочийАктив = ВводВЭксплуатациюАвтомобилейАвтомобили.Актив
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
						   |	РеализацияАктивовАктивы.НомерСтроки КАК НомерСтроки,
			               |	ВводВЭксплуатациюТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
			               |ИЗ
			               |	РеализацияАктивовАктивы КАК РеализацияАктивовАктивы
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВводВЭксплуатацию.Товары КАК ВводВЭксплуатациюТовары
			               |		ПО РеализацияАктивовАктивы.ПрочийАктив = ВводВЭксплуатациюТовары.Актив
						   |
						   |УПОРЯДОЧИТЬ ПО
						   |	РеализацияАктивовАктивы.НомерСтроки";
			
			Запрос.УстановитьПараметр("Ссылка", Основание.Ссылка);
			
			МассивРезультатовЗапроса = Запрос.ВыполнитьПакет();
			
			ТабАвтомобилей = МассивРезультатовЗапроса[1].Выгрузить();			
			ТабХарактеристикНоменклатур = МассивРезультатовЗапроса[2].Выгрузить();
			
			Для Каждого ТекСтрока Из Основание.Активы Цикл
				НоваяСтрока = ТоварыВременная.Добавить();
				НоваяСтрока.НомерСтрокиИсходный = ТекСтрока.НомерСтроки;
				НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

				Если ТекСтрока.ПрочийАктив.ТипНоменклатуры = Справочники.ТипыНоменклатуры.Автомобили Тогда
					НайденнаяСтрока = ТабАвтомобилей.Найти(ТекСтрока.НомерСтроки, "НомерСтроки");
					НоваяСтрока.Номенклатура = НайденнаяСтрока.Автомобиль;
					
					НоваяСтрока.Количество = 1;
					НоваяСтрока.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
				Иначе
					НоваяСтрока.Номенклатура = ТекСтрока.ПрочийАктив.Номенклатура;
					НайденнаяСтрока = ТабХарактеристикНоменклатур.Найти(ТекСтрока.НомерСтроки, "НомерСтроки");
					Если НайденнаяСтрока <> Неопределено Тогда
						НоваяСтрока.ХарактеристикаНоменклатуры = НайденнаяСтрока.ХарактеристикаНоменклатуры;
					КонецЕсли;
					
					НоваяСтрока.Количество = ТекСтрока.Количество;
					Если НоваяСтрока.Количество = 0 Тогда
						НоваяСтрока.Количество = 1;
					КонецЕсли;
					
					// В реализации активов нет единицы измерения.
					НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения;
					Если НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент <> 1 Тогда
						НоваяСтрока.Количество = НоваяСтрока.Количество / НоваяСтрока.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент;
					КонецЕсли;					
					
				КонецЕсли;
				
				НоваяСтрока.Коэффициент = 1;
				НоваяСтрока.СтавкаНДС = ТекСтрока.СтавкаНДС; 
				НоваяСтрока.СуммаНДС = ТекСтрока.СуммаНДС;
				НоваяСтрока.СуммаВсего = ТекСтрока.Сумма;  
				
				Если ЭтотОбъект.ТипЦен.ЦенаВключаетНДС Тогда
					НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего;
				Иначе
					НоваяСтрока.Сумма = НоваяСтрока.СуммаВсего - НоваяСтрока.СуммаНДС;
				КонецЕсли;
				
				НоваяСтрока.Цена = Окр(НоваяСтрока.Сумма / НоваяСтрока.Количество, 2);
			КонецЦикла;
		КонецЕсли;

		// раскидаем товары по ГТД
		Если ЗаполнятьТоварами И НЕ обЗначениеНеЗаполнено(РезультатзапросаПоТоварам) Тогда
			Если ЗаполнятьПоГТД Тогда
				// пройдемся по товарам с указаным ГТД
				МассивСГТД = Документы.СчетФактураВыданный.ПолучитьСтрокиСГТД(РезультатзапросаПоТоварам);
				Для Каждого стрМассива Из МассивСГТД Цикл
					Если стрМассива.КоличествоОсталось = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Попытка
						ПартияТовара = стрМассива.Партия;
					Исключение
						ПартияТовара = Неопределено;
					КонецПопытки;
					
					Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ГТД",стрМассива.Номенклатура,стрМассива.ХарактеристикаНоменклатуры,стрМассива.ГТД);
					
					Если НЕ обЗначениеНеЗаполнено(ПартияТовара) Тогда
						Отбор.Вставить("Партия",ПартияТовара);
					КонецЕсли;
					
					МассивПоиска = РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
					Для Каждого ТекСтрока Из МассивПоиска Цикл
						Если стрМассива.КоличествоОсталось = 0 Тогда
							Прервать;
						КонецЕсли;
						Если ТекСтрока.КоличествоОсталось = 0 Тогда
							Продолжить;
						КонецЕсли;
						СписываемКоличество = Мин(стрМассива.КоличествоОсталось,ТекСтрока.КоличествоОсталось);
						СписываемСумма      = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаОсталось, Окр((стрМассива.Сумма/стрМассива.Количество)*СписываемКоличество,2));
						СписываемСуммаНДС   = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаНДСОсталось, Окр((стрМассива.СуммаНДС/стрМассива.Количество)*СписываемКоличество,2));
						
						НоваяСтрока = ТоварыВременная.Добавить();
						НоваяСтрока.НомерСтрокиИсходный = стрМассива.НомерСтроки;
						НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

						НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
						ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
						
						НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяСтрока.Количество                 = СписываемКоличество/?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
						НоваяСтрока.ГТД                        = стрМассива.ГТД;
						НоваяСтрока.Партия                     = ТекСтрока.Партия;
						НоваяСтрока.СтавкаНДС                  = стрМассива.СтавкаНДС;
						НоваяСтрока.СуммаВсего                 = СписываемСумма;
						
						НоваяСтрока.СуммаНДС                   = СписываемСуммаНДС;
						ПересчитатьСумму(НоваяСтрока);
						
						// уменьшим нераспределенное количество
						стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
						ТекСтрока.КоличествоОсталось  = ТекСтрока.КоличествоОсталось - СписываемКоличество;
						стрМассива.СуммаОсталось      = стрМассива.СуммаОсталось - СписываемСумма;
						стрМассива.СуммаНДСОсталось   = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЕсли;
			
			// пройдемся по товарам с партиями
			Если ЗаполнятьПоПартиям Тогда
				МассивСПартиями = Документы.СчетФактураВыданный.ПолучитьСтрокиСПартиями(РезультатзапросаПоТоварам);
				Для Каждого стрМассива Из МассивСПартиями Цикл
					Если стрМассива.КоличествоОсталось = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,Партия",стрМассива.Номенклатура,стрМассива.ХарактеристикаНоменклатуры,стрМассива.Партия);
					МассивПоиска = РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
					Для Каждого ТекСтрока Из МассивПоиска Цикл
						Если стрМассива.КоличествоОсталось = 0 Тогда
							Прервать;
						КонецЕсли;
						Если ТекСтрока.КоличествоОсталось = 0 Тогда
							Продолжить;
						КонецЕсли;
						СписываемКоличество = Мин(стрМассива.КоличествоОсталось,ТекСтрока.КоличествоОсталось);
						СписываемСумма      = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаОсталось, Окр((стрМассива.Сумма/стрМассива.Количество)*СписываемКоличество,2));
						СписываемСуммаНДС   = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаНДСОсталось, Окр((стрМассива.СуммаНДС/стрМассива.Количество)*СписываемКоличество,2));
						
						НоваяСтрока = ТоварыВременная.Добавить();
						НоваяСтрока.НомерСтрокиИсходный = стрМассива.НомерСтроки;
						НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

						НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
						ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
						
						НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяСтрока.Количество                 = СписываемКоличество/?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
						НоваяСтрока.ГТД                        = ТекСтрока.ГТД;
						НоваяСтрока.Партия                     = стрМассива.Партия;
						НоваяСтрока.СтавкаНДС                  = стрМассива.СтавкаНДС;
						НоваяСтрока.СуммаВсего                 = СписываемСумма;
						
						НоваяСтрока.СуммаНДС                   = СписываемСуммаНДС;
						ПересчитатьСумму(НоваяСтрока);
						// уменьшим нераспределенное количество
						стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
						ТекСтрока.КоличествоОсталось  = ТекСтрока.КоличествоОсталось - СписываемКоличество;
						стрМассива.СуммаОсталось      = стрМассива.СуммаОсталось - СписываемСумма;
						стрМассива.СуммаНДСОсталось   = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
					КонецЦикла;
					
					// Заполним партиями, по котрым не указан ГТД
					Если стрМассива.КоличествоОсталось > 0 Тогда
						
						НоваяСтрока = ТоварыВременная.Добавить();
						НоваяСтрока.НомерСтрокиИсходный = стрМассива.НомерСтроки;
						НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

						НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
						ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
						
						НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
						НоваяСтрока.Количество                 = стрМассива.КоличествоОсталось/?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
						НоваяСтрока.Партия                     = стрМассива.Партия;
						НоваяСтрока.СтавкаНДС                  = стрМассива.СтавкаНДС;
						НоваяСтрока.СуммаВсего                 = стрМассива.СуммаОсталось;
						
						НоваяСтрока.СуммаНДС                   = стрМассива.СуммаНДСОсталось;
						ПересчитатьСумму(НоваяСтрока);
						
						стрМассива.КоличествоОсталось = 0;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			// простой обход
			РезультатЗапросаПоГТД.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,ГТД,Партия","Количество,КоличествоОсталось");
			Для Каждого стрМассива Из РезультатзапросаПоТоварам Цикл
				Если стрМассива.КоличествоОсталось = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",стрМассива.Номенклатура,стрМассива.ХарактеристикаНоменклатуры);
				
				Попытка
					Если ЗначениеЗаполнено(стрМассива.ГТД) Тогда
						Отбор.Вставить("ГТД", стрМассива.ГТД);
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				Попытка
					Если ЗначениеЗаполнено(стрМассива.Партия) Тогда
						Отбор.Вставить("Партия", стрМассива.Партия);
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				МассивПоиска = РезультатЗапросаПоГТД.НайтиСтроки(Отбор);
				Для Каждого ТекСтрока Из МассивПоиска Цикл
					Если стрМассива.КоличествоОсталось = 0 Тогда
						Прервать;
					КонецЕсли;
					Если ТекСтрока.КоличествоОсталось = 0 Тогда
						Продолжить;
					КонецЕсли;
					СписываемКоличество = Мин(стрМассива.КоличествоОсталось,ТекСтрока.КоличествоОсталось);
					СписываемСумма      = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаОсталось, Окр((стрМассива.Сумма/стрМассива.Количество)*СписываемКоличество,2));
					СписываемСуммаНДС   = ?(стрМассива.КоличествоОсталось = СписываемКоличество, стрМассива.СуммаНДСОсталось, Окр((стрМассива.СуммаНДС/стрМассива.Количество)*СписываемКоличество,2));
					
					НоваяСтрока = ТоварыВременная.Добавить();
					НоваяСтрока.НомерСтрокиИсходный = стрМассива.НомерСтроки;
					НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

					НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
					ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
					
					НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество                 = СписываемКоличество/?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
					НоваяСтрока.ГТД                        = ТекСтрока.ГТД;
					
					НоваяСтрока.Партия                     = ТекСтрока.Партия;

					НоваяСтрока.СтавкаНДС                  = стрМассива.СтавкаНДС;
					НоваяСтрока.СуммаВсего                 = СписываемСумма;
					НоваяСтрока.СуммаНДС                   = СписываемСуммаНДС;
					ПересчитатьСумму(НоваяСтрока);
					
					// уменьшим нераспределенное количество
					стрМассива.КоличествоОсталось = стрМассива.КоличествоОсталось - СписываемКоличество;
					ТекСтрока.КоличествоОсталось  = ТекСтрока.КоличествоОсталось - СписываемКоличество;
					стрМассива.СуммаОсталось      = стрМассива.СуммаОсталось - СписываемСумма;
					стрМассива.СуммаНДСОсталось   = стрМассива.СуммаНДСОсталось - СписываемСуммаНДС;
				КонецЦикла;
				
				// если осталось еще дпишем без гтд
				Если стрМассива.КоличествоОсталось > 0 Тогда
					НоваяСтрока = ТоварыВременная.Добавить();
					НоваяСтрока.НомерСтрокиИсходный = стрМассива.НомерСтроки;
					НомерСтрокиИсходный = НомерСтрокиИсходный + 1;

					НоваяСтрока.Номенклатура = стрМассива.Номенклатура;
					ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
					
					НоваяСтрока.ХарактеристикаНоменклатуры = стрМассива.ХарактеристикаНоменклатуры;
					НоваяСтрока.Количество                 = стрМассива.КоличествоОсталось/?(НоваяСтрока.Коэффициент = 0, 1, НоваяСтрока.Коэффициент);
					НоваяСтрока.ГТД                        = Справочники.ГТД.ПустаяСсылка();
					НоваяСтрока.СтавкаНДС                  = стрМассива.СтавкаНДС;
					НоваяСтрока.СуммаВсего                 = стрМассива.СуммаОсталось;
					
					НоваяСтрока.СуммаНДС                   = стрМассива.СуммаНДСОсталось;
					ПересчитатьСумму(НоваяСтрока);
				ИначеЕсли стрМассива.СуммаОсталось <> 0 ИЛИ стрМассива.СуммаНДСОсталось <> 0 Тогда
					НоваяСтрока.СуммаВсего = НоваяСтрока.СуммаВсего + стрМассива.СуммаОсталось;
					СтараяСуммаНДС         = НоваяСтрока.СуммаНДС;
					
					НоваяСтрока.СуммаНДС   = СтараяСуммаНДС + стрМассива.СуммаНДСОсталось;
					ПересчитатьСумму(СтрокаТоваров);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// перельем работы как есть
		Если ЗаполнятьРаботами И НЕ обЗначениеНеЗаполнено(РезультатЗапросаПоРаботам) Тогда
			Для Каждого ТекСтрока Из РезультатЗапросаПоРаботам Цикл
				НоваяСтрока = ТоварыВременная.Добавить();
				НоваяСтрока.НомерСтрокиИсходный = ТекСтрока.НомерСтроки + НомерСтрокиИсходный;
				НомерСтрокиИсходный = НомерСтрокиИсходный + 1;
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
			КонецЦикла;
		КонецЕсли;
		
		// перельем автомобили
		Если ЗаполнятьАвтомобилями И НЕ обЗначениеНеЗаполнено(РезультатЗапросаПоАвто) Тогда
			Для Каждого СтрокаАвто Из РезультатЗапросаПоАвто Цикл
				НоваяСтрока = ТоварыВременная.Добавить();
				НоваяСтрока.НомерСтрокиИсходный = СтрокаАвто.НомерСтроки + НомерСтрокиИсходный;
				НомерСтрокиИсходный = НомерСтрокиИсходный + 1;
				НоваяСтрока.Номенклатура = СтрокаАвто.Номенклатура;
				ОбработкаРеквизита("Товары.Номенклатура",НоваяСтрока);
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаАвто);
				НоваяСтрока.СуммаНДС = СтрокаАвто.СуммаНДС;
				ПересчитатьСумму(НоваяСтрока);
				НоваяСтрока.Цена = НоваяСтрока.Сумма;
			КонецЦикла;
		КонецЕсли;
		
		Грузополучатель=обПолучитьЗначениеСвойства(Основание, "Грузополучатель");
	КонецЕсли;

	//Если ТоварыВременная <> Неопределено
	//	И ТоварыВременная.Колонки.Найти("НомерСтрокиИсходный") <> Неопределено Тогда
	//    ТоварыВременная.Сортировать("НомерСтрокиИсходный");
	//	Товары.Загрузить(ТоварыВременная);
	//КонецЕсли;   
	
	Если ТоварыВременная <> Неопределено Тогда    //БизТех 07.07.2023г. исправление ошибки
	    ТоварыВременная.Сортировать("НомерСтрокиИсходный");
		Товары.Загрузить(ТоварыВременная);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		Грузополучатель = Контрагент;
	КонецЕсли;
	
	ИдентификаторГосударственногоКонтракта = ?(ЗначениеЗаполнено(ИдентификаторГосударственногоКонтракта),
		ИдентификаторГосударственногоКонтракта,
		ДоговорВзаиморасчетов.ИдентификаторГосударственногоКонтракта);
	ЗаполнитьНомерИсходнойСтроки();
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализацииАвтомобилей") Тогда
		ХозОперация = Справочники.ХозОперации.СчетФактураВыданныйКорректировка;
	Иначе
		ХозОперация = Справочники.ХозОперации.СчетФактураВыданный;
	КонецЕсли;
	
	СуммаНДСДокумента = Товары.Итог("СуммаНДС");
	
	//<<ЧалапАю БизТех 23.12.2024
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		БТ_СтатусСЧФ = "Проведен"
	иначеЕсли РежимЗаписи = РежимЗаписиДокумента.Запись и не ЭтотОбъект.Проведен и не ЭтотОбъект.ПометкаУдаления тогда 
		БТ_СтатусСЧФ = "Записан"    
	иначеЕсли ЭтотОбъект.ПометкаУдаления тогда
		БТ_СтатусСЧФ = "Удален"   
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения и не ЭтотОбъект.ПометкаУдаления тогда
		БТ_СтатусСЧФ = "Записан"
    КонецЕсли;
    //ЧалапАю БизТех 23.12.2024>>

КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
		// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
КешСебестоимостиАвтомобилейКупленныхУФизЛица = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
