#Если Клиент Тогда
// Модуль отчета
	
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем МакетОтчета, ОформлениеСтроки; // оформления
Перем ТаблицаПриход,ТаблицаРасход; // таблицы
Перем СоответствиеХозОперацийПереоценки; // Соответствие хоз операций переоценки
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//Заполняет начальные настройки
//
//Без параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета = "ТекстЗапроса", ИмяМакетаПараметров="Параметры") Экспорт
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

//Формирует текст запроса
//
// Параметры
//   Реж - строка - режим запроса (Движения, Остатки)
//
// Возвращаемое значение:
//   ТекстЗапроса – текст
//
Функция ПолучитьТекстЗапроса()
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВыработкаСотрудников.Сотрудник,
		|	ВЫБОР
		|		КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|			ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|		ИНАЧЕ
		|			ВыработкаСотрудников.Цех
		|	КОНЕЦ КАК Цех
		|ПОМЕСТИТЬ ТаблЦехаСотрудники
		|ИЗ
		|	РегистрНакопления.ВыработкаСотрудников КАК ВыработкаСотрудников
		|ГДЕ
		|	ВыработкаСотрудников.Период МЕЖДУ &ДатаНач И &ДатаКон
		|{
		|ГДЕ
		|	ВыработкаСотрудников.Сотрудник.*
		|}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УРВ_ТабельноеВремя.Сотрудник,
		|	УРВ_ТабельноеВремя.Цех
		|ИЗ
		|	РегистрСведений.УРВ_ТабельноеВремя КАК УРВ_ТабельноеВремя
		|ГДЕ
		|	УРВ_ТабельноеВремя.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И УРВ_ТабельноеВремя.ВидИнтервала.РабочийИнтервал = ИСТИНА
		|{
		|ГДЕ
		|	УРВ_ТабельноеВремя.Сотрудник.*
		|}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрацияВремениРабот.Сотрудник,
		|	ВЫБОР
		|		КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|			РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|		ИНАЧЕ
		|			РегистрацияВремениРабот.РабочееМесто
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|ГДЕ
		|	РегистрацияВремениРабот.Период МЕЖДУ &ДатаНач И &ДатаКон
		|	И РегистрацияВремениРабот.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка)
		|{
		|ГДЕ
		|	РегистрацияВремениРабот.Сотрудник.*
		|}
		|
		|;
		|ВЫБРАТЬ
		|ТаблЦехаСотрудники.Сотрудник,
		|ТаблЦехаСотрудники.Цех
		|ПОМЕСТИТЬ ТаблЦехаСотрудникиГрупп
		|ИЗ
		|ТаблЦехаСотрудники КАК ТаблЦехаСотрудники
		|
		|СГРУППИРОВАТЬ ПО
		|ТаблЦехаСотрудники.Сотрудник,
		|ТаблЦехаСотрудники.Цех
		|;
		|ВЫБРАТЬ
		|	ТаблЦехаСотрудники.Цех КАК Цех,
		|	ТаблЦехаСотрудники.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ТаблВыработка.ВремяПлан, 0)) КАК ВремяПлан,
		|	СУММА(ЕСТЬNULL(ТаблТабельВремя.ВремяТабель, 0)) КАК ВремяТабель,
		|	СУММА(ЕСТЬNULL(ТаблФактВремя.ВремяФакт, 0)) КАК ВремяФакт
		|ИЗ
		|	ТаблЦехаСотрудникиГрупп КАК ТаблЦехаСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВыработкаСотрудников.Сотрудник КАК Сотрудник,
		|			ВЫБОР
		|				КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					ВыработкаСотрудников.Цех
		|			КОНЕЦ КАК Цех,
		|			СУММА(ВыработкаСотрудников.КоличествоНормочасов) КАК ВремяПлан
		|		ИЗ
		|			РегистрНакопления.ВыработкаСотрудников КАК ВыработкаСотрудников
		|		ГДЕ
		|			ВыработкаСотрудников.Период МЕЖДУ &ДатаНач И &ДатаКон
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВЫБОР
		|				КОГДА ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					ВыработкаСотрудников.Цех.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					ВыработкаСотрудников.Цех
		|			КОНЕЦ,
		|			ВыработкаСотрудников.Сотрудник) КАК ТаблВыработка
		|		ПО ТаблЦехаСотрудники.Цех = ТаблВыработка.Цех
		|			И ТаблЦехаСотрудники.Сотрудник = ТаблВыработка.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РегистрацияВремениРабот.Сотрудник КАК Сотрудник,
		|			ВЫБОР
		|				КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					РегистрацияВремениРабот.РабочееМесто
		|			КОНЕЦ КАК Цех,
		|			СУММА(РегистрацияВремениРабот.Продолжительность) КАК ВремяФакт
		|		ИЗ
		|			РегистрСведений.РегистрацияВремениРабот КАК РегистрацияВремениРабот
		|		ГДЕ
		|			РегистрацияВремениРабот.Период МЕЖДУ &ДатаНач И &ДатаКон
		|			И (РегистрацияВремениРабот.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.Работа)
		|			ИЛИ РегистрацияВремениРабот.ВидОтметки = ЗНАЧЕНИЕ(Справочник.ВидыОтметокВремени.РаботаПоУдаленномуПакету))
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РегистрацияВремениРабот.Сотрудник,
		|			ВЫБОР
		|				КОГДА РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности <> ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|					РегистрацияВремениРабот.РабочееМесто.ЦехДляАнализаЭффиктивности
		|				ИНАЧЕ
		|					РегистрацияВремениРабот.РабочееМесто
		|			КОНЕЦ) КАК ТаблФактВремя
		|		ПО ТаблЦехаСотрудники.Сотрудник = ТаблФактВремя.Сотрудник
		|			И ТаблЦехаСотрудники.Цех = ТаблФактВремя.Цех
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УРВ_ТабельноеВремя.Цех КАК Цех,
		|			УРВ_ТабельноеВремя.Сотрудник КАК Сотрудник,
		|			СУММА(УРВ_ТабельноеВремя.Часы) КАК ВремяТабель
		|		ИЗ
		|			РегистрСведений.УРВ_ТабельноеВремя КАК УРВ_ТабельноеВремя
		|		ГДЕ
		|			УРВ_ТабельноеВремя.Период МЕЖДУ &ДатаНач И &ДатаКон
		|			И УРВ_ТабельноеВремя.ВидИнтервала.РабочийИнтервал = ИСТИНА
		|		
		|		СГРУППИРОВАТЬ ПО
		|			УРВ_ТабельноеВремя.Цех,
		|			УРВ_ТабельноеВремя.Сотрудник) КАК ТаблТабельВремя
		|		ПО ТаблЦехаСотрудники.Цех = ТаблТабельВремя.Цех
		|			И ТаблЦехаСотрудники.Сотрудник = ТаблТабельВремя.Сотрудник
		|
		|{
		|ГДЕ
		|	ТаблЦехаСотрудники.Сотрудник.* КАК Сотрудник,
		|	ТаблЦехаСотрудники.Цех.* КАК Цех
		|}
		|СГРУППИРОВАТЬ ПО
		|	ТаблЦехаСотрудники.Цех,
		|	ТаблЦехаСотрудники.Сотрудник
		|ИТОГИ
		|	СУММА(ВремяПлан),
		|	СУММА(ВремяТабель),
		|	СУММА(ВремяФакт)
		|ПО
		|	ОБЩИЕ,
		|	Цех,
		|	Сотрудник";
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапроса()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент (ДокРезультат=Неопределено) Экспорт
	Если ТипЗнч(ДокРезультат) <> Тип("ПолеТабличногоДокумента") И ТипЗнч(ДокРезультат) <> Тип("ТабличныйДокумент") Тогда
		ДокРезультат = Новый ТабличныйДокумент();
	Иначе ДокРезультат.Очистить();
	КонецЕсли;
		
	// проверим корректность заполнения
	Если ДатаНачала > ДатаКонца И ДатаКонца <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты конца периода", 60);
		Возврат ДокРезультат;
	КонецЕсли;
	
		
	// получим макеты для результата и оформления
	Макет = ПолучитьМакет("Основной");
		
	
	// СОЗДАДИМ ЗАПРОС
	Запрос = Новый Запрос;
	
	Настройки = ПостроительОтчета.ПолучитьНастройки(Истина,Ложь,Ложь,Ложь,Ложь);
	ПостроительОтчета.Текст = ПолучитьТекстЗапроса();
	ПостроительОтчета.УстановитьНастройки(Настройки,Истина,Ложь,Ложь,Ложь,Ложь);
	ПостроительОтчета.Параметры.Вставить("ДатаНач", НачалоДня(ДатаНачала));
	ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ДатаКонца));
	ПостроительОтчета.Выполнить();
	ВыборкаИтоги = ПостроительОтчета.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ДокРезультат.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ДокРезультат.Вывести(ОбластьМакета);
	
	ДокРезультат.ОтображатьГруппировки = Истина;
	ДокРезультат.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаИтоги.Следующий() Цикл
		СтрокаИтогов = ВыборкаИтоги;
		ВыборкаЦеха = ВыборкаИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЦеха.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("СтрокаЦех");
			ОбластьМакета.Параметры.Заполнить(ВыборкаЦеха);
			ОбластьМакета.Параметры.Продуктивность = ?(ВыборкаЦеха.ВремяТабель<>0 И ВыборкаЦеха.ВремяТабель<>NULL, ВыборкаЦеха.ВремяПлан/ВыборкаЦеха.ВремяТабель,0);
			ОбластьМакета.Параметры.Эффективность = ?(ВыборкаЦеха.ВремяФакт<>0 И ВыборкаЦеха.ВремяФакт<>NULL, ВыборкаЦеха.ВремяПлан/ВыборкаЦеха.ВремяФакт,0);
			ОбластьМакета.Параметры.КоэффициентИспользования = ?(ВыборкаЦеха.ВремяТабель<>0 И ВыборкаЦеха.ВремяТабель<>NULL, ВыборкаЦеха.ВремяФакт/ВыборкаЦеха.ВремяТабель,0);
			ДокРезультат.Вывести(ОбластьМакета, 1);
			
			ВыборкаСотрудник = ВыборкаЦеха.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСотрудник.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаСотрудник");
				ОбластьМакета.Параметры.Заполнить(ВыборкаСотрудник);
				ОбластьМакета.Параметры.Ресурс = ВыборкаСотрудник.Сотрудник;
				ОбластьМакета.Параметры.Продуктивность = ?(ВыборкаСотрудник.ВремяТабель<>0 И ВыборкаСотрудник.ВремяТабель<>NULL, ВыборкаСотрудник.ВремяПлан/ВыборкаСотрудник.ВремяТабель,0);
				ОбластьМакета.Параметры.Эффективность = ?(ВыборкаСотрудник.ВремяФакт<>0 И ВыборкаСотрудник.ВремяФакт<>NULL, ВыборкаСотрудник.ВремяПлан/ВыборкаСотрудник.ВремяФакт,0);
				ОбластьМакета.Параметры.КоэффициентИспользования = ?(ВыборкаСотрудник.ВремяТабель<>0 И ВыборкаСотрудник.ВремяТабель<>NULL, ВыборкаСотрудник.ВремяФакт/ВыборкаСотрудник.ВремяТабель,0);
				ДокРезультат.Вывести(ОбластьМакета, 2);
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтоги");
		ОбластьМакета.Параметры.Заполнить(СтрокаИтогов);
		ОбластьМакета.Параметры.Продуктивность = ?(СтрокаИтогов.ВремяТабель<>0 И СтрокаИтогов.ВремяТабель<>NULL, СтрокаИтогов.ВремяПлан/СтрокаИтогов.ВремяТабель,0);
		ОбластьМакета.Параметры.Эффективность = ?(СтрокаИтогов.ВремяФакт<>0 И СтрокаИтогов.ВремяФакт<>NULL, СтрокаИтогов.ВремяПлан/СтрокаИтогов.ВремяФакт,0);
		ОбластьМакета.Параметры.КоэффициентИспользования = ?(СтрокаИтогов.ВремяТабель<>0 И СтрокаИтогов.ВремяТабель<>NULL, СтрокаИтогов.ВремяФакт/СтрокаИтогов.ВремяТабель,0);
		ДокРезультат.Вывести(ОбластьМакета,1);
	КонецЦикла;
	
	ДокРезультат.ЗакончитьАвтогруппировкуСтрок();
	ДокРезультат.ЗакончитьАвтогруппировкуКолонок();
	ДокРезультат.ПоказатьУровеньГруппировокСтрок(1);
	ДокРезультат.ТолькоПросмотр = Истина;
	ДокРезультат.ФиксацияСлева = 3;
	ДокРезультат.ФиксацияСверху = 3;

	
	Возврат ДокРезультат;
КонецФункции // СформироватьТабличныйДокумент()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
	
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();



#КонецЕсли
