// Модуль справочника Опции автомобилей

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);

    Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("СтавкаНДС",1);
		Если обПраво("НомерПоКаталогуУникальный",Права) Тогда
			ОбязательныеРеквизиты.Вставить("Артикул",3);
		КонецЕсли; 
		Если ПризнакНабора ИЛИ ПризнакКомплекта Тогда
			ОбязательныеНабор=Новый Структура();
			ОбязательныеНабор.Вставить("Опция",3);
			ОбязательныеНабор.Вставить("Количество",1);
			ОбязательныеРеквизиты.Вставить("СоставНабора",ОбязательныеНабор);
		КонецЕсли; 
		ОбязательныеРеквизиты.Вставить("ВалютаУчета",1);
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;

	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	Если НЕ ЭтоГруппа И НЕ ПроверитьКорректностьСтавкиНДС() Тогда
		дкДобавитьОшибку(Ошибки, "Указана недействительная ставка НДС!");
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок
	Возврат Истина;
КонецФункции

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя="СтавкаНДС" Тогда
		// Выведем предупреждение
		#Если Клиент Тогда
			Если НЕ ПроверитьКорректностьСтавкиНДС() Тогда
				Сообщить("Выбрана недействительная ставка НДС!", СтатусСообщения.Внимание);
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание)
	РодительскаяГруппа=ЭтотОбъект.Родитель;
	Пока НЕ РодительскаяГруппа.Пустая() Цикл
		Если (НЕ РодительскаяГруппа.СтавкаНДС.Пустая()) И (СтавкаНДС.Пустая()) Тогда
			СтавкаНДС=РодительскаяГруппа.СтавкаНДС; Прервать;
		КонецЕсли; 
		РодительскаяГруппа=РодительскаяГруппа.Родитель;
	КонецЦикла; 
	Если СтавкаНДС.Пустая() Тогда
		СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
	КонецЕсли; 
	Если (НЕ ЭтоГруппа) И (обЗначениеНеЗаполнено(ВалютаУчета)) Тогда
		ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	КонецЕсли; 

	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	спПриКопировании(ЭтотОбъект, ОбъектКопирования);
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	Если (НЕ ЭтоГруппа) И (НЕ ПризнакНабора) И (НЕ ПризнакКомплекта) Тогда
		СоставНабора.Очистить();
	КонецЕсли;
	спПередЗаписью(ЭтотОбъект, Отказ);
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	спПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	спПередУдалением(ЭтотОбъект, Отказ);
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Проверим корректность ставки НДС для устранения ситуации выбора ставки НДС 18%
//
Функция ПроверитьКорректностьСтавкиНДС() Экспорт
	
	// По закону с 01.01.2019 вместо ставки НДС 18% необходимо использовать ставку НДС 20%.
	// По закону с 01.01.2026 вместо ставки НДС 20% необходимо использовать ставку НДС 22%.	
	
	ТекДата = ТекущаяДатаСеанса();
	
	СтавкаНДСНоменклатуры = СтавкаНДС.Ставка;
	
	// !!!_Переход на ставку НДС 20%
	// После 01.01.2019 убрать проверку на ввод ставки НДС 20%
	
	//Снимченко_bizteh++
	Если ТекДата < Дата("20260101") Тогда
		Если СтавкаНДСНоменклатуры = 22 Тогда
			Возврат Ложь;
		КонецЕсли;
	//Снимченко_bizteh--
	ИначеЕсли ТекДата < Дата("20190101") Тогда
		Если СтавкаНДСНоменклатуры = 20 Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Если СтавкаНДСНоменклатуры = 18 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьКорректностьСтавкиНДС()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
