#Область ИнформацияОДокументе

//************************//
// ИНФОРМАЦИЯ О ДОКУМЕНТЕ //
//************************//


// Возвращает доступные варианты печати документа
// Параметры:
//	ДокументСсылка - Ссылка на документ печати
// Возвращаемое значение:
//	Структура, каждая строка которой соответствует одному из вариантов печати. Первый элемент структуры - форма по умолчанию
Функция ПолучитьСписокПечатныхФорм(ДокументСсылка) Экспорт
	
	СтруктураМакетов = Новый Структура();
	
	СтруктураМакетов.Вставить("ПриходныйСкладскойОрдерНаАвтомобили" , "Приходный ордер");
	СтруктураМакетов.Вставить("М4"                                  , "Форма М-4");
	СтруктураМакетов.Вставить("КартаСклада"                         , "Карта склада");
	СтруктураМакетов.Вставить("МХ1"                                 , "МХ-1 (Акт о приеме-передаче ТМЦ)");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСписокПечатныхФорм()


#КонецОбласти