// Модуль документа КорректировкаБонусов

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеРеквизиты = Новый Структура();
	
	ОбязательныеРеквизиты.Вставить("Автор", 1);
	ОбязательныеРеквизиты.Вставить("Организация", 1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании", 1);
	//ОбязательныеРеквизиты.Вставить("БонуснаяПрограмма", 1);
	
	ОбязательныеРеквизитыТЧ = Новый Структура;
	ОбязательныеРеквизитыТЧ.Вставить("Карточка", 3);
	ОбязательныеРеквизитыТЧ.Вставить("ДатаСписания", 3);
	
	ОбязательныеРеквизиты.Вставить("БонусыКНачислению", ОбязательныеРеквизитыТЧ);
	ОбязательныеРеквизиты.Вставить("БонусыКСписанию", ОбязательныеРеквизитыТЧ);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	
	СписокХозОпераций.Добавить("КорректировкаБонусов", "Корректировка бонусов", Истина);
	
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	
	Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры


#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
	// выполним движения приход
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаБонусовБонусыКНачислению.Ссылка КАК Регистратор,
	|	КорректировкаБонусовБонусыКНачислению.Ссылка.Дата КАК Период,
	|	КорректировкаБонусовБонусыКНачислению.Карточка КАК БонуснаяКарта,
	|	КорректировкаБонусовБонусыКНачислению.ДатаСписания КАК ДатаСписанияБонусов,
	|	КорректировкаБонусовБонусыКНачислению.Количество,
	|	КорректировкаБонусовБонусыКНачислению.КоличествоКНачислению,
	|	КорректировкаБонусовБонусыКНачислению.Ссылка.ХозОперация КАК ХозОперация,
	|	КорректировкаБонусовБонусыКНачислению.Ссылка.БонуснаяПрограмма КАК БонуснаяПрограмма,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ИЗ
	|	Документ.КорректировкаБонусов.БонусыКНачислению КАК КорректировкаБонусовБонусыКНачислению
	|ГДЕ
	|	КорректировкаБонусовБонусыКНачислению.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Набор = Движения.БонусныеБаллы;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(набор.Добавить(), Выборка);
	КонецЦикла;
	
	// выполним расходные движения
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаБонусовБонусыКСписанию.Ссылка,
	|	КорректировкаБонусовБонусыКСписанию.Ссылка.Дата,
	|	КорректировкаБонусовБонусыКСписанию.Ссылка.ХозОперация,
	|	КорректировкаБонусовБонусыКСписанию.Ссылка.БонуснаяПрограмма,
	|	КорректировкаБонусовБонусыКСписанию.Карточка,
	|	КорректировкаБонусовБонусыКСписанию.ДатаСписания,
	|	КорректировкаБонусовБонусыКСписанию.Количество,
	|	КорректировкаБонусовБонусыКСписанию.КоличествоКНачислению
	|ПОМЕСТИТЬ ДокТаб
	|ИЗ
	|	Документ.КорректировкаБонусов.БонусыКСписанию КАК КорректировкаБонусовБонусыКСписанию
	|ГДЕ
	|	КорректировкаБонусовБонусыКСписанию.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокТаб.Ссылка КАК Регистратор,
	|	ДокТаб.Дата КАК Период,
	|	ДокТаб.ХозОперация,
	|	ДокТаб.Карточка КАК БонуснаяКарта,
	|	ДокТаб.ДатаСписания КАК ДатаСписанияБонусов,
	|	ДокТаб.Количество,
	|	ДокТаб.КоличествоКНачислению,
	|	ЕСТЬNULL(БонусныеБаллыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(БонусныеБаллыОстатки.КоличествоКНачислениюОстаток, 0) КАК КоличествоКНачислениюОстаток,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ДокТаб.БонуснаяПрограмма
	|ИЗ
	|	ДокТаб КАК ДокТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БонусныеБаллы.Остатки(
	|				&Момент,
	|				(БонуснаяКарта, ДатаСписанияБонусов) В
	|					(ВЫБРАТЬ
	|						ДокТаб.Карточка,
	|						ДокТаб.ДатаСписания
	|					ИЗ
	|						ДокТаб КАК ДокТаб)) КАК БонусныеБаллыОстатки
	|		ПО ДокТаб.Карточка = БонусныеБаллыОстатки.БонуснаяКарта
	|			И ДокТаб.ДатаСписания = БонусныеБаллыОстатки.ДатаСписанияБонусов";
	Запрос.УстановитьПараметр("Момент", МоментВремени());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// Наложим блокировку на считываемые данные
		СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрНакопления", "БонусныеБаллы");
		
		ЗначенияБлокировки = Новый Соответствие;
		ЗначенияБлокировки.Вставить("Период"       , Новый Диапазон(, Дата));
		
		СтруктураПараметровБлокировки.Вставить("ИсточникДанных", РезультатЗапроса.Выгрузить());
		
		ОписаниеИсточника = Новый Соответствие;
		ОписаниеИсточника.Вставить("БонуснаяКарта"       , "БонуснаяКарта");
		ОписаниеИсточника.Вставить("ДатаСписанияБонусов" , "ДатаСписанияБонусов");
		
		обУстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
		
		// списание
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество <> 0 И (Выборка.Количество > Выборка.КоличествоОстаток) Тогда
				дкСообщитьРезультат("Не хватает баллов в количестве " + (Выборка.Количество-Выборка.КоличествоОстаток), "Важное&Бонусные баллы:", ЭтотОбъект);
				Отказ = Истина;
			КонецЕсли;
			
			Если Выборка.КоличествоКНачислению <> 0 И (Выборка.КоличествоКНачислению > Выборка.КоличествоКНачислениюОстаток) Тогда
				дкСообщитьРезультат("Не хватает начисленных баллов в количестве " + (Выборка.КоличествоКНачислению-Выборка.КоличествоКНачислениюОстаток), "Важное&Бонусные баллы:", ЭтотОбъект);
				Отказ = Истина;
			КонецЕсли;
			
			Если Отказ Тогда Продолжить; КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;

#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

