#Область КонсольКода

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовленныйКодАлгоритма(ТекстКода, Переменные)
	ПодготовленныйКод="";
	
	Для НомерПеременной = 0 По Переменные.Количество() - 1 Цикл
		ТекПеременная=Переменные[НомерПеременной];
		ПодготовленныйКод=ПодготовленныйКод + Символы.ПС + ТекПеременная.Имя + "=Переменные[" + Формат(НомерПеременной,
		"ЧН=0; ЧГ=0;") + "].Значение;";
	КонецЦикла;
	
	ПодготовленныйКод=ПодготовленныйКод + Символы.ПС + ТекстКода;
	
	Возврат ПодготовленныйКод;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьАлгоритм(ТекстАлгоритма, Переменные, СтруктураПередачи)
	Успешно = Истина;
	ОписаниеОшибки = "";
	
	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		ЗначениеМодуля=0;
		Выполнить (СокрЛП(ТекстАлгоритма));
	Исключение
		Успешно = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
	КонецПопытки;
	ОкончаниеВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Успешно", Успешно);
	РезультатВыполнения.Вставить("ВремяВыполнения", ОкончаниеВыполнения - НачалоВыполнения);
	РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	РезультатВыполнения.Вставить("ЗначениеМодуля", ЗначениеМодуля);
	
	Возврат РезультатВыполнения;
КонецФункции


&НаСервере
Процедура ВыполнитьАлгоритмНаСервере(СтруктураПередачи)
	КодАлгоритма = ПодготовленныйКодАлгоритма(ТекстАлгоритмаСервер, ПеременныеСервер);
	
	Если Не ЗначениеЗаполнено(СокрЛП(КодАлгоритма)) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыВыполнения = ВыполнитьАлгоритм(КодАлгоритма, ПеременныеСервер, СтруктураПередачи);
	
	Если РезультатыВыполнения.Успешно Тогда
		ЗаголовокЭлемента = "&&НаСервере (Время выполнения кода: " + Строка((РезультатыВыполнения.ВремяВыполнения)
		/ 1000) + " сек.)";
	Иначе
		ЗаголовокЭлемента = "&&НаСервере";
	КонецЕсли;
	Элементы.ТекстЗаголовок.Заголовок = ЗаголовокЭлемента;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстРедактора(ИдентификаторРедактора, ТекстАлгоритма)
	
	РедакторКодаКлиент.УстановитьТекстРедактора(ЭтотОбъект, ИдентификаторРедактора, ТекстАлгоритма);
	ДобавитьДополнительныйКонтекстВРедакторКода(ИдентификаторРедактора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДополнительныйКонтекстВРедакторКода(ИдентификаторРедактора)
КонецПроцедуры

&НаКлиенте
Процедура ПеременныеСерверПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ДобавитьДополнительныйКонтекстВРедакторКода("Сервер");
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСервер()
	Попытка
		УстановитьТекстРедактора("Сервер",ТекстАлгоритмаСервер);
	Исключение
		ПодключитьОбработчикОжидания("ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСервер", 0.5, Истина);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСерверРасшифровка()
	Попытка
		УстановитьТекстРедактора("СерверРасшифровка",ТекстАлгоритмаСерверРасшифровка);
	Исключение
		ПодключитьОбработчикОжидания("ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСерверРасшифровка", 0.5, Истина);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти


#Область КонсольЗапросов

&НаКлиенте
Процедура ИзЗапроса(Команда)
	стОшибка = ПараметрыЗаполнитьИзЗапросаНаСервере("Запрос");
	
	Если ЗначениеЗаполнено(стОшибка) Тогда
		
		ПоказатьПредупреждениеКонсоли(стОшибка.ОписаниеОшибки);
		ТекущийЭлемент = Элементы.ТекстЗапроса;
		
		Если ЗначениеЗаполнено(стОшибка.Строка) Тогда
			Элементы.ТекстЗапроса.УстановитьГраницыВыделения(стОшибка.Строка, стОшибка.Колонка, стОшибка.Строка,
			стОшибка.Колонка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапрос(Команда)
	ПараметрыФормы = Новый Структура("ТекстЗапроса", Объект.ТЗапроса);
	ПараметрыФормы.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	Результат = ОткрытьФорму("Обработка.МТ_КонсольЗапросов.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,,
	Новый ОписаниеОповещения("СформироватьЗапросЗавершение", ЭтаФорма));
	
КонецПроцедуры

Процедура СформироватьЗапросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры

#Область ПараметрыЗапроса
&НаКлиенте
Процедура ПоказатьПредупреждениеКонсоли(ТекстПредупреждения) Экспорт
	ПоказатьПредупреждение( , ТекстПредупреждения, , Объект.Заголовок);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РазобратьОшибкуЗапроса(СтрокаОшибки, НомерСтроки, НомерКолонки)
	
	маЧасти = СтрРазделить(СтрокаОшибки, ":");
	маКоординаты = Неопределено;
	Если маЧасти.Количество() > 2 Тогда
		СтрокаКоординатОшибки = СокрЛП(маЧасти[2]);
		Если маЧасти.Количество() > 2 И СтрДлина(СтрокаКоординатОшибки) > 5 И Лев(СтрокаКоординатОшибки, 2) = "{(" Тогда
			маКоординаты = СтрРазделить(Сред(СтрокаКоординатОшибки, 3, СтрДлина(СтрокаКоординатОшибки) - 4), ",");
			маЧасти[0] = "";
			маЧасти[1] = "";
		Иначе
			маЧасти[0] = "";
		КонецЕсли;
	КонецЕсли;
	
	Разделитель = ": ";
	СтрокаОшибки = СтрСоединить(маЧасти, Разделитель);
	Пока Лев(СтрокаОшибки, СтрДлина(Разделитель)) = Разделитель Цикл
		СтрокаОшибки = Прав(СтрокаОшибки, СтрДлина(СтрокаОшибки) - СтрДлина(Разделитель));
	КонецЦикла;
	
	НомерСтроки = Неопределено;
	НомерКолонки = Неопределено;
	Если маКоординаты <> Неопределено Тогда
		НомерСтроки = Число(маКоординаты[0]);
		НомерКолонки = Число(маКоординаты[1]);
	КонецЕсли;
	
КонецПроцедуры

//Работа с параметром запроса, хранимым в виде строки таблицы ПараметрыЗапроса. Далее везде параметр с именем "СтрокаИд" - это идентификатор строка этой таблицы.
Функция ОписаниеТиповПоТипу(Тип)
	маТипы = Новый Массив;
	маТипы.Добавить(Тип);
	Возврат Новый ОписаниеТипов(маТипы);
КонецФункции

&НаСервереБезКонтекста
Функция ТекмтПодзапросаПоискаМоментов(ИмяМетаданныхДляЗапроса, ИмяРегистра, ИмяКолонки, ИмяПромежуточнойТаблицы,
	ТекстПоместить)
	Возврат СтрШаблон(
	"ВЫБРАТЬ
	|	%1%2.Период КАК Дата,
	|	%1%2.Регистратор КАК Ссылка,
	|	%1%2.МоментВремени КАК МоментВремени %4
	|ИЗ
	|	%1.%2 КАК %1%2 ВНУТРЕННЕЕ СОЕДИНЕНИЕ %5_ДанныеМоментов_%3 ПО %1%2.Регистратор = %5_ДанныеМоментов_%3.Ссылка И %1%2.Период = %5_ДанныеМоментов_%3.Дата
	|", ИмяМетаданныхДляЗапроса, ИмяРегистра, ИмяКолонки, ТекстПоместить, ИмяПромежуточнойТаблицы);
	
КонецФункции

&НаСервере
Процедура ПодготовитьВыборкуКолонокСТипомМоментВремени(тзДанные, ИмяПромежуточнойТаблицы, стНовыеВыраженияПолей,
	ДополнительныеИсточники, ДополнительныеЗапросы)
	
	//Обработка = РеквизитФормыВЗначение("Объект");
	
	маИменаКолонокМоментов = Новый Массив;
	//маИменаТаблицМоментовПоля = Новый Массив;
	маИменаКолонокДата = Новый Массив;
	маИменаКолонокСсылка = Новый Массив;
	маЗапросыДляПоискаМоментов = Новый Массив;
	
	Для Каждого Колонка Из тзДанные.Колонки Цикл
		
		Если Колонка.ТипЗначения.СодержитТип(Тип("МоментВремени")) Тогда
			
			ИмяКолонки = Колонка.Имя;
			ИмяКолонкиДата = ИмяКолонки + "_Дата31415926";
			ИмяКолонкиСсылка = ИмяКолонки + "_Ссылка31415926";
			ИмяКолонкиВременной = ИмяКолонки + "_Вр31415926";
			
			маИменаКолонокМоментов.Добавить(ИмяКолонки);
			маИменаКолонокДата.Добавить(ИмяКолонкиДата);
			маИменаКолонокСсылка.Добавить(ИмяКолонкиСсылка);
			
			маВычитаемыеТипы = Новый Массив;
			маВычитаемыеТипы.Добавить(Тип("МоментВремени"));
			маДобавляемыеТипы = Новый Массив;
			маДобавляемыеТипы.Добавить(Тип("Null"));
			ТипБезТипаМомент = Новый ОписаниеТипов(Колонка.ТипЗначения, маДобавляемыеТипы, маВычитаемыеТипы);
			ТолькоМомент = ТипБезТипаМомент = Новый ОписаниеТипов("Null");//Значит, что в колонке был только момент времени.
			//Вообще, так должно быть всегда. Не представляю ситуации, когда в колонке с моментом времени может быть что-то еще.
			
			тзДанные.Колонки.Добавить(ИмяКолонкиДата, Новый ОписаниеТипов("Дата", , ,
			Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
			тзДанные.Колонки.Добавить(ИмяКолонкиСсылка, Документы.ТипВсеСсылки());
			
			Если Не ТолькоМомент Тогда
				тзДанные.Колонки.Добавить(ИмяКолонкиВременной, ТипБезТипаМомент);
			КонецЕсли;
			
			маТипыСсылокМоментов = Новый Массив;
			
			Если ТолькоМомент Тогда
				
				Для Каждого СтрокаДанных Из тзДанные Цикл
					Значение = СтрокаДанных[ИмяКолонки];
					СтрокаДанных[ИмяКолонкиДата] = Значение.Дата;
					СтрокаДанных[ИмяКолонкиСсылка] = Значение.Ссылка;
					маТипыСсылокМоментов.Добавить(ТипЗнч(Значение.Ссылка));
				КонецЦикла;
				
			Иначе
				
				Для Каждого СтрокаДанных Из тзДанные Цикл
					Значение = СтрокаДанных[ИмяКолонки];
					Если ТипЗнч(Значение) = Тип("МоментВремени") Тогда
						СтрокаДанных[ИмяКолонкиВременной] = Null;
						СтрокаДанных[ИмяКолонкиДата] = Значение.Дата;
						СтрокаДанных[ИмяКолонкиСсылка] = Значение.Ссылка;
						маТипыСсылокМоментов.Добавить(ТипЗнч(Значение.Ссылка));
					Иначе
						СтрокаДанных[ИмяКолонкиВременной] = Значение;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			тзДанные.Колонки.Удалить(ИмяКолонки);
			Если Не ТолькоМомент Тогда
				тзДанные.Колонки[ИмяКолонкиВременной].Имя = ИмяКолонки;
			КонецЕсли;
			
			ИмяТаблицыМоментовПоля = ИмяПромежуточнойТаблицы + "_ТаблицаМоментов_" + ИмяКолонки;
			ТекстПоместить = "ПОМЕСТИТЬ " + ИмяТаблицыМоментовПоля;
			
			Если ТолькоМомент Тогда
				стНовыеВыраженияПолей.Вставить(ИмяКолонки, СтрШаблон("%1.МоментВремени КАК %2", ИмяТаблицыМоментовПоля,
				ИмяКолонки));
			Иначе
				стНовыеВыраженияПолей.Вставить(ИмяКолонки, СтрШаблон("ISNULL(Таблица.%1, %2.МоментВремени) КАК %3",
				ИмяКолонки, ИмяТаблицыМоментовПоля, ИмяКолонки));
			КонецЕсли;
			
			ДополнительныеИсточники = ДополнительныеИсточники + СтрШаблон(
			" ЛЕВОЕ СОЕДИНЕНИЕ %1 КАК %1 ПО Таблица.%2 = %1.Дата И Таблица.%3 = %1.Ссылка", ИмяТаблицыМоментовПоля,
			ИмяКолонкиДата, ИмяКолонкиСсылка);
			
			маПодЗапросыДляПоискаМоментов = Новый Массив;
			
			маМетаданныеДляПоискаМомента = Новый Массив;
			маМетаданныеДляПоискаМомента.Добавить(Метаданные.РегистрыНакопления);
			маМетаданныеДляПоискаМомента.Добавить(Метаданные.РегистрыБухгалтерии);
			
			ТипыСсылокМоментов = Новый ОписаниеТипов(маТипыСсылокМоментов);
			маТипыСсылокМоментов = ТипыСсылокМоментов.Типы();
			
			Для Каждого Регистры Из маМетаданныеДляПоискаМомента Цикл
				
				Если Регистры = Метаданные.РегистрыНакопления Тогда
					ИмяМетаданныхДляЗапроса = "РегистрНакопления";
				ИначеЕсли Регистры = Метаданные.РегистрыБухгалтерии Тогда
					ИмяМетаданныхДляЗапроса = "РегистрБухгалтерии";
				Иначе
					ИмяМетаданныхДляЗапроса = "?E001?";
				КонецЕсли;
				
				Для Каждого Регистр Из Регистры Цикл
					
					ТипРегистратора = Регистр.СтандартныеРеквизиты.Регистратор.Тип;
					Для Каждого ТипСсылки Из маТипыСсылокМоментов Цикл
						
						Если ТипРегистратора.СодержитТип(ТипСсылки) Тогда
							
							маПодЗапросыДляПоискаМоментов.Добавить(ТекмтПодзапросаПоискаМоментов(
							ИмяМетаданныхДляЗапроса, Регистр.Имя, ИмяКолонки, ИмяПромежуточнойТаблицы,
							ТекстПоместить));
							ТекстПоместить = "";
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если маПодЗапросыДляПоискаМоментов.Количество() = 0 Тогда
				маПодЗапросыДляПоискаМоментов.Добавить(ТекмтПодзапросаПоискаМоментов(
				ИмяМетаданныхДляЗапроса, Регистр.Имя, ИмяКолонки, ИмяПромежуточнойТаблицы, ТекстПоместить));
			КонецЕсли;
			
			ТекстЗапросаПоискаМоментов = СтрСоединить(маПодЗапросыДляПоискаМоментов, "
			|ОБЪЕДИНИТЬ
			|");
			
			Если ЗначениеЗаполнено(ТекстЗапросаПоискаМоментов) Тогда
				маЗапросыДляПоискаМоментов.Добавить(ТекстЗапросаПоискаМоментов);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если маИменаКолонокДата.Количество() > 0 Тогда
		
		ТекстыЗапросовПоискаМоментов = СтрСоединить(маЗапросыДляПоискаМоментов, ";
		|");
		
		маЗапросыДанныхМоментов = Новый Массив;
		
		Для й = 0 По маИменаКолонокДата.ВГраница() Цикл
			маЗапросыДанныхМоментов.Добавить(СтрШаблон(
			"ВЫБРАТЬ
			|	Таблица.%1 КАК Дата,
			|	Таблица.%2 КАК Ссылка
			|ПОМЕСТИТЬ %4_ДанныеМоментов_%3
			|ИЗ
			|	%4 КАК Таблица", маИменаКолонокДата[й], маИменаКолонокСсылка[й], маИменаКолонокМоментов[й],
			ИмяПромежуточнойТаблицы));
		КонецЦикла;
		
		ТекстЗапросаДанныхМоментов = СтрСоединить(маЗапросыДанныхМоментов, ";
		|
		|");
		
		ДополнительныеЗапросы = ТекстЗапросаДанныхМоментов + "; 
		|
		|" + ТекстыЗапросовПоискаМоментов;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьВыборкуКолонокСТипомТип(тзДанные, ИмяПромежуточнойТаблицы, стНовыеВыраженияПолей,
	ДополнительныеИсточники, ДополнительныеЗапросы)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	Для Каждого Колонка Из тзДанные.Колонки Цикл
		
		Если Колонка.ТипЗначения.СодержитТип(Тип("Тип")) Тогда
			
			ИмяКолонки = Колонка.Имя;
			ИмяКолонкиТип = ИмяКолонки + "_Тип31415926";
			ИмяКолонкиВременной = ИмяКолонки + "_Вр31415926";
			
			маВычитаемыеТипы = Новый Массив;
			маВычитаемыеТипы.Добавить(Тип("Тип"));
			маДобавляемыеТипы = Новый Массив;
			маДобавляемыеТипы.Добавить(Тип("Null"));
			ТипБезТипаТип = Новый ОписаниеТипов(Колонка.ТипЗначения, маДобавляемыеТипы, маВычитаемыеТипы);
			ТолькоТип = ТипБезТипаТип = Новый ОписаниеТипов("Null");//Значит, что в колонке был только тип.
			//Вообще, так должно быть всегда. Не представляю ситуации, когда в колонке с типом может быть что-то еще.
			
			тзДанные.Колонки.Добавить(ИмяКолонкиТип);
			Если Не ТолькоТип Тогда
				тзДанные.Колонки.Добавить(ИмяКолонкиВременной, ТипБезТипаТип);
			КонецЕсли;
			
			маТипы = Новый Массив;
			
			Если ТолькоТип Тогда
				
				Для Каждого СтрокаДанных Из тзДанные Цикл
					маТипы.Добавить(СтрокаДанных[ИмяКолонки]);
					ОписаниеТипа = ОписаниеТиповПоТипу(СтрокаДанных[ИмяКолонки]);
					Значение = ОписаниеТипа.ПривестиЗначение(Неопределено);
					СтрокаДанных[ИмяКолонкиТип] = Значение;
				КонецЦикла;
				
			Иначе
				
				Для Каждого СтрокаДанных Из тзДанные Цикл
					Если ТипЗнч(СтрокаДанных[ИмяКолонки]) = Тип("Тип") Тогда
						маТипы.Добавить(СтрокаДанных[ИмяКолонки]);
						ОписаниеТипа = ОписаниеТиповПоТипу(СтрокаДанных[ИмяКолонки]);
						Значение = ОписаниеТипа.ПривестиЗначение(Неопределено);
						СтрокаДанных[ИмяКолонкиТип] = Значение;
						СтрокаДанных[ИмяКолонкиВременной] = Null;
					Иначе
						СтрокаДанных[ИмяКолонкиВременной] = СтрокаДанных[ИмяКолонки];
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			тзДанные.Колонки.Удалить(ИмяКолонки);
			Если Не ТолькоТип Тогда
				тзДанные.Колонки[ИмяКолонкиВременной].Имя = ИмяКолонки;
			КонецЕсли;
			
			ТипКолонкиТипа = Новый ОписаниеТипов(маТипы);
			Обработка.ИзменитьТипКолонкиТаблицыЗначений(тзДанные, ИмяКолонкиТип, ТипКолонкиТипа);
			
			//стВыраженияПолей.Вставить(стВыраженияПолей
			
			Если ТолькоТип Тогда
				стНовыеВыраженияПолей.Вставить(ИмяКолонки, "ТИПЗНАЧЕНИЯ(Таблица." + ИмяКолонкиТип + ") КАК "
				+ ИмяКолонки);
			Иначе
				стНовыеВыраженияПолей.Вставить(ИмяКолонки, "ISNULL(Таблица." + ИмяКолонки + ", ТИПЗНАЧЕНИЯ(Таблица."
				+ ИмяКолонкиТип + ")) КАК " + ИмяКолонки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипКолонокБезТипа(тзДанные)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ПустойТип = Новый ОписаниеТипов;
	маНеЗначащиеТипы = Новый Массив;
	маНеЗначащиеТипы.Добавить("Неопределено");
	маНеЗначащиеТипы.Добавить("Null");
	
	маОбрабатываемыеКолонки = Новый Массив;
	маТипыКолонок = Новый Массив;
	Для Каждого Колонка Из тзДанные.Колонки Цикл
		//маТипы = Колонка.ТипЗначения.Типы();
		Если Колонка.ТипЗначения = ПустойТип Тогда
			маОбрабатываемыеКолонки.Добавить(Колонка.Имя);
			маТипыКолонок.Добавить(Новый Массив);
		КонецЕсли;
	КонецЦикла;
	
	Если маОбрабатываемыеКолонки.Количество() > 0 Тогда
		
		Для Каждого Строка Из тзДанные Цикл
			Для й = 0 По маОбрабатываемыеКолонки.Количество() - 1 Цикл
				ИмяКолонки = маОбрабатываемыеКолонки[й];
				маТипыКолонок[й].Добавить(ТипЗнч(Строка[ИмяКолонки]));
			КонецЦикла;
		КонецЦикла;
		
		Для й = 0 По маОбрабатываемыеКолонки.Количество() - 1 Цикл
			
			ИмяКолонки = маОбрабатываемыеКолонки[й];
			//ИмяВременнойКолонки = ИмяКолонки + "_Вр31415926";
			
			СтарыйТипЗначения = тзДанные.Колонки[ИмяКолонки].ТипЗначения;
			НовыйТипКолонки = Новый ОписаниеТипов(маТипыКолонок[й], СтарыйТипЗначения.КвалификаторыЧисла,
			СтарыйТипЗначения.КвалификаторыСтроки, СтарыйТипЗначения.КвалификаторыДаты,
			СтарыйТипЗначения.КвалификаторыДвоичныхДанных);
			
			ЗначимыеТипы = Новый ОписаниеТипов(НовыйТипКолонки, , маНеЗначащиеТипы);
			Если ЗначимыеТипы = ПустойТип Тогда
				НовыйТипКолонки = Новый ОписаниеТипов(НовыйТипКолонки, "Число");//нужно поставить хоть какой-то тип, иначе в запросе не загрузить...
				//Сообщить(Строка(ИмяКолонки) + " - тип колонки не определен, установлено число.");//отладка
			КонецЕсли;
			
			Обработка.ИзменитьТипКолонкиТаблицыЗначений(тзДанные, ИмяКолонки, НовыйТипКолонки);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВременнуюТаблицу(ИмяТаблицы, тзДанные, маЗапросыЗагрузки, ЗапросЗагрузкиТаблиц)
	
	УстановитьТипКолонокБезТипа(тзДанные);
	
	маПоляТаблицы = Новый Массив;
	Для Каждого Колонка Из тзДанные.Колонки Цикл
		маПоляТаблицы.Добавить(Колонка.Имя);
	КонецЦикла;
	
	стНовыеВыраженияПолей = Новый Структура;
	ДополнительныеИсточники = "";
	ДополнительныеЗапросы = "";
	ИмяПромежуточнойТаблицы = ИмяТаблицы + "_Вр31415926";
	ПодготовитьВыборкуКолонокСТипомТип(тзДанные, ИмяПромежуточнойТаблицы, стНовыеВыраженияПолей,
	ДополнительныеИсточники, ДополнительныеЗапросы);
	ПодготовитьВыборкуКолонокСТипомМоментВремени(тзДанные, ИмяПромежуточнойТаблицы, стНовыеВыраженияПолей,
	ДополнительныеИсточники, ДополнительныеЗапросы);
	Если стНовыеВыраженияПолей.Количество() > 0 Тогда
		
		маВыраженияПолей = Новый Массив;
		Для Каждого Колонка Из тзДанные.Колонки Цикл
			Выражение = "Таблица." + Колонка.Имя + " КАК " + Колонка.Имя;
			маВыраженияПолей.Добавить(Выражение);
		КонецЦикла;
		ВыраженияПолей = СтрСоединить(маВыраженияПолей, ",
		|");
		
		маЗапросыЗагрузки.Добавить("
		|ВЫБРАТЬ
		|" + ВыраженияПолей + "
		|ПОМЕСТИТЬ " + ИмяПромежуточнойТаблицы + "
		|ИЗ &" + ИмяТаблицы
		+ " КАК Таблица");
		
		Если ЗначениеЗаполнено(ДополнительныеЗапросы) Тогда
			маЗапросыЗагрузки.Добавить(ДополнительныеЗапросы);
		КонецЕсли;
		
		Источник = ИмяПромежуточнойТаблицы;
		
	Иначе
		Источник = "&" + ИмяТаблицы;
	КонецЕсли;
	
	Выражение = Неопределено;
	маВыраженияПолей = Новый Массив;
	Для Каждого ИмяКолонки Из маПоляТаблицы Цикл
		Если Не стНовыеВыраженияПолей.Свойство(ИмяКолонки, Выражение) Тогда
			Выражение = "Таблица." + ИмяКолонки + " КАК " + ИмяКолонки;
		КонецЕсли;
		маВыраженияПолей.Добавить(Выражение);
	КонецЦикла;
	ВыраженияПолей = СтрСоединить(маВыраженияПолей, ",
	|");
	
	маЗапросыЗагрузки.Добавить("
	|ВЫБРАТЬ
	|" + ВыраженияПолей + "
	|ПОМЕСТИТЬ " + ИмяТаблицы + "
	|ИЗ " + Источник + " КАК Таблица"
	+ " " + ДополнительныеИсточники);
	
	ЗапросЗагрузкиТаблиц.УстановитьПараметр(ИмяТаблицы, тзДанные);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьВременныеТаблицы()
	
	Если ВременныеТаблицы.Количество() = 0 Тогда
		Возврат Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	ЗапросЗагрузкиТаблиц = Новый Запрос;
	ЗапросЗагрузкиТаблиц.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	маЗапросыЗагрузки = Новый Массив;
	Для Каждого СтрокаВременнаяТаблица Из ВременныеТаблицы Цикл
		
		ИмяТаблицы = СтрокаВременнаяТаблица.Имя;
		тзДанные = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(СтрокаВременнаяТаблица.Контейнер);
		ЗагрузитьВременнуюТаблицу(ИмяТаблицы, тзДанные, маЗапросыЗагрузки, ЗапросЗагрузкиТаблиц);
		
	КонецЦикла;
	
	ЗапросЗагрузкиТаблиц.Текст = СтрСоединить(маЗапросыЗагрузки, ";
	|");
	
	ЗапросЗагрузкиТаблиц.Выполнить();
	
	Возврат ЗапросЗагрузкиТаблиц.МенеджерВременныхТаблиц;
	
КонецФункции

&НаСервере
Функция ПараметрыЗаполнитьИзЗапросаНаСервере(ИмяПараметров)
	Перем НомерСтроки, НомерКолонки;
	
	Если ИмяПараметров = "Запрос" Тогда
		Запрос = Новый Запрос(Объект.ТЗапроса);
	ИначеЕсли ИмяПараметров = "Расшифровка" Тогда
		Запрос = Новый Запрос(Объект.МодульРасшифровки);
	конецЕсли;
	
	Попытка
		Запрос.МенеджерВременныхТаблиц = ЗагрузитьВременныеТаблицы();
		НайденныеПараметры = Запрос.НайтиПараметры();
	Исключение
		СтрокаОшибки = ОписаниеОшибки();
		РазобратьОшибкуЗапроса(СтрокаОшибки, НомерСтроки, НомерКолонки);
		Возврат Новый Структура("ОписаниеОшибки, Строка, Колонка", СтрокаОшибки, НомерСтроки, НомерКолонки);
	КонецПопытки;
	
	Для Каждого Параметр Из НайденныеПараметры Цикл
		
		Если Объект.ОпцияОбрабатывать__ И СтрНачинаетсяС(Параметр.Имя, МакроПараметр) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПараметров = "Запрос" Тогда
			маСтрокиПараметра = ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", Параметр.Имя));
		Иначе
			маСтрокиПараметра = ПараметрыРасшифровки.НайтиСтроки(Новый Структура("Имя", Параметр.Имя));
		КонецЕсли;
		
		Если маСтрокиПараметра.Количество() > 0 Тогда
			СтрокаПараметра = маСтрокиПараметра[0];
		Иначе
			Если имяПараметров = "Запрос" Тогда
				СтрокаПараметра = ПараметрыЗапроса.Добавить();
			Иначе
				СтрокаПараметра = ПараметрыРасшифровки.Добавить();
			КонецЕсли;
			
			СтрокаПараметра.Имя = Параметр.Имя;
			ПараметрыЗапроса_СохранитьЗначение(СтрокаПараметра.ПолучитьИдентификатор(),
			Параметр.ТипЗначения.ПривестиЗначение(Неопределено), имяПараметров);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаПараметра.ТипЗначения) Тогда
			СтрокаПараметра.ТипЗначения = Параметр.ТипЗначения;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ДобавитьПараметрСКонтролемИмени(ИмяПараметра)
	
	стрИспользуемоеИмяПараметра = ИмяПараметра;
	й = 1;
	Пока Истина Цикл
		
		маЪ = ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", стрИспользуемоеИмяПараметра));
		Если маЪ.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		стрИспользуемоеИмяПараметра = ИмяПараметра + й;
		й = й + 1;
		
	КонецЦикла;
	
	НоваяСтрока = ПараметрыЗапроса.Добавить();
	НоваяСтрока.Имя = стрИспользуемоеИмяПараметра;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ОкончаниеРедактированияСтроки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Поле = "Контейнер" Тогда
			Если ДополнительныеПараметры.Таблица = "ПараметрыЗапроса" Тогда
				ПараметрыЗапроса_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.Значение, "Запрос");
			ИначеЕсли ДополнительныеПараметры.Таблица = "ВременныеТаблицы" Тогда
				СтрокаТаблицы = ВременныеТаблицы.НайтиПоИдентификатору(ДополнительныеПараметры.Строка);
				СтрокаТаблицы.Контейнер = РезультатЗакрытия.Значение;
				СтрокаТаблицы.Значение = СтрокаТаблицы.Контейнер.Представление;
				Модифицированность = Истина;
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Поле = "КонтейнерКакТип" Тогда
			ПараметрыЗапроса_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.ОписаниеКонтейнера,"Запрос");
		ИначеЕсли ДополнительныеПараметры.Поле = "ТипЗначения" Тогда
			
			ОписаниеКонтейнера = РезультатЗакрытия.ОписаниеКонтейнера;
			
			идСтрокаПараметра = ДополнительныеПараметры.Строка;
			Если идСтрокаПараметра = Неопределено Тогда
				//добавление нового параметра
				СтрокаПараметра = ДобавитьПараметрСКонтролемИмени(РезультатЗакрытия.ИмяПараметра);
				СтрокаПараметра.ТипКонтейнера = РезультатЗакрытия.ТипКонтейнера;
				идСтрокаПараметра = СтрокаПараметра.ПолучитьИдентификатор();
			КонецЕсли;
			
			ПараметрыЗапроса_УстановитьТип(идСтрокаПараметра, РезультатЗакрытия.ТипКонтейнера, ОписаниеКонтейнера);
			
			стрТекстЗапроса = Неопределено;
			Если РезультатЗакрытия.Свойство("ТекстЗапроса", стрТекстЗапроса) Тогда
				
				Если СтрокаПараметра <> Неопределено И СтрокаПараметра.Имя <> РезультатЗакрытия.ИмяПараметра Тогда
					стрТекстЗапроса = СтрЗаменить(стрТекстЗапроса, "&" + РезультатЗакрытия.ИмяПараметра, "&"
					+ СтрокаПараметра.Имя);
				КонецЕсли;
				
				чРазмерТекста = СтрДлина(Объект.ТЗапроса.ПолучитьТекст());
				Элементы.ТЗапроса.УстановитьГраницыВыделения(чРазмерТекста + 1, чРазмерТекста + 1);
				Элементы.ТЗапроса.ВыделенныйТекст = стрТекстЗапроса;
				
				Элементы.ГруппаЗапросСтраницы.ТекущаяСтраница = Элементы.СтраницаТекстЗапроса;
				ТекущийЭлемент = Элементы.ТЗапроса;
				
			КонецЕсли;
			
			УстановитьПараметрыВводаЗначения();
			
		ИначеЕсли ДополнительныеПараметры.Поле = "Значение" Тогда
			Элементы.Параметры.ТекущиеДанные.Значение = РезультатЗакрытия.Значение;
			Элементы.Параметры.ТекущиеДанные.Контейнер = РезультатЗакрытия.Значение;
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРедактированияСтрокиРасшифровка(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Поле = "Контейнер" Тогда
			Если ДополнительныеПараметры.Таблица = "ПараметрыРасшифровки" Тогда
				ПараметрыЗапроса_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.Значение, "Расшифровка");
			ИначеЕсли ДополнительныеПараметры.Таблица = "ВременныеТаблицы" Тогда
				СтрокаТаблицы = ВременныеТаблицы.НайтиПоИдентификатору(ДополнительныеПараметры.Строка);
				СтрокаТаблицы.Контейнер = РезультатЗакрытия.Значение;
				СтрокаТаблицы.Значение = СтрокаТаблицы.Контейнер.Представление;
				Модифицированность = Истина;
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Поле = "КонтейнерКакТип" Тогда
			ПараметрыЗапроса_СохранитьЗначение(ДополнительныеПараметры.Строка, РезультатЗакрытия.ОписаниеКонтейнера,"Расшифровка");
		ИначеЕсли ДополнительныеПараметры.Поле = "ТипЗначения" Тогда
			
			ОписаниеКонтейнера = РезультатЗакрытия.ОписаниеКонтейнера;
			
			идСтрокаПараметра = ДополнительныеПараметры.Строка;
			Если идСтрокаПараметра = Неопределено Тогда
				//добавление нового параметра
				СтрокаПараметра = ДобавитьПараметрСКонтролемИмени(РезультатЗакрытия.ИмяПараметра);
				СтрокаПараметра.ТипКонтейнера = РезультатЗакрытия.ТипКонтейнера;
				идСтрокаПараметра = СтрокаПараметра.ПолучитьИдентификатор();
			КонецЕсли;
			
			ПараметрыЗапроса_УстановитьТипРасшифровка(идСтрокаПараметра, РезультатЗакрытия.ТипКонтейнера, ОписаниеКонтейнера);
			
			стрТекстЗапроса = Неопределено;
			Если РезультатЗакрытия.Свойство("ТекстЗапроса", стрТекстЗапроса) Тогда
				
				Если СтрокаПараметра <> Неопределено И СтрокаПараметра.Имя <> РезультатЗакрытия.ИмяПараметра Тогда
					стрТекстЗапроса = СтрЗаменить(стрТекстЗапроса, "&" + РезультатЗакрытия.ИмяПараметра, "&"
					+ СтрокаПараметра.Имя);
				КонецЕсли;
				
				чРазмерТекста = СтрДлина(Объект.ТЗапроса.ПолучитьТекст());
				Элементы.МодульРасшифровки.УстановитьГраницыВыделения(чРазмерТекста + 1, чРазмерТекста + 1);
				Элементы.МодульРасшифровки.ВыделенныйТекст = стрТекстЗапроса;
				
				Элементы.ГруппаЗапросСтраницы.ТекущаяСтраница = Элементы.СтраницаТекстЗапроса;
				ТекущийЭлемент = Элементы.МодульРасшифровки;
				
			КонецЕсли;
			
			УстановитьПараметрыВводаЗначенияРасшифровка();
			
		ИначеЕсли ДополнительныеПараметры.Поле = "Значение" Тогда
			Элементы.Параметры.ТекущиеДанные.Значение = РезультатЗакрытия.Значение;
			Элементы.Параметры.ТекущиеДанные.Контейнер = РезультатЗакрытия.Значение;
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВводаЗначения()
	
	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ПараметрыЗапросаЗначение.КартинкаКнопкиВыбора = Новый Картинка;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ТипКонтейнера) Тогда
			
			Элементы.ПараметрыЗапросаЗначение.КнопкаОчистки = Ложь;
			Элементы.ПараметрыЗапросаЗначение.КнопкаВыбора = Истина;
			Элементы.ПараметрыЗапросаЗначение.ВыбиратьТип = Ложь;
			Элементы.ПараметрыЗапросаЗначение.РедактированиеТекста = Ложь;
			Элементы.ПараметрыЗапросаЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элементы.ПараметрыЗапросаЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;
			
		ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда
			
			Элементы.ПараметрыЗапросаЗначение.КнопкаОчистки = Ложь;
			Элементы.ПараметрыЗапросаЗначение.КнопкаВыбора = Истина;
			Элементы.ПараметрыЗапросаЗначение.ВыбиратьТип = Ложь;
			Элементы.ПараметрыЗапросаЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;
			Элементы.ПараметрыЗапросаЗначение.РедактированиеТекста = Ложь;
			Элементы.ПараметрыЗапросаЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			
		Иначе
			
			Элементы.ПараметрыЗапросаЗначение.РедактированиеТекста = Истина;
			Если ЗначениеЗаполнено(ТекущиеДанные.ТипЗначения) Тогда
				Элементы.ПараметрыЗапросаЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
			Иначе
				Элементы.ПараметрыЗапросаЗначение.ОграничениеТипа = Новый ОписаниеТипов;
			КонецЕсли;
			
			Если ТекущиеДанные.Значение = Неопределено
				И Элементы.ПараметрыЗапросаЗначение.ОграничениеТипа.Типы().Количество() > 1 Тогда
				
				Элементы.ПараметрыЗапросаЗначение.ВыбиратьТип = Истина;
				Элементы.ПараметрыЗапросаЗначение.КнопкаВыбора = Истина;
				Элементы.ПараметрыЗапросаЗначение.КнопкаОчистки = Ложь;
				Элементы.ПараметрыЗапросаЗначение.КартинкаКнопкиВыбора = Элементы.Картинка_ВыборТипа.Картинка;
				
			Иначе
				
				Элементы.ПараметрыЗапросаЗначение.ВыбиратьТип = Ложь;
				Элементы.ПараметрыЗапросаЗначение.КнопкаОчистки = Истина;
				Элементы.ПараметрыЗапросаЗначение.КнопкаВыбора = НужнаКнопкаВыбораЗначению(ТекущиеДанные.Значение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВводаЗначенияРасшифровка()
	
	ТекущиеДанные = Элементы.ПараметрыРасшифровки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		Элементы.ПараметрыРасшифровкиЗначение.КартинкаКнопкиВыбора = Новый Картинка;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ТипКонтейнера) Тогда
			
			Элементы.ПараметрыРасшифровкиЗначение.КнопкаОчистки = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.КнопкаВыбора = Истина;
			Элементы.ПараметрыРасшифровкиЗначение.ВыбиратьТип = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.РедактированиеТекста = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элементы.ПараметрыРасшифровкиЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;
			
		ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда
			
			Элементы.ПараметрыРасшифровкиЗначение.КнопкаОчистки = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.КнопкаВыбора = Истина;
			Элементы.ПараметрыРасшифровкиЗначение.ВыбиратьТип = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.КартинкаКнопкиВыбора = БиблиотекаКартинок.Изменить;
			Элементы.ПараметрыРасшифровкиЗначение.РедактированиеТекста = Ложь;
			Элементы.ПараметрыРасшифровкиЗначение.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			
		Иначе
			
			Элементы.ПараметрыРасшифровкиЗначение.РедактированиеТекста = Истина;
			Если ЗначениеЗаполнено(ТекущиеДанные.ТипЗначения) Тогда
				Элементы.ПараметрыРасшифровкиЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
			Иначе
				Элементы.ПараметрыРасшифровкиЗначение.ОграничениеТипа = Новый ОписаниеТипов;
			КонецЕсли;
			
			Если ТекущиеДанные.Значение = Неопределено
				И Элементы.ПараметрыРасшифровкиЗначение.ОграничениеТипа.Типы().Количество() > 1 Тогда
				
				Элементы.ПараметрыРасшифровкиЗначение.ВыбиратьТип = Истина;
				Элементы.ПараметрыРасшифровкиЗначение.КнопкаВыбора = Истина;
				Элементы.ПараметрыРасшифровкиЗначение.КнопкаОчистки = Ложь;
				Элементы.ПараметрыРасшифровкиЗначение.КартинкаКнопкиВыбора = Элементы.Картинка_ВыборТипа.Картинка;
				
			Иначе
				
				Элементы.ПараметрыРасшифровкиЗначение.ВыбиратьТип = Ложь;
				Элементы.ПараметрыРасшифровкиЗначение.КнопкаОчистки = Истина;
				Элементы.ПараметрыРасшифровкиЗначение.КнопкаВыбора = НужнаКнопкаВыбораЗначению(ТекущиеДанные.Значение);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НужнаКнопкаВыбораЗначению(Значение)
	
	маТипыБезКнопкиВыбора = Новый Массив;
	маТипыБезКнопкиВыбора.Добавить(Тип("Строка"));
	маТипыБезКнопкиВыбора.Добавить(Тип("Число"));
	маТипыБезКнопкиВыбора.Добавить(Тип("Булево"));
	маТипыБезКнопкиВыбора.Добавить(Тип("ВидДвиженияНакопления"));
	маТипыБезКнопкиВыбора.Добавить(Тип("ВидДвиженияБухгалтерии"));
	маТипыБезКнопкиВыбора.Добавить(Тип("ВидСчета"));
	ТипыБезКнопкийВыбора = Новый ОписаниеТипов(маТипыБезКнопкиВыбора);
	
	Возврат Не ТипыБезКнопкийВыбора.СодержитТип(ТипЗнч(Значение));
	
КонецФункции

&НаКлиенте
Процедура ПараметрыЗапросаТипПараметраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ПараметрыЗапроса.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипКонтейнера < 3 Тогда
		ТипЗначения = ТекущиеДанные.ТипЗначения;
	Иначе
		ТипЗначения = ТекущиеДанные.Контейнер;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
	Элементы.ПараметрыЗапроса.ТекущаяСтрока, "ТипЗначения");
	ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки", ЭтаФорма,
	ПараметрыОповещения);
	ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, ТипКонтейнера, Имя, ВЗапросРазрешено", Объект,
	ТипЗначения, ТекущиеДанные.ТипКонтейнера, ТекущиеДанные.Имя, Истина);
	ОткрытьФорму("Обработка.МТ_КонсольЗапросов.Форма.РедактированиеТипа", ПараметрыОткрытия, ЭтаФорма, Истина, , ,
	ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// ОписаниеОповещенияОЗакрытииОткрываемойФормы
КонецПроцедуры

&НаКлиенте
Функция ПолноеИмяФормы(ИмяФормы)
	Возврат СтрШаблон("%1.Форма.%2", "Обработка.МТ_КонсольЗапросов", ИмяФормы);
КонецФункции

&НаКлиенте
Процедура ПараметрыЗапросаЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипКонтейнера > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
		Элемент.Родитель.ТекущаяСтрока, "Контейнер");
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
		ЭтаФорма, ПараметрыОповещения);
		ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, Заголовок, Значение, ТипКонтейнера", Объект,
		ТекущиеДанные.ТипЗначения, ТекущиеДанные.Имя, ТекущиеДанные.Контейнер, ТекущиеДанные.ТипКонтейнера);
		
		Если ТекущиеДанные.ТипКонтейнера = 3 Тогда
			ИмяФормыРедактирования = "РедактированиеТаблицы";
		Иначе
			ИмяФормыРедактирования = "ПодборВСписок";
		КонецЕсли;
		
		ОткрытьФорму(ПолноеИмяФормы(ИмяФормыРедактирования), ПараметрыОткрытия, ЭтаФорма, Ложь, , ,
		ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда
		
		Если ТекущиеДанные.Контейнер.Тип = "МоментВремени" Или ТекущиеДанные.Контейнер.Тип = "Граница" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
			Элемент.Родитель.ТекущаяСтрока, "Контейнер");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Контейнер);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеГраницыМомента"), ПараметрыОткрытия, ЭтаФорма, Ложь, , ,
			ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТекущиеДанные.Контейнер.Тип = "Тип" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
			Элемент.Родитель.ТекущаяСтрока, "КонтейнерКакТип");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, ТипКонтейнера", Объект, ТекущиеДанные.Контейнер,
			ТекущиеДанные.ТипКонтейнера);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеТипа"), ПараметрыОткрытия, ЭтаФорма, Истина, , ,
			ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	Иначе
		Если ТипЗнч(ТекущиеДанные.Значение) = Тип("УникальныйИдентификатор") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса",
			Элемент.Родитель.ТекущаяСтрока, "Значение");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Значение);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеУникальногоИдентификатора"), ПараметрыОткрытия, ЭтаФорма,
			Истина, , , ОписаниеОповещенияОЗакрытииОткрываемойФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗапроса_ПолучитьЗначение(СтрокаИд)
	
	СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(СтрокаИд);
	
	Если СтрокаПараметр.ТипКонтейнера = 0 Или СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2
		Или СтрокаПараметр.ТипКонтейнера = 3 Тогда
		Возврат РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(СтрокаПараметр.Значение);
	Иначе
		ВызватьИсключение "Ошибка в типе контейнера параметра";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПараметрыЗапроса_СохранитьЗначение(СтрокаИд, Знач Значение, имяПараметров)
	
	Если имяПараметров = "Запрос" Тогда
		
		СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(СтрокаИд);
		
	ИначеЕсли имяПараметров = "Расшифровка" Тогда
		
		СтрокаПараметр =  ПараметрыРасшифровки.НайтиПоИдентификатору(СтрокаИд);
		
	Иначе
		
		СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(СтрокаИд);
		
	КонецЕсли;
	
	Если СтрокаПараметр.ТипКонтейнера = 0 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		Если ТипЗнч(СтрокаПараметр.Контейнер) = Тип("Структура") Тогда
			СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
		Иначе
			СтрокаПараметр.Значение = Значение;
		КонецЕсли;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 1 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 2 Тогда
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
		СтрокаПараметр.ТипЗначения = "Таблица значений";
		СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Значение);
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	Иначе
		ВызватьИсключение "Ошибка в типе контейнера параметра";
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
//Контейнер типа 1 и типа 2 (список значений или массив) возвращаем в виде массива
Функция Контейнер12ВМассив(Контейнер)
	
	Значение = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
	
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Возврат Значение.ВыгрузитьЗначения();
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ПараметрыЗапроса_УстановитьТип(СтрокаИд, ТипКонтейнера, ТипЗначения)
	
	СтрокаПараметр = ПараметрыЗапроса.НайтиПоИдентификатору(СтрокаИд);
	Контейнер = СтрокаПараметр.Контейнер;
	
	Если ТипКонтейнера = 1 Или ТипКонтейнера = 2 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			//Была ТЗ, теперь СЗ. Надо достать первую ячейку.
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			КонтейнерМассив = Таблица.ВыгрузитьКолонку(0);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			
			КонтейнерМассив = Новый Массив;
			
			КонтейнерМассив.Добавить(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер));
			//Если ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
			//	КонтейнерМассив.Добавить(СтрокаПараметр.Значение);
			//КонецЕсли;
			
			СтрокаПараметр.Значение = Неопределено;
			
		КонецЕсли;
		
		Если ТипКонтейнера = 1 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(НовыйСписок);
		ИначеЕсли ТипКонтейнера = 2 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			КонтейнерМассив = НовыйСписок.ВыгрузитьЗначения();
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(КонтейнерМассив);
		КонецЕсли;
		
	ИначеЕсли ТипКонтейнера = 3 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Значение = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				Значение = Значение.ВыгрузитьЗначения();
			КонецЕсли;
			Для Каждого ъ Из Значение Цикл
				Таблица.Добавить()[0] = ъ;
			КонецЦикла;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			Контейнер = ТипЗначения;
			//Теперь не копируем, преобразование уже выполняет редактор типа!
			//СкопироватьДанныеКонтейнераТипа3(Контейнер, СтрокаПараметр.Контейнер);
			НовыйКонтейнер = Контейнер;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Таблица.Добавить()[0] = СтрокаПараметр.Значение;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		КонецЕсли;
		
		СтрокаПараметр.Контейнер = НовыйКонтейнер;
		
	ИначеЕсли ТипКонтейнера = 0 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
			Если КонтейнерМассив.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
				ТипЗначения.ПривестиЗначение(КонтейнерМассив[0]));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			сз = ПараметрыЗапросаФормаПриИзмененииСЗИзТЗ(Контейнер);
			Если сз.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
				ТипЗначения.ПривестиЗначение(сз.СписокЗначений[0].Значение));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
			ТипЗначения.ПривестиЗначение(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(
			СтрокаПараметр.Контейнер)));
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаПараметр.ТипКонтейнера = ТипКонтейнера;
	Если СтрокаПараметр.ТипКонтейнера = 3 Тогда
		СтрокаПараметр.ТипЗначения = "Таблица значений";
	Иначе
		СтрокаПараметр.ТипЗначения = ТипЗначения;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если ТипЗнч(СтрокаПараметр.Контейнер) = Тип("Структура") Тогда
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	Иначе
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыЗапроса_УстановитьТипРасшифровка(СтрокаИд, ТипКонтейнера, ТипЗначения)
	
	СтрокаПараметр = ПараметрыРасшифровки.НайтиПоИдентификатору(СтрокаИд);
	Контейнер = СтрокаПараметр.Контейнер;
	
	Если ТипКонтейнера = 1 Или ТипКонтейнера = 2 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			//Была ТЗ, теперь СЗ. Надо достать первую ячейку.
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			КонтейнерМассив = Таблица.ВыгрузитьКолонку(0);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			
			КонтейнерМассив = Новый Массив;
			
			КонтейнерМассив.Добавить(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер));
			//Если ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
			//	КонтейнерМассив.Добавить(СтрокаПараметр.Значение);
			//КонецЕсли;
			
			СтрокаПараметр.Значение = Неопределено;
			
		КонецЕсли;
		
		Если ТипКонтейнера = 1 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(НовыйСписок);
		ИначеЕсли ТипКонтейнера = 2 Тогда
			НовыйСписок = Новый СписокЗначений;
			НовыйСписок.ЗагрузитьЗначения(КонтейнерМассив);
			НовыйСписок.ТипЗначения = ТипЗначения;
			КонтейнерМассив = НовыйСписок.ВыгрузитьЗначения();
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(КонтейнерМассив);
		КонецЕсли;
		
	ИначеЕсли ТипКонтейнера = 3 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Значение = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(Контейнер);
			Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
				Значение = Значение.ВыгрузитьЗначения();
			КонецЕсли;
			Для Каждого ъ Из Значение Цикл
				Таблица.Добавить()[0] = ъ;
			КонецЦикла;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			Контейнер = ТипЗначения;
			//Теперь не копируем, преобразование уже выполняет редактор типа!
			//СкопироватьДанныеКонтейнераТипа3(Контейнер, СтрокаПараметр.Контейнер);
			НовыйКонтейнер = Контейнер;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			Таблица = РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(ТипЗначения);
			Таблица.Добавить()[0] = СтрокаПараметр.Значение;
			НовыйКонтейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(Таблица);
		КонецЕсли;
		
		СтрокаПараметр.Контейнер = НовыйКонтейнер;
		
	ИначеЕсли ТипКонтейнера = 0 Тогда
		
		Если СтрокаПараметр.ТипКонтейнера = 1 Или СтрокаПараметр.ТипКонтейнера = 2 Тогда
			КонтейнерМассив = Контейнер12ВМассив(Контейнер);
			Если КонтейнерМассив.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
				ТипЗначения.ПривестиЗначение(КонтейнерМассив[0]));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 3 Тогда
			сз = ПараметрыЗапросаФормаПриИзмененииСЗИзТЗ(Контейнер);
			Если сз.Количество() > 0 Тогда
				СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
				ТипЗначения.ПривестиЗначение(сз.СписокЗначений[0].Значение));
			КонецЕсли;
		ИначеЕсли СтрокаПараметр.ТипКонтейнера = 0 Тогда
			СтрокаПараметр.Контейнер = РеквизитФормыВЗначение("Объект").Контейнер_СохранитьЗначение(
			ТипЗначения.ПривестиЗначение(РеквизитФормыВЗначение("Объект").Контейнер_ВосстановитьЗначение(
			СтрокаПараметр.Контейнер)));
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаПараметр.ТипКонтейнера = ТипКонтейнера;
	Если СтрокаПараметр.ТипКонтейнера = 3 Тогда
		СтрокаПараметр.ТипЗначения = "Таблица значений";
	Иначе
		СтрокаПараметр.ТипЗначения = ТипЗначения;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Если ТипЗнч(СтрокаПараметр.Контейнер) = Тип("Структура") Тогда
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер.Представление;
	Иначе
		СтрокаПараметр.Значение = СтрокаПараметр.Контейнер;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗапросаФормаПриИзмененииСЗИзТЗ(Контейнер)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	тзТаблица = Обработка.Контейнер_ВосстановитьЗначение(Контейнер);
	сзСписок = Новый СписокЗначений;
	Если тзТаблица.Колонки.Количество() > 0 Тогда
		сзСписок.ЗагрузитьЗначения(тзТаблица.ВыгрузитьКолонку(0));
	КонецЕсли;
	
	Возврат Обработка.Контейнер_СохранитьЗначение(сзСписок);
	
КонецФункции

//@skip-warning
&НаСервере
Процедура СкопироватьДанныеКонтейнераТипа3(КонтейнерНовый, КонтейнерСтарый)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ТаблицаНовая = Обработка.СтрокаВЗначение(КонтейнерНовый.Значение);
	ТаблицаСтарая = Обработка.СтрокаВЗначение(КонтейнерСтарый.Значение);
	
	ТаблицаНовая.Очистить();
	
	//Если одинаковых колонок нет, то копировать нечего.
	фОдинаковыеЕсть = Ложь;
	Для Каждого КолонкаНовая Из ТаблицаНовая.Колонки Цикл
		Если ТаблицаСтарая.Колонки.Найти(КолонкаНовая.Имя) <> Неопределено Тогда
			фОдинаковыеЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если фОдинаковыеЕсть Тогда
		Для Каждого СтрокаСтарая Из ТаблицаСтарая Цикл
			СтрокаНовая = ТаблицаНовая.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаСтарая);
		КонецЦикла;
		КонтейнерНовый.КоличествоСтрок = КонтейнерСтарый.КоличествоСтрок;
	Иначе
		КонтейнерНовый.КоличествоСтрок = 0;
	КонецЕсли;
	
	КонтейнерНовый.Значение = Обработка.ЗначениеВСтроку(ТаблицаНовая);
	КонтейнерНовый.Представление = Обработка.Контейнер_ПолучитьПредставление(КонтейнерНовый);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыЗапроса_ПолучитьКакСтроку()
	
	тзПараметры = Новый ТаблицаЗначений;
	тзПараметры.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	тзПараметры.Колонки.Добавить("Значение");
	Для Каждого СтрокаПараметра Из ПараметрыЗапроса Цикл
		СтрокаТаблицы = тзПараметры.Добавить();
		СтрокаТаблицы.Имя = СтрокаПараметра.Имя;
		СтрокаТаблицы.Значение = ПараметрыЗапроса_ПолучитьЗначение(СтрокаПараметра.ПолучитьИдентификатор());
	КонецЦикла;
	
	Возврат РеквизитФормыВЗначение("Объект").ЗначениеВСтроку(тзПараметры);
	
КонецФункции

#КонецОбласти //ПараметрыЗапроса

#КонецОбласти


#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедакторКодаСервер.ФормаПриСозданииНаСервере(ЭтотОбъект);
	РедакторКодаСервер.СоздатьЭлементыРедактораКода(ЭтотОбъект, "Сервер", Элементы.ПолеАлгоритмаСервер);
	
	//РедакторКодаСервер.ФормаПриСозданииНаСервере(ЭтотОбъект);
	РедакторКодаСервер.СоздатьЭлементыРедактораКода(ЭтотОбъект, "СерверРасшифровка", Элементы.ПолеАлгоритмаСерверРасшифровка);
	
	// Восстановим параметры запроса из хранилища
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ВремПараметрыЗапроса = РеквизитОбъект.ПараметрыЗапросаХранилище.Получить();
	
	Если НЕ ВремПараметрыЗапроса = Неопределено Тогда
		ПараметрыЗапроса.Загрузить(ВремПараметрыЗапроса);
	КонецЕсли;
	
	ВремПараметрыЗапроса = РеквизитОбъект.ПараметрыРасшифровкиХранилище.Получить();
	
	Если НЕ ВремПараметрыЗапроса = Неопределено Тогда
		ПараметрыРасшифровки.Загрузить(ВремПараметрыЗапроса);
	КонецЕсли;
	
	ВремПеременныеСервер = РеквизитОбъект.ПеременныеСерверХранилище.Получить();
	
	Если НЕ ВремПеременныеСервер = Неопределено Тогда
		ПеременныеСервер.Загрузить(ВремПеременныеСервер);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос;
		
	КонецЕсли;	
	
	УстановитьВидимостьСтраницПоВидуПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		РедакторКодаКлиент.ФормаПриОткрытии(ЭтотОбъект, Новый ОписаниеОповещения("ПриОткрытииЗавершение",ЭтотОбъект));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекстАлгоритмаСервер = Объект.ПроизвольныйМодуль;
	УстановитьТекстРедактора("Сервер", ТекстАлгоритмаСервер);
	
	Если Объект.ИмеетДетализацию Тогда
		ТекстАлгоритмаСерверРасшифровка = Объект.ПроизвольныйМодульРасшифровка;
		УстановитьТекстРедактора("СерверРасшифровка", ТекстАлгоритмаСерверРасшифровка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Запишем текст кода в реквизит ПроизвольныйМодуль
	Если Объект.ВидПоказателя=ПредопределенноеЗначение("Перечисление.ИсточникПоказателяKPI.Модуль") Тогда	
		ТекстАлгоритмаСервер=РедакторКодаКлиент.ТекстКодаРедактора(ЭтотОбъект, "Сервер");
		Объект.ПроизвольныйМодуль =  ТекстАлгоритмаСервер;
		
		ТекстАлгоритмаСерверРасшифровка=РедакторКодаКлиент.ТекстКодаРедактора(ЭтотОбъект, "СерверРасшифровка");
		Объект.ПроизвольныйМодульРасшифровка =  ТекстАлгоритмаСерверРасшифровка;
	КонецЕсли;
	
	// Запишем параметры запроса в хранилище
	Если ПараметрыЗапроса.Количество() Тогда
		ЗаписатьПараметрыЗапроса();
	КонецЕсли;
	Если ПараметрыРасшифровки.Количество() Тогда
		ЗаписатьПараметрыРасшифровки();
	КонецЕсли;
	
	Если ПеременныеСервер.Количество() Тогда
		ЗаписатьПеременныеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыРасшифровки()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТЗпараметровЗапроса = ПараметрыРасшифровки.Выгрузить();
	РеквизитОбъект.ПараметрыРасшифровкиХранилище = Новый ХранилищеЗначения(ТЗпараметровЗапроса, 
	Новый СжатиеДанных(9));
	РеквизитОбъект.Записать();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПараметрыЗапроса()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТЗпараметровЗапроса = ПараметрыЗапроса.Выгрузить();
	РеквизитОбъект.ПараметрыЗапросаХранилище = Новый ХранилищеЗначения(ТЗпараметровЗапроса, 
	Новый СжатиеДанных(9));
	РеквизитОбъект.Записать();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПеременныеСервер()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	ТЗПеременные = ПеременныеСервер.Выгрузить();
	РеквизитОбъект.ПеременныеСерверХранилище = Новый ХранилищеЗначения(ТЗПеременные, 
	Новый СжатиеДанных(9));
	РеквизитОбъект.Записать();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеРедактораДокументСформирован(Элемент)
	РедакторКодаКлиент.ПолеРедактораHTMLДокументСформирован(ЭтотОбъект, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеРедактораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РедакторКодаКлиент.ПолеРедактораHTMLПриНажатии(ЭтотОбъект, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте 
Процедура Подключаемый_ПолеРедактораЗавершениеИнициализации(ИдентификаторРедактора) Экспорт
	
	Если ИдентификаторРедактора="Сервер" Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСервер", 0.1, Истина);
	КонецЕсли;
	
	Если ИдентификаторРедактора="СерверРасшифровка" Тогда
		ПодключитьОбработчикОжидания("ОбработчикОжиданияУстановитьТекстКодаВРедактореТекстаСерверРасшифровка", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидПоказателяПриИзменении(Элемент)
	УстановитьВидимостьСтраницПоВидуПоказателя();
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		РедакторКодаКлиент.ФормаПриОткрытии(ЭтотОбъект, Новый ОписаниеОповещения("ПриОткрытииЗавершение",ЭтотОбъект));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницПоВидуПоказателя()
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда
		
		Элементы.СтраницаЗапрос.Видимость = Истина;
		//Элементы.ОсновнаяПанель.Страницы.Параметры.Видимость=Истина;
		Элементы.СтраницаПроизвольныйМодуль.Видимость = Ложь;
		
	ИначеЕсли  Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		
		Элементы.СтраницаЗапрос.Видимость = Ложь;
		//Элементы.ОсновнаяПанель.Страницы.Параметры.Видимость = Истина;
		Элементы.СтраницаПроизвольныйМодуль.Видимость = истина;
		
	Иначе
		
		Элементы.СтраницаЗапрос.Видимость = Ложь;
		//Элементы.ОсновнаяПанель.Страницы.Параметры.Видимость=Ложь;
		Элементы.СтраницаПроизвольныйМодуль.Видимость=Ложь;
		
	КонецЕсли;
	
	Если Объект.ИмеетДетализацию Тогда
		
		Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда
			
			Элементы.СтраницаРасшифровка.Видимость = Истина;
			Элементы.СтраницаРасшифровкаМодуля.Видимость = Ложь;

		Иначе
			
			Элементы.СтраницаРасшифровкаМодуля.Видимость = Истина;
			Элементы.СтраницаРасшифровка.Видимость = Ложь;
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаРасшифровка.Видимость = Ложь;
		Элементы.СтраницаРасшифровкаМодуля.Видимость = Ложь;

	КонецЕсли;	
	
	//Если НЕ ОбПраво("ПравоВнедренца")=истина Тогда
	//	ЭтаФорма.ЭлементыФормы.ТекстЗапроса.ТолькоПросмотр=Истина;
	//	ЭтаФорма.ЭлементыФормы.Модуль.ТолькоПросмотр=Истина;
	//	ЭтаФорма.ЭлементыФормы.МодульР.ТолькоПросмотр=Истина;
	//	ЭтаФорма.ЭлементыФормы.КоманднаяПанельЗапрос.Доступность=ложь;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СобытияКомандФормы

&НаКлиенте
Процедура ВыполнитьКод(Команда)
	
	ТекстАлгоритмаСервер=РедакторКодаКлиент.ТекстКодаРедактора(ЭтотОбъект, "Сервер");
	
	СтруктураПередачи = Неопределено;
	ВыполнитьАлгоритмНаСервере(СтруктураПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйАлгоритм(Команда)
	
	ТекстАлгоритмаСервер="";
	УстановитьТекстРедактора("Сервер",ТекстАлгоритмаСервер);
	
КонецПроцедуры

#КонецОбласти


#Область Расшифровки

&НаКлиенте
Процедура СформироватьЗапросРасшифровки(Команда)
	
	ПараметрыФормы = Новый Структура("ТекстЗапроса", Объект.МодульРасшифровки);
	ПараметрыФормы.Вставить("ПараметрыЗапроса", ПараметрыРасшифровки);
	
	Результат = ОткрытьФорму("Обработка.МТ_КонсольЗапросов.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,,
	Новый ОписаниеОповещения("СформироватьЗапросЗавершение", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзРасшифроки(Команда)
	стОшибка = ПараметрыЗаполнитьИзЗапросаНаСервере("Расшифровка");
	
	Если ЗначениеЗаполнено(стОшибка) Тогда
		
		ПоказатьПредупреждениеКонсоли(стОшибка.ОписаниеОшибки);
		ТекущийЭлемент = Элементы.ТекстЗапроса;
		
		Если ЗначениеЗаполнено(стОшибка.Строка) Тогда
			Элементы.ТекстЗапроса.УстановитьГраницыВыделения(стОшибка.Строка, стОшибка.Колонка, стОшибка.Строка,
			стОшибка.Колонка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПроверитьНаСервере(ТабДок);
	
	ТабДок.Показать("Проверка");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере(ТабДок)
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда
		
		//ВыполнитьЗапросНаСервере(Объект.ТЗапроса, ТабДок);
		
		Построитель=Новый ПостроительОтчета;
		Попытка
			Построитель.Текст = Объект.ТЗапроса;
			Для Каждого ТекСтр из ПараметрыЗапроса Цикл
				Если ТекСтр.ЭтоВыражение Тогда
					Выполнить("Построитель.Параметры.Вставить("""+ТекСтр.Имя+""","+ТекСтр.Значение+")");
				Иначе
					Если ТекСтр.Имя="КонецПериода" Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,КонецДня(ТекСтр.Значение));
					Иначе
						Если ТекСтр.Список = Ложь Тогда
							Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение);
						Иначе
							Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение.Получить());
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Построитель.Выполнить();
			Рез=Построитель.Результат.Выгрузить();
			Значение=Рез.Итог("Значение"); 			
			
			Построитель.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
			Построитель.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
			Построитель.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
			//Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Построитель);
			//Построитель.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
			Построитель.ВыводитьЗаголовокОтчета = Ложь; 
			Построитель.Вывести(ТабДок);
			
			//	Таб.Показать("Результат запроса");
			
			Сообщить("Значение="+Значение);
			
		Исключение
			
			Сообщить(ОписаниеОшибки()); 
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеременныеСерверЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ПеременныеСервер.ТекущиеДанные.Список Тогда
		
		ТекущиеДанные = Элементы.ПеременныеСервер.ТекущиеДанные;
		
		СтандартнаяОбработка = Ложь;
		ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыЗапроса", Элемент.Родитель.ТекущаяСтрока, "Контейнер");
		
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтроки", ЭтаФорма, ПараметрыОповещения);
		
		ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, Заголовок, Значение, ТипКонтейнера", Объект, 
		"СписокЗначений", ТекущиеДанные.Имя, "СписокЗначений", 1);
		
		ИмяФормыРедактирования = "ПодборВСписок";
		
		ОткрытьФорму(ПолноеИмяФормы(ИмяФормыРедактирования), ПараметрыОткрытия, ЭтаФорма, Ложь, , ,
		ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмеетДетализациюПриИзменении(Элемент)
	
	Если Объект.ИмеетДетализацию Тогда
		
		Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Запрос Тогда
			
			Элементы.СтраницаРасшифровка.Видимость = Истина;
			Элементы.СтраницаРасшифровкаМодуля.Видимость = Ложь;
			
		Иначе
			
			Элементы.СтраницаРасшифровкаМодуля.Видимость = Истина;
			Элементы.СтраницаРасшифровка.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.СтраницаРасшифровка.Видимость = Ложь;
		Элементы.СтраницаРасшифровкаМодуля.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДетализацию(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ПроверитьДетализациюНаСервере(ТабДок);
	
	ТабДок.Показать("Проверка");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДетализациюНаСервере(ТабДок)
	
	Построитель=Новый ПостроительОтчета;
	Попытка
		Построитель.Текст = Объект.МодульРасшифровки;
		Для Каждого ТекСтр из ПараметрыРасшифровки Цикл
			Если ТекСтр.ЭтоВыражение Тогда
				Выполнить("Построитель.Параметры.Вставить("""+ТекСтр.Имя+""","+ТекСтр.Значение+")");
			Иначе
				Если ТекСтр.Имя="КонецПериода" Тогда
					Построитель.Параметры.Вставить(ТекСтр.Имя,КонецДня(ТекСтр.Значение));
				Иначе
					Если ТекСтр.Список = Ложь Тогда
						Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение);
					Иначе
						Построитель.Параметры.Вставить(ТекСтр.Имя,ТекСтр.Значение.Получить());
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		

		Построитель.Выполнить();
		Рез=Построитель.Результат.Выгрузить();
		//Значение=Рез.Итог("Значение");
		
		Построитель.РазмещениеИзмеренийВСтроках = ТипРазмещенияИзмерений.Вместе;
		Построитель.РазмещениеРеквизитовИзмеренийВСтроках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
		Построитель.РазмещениеРеквизитовИзмеренийВКолонках = ТипРазмещенияРеквизитовИзмерений.Отдельно;
		
		Построитель.ВыводитьПодвалОтчета=Истина;
		Построитель.ВыводитьОбщиеИтоги=Истина;
	   // Построитель.РазмещениеИтоговВСтроках = ТипРазмещенияИтогов.Подвал;
		Построитель.РазмещениеИтоговВКолонках = ТипРазмещенияИтогов.Подвал;
		//Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Построитель);
		//Построитель.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Классика);
		Построитель.ВыводитьЗаголовокОтчета = Ложь; 
		Построитель.Вывести(ТабДок);
		
		//	Таб.Показать("Результат запроса");
		
		//Сообщить("Значение="+Значение);
		
	Исключение
		
		Сообщить(ОписаниеОшибки()); 
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьМодульНаСервере(СтруктураПередачи)
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		
		КодАлгоритма = ПодготовленныйКодАлгоритма(ТекстАлгоритмаСервер, ПеременныеСервер);
		
		Если Не ЗначениеЗаполнено(СокрЛП(КодАлгоритма)) Тогда
			Возврат;
		КонецЕсли;
		
		РезультатыВыполнения = ВыполнитьАлгоритм(КодАлгоритма, ПеременныеСервер, СтруктураПередачи);
		
		Если РезультатыВыполнения.Успешно Тогда
			
			Сообщить(РезультатыВыполнения.ЗначениеМодуля);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодуль(Команда)		
	
	ТекстАлгоритмаСервер=РедакторКодаКлиент.ТекстКодаРедактора(ЭтотОбъект, "Сервер");
		
	СтруктураПередачи = Неопределено;

	ПроверитьМодульНаСервере(СтруктураПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМодульРасшифровки(Команда)
	
	ТекстАлгоритмаСерверРасшифровка=РедакторКодаКлиент.ТекстКодаРедактора(ЭтотОбъект, "СерверРасшифровка");
	
	Таблица=Новый ТабличныйДокумент;

	СтруктураПередачи = Новый Структура;
    СтруктураПередачи.Вставить("Таблица",Таблица);
    СтруктураПередачи.Вставить("Успешно",Ложь);
	
	ПроверитьМодульРасшифровкиНаСервере(СтруктураПередачи);
	
	Если СтруктураПередачи.Успешно Тогда

		СтруктураПередачи.Таблица.Показать("Проверка расшифровки");

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьМодульРасшифровкиНаСервере(СтруктураПередачи)
	
	Если Объект.ВидПоказателя=Перечисления.ИсточникПоказателяKPI.Модуль Тогда
		
		КодАлгоритма = ПодготовленныйКодАлгоритма(ТекстАлгоритмаСерверРасшифровка, ПеременныеСервер);
		
		Если Не ЗначениеЗаполнено(СокрЛП(КодАлгоритма)) Тогда
			Возврат;
		КонецЕсли;
		
		РезультатыВыполнения = ВыполнитьАлгоритмРасшифровка(КодАлгоритма, ПеременныеСервер, СтруктураПередачи);
		
		Если РезультатыВыполнения.Успешно Тогда
			
			СтруктураПередачи.Успешно = РезультатыВыполнения.Успешно;
			
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыполнитьАлгоритмРасшифровка(ТекстАлгоритма, Переменные, СтруктураПередачи)
	
	Успешно = Истина;
	ОписаниеОшибки = "";
	
	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Если Объект.ИтоговыеКолонки.Количество()=0 Тогда
		
		ЗаполнитьИтоговыеКолонки=Истина;
		
	Иначе 
		
		ЗаполнитьИтоговыеКолонки=Ложь;
		
	КонецЕсли;	
	
	Таблица = СтруктураПередачи.Таблица;
	ТаблицаРасшифровки=Новый ТаблицаЗначений;
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");

	М=ОбъектФормы.ПолучитьМакет("Макет");
		
	Попытка

		Выполнить (СокрЛП(ТекстАлгоритма));
		
		Таблица.НачатьАвтогруппировкуСтрок();
		
		Отст = М.ПолучитьОбласть("Шапка|Отступ");
		Таблица.Вывести(Отст,0);
		Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
			Обл=М.Область("R1C2");
			Обл.ШиринаКолонки=ТекКол.Ширина;
			ОблВыв=М.ПолучитьОбласть("Шапка|Колонка");
			ОблВыв.Параметры.Колонка= ТекКол.Заголовок;
			Таблица.Присоединить(ОблВыв);
		КонецЦикла;
	
		Для Каждого ТекСтр из ТаблицаРасшифровки Цикл
			Отст=М.ПолучитьОбласть("Строка|Отступ");
			Таблица.Вывести(Отст,1);
			Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
				Обл=М.Область("R2C2");
				Если ТипЗнч(ТекСтр[ТекКол.Имя])=Тип("Число") Тогда
					Обл.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Право;
				Иначе
					Обл.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Авто;
				КонецЕсли;
				
				Обл.ШиринаКолонки=ТекКол.Ширина;
				Если ТекКол.Имя = "ЗН" Или ТекКол.Имя = "ТН" Тогда
					ОблВыв=М.ПолучитьОбласть("Строка|КолонкаРазмещениеТекстаПереносить");
				Иначе	
					ОблВыв=М.ПолучитьОбласть("Строка|Колонка");
				КонецЕсли;	
				ОблВыв.Параметры.Значение=ТекСтр[ТекКол.Имя];
				Таблица.Присоединить(ОблВыв);
			КонецЦикла;
		КонецЦикла;
		
		Отст=М.ПолучитьОбласть("Итого|Отступ");
		Таблица.Вывести(Отст,0);
		Для Каждого ТекКол из ТаблицаРасшифровки.Колонки Цикл
			Обл=М.Область("R3C2");
			Обл.ШиринаКолонки=ТекКол.Ширина;
			Если ТаблицаРасшифровки.Количество()>0 Тогда
				Если ТипЗнч(ТаблицаРасшифровки[0][ТекКол.Имя])=Тип("Число") Тогда
					Обл.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Право;
				Иначе
				    Обл.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Авто;
				КонецЕсли;
			КонецЕсли;
			
			ОтборСтроки = Новый Структура;
			ОтборСтроки.Вставить("Колонка",ТекКол.Заголовок);
			
			НС=Объект.ИтоговыеКолонки.НайтиСтроки(ОтборСтроки);
			
			Если НС.Количество()<>0 Тогда
				Если НС[0].Осн Тогда
					Обл.ЦветФона=webЦвета.Оранжевый;
				Иначе
					Обл.ЦветФона=webЦвета.ТемноЗеленый;
				КонецЕсли;
			Иначе
				Обл.ЦветФона=webЦвета.Белый;
			КонецЕсли;

			ОблВыв=М.ПолучитьОбласть("Итого|Колонка");
						
			Если ЗаполнитьИтоговыеКолонки или Объект.ИтоговыеКолонки.НайтиСтроки(ОтборСтроки)<>Неопределено Тогда
				
				Попытка
					ОблВыв.Параметры.Итого=ТаблицаРасшифровки.Итог(ТекКол.Имя);
					
					Если ЗаполнитьИтоговыеКолонки Тогда 
					   СтрокаКолонки= Объект.ИтоговыеКолонки.Добавить();
					   СтрокаКолонки.Колонка=ТекКол.Заголовок;
					конецесли;

				Исключение
					ОблВыв.Параметры.Итого="";
				КонецПопытки;
				
			Иначе 
				ОблВыв.Параметры.Итого="";
			КонецЕсли;
			
			Таблица.Присоединить(ОблВыв);
		КонецЦикла;
		
		Таблица.ЗакончитьАвтогруппировкуСтрок();
		Таблица.ОтображатьЗаголовки=Ложь;
		Таблица.ОтображатьСетку=Ложь;
		Таблица.АвтоМасштаб=Истина;
		Таблица.ТолькоПросмотр=Истина;
        
	Исключение
		Успешно = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
	КонецПопытки;
	ОкончаниеВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("Успешно", Успешно);
	РезультатВыполнения.Вставить("ВремяВыполнения", ОкончаниеВыполнения - НачалоВыполнения);
	РезультатВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	
	Возврат РезультатВыполнения;
КонецФункции

&НаКлиенте
Процедура ПараметрыРасшифровкиТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ПараметрыРасшифровки.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипКонтейнера < 3 Тогда
		ТипЗначения = ТекущиеДанные.ТипЗначения;
	Иначе
		ТипЗначения = ТекущиеДанные.Контейнер;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыРасшифровки",
	Элементы.ПараметрыРасшифровки.ТекущаяСтрока, "ТипЗначения");
	ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтрокиРасшифровка", ЭтаФорма,
	ПараметрыОповещения);
	ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, ТипКонтейнера, Имя, ВЗапросРазрешено", Объект,
	ТипЗначения, ТекущиеДанные.ТипКонтейнера, ТекущиеДанные.Имя, Истина);
	ОткрытьФорму("Обработка.МТ_КонсольЗапросов.Форма.РедактированиеТипа", ПараметрыОткрытия, ЭтаФорма, Истина, , ,
	ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	// ОписаниеОповещенияОЗакрытииОткрываемойФормы

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыРасшифровкиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные.ТипКонтейнера > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыРасшифровки",
		Элемент.Родитель.ТекущаяСтрока, "Контейнер");
		ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтрокиРасшифровка",
		ЭтаФорма, ПараметрыОповещения);
		ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, Заголовок, Значение, ТипКонтейнера", Объект,
		ТекущиеДанные.ТипЗначения, ТекущиеДанные.Имя, ТекущиеДанные.Контейнер, ТекущиеДанные.ТипКонтейнера);
		
		Если ТекущиеДанные.ТипКонтейнера = 3 Тогда
			ИмяФормыРедактирования = "РедактированиеТаблицы";
		Иначе
			ИмяФормыРедактирования = "ПодборВСписок";
		КонецЕсли;
		
		ОткрытьФорму(ПолноеИмяФормы(ИмяФормыРедактирования), ПараметрыОткрытия, ЭтаФорма, Ложь, , ,
		ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ТипЗнч(ТекущиеДанные.Контейнер) = Тип("Структура") Тогда
		
		Если ТекущиеДанные.Контейнер.Тип = "МоментВремени" Или ТекущиеДанные.Контейнер.Тип = "Граница" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыРасшифровки",
			Элемент.Родитель.ТекущаяСтрока, "Контейнер");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтрокиРасшифровка",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Контейнер);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеГраницыМомента"), ПараметрыОткрытия, ЭтаФорма, Ложь, , ,
			ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли ТекущиеДанные.Контейнер.Тип = "Тип" Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыРасшифровки",
			Элемент.Родитель.ТекущаяСтрока, "КонтейнерКакТип");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтрокиРасшифровка",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, ТипЗначения, ТипКонтейнера", Объект, ТекущиеДанные.Контейнер,
			ТекущиеДанные.ТипКонтейнера);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеТипа"), ПараметрыОткрытия, ЭтаФорма, Истина, , ,
			ОписаниеОповещенияОЗакрытииОткрываемойФормы, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	Иначе
		Если ТипЗнч(ТекущиеДанные.Значение) = Тип("УникальныйИдентификатор") Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыОповещения = Новый Структура("Таблица, Строка, Поле", "ПараметрыРасшифровки",
			Элемент.Родитель.ТекущаяСтрока, "Значение");
			ОписаниеОповещенияОЗакрытииОткрываемойФормы = Новый ОписаниеОповещения("ОкончаниеРедактированияСтрокиРасшифровка",
			ЭтаФорма, ПараметрыОповещения);
			ПараметрыОткрытия = Новый Структура("Объект, Значение", Объект, ТекущиеДанные.Значение);
			ОткрытьФорму(ПолноеИмяФормы("РедактированиеУникальногоИдентификатора"), ПараметрыОткрытия, ЭтаФорма,
			Истина, , , ОписаниеОповещенияОЗакрытииОткрываемойФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
