#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Стандартная процедура настройки построителя отчета 
//
// Параметры
//  ИмяМакета  – строка – название макета
//  ИмяМакетаПараметров  – строка – название макета параметров
//
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	//ПолеОтбора=ПостроительОтчета.Отбор.Добавить("Менеджер","Менеджер","Менеджер");
	//ПолеОтбора.ВидСравнения=ВидСравнения.Равно;
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
//
// Параметры
//  ДокументРезультат – ТабличныйДокумент или ПолеТабличногоДокумента
//
// Возвращаемое значение:
//  Результат - ТабличныйДокумент
//
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт

	// Заменим представления, если установлен отбор по виду плана.
	ВернутьПотомВсеОбратно = Ложь;
	ЭлементОтбора = ПостроительОтчета.Отбор.Найти("ВидПланаКомпании");
	Если (ЭлементОтбора<>Неопределено) И (ЭлементОтбора.Использование) И (ЭлементОтбора.ВидСравнения=ВидСравнения.Равно) И (НЕ ЭлементОтбора.Значение.ЭтоГруппа) Тогда
		ВернутьПотомВсеОбратно = Истина;
		ВидПлана = ЭлементОтбора.Значение;
		
		// Меняем представления измерений строки.
		Если НЕ ВидПлана.ВидАналитикиПланирования1.Пустая() Тогда
			ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования1", "ПутьКДанным");
			Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
				ИзмерениеВидАналитики.Представление = "" + ВидПлана.ВидАналитикиПланирования1;	
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВидПлана.ВидАналитикиПланирования2.Пустая() Тогда
			ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования2", "ПутьКДанным");
			Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
				ИзмерениеВидАналитики.Представление = "" + ВидПлана.ВидАналитикиПланирования2;	
			КонецЕсли;
		КонецЕсли;
		
		// Теперь показатели.
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана1) Тогда
			Показатель = Показатели.Найти("ПоказательПлана1", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта1", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель1Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель1РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана1 + " (Отклонение в %)";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана2) Тогда
			Показатель = Показатели.Найти("ПоказательПлана2", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта2", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель2Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель2РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана2 + " (Отклонение в %)";
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ВидПлана.ПоказательПлана3) Тогда
			Показатель = Показатели.Найти("ПоказательПлана3", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (План)";
			
			Показатель = Показатели.Найти("ПоказательФакта3", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Факт)";	
			
			Показатель = Показатели.Найти("Показатель3Разница", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Отклонение)";
			
			Показатель = Показатели.Найти("Показатель3РазницаПроцент", "Имя");			
			Показатель.Представление = "" + ВидПлана.ПоказательПлана3 + " (Отклонение в %)";
		КонецЕсли;				
	Конецесли;
			
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат,, глПрава);
	
	Если ВернутьПотомВсеОбратно Тогда
		// Сменим представления обратно.	
		ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования1", "ПутьКДанным");
		Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
			ИзмерениеВидАналитики.Представление = "Вид аналитики планирования 1";	
		КонецЕсли;
		ИзмерениеВидАналитики = ИзмеренияСтроки.Найти("ВидАналитикиПланирования2", "ПутьКДанным");
		Если (ИзмерениеВидАналитики<>Неопределено) И (ИзмерениеВидАналитики.Использование) Тогда
			ИзмерениеВидАналитики.Представление = "Вид аналитики планирования 2";	
		КонецЕсли;
		
		
		Показатель = Показатели.Найти("ПоказательПлана1", "Имя");			
		Показатель.Представление = "Показатель плана 1";
		
		Показатель = Показатели.Найти("ПоказательФакта1", "Имя");			
		Показатель.Представление = "Показатель факта 1";
		
		Показатель = Показатели.Найти("Показатель1Разница", "Имя");			
		Показатель.Представление = "Показатель 1 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель1РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 1 (Отклонение в %)";
		
		Показатель = Показатели.Найти("ПоказательПлана2", "Имя");			
		Показатель.Представление = "Показатель плана 2";
		
		Показатель = Показатели.Найти("ПоказательФакта2", "Имя");			
		Показатель.Представление = "Показатель факта 2";
		
		Показатель = Показатели.Найти("Показатель2Разница", "Имя");			
		Показатель.Представление = "Показатель 2 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель2РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 2 (Отклонение в %)";
		
		Показатель = Показатели.Найти("ПоказательПлана3", "Имя");			
		Показатель.Представление = "Показатель плана 3";
		
		Показатель = Показатели.Найти("ПоказательФакта3", "Имя");			
		Показатель.Представление = "Показатель факта 3";
		
		Показатель = Показатели.Найти("Показатель3Разница", "Имя");			
		Показатель.Представление = "Показатель 3 (Отклонение)";
		
		Показатель = Показатели.Найти("Показатель3РазницаПроцент", "Имя");			
		Показатель.Представление = "Показатель 3 (Отклонение в %)";
	КонецЕсли;  

	Возврат Результат;
КонецФункции // ЗаполнитьНачальныеНастройки()

// Функция возвращает структуру форматирования полей
//
// Без параметров
//  
// Возвращаемое значение:
//  СтруктураФорматаПолей - структура
//
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяРегистра = "Продажи";
отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли