
&НаКлиенте
Процедура ПоказатьРезультат(Команда)
	
	ПолучитьРезультат().Показать("Пользователи");
	
КонецПроцедуры


Функция ПолучитьРезультат()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ЗначенияПоказателей.Таблица КАК Таблица
		|ИЗ
		|	РегистрСведений.БТ_ЗначенияПоказателей КАК БТ_ЗначенияПоказателей
		|ГДЕ
		|	БТ_ЗначенияПоказателей.Период = &Период
		|	И БТ_ЗначенияПоказателей.Показатель = &Показатель
		|	И БТ_ЗначенияПоказателей.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", 	Запись.Организация);
	Запрос.УстановитьПараметр("Период", 		Запись.Период);
	Запрос.УстановитьПараметр("Показатель", 	Запись.Показатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ВыборкаДетальныеЗаписи.Таблица.Получить());       
		Построитель.Вывести(ТабДокумент);

	КонецЕсли;
	
	Возврат ТабДокумент;

КонецФункции
