
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.Период = Дата('00010101') Тогда
			
			Объект.Периодичность = Перечисления.Периодичность.Месяц;
			Объект.Период = НачалоМесяца(ТекущаяДата());
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
			
			Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			
		КонецЕсли;
		
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Объект.Автор = ПараметрыСеанса.Пользователь;
		
	КонецЕсли;	
	
	СписокЗначения=Новый Массив;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗначения);

	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма,Объект.Период,Объект.Организация,Объект.ПодразделениеКомпании);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодичностьПриИзменении(Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
	    Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.Период);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.Период);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.Период)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.Период)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.Период=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.Период=НачалоМесяца(КонецКвартала(Объект.Период));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.Период<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.Период)-3;
			КонГод=Год(Объект.Период)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.Период=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.Период = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Объект.Период = ДобавитьМесяц(Объект.Период, Направление);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Направление>0 Тогда
			Объект.Период=ДобавитьМесяц(Объект.Период,3);
		Иначе
			Объект.Период=ДобавитьМесяц(Объект.Период,-3);
		КонецЕсли;
		
		ДатаПланирования = Формат(Объект.Период,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Направление>0 Тогда
			Объект.Период=ДобавитьМесяц(Объект.Период,12);
		Иначе
			Объект.Период=ДобавитьМесяц(Объект.Период,-12);
		КонецЕсли;
		
		ДатаПланирования=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		
		Объект.Период=НачалоМесяца(КонецГода(Объект.Период));
		ДатаПланирования=Формат(Год(Объект.Период),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		
		Объект.Период=НачалоМесяца(КонецКвартала(Объект.Период));
		ДатаПланирования=Формат(Объект.Период,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли ПустаяСтрока(Объект.Периодичность) Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	Иначе
		
		Сообщить("Неверная периодичность!");
		Объект.Периодичность="";
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.Период);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорректировкиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Корректировки.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ТекущиеДанные.Должность = ТекущиеДанные.Сотрудник.Должность;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КорректировкиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Объект.ДокументОснование = ПредопределенноеЗначение("Документ.РасчетВыполненияKPI.ПустаяСсылка") Тогда
		
		СписокСотрудников = ПолучитьСписокСотрудниковПоНачислениям();
		
		Если СписокСотрудников.Количество()>0 Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Ссылка", СписокСотрудников);
			
			ПараметрыВыбора = Новый Структура;
			ПараметрыВыбора.Вставить("Отбор",ПараметрыОтбора);
			ПараметрыВыбора.Вставить("РежимВыбора",Истина);
	
			ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыВыбора, ЭтаФорма);
			
			//ФормаОтбора = Справочники.Сотрудники.ПолучитьФормуВыбора(,Элемент);
			//ФормаОтбора.Отбор.Ссылка.Использование = Истина;
			//ФормаОтбора.Отбор.Ссылка.ВидСравнения = ВидСравнения.ВСписке;
			//ФормаОтбора.Отбор.Ссылка.Значение = СписокСотрудников;
			//ФормаОтбора.Открыть();
			
		КонецЕсли;
		
	Иначе
		
		СтандартнаяОбработка = Истина;
		
	Конецесли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСотрудниковПоНачислениям()
	
	Запрос=Новый Запрос();
	Запрос.УстановитьПараметр("Регистратор", Объект.ДокументОснование);
	Запрос.Текст = "ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Должность,
	|	СУММА(Начисления.Сумма) КАК СуммаНачислено
	|ИЗ
	|	РегистрСведений.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|	И Начисления.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.Должность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	Рез= Запрос.Выполнить().Выгрузить();
	
	СпСот=Новый СписокЗначений;
	СпСот.ЗагрузитьЗначения(Рез.ВыгрузитьКолонку("Сотрудник"));

	Возврат СпСот;
	
КонецФункции	


&НаКлиенте
Процедура КорректировкиСуммаКорректировкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Корректировки.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		СуммаКорректировкиВМинус = 0;
		Если ТекущаяСтрока.СуммаКорректировки<0 Тогда
			СуммаКорректировкиВМинус = ТекущаяСтрока.СуммаКорректировки*-1
		КонецЕсли;
	
		Если СуммаКорректировкиВМинус > (ТекущаяСтрока.Премия+ТекущаяСтрока.Мотивация) Тогда 
			
			ТекущаяСтрока.СуммаКорректировки = 0;	
			ТекущаяСтрока.Результат = 0;
			
			Сообщить("Сумма корректировки не может привышать сумму премии с мотивацией!");
			
			Возврат;
			
		КонецЕсли;
		
		ТекущаяСтрока.Результат = ТекущаяСтрока.СуммаНачислено + ТекущаяСтрока.СуммаКорректировки;
		
		Если ТекущаяСтрока.СуммаНачислено <=0 Тогда 
			
			ТекущаяСтрока.СуммаКорректировки = 0;	
			ТекущаяСтрока.Результат = 0;
			
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Не заполнено поле ""Документ-основание"".");
		Возврат;
	КонецЕсли;	
		
	Если Объект.Корректировки.Количество() > 0 Тогда

		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаЗаполнитьЗавершение", ЭтотОбъект), "Табличная часть не пустая. Очистить табличную часть?",РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
	КонецЕсли;	
	
	КомандаЗаполнитьФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли; 	
	
	Объект.Корректировки.Очистить();
	
	КомандаЗаполнитьФрагмент();

КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьФрагмент()
	
	Организация = Объект.ДокументОснование.ПодразделениеКомпании.Организация;
	ПодразделениеКомпании = Объект.ДокументОснование.ПодразделениеКомпании;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Объект.ДокументОснование);
	Запрос.Текст = "ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Должность КАК Должность,
	|	СУММА(Начисления.Сумма) КАК СуммаНачислено,
	|	Начисления.Оклад КАК Оклад,
	|	Начисления.Премия КАК Премия,
	|	Начисления.Мотивация КАК Мотивация
	|ИЗ
	|	РегистрСведений.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Регистратор
	|	И Начисления.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.Должность,
	|	Начисления.Оклад,
	|	Начисления.Премия,
	|	Начисления.Мотивация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = Объект.Корректировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла;	
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечать(Команда)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	КомандаПечатьНаСервере(ТабличныйДокумент);   
	ТабличныйДокумент.Показать("Ведомость расчета выполнения KPI");
	
КонецПроцедуры

&НаСервере
Процедура КомандаПечатьНаСервере(ТабличныйДокумент)
	
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
    ТабличныйДокумент = ОбъектФормы.ПечатьВедомости();
	
КонецПроцедуры

